{
    "id": 1477,
    "video_id": "1YWi8-SdwPg",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Colin Moriarty's Top 10 Favorite Games of 2015 - Kinda Funny Gamescast Ep. 52 (Pt. 2)",
    "description": "Colin Moriarty talks about his top 10 favorite games of 2015.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1452607200,
    "duration": 1519,
    "transcript_chunks": [
        {
            "text": "This episode's brought to you by Loot Crate, the monthly subscription box for geeks, gamers, and pop culture nerds. We want to believe with the revival of The X-Files that we've all been waiting for. There's never been a better time for an invasion, an alien invasion that is packed with the thrill of an extraterrestrial encounter. This month's Loot Crate features exclusive items from The X-Files, Alien, The Fifth Element, and Space Invaders, plus some classic Sci-Fi goodies. We can tell you this, the loot is out there. You only have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate. And when the cutoff happens, that's it, it's over, Jack. So go to lootcrate.com/kfgames and enter code KFAM to save $3 on your new subscription today. Topic two, sorry Colin, yeah, what are your top 10 favorite games in 2015? Well, I have my 10, but then I also have eight honorable mentions. Fuck you. You can do two honorable mentions. No, I'm doing all of them. The host do something about. I bet my list goes",
            "start": 0.08
        },
        {
            "text": "games in 2015. Well, I have my 10, but then I also have eight honorable mentions. Fuck you. You can do two honorable mentions. No, I'm doing all of them. The host do something about. I bet my list goes just as quick. I just want, I want to mention these games. I'm going to do it quick. Uh, my honorable mentions for different reasons that didn't make my list. Uh, I want to give a shout out to Bloodborne. Uh, played Bloodborne for about 20 hours, maybe a little bit more. Uh, in the beginning of the year, I was interrupted by some travel. It's one of those games I've said before that you, I can't stop playing and then get back into it and I would have to start again. But I really enjoyed my time with it and it was the first time I really got a Souls game and I'd played Demon's Souls and especially Dark Souls pretty extensively. Um, I will say as one of the kind of negative caveats of Bloodborne is that it has a lot of great fans. It also has a very cringeworthy fan base, a hardcore fan base that needs to kind of get",
            "start": 47.12
        },
        {
            "text": "um, I will say as one of the kind of negative caveats of Bloodborne is that it has a lot of great fans. It also has a very cringeworthy fan base, a hardcore fan base that needs to kind of get over itself, parts of it. Um, with the way they talk about the game and how like you're an idiot if you don't like it or you're an idiot if you don't play it and stuff like that. Like they really need to like kind of chill on that. Um, but um, I think overall FromSoftware did a really nice job with the game. It was the first time I really got a Souls game. Um, and I really do, it's really one of those games that I want to get back to. I think it's uh, really, really fun. But do you think you ever will? I think I probably will, yeah. I think it's one of those games um, that it's probably will. Fallout 4, I want to give a shout out to. I, I was disappointed in it just in the sense that I wanted that Fallout 3 feeling again. I think that might have been an unfair way for me to play, go in and play it. I played it for about 25 hours. I",
            "start": 84.6
        },
        {
            "text": "to. I, I was disappointed in it just in the sense that I wanted that Fallout 3 feeling again. I think that might have been an unfair way for me to play, go in and play it. I played it for about 25 hours. I don't know that I'll ever uh, get back to it uh, anytime soon. But I'd like to maybe when the DLC comes out. I think that um, uh, Fallout 4 is just more Fallout 3 and I wanted something a little different. That's why I didn't make, that's why I wasn't really in into it and why I think that uh, it's a game that I'll get back to, but I just maybe my expectations were too high for uh, Heroes of Loot. I think is the most casual um, fan base um, or fan base casual uh, game that I played all year. It's actually an iOS Port. I played it on Vita and I really only played it for like two days on my Vita, but it's just one of those games. I was going through my trophies and I was like, you know, I really liked this game. It's really quite um, addicting. Yeah, just for a little bit. It's simple. Mhm. It's kind of silly. It's",
            "start": 121.44
        },
        {
            "text": "one of those games. I was going through my trophies and I was like, you know, I really liked this game. It's really quite um, addicting. Yeah, just for a little bit. It's simple. Mhm. It's kind of silly. It's very, I don't know, I just wanted to give it a shout. #IDARB uh, on Xbox. We played that game quite a bit um, and uh, on Xbox One and I, I really quite enjoyed that game. I think that game was fun as hell. It's also strangely good at it, which made me feel pretty nice. #IDARB got the cut from my list. It was there and then I, I moved it out for for something else. But well, if you would have done 19 on her fit. Uh, Mario Maker, I want to give a shout out to just because I would never mess with the the tools. But we, especially during our 24-hour live stream for the Big Beautiful Kids um, that we did in October or November, uh, I uh, I just was quite enamored by it. I think it's a brilliant idea. I think it's a game that has legs. I think they'd be smart to bring it to NX. Um, I think they probably will and uh, it's just I",
            "start": 162.36
        },
        {
            "text": "uh, I uh, I just was quite enamored by it. I think it's a brilliant idea. I think it's a game that has legs. I think they'd be smart to bring it to NX. Um, I think they probably will and uh, it's just I would love to see other companies learn from this. I think Nintendo can learn from it too in the sense that we could get a Zelda Maker, we could get all these other games. But and I would love to see a Zelda Maker in this in the spirit of the '90s RPG Maker or Fighter Maker, whatever, where it's like you can really get kind of down and dirty with it. Um, but uh, a Mega Man Maker, a Castlevania Maker, some of these, all Sonic Maker, if you're into that kind of stuff like that. It there was something really cool about it. Uh, Project Root, I want to give a shout out to. I don't quite know why I like this game because I don't think that it's it's uh, it doesn't have the finest production values. It doesn't, it's not the the thing that stands out the most. But similar to Jamestown+, which was another game I really",
            "start": 205.72
        },
        {
            "text": "I don't think that it's it's uh, it doesn't have the finest production values. It doesn't, it's not the the thing that stands out the most. But similar to Jamestown+, which was another game I really kind of fell in love with this year um, for weird reasons. It's just an old school arcade shooter and it just feels good to play those games. And I when I was playing it, I was like, I don't quite know why I like this, but I, I, I played it all the way through anyway. Super Stardust Delta uh, I want to give a shout out to because it's just more Stardust. I think that's fantastic. And Wolfenstein: The Old Blood is another game I want to give a two before I give my um, get into the top 10. The only reason that I, I didn't put it on my list because I didn't beat it. I don't know how it ends. Um, but man, I love what MachineGames has done with that series and I and I, I've actually been, I restarted it recently and just been playing it again. It's just fucking really fun. It's just a fun game. All right, top 10. See how",
            "start": 243.08
        },
        {
            "text": "MachineGames has done with that series and I and I, I've actually been, I restarted it recently and just been playing it again. It's just fucking really fun. It's just a fun game. All right, top 10. See how quickly I got through that. I got through all of that. It doesn't matter how quickly. I don't care about the time. I care about you deluding the list to not meaning anything. You just gave me your top 18 games of the year. I didn't, I didn't, I told you will though, combined. Okay. Um, number one, uh, predictably, Dying Light. Uh, and we're going in alphabetical order. Um, I think that I've said everything I needed to say about Dying Light. I think people know ad nauseam how I feel about the game. It's not a game I beat, but it's a game I spend a lot of time with because um, I was just kind of obs, there was a few weeks where I was really obsessed with it. Played it a lot, just really went down the rabbit hole, explored, took my time, did side quests, um, tried different things in combat, tried to um, make new weapons. I",
            "start": 275.04
        },
        {
            "text": "where I was really obsessed with it. Played it a lot, just really went down the rabbit hole, explored, took my time, did side quests, um, tried different things in combat, tried to um, make new weapons. I just, I think that it's just a really good game and I, I, I'm really happy for them over uh, over there at Techland um, that they moved on to something. It was dangerous and probably felt a little weird for them even though it's another zombie game. But everything really kind of come together, uh, came together for it. Um, and I just think it's, I, I don't want to say it's criminally underplayed because it sold millions, millions of copies. So I, I think people played it. Um, but I think that because of the when it came out and the games that people really enjoyed since then, like Metal Gear for instance, I think that people have forgotten that it was really good. I think it would have been cannibalized if came out in the fall. I mean, we wouldn't feel the same way about it. But I think it was the first like punch in",
            "start": 318.2
        },
        {
            "text": "people have forgotten that it was really good. I think it would have been cannibalized if came out in the fall. I mean, we wouldn't feel the same way about it. But I think it was the first like punch in the face this year and I really, I really enjoyed it a lot. Uh, Mad Max uh, is number two. Um, you guys didn't play it, so I, I, I won't talk too much about. And again, this is a game I kind of talked about quite a bit. But I think Mad Max um, showed what an open world can be when it's depopulated and empty. And I know that that's like a weird thing. Like we talk about dense games and like Fallout or The Witcher where these games have a lot in them and a lot of life and a lot of boisterous characters and things to do in them. Mad Max has a lot of things to doing them, but there's like no one in the world and there's just remnants of what was in the world. It's it's it's eerie to um, go through a desert that was once an ocean with ships just abandoning it and going through the ships and finding old pictures of",
            "start": 358.68
        },
        {
            "text": "just remnants of what was in the world. It's it's it's eerie to um, go through a desert that was once an ocean with ships just abandoning it and going through the ships and finding old pictures of people's lives before the the the fall of man and and turning it around and reading little things, people notes, people and like how one of the things in terms of storytelling that I thought Mad Max did really well was it really showed the decay of humanity in that in between period through the notes and the pictures that you found. So there's a real world and when everything's normal like it is now for us today and then there's like the decrepit Mad Max world that we know um, after really the first movie and they show the time in like the first few years of like when people are really starting to lose their shit and people are kind of still holding on to um, why things were so good but how they can't be good anymore and and just slowly coming to terms with the fact that they're out of or they're",
            "start": 398.68
        },
        {
            "text": "their shit and people are kind of still holding on to um, why things were so good but how they can't be good anymore and and just slowly coming to terms with the fact that they're out of or they're out of fuel or they can't move or their kids are being kidnapped or whatever, whatever. I don't weird things like that where it's like there's people are in danger and all this kind of stuff. And I think that Avalanche deserves a lot of credit for that game. I think that that game is is underrated. I understand that the hand-to-hand combat is not really people's bag. Um, I always, I always talk about how Batman: Arkham Knight's combat is really boring to me and and kind of one-dimensional and shallow. And I really feel that way. Mad Max is even worse because it's it's predicated on the same thing. Uh, but I do say that that car combat is is really special. Uh, number three, Mega Man Legacy Collection. Um, this is a just a very thoughtful grouping of games of great games. I think that all six of those games",
            "start": 438.8
        },
        {
            "text": "I do say that that car combat is is really special. Uh, number three, Mega Man Legacy Collection. Um, this is a just a very thoughtful grouping of games of great games. I think that all six of those games, especially I would say two through six, are maybe superior to almost everything I've had on my list. Um, but these are games we've played before and um, we're talk, we talk a lot about should games stay the same or should they change? Um, Assassin's Creed for instance, is an example of a game that uh, has changed mildly, but it stayed the same. We don't quite understand why they haven't fixed the gameplay. Maybe some people feel that way, franchise fatigue. And but there's time, times when I think a game nails the way it feels and the way it plays. Um, and that's why you add these games in six years, just one after the other. They're easier to make than the games today too, of course. Um, but uh, they're always going to be timeless and they're always going to be good. And I like how they they ported these um,",
            "start": 474.76
        },
        {
            "text": "after the other. They're easier to make than the games today too, of course. Um, but uh, they're always going to be timeless and they're always going to be good. And I like how they they ported these um, over with the care enough to basically make an emulation of the games or an emulator that plays the games as they were. So they're not ports of games, they're not cleaned up. The slowdown still there, the flicker still there, a lot of problems um, technical problems that are they the challenge mode and stuff, right? Made a little bit different. Yeah. And then there's the challenge mode, which I think is um, uh, quite cool and really fucking hard. I think it really destroyed people. You look at the trophy list for it, like a lot of people don't have those trophies. Um, and uh, so yeah, the challenge mode was cool. And and basically they just figured out a way to write code in the emulator to just pick out parts of games um, and string them together. So you can play Stone Man stage for a little while, Mega Man 5, and",
            "start": 518.68
        },
        {
            "text": "and basically they just figured out a way to write code in the emulator to just pick out parts of games um, and string them together. So you can play Stone Man stage for a little while, Mega Man 5, and then you get transported back to Elec Man stage, Mega Man 1. Then you're fighting Quick Man for Mega Man and all these kinds of things. It's it's really quite ingenious. I, I, I think that that collection was good. I think it was affordable. Um, it would have been cool to get 7, 8, 9, and 10, but due to the nature of the way that they were reporting the games, that's not possible. The presentation was on point for sure. Like everything about it, like I think the, I like that you have the options of the borders, turning them on and off and simple things. But it's like that's the type of thought that needs to be put into these collections. You're putting a game out for the millionth time, you know? Agreed. Uh, Rocket League uh, is next. Uh, Rocket League is borderline my game of the year. I'm not quite sure what I would because",
            "start": 553.76
        },
        {
            "text": "collections you're putting a game out for the millionth time, you know? Agreed. Uh, Rocket League uh, is next. Uh, Rocket League is borderline my game of the year. I'm not quite sure what I would because we're alphabetical order, you know, we, I guess we'll figure out like how we choose a game of the year if we will do that because we're not beholden to the old style, the old media style of these are our nominees and these are. I don't want to fucking do that, boring. Um, but Rocket League, I think comes closest to uh, what I was looking for in terms of a new and different kind of experience because I didn't really play the original game on PS3. Um, and Rocket League was another one of those games similar to Shovel Knight where I was positive this game was going to be huge. Like the first time I saw it, I was positive. And I remember talking to Greg about it. I was like, this game is going to be this, be gigantic. Um, and it was because it's just fucking fun and it's and it runs well and it's got workable online",
            "start": 585.16
        },
        {
            "text": "positive. And I remember talking to Greg about it. I was like, this game is going to be this, be gigantic. Um, and it was because it's just fucking fun and it's and it runs well and it's got workable online, which I played quite a bit. Uh, it's got its own single player season mode to keep you kind of engaged, uh, if you want to play by yourself against varying uh, strengths of AI. A lot of unlockables and a nice loop there in terms of just unlocking things and and things unlock randomly. So you can't really kind of gauge what you're going to get next, which I think is fun. Everyone wanted that Team Fat flag. I remember when Rocket League came out because our Team Fat is is um, is in it. And people like, how do I unlock the Team Fat flag? I'm like, you unlock first, you're going to unlock at last, like anywhere in between. Um, but I think Rocket League is just a rock solid game and I think they deserve it. Psyonix um, uh, or Psyonix rather, not Psyonix, uh, Psyonix. Psyonix doesn't exist anymore. Psyonix um, they came back from the",
            "start": 625.2
        },
        {
            "text": "but I think Rocket League is just a rock solid game and I think they deserve it. Psyonix um, uh, or Psyonix rather, not Psyonix, uh, Psyonix. Psyonix doesn't exist anymore. Psyonix um, they came back from the dead to make this one game. They deserve an incredible amount of credit for making a fun, dynamic game basically on the side while they were doing contract work for games like Mass Effect. Um, and I was so happy to hear that they spent about $2 million making it and they made $50 million. Mhm. Um, so good for them. I mean, they did it, man. I think that's the the thing is the fact that everyone is playing that game and still is. Yeah. And it's just like again, going back to the Twitter thing because that's kind of like what really matters. It's like we talking about all these Blockbuster Games. What are people talking about? What are people going back to? And similar to Mario Maker, I think Rocket League's one of those things where it has, it got its claws into people and it's not leaving. Sure. Like that's a",
            "start": 661.72
        },
        {
            "text": "talking about what are people going back to. And similar to Mario Maker, I think Rocket League's one of those things where it has, it got its claws into people and it's not leaving. Sure. Like that's a Smash Bros. Style game, you know, where it's just people are just going to play forever. Uh, next on my list and we have different rule sets, which is fine. I'm, I'm counting Shovel Knight because I think it's most at home on Vita. Um, and uh, that's when I, that's where I played it. I platinumed it. This was, I, I beat the game a lot on Wii U and 3DS and and PC, not so much on 3DS, but on Wii U and and PC. Um, we got it early this year. It's still a master class in gaming. Yacht Club knows exactly what they're doing. I won't belabor the point on that game anymore because we talked a little bit about it already. But uh, it is right at home on Vita. That is where the game belongs. That's where I beat it. And uh, you know, ah, just it's just so good. The Witcher 3 um, on my list. Interesting. This is a game that um, you talked",
            "start": 702.16
        },
        {
            "text": "uh, it is right at home on Vita. That is where the game belongs. That's where I beat it. And uh, you know, ah, just it's just so good. The Witcher 3 um, on my list. Interesting. This is a game that um, you talked shit about nonstop. Yeah. And and and I still think that it's it's too dense. I don't, I don't think it's this, you know, masterpiece at all. Um, but I do think it's great. And I think that this was the game I played the most this year by far. I played it for about 60 or 70 hours. Um, which would have been enough time to have beaten even most open world RPGs, maybe even twice. Um, and I want to give it credit for a few reasons. This was a game that I had to reflect a lot on and we and we and we did and and I had time to think about it um, over the months since it's come out, six months or so since I even played it. And it's and that's not quite true, maybe four or five months. But it's one of those games that similar to Dying Light, as we talked about with Techland, uh, the studio delivered a game that I don't",
            "start": 741.36
        },
        {
            "text": "it. And it's and that's not quite true, maybe four or five months. But it's one of those games that similar to Dying Light, as we talked about with Techland, uh, the studio delivered a game that I don't think we were thought they were capable of. And it's a game that has a lot of love and thought put into it. It's beautiful. Um, it's it's thoughtful. It's it's it's got some good voice acting. And um, I don't know, I think that the gameplay maybe left a little bit to be desired for me. I think that there's way too much shit in the game for a player like me. I just can't ignore that stuff. I feel like I'm not getting the full experience. I feel like I know a lot of people like to just run through and do the main quest in a lot of those games. I just can't play games like that. It's just not not the way I play. Um, which is why sometimes I desire a more linear experience. Um, but I think that The Witcher 3 deserves credit. Um, not my game of the year, but but certainly one of the better games I played this year and",
            "start": 790.64
        },
        {
            "text": "um, which is why sometimes I desire a more linear experience. Um, but I think that The Witcher 3 deserves credit. Um, not my game of the year, but but certainly one of the better games I played this year and uh, really excited to see what they do um, with uh, you know, their next game and and and The Witcher will continue as well um, in the future. So interested to see what they do there. Uh, maybe another candidate for my favorite experience of the year is 3/4 Home. Um, I played it on Vita. It's also available on PC and PS4 and other other platforms. Uh, similar to Journey, it was one of those games I will never play again. There's no need reason to play it again. And and it was an emotional uh, I know, an emotional experience. It really was a kind of a gut punch for me in some ways. It's I don't want to ruin the story too much, but it's about a a girl, teen, you know, late teens, early 20s, and her relation, her relationship really with her family um, experienced largely through a telephone call she has with her family while",
            "start": 833.84
        },
        {
            "text": "much, but it's about a a girl, teen, you know, late teens, early 20s, and her relation, her relationship really with her family um, experienced largely through a telephone call she has with her family while she's driving. Um, and uh, it just hit home for me. I really loved it. I really, really loved it. I was so glad that I played it. Um, it wasn't a game that I was excited about and I remember we did a let's play for it and we kind of experienced. I was like, I've seen enough. But I really went back and played it again. And I, I think that it's worth like on a quiet Friday night, Saturday night, Sunday night, whatever, whatever, you know, day, night, what you want. Like it's a game, just download and play it. Just give it like an hour or two and just play it. And I really think you'll like it. My question for you about it is when you, when you beat Journey, you walked away from Journey, never touched it again. When you beat 3/4 Home, did you go back and get the rest of the trophies? Yeah, I did. Okay, me too. Because most of",
            "start": 882.8
        },
        {
            "text": "is when you, when you beat Journey, you walked away from Journey, never touched it again. When you beat 3/4 Home, did you go back and get the rest of the trophies? Yeah, I did. Okay, me too. Because most of them came like in some sort of system. It was super easy. Yeah, to jump around and get. Yeah, I know, which is and and what was interesting was that that that playing that those scenes at the bus stop and stuff like that um, which is kind of a separate part of the game really expanded the story and actually made it even more sad. Exactly. So I recommend 3/4 Home. You should check that game out. Uh, Uncharted: The Nathan Drake Collection. I, I include on here uh, just really three fantastic games. Uh, I think three is better than two. I know that that's a, that's a, that's a minority opinion. But um, not here at this t, at this table. I mean, it's still a minority. But uh, wait, no, that's not how it works. Actually, no, when there's more than one, that's the majority. Um, I'm sorry, I didn't mean to be mean. No, it's okay.",
            "start": 922.64
        },
        {
            "text": "this t, at this table. I mean, it's still a minority. But uh, wait, no, that's not how it works. Actually, no, when there's more than one, that's the majority. Um, I'm sorry, I didn't mean to be mean. No, it's okay. So I, I think that it, what can we say about Uncharted that that hasn't already been said? It's these games are fantastic. They need, they must be played. Um, and some people have problems with the finicky kind of controls if you're not used to kind of third person shooters. And and I, I understand that they're better third person shooters. They're third person shooters that I like more on a gameplay level for sure. I, I think Vanquish is one of my favorites for instance, or Gears. Um, but uh, storytelling wise, pacing, set pieces, uh, twists and turns and weirdness, um, that that kind of Indiana Jones feel. I don't know, I don't, you don't really get much better than Uncharted. And that really made me excited for Uncharted 4. And I platinumed one and two again. So I have five Uncharted platinums now. Very nice. Uh,",
            "start": 960.6
        },
        {
            "text": "know I don't you don't really get much better than Uncharted and that really made me excited for Uncharted 4 and I platinumed one and two again so I have five Uncharted platinums now very nice uh Until Dawn um I would say biggest surprise but we kind of knew it was going to be good uh but it built slowly and that was the thing yeah we we had Rumblings and all this different stuff but it was that when we first saw that game it was a Move title like okay and then when it resurfaced like that seems cool and then we played it and we did that let's play on that preview build and it was like yeah frame rate's kind of weird and then they fixed that even yeah uh I think Until Dawn is uh a phenomenal game I would call it the best exclusive on PS4 this year and not that there's like much competition in terms of volume um but it's it is a better Quantic Dream game than Quantic Dream really made which I think is interesting and I think that it's a game it's it's proof that it it gives me hope for the",
            "start": 1001.8
        },
        {
            "text": "terms of volume um but it's it is a better Quantic Dream game than Quantic Dream really made which I think is interesting and I think that it's a game it's it's proof that it it gives me hope for The Last Guardian in weird ways because it's proof that a game can can exist for a long time and even be reworked and remade completely which Until Dawn was and be really good usually when a game is in development for a long time it could it could like with Final Fantasy XV it could it could be bad yeah not that I'm saying Final Fantasy XV is gonna be bad as I said before I have no I have no doubt that it's gonna be at least good um 015 it's happening I hope so just for everyone's sake so I can stop hearing about it um but for me it's it was an example of like we saw this game years ago um at Comic-Con I want to say five four or five years ago now uh running PlayStation Move game and it was radically different from what we what we ended up with and I like that they were smart enough at Sony, Shuhei",
            "start": 1041.28
        },
        {
            "text": "I want to say five four or five years ago now uh running PlayStation Move game and it was radically different from what we what we ended up with and I like that they were smart enough at Sony, Shuhei and those guys to kind of be like you know let's move this PS4 let's get rid of the motion controls and like let's really dig down on why this game's special I was surprised that they didn't advertise it more um that was one a huge problem for me uh in terms of like I don't think they quite understood what they had I think that they felt burned by The Order: 1886 and and I think that they which was not a good game at all and I think that they kind of conflated the way people would feel about both of these games being kind of second party exclusives but I think that they added gold with Until Dawn I think that they kind of gave it short shrift I think they probably should have released it closer to Halloween or at least given it another push so um it's a fantastic game it's one I recommend I",
            "start": 1088.8
        },
        {
            "text": "I think that they kind of gave it short shrift I think they probably should have released it closer to Halloween or at least given it another push so um it's a fantastic game it's one I recommend I think it's a fun party game it's fun to play with people it's fun there's replay value there and I agree with what you were saying about it before in the sense that this is obviously going to be an IP they're going to make a sequel I don't think there's any chance of the sequel including the same characters the same story I just think that they can make this game every other year um they've already announced it Until Dawn: Rush of Blood yeah Rush of Blood which is which honestly like it's not what we want that's a fun game I don't know if you guys it's entirely yes it's very very very fun one out of all the VR games that I've played it's the most gamey and it's cool okay it reminds me of arcade games does it remind you of that thing you guys do at uh Disneyland when you go in the Andy thing",
            "start": 1126.32
        },
        {
            "text": "of all the VR games that I've played it's the most gamey and it's cool okay it reminds me of arcade games does it remind you of that thing you guys do at uh Disneyland when you go in the Andy thing you're like yeah like Buzz Light and stuff definitely so Until Dawn I mean you guys you guys know what it's all about I I I think that you know I think it's a game for many different people I think it's a game casual gamers can play I think it's a hardcore Gamers game I think it's there's no fail State much like a Quantic Dream game like Heavy Rain and the game just keeps going um so you can theoretically not really do anything in at all except for move your character and kind of go from point A to point B but I thought the writing was really clever I think that the writing was really lost on some people I think that people were like well it's weird and it's bad I'm like dude it's supposed to be a **** teen horror movie and I know that some people looked at that as being like well that's a",
            "start": 1158.48
        },
        {
            "text": "people I think that people were like well it's weird and it's bad I'm like dude it's supposed to be a **** teen horror movie and I know that some people looked at that as being like well that's a cop out because that protects them from any legitimate sorts of um uh debate about if if if the writing's good or or or you know things of this nature I'm like let's not think about it too deeply I mean no but even more than that though it's like it's just because something isn't great doesn't mean that it's easy to make something not great like when that's the goal you you needs to be good writing to make something that hits that tone you know like at '90s horror movie like a lot of the twists that happened Until Dawn they're bad but that's the point yeah that is the point and I get that it protects them from from you know uh controversy in terms of like well this is bad this is bad and I'm like well it's not supposed to be serious you know it's it's a **** teen horror movie it's a",
            "start": 1195.28
        },
        {
            "text": "it protects them from from you know uh controversy in terms of like well this is bad this is bad and I'm like well it's not supposed to be serious you know it's it's a **** teen horror movie it's a slasher film it's stupid but that was why it was fun it doesn't since it's so easy to compare both in ecosystem and from developers with Supermassive and Quantic Dream and I've made this comparison multiple times already today there's something to be said about Heavy Rain is a great game it's one of my favorite games on PS3 I think that Beyond: Two Souls it was a failure largely I think it made no sense and I think that it was just I have no idea why it was out of order and which they acknowledge themselves when they let you put it in order in p on PS4 which I thought was funny as hell because I was like that was obviously one of the weird things about that game that a lot of people complain about um but when you have an air of pretension about your games like they do um and you're you have",
            "start": 1232.36
        },
        {
            "text": "I was like that was obviously one of the weird things about that game that a lot of people complain about um but when you have an air of pretension about your games like they do um and you're you have a pretension about the way you know you do games whether it's good or bad because I actually really like David Cage um but there's a about the way we these games the experience and the art or whatever well I think people nail your game a little harder and I think the way Supermassive talked about Until Dawn and kind of just you know when they showed it at PSX for the first time playable um and people were in the crowd were really into it I think that that showed like how you might want to treat games like this um and I'll I'll be really interested to see with Detroit which is Quantic Dream's next game the PS4 exclusive what they've learned because if they're smart and they are they should look at Until Dawn as a game they can learn a great deal from from because they are no longer the the",
            "start": 1273.12
        },
        {
            "text": "game the PS4 exclusive what they've learned because if they're smart and they are they should look at Until Dawn as a game they can learn a great deal from from because they are no longer the the leading pioneers of that kind of game mhm and that that was that's I don't know if Greg agrees but that that surprised me it was it was they no longer they are no longer Untouchable in that sense and they and they are certainly not delivering the best of the best 100% you figure they stumbled with Beyond: Two Souls uh regardless if you think it was good or bad you know what I mean like I think you know that it was a mixed reaction whereas Heavy Rain was pretty much universally praised and was like their real breakout hit right I mean they had done games before then that people loved but not on that scale I don't think and so yeah they were weak for a moment there and then you did have Until Dawn come in but they Until Dawn and you know these guys could easily be what Quantic Dream was with heavy",
            "start": 1306.68
        },
        {
            "text": "scale I don't think and so yeah they were weak for a moment there and then you did have Until Dawn come in but they Until Dawn and you know these guys could easily be what Quantic Dream was with Heavy Rain right screw up the next one do this you it will be interesting to see with Detroit how much they've learned and what they come out and how they message the game and do different things with it and the final game on my list is uh Xeodrifter which I played on Vita but you can play it on Nintendo platforms I think it's on PC I think it's also on PS4 uh Xeodrifter is like a bite-sized I what I thought was clever about it was it was it's a bite-sized Metroidvania game you can beat it in like under an hour if you wanted to um but you can spend a few hours with it if you really need to it's basically four kind of disparate planets um it is a uh Renegade Kid game so it is very pixelated and very stylized and uh you basically just jump from place to place and get new abilities that then let",
            "start": 1343.8
        },
        {
            "text": "four kind of disparate planets um it is a uh Renegade Kid game so it is very pixelated and very stylized and uh you basically just jump from place to place and get new abilities that then let you go back to other planets and and get further and further into the stages until you beat you know fight the final boss and beat the game it's a lot of palette swapping with enemies and even bosses it is not a huge game by any stretch of the imagination but I kind of lost myself to it when I played it and uh uh really enjoyed it um it's funny because it was one of the first games we played when we actually broke off in January and then I I played on Steam I don't really get it it's it's a game you have to kind of think about a little bit uh but once you get it I came into V later and I I played it again and I really enjoyed it I I highly recommend it it's Xeodrifter um and uh I really really enjoyed that game so I think that uh people will like that if you're looking it's not like",
            "start": 1376.68
        },
        {
            "text": "again and I really enjoyed it I I highly recommend it it's Xeodrifter um and uh I really really enjoyed that game so I think that uh people will like that if you're looking it's not like Symphony of the Night or Shadow Complex it's maybe more kind of Shadow Complex because you can beat that game quickly too but it's it's not like uh The Strider remake or or Symphony of the Night or any of those kinds of games where it's going to take you 10 15 0 5 hours to be like there's no way it takes you more than a few hours um unless you're just terrible it uh so I would I would go down that direction uh Xeodrifter is my final Game of the Year for 015 awesome Greg hey how are you top 10 favorite games of 015 do we want to check in patreon.com/kindafunny how things going Nick Nick is updating he's holding his hand up $80 away $80 away from $45,000 which would guarantee us six episodes correct half the season right I'm Kinda Funny: The Animated Series Striking Distance to waxing a part of Greg's",
            "start": 1412.96
        },
        {
            "text": "his hand up $80 away $80 away from $45,000 which would guarantee us six episodes correct half the season right I'm Kinda Funny: The Animated Series Striking Distance to waxing a part of Greg's body yeah so if we get to what is it 46 yeah 46 if we get to 46,000 we're going to wax Greg Part of Me Part of Greg okay yeah not all of you yeah okay just making sure your nimbly bits will be okay okay okay good I didn't know where you're waxing so I wasn't sure yeah I'm not sure either we'll figure it out I'm not sure it's going to be me either if you're watching this in January please go to kindafunny.com no damn it patreon.com/kindafunny donate there all the money we raise in January on patreon.com/kindafunny goes to making the Animated Series a reality right now we're in the middle of live streaming yes the I mean we're recording this keeping very professional but we're also streaming it on Twitch where we're asking people not to sub to us or donate to us there go to patreon.com/kindafunny",
            "start": 1456.72
        },
        {
            "text": "live streaming yes the I mean we're recording this keeping very professional but we're also streaming it on Twitch where we're asking people not to sub to us or donate to us there go to patreon.com/kindafunny give us your money there lovely Let It Roll till February",
            "start": 1501.04
        }
    ]
}