{
  "id": 1462,
  "video_id": "2yhISvYtugM",
  "show_name": "Animated",
  "hosts": [
    "Greg Miller",
    "Tim Gettys",
    "Nick Scarpino",
    "Kevin Coello",
    "Colin Moriarty",
    "Dagan Moriarty",
    "Kristine Steimer",
    "Troy Baker"
  ],
  "title": "Kinda Funny: The Animated Series - Ep. 1 \"Politically Correct Dodgeball\"",
  "description": "Help make this show happen! Support at  http://www.patreon.com/kindafunny\n\nSubscribe to Kinda Funny! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\n\nWritten by Nick Scarpino\nAnimation by Dagan Moriarty\nMusic by Tonedeff - http://www.QN5.com\n\nTroy Baker as Principal Walken http://www.twitter.com/TroyBakerVA \nAdditional voices: Kristine Steimer http://www.twitter.com/Steimer\n\nDid you watch it? Did you like it? It's pretty cool, right? Well, thing is, we want to do more of these. In fact, we want to do a whole season. Longer episodes, funnier stories, and a really ridiculous arc that Nick has already plotted. But animation doesn't come cheap, especially at that caliber. So this month, we're humbly asking our audience to help us fund an entire season of Kinda Funny: The Animated Series. To do that, we're going to use all of the money we earn on Kinda Funny's Patreon account for the month of January 2016, including the money that's already been so kindly donated so far.\n\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys\nKevin - http://www.twitter.com/KindaFunnyKevin",
  "published_at": 1452013200,
  "duration": 166,
  "transcript_chunks": [
    {
      "text": "Okay kids, it's time to change teams. What is she talking about? Oh God, Colin, don't do this. No, I want to know what exactly do you mean by change teams? In the spirit of fairness, I'd like the two of you to switch with players from the other team. But we're dominating! Do you think Wendy Spencer saw me make that game-winning catch? No, I think she was too busy Snapchatting pictures of her teenage vagina to the quarterback. Ooh, that was a good one. It looks like my cat. How do we get her to send us those pictures? If I could answer that question, I wouldn't eat porn. I'd have so much time. I had a cat growing up, maybe that could be my in. I'll be right back. Mr. Moriarty, it's not about winning, it's about having fun. What kind of liberal agenda is that? How do you expect us to develop a cadence with our teammates if you keep making us switch sides? Okay kids, it's time to switch teams. She's not even listening to me. You know what, lady? People like you are the problem with America today. It's people like",
      "start": 0.0
    },
    {
      "text": "teammates if you keep making us switch sides. Okay kids, it's time to switch teams. She's not even listening to me. You know what, lady? People like you are the problem with America today. It's people like you that allow the Millennials to sleep all day and stay undeclared for the first seven years of their undergraduate experience. I think you're blowing this a little out of proportion, Colin. That response makes you question our relationship, Greg. I expect more from you. How'd that go? She told me to go punch myself in the nuts. What do we take from that? She definitely likes me. I just have to figure out how to make it okay for her to admit that to herself. Fantastic, Colin. The game's about to start. Can we just play dodgeball? No, it's the principle of the thing. I put copious amounts of time and effort into developing a perfect plan to exploit the other team's weaknesses. I have stat sheets, Greg, stat sheets! The Moriarty strategy is flawless, and she wants us to just switch teams? No, no, this is where I draw the",
      "start": 49.44
    },
    {
      "text": "a perfect plan to exploit the other team's weaknesses. I have stat sheets, Greg, stat sheets! The Moriarty strategy is flawless, and she wants us to just switch teams? No, no, this is where I draw the line. This is my T-Square. That's it, I'm done. Oh, will you come on? Fine, Kevin, you can play, just don't hurt yourself. Yes, yes, it's finally happening. Be cool, Kevin, remember what Mom said about not sweating. Hi, Principal Walken. Boys, you're the of the Walk. What's up, everybody? Thank you so much for watching the pilot episode of Kinda Funny: The Animated Series. We had a ton of fun making it, and with your help, we're going to keep that fun going all year long. Our goal is to make an entire 11-episode season with new episodes launching every month starting this February. Every dollar raised on Patreon.com/KindaFunny in the month of January will go towards making this ridiculous dream a reality. Should we be making an animated series? No. Are we going to do it anyway? Hell yes! If we don't get your support, will",
      "start": 90.6
    },
    {
      "text": "Funny in the month of January, we go towards making this ridiculous dream a reality. Should we be making an animated series? No. Are we going to do it anyway? Hell yes! If we don't get your support, will we sell Kevin on eBay? That's going to happen no matter what you do. Please bid on me. Check out Patreon.com/KindaFunny and make our dreams come true.",
      "start": 144.52
    }
  ]
}
