{
    "id": 1488,
    "video_id": "_KIW7U3fU-o",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Our New Year's Resolutions - The GameOverGreggy Show Ep. 111 (Pt. 1)",
    "description": "Colin Moriarty tells us his New Year's Resolutions.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1453113147,
    "duration": 2588,
    "transcript_chunks": [
        {
            "text": "This episode of The GameOverGreggy Show is brought to you by Kinda Funny: The Animated Series. It's our new thing and we're trying to do 1 episodes, one a month, and we need your support. Please head over to Patreon.com/KindaFunny and toss us a few bucks to make it a reality. All the money raised in January goes towards this, so if you've never supported us on Patreon, come over, give us $1, and when they take the money at the end of the month, go away. Just leave us alone. Don't worry, you keep watching it for free. Have a good life. Thanks for nothing, except the dollar in January that hopefully made the, you know what I mean? What's up, everybody? Welcome to The GameOverGreggy Show. I am one of your hosts, Greg Miller, alongside the producer/seducer and birthday boy, Nick Scarpino. Top of the morning to you, Greg. Top of the muffin to you. Your birthday was yesterday, it was. Did you celebrate last night? I had a great, yeah, I went out to a restaurant called Flower and Water in San Francisco. It",
            "start": 0.16
        },
        {
            "text": "morning to you, Greg. Top of the muffin to you. Your birthday was yesterday, it was. Did you celebrate last night? I had a great, yeah, I went out to a restaurant called Flower and Water in San Francisco. It was delish. It was very, very good, very, very good. Uh, it was one of those few instances in a my restaurant going, you know, in San Francisco, you always go to a restaurant and it's always, there's always something interesting about it where you're like, it's good food, but the service is like, they don't, they pretend like you just don't even exist sometimes. Or more often than not, when I go to restaurants in San Francisco, uh, they, it's not like a pretending, it's just they act like you're, um, you're, you're putting them out. You're, yeah, totally. Yeah, you're being, you know, like, like you ask him a question, they're like, it's pasta, you know, a fili, very, it's close to like, like I, we like, you know, we asked him last night 'cause I didn't realize this is sort of an Italian flare restaurant. I call it Italian hipster, and I",
            "start": 51.52
        },
        {
            "text": "it's pasta, you know, a fili, very, it's close to like, like I, we like, you know, we asked him last night 'cause I didn't realize this is sort of an Italian flare restaurant. I call it Italian hipster, and I asked, I was like, what kind of pasta is this? Are they all in flannel shirts? Uh, yeah, uh, well, the ones that didn't weren't wearing like sleeveless shirts so they can show off their tattoos, flannel shirts. But, um, but I have to say, the steps of service were fantastic. They were spot-on and every single thing, you know, it's a good restaurant when you eat there and you don't puke, even think about something being bad. You know, like you're eating like it's really good. And by the, by the end of the meal, I was like, Jesus, everything was great, like great. So I had a great time and my wife put that together. We went out with some friends, um, who I haven't seen in a while, all of whom are having children, so I'm sure that's the last time I'll see them. Sure. Yeah. I something that I really enjoyed today, Nick, was while",
            "start": 88.36
        },
        {
            "text": "out with some friends, um, who I haven't seen in a while, all of whom are having children, so I'm sure that's the last time I'll see them. Sure. Yeah. I something that I really enjoyed today, Nick, was while you guys are doing Colin and Greg Live, Nick looks over at me and is having an actual real moment. Very few times has that happened in my life. Nick never has real moments and he goes, I don't know what it's like to be an adult. Last night I hung out with adults. It was weird. I couldn't connect with things. And it's so funny 'cause it's like, you're stuck with us. We, this is our life. We just got a crate of Legos today. Yeah, we're super pumped about, we're juiced about it. So juiced about those Legos. Yeah, no, I mean, that was, that was a, that was interesting. Well, we were all a little tired too. It was an end of a Wednesday and we've been on a kind of a bender for the last like week and a half. It's been a long, the animated show and we did a great anniversary stream and all that stuff. Um, so last night was the",
            "start": 126.48
        },
        {
            "text": "a Wednesday and we've been on a kind of a bender for the last like week and a half. It's been a long, the animated show and we did a great anniversary stream and all that stuff. Um, so last night was the first time I sat down with people that were outside of this, my core group of, basically, you guys are my world at this point, for better or for worse. Um, and sat down with some of my old friends and, and, and tried to catch up with them. But I realized that my point of reference for their lives has changed now. Like before, when I would sit down with Eric, for instance, we've talked about a little bit on the show. He works over at IGN. We, we used to sit down together. We had that common ground of like, work and all of our friends and all of anyone that we knew pretty much either worked at IGN or had at one point worked at and was coming in out of those doors. And so, um, it's, I'm finding it more and more like I have to be an adult and like really talk to people, politics, yeah, like what's like, or, or you",
            "start": 164.16
        },
        {
            "text": "one point worked at and was coming in out of those doors. And so, um, it's, I'm finding it more and more like I have to be an adult and like really talk to people, politics, yeah, like what's like, or, or you have to work just a little bit harder to understand what's happening in other people's lives because you're not there every day. You're not having those shared experiences with them where you can just immediately flip, flip the switch when you walk out the door and like, let's talk, you know. Well, over here, the pride of Long Island, Colin Moriarty. You had Jared Petty over not too long ago and Jared Petty has been off of Twitter at this time for like two or three weeks or whatever. So he knew nothing and he kept apologizing for not knowing that like Christine had moved to LA or this had happened or we did the animated show. And we're like, no, you're a normal person. This is what a normal person's life is like. Doesn't follow all their friends like every step of the way on social media. Over there, the pure",
            "start": 198.12
        },
        {
            "text": "the animated show and we're like, no, you're a normal person. This is what a normal person's life is like. Doesn't follow all their friends like every step of the way on social media. Over there, the pure one, Tim Gettys. Hi. Hi. How are you? I'm great. Colin's doing that thing where he's gonna see how long he can be quiet on the show because he's a real piece of garbage. Goddamn listening as the leader of Team Fat again. I just wanted to let you know, just listening. I don't think you were, you ever not the leader? Did I miss a vote? No, but I knew that would get him all riled up. Oh, I see. He looks pretty riled. Trust me, right now, this is an 11 on the Colin Moriarty scale. Is he? Um, but no, but I mean, it was a great birthday. Answer your original question. Great birthday. Good. I'm glad. Fantastic birthday. Uh, might go out for drinks this weekend and you guys are interested. God, you're living it up. Um, because it's also one Mr. Ty Rued's birthday coming up. So sometimes, that's right. Yeah, sometimes we do. He always has",
            "start": 234.88
        },
        {
            "text": "go out for drinks this weekend and you guys are interested. God, you're living it up. Um, because it's also one Mr. Ty Rued's birthday coming up. So sometimes, that's right. Yeah, sometimes we do. He always has like the more crazier birthday, but he's, he's getting old too. So we might just, uh, do our normal, everyone sits down. I'm into like, let's do it real. As I get older, I have less and less, um, energy for like the wild night, like 10 out of 10 night, you know, or like, oh my God, that was crazy. Can you like, let's, let's talk about that. I really just want to sit down with people that I know are interesting, that I love, that are my friends and my family in a cush setting. Hang out, yell. Yeah, I've always been, that's been my M.O. from the get-go. Sounded better in my head. Damn. No, that was awesome. That blew me away from. I like this. I like this because my girlfriend, Gia, is going back to Philadelphia this weekend. So the thing is, the next couple days are, it's her time. So it's like, I'm like, all right, whatever you want",
            "start": 273.64
        },
        {
            "text": "I like this. I like this because my girlfriend, Gia, is going back to Philadelphia this weekend. So the thing is, the next couple days are, it's her time. So it's like, I'm like, all right, whatever you want to do, I'm doing it. But I'd much rather do this. And if I, if I'm like, do you want it? Here's a scheduled thing that we could do. We play this. We can play this all to our benefit 'cause my girlfriend from out of town is coming to visit. And so I, I, it's the same thing. Our time. We don't want to sit around here. It's screw all the time. Like, you know what I mean? Yeah, sometimes we want to. That's not like, you can't do that if you were to go to this thing. Exactly. Exactly. We establish, you've never had sex again. You unzip the panties and then the vulva walls. Like, I've had, I've had sex. I'll tell you right now. The vulva walls. What, what is wrong with you right now? You found a hair. His hair was on me, but I'm trying to figure out whose hair it is. I'm having an issue where there was hair in my eye and it's",
            "start": 316.08
        },
        {
            "text": "now the vulva walls. What, what is wrong with you right now? You found a hair. His hair was on me, but I'm trying to figure out whose hair it is. I'm having an issue where there was hair in my eye and it's messing with my contact. Looks like a Kev hair if I've ever seen one. Kev's hair is attacking Kevin. That looks like a hair from you. It's not a bad thing. He uses public washers, so maybe that's it too. What do you think, Kev? That you, that hair is Peruvian if I've ever seen a Peruvian hair in my life. The most Peruvian ass hair I've ever seen hair. I don't know. So yeah, do, do something in place so we can then tell our girls, this is the night we're doing something cool. I'll talk then. I will. I will. I'll get on the old text messages and figure it out with Big T, Big T Rued. If you didn't know, this is The GameOverGreggy Show. Each and every week, four, sometimes five, best friends gather on this table. Each bring a random topic of discussion for your amusement. If you like that, head over to Patreon.com/KindaFunny.",
            "start": 360.16
        },
        {
            "text": "over Greggy Show each and every week, four, sometimes five, best friends gather on this table. Each bring a random topic of discussion for your amusement. If you like that, head over to Patreon.com/KindaFunny where you can toss this a few bucks and get each and every episode early along with a bunch of bonus perks. I think this one goes up. Yep, it's still January, so you got to go there and support the Animated Series. Please, all the money raised in January is going towards making the birthday boy, Nick Scarpino's animated series a 1 episode run. So can we just treat Nick like he is a 16-year-old girl and just give him a birthday month? Sure. Yeah, he'll be the birthday boy for the present. You could give Nick Scarpino is this cartoon that he has written, directed, and is making happen along with our healthcare. Do you guys know what I'm talking about though? No, I don't. With the 16-year-old girls. No, I know. I know. Quinceañera parties, Quinceañera, Lollapalooza, Lollapalooza, Coachella, Coachella. Yeah, okay. Um,",
            "start": 397.92
        },
        {
            "text": "do you guys know what I'm talking about though? No, I don't. With the 16-year-old girls. No, I know. I know. Quinceañera parties, Quinceañera, Lollapalooza, Lollapalooza, Coachella, Coachella. Yeah, okay. Um, Carne Asada Fries. Like, I have so many friends in high school and all the way through college where it's like their birthday might have been the Wednesday of that week, but that meant they're going out the week, weekend before, the weekend after. You know what, **** it, the next three weekends. And it's all about me. How many cakes can I **** get and not eat? They always get cakes. And we just went to brunch recently, like last weekend. And, um, it was just, it was out in the Marina. And I swear to God, the cast of Desperate Housewives, not Desperate, Real Housewives. Yeah, there was Housewives. There was a lot of Housewives. And, uh, they were all the Tipsy Pig. Oh, the Tipsy Pig is so good though. Did you get those biscuits? Yes. Oh, **** me. The mac and cheese. There's this group of women and they were just, they were fabulous. They were",
            "start": 437.88
        },
        {
            "text": "were all the Tipsy Pig. Oh, the Tipsy Pig is so good though. Did you get those biscuits? Yes. Oh, **** me. The mac and cheese. There's this group of women and they were just, they were fabulous. They were just spectacular. I, they were having so much fun. I was like, good for **** you, you guys. Ranging from the ages of God knows what. There was the entire range was there. Oh, wow. The spectrum. Oh, yeah, yeah. It was, it was really good. And like their heels, I didn't know you could wear heels that were that, that much of an incline. It was just like, and they were doing these acrobatic moves that I was like, I couldn't do that if I, why didn't you call Nick? He lives right there. Trying to step over to like, uh, get in between like different people, like different angled selfies and stuff. And I'm like, I like you. You're my type of people. They wear what they wearing? Oh, it was again, the age around the gamut and, and the, the outfits around the gamut. Um, but very colorful. And, um, they, I don't remember why I brought this up.",
            "start": 486.36
        },
        {
            "text": "my type of people. They wear what they wearing? Oh, it was again, the age around the gamut and, and the, the outfits around the gamut. Um, but very colorful. And, um, they, I don't remember why I brought this up, but, um, they were celebrating just to celebrate. And I really appreciated that. And I, I hope that one day we are Desperate Housewives. Okay, if you got no bucks to toss, you can go to YouTube.com/KindaFunny. We break the show up topic by topic, day by day, until the entire thing posts for free on Fridays as one big video and one big MP3. Colin, yes, start us off. No, next, next topic. No, I guess I'll go first. I'm used to, uh, I wanted to talk about New Year's resolutions. It's always fun. We were supposed to last week, but we were obliterated drunk. Yeah, so who would have on The GameOverGreggy, a little late, but, but who cares? It's not that bad because back on January 8th, 2015, we put up our episode of our New Year's resolution. So even that was a bit late. Would everybody like to know what they said? Of course. Thanks.",
            "start": 529.28
        },
        {
            "text": "cares. It's not that bad because back on January 8th, 2015, we put up our episode of our New Year's resolution. So even that was a bit late. Would everybody like to know what they said? Of course. Thanks. Love you for doing this. Colin began because it was his topic. Colin began his topic on, I knew I did it last year. Stole from Nick, just like that happened this year. I didn't steal anything from Nick. I, point of clarification, I tried to steal from Colin. You made it seem like it was going to be yours to begin with. I'm really good at that. Wow, really good at that. You're the devil that I want inside me. I'll put myself inside you. Thank you, devil. Willfully, I'll put myself inside Colin. Your New Year's resolution. None of us did well. Well, actually, you and I didn't do that well. And Nick, we'll get to Colin. You're, you start by saying you want to be a little healthier, not work out more, but ingest more vitamins. So your New Year's resolution was to drink a green smoothie for breakfast every day and work out",
            "start": 582.32
        },
        {
            "text": "you start by saying you want to be a little healthier, not work out more, but ingest more vitamins. So your New Year's resolution was to drink a green smoothie for breakfast every day and work out four to six times a week on the elliptical. Right? Not terrible. Yeah, the smoothies died quick. Smoothies went down about six weeks in. But you, you were just pounding the zinc recently. Oh, I was pounding. You're getting, you're getting vitamins in you for sure. Oh, yeah. Uh, work out. I mean, I work out four to six times a week still. So I mean, that's, you know, not so much, not so much. Yeah, not so much the last couple of months. But yeah, I mean, I still used the elliptical. We, that was the question. I never go more than a few days without working out. Okay, mine was still not understanding the beast that Kinda Funny would be. I was still holding on hope to that I would wake up, make a coffee, and go into the backyard to read Comics. That has never happened ever. That's never been a thing that's happened. Turns out you don't",
            "start": 621.96
        },
        {
            "text": "be. I was still holding on hope to that I would wake up, make a coffee, and go into the backyard to read Comics. That has never happened ever. That's never been a thing that's happened. Turns out you don't even have a backyard. No, I, well, that was the whole thing. We joked about. Colin said the porch was too small, so I'd be looking right into his bedroom. So I'd have to do it. Although, I'll say, just slow jerking looking at this is, I'm, remind me if I forget, this is one of a New Year's resolution I'm adding right now to this one that we'll do today. Thank you, Kevin. Uh, I also said that I wanted to read more comics, which I did. I joined Marvel Unlimited and read more comics. And I'm more regular with my Comics. But I wanted to read more books as well, which I have not **** done at all. I buy a book, still good. I buy like Colin say, like, uh, Packing for Mars. I'm like, that sounds **** rad. And I buy it when I read maybe the first chapter and then I just never get back to it. Tim, you said you wanted to play more",
            "start": 666.96
        },
        {
            "text": "I buy like Colin say, like, uh, Packing for Mars. I'm like, that sounds **** rad. And I buy it when I read maybe the first chapter and then I just never get back to it. Tim, you said you wanted to play more current gen non-Nintendo games. That you wanted to make use of these systems you had. You said you wanted to play Arkham Knight. Did not. You said you wanted to play the other Uncharted. Did. Said you wanted to play Gone Home. Did not. Mhm. But that just got here. Yeah, that, I'm not, I mean, that's fine. I don't, I don't know if we were talking about console in particular. Probably the problem was like, we started listing games, so I, I cut it off. But I mean, mainly, did you play more current gen? Definitely. Undeniably, yes. Yeah. Did you play more current gen than you, did you play more PS4, Xbox, whatever you want to in there than you did Nintendo? If I was to put it on a scale, did Nintendo, did you play more? Yes. Okay. Definitely. Having said that though, I don't think that I did. I've played more current gen than I",
            "start": 705.28
        },
        {
            "text": "to in there than you did Nintendo. If I was to put it on a scale, did Nintendo, did you play more? Yes. Okay. Definitely. Having said that though, I don't think that I did. I've played more current gen than I normally did. So I don't know if I lived up to my resolution necessarily 'cause I always played the games I wanted to play on the systems. You played Metal Gear. You talked about Metal Gear. I wanted to play Metal Gear. You know, like Final Fantasy, if it were to have come out, I would have played it. Kingdom Hearts, I would have played it. See, that was, that's what you said last year too. That those were the things you bought your PS3 for and that never really worked out for you. I don't know. I don't know if I'll give myself the point because I didn't play Arkham Knight. Me saying I'd play Arkham Knight is saying I'm going to play the things that I'm not necessarily going to play. Yeah, I didn't do that. You, what are you doing? Okay, sorry. I **** it up. I didn't know what was happening. We're taking funny photos",
            "start": 748.96
        },
        {
            "text": "I'm going to play the things that I'm not necessarily going to play. Yeah, I didn't do that. You, what are you doing? Okay, sorry. I **** it up. I didn't know what was happening. We're taking funny photos of you, Kev. You're funny. We like you. You're, it just sometimes I just like to keep a record of all Kevin's leisure positions. Kevin's a man of leisure. Uh, you then went a little bit further in, said you weren't, you weren't making the New Year's resolution to exercise more. You wanted to think about exercising more. I remember him saying that. Hey, I can tell you there has never been a year that I've thought about exercising more than 2015. Okay, I nailed that one. Your, I love me. Your motivation for thinking about exercising more was the pratification, which was a big thing at that moment. Something I talk about constantly. I haven't heard you talk about a long time. Literally came up today. Apologize. Just listen to you more. I've been with you all day long. Now, Nick, earlier at the kitchen table, we were prepping for",
            "start": 784.0
        },
        {
            "text": "constantly. I haven't heard you talk about a long time. Literally came up today. Apologize. Just listen to you more. I've been with you all day long. Now, Nick, earlier at the kitchen table, we were prepping for this show. And I yelled, Nick, get to your **** point, right? And you said, I'm singing a song. And I said, no, I mean, the Nick of 2015. And this is what I'm talking about. On January 8th, 2015, you wouldn't shut up. But I don't think you ever had a point 'cause what happened is, how was that surprising to you? Have you not done this show with me before? What happened? I, I, I'm pretty sure I was able to trace it back, right? Is that Tim said he wanted to play more games this year. And you said, I do too. And then Tim said, I'm not done yet. And then we never really came back to you because when Tim said, I want to think about exercising more, pratification, you said, yeah, but he went on the Paleo diet and got shredded and da da da da da. And then Colin chimed in that he drinks a lot of orange juice. And then it was",
            "start": 830.16
        },
        {
            "text": "to think about exercising more, pratification, you said, yeah, but he went on the Paleo diet and got shredded and da da da da da. And then Colin chimed in that he drinks a lot of orange juice. And then it was literally 15 minutes of you telling him why that wasn't going to help him at all. I stand by that. Orange juice has just way too much sugar in it. Colin, it's got good, you know, you're getting a good vitamin. Better, you'd really be better off just eating an orange every day. Hmm, more fiber in your diet. So we're leaving years then with wants to play more games. Did you play more games year? I did play a lot more games last year. Yeah, I, I mean, a lot more games for me is usually generally in, in a given year, I played two. I played, I think, five or six last year. Yeah. And you beat a bunch. Beat a bunch. Hard ones too. Shovel Knight, Shovel Knight, uh, MGS, uh, Batman. Uh, there's a couple more in there. I think I played, I fiddled around with the, uh, Mega Man Collection for three hours and then realized that only Colin",
            "start": 872.52
        },
        {
            "text": "Knight, Shovel Knight, uh, MGS, uh, Batman. Uh, there's a couple more in there. I think I played, I fiddled around with the, uh, Mega Man Collection for three hours and then realized that only Colin could beat this game. So I stopped 'cause Mega Man 1 really **** hard. Yeah, it's not easy. Unforgiving. Punishing is what some people might say. Um, yeah, I mean, I would say that still probably carries. Are we, are we getting to the point where we're making our resolutions now? We're in 2016. Let's start with you. You, you get your Limelight that was robbed of you. Um, orange. Yeah, I'd like to drink a lot more orange juice to start. Just only orange juice. Just get off my coffee diet and just go to orange juice. Um, it's so hard 'cause I always, I always think like, I'm never really going to do any of this stuff. Sure. These resolutions are like made to be broken. Like the number one thing that people would just immediately break. Well, they're always, it's like that, you know, perfect world, perfect you kind of thing. I want to",
            "start": 912.48
        },
        {
            "text": "go, you know, drink coffee and sit in the backyard more. Was like, no, in reality, I'm going to want to sleep into as late as possible or I have to wake up and do a Colin and do this, right? Uh, I'd like to play more games. I would like to read more in general, not just comic books. I'd like to read more books. Uh, be a little bit more worldly, uh, with what's going on in the world. Uh, 'cause I hear like, I was talking to Colin yesterday about, uh, what's happening in Syria. And it's just, it's one of those things where I know there's a conflict in here, but I really don't know the specifics of it, right? I get that. I get headlines here and there, but there's a difference between, uh, really kind of perusing headlines on Twitter and actually reading articles and having somewhat of an understanding. I mean, I'm not, I'm not",
            "start": 957.52
        },
        {
            "text": "headlines here and there, but there's a difference between, uh, really kind of perusing headlines on Twitter and actually reading articles and having somewhat of an understanding. I mean, I'm not, I'm not hoping to have the Colin Moriarty level understanding on anything really. Um, that's just too much to hope for my, my brain. But just understanding kind of what's happening in the world, where we're headed, um, I think is very, very important for me, especially since, you know, when we talk on these shows, like Colin talks about very, very specific, like intense topics sometimes. I'd like to be able to add to that. Um, in general, uh, work out more, do yoga more, master my inversions in yoga. I would like to do that. What's an inversion? It's like headstands, tripod stands, crow poses, things like that. Tripod stands. Yeah, okay. When you make a tripod, put your hands on. Supposedly, in the, we did 11 Sex Facts right now. The celebrity guest season is going and we did one with Trisha Hershberger. And in the intro, you're doing some yoga and",
            "start": 992.56
        },
        {
            "text": "you make a tripod put your hands on supposedly in the we did 11 seasons right now the celebrity guest season is going and we did one with Trisha Hershberger and in the intro you're doing some yoga and you said this is Warrior One from What I Hear No you said it was Warrior One oh it was me I said that's not Warrior One it was a runner's lunge good cuz I don't if I remember correctly the comments are saying and I guess I was the incorrect one well jokes on you guys I don't know anything no I yeah it wasn't Warrior One Warrior One looks way different than that um so read more workout read more work workout more um be more worldly I'd like to I in a perfect world if I had infinite willpower I'm talking like like the The Willpower of like Chris Pratt you know like to get jacked out I would like to start being nice to Kevin but I just don't see that happening you know what I mean I guess I think we're nice to Kevin we give him a hard time he know a hard time % of the time we couldn't run this",
            "start": 1034.2
        },
        {
            "text": "start being nice to Kevin but I just don't see that happening you know what I mean I guess I think we're nice to Kevin we give him a hard time he know a hard time % of the time we couldn't run this Business Without You yeah um yeah and and uh Kevin's gonna own us one day and I want to write more so the the Anies series count it does count um I'm looking forward to a collaboration with you guys and and laying down Baseline scripts for for the next 1 episodes or like the next I guess 10 episodes cuz we're already at the time of hearing this we've already started developing Episode Two thanks larg to you guys out there um but just in general I think it's I think it's good for us because I I feel like we're all pretty aligned of wanting to move toward more creative Endeavors like that just to test our our uh might and Merit at them so yeah that's pretty much it I mean I don't have anything crazy world world things like that be a better husband I guess it's always the same what does that mean",
            "start": 1079.12
        },
        {
            "text": "our our uh might and Merit at them so yeah that's pretty much it I mean I don't have anything crazy world world things like that be a better husband I guess it's always the same what does that mean though you're just G to not be talk so much **** on this show no um it's to me like I think it's it's just the small things right like the big the big things I think I I got down but the small things of just like helping out my wife a little bit more with everything basically just being there more for her being present more when we're we're around each other you know I've tried to make a conscious effort over the last like six months or so to like turning the TV off and just like having dinner with her things like that um when I'm with her really being with her put the phone away be with her right do those things where like not reactive but proactive Rel you're not getting yelled at about it it's not an issue you want to get ahead of the problem right like but not not for the sake of hey",
            "start": 1124.56
        },
        {
            "text": "do those things where like not reactive but proactive Rel you're not getting yelled at about it it's not an issue you want to get ahead of the problem right like but not not for the sake of hey I should do this because I'm going to avoid a confrontation more from the sake of you know I think like thinking proactively of like what could I do today that would surprise her and make her happy little things if I get her flowers if I just like I know there's dishes over there and I know it's not necessarily my quote unquote turn to do them what if I just did them real quick you know made her something a little bit bought her something things like that I want to I want to spend a little bit take a little bit more mind share um out of all the things we're working on and devote it toward her I like that one yeah I want that to be your number one okay thank you done thanks for doing that uh I have two one I've invented on this show the first is played out because I've talked about it before to",
            "start": 1164.6
        },
        {
            "text": "that one yeah I want that to be your number one okay thank you done thanks for doing that uh I have two one I've invented on this show the first is played out because I've talked about it before to the audience and that's that I want to be better to them and I mean that specifically I talked about it on Patreon where I wrote a letter where it's like we're not bad on Patreon but we're not great about overc communicating what we're doing you know what I mean and where something is and like we just put up you know during the live stream we went through all the milestones and where they're at and what's happening but I mean the letter that went out last year when you started being a patron right was written very much when we didn't know what Kinda Funny was and what it was going to be and so it was like I'm going to check out the board every day and it's like no like you run yourself into the ground and then I you know even even though it is so simple to pop in for 10 minutes to see",
            "start": 1202.16
        },
        {
            "text": "so it was like I'm going to check out the board every day and it's like no like you run yourself into the ground and then I you know even even though it is so simple to pop in for 10 minutes to see what's happening on the Patreon wall it actually isn't that simple and that's where we tapped Amy you know to go out there and actually be like the community spokesperson at least to like tell because most questions are I just joined and I there's no where the hell is everything you know I mean like how do I get it she's there but I so far just be there and be more communicative and be there and talk to the people there I'm trying to do it on the forums to pop in and do more stuff there but not NE I mean the first year was such a whirlwind and so much for us to learn in terms of how the business works and who we are and what a day is going to be and the fact that there is never a normal day that now I think that like we keep talking about it right and that's why it's I'm rushing through it",
            "start": 1239.28
        },
        {
            "text": "works and who we are and what a day is going to be and the fact that there is never a normal day that now I think that like we keep talking about it right and that's why it's I'm rushing through it away is the fact that you know now we know what Kinda Funny is and what year is going to look like and where the responsibilities are and how when we are stretching ourselves too thin and so like if we can keep it to where it is one show a day on top of CoG Live or whatever right one afternoon commitment then there are those suddenly periods where you can pop in and say hey and see what's up and talk to people and have a better conversation going there number two though this is one the one I wanted Kevin to remind me so Kevin you no longer have to remind me thank you Kevin give me pound though Kevin and I are going to get that backyard whipped into shape we're going to make that a livable backyard so we can hang out and do barbecues cuz we're going to do the family barbecues like the",
            "start": 1274.0
        },
        {
            "text": "Kevin and I are going to get that backyard whipped into shape we're going to make that a livable backyard so we can hang out and do barbecues cuz we're going to do the family barbecues like the Fast and the Furious back there string up out there we're mow the grass maybe put in like that AstroTurf stuff along the sides this I want a fire pit yeah well that's the thing he's my he motivates me to do it cuz I told him about it and he's like well we could do that and I'm like we could cuz I I could have done it before but it's a I mean the thing about Kevin you know we've spoken about this a bazillion times but he is a doer he gets things done and it's awesome cuz he doesn't just he it's like if I give him a task he'll do that task but he'll also add his flare like he also he is thinking about how can I make this better I don't always agree with it necessarily but it's it's always cool that he he has his idea of how he's going to tackle a problem so it's like if he's like I don't like",
            "start": 1308.88
        },
        {
            "text": "how can I make this better I don't always agree with it necessarily but it's it's always cool that he he has his idea of how he's going to tackle a problem so it's like if he's like I don't like these shelves a Target I'm going to build my own shelf I don't like those because they are a little too curved I'm going to make mine not curved and here's how I'm going to do it I'm going to use magnets I'm like why would you use magnets and it's like he just go goes **** crazy but then it always results in this Insanity of wow that's actually really really cool it's like things like backyards that's awesome cuz he's going to actually do it he's going to be put a lot of pressure on you to make it actually happen as soon as this Randy Season done Kevin we're back there we're making it happen fire pit then we have the families over you have the girls over so that they're locked into this place just like we are no one no one's coming over and they don't know it everybody's coming over and",
            "start": 1349.24
        },
        {
            "text": "fire pit then we have the families over you have the girls over so that they're locked into this place just like we are no one no one's coming over and they don't know it everybody's coming over and we're all exiting through Colin's bedroom Colin what is your New Year's resolution have three of them oh lay them on me uh the first one is to is similar to what I was talking about when we were drunk on GameOverGreggy After Dark is uh to uh just be a little more in the moment a lot of my anxiety comes from um catastrophizing things in my mind a lot and as I told my dad when I was telling you guys about the conversation the better things get in my life the worse it get my anxiety gets and that's what I've noticed like things really haven't been better in my life ever so my anxiety has also never been worse um and it was it's always been that way when I I was a goalie and I played hockey and I was always really paranoid about letting up a goal but you're going to let a goal up you're going to",
            "start": 1388.48
        },
        {
            "text": "been worse um and it was it's always been that way when I I was a goalie and I played hockey and I was always really paranoid about letting up a goal but you're going to let a goal up you're going to let some soft goals up sometimes and it sucks and it's your fault but you also have great saves and save the day sometimes and just to kind of live the moment when I went to Northeastern I was I was afraid that I was like not good enough to be there and I went to a school that was way too good for me and I was always afraid of getting kicked out for no reason you know like straight A but you're like I'm G to K one of these days are going to wise up yeah and I did great there and then I got a great education there but it was like that was always my paranoia and then when I was worked at IGN I was like this job's too good to be true and I'm going to get laid off at some point I never got laid off I got promoted like three times so you know I got to like start to just to my dad's Point",
            "start": 1428.76
        },
        {
            "text": "I was like this job's too good to be true and I'm going to get laid off at some point I never got laid off I got promoted like three times so you know I got to like start to just to my dad's Point realized that maybe I just deserve some some of the success we've experienced and and some of the good things that happen in life the bad things happen too but our company's doing great you know um we caught our audience up a while ago on what was going on with me a while before that um but things are like way better with me personally now I'm dating a new girl was an old friend of mine she's fantastic and like things are going great there and so like my friendships are good and everything's fine you know so like just try to let some of that anxiety go like the the other shoe dropping is like basically what I'm always afraid of in any respect and you know I just uh I need to get over that at some point you know 31 years old in a knock on wood uh number two is uh I want to continue to like be",
            "start": 1458.24
        },
        {
            "text": "what I'm always afraid of in any respect and you know I just uh I need to get over that at some point you know 31 years old in a knock on wood uh number two is uh I want to continue to like be diverse in the in the things that I do as diverse as possible and I think I did a pretty good job in 2015 of like kind of staying true to what I wanted to do at the time and I want to kind of continue to do that um you know I'm never going to be a slave to to anything that I don't want to do so um I'm not going to play games just to play games I'm not going to read the news just to read the news I'm not going to do whatever I I like traveled a little bit this year or in 2015 and and I met new people and I had new experiences and you know I read a lot and rode a little bit but not as much and um played the games that I wanted to play and did all those kinds of things and I want to continue to like keep that Spirit Alive of you know what do you want to do right now last night I just sat in my bed",
            "start": 1496.56
        },
        {
            "text": "the games that I wanted to play and did all those kinds of things and I want to continue to like keep that Spirit Alive of you know what do you want to do right now last night I just sat in my bed and just listened to music for three hours you know and it was great I could have played a game but I didn't really want to you know and so I want to so I just want to stay true to the spirit of kind of doing what you want in your spare time that makes you happy at the time and not feel beholden to any sort of quota in terms of new albums listen to or new games played or whatever when a game speaks to you play it when an album Song speaks to you listen to that song I want to I want to keep that Spirit as well the third thing is a little more abstract but I was listening to um the the Gamescast that we did around the table in the kitchen and I realized you know listening to a lot of politics like professional pundits in sports or in politics we're very talented if you listen you know watch",
            "start": 1537.08
        },
        {
            "text": "that we did around the table in the kitchen and I realized you know listening to a lot of politics like professional pundits in sports or in politics we're very talented if you listen you know watch uh pregame stuff with NFL or you you know you watch Sunday morning shows people big old Michael Strahan big old Michael Strahan the uh they just speak very not necessarily eloquently but they speak uh in a way that removes a lot of likes and ums and H and and uh I I realized that I don't do that all the time and actually no one ever brings it up like in the comments people say mean **** about us all the time but that's not one of the things but I notic it and during the Gamescast I was doing a lot of ums and I was like I got to clean that **** up but it's something you have to be cognizant of to just speak more eloquent it's not even about eloquence again it's it's just to speak more forthright and remove the likes and the ums and the anos as they would do in Japanese or whatever where it's",
            "start": 1574.16
        },
        {
            "text": "just speak more eloquent it's not even about eloquence again it's it's just to speak more forthright and remove the likes and the ums and the anos as they would do in Japanese or whatever where it's like you know the things that give you time to think or whatever just don't say anything well keep in and and I and so I want to like clean that up because it's **** frustrating to me listening to myself doing that even though I don't think anyone else noticed I'm like I can be much better than that don't forg that is a different kind of product that's brevity right they know there's a producer on the side is like we you have three minutes for this segment about what's happening in the Jets right and that's why it is you see them like doing this then it's like they drop their line in right or like you know you know it seems like Terry always knows who he needs to kick to or whatever not that I'm saying it's don't get wrong this is something we should all focus on more but we are like the",
            "start": 1617.32
        },
        {
            "text": "like you know you know it seems like Terry always knows who he needs to kick to or whatever not that I'm saying it's don't get wrong this is something we should all focus on more but we are like the rambling let's yell at Kevin show yeah but I'm not I'm not so much saying you know the the the brevity or the or the the the length of it as much as just like the clarity of it we can speak better I mean I don't speak anyone else you guys can do whatever the **** you want but I just noticed that even though no one said no one has ever said to me like you say um too much and I probably really don't maybe in that show I I did because I was thinking a lot more on off the cuff or whatever I want to clean the way I talk up and I think it's something that uh you know it's not matter people are like sometimes people like why you curse so much I'm like CU I **** want to uh but that's not so much I'm talking about just remov like trying to be more cognizant maybe cutting 50% of them out or",
            "start": 1649.8
        },
        {
            "text": "like sometimes people like why you curse so much I'm like CU I **** want to uh but that's not so much I'm talking about just remov like trying to be more cognizant maybe cutting 50% of them out or something and making it more you know coherent in some sense because I just I want to be on that level in terms of the way I speak I think think I think I I think I think eloquently and I want to be able to speak eloquently when I can I think speak so eloquently that it makes all of us look like bigger jackasses than we are like I I thought I think about this all the time and you know I listen back to any of the shows we do not just Gamescast but GoG or whatever it is and I hear myself speak too and I'm like o man like what am I doing like I need to be better about that but it is hard that's just not who we are so it's not like we are really focusing on that we are kind of thinking as we go like this isn't like a planned show where we have points we're making but you always sound like you",
            "start": 1683.2
        },
        {
            "text": "not who we are so it's not like we are really focusing on that we are kind of thinking as we go like this isn't like a planned show where we have points we're making but you always sound like you do you always sound like you know exactly what you think about every single thing you're saying and I think it's more about the way you present the information you know like people believe what you're saying because of the way you say it you know and you believe it you believe it they believe it you know and I feel like a lot of times when I talk about stuff I'm more just kind of like I don't know what I think about this I that's what I'm talking out right now and so that's why there is more likes and ums or whatever it is that I do um makes sense probably um so Tom Hawkins go back and look at all of 2015 count Colin's ums and then start tracking for 2016 and let us know next year I think you'll find a lot fewer than you think I think it depends on I actually think it depends when I've",
            "start": 1726.92
        },
        {
            "text": "at all of 2015 count Colin's ums and then start tracking for 2016 and let us know next year I think you'll find a lot fewer than you think I think it depends on I actually think it depends when I've listened back and noticed those quirks or whatever it's always in the times that I'm most passionate or sure speaking off the top of my mind as opposed to something I've thought about so or thought about deeply so it's just uh maybe it's a prepar like a preparation issue too but oh maybe but I mean I think it's really hard to when you're speaking off the cuff specifically and I think the reason why specifically you guys are very good at it is because you do have a very long history of having done so on podcasts for what when did you guys start doing podcasts we started 2008 yeah so like almost what coming out eight years nine years this and it is a skill that that has learned like I've seen I i' I've you know tried to get better at it tried to get better exactly what you're talking about",
            "start": 1762.68
        },
        {
            "text": "what coming out eight years nine years this and it is a skill that that has learned like I've seen I i' I've you know tried to get better at it tried to get better exactly what you're talking about which is having more clarity of thought come out in my speech um there's one right there but like you know Tim to your point like I've I've seen you get better at it but it is a skill that you have to kind of sharpen a little bit here and there yeah I'm going the other way with it though I just want to say nothing but expletives yeah and make no sense so I think I'm nailing that another thing that I noticed uh I'm just kind of like changing the topic a little bit but watching our content it's I see I know how my mind works when it comes to being on shows and stuff and I'm I've said this a million times I'm a better producer than I am being on camera that's not to say I think I'm bad on camera but I think I'm a good producer and I'm always thinking about the content about what the people are",
            "start": 1801.92
        },
        {
            "text": "times I'm a better producer than I am being on camera that's not to say I think I'm bad on camera but I think I'm a good producer and I'm always thinking about the content about what the people are seeing and so the flow of conversation the way we we speak to each other isn't necessarily how we speak to each other it's how we want them to hear us talking to each other you know and I feel like sometimes we break that and then then it just turns into a closer **** of everyone talking over each other but we're pretty good about not doing that and I think there's a lot of times when um I won't get my point across or someone won't get their point across and I think it's because they're letting other people speak because it's not a good show to just constantly make sure that you're saying exactly what you want to say the way that you want to say it sure you know just sit there and preach every time just go around and four people preach yeah yeah well you've also got me so I interrupt",
            "start": 1841.72
        },
        {
            "text": "exactly what you want to say the way that you want to say it sure you know just sit there and preach every time just go around and four people preach yeah yeah well you've also got me so I interrupt constantly I notic that yeah anytime it's the natural segue you **** it up for me so thanks for that that's my goal that's my New Year's resolution 2016 I was G to slap you **** up yeah bu Yeah Tim what's your resolution I had a whole bunch of them I think that my the main one that I know that I I'm least likely to actually accomplish is kind of the opposite of what Colin's saying which is to just consume more and do more and it's not necessarily just media but uh in some ways that are media things like Walking Dead I have just avoided Walking Dead Forever you know I knew I would like it but I just was like I haven't read the comics I haven't watched the show I haven't whatever at this point I'm now completely caught up on pretty much everything Walking Dead and I'm like I can now",
            "start": 1880.68
        },
        {
            "text": "it but I just was like I haven't read the comics I haven't watched the show I haven't whatever at this point I'm now completely caught up on pretty much everything Walking Dead and I'm like I can now speak intelligently on that in the way that I could before about Star Wars or Pokémon or whatever all my interests you know and I like have you read the novelizations though Rise of the Governor I have not big fan um right am I right but I like that we could now talk like if we did a Reacts on anything Walking Dead I could be a part of that you know aw and and I like that I like being able to have new things that I'm really into and even more than the content though like I want to just go experience something so we can come back and talk to this show because this show you know it is what it is and we love it but how many times can we talk about the same thing infinite that's the answer but I want to add some more to that like me and Nick I want us to go do a spin class I don't know what",
            "start": 1919.88
        },
        {
            "text": "is and we love it but how many times can we talk about the same thing infinite that's the answer but I want to add some more to that like me and Nick I want us to go do a spin class I don't know what spin what a spin class is let's do that just so we can talk about it that could be a topic you know definitely do a spin class together that's what you want but you get what I'm saying though like dumb **** like that just doing things and the reason I think it's least likely to happen is because our schedule's not any less crazy than it was last year you got to make time that's the whole thing we just got to make time and do things and uh and the traveling thing I'm not a big traveler I don't like but we'll see how all this stuff goes and I'd love to have stories about doing things yeah I respect that I mean like to me you know it's it's a matter of what's most important like my own sanity or just having things that I could possibly off at some point and I used to be the like the ladder",
            "start": 1960.4
        },
        {
            "text": "that I mean like to me you know it's it's a matter of what's most important like my own sanity or just having things that I could possibly off at some point and I used to be the like the ladder where I was like well I want to play as much as humanly possible so I can talk about them and I'm like well this my my this information is not even really that valuable I half these games don't even come up some of these some of this is just outright obscure and I really just feel like by shaking shit up in my life as much as possible I become reinvigorated about the things I love again so like the only constants in my life of the things that I do every single day of my life is like I listen to a lot of music every day and I like do some sort of reading every day other than that it could I can watch a documentary I can watch TV show I drink with friends I can travel somewhere I can go off the grid like I did in September for like a week when I was in Connecticut I could you know do a lot of",
            "start": 1997.6
        },
        {
            "text": "a documentary I can watch TV show I drink with friends I can travel somewhere I can go off the grid like I did in September for like a week when I was in Connecticut I could you know do a lot of different things and to me I feel so because I walked away from like gaming every day of my life for the last few months of the year which was like an awesome choice and I'm so glad I made that choice I'm like super reinvigorated right now I'm messing around with The Banner Saga and I'm playing Tharsis and I'm excited about Volume on Vita and and we have Gone Home and I'm you know like go to mention ghost so I'm I'm like really stoked now about games cuz I'm like I took a break you got to take a break from shit you know you can't just consume for consumption sake that's that's that's kind of been my Mantra so you know I think you and I take a different tact on that although I respect the idea of like being well rounded me again I'm not saying everything you know I'm talking about like with",
            "start": 2034.24
        },
        {
            "text": "my Mantra so you know I think you and I take a different tact on that although I respect the idea of like being well rounded me again I'm not saying everything you know I'm talking about like with The Walking Dead when I get into something I get into it you know and I I like want all of it I want more and then it's things like that it's not about I was going to say if anything on the same track you are of like yeah he's going to pick what he wants to do and go do it's just more picking more things and like I think in terms of real life stuff it's leaving my comfort zone a little bit just to be able to have new experiences to talk about cuz I think that that's relevant like that's making this show better yeah um all the shows better other things that are just there are New Year's resolutions for me always is going to be you know I Want To Do List videos I want to do comedy videos I want to do rap videos you got to do one of the comedy videos and all that yeah exactly but like all those",
            "start": 2069.36
        },
        {
            "text": "for me always is going to be you know I Want To Do List videos I want to do comedy videos I want to do rap videos you got to do one of the comedy videos and all that yeah exactly but like all those things that's I I want to do that I want I hope that there's I reach a point in my life that those aren't resolutions that aren't going to happen sure this year might be the year who knows um in terms of making content that it's a New Year's resolution that I'm going to stick to I have to do this is I want my social media game to be stepped up and I I don't mean that in the stupid like superficial way of that people would take that of oh Tim like social media and stuff it's like I think that that is a strength that I have and especially in terms of this group the thing that could make me stand out is I could be the guy that does the funny Vines and the and is on Snapchat and all that and it's like that could give me a pillar to stand on and I want to come up with a plan where I'm making",
            "start": 2104.32
        },
        {
            "text": "out is I could be the guy that does the funny Vines and the and is on Snapchat and all that and it's like that could give me a pillar to stand on and I want to come up with a plan where I'm making content for Instagram for Vine and thinking that that way instead of just oh I'm doing this I could take a picture and just post it sure you know um and I really want to focus on growing all that stuff cuz I think it's it's very valuable and that's the future and the same way that we look at YouTube now and we're like all right that's the future of internet video well it's becoming just the present what's next and sure I want to keep us going you know M um I also want to support people more I've always been big on supporting people but I feel like now especially that we have such a position of influence like power of influence like we can tell people check this out and they will and I think that uh that's a very valuable thing and you know you guys have been using it for a long time in terms",
            "start": 2144.32
        },
        {
            "text": "like power of influence like we can tell people check this out and they will and I think that uh that's a very valuable thing and you know you guys have been using it for a long time in terms of getting people's eyes on smaller games or bigger games or whatever it is like Gone Home like how influential were you in Gone Home's success I'm not saying you get full credit no yeah but I was part of it yeah said that and it's things like that that that are huge and to see all the tweets I get about like oh thank you for recommending Amplitude I'm like I love Amplitude that's no problem you didn't know about Amplitude that's great you know and uh I've always been about that music and stuff but even more than just telling people to listen things it's also like I've learned a lot and there's been so many moments in my life where people have reached down to me and been like hey like you should learn how to do this I like at like Burnie from Rooster Teeth and a lot of stuff like that where I'm",
            "start": 2183.0
        },
        {
            "text": "so many moments in my life where people have reached down to me and been like hey like you should learn how to do this I like at like Burnie from Rooster Teeth and a lot of stuff like that where I'm like oh you guys are doing this stuff and when I talk to them they're not holding secrets from me they're like here's how like you're doing great here's how you can succeed if you just do this too sure and I'm like oh shit I want to do that for people like there's there's so many of the the Best Friends out there doing stuff and I support that yeah like I'm very happy very proud of them like building things doing all these different the number of people who hit us up and say because you I'm inspired and I went and did this because of you and it's not just like making podcasts like I'm not even talking about just that it's like doing whatever it is so many people took our story and yeah like I quit my job and I'm making this game or I put out this music album where I did this exactly and",
            "start": 2223.36
        },
        {
            "text": "talking about just that it's like doing whatever it is so many people took our story and yeah like I quit my job and I'm making this game or I put out this music album where I did this exactly and I I think that uh Patreons are a huge push like I reached out to to recently I'm like dude you need to get on Patreon like I feel bad doing what I do for a living and getting paid for it and you're not like you're an artist you should be why aren't you doing this you know it's like that type of shit where it's like it's on me to educate people I'm just like I know how to do this here's the secrets they're not secrets you know so I want to do that a lot more too and then this sounds like a joke but it's not don't laugh everybody a huge goal for me I want to make a 30 under 30 list specifically the Forbes Gaming 30 Under 30 list okay and I think I got a lot of work to do to do that I got a couple years though so I'm not necessarily saying this year is going to be my year because we I got",
            "start": 2257.0
        },
        {
            "text": "the Forbes Gaming 30 Under 30 list okay and I think I got a lot of work to do to do that I got a couple years though so I'm not necessarily saying this year is going to be my year because we I got what three three left how old are you  6 now so I don't know how the the cut off dates work three or four that I have um but I think that with growing Kinda Funny and doing all this stuff I think I have a shot I just got to figure out the qualifications for that I'm going to need some help from people at some point but I really want to do that and I want it to be I guess that's another thing is I want I need I feel like I need to do a better job of um explaining myself and what I do so I'm not just known as as the the young guy and you know what I mean like the the kid guy and like oh the the other you know the other half the guy that everyone confuses for Nick no offense we have the same beard and haircut uh but it's one of those things where it's like I want to kind of be recognized for",
            "start": 2292.0
        },
        {
            "text": "other you know the other half the guy that everyone confuses for Nick no offense we have the same beard and haircut uh but it's one of those things where it's like I want to kind of be recognized for what I think I'm good at and I think that I'm good at the the strategy stuff and people like oh Tim's the YouTube guy but it's like I want them to know what that means I want them to know it's like no I actually do have a business mindset about this stuff and I enjoy that shit I mean you should do one one of your topics should be how you do everything because I think it's fascinating the way you go and look at Arch terms and this and what you do for thumbnails and all these different things just do a class do that I'll just hold the Whiteboard and you just go and talk about what you do but yeah cuz all that stuff it's it's really fascinating to me and it's I I just want to be known for that because I think that we're doing really cool shit and I think that's my in for the 30 Under 30 so",
            "start": 2341.88
        },
        {
            "text": "cuz all that stuff it's it's really fascinating to me and it's I I just want to be known for that because I think that we're doing really cool shit and I think that's my in for the 30 Under 30 so I'm like I need to keep pushing that speaking of the cool shit we do Kevin I need you to go out to the table where the booze is the little booze table the non Bourbon and grab the two boxes you know you understand what I'm saying you follow me on this one big guy he's going to bring back two boxes of chocolate that would be awesome he just brings back two empty CW boxes he's like I don't know you know how Kevin is I think he just figured it out he just figured it out he's figured out he's a smart guy um yeah I mean if we're looking ahead while looking back or whatever it's important to finally share this we've had these for a couple days now or whatever thank you all for our success you Tim and Nick you can do it unbox these bad boys put them up there so before we we even show these",
            "start": 2373.44
        },
        {
            "text": "share this we've had these for a couple days now or whatever thank you all for our success you Tim and Nick you can do it unbox these bad boys put them up there so before we we even show these there's a backstory to this and that backstory is that back when we were at IGN um YouTube started this program where if you get a certain amount of subscribers like they send you these Awards and whatever if you get a million subscribers you get this big old gold one if you get 100 000 you get this like smaller silver one and uh I remember when Google came to IGN was like Hey we're going to give you all this money to make YouTube channels and start happened and like you know with Up at Noon with all that that was like in a lot of ways we made that happen where we were like it was our baby to get subscribers for that shit and it hit 100 and we eventually they sent us these things but it wasn't ours we didn't own it we helped build it we did all that but we didn't own it then we started this",
            "start": 2413.72
        },
        {
            "text": "subscribers for that shit and it hit 100 and we eventually they sent us these things but it wasn't ours we didn't own it we helped build it we did all that but we didn't own it then we started this shit and I remember we we were having a talk at First Amendment and we're like we need that we need that to be ours we now have two of them yeah so yes we got our silver play buttons from YouTube Thanking us on 100 000 Subs now if you're watching this you might say you guys have had 100 000 subs for a long time correct and what I thought would happen is that when you hit 100 000 you just yeah when you when you hit 100 000 Subs I thought they just sent you the button and then it turned out after 9 months of not having the button I asked somebody and they're like no you got to request the button so I requested the button so we have two buttons this is the coolest thing in the world it's very awesome and it means a lot to us I'm thinking about trying to figure out how to make one of these",
            "start": 2458.32
        },
        {
            "text": "so I requested the button so we have two buttons this is the coolest thing in the world it's very awesome and it means a lot to us I'm thinking about trying to figure out how to make one of these like an actual functional button you know I mean where you PR and something happens maybe turn on the lights maybe flush your toilet maybe order something from Amazon every time someone it Cameron Diaz movie where if she hits the button she gets a million dollars but kills somebody oh that was actual instant conent or that movie no the movie it did terrible apparently did I never saw it so we got to hang these somewhere in here I assume but On's for Kinda Funny Games and On's for Kinda Funny yeah so thank you all thank you all everyone watching this this is a big big moment for us I got choked up reading the letter of course it's pretty amazing um yeah to to M Tim sentiment it was it was an interesting it was always sort of Bittersweet accomplishing things in uh at IGN because you know we",
            "start": 2493.04
        },
        {
            "text": "up reading the letter of course it's pretty amazing um yeah to to M Tim sentiment it was it was an interesting it was always sort of Bittersweet accomplishing things in uh at IGN because you know we had a great team to do it but yeah it's it didn't say I don't know this this to me like um although just realized that it's oh no it's right okay I was upside down um you thought they misthought it spelled I was like cuz the 's look like NS or it doesn't matter um looking at it that would be that would be afoo for me though wrong you know looking at it like it says Kinda Funny but in reality it says all of our names and that's that's the most important thing to be these are two representations of things we did these are ours we did this we made this happen for point of uh just for a point of reference when you hit a million you get the gold but when you hit 10 million Tim what do you get you get the diamond and at that point they don't even put it in this case they just send you this",
            "start": 2526.76
        },
        {
            "text": "of reference when you hit a million you get the gold but when you hit 10 million Tim what do you get you get the diamond and at that point they don't even put it in this case they just send you this diamond shaped play button yeah it's amazing one day one day one day always something to look forward to one day indeed",
            "start": 2568.56
        }
    ]
}