{
  "id": 1483,
  "video_id": "t_OLv-sWpwQ",
  "show_name": "Gamescast",
  "hosts": ["Greg Miller", "Tim Gettys", "Colin Moriarty"],
  "title": "Games of the Year 2015 - Kinda Funny Gamescast Ep. 52",
  "description": "We all give our top 10 favorite games of 2015 and discuss our game of the year. (Released on Patreon 01.08.15)\n\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
  "published_at": 1452871515,
  "duration": 6048,
  "transcript_chunks": [
    {
      "text": "What's up guys? Welcome to the first ever episode 5 of the Kinda Funny Games Cast. As always I'm Tim Gettys joined by the coolest dudes in video games on my other side and it's kind of weird Colin Morardi and Greg Miller. It's good to be here with you today. Now today it's January 5th 2016. It's our our one year anniversary of doing this full-time doing that whole thing. We're doing the escape. Yeah it's it is the escape. We're gonna do our game of the year discussion. It's gonna be exciting. We haven't really talked about what that means or what that show is going to be or how it's going to go. But uh what you guys do know is what the first three topics of this show are and that is each of our top 10 favorite games of 2015. We're not talking best games. We're not talking you know these are our favorite games. Our favorite games of 2015. Sure. Okay. So we're gonna do all that. Colin had the brilliant idea. I didn't tell you about this yet Greg but it's going",
      "start": 0.33
    },
    {
      "text": "you know these are our favorite games. Our favorite games of 2015. Sure. Okay. So we're gonna do all that. Colin had the brilliant idea. I didn't tell you about this yet Greg but it's going to be easy for you to We're going to do them in alphabetical order. That's going to be easy for me. All right. Well I mean it's you know one of the first things you learn ever. But I have to go through the alphabet every time. I got to go through the alphabet every time I do it. Well this is why you write them down like this. Yeah but I put them on the internet and on the iPad. I'm sorry. Well you have time. You'll have time to do it. So we're going to do that. We're going to talk about our favorite games in alphabetical order because we don't want to you know throw get people on the scent for the game of the year discussion which is the final topic. Now during that topic we'll talk about what that even means for Kinda Funny okay? And how we're going to do are we going to have",
      "start": 51.28
    },
    {
      "text": "for the game of the year discussion which is the final topic. Now during that topic we'll talk about what that even means for Kinda Funny okay? And how we're going to do are we going to have one game or we just going to just choose one figure out? That's going to be that's going to be a fun old time. For those of you that don't know this is the Kinda Funny Games Cast. It's a show where every week we talk about all the cool things happening in video games or just whatever we really want to talk about in relation to video games. Now today is a little bit different because while we're recording this we are also live streaming over on Twitch TV. Twitch.tv/Kinda Funny games to all the big beautiful kids out there in support of Kinda Funny the animated series. If you haven't seen that go to youtube.com/kindfunny. Watch that video. Then go to patreon.com/kindafunn. Support to make more of those shows happen. gonna be good for all of you. Now if you want to support this",
      "start": 88.88
    },
    {
      "text": "seen that go to youtube.com/kindfunny. Watch that video. Then go to patreon.com/kindafunn. Support to make more of those shows happen. gonna be good for all of you. Now if you want to support this show you go to patreon.com/kindfunnygames. That's a whole other thing but it's good there too. If you don't want to do that youtube.com/kindfunnames. How many URLs can I say before gets excited? You could say you could just go to the brand new kindafunny.com. That is very true. All of it's there for you. Yes kindafunny.com is new and improved and it is amazing. There's a whole bunch of cool stuff there. And as of right now should be working perfectly. That's what I hear. I got to go be in the chat room on the front page of it. Oh yeah. Yeah there's a new chat. So you can log in with your your forum account username and then just chat away. Yeah. It's like Twitch but on our own website. Exactly. But better cuz it's ours. Yes. All right. I'm going to start this one off.",
      "start": 126.96
    },
    {
      "text": "in with your your forum account username and then just chat away. Yeah. It's like Twitch but on our own website. Exactly. But better cuz it's ours. Yes. All right. I'm going to start this one off. Obviously I am the I'm the most Tim out of the three of us. You are the most Tim out of all. I always said that about you when it comes to these video games. So it's I feel like my list is going to be a little bit the most different out of all this. Maybe Colin's is gonna have a bit more of the obscure randomy things going on because you are one Colin Morardi. You are the most Colin of among. That is true. That is true. I'm coming for you though Greg. To be the most Greg. Yeah we'll see. We'll see. But I'm I'm going to start this off and I'm going to start this off right about a week ago. A little game came out called Amplitude. There is no better a game than Amplitude. I want to tell you guys all about my favorite game of all time. Now we're counting when it came out for",
      "start": 163.12
    },
    {
      "text": "a week ago. A little game came out called Amplitude. There is no better a game than Amplitude. I want to tell you guys all about my favorite game of all time. Now we're counting when it came out for Kickstarters presumably because it did come out today. That's the thing. My list my rules. I'm making **** up. I played the hell out of this game in 2015. Sure. And I that was my whole break was playing this game. So the original came out in 2000. I've talked about it many times on the show as being one of those random games that I really latched on to and loved. And I played the living hell out of that growing up and just like getting better and better and better at it. And I'd play through every difficulty and I actually wanted to get better scores just for myself you know what I mean? It was one of those things where it's like it meant something to me to to beat each song on insane difficulty and whatever. So I would play through that and then I remember once Guitar Hero started",
      "start": 206.72
    },
    {
      "text": "It was one of those things where it's like it meant something to me to to beat each song on insane difficulty and whatever. So I would play through that and then I remember once Guitar Hero started and once uh then Rock Band and all this stuff I was really into those games. Love all of them. I'm a big fan of rhythm games in general but none of them were Amplitude. And I was always like man like I wish that we can get that again. Then we got Rock Band Unplugged on the the PlayStation Portable. Yeah it was amazing and awesome. They should have just made that again. Yeah. And I was really really really really happy with it because I was like \"All right this is essentially Amplitude but Rockbandified. I'll take it.\" Like that's the closest we're ever going to get. Then we got a game called Rockband Blitz that was a downloadable title for the PS3 and Xbox 360. And it it was Rockband Unplugged but on consoles but even more nearly as good as Rock and really really really dumbed down.",
      "start": 249.52
    },
    {
      "text": "Rockband Blitz that was a downloadable title for the PS3 and Xbox 360. And it it was Rockband Unplugged but on consoles but even more nearly as good as Rock and really really really dumbed down. So the problem there was that it would take any songs you you had in any of the Rock Bands and just kind of like based on how it sounds assigned beat matching and stuff. So it was kind of just like it it felt like a fan-made game overall. And uh I I didn't play it for more than like two hours total I think. M then all of a sudden they announced this Kickstarter and I'm like \"Oh my god like we're actually going to get another Amplitude game.\" Now I'd played Frequency big Frequency fan. I prefer Amplitude over it. But then we heard that this game is going to have the Frequency Tunnel as well and I'm like man okay they're really kind of giving the people what they want with this thing. Let me see if I get my hands on. I played it a bit at events and stuff and I loved it at every event",
      "start": 289.52
    },
    {
      "text": "and I'm like man okay they're really kind of giving the people what they want with this thing. Let me see if I get my hands on. I played it a bit at events and stuff and I loved it at every event I played it at and I was like oh crap they nailed this. It's Amplitude. And what does that mean to me? That means it's the most perfect music like rhythm game because it is literally about making the music as you go. Guitar Hero and Rock Band they're a bit more about like if you hit the notes it'll it kind of feels like you're playing it but really it's just more like yeah we're just having you hit things when it sounds like the music's playing. Whereas with Amplitude like you're literally playing each instrument and if you don't do them that track just doesn't happen. So it compared to any other rhythm game I've ever played it's way more exact and it's way more like you use the the shoulder buttons and stuff and it's not just like like things like DDR where there's it there's",
      "start": 334.16
    },
    {
      "text": "to any other rhythm game I've ever played it's way more exact and it's way more like you use the the shoulder buttons and stuff and it's not just like like things like DDR where there's it there's the beat and there's every like the the fourth notes eighth notes 30 seconds 16 whatever. That's it. With amplitude that's all out the window. It's down to the this millisecond of when the actual thing's happening because a lot of it's like drum and bass tracks and stuff like that. So it's it's all over the place. I don't know the the drum um verbiage and stuff but the nomenclature is the exact high hat snare. There's definitely high hats and snares. Kick drum. Kick drum. Yeah. Give me 48s of a kick drum right now. 48 of a kick. What's that mean Colin? 48 of a kick drum. I never heard that particular term when I grew up in the streets like I did. No I you c I certainly didn't. Um anyways so I I was I've been playing this game. Now a big thing about the original Amplitude was so",
      "start": 374.72
    },
    {
      "text": "that particular term when I grew up in the streets like I did. No I you c I certainly didn't. Um anyways so I I was I've been playing this game. Now a big thing about the original Amplitude was so frequency had a lot of this like music no one no one's ever heard of. Some um like drum and bass stuff that I guess is popular to people that know that music but but to people that didn't know electronic music it's like new right? Sure. Then Amplitude came out and it had Blink 18 and it had POD and it had Slipnot and it had um No Doubt and all these like like random things. Not No Doubt garbage. Wow. And um Manson it kind of it introduced me to a whole bunch of music and stuff which is my favorite thing about music games. But that's kind of why I loved it was it had this eclectic um range of different styles and different genres and stuff. I'm kind of treating this as my Amplitude review because we didn't get a chance to This is like Yeah. the game we haven't talked about. Exactly.",
      "start": 422.0
    },
    {
      "text": "of different styles and different genres and stuff. I'm kind of treating this as my Amplitude review because we didn't get a chance to This is like Yeah. the game we haven't talked about. Exactly. It means so much to me that I'm like I got to give this game its praise. Um so then this game came out and we knew early on because of the Kickstarter and stuff that there wasn't going to be licensed music. All the music was going to be either you know from Kickstarters themselves or made by Harmonics or from their friends and stuff like that. Just like or from other games. Transistors in there a couple other games. Transistor by 311. No Transistor the game by Super the best albums of all time. Um and it's I started playing it and instantly it's like all right this is Amplitude. It's the beat matching to that exact exact exact moment and you start playing it and you start remembering the rhythm and **** and it does that thing music games do where you just get in the zone. But",
      "start": 469.84
    },
    {
      "text": "the beat matching to that exact exact exact moment and you start playing it and you start remembering the rhythm and **** and it does that thing music games do where you just get in the zone. But Amplitude does it differently where yeah Guitar Hero you start going it's just like whoa I can't believe I got through that because Amplitude is set so it's track by track you make the music for this instrument happen then move on move on but there's a split second to move tracks over. So it's like you need to be like kind of multi-managing everything at once. it. You just get lost in it and you just get that tunnel vision and just in the zone of what you're doing and it's unlike any game I've ever played. Like I'm just like I just get entranced by it and especially you put on headphones and just go. You always talk about this idea of VR just getting lost in something. I would love to just sit with Amplitude and just go. Um and you start playing through the songs and it's all like the the",
      "start": 510.24
    },
    {
      "text": "go. You always talk about this idea of VR just getting lost in something. I would love to just sit with Amplitude and just go. Um and you start playing through the songs and it's all like the the single player is the campaign. It's a 15 song um concept record which is kind of cool. It's a cool idea. It's like someone this this woman's in a coma and it's like they're trying to like get her out of it and it's like what's in her head and like she hears all these people talking to her and stuff um around her as she's in the coma. Yeah. Spoiler alert she wakes up at the end. Oh my god. You win. If you don't win she doesn't win. Does she have like use of her arms and legs and stuff? No. Have they atrophied how long she been in the coma? The doctors think she get out of the coma. They didn't. No. Once you get Does she have like full range of motion? Can she cognitive abilities where they should be? Um you go through a cognitive sector. That's about as close to the information I can give. I",
      "start": 546.48
    },
    {
      "text": "Once you get Does she have like full range of motion? Can she cognitive abilities where they should be? Um you go through a cognitive sector. That's about as close to the information I can give. I don't know if that checks out medically. Anyways it's it was really cool and I I remember playing it playing the songs for the first time being like \"All right whatever.\" Like \"These songs aren't memorable to me.\" And then they get stuck in my head and now they're still stuck in my head. I can't tell them apart but I'm like \"Oh every time I'm thinking of it a different song is stuck in my head.\" So I'm like \"All right they did something right.\" Like these are catchy and memorable for what they are. Biggest flaw of the game is the fact that all the songs sound the same. Like yeah it is all there's not that the beauty of Amplitude was one song is Slipnot and one is garbage and one is a rap song and one is whatever like Run DMC was in it like it's just it was so eclectic. This is",
      "start": 585.2
    },
    {
      "text": "is all there's not that the beauty of Amplitude was one song is Slipnot and one is garbage and one is a rap song and one is whatever like Run DMC was in it like it's just it was so eclectic. This is not eclectic at all. This is so the same thing just drum and bass electronic music which is great but I think that's a turnoff to a lot of people. You still I was going to say which is a turnoff for me. I I mean I'm not I know I know this isn't this is your game. We're not like debating this game but I mean for me it was like I I did the let's play with you where you were playing it on like the extreme and crazy difficulty and I was like I don't even want to try this. And then I talked to some other people like all right. And I came home and I played it on a normal difficulty and I was like oh yeah and it kept reminding me of Rock Band Unplugged which I loved and was great at. But then it was just like I don't know any of these songs though and this just isn't like I'm not motivated to",
      "start": 618.96
    },
    {
      "text": "oh yeah and it kept reminding me of Rock Band Unplugged which I loved and was great at. But then it was just like I don't know any of these songs though and this just isn't like I'm not motivated to keep going. Gameplay is you know solid. I get it don't get me wrong but for me the hook wasn't there. Yeah. And I guess I'm coming in at it with the fact that the hook was already there for me and the fact that I liked those songs. So coming into this it's like I just want that gameplay. Like by the end of Amplitude where I'm just trying to like boost my like stars and all that stuff or bars or whatever it is. I didn't care what song I was playing. I just wanted to do better at it. Sure. And that's kind of all already where I'm at. And I love the leaderboard system. Like it's the one of the first times I've ever It is probably the first time I ever cared. And I **** like just climbed that **** Like I'm even right now I'm like top 5% in the world. Come at me. What are you going to",
      "start": 656.8
    },
    {
      "text": "first times I've ever It is probably the first time I ever cared. And I **** like just climbed that **** Like I'm even right now I'm like top 5% in the world. Come at me. What are you going to do? Andrea Renee Tim Gettys she's talking **** Come on. Does she know who I am? You talk **** Andrea Renee. No we should play some Amplitude though. It's a great game. Um but anyway there's a there's one song from Skull Girls and it's the only song that's it's like a a jazzy song and I'm like \"Oh wow. This is what I remember from Amplitude of like the variety and shit.\" And I'm hoping that we get some DLC and I think we will and I think it's going to be be really good. But I'm gonna be playing that game for a long time. Like I I want to platinum it. I want to platinum it very bad. First game your first platinum all it would be. The problem is it was one of those things where I'm like I started playing I'm like I want to",
      "start": 690.32
    },
    {
      "text": "I I want to platinum it. I want to platinum it very bad. First game your first platinum all it would be. The problem is it was one of those things where I'm like I started playing I'm like I want to platinum this. Then I saw the trophy list. I'm like I could never platinum this. That list is so hard. Then I'm like you know what? I'm going to try though. And so now I'm kind of in that thing of like some of the challenges seem a little out of reach. Um and the game is kind of designed to like push you back. Like the the the campaign system gets a little wonky. Like you can't replay a specific song. you have to replay the whole damn career. So if I **** up one song yeah that's it. But the whole career is 45 minutes. So it's not like it's that big of a deal. But you know after a few fuckups towards the end when I'm one of the um trophies is like beat the entire career on expert in without dying or retrying or stopping and so in one sitting and I'm like well I can't really beat the",
      "start": 724.8
    },
    {
      "text": "towards the end when I'm one of the um trophies is like beat the entire career on expert in without dying or retrying or stopping and so in one sitting and I'm like well I can't really beat the last songs in one sitting. So this over and over and over and over again. So we'll see. I'm hoping this dream of YouTube stardom and just focus on that. I will be the Amplitude Master. There you go. But anyway Amplitude. If you if you haven't checked it out please do because I do think that uh you're our only hope of getting DLC. Um next up Emily is Away. Ah yes. We did a let's play of this. Did you play this at all or did you see the let's play? Do you know? Uh no. I know what it's about but I have not played it yet. Sounds very nostalgic. For those of you that don't know you'd love it. Emily is Away is a it's a Steam game and uh it's the story of a high school kid graduating to go to college as he is using um AOL instant messenger to talk to a girl. Just a girl. Yeah. It's not his",
      "start": 764.48
    },
    {
      "text": "Emily is Away is a it's a Steam game and uh it's the story of a high school kid graduating to go to college as he is using um AOL instant messenger to talk to a girl. Just a girl. Yeah. It's not his girlfriend but then it's kind of the story over four years of their aim conversations and you just it's kind of a choose your own adventure type thing but uh it's not direct like you have three options but you're not really sure where they're going to lead you and stuff. And it's a short game 50 minutes. I don't want to spoil it for you. And that was with you and I **** around making jokes doing a let's play whatever. So like real talk probably 35 to 40 minutes to go through the whole thing. But there's multiple branching stories and I've seen so many people tweeting me be like \"Oh dude I got this.\" And I'm like \"Whoa really? That sounds cool.\" Um one of the greatest ends to a video game I've ever experienced. Really? Oh yeah. Okay. I mean that it hit me. Oh yeah. No",
      "start": 808.08
    },
    {
      "text": "dude I got this.\" And I'm like \"Whoa really? That sounds cool.\" Um one of the greatest ends to a video game I've ever experienced. Really? Oh yeah. Okay. I mean that it hit me. Oh yeah. No you and I were devastated. Yeah. It got us. It took out our legs for sure. So bad. Like the thing that it happens is just like oh that let's play remember we finished it and we're like let's let's try again. Let's re let's go back and make this choice and do that and d we jump right back into it. And it the reason I think it's so good is that it is so relatable. Like that story and the the doing it brings you back. It instantly brings you back. Seeing the buddy icon seeing hearing the noises doing all that you're just like engrossed in it. And it's disturbing because it's like all the what things you **** up 10 years ago. Playing it again and having a character **** it up in the same way and like get at the I'm like \"Oh man this is like it's too real. Shit's too real. Too real.",
      "start": 854.56
    },
    {
      "text": "things you **** up 10 years ago. Playing it again and having a character **** it up in the same way and like get at the I'm like \"Oh man this is like it's too real. Shit's too real. Too real. I understand. But again emotions is one of the reasons you play video games you know like having the way having it affect you and stuff. And I think Emilio's Away is uh probably the the most emotional experience I've had with a video game this year. Interesting. Next up this one came very very very late in the year to me. This uh later than Amplitude. Yeah. No this this winter break for me was like I killed it. Okay. Killed it. I was working on this this stream that's happening right now and I every I needed a break. So I'm I'll play a little bit Amplitude. I'm I'm play a bunch of other stuff on my list right here. But this random game someone tweeted at me called Freedom Planet. Oh yes. You were talking about Do you know about this game Colin? No. No. So Freedom Planet it came",
      "start": 893.76
    },
    {
      "text": "stuff on my list right here. But this random game someone tweeted at me called Freedom Planet. Oh yes. You were talking about Do you know about this game Colin? No. No. So Freedom Planet it came out on Steam last year. It is. They announced Freedom Planet . So it's like it's an established thing. Freedom Planet came out on Wii U in late October I think on the eShop. I just downloaded it started playing it based on one tweet from from one of the best friends out there. And he was like Tim if you love Shovel Knight you need to play Freedom Planet. Interesting. It is to Sega what Shovel Knight is to Nintendo. And I was like don't know what that means exactly but my gut tells me it's reminiscent of Genesis sidescrollers like Sonics and stuff like that. I'm like well I loved those games so I want to check this out. looked at the YouTube video and I'm like oh man this is another one that I'm hoping there's people out there that haven't really got into this yet or",
      "start": 935.52
    },
    {
      "text": "loved those games so I want to check this out. looked at the YouTube video and I'm like oh man this is another one that I'm hoping there's people out there that haven't really got into this yet or checking it out because I think a lot of people are going to be really impressed like whoa this is exactly what I'd want it to be. Cuz I remember when you first saw Shovel Knight what was your your reactions to that? It was incredible. I mean I I revealed that game um I saw before anyone knew about it and I and I was uh it it scratched very specific itches in me. I knew that game was going to be huge. I **** knew it from the that's why I took the exclusive in the first place and and wanted to talk to those guys because I knew that that game was going to be massive um for people like me. So it was it reminded me of the old days of when you know gameplay was king. That's what it reminded me of. Yeah. So this uh similarly it reminds me of Sonic which means it's not perfect. Like that's",
      "start": 984.8
    },
    {
      "text": "So it was it reminded me of the old days of when you know gameplay was king. That's what it reminded me of. Yeah. So this uh similarly it reminds me of Sonic which means it's not perfect. Like that's the thing. It has all of the kind of quirks and stuff that Sega games did but it sounds like a Sega Genesis game sounds modernized. you know in the same way that you hear Shovel Knight and it's like NES games weren't really doing that but it's like it sounds like you remember them. And I'm like whoa this is great. There's multiple characters. It's just kind of like Sonic, Knuckles, and Tales. They each have their own different power-ups and stuff. I started playing through and it's like there's this ridiculous storyline that like there's animals being taken over by robots and stuff. I'm like \"All right, it's Sonic.\" But what they even nailed even further is they made a game that is reminiscent of my memories of Sonic the Hedgehog growing up which are the Genesis games and the",
      "start": 1020.64
    },
    {
      "text": "I'm like \"All right, it's Sonic.\" But what they even nailed even further is they made a game that is reminiscent of my memories of Sonic the Hedgehog growing up which are the Genesis games and the Saturday morning cartoons. So somehow they melded that together and there's like an actual plot and storyline with voice acting, like overdone voice acting and it's perfect because it's so reminiscent of a Saturday morning cartoon. And so it's like they nailed in the way that Shovel Knight nailed that kind of Nintendo thing where it's like it's not quite Mega Man, it's not quite Mario, it's not quite Zelda, it's not quite Castlevania, whatever. It's just it's all those little bits and pieces here and there. They nailed that for this where it's it's Sonic gameplay at its core, but it sounds like every Genesis game and the characters play like other Genesis games you remember and stuff like that. I'm like and but it's in that style. like it has that it does have that look of just like",
      "start": 1056.64
    },
    {
      "text": "like every Genesis game and the characters play like other Genesis games you remember and stuff like that. I'm like and but it's in that style. like it has that it does have that look of just like Genesis just looked different than Super Nintendo blast processing, son. It had that blast processing and it's all over this and there's no other game besides Sonic that you see these characters moving and then all of a sudden going into 3D space and going up a halfpipe and like running on walls and stuff and it's like to be able to do that again in a game that feels solid and is actually like quality I was like whoa. Um so Freedom Planet definitely surprised me and came out of nowhere. What is and it's what is it on again? Wii U. Okay. Wii U. Yeah, the Wii U shop and Steam. Gotcha. Um, $15 and it's super awesome. Next up, no surprise at all. Mario Maker, man. I love that game. That's a game I'll be playing for years. I feel like How often are you checking on it? How often I check in on it?",
      "start": 1098.16
    },
    {
      "text": "it's super awesome. Next up, no surprise at all. Mario Maker, man. I love that game. That's a game I'll be playing for years. I feel like How often are you checking on it? How often I check in on it? I I It's one of It's a break game for me. It's like I'm working and I'm like, \"All right, I'm just going to play a couple levels.\" The thing that keeps me coming back is how involved the community gets with it and how involved my community specifically seems to be into it. So the people I follow on Twitter, you know, so when you see the the Patrick Kepics and like everything him and Dan did with Mario Maker this year was amazing. It's incredible, you know, and you see that stuff and it's inspiring of just like wow this game's really kind of capable of a lot. But then, uh, I started following Patrick's like just Kotaku articles where he talks about oh like there's these cool levels to check out. there's these cool levels and I read about it I'm like \"Oh man, I need to get into I I",
      "start": 1139.56
    },
    {
      "text": "Patrick's like just Kotaku articles where he talks about oh like there's these cool levels to check out. there's these cool levels and I read about it I'm like \"Oh man, I need to get into I I want to play that. I want to do that.\" Yeah. And then I'll see other people like just random random friends of ours like being like \"Oh man, I just made a level.\" And I'm like \"I want to check it out just to see.\" Yeah. Boogie, Giant Bomb, all that. Then I jump in. I'm like \"All right, cool.\" And so it's an in-n-out type thing. Um Yeah. All right. But uh All right. I I find myself checking in way more often than I thought I would. Still not making levels. That's not my thing. But I think that's kind of the beauty of this game is the fact that there's people out there that enjoy making the level so much and there's people out there that hate that just want to play. And it appeals to both of them equally, I would say. And I love that Nintendo is supporting it and sees it as a platform. And",
      "start": 1183.36
    },
    {
      "text": "so much and there's people out there that hate that just want to play. And it appeals to both of them equally, I would say. And I love that Nintendo is supporting it and sees it as a platform. And the fact that we've gotten already like three DLC updates, like free, just updates of just like here's new content and stuff. That's right. They added checkpoints like within what a month and a half and that's cool. It's like it's a different Nintendo than we're used to seeing where it's like oh hey you guys want something here, you know? Yeah. Um, and then they keep adding more of the amiibo costumes or whatever. You don't even need the amiibo. It's just like costumes in the game. And there's all the like uh celebrity event matches or whatever where they'll do events where every week or whatever they add um courses made by specific people or Nintendo made levels and all this stuff. And they're adding they have the website so it's easier to to find levels and then download to your Wii U",
      "start": 1216.16
    },
    {
      "text": "they add um courses made by specific people or Nintendo made levels and all this stuff. And they're adding they have the website so it's easier to to find levels and then download to your Wii U later. I think Mario Maker is going to be around for a long time. Oh yeah, totally. I I think that uh it's on my list because I have so much fun with that game. It's Mario. You don't get better than Mario, so it's like I don't understand how that game could not be on someone's top 10 list. Metal Gear Solid 5 again. We're going alphabetical here. People can say what they want about it not being enough Metal Gear or about the story not being good or the gameplay being repetitive or this or that. It's excuses. As far as I'm concerned, the game is awesome. Whatever it is is awesome. Who cares if it's not this or not that or whatever. And I get that going into it, your expectations are that it is this or that. Sure. But what you get is amazing. Like the game is there's no game that hooked me like",
      "start": 1256.4
    },
    {
      "text": "not this or not that or whatever. And I get that going into it, your expectations are that it is this or that. Sure. But what you get is amazing. Like the game is there's no game that hooked me like that. And I don't can't even remember a game that hooked me like that in the recent years. It's like you get in and it's that cycle that we talk about so much where it's just like the gameplay loop is so good and the way that they teach you and the way that they reward you. I'm like \"Oh my god, it's so awesome.\" And it's a beautiful game. It's a fun game to watch. I think that's another thing that's key is it's like even a couple weeks ago, I saw someone was streaming and I'm like I'll just check into this for a second. And it's like it's cool just he's just walking all of a sudden a sandstorm happens and it's just like man this is a beautiful game and like the motions are so fluid the animations are awesome and this just character you know it might not be the Metal Gear character that",
      "start": 1308.68
    },
    {
      "text": "happens and it's just like man this is a beautiful game and like the motions are so fluid the animations are awesome and this just character you know it might not be the Metal Gear character that you're used to but I think this game has a very specific feel to it that I don't think we'll ever see again. Like I think that the the style of this game is gonna die and that was a one-off experience and it's I'm happy that it happened in 015 or in the blind forest another game beat this **** over the the winter break. It's good. But you had played it long ago at the Xbox preview and I remember I mean I played it and then yeah I was like I love this game. I play a little bit more. I've been playing little little by little but like I finally like played through and beat it and it's just like man most beautiful game that I played this year for sure. like that art style. That's amazing. And again, it's one of those it's it's just it's an easy hit, you know what I mean? It's just like oh",
      "start": 1345.84
    },
    {
      "text": "man most beautiful game that I played this year for sure. like that art style. That's amazing. And again, it's one of those it's it's just it's an easy hit, you know what I mean? It's just like oh cute, lovable characters and like when they look like that and the story is meant to make you feel a certain way, they nailed it. I guess that's the best way to put it is like they really kind of nailed what they were trying to do. It's like a Pixar movie, you know? They're trying to hit you in the fields and they hit you in the fields. Um, in terms of gameplay, I like that it's a Metroid Vania game, but it isn't so down your throat of like this is a Metroid clone. Like the the way that they the controls are where everything's kind of more like a slingshot than you're actually controlling the character. I thought it separated it enough to make it unique in different than something like Shadow Complex which is a little bit more like this is a a Metroid, right? This is a Metroid. You know",
      "start": 1390.56
    },
    {
      "text": "character. I thought it separated it enough to make it unique in different than something like Shadow Complex which is a little bit more like this is a a Metroid, right? This is a Metroid. You know what you're getting into. Exactly. This is more like all right this is a a take on that. And um I think that was really cool. Um then I got a couple honorable mentions on this list. Oh, we do honorable mentions. All right. And uh I'm giving it to them because some of these games didn't necessarily come out in 015. That's when I played them. Shovel Knight being one of them. Now, it did come out on the the VA PlayStation systems and Xbox One this year, so it does count. But uh Shovel Knight. Oh, man. I think that if I had to choose a game that's game of the year I'd give it to that had it not come out before. Sure. Because I just that's just it's it's a Tim Gettys game through and through. That was Colin's game of the year last year. Yeah. That's it's awesome. I mean, it's so it's so",
      "start": 1432.48
    },
    {
      "text": "not come out before. Sure. Because I just that's just it's it's a Tim Gettys game through and through. That was Colin's game of the year last year. Yeah. That's it's awesome. I mean, it's so it's so Nintendo, you know what I mean? It's Nintendo without being Nintendo. And that's that's great. They **** they nailed it. That game is amazing. And I just want more. I want a sequel and I wanted more levels and I just want everything, you know? You'll get one. I just hope that they I know those guys personally and I and and they're super smart and super talented and I think that it's I think that their inclination originally was to do it differently and I hope that they are smart enough to not do it differently. I know that they they want to do a 16- bit game and a 64-bit game or whatever and and like get like kind of go through those motions. I think that that was their original plan, but they need to make another Shovel Knight with the exact aesthetic uh that they made the original one",
      "start": 1480.48
    },
    {
      "text": "and like get like kind of go through those motions. I think that that was their original plan, but they need to make another Shovel Knight with the exact aesthetic uh that they made the original one in. And I think that they can do that more easily than they made the first one. want to know is very intensive. Those graphics are hard to make. I know a lot of people think they're not. They're in many ways way harder to make than some of these character models you see in a lot of games because it's just more intensive. That's why EGA's new game uses .5D for instance instead of pixel art because it's hard to find artists that can do that kind of stuff. Um, like Waznjak over there that does the graphics. So, um, yeah, you'll get a sequel. I just I just I I hope that when it's announced that they stay where they are. Yeah. I mean, for me, I hope it's the the 16- bit thing. Like that sounds amazing. Having said that, I want a sequel in the same style just as bad, you know? Like I would",
      "start": 1519.44
    },
    {
      "text": "they stay where they are. Yeah. I mean, for me, I hope it's the the 16- bit thing. Like that sounds amazing. Having said that, I want a sequel in the same style just as bad, you know? Like I would want one more sequel and then the 16- bit thing. I don't want to not get the 16- bit thing. Well, I think I mean you're going to get that. I mean, Shovel Knight's in an IP that's going to be established and those guys made a **** ass nine amount of money. Um, and good for them. Uh, especially based on the the Kickstarter money that they made which was not very much. They just needed to finish it basically. And these guys have good bonafides. I I um I implore you to think about it differently in the sense that like it we didn't get Mario 3 until we had Mario 1 and and and Mario Japanese. And we didn't get Mega Man 2 or 3 until we had Mega Man 1. We didn't get Castlevania 3 which is considered the best of the classic series by most people until we got one and two. And we didn't get",
      "start": 1552.32
    },
    {
      "text": "And we didn't get Mega Man 2 or 3 until we had Mega Man 1. We didn't get Castlevania 3 which is considered the best of the classic series by most people until we got one and two. And we didn't get Ninja Gideon 2 and three until we got the original one. Like it takes time to iterate. If we think Shovel Knight's good. No. No. And that that's like my whole thing cuz Shovel Knight's a great **** really good first game and I can only imagine Mhm. what what they can do with a second and a third one, you know, um, in terms of refining gameplay and adding little elements and adding more quirks and and stuff like that and and removing things like they did with the original Mega Man. For instance, there are things in the original Mega Man like points and um, you know, a lot of like weird glitches that they just totally you know threw the kaibos on with the second and third one. I Shovel Knight is almost is is almost as good as it gets. So it's it's it would be fun for them to just go back",
      "start": 1590.56
    },
    {
      "text": "that they just totally you know threw the kaibos on with the second and third one. I Shovel Knight is almost is is almost as good as it gets. So it's it's it would be fun for them to just go back and do it again. Mhm. But I think that they're real artists. I don't know that they want to, you know, but I haven't talked to them in a while, so who knows? So, we'll see. Uh, moving on from that, Star Wars Battlefront. Another game that I find myself going back to a lot. And again, these are favorite games, not best games. And a lot of people a lot of people hate on it and are like \"Oh, it's empty and whatever.\" Exactly what I need for just Star Wars fun, right? You know, again, another beautiful game. Another game that I come home all the time and my roommates just playing and I'm just I'll just sit there for a bit just watch it cuz it's cool, you know, and then we'll just like tag team playing online matches. Not in a sexual way. Greg, well, I didn't I you said we just tag team and",
      "start": 1626.56
    },
    {
      "text": "just sit there for a bit just watch it cuz it's cool, you know, and then we'll just like tag team playing online matches. Not in a sexual way. Greg, well, I didn't I you said we just tag team and you left the pregnant pause and I looked over and it wasn't what we thought we were going with. Um, but yeah, it's like it's cool because she'll just do a match and then I'll do a match. And I like that it's just kind of quick and you just get in and you just learn the weapons and the level leveling up system is fun. And we've said this before, but it's a it's a really nice casual way in to what an online shooter is these days. For someone that doesn't know that, like I don't know that ecosystem at all. None of that the matchmaking and the you know that **** makes any sense to me like perks and all that. So yeah, I've been Yeah, I've been playing my cards close to my vest here. But like Battlefront not on my list, but I'm with you with everything you're saying. And the fact that you",
      "start": 1666.56
    },
    {
      "text": "and all that. So yeah, I've been Yeah, I've been playing my cards close to my vest here. But like Battlefront not on my list, but I'm with you with everything you're saying. And the fact that you know for me it is that game that if we weren't here right now doing this stream night for this live stream or whatever right Kevin could easily ring me up at any time and say \"Do you want to play that?\" I'm like \"Yeah, I'll jump on for 30 minutes whatever it's going to be.\" Whereas like the other night I I I was getting ready to place I wanted to play something I wasn't sure and I saw it and I was like \"I don't know. Let's see what else here.\" And I went to Destiny. I was like \"Oh no, I don't have enough time to get into Destiny.\" And I haven't played in so long. and where do I leave off and da da this isn't that right this is jump in and like what level am I let's go kill stuff yeah and even more than that like I said this before in the Gamescast like there's like a bunch of single",
      "start": 1700.4
    },
    {
      "text": "and da da this isn't that right this is jump in and like what level am I let's go kill stuff yeah and even more than that like I said this before in the Gamescast like there's like a bunch of single player just random missions that are just kind of like tutorials for the game but I mean it's pretty much best of wars it's just like hey you want to you know the speeder bike thing yeah you could do that you want you know that this you can do all that fly an X-wing through a canyon sure and I'm like great these are small little doses like five 10 minute missions but it's like I had fun with them and it this game's the biggest tease that's the the issue with it. It's my tease of 015 where I'm like I can't wait for a single player Star Wars game. Um but this was surprising to me that I enjoyed it as much as I did because I don't like multiplayer games. Me too. Um but I I like this. The maps are cool. You know they don't seem super balanced or whatever but I'm not a pro player. I",
      "start": 1731.28
    },
    {
      "text": "it as much as I did because I don't like multiplayer games. Me too. Um but I I like this. The maps are cool. You know they don't seem super balanced or whatever but I'm not a pro player. I don't care. They're fun. Yeah. Um Transformers Devastation. Biggest surprise of 015. That game was good. What? Who the **** saw that coming? I wish I could put Tony Hawk's Pros Skater 5 on this list but I can't because the game was a pile of **** Everyone expected to be a pile of **** and then it was a pile of **** Okay. Yeah you just caught me off guard then. Yeah. Um but Transformers it's like you look at it and it's like this is too good to be true. That actually looks good. And you're like \"All right, it's going to it's Platinum and they're at this point just putting out so many games. A lot of them really high quality great games.\" But then you know they had Kora and that was like the start of like all right are they doing is there a different division of whatever making",
      "start": 1766.88
    },
    {
      "text": "A lot of them really high quality great games.\" But then you know they had Kora and that was like the start of like all right are they doing is there a different division of whatever making games that are subpar? What does a license mean? Exactly. It's like all right Transformers Devastation a game based on the generation one cartoon. Like how good could this be? Yeah they're going to get the original voice actors and you know use all that stuff. But at this point Transformers has been doing that for you. Like even the Transformers movies the one thing they got right is doing that the voices. Um but then you play the game I'm like \"Oh my god this is playing the '80s cartoon and it is just homage after homage of references to specific episodes and the overarching story might as well have been one of those three-part episodes where it's just like \"All right Megatron's doing evil things. Go find him.\" And the game just keeps getting more and more epic in a way that",
      "start": 1805.44
    },
    {
      "text": "might as well have been one of those three-part episodes where it's just like \"All right Megatron's doing evil things. Go find him.\" And the game just keeps getting more and more epic in a way that I'm like again this is what I remember Transformers being like instead of what it was. Cuz any battle you've ever seen in Transformers it was not cool. None of them. Transformers the movie. I'll give it to that. But none of the show was like ever cool. It's a bunch of **** shooting and not hitting each other and talking in really awkward language. And um this game did what I wanted from Transformers which is you take two toys and you bang them together and see what happens. And Platinum made that into a video game. And it just keeps progressing and progressing and progressing. All the different characters are fun to use. Were they different enough? No. Did I care? No. I'm using Sideswipe. Now I'm using Bumblebee. Cool. I am sold. And uh the the end of the game is amazing. It's one",
      "start": 1845.6
    },
    {
      "text": "different characters are fun to use. Were they different enough? No. Did I care? No. I'm using Sideswipe. Now I'm using Bumblebee. Cool. I am sold. And uh the the end of the game is amazing. It's one of those just like all right this is Tim Getty's dream **** So thank you Transformers Devastation and Platinum Games for not **** that up. Earlier I was saying Shovel Knight one of my ones that uh I want to give a shout out to because honorable mention honorable mention. So I'm combining one spot into two games. Shovel Knight and Uncharted the Nathan Drake collection. Hadn't played Uncharted two and three going in. Oh, lordy lord. **** amazing games. Two is better than three. N it is. But man those games are good. Those games are so good. So excited for four. I'm so happy they did the HD collection. I'm so happy they did it the way they did. It's looks beautiful playing those games. Who would know that they're not modern games now? Like they're just **** awesome. They they",
      "start": 1884.64
    },
    {
      "text": "the HD collection. I'm so happy they did it the way they did. It's looks beautiful playing those games. Who would know that they're not modern games now? Like they're just **** awesome. They they definitely hold up. And even playing a little of one again because my friend had never played again my roommate and he was playing um Drake's Fortune. and I just watched it. I'm like man even that's a **** good ass game. Yeah that was a long ass time ago. So anyways you already know about Uncharted so it's great. Um and then Until Dawn. Ah the other thing Colin was right. I'll give that the Colin was right award. I'll never forget you've been like Tim you need to play this game. I'm like I believe you. And then eventually we did. Me and Nick sat and we played on the we did that let's play the last longass stream we did. Well but even before the stream like we did a let's play of of Until Dawn and we couldn't stop. Like there's never been a time where we played a let's",
      "start": 1928.64
    },
    {
      "text": "let's play the last longass stream we did. Well but even before the stream like we did a let's play of of Until Dawn and we couldn't stop. Like there's never been a time where we played a let's play. We were like \"All right.\" How long was that Kevin? Two and a half hours. Something like that. We played a long ass. You're still dawn. Let's play two and a half hours. I think it's 1 hour. One and a half hours. I mean it was it was one of the longest we've ever done. And it was one of those things where multiple moments like \"Do you want to stop?\" And me and Nick are like \"We need to know who has sex. We need to do this.\" That's what kept you going. Oh. Oh it definitely did. We never got sex. I respect that. Never. It's upsetting. Until Dawn or maybe my choices I don't know. But anyways Until Dawn was a very special game and I'm not quite as in love with the the gameplay as I think you are. Um I still think that playing the game watching the game there's not much of a",
      "start": 1967.2
    },
    {
      "text": "But anyways Until Dawn was a very special game and I'm not quite as in love with the the gameplay as I think you are. Um I still think that playing the game watching the game there's not much of a difference you know like when me and Nick were doing the let's play it didn't really matter who was playing you know. Um but it's it's great and I think that there's a lot of potential with that as a a franchise and not even so much like a I'm thinking like a Final Fantasy style thing where it's not like same characters or same world or whatever. It's just like in the style of this or you know what I mean? It's this gameplay and it's a story and there's characters and all this **** but it's not you know in that same exactly. It's not what now let's pick up with Sam's story and see what horrible things she's getting into next. Yeah. But but even more than that like it's not necessarily like in the same universe you know what I mean? Like just something that's totally They're",
      "start": 2004.16
    },
    {
      "text": "what horrible things she's getting into next. Yeah. But but even more than that like it's not necessarily like in the same universe you know what I mean? Like just something that's totally They're horror movies, right? This is a horror movie video game. So just make me another horror movie. Yeah. Yeah. So I mean that that's the the 10 Tim Gettys 10. Yeah. I want to give it an honorable mention like a real honorable mention to Pagel Blast on the iOS. You're allowed to do that. And um it came out in November of 014. Yeah. So I can't really count it but I played that game probably more than any of this. And you saw me. Yeah. During convention season whenever you had a moment of free time you were playing that game. Yes. Pickle blasting away. God I love that game. I want I want more. Please EA stop making anything else and just make more of that **** Close up Madden. Make more PLE. Colin. Yeah. Hold on a sec. I'm just going to get my water real quick. How things going? How",
      "start": 2049.76
    },
    {
      "text": "Please EA stop making anything else and just make more of that **** Close up Madden. Make more PLE. Colin. Yeah. Hold on a sec. I'm just going to get my water real quick. How things going? How things going with the chat and everything Kevin? How we looking on money? We are almost at 45. Almost at $45,000 on Kinda Funny. patreon.com Kinda Funny. $70 away from six episodes. Six episodes of 45. We're very very close. Remember ladies and gentlemen no matter when you're watching this uh unless it's way after the fact uh January over on patreon.com/kindfunny is all about uh Kinda Funny animated series. So please go there donate what you can even if it's just a buck. We're trying to do 1 episodes of the animated series. Go watch the pilot enjoy yourself. Mhm. Uh so I have already angry at your list. Let's start. Let's start again for Kevin. All right. Sorry. All right. You making notes of this Kevin? This is topic two. Yes. Topic two. Sorry Colin. Yeah. What are",
      "start": 2088.72
    },
    {
      "text": "already angry at your list. Let's start. Let's start again for Kevin. All right. Sorry. All right. You making notes of this Kevin? This is topic two. Yes. Topic two. Sorry Colin. Yeah. What are your top 10 favorite games in 015? Well I have my 10 but then I also have eight honorable mentions. **** you. You can do two honorable mentions. No I'm doing all of them. The host do something about I bet you my I bet you my list goes just as quick. I just want I want to mention these games. I'm going to do it quick. Uh my honorable mentions for different reasons that didn't make my list. Uh I want to give a shout out to Bloodborne. Uh played Bloodborne for about 0 hours maybe a little bit more. Uh in the beginning of the year I was interrupted by some travel. It's one of those games I've said before that you I can't stop playing and then get back into it and I would have to start again. But I really enjoyed my time with it and it was the first time I really got a Souls game and I'd",
      "start": 2133.28
    },
    {
      "text": "said before that you I can't stop playing and then get back into it and I would have to start again. But I really enjoyed my time with it and it was the first time I really got a Souls game and I'd played Demon Souls and especially Dark Souls pretty extensively. Um I will say as one of the kind of negative caveats of Bloodborne is that it has a lot of great fans. It also has a very cringe-worthy fan base a hardcore fan base that needs to kind of get over itself parts of it. Um with the way they talk about the game and how like you're an idiot if you don't like it or you're an idiot if you don't play and stuff like that. Like they really need to like kind of chill on that. Um but um I think overall From did a really nice job with the game was the first time I really got a Souls game. Um and I really do it's really one of those games that I want to get back to. I think it's uh really really fun. But do you think you ever will? I think I probably will. Yeah I think it's one of",
      "start": 2175.04
    },
    {
      "text": "Um and I really do it's really one of those games that I want to get back to. I think it's uh really really fun. But do you think you ever will? I think I probably will. Yeah I think it's one of those games um that it's it probably will. Fallout 4 I want to give a shout out to I I was disappointed in it just in the sense that I wanted that Fallout 3 feeling again. I think that might have been an unfair way for me to play go in and play it. I played it for about 5 hours. I don't know that I'll ever uh get back to it uh anytime soon but I'd like to maybe when the DLC comes out. I think that um uh Fallout 4 is just more Fallout 3 and I wanted something a little different. That's why I didn't make that's why I wasn't really in into it and why I think that uh is a game that I'll get back to. But I just maybe my expectations were too high for uh Heroes of Loot I think is the most casual um fan base um or fan base casual uh game that I played all year. It's actually an iOS port. I",
      "start": 2207.12
    },
    {
      "text": "back to. But I just maybe my expectations were too high for uh Heroes of Loot I think is the most casual um fan base um or fan base casual uh game that I played all year. It's actually an iOS port. I played it on VA and I really only played it for like two days on my VA. But it's just one of those games I was going through my trophies and I was like you know I really liked this game. It's really quite um addicting. Yeah just for a little bit. It's simple. It's kind of silly. It's very I don't know. I just wanted to give it a shot. Idarb uh on Xbox One. We played that game quite a bit. Um and uh on Xbox One and I I really quite enjoyed that game. I think that game is fun as hell. It's also strangely good at it which made me feel pretty nice. I I got the cut from my list. It was there and then I I moved it out for for something else. But well if you would have done 19 honor roll fit into uh Mario Maker I want to give a shout out to just because I would never mess with the the",
      "start": 2246.96
    },
    {
      "text": "and then I I moved it out for for something else. But well if you would have done 19 honor roll fit into uh Mario Maker I want to give a shout out to just because I would never mess with the the tools but we especially during our 4-hour live stream for the big beautiful kids um that we did in October or November. Uh I uh I just was quite enamored by it. I think it's a brilliant idea. I think it's a game that has legs. I think they'd be smart to bring it to NX. Um I think they probably will. And I'm just going to give it to you. Uh it's just I would love to see other companies learn from this. I think Nintendo can learn from it too in the sense that we could get a Zelda maker. we could get all these other games but and I would love to see a Zelda maker in this in the spirit of the '90s RPG Maker or Fighter Maker whatever where it's like you can really get kind of down and dirty with it. Um but uh a Mega Man Maker a Castlevania Maker some of these all Sonic Maker if you're",
      "start": 2292.64
    },
    {
      "text": "'90s RPG Maker or Fighter Maker whatever where it's like you can really get kind of down and dirty with it. Um but uh a Mega Man Maker a Castlevania Maker some of these all Sonic Maker if you're into that kind of stuff like that. It there was something really cool about it. Uh Project Root I want to give a shout out to. I don't quite know why I like this game because I don't think that it's it's uh it doesn't have the finest production values. It doesn't it's not the the the thing that stands out the most but similar to Jamestown Plus which was another game I really kind of fell in love with this year um for weird reasons. It's just an old school arcade shooter and it just feels good to play those games and I when I was playing it I was like I don't quite know why I like this but I I I played it all the way through anyway. Superstardust Delta uh I want to give a shout out to because it's just more Stardust and I think that's fantastic. And Wolfenstein the Old Blood is another",
      "start": 2326.08
    },
    {
      "text": "I I played it all the way through anyway. Superstardust Delta uh I want to give a shout out to because it's just more Stardust and I think that's fantastic. And Wolfenstein the Old Blood is another game I want to give a shout out to before I give my um get into the top 10. The only reason that I I didn't put it on my list cuz I didn't beat it and I don't know how it ends. Um but man I love what Machine Games has done with that series and I and I I've actually been I restarted it recently and just been playing it again. It's just **** really fun. It's just a fun game. All right top 10. See how quickly I got through that? I got through all of that. It doesn't matter how quickly I don't care about the time. I care about you diluting the list to not meaning anything. You just gave me your top 18 games of the year. I didn't. I didn't. I told you I will though combined. Okay. Um number one uh particularly Dying Light. Uh and we're going in alphabetical order. Um I think that",
      "start": 2360.16
    },
    {
      "text": "your top 18 games of the year. I didn't. I didn't. I told you I will though combined. Okay. Um number one uh particularly Dying Light. Uh and we're going in alphabetical order. Um I think that I've said everything I needed to say about Dying Light. I think people know Adnauseium how I feel about the game. It's not a game I beat but it's a game I spent a lot of time with because um I was just kind of obs there was a few weeks where I was really obsessed with it. Played it a lot. Just really went down the rabbit hole explored took my time did side quests tried different things in combat tried to um make new weapons. cuz I just I think that it's just a really good game and I'm I I I'm really happy for them over uh over there at Techland. Um that they moved on to something that was dangerous and probably felt a little weird for them even though it's another zombie game but everything really kind of come together uh came together for it. Um and I just think it's I I don't",
      "start": 2393.72
    },
    {
      "text": "was dangerous and probably felt a little weird for them even though it's another zombie game but everything really kind of come together uh came together for it. Um and I just think it's I I don't want to say it's criminally underplay because it sold millions and millions copies. So I I think people played it. Um but I think that because of the when it came out and the games that people really enjoyed since then like Metal Gear for instance I think that people have forgotten that it was really good. I think it would have been cannibalized it came out in the fall. Maybe we wouldn't feel the same way about it but I think it was the first like punch in the face this year and I really I really enjoyed it a lot. Uh Mad Max uh is number two. Um you guys didn't play it so I I I won't talk too much about it. And again this is a game I kind of talked about quite a bit but I think Mad Max um showed what an open world can be when it's depopulated and empty. And I know that that's like a",
      "start": 2439.6
    },
    {
      "text": "too much about it. And again this is a game I kind of talked about quite a bit but I think Mad Max um showed what an open world can be when it's depopulated and empty. And I know that that's like a weird thing. Like we talk about dense games and like Fallout or The Witcher where these games have a lot in them and a lot of life and a lot of boisterous characters and things to do in them. Mad Max has a lot of things to do in them but there's like no one in the world and there's just remnants of what was in the world. It's it's it's eerie to um go through a desert that was once an ocean with ships just abandoned in it and going through the ships and finding old pictures of people's lives before the the fall of man and and turning it around and reading little things people notes people and like how one of the things in terms of storytelling that I thought Mad Max did really well was it really showed the decay of humanity in that in between period through the notes and the pictures that",
      "start": 2474.72
    },
    {
      "text": "like how one of the things in terms of storytelling that I thought Mad Max did really well was it really showed the decay of humanity in that in between period through the notes and the pictures that you found. So there's a real world and when everything's normal like it is now for us today and then there's like the decrepit Mad Max world that we know um after really the first movie and they show the time in like the first few years of like when people are really starting to lose their **** and people are kind of still holding on to um why things were so good but how they can't be good anymore and and just slowly coming to terms with the fact that they're out of food or they're out of fuel or they can't move or their kids are being kidnapped or whatever whatever I don't weird things like that where it's like there's people are in danger and all this kind of stuff. And I think that Avalanche deserves a lot of credit for that game. I think that that game is is underrated. I understand",
      "start": 2514.48
    },
    {
      "text": "that where it's like there's people are in danger and all this kind of stuff. And I think that Avalanche deserves a lot of credit for that game. I think that that game is is underrated. I understand that the handtohand combat is not really people's bag. Um I always I always talk about how Batman Arkham Knight's combat is really boring to me and and kind of one-dimensional and shallow and I really feel that way. Mad Maxes is even worse because it's it's predicated on the same thing. Uh but I do say that that car combat is is really special. Uh number three Mega Man Legacy Collection. M um this is a just a very thoughtful grouping of games of great games. I think that all six of those games especially I would say two through six are maybe superior to almost everything I've had on my list. Um but these are games we've played before and um we're talk we talk a lot about should games stay the same or should they change? Um Assassin's Creed for instance is an example of a game that uh has",
      "start": 2553.12
    },
    {
      "text": "Um but these are games we've played before and um we're talk we talk a lot about should games stay the same or should they change? Um Assassin's Creed for instance is an example of a game that uh has changed mildly but it stayed the same. We don't quite understand why they haven't fixed the gameplay. Maybe some people feel that way with franchise fatigue and but there's times when I think a game nails the way it feels and the way it plays. Um and that's why you add these games in six years just one after the other. They're easier to make than the games today too of course. Um but uh they're always going to be timeless and they're always going to be good. And I like how they they ported these um over with the care enough to basically make an emulation of the games or an emulator that plays the games as they were. So they're not ports of games. They're not cleaned up. The slowdown's still there. The flicker is still there. a lot of problems um technical problems that are still to like",
      "start": 2593.84
    },
    {
      "text": "the games as they were. So they're not ports of games. They're not cleaned up. The slowdown's still there. The flicker is still there. a lot of problems um technical problems that are still to like the challenge mode and stuff right? Made a little bit different. Yeah. And then there's the challenge mode which I think is um uh quite cool and and really **** hard. I think it really destroyed people. You get the trophy list for it. Like a lot of people don't have those trophies. Um and uh so yeah the challenge mode was cool and and basically they just figured out a way to write code in the emulator to just pick out parts of games um and string them together so you can play Stone Man stage for a little while Mega Man 5 and then you get transported back to Electc Man stage and Mega Man one. Then you're fighting Quickman for Mega Man and all these kinds of things. It's really quite ingenious. I I I think that that collection was good. I think it was affordable. Um it would have been",
      "start": 2631.68
    },
    {
      "text": "Then you're fighting Quickman for Mega Man and all these kinds of things. It's really quite ingenious. I I I think that that collection was good. I think it was affordable. Um it would have been cool to get seven eight nine and 10 but due to the nature of the way that they were porting the games that's not possible. The presentation was on point for sure. Like everything about it like I think the I like that you had the options of the borders shooting them on and off and simple things but it's like that's the type of thought that needs to be put into these collections when you're putting a game out for the millionth time you know? Agreed. Uh Rocket League uh is next. Uh Rocket League is borderline my game of the year. I'm not quite sure what I would because we're listing in alphabetical order and you know we I guess we'll figure out like how we choose a game of the year if we will do that because we're not beholden to the old style the old media style of these are our",
      "start": 2664.72
    },
    {
      "text": "alphabetical order and you know we I guess we'll figure out like how we choose a game of the year if we will do that because we're not beholden to the old style the old media style of these are our nominees and these are our I don't want to **** do that. It's boring. Um but Rocket League I think comes closest to uh what I was looking for in terms of a new and different kind of experience because I didn't really play the original game on PS3. Um and Rocket League was another one of those games similar to Shovel Knight where I was positive this game was going to be huge. Like the first time I saw it I was positive and I remember talking to Greg about it. I was like \"This game is going to be this game is going to be gigantic.\" Um and it was because it's just **** fun and it's and it runs well and it's got workable online which I played quite a bit. Uh it's got its own single player season mode to keep you kind of engaged uh if you want to play by yourself against varying uh",
      "start": 2699.04
    },
    {
      "text": "it runs well and it's got workable online which I played quite a bit. Uh it's got its own single player season mode to keep you kind of engaged uh if you want to play by yourself against varying uh strengths of AI. A lot of unlockables and a nice loop there in terms of just unlocking things and and things unlock randomly so you can't really kind of gauge what you're going to get next which I think is fun. Everyone wanted that team fat flag. I remember when Rocket League came out cuz our team fad is is um is in it and people how do I unlock the team fat flag? I'm like you're going to unlock it first you're going to unlock it last like or anywhere in between. Um but I think Rocket League is just a rock solid game and I think they deserve at Snosis um uh orics rather notice uh psionic doesn't exist anymore. Psionics um they came back from the dead to make this one game. They deserve an incredible amount of credit for making a fun dynamic game basically on the side while they were",
      "start": 2730.48
    },
    {
      "text": "doesn't exist anymore. Psionics um they came back from the dead to make this one game. They deserve an incredible amount of credit for making a fun dynamic game basically on the side while they were doing contract work for games like Mass Effect. Um and I was so happy to hear that they spent about $ million making it and they made $50 million. Um so good for them. I mean they did it man. I think that's the the thing is the fact that everyone is playing this that game and still is. Yeah. And it's just like again going back to the Twitter thing cuz that that's kind of like what really matters. It's like we're talking about all these blockbuster games but what are people talking about? What are people going back to? And similar to Mario Maker I think Rocket League is one of those things where it has it got its claws into people and it's not leaving. Sure. Like that's a Smash Bros. style game you know where it's just people are just going to play forever. Uh next on my list",
      "start": 2768.96
    },
    {
      "text": "where it has it got its claws into people and it's not leaving. Sure. Like that's a Smash Bros. style game you know where it's just people are just going to play forever. Uh next on my list and we have different rule sets which is fine. I'm I'm counting Shovel Knight because I think it's most at home on VA. Um and uh that's when I that's where I played it. I platinumed it. This was I I beat the game a lot on Wii U and 3DS and and PC. Not so much on 3DS but on Wii U and PC. Um we got it early this year. Uh it is still a masterclass in gaming. Yach Club knows exactly what they're doing. I won't belver the point on that game anymore cuz we talked a little bit about it already but uh it is right at home on Vita. That is where the game belongs. That's where I beat it. And uh you know ah it's just so good. The Witcher 3 um on my list. Interesting. This is a game that um you talked **** about non-stop. Yeah man. And and I still think that it's it's too dense. I don't I",
      "start": 2805.92
    },
    {
      "text": "know ah it's just so good. The Witcher 3 um on my list. Interesting. This is a game that um you talked **** about non-stop. Yeah man. And and I still think that it's it's too dense. I don't I don't think it's this you know masterpiece at all. Um but I do think it's great and I think that this was the game I played the most this year by far. I played it for about 60 or 70 hours. Um which would have been enough time to have beaten even most open world RPGs maybe even twice. Um and I want to give it credit for a few reasons. This was a game that I had to reflect a lot on and we and we and we did and and I had time to think about it um over the months since it's come out six months or so since I even played it. And it's and that's not quite true maybe four or five months. But it's one of those games that similar to Dying Light as we talked about with Techland. Uh the studio delivered a game that I don't think we were thought they were capable of and it's a game that has a",
      "start": 2847.84
    },
    {
      "text": "it's one of those games that similar to Dying Light as we talked about with Techland. Uh the studio delivered a game that I don't think we were thought they were capable of and it's a game that has a lot of love and thought put into it. It's beautiful. Um it's it's thoughtful. It's it's got some good voice acting and um I don't know. I think that the gameplay maybe left a little bit to be desired for me. I think that there's way too much **** in the game for a player like me. I just can't ignore that stuff. I feel like I'm not getting the full experience. I feel like I know a lot of people like to just run through and do the main quest in a lot of those games. I just can't play games like that. It's just not not the way I play. Um which is why sometimes I desire a more linear experience. Um but I think that Witcher 3 deserves credit. Um not my game of the year but but certainly one of the better games I played this year and uh really excited to see what they do um with uh",
      "start": 2896.76
    },
    {
      "text": "Um but I think that Witcher 3 deserves credit. Um not my game of the year but but certainly one of the better games I played this year and uh really excited to see what they do um with uh you know their next game and and and Witcher will continue as well um in the future. So interested to see what they do there. Uh maybe another candidate for my favorite experience of the year is Three Fourths Home. Um I played it on VA. It's also available on PC and PS4 and other other platforms. uh similar to Journey. It was one of those games I will never play again. There's no need reason to play it again. And and it it was an emotional uh I don't know an emotional experience. It really was a kind of a gut punch for me in some ways. It's I don't want to ruin the story too much but it's about a a girl teen you know late teens early 0s and her relation her relationship really with her family um experienced largely through a telephone call she has with her family while she's driving. Um",
      "start": 2936.48
    },
    {
      "text": "a girl teen, you know, late teens, early 20s, and her relation her relationship really with her family um experienced largely through a telephone call she has with her family while she's driving. Um, and uh, it just hit home for me. I really loved it. I really really loved it. I was so glad that I played it. Um, it wasn't a game that I was excited about. And I don't remember we did a let's play for it and we kind of experienced. I was like, \"All right, I've seen enough.\" But I I really went back and played it again and I I think that it's worth like on a quiet Friday night, Saturday night, Sunday night, whatever, whatever, you know, day, night, what you want. Like it's a game just download and play it. Just give it like an hour or two and just play it and I really think you'll like it. My question for you about it is when you when you beat Journey, you walked away from Journey, never touched it again. When you beat Three Fourths Home, did you go back and get the rest of the trophies?",
      "start": 2983.12
    },
    {
      "text": "question for you about it is when you when you beat Journey, you walked away from Journey, never touched it again. When you beat Three Fourths Home, did you go back and get the rest of the trophies? Yeah, I did. Okay. Me too. Because most of them came like in some sort of prologue system. It was super easy. Yeah. To jump around and get Yeah, I know. Which is and and what was interesting was that that that playing that those scenes at the bus stop and stuff like that. Um, which is kind of a separate part of the game really expanded the story and actually made it even more sad. Exactly. So, I recommend Three Fourths Home. You should check that game out. Uh, Uncharted the Nathan Drake collection. I I include on here uh just really three fantastic games. Uh I think three is better than two. I know that that's a that's a that's a minority opinion, but uh not here at this t at this table. I mean it's still a minority, but uh Wait, no, that's not how it works actually. No, when there's more",
      "start": 3021.04
    },
    {
      "text": "know that that's a that's a that's a minority opinion, but uh not here at this t at this table. I mean it's still a minority, but uh Wait, no, that's not how it works actually. No, when there's more than one, that's a majority. Um I'm sorry. I mean to be mean. It's okay. So I I think that it What can we say about Uncharted that that hasn't already been said? It's these games are fantastic. They need they must be played. Um, and some people have problems with the finicky kind of controls if you're not used to the kind of third-person shooters and and I I understand that they're better third person shooters or third person shooters that I like more on a gameplay level for sure. I I think Vanquish is one of my favorites for instance or Gears. Um, but uh storytelling wise, pacing, set pieces, uh, twists and turns and weirdness um that that kind of Indiana Jones feel. I don't know. I don't you don't really get much better than Uncharted. And that really made me excited for Uncharted 4. I",
      "start": 3057.2
    },
    {
      "text": "uh, twists and turns and weirdness um that that kind of Indiana Jones feel. I don't know. I don't you don't really get much better than Uncharted. And that really made me excited for Uncharted 4. I platinum one and two again. So I have five Uncharted platinums though. Very nice. Uh Until Dawn. Um I would say biggest surprise, but we kind of knew it was going to be good. Uh I think slowly and that was the thing. Yeah, we we had rumblings and all this different stuff. But it was that when we first saw that game, it was a move title like okay. And then when it resurfaced like that seems cool and then we played it and we did that let's play on that preview build and it was like frame rate's kind of weird. And then they fixed that even. Yeah. Uh, I think Until Dawn is uh a phenomenal game. I would call it the best exclusive on PS4 this year. And not that there's like much competition in terms of volume. Um, but it's it is a better Quantic Dream game than Quantic Dream really made, which I",
      "start": 3096.72
    },
    {
      "text": "would call it the best exclusive on PS4 this year. And not that there's like much competition in terms of volume. Um, but it's it is a better Quantic Dream game than Quantic Dream really made, which I think is interesting. And I think that it's a game. It's it's proof that it it gives me hope for The Last Guardian in weird ways because it's proof that a game can can exist for a long time and even be reworked and remade completely, which Until Dawn was, and be really good. Usually when a game is in development for a long time, it could it could like with Final Fantasy 15, it could it could be bad. Yeah. Not that I'm saying Final Fantasy 15 is going to be bad. As I said before, I have no I have no doubt that it's going to be at least good. Um, 2015, it's happening. I hope so, just for everyone's sake so I can stop hearing about it. Um, but for me it's it was an example of like we saw this game years ago um at Comic-Con. I want to say five four or five years ago now uh running PlayStation",
      "start": 3135.36
    },
    {
      "text": "sake so I can stop hearing about it. Um, but for me it's it was an example of like we saw this game years ago um at Comic-Con. I want to say five four or five years ago now uh running PlayStation Movie game and it was radically different from what we what we ended up with. And I like that they were smart enough at Sony Shuhei and those guys to kind of be like, you know, let's move this PS4. Let's get rid of the motion controls and like let's really dig down on why this game's special. I was surprised that they didn't advertise it more. Um, that was one a huge problem for me uh in terms of like I don't think they quite understood what they had. I think that they felt burned by The Order 1886 and and I think that they which was not a good game at all. And I think that they kind of conflated the way people would feel about both of these games being kind of second party exclusives, but I think that they added gold with Until Dawn. I think that they kind of gave it a short shift. I think",
      "start": 3180.56
    },
    {
      "text": "the way people would feel about both of these games being kind of second party exclusives, but I think that they added gold with Until Dawn. I think that they kind of gave it a short shift. I think they probably should have released it closer to Halloween or at least given it another push. So, um, it's a fantastic game. It's one I recommend. I think it's a fun party game. It's fun to play with people. It's fun. There's replay value there. And I agree with what you were saying about it before in the sense that this is obviously going to be an IP. They're going to make a sequel. I don't think there's any chance of the sequel including the same characters, the same story. I just think that they can make this game every other year. Um they've already announced it Until Dawn: Rush of Blood. Yeah, Rush of Blood, which honestly like it's not what we want. That's a fun game. I don't It's entirely. Yes. It's very very very fun. One out of all the VR games that I've played, it's the most gamey",
      "start": 3220.0
    },
    {
      "text": "Rush of Blood, which honestly like it's not what we want. That's a fun game. I don't It's entirely. Yes. It's very very very fun. One out of all the VR games that I've played, it's the most gamey and it's cool. Okay. It reminds me of arcade games. Does it remind you of that thing you guys do at uh Disneyland when you go in the Andes thing, you're like the Yeah, like Buzz Lightyear and stuff. Definitely. And pop. So, Until Dawn, I mean, you guys you guys know what it's all about. I I I think that, you know, I think it's a game for many different people. I think it's a game casual gamers can play. I think it's a hardcore gamer's game. I think it's there's no fail state much like a Quantic Dream game like Heavy Rain. The game just keeps going. Um so, you can theoretically not really do anything in it at all except for move your character and kind of go from point A to point B. But I thought the writing was really clever. I think that the writing was really lost on some people. I think that",
      "start": 3250.0
    },
    {
      "text": "in it at all except for move your character and kind of go from point A to point B. But I thought the writing was really clever. I think that the writing was really lost on some people. I think that people were like, \"Well, it's weird and it's bad.\" I'm like, \"Dude, it's supposed to be a **** teen horror movie.\" And I know that some people looked at that as being like, \"Well, that's a copout because that protects them from any legitimate sorts of um uh debate about if if if the writing's good or or or you know, things of this nature.\" And I'm like, \"Ah, let's not think about it too deeply.\" I mean, no, but even more than that though, it's like it's just because something isn't great doesn't mean that it's easy to make something not great. Like, that's the goal. It needs to be good writing to make something that hits that tone. You know, like a '90s horror movie, like a lot of the twists that happen Until Dawn, they're bad. But that's the point. Yeah, that is the point. And I get that",
      "start": 3288.64
    },
    {
      "text": "to make something that hits that tone. You know, like a '90s horror movie, like a lot of the twists that happen Until Dawn, they're bad. But that's the point. Yeah, that is the point. And I get that it protects them from from, you know, uh controversy in terms of like, well, this is bad. This is bad. And I'm like, well, it's not supposed to be serious, you know? It's it's a **** teen horror movie. It's a slasher film. It's stupid. But that was why it was fun. And it doesn't since it's so easy to compare both in the ecosystem and and from developers with Super Massive and Quantic Dream. And I've made this comparison multiple times already today. There's something to be said about Heavy Rain is a great game. It's one of my favorite games on PS3. I think that Beyond Two Souls it was a failure largely. I think it made no sense. And I think that it was just I have no idea why it was out of order and which they acknowledged themselves when they let you put it in order in PS on PS4 which I",
      "start": 3323.68
    },
    {
      "text": "largely. I think it made no sense. And I think that it was just I have no idea why it was out of order and which they acknowledged themselves when they let you put it in order in PS on PS4 which I thought was funny as hell because I was like that was obviously one of the weird things about that game that a lot of people complain about. Um but when you have an air pretention about your games like they do um and you're you have a pretention about the way you know you do games whether it's good or bad cuz I actually really like David Cage. Um but there's a pretention about the way we deliver these games that the experience and the art or whatever. Well, I think people nail your game a little harder. And I think the way Super Massive talked about Until Dawn and kind of just, you know, when they showed it at PSX for the first time playable, um, and people were in the crowd were really into it. I think that that showed like how you might want to treat games like this. Um, and it'll be I'll",
      "start": 3363.92
    },
    {
      "text": "showed it at PSX for the first time playable, um, and people were in the crowd were really into it. I think that that showed like how you might want to treat games like this. Um, and it'll be I'll be really interested to see with Detroit, which is Quantic Dream's next game, the PS4 exclusive, what they've learned because if they're smart and they are, they should look at Until Dawn as a game they can learn a great deal from because they are no longer the the leading pioneers of that kind of game. Mhm. And that that was that's I don't know if Greg, but that that surprised me. It was it was they no longer they are no longer untouchable in that sense. And they and they are certainly not delivering the best of 100%. you figure they stumbled with Beyond Two Souls uh regardless if you think it was good or bad. You know what I mean? Like I think you know that it was a mixed reaction whereas Heavy Rain was pretty much universally praised and was like their real breakout hit, right? I mean",
      "start": 3396.56
    },
    {
      "text": "it was good or bad. You know what I mean? Like I think you know that it was a mixed reaction whereas Heavy Rain was pretty much universally praised and was like their real breakout hit, right? I mean they had done games before then that people loved but not on that scale I don't think. And so yeah, they were weak for a moment there and then you did have Until Dawn come in but they Until Dawn and you know these guys could easily be what Quantic Dream was with Heavy Rain, right? Screw up the next one, do this. you. It will be interesting to see with Detroit how much they've learned and what they come out and how they message the game and do different things with it. And the final game on my list is uh Zeodor Drifter uh which I played on Vita, but you can play it on Nintendo platforms. I think it's on PC. I think it's also on PS4. Uh Zoro Drifter is like a bite-size I what I thought was clever about it was it was it's a bite-sized Metroid Van game. You can beat it in like under an hour if",
      "start": 3434.64
    },
    {
      "text": "it's on PC. I think it's also on PS4. Uh Zoro Drifter is like a bite-size I what I thought was clever about it was it was it's a bite-sized Metroid Van game. You can beat it in like under an hour if you wanted to. Um but you can spend a few hours with it if you really need to. It's basically four kind of disperate planets. Um, it is a uh renegade kid game, so it is very pixelated and very stylized and uh you basically just jump from place to place and get new abilities that then let you go back to other planets and and get further and further into the stages until you beat, you know, fight the final boss and beat the game. It's a lot of pallet swapping with enemies and even bosses. It is not a huge game by any stretch of the imagination, but I kind of lost myself to it when I played it and uh uh really enjoyed it. Um it's funny because it was one of the first games we played when we actually broke off in January and then I I played on Steam and I'm like I don't really get It's it's a",
      "start": 3464.8
    },
    {
      "text": "uh uh really enjoyed it. Um it's funny because it was one of the first games we played when we actually broke off in January and then I I played on Steam and I'm like I don't really get It's it's a game you have to kind of think about a little bit, but once you get it, I came into Vita later and I I played it again and I really enjoyed it and I I highly recommend it. It's Zo with an X XEO Drifter. Um and uh I really really enjoyed that game. So I think that uh people will like that if you're looking. It's not like Symphony of the Night or Shadow Comp. It's maybe more akin to Shadow Complex because you can beat that game quickly, too. But it's it's not like the Strider remake or or Symphony of the Night or any of those kinds of games where it's going to take you 10, 15, 20, 25 hours to beat. Like there's no way it takes you more than a few hours. Um, unless you're just terrible at it. Uh so I would I would go down that direction. Uh Zo Drifter is my final game of the year for 2015.",
      "start": 3498.96
    },
    {
      "text": "Like there's no way it takes you more than a few hours. Um, unless you're just terrible at it. Uh so I would I would go down that direction. Uh Zo Drifter is my final game of the year for 2015. Awesome. Greg, hey, how are you? Top 10 favorite games of 2015. Do we want to check in on patreon.com/kindafunny? Nick is updating. He's holding his hand up. $80 away from $45000, which would guarantee us six episodes. Correct. Half the season. Right. I'm Kinda Funny. the animated season. We're waxing a part of Greg's body. Yeah. So, if we get to what is it? 46. Yeah. 46. If we get to 46000, we're going to wax Greg. Part of me. Part of Greg. Okay. Yeah. Not all of you. Yeah. Okay. Just making sure. Your nimbly bits will be okay. Okay. Okay. Good. I didn't know where you're waxing, so I wasn't sure. Yeah. I'm not sure either. We'll figure it out. I'm not sure it's going to be me either. If you're watching this in January, please go to kindafunny.com/ No. Damn it. patreon.com/kindafunny.",
      "start": 3531.84
    },
    {
      "text": "sure. Yeah. I'm not sure either. We'll figure it out. I'm not sure it's going to be me either. If you're watching this in January, please go to kindafunny.com/ No. Damn it. patreon.com/kindafunny. Donate there. All the money we raise in January on patreon.com/kindafunny goes to making the animated series a reality right now. We're in the middle of live streaming. Yes, the I mean we're recording this keeping it very profession, but we're also streaming it on Twitch where we're asking people not to sub to us or donate to us there. Go to patreon.com/kindafunny give us your money there. Lovely. Let it roll till February. My top 10 games of the year. I had one honorable mention. Then this guy comes in and ruins it. So, I moved it to three on the fly. So, there you go. First honorable mention that would have for sure cracked this list if it had come earlier and I had time to digest it. Life is Strange. Caveat, it did come earlier. I just didn't play it till this break. Life is Strange I",
      "start": 3584.16
    },
    {
      "text": "that would have for sure cracked this list if it had come earlier and I had time to digest it. Life is Strange. Caveat, it did come earlier. I just didn't play it till this break. Life is Strange I had heard so many good things about. Uh I had played episode one upon release, not knowing much about it. So, when you got to like some of the twists at the end and stuff, I was like, \"This is weird and I don't know how I feel about it.\" And so then just by happen stance, all the other episodes piled up. This uh break, I sat down and played through them all and blown away. Such a great game. So much fun. Love the story. Love the characters. Love the world. Just this little seaside town or whatever. And again, I don't It's one of those I don't want to go in and knock off one of these games that I've thought about to put it in there. So, it has to be an honorable mention, but it would have for sure made my top 10 list. A lot of people have recommended me to play. Oh, you dig it. Yeah, you",
      "start": 3626.56
    },
    {
      "text": "I've thought about to put it in there. So, it has to be an honorable mention, but it would have for sure made my top 10 list. A lot of people have recommended me to play. Oh, you dig it. Yeah, you would dig it a lot. I hear they say hella a lot. They do say hella a lot. Chloe says hell a lot. I'm going to do it. You're a big hella fan. I am. All right, cool. So, Play Life is Strange, everybody. That's getting a disc base release in the now in the new year anyway. So, you get there, too. Uh, next honorable mention, Alphabetical Order, of course. Taco **** Master. Good lord, Greg. You're unstoppable. I don't He can put Heroes of Loot on there. Nobody gives him **** Another iOS game. Just port it over. That's super simple and doesn't mean much. Taco Master fun. Three bucks a platinum in an afternoon. What else could I want out of a for the Vita? something I can then because I you know what I did with it? I took it to Star Wars and platinum it waiting for Star Wars to start. Sounded",
      "start": 3667.68
    },
    {
      "text": "in an afternoon. What else could I want out of a for the Vita? something I can then because I you know what I did with it? I took it to Star Wars and platinum it waiting for Star Wars to start. Sounded perfect. It was great. You know what I mean? Go in with the right expectations. You're going to have fun with Taco Master. Greg Miller's honorable mention number two of the year. Did you make it hit the the charts? We don't know yet. Okay. I I have I have a feeling when they when they release digital sales on the PSN of what charted for the month, Taco Master should be on there for the Vita games. And it's going to be a thousand% because of us. That's amazing. Because if you didn't know, because of you, take some credit for that. Because of me. And if you didn't know, it's because everyone who owns a Vita and wants to play Vita games watches Kinda Funny. And so when they hear us say, \"Hey, there's this Vita game everybody should play.\" Every like, \"Okay, cool.\" Just like that uh Trail",
      "start": 3701.2
    },
    {
      "text": "owns a Vita and wants to play Vita games watches Kinda Funny. And so when they hear us say, \"Hey, there's this Vita game everybody should play.\" Every like, \"Okay, cool.\" Just like that uh Trail Cold Trails of Steel. What is it? That supposedly is JRPG on Vita. I'm trying to get a copy right now. And even then, I'm going to be behind on it, but that's supposed to be really good, too. So, everybody keep your eye on that one. And then third honorable mention, Witcher 3. Witcher 3. Uh, this year I really I was, you know, in the mood. Oh, we hit 45. 45. Everybody been hit. $45000 on patreon.com/kindafunny. Thank you very much. Twitch people who are watching this live. People who are watching this or listening to it later as a Gamescast, please consider going to patreon.com/kindafunny supporting Nick Arpino's dream for an animated series. We want to get 12 episodes. We're halfway there. We are. Uh Witcher 3 came about this year. And this year, I think when we knew or at least had been had",
      "start": 3740.08
    },
    {
      "text": "Nick Arpino's dream for an animated series. We want to get 12 episodes. We're halfway there. We are. Uh Witcher 3 came about this year. And this year, I think when we knew or at least had been had the, you know, column was right moment. Even before we had the column was right and we just had the prediction of Fallout 4 coming that year, I was like, \"Yes, that sounds so awesome. I want an open world to get lost in and take quests and wander around and do all these different things.\" And and Witcher 3 came in the summer before we got that, before we got Batman. And I saw it and the more I heard about it and saw videos for it, I was like I don't like fantasy. It's just not my thing. I don't like magic. I don't like medieval times kind of crap, you know what I mean? But it looked fun and I got it, played it for 25 30 hours and I had a great time with it. And it's weird because now that I'm starting to knock things off my, you know, list, my backlog now at least, I feel myself being a",
      "start": 3780.24
    },
    {
      "text": "got it, played it for 25 30 hours and I had a great time with it. And it's weird because now that I'm starting to knock things off my, you know, list, my backlog now at least, I feel myself being a bit drawn back to it of like I want to go check in and see what's up and go a little bit further. Especially because I watched uh Christine's game favorite games of the year, right? And obviously she's a huge Witcher fan. And what I never Witcher Yeah Witcher over and over again. What I had never heard her talk about and she talked about in the video was the fact that yeah, act one does go on too long, but act two and three pick up and get crazy and that's really where it is. And I was like, \"Oh, well, **** I never I got out act one or whatever.\" You know what I mean? I was running around. I'd like to see why so many people when we say not my game of the year freak out about it. So many people lose their **** and say it's the best and I've put hundreds hours in it and I beat it. I",
      "start": 3818.4
    },
    {
      "text": "I'd like to see why so many people when we say not my game of the year freak out about it. So many people lose their **** and say it's the best and I've put hundreds hours in it and I beat it. I couldn't believe the ending. I'm like, \"All right, maybe I should get give it another shot and maybe I'll have some time, but probably not cuz you know, Taco Master, got to be coming eventually.\" That's true. So, now we're into top 10 alphabetical order. That means Batman Arkham Knight's at the top of the list. Now, what I find interesting about Batman Arkham Knight is when I talk about it and when we've talked about it before and d I always feel like I talk about the negatives first, you know what I mean? I don't like the bat. I don't like the tank. I didn't like I didn't like **** strafing around shooting 43 things out of the sky and these guys shooting missiles at me and all that dumb **** you know? I didn't like the fact that they kind I I always say lied but I say it in a joking",
      "start": 3855.44
    },
    {
      "text": "around shooting 43 things out of the sky and these guys shooting missiles at me and all that dumb **** you know? I didn't like the fact that they kind I I always say lied but I say it in a joking way that you know they said oh Arkham Knight's a character of our own creation and then it wasn't and I'm not going to spoil it but you know it was like oh and it was like choreograph like they telegraphed it way early the thing here's the thing in I'm going to spoil Batman Arkham Origins Batman Arkham Origins was set up as this is a game about black mask hiring all these people and you're like that sounds pretty cool and you played Arkham Origins and I think it was in the first hour but maybe the first hour and a half where it's like haha no It's not. I'm the Joker and this is the Joker's origin story. And you were like, \"Holy fuck.\" That was like, \"Well, yes, yes, a million times.\" And you played through it and it was awesome and it doesn't get enough credit as a game or Batman Joker",
      "start": 3893.84
    },
    {
      "text": "origin story. And you were like \"Holy fuck.\" That was like \"Well yes yes a million times.\" And you played through it and it was awesome and it doesn't get enough credit as a game or Batman Joker story cuz it's amazing. Arkham Knight went the opposite way of like we you think this guy's a new guy but he's not. And they did that seven or eight hours in or whatever the hell it was. And I had figured it out at hour two. And you're like h like well is there any real like and I feel like that's what I talk about. And part of that is the fact that Batman games are good great or great games or whatever you wanted to call them, right? They're everybody like most everybody not call you like the combat usually. Uh most everybody likes Batman. They're positive. But at the third one what do you know? I mean what do we There's only so much left of the good stuff to say. Like the expectations start getting so high. you get into an Uncharted 3 situation where you know no matter what it's",
      "start": 3929.68
    },
    {
      "text": "you know? I mean what do we There's only so much left of the good stuff to say. Like the expectations start getting so high. you get into an Uncharted 3 situation where you know no matter what it's the negatives that are going to stand out, but I I mean I loved the gameplay. I love the world. Beautiful. The story is good. There's some great twists and turns that I didn't see. The one thing I always I love about Rock Steady and I don't know if I'll forget it again, but I feel like with every one of the Batman games they did in their Arkham trilogy is the fact that you play it and it's just a regular Batman game for so long and then there's always something some crazy thing they do where like you know in the in Arkham Asylum, right, where you all of a sudden start walking around as Bruce Wayne, you know what I mean? after his parents get shot and you're baby Bruce Wayne or whatever or you know then in Arkham City you get dropped into the Mad Hatter thing and it's all a twist around and",
      "start": 3976.96
    },
    {
      "text": "you know what I mean? after his parents get shot and you're baby Bruce Wayne or whatever or you know then in Arkham City you get dropped into the Mad Hatter thing and it's all a twist around and it's like for so long it's just been I'm running around fighting criminals and all of a sudden now I'm in this weird world of the scarecrow missions where you stab in the ground and stuff like you don't see that coming and Arkham Knight did that again in two different ways that I want to spoil and I was like oh **** that was really cool and I didn't expect that you know what I mean and I loved it I also as always am one of the few people I ever see defending the season pass and their DLC. Uh I bought the season pass originally in the beginning. It delivered what my expectations were for it. You know what I mean? If not even a little bit more in the fact that I bought it cuz I was excited for Batgirl's mission. They said they're going to do some character missions and then some stuff at the",
      "start": 4015.52
    },
    {
      "text": "know what I mean? If not even a little bit more in the fact that I bought it cuz I was excited for Batgirl's mission. They said they're going to do some character missions and then some stuff at the end. I was waiting for all that. But lo and behold, I found myself every time I jump in to play Nightwing's 0 or 30 minute mission or whatever the hell it was, I'd beat that and then I'd go out and be like, \"Oh, right.\" And I have all these Batmobiles and I have all these challenge and oh that silver isn't that hard to get. I should try and I have all those trophies now. You know what I mean? I looked at my game clock and it was something like I platinum Arkham Knight then did all the DLC trophies and before I got I probably put like 75 or 80 hours in Arkham Knight according to it. You know what I mean? Maybe you know 70 to 80 we'll say somewhere in there based on the fact that I think it was 64 before I really launched into the DLC over and that's preposterous. I did not expect that when",
      "start": 4053.12
    },
    {
      "text": "I mean? Maybe you know 70 to 80 we'll say somewhere in there based on the fact that I think it was 64 before I really launched into the DLC over and that's preposterous. I did not expect that when we were talking about Arkham Knight when we were looking into Arkham Knight ahead of time. You know what I mean? I thought I'd play it for that summer period before Metal Gear and in between in before or after Witcher. And so to come back and actually use the season pass is something weird for me cuz I buy them a lot where I'm like I like your game and I want to support you. You know what I mean? Like Witcher is one of those ones. I don't know if I'll ever get to the content. Kingdoms of Reckoning. I did the same thing. Don't know if I'll ever really get to that content. And here I did. That was cool. Uh next one on my list of my real top 10 number two, but not ordered alphabetical. Emily is Away. We've already talked about it. You hit the nail on the head. Like that game I talk about, you",
      "start": 4088.24
    },
    {
      "text": "cool. Uh next one on my list of my real top 10 number two, but not ordered alphabetical. Emily is Away. We've already talked about it. You hit the nail on the head. Like that game I talk about, you know, when I talk about that game and write about that game, what I say is like we sat down to play this game and it turned out that it was a time machine. Like playing that game and picking your buddy icon and typing like I am immediately and I it's one of those like it's such a Greg memory that it's hard to explain, but I am taken back to my desk at Missizzou where I had freshman year taken out. I'd find funny things and cut them out and then tape them to my desk and I had my giant Toshiba laptop here and my window out to the wall in front of Hatch Dormatory and I am there talking to my high school friends and Miss Connection high school girls where it was like you know what I mean like we I didn't know what I was doing. They didn't know what they're doing a lot of subs. Exactly. Yeah.",
      "start": 4119.28
    },
    {
      "text": "school friends and Miss Connection high school girls where it was like you know what I mean like we I didn't know what I was doing. They didn't know what they're doing a lot of subs. Exactly. Yeah. you know, and like when we like started clicking through and seeing people's away messages and their profile where they're they're quoting a band and they're doing this and it's like right like it was such it was it was a literal time capsule where you know what I mean like all of a sudden I am back in 2000, I am right there you know what I mean I'm watching I'm back in 2001 I forget when it's actually set I know it's early 2000s but for me I'm back in 2001 right where like they had the Blink 182 take off your pants and jacket like album cover as a buddy icon and I so distinctly remember seeing them at the Warp Tour and having that album and in my freshman uh year roommate that was assigned to me through Umizoo like being \"Oh, I like Link . Oh, you have that one. I have this version.\" Like",
      "start": 4158.88
    },
    {
      "text": "at the Warp Tour and having that album and in my freshman uh year roommate that was assigned to me through Umizoo like being \"Oh, I like Link . Oh, you have that one. I have this version.\" Like talking about that and that was something talked about. You know what I mean? Like that's a really good point. It's not only did they nail the the aim aspects of it and the buddy icons and the way message and stuff. It's like the time machine thing of having the the icons like you didn't choose your icon. It was well you didn't like make your own or whatever. you chose from a list and that list was just a bunch of like 2004 things like these are the albums that came out then and we had fun looking at them and being like all right this is Eminem this is you know Black Eyed Peas this is what is that what is that like oh yeah and like that's cool you know like they nailed it and they nailed a way where it's like you that game just made you think differently it made you think like wow okay what",
      "start": 4198.88
    },
    {
      "text": "what is that like oh yeah and like that's cool you know like they nailed it and they nailed a way where it's like you that game just made you think differently it made you think like wow okay what was happening then you know like what did my iPod look like then yep and that's the thing on you know we uh on our sister podcast the Game Over Show. We've talked about nostalgia a lot. You know what I mean? And this game made me nostalgic for things I didn't realize I missed or like cuz like who would ever think that like I would miss the AIM sound effects or what? Yeah. How like the little pixelated logos or you know I mean it's like stuff that like if you were to talk to me about AIM I would list a million I would miss list a million things tell you stories but not the the feeling of using the program and this nailed that. And then yeah to have the conversations and you and me are like trying to not we're trying to play this like emotional chess match right with this girl where it's like",
      "start": 4235.52
    },
    {
      "text": "program and this nailed that. And then yeah to have the conversations and you and me are like trying to not we're trying to play this like emotional chess match right with this girl where it's like we don't want to pick wrong because we're not trying like the way the whole thing you know it's just amazing amazing. Uh next on my list of top 10 Fallout 4. Uh Fallout 4 for me, you know, I think the the most telling conversation we had about it was leading into the Gamescast when you're talking to Colin and I about it before we had it and you're like well what does it need to do to be great or what is and I'm like right now my expectation is it's going to be a souped-up version of Fallout 3. It'll look better run better be like Fallout 3 and then that'll be make a great game. and for it to be amazing it'll do something I'm not prepared for and I don't know and that's what'll blow me away with it, right? And now looking back at Fallout 4 having the platinum trophy being",
      "start": 4274.72
    },
    {
      "text": "and for it to be amazing it'll do something I'm not prepared for and I don't know and that's what'll blow me away with it, right? And now looking back at Fallout 4 having the platinum trophy being excited for the DLC it did the first thing. It just was a souped-up version of Fallout 3 which is great. You know what I mean? Like that's not a knock on it. It just never jumped to this thing where I was like \"Oh my god, I can't.\" You know what I mean? It added the base building stuff which I hate which I think is poorly executed and wasn't fun. And I didn't really put any time into it until I needed the trophy and then it turned out that it sucked doing it that way. You know what I mean? There was no for me and maybe I missed it even though I like I said had the platinum played that game in a million different ways. There was no draw to go do base building until you needed that trophy and like that sucked. You know what I mean? And it sucked not being able to make things the way",
      "start": 4317.44
    },
    {
      "text": "game in a million different ways. There was no draw to go do base building until you needed that trophy and like that sucked. You know what I mean? And it sucked not being able to make things the way you really wanted them to look or line up walls. I remember when I started doing it like the walls aren't snapping to corners the right way. So you have these janky houses and I'd complain about it online. people like \"Well, it's post-apocalyptic. It's supposed to look.\" I'm like \"I get that, but like that's not what I want right now.\" You know what I mean? I don't want it to look like porcelain fine glass in China or something. I want it to look you know like there's a straight corner. It's It's dumb, but it like took me out of it and I'm like I don't want to do this. I'm not going to do this. And I ran ran around the countryside and did a million things. And I love that. I had such a great time with that. You know what I mean? And that's why it's there and that's why I love it.",
      "start": 4355.68
    },
    {
      "text": "do this. And I ran ran around the countryside and did a million things. And I love that. I had such a great time with that. You know what I mean? And that's why it's there and that's why I love it. But it really is like it's more Fallout 3 and that's great and that's what I wanted. But I always feel like when I talk about it it's like \"All right, yeah, it's what you expected.\" You know what I mean? Mhm. We knew who they were. We let him off the hook. You want to crown its ass crown its ass. Denny Green. Next one up on my list Idarb. Uh like I think we you know you talked about it. We talked about it. Idarb. So much fun to play. You know what I mean? Like that was when we for me it'll always be one of the solidifying moments of what Kinda Funny Games was. You know what I mean? We literally a year ago today we launched all this and then started trying to figure out what we were and how we did let's plays. And when we did that first let's play and we were like \"What is this",
      "start": 4388.88
    },
    {
      "text": "literally a year ago today we launched all this and then started trying to figure out what we were and how we did let's plays. And when we did that first let's play and we were like \"What is this game?\" Okay boy. And then it was like there was that switch. We're like \"Holy sh we need more controllers. Get all eight controllers. We all need \" you know what I mean? It was like \"This is amazing. It's so much fun.\" And it's it it strikes me in the same vein as Rocket League where you can take the controller and you can play it and you can jump in it. You can have a great time and you can also sit there and spend hours getting amazing at it and then be on a whole different level. But either way is still fun, you know what I mean? Loved the characters. Loved having being able to play as Invincible in a video game, you know what I mean? Loved the fact that people could create us and send in all this different stuff. Had an amazing time with it. Uh next up in my top 10 in alphabetical",
      "start": 4427.44
    },
    {
      "text": "in a video game, you know what I mean? Loved the fact that people could create us and send in all this different stuff. Had an amazing time with it. Uh next up in my top 10 in alphabetical order Lego Dimensions. Of course I you say of course and it's like Lego Dimensions for me was such a slow sell you know what I mean and it's because I'm a big Lego game fan period but when they did that trailer that was like we're getting into you know the toys of life genre or whatever I was like okay cool and we were doing Colin and Greg live and people were and I was like we're talking about it and you know Colin read the story we watched the trailer he's like so what do you think Greg and I'm like I don't know man I say I'm like I don't know check it out as it gets closer I like TT Games but for them to for me to be guaranteed to buy it they need to put Superman and Ghostbusters in it and then the chat was like they tease those at the end of the trailer you just watched but you cut it off",
      "start": 4460.96
    },
    {
      "text": "them to for me to be guaranteed to buy it they need to put Superman and Ghostbusters in it and then the chat was like they tease those at the end of the trailer you just watched but you cut it off early. I was like \"Well, all right. I'm in.\" You know what I mean? And then at Comic-Con I finally got to play it and see it in action. And I was like \"Oh, it's the Lego games.\" You know what I mean? And I remember getting the demo and the guy's like \"Well, what did you think it was going to be?\" And I'm like \"I don't know. Like Disney Infinity the other toys life stuff. That's Disney Infinity is fine, but it's very basic and it's running around. It's doing this.\" And like I didn't expect it was going to be that you're taking the Lego games of different genres shoving them together and then giving me minifigs. I was like \"Oh, that's cool.\" And I was like \"All right, now now I'm more excited for this game.\" I already said I was going to buy and I was taking photos of like Chell",
      "start": 4495.84
    },
    {
      "text": "then giving me minifigs. I was like \"Oh, that's cool.\" And I was like \"All right, now now I'm more excited for this game.\" I already said I was going to buy and I was taking photos of like Chell and all these different characters. And then you jumped to when they came in to do the stream with us here on twitch.tv/confunname. And when they came in and sat down and actually played it and let me do it and they started from the beginning and they're like \"All right.\" And now like they you know faked it because we were doing a stream, but like they pulled up the thing and like otherwise you'd have to go through the instruction. I'm like \"Wait, you build the toys while you're playing the game?\" And they're like \"Yeah.\" And then I was like watching like we're in the Back to the Future level and it's got like the out of time logo and that and it's Huey Lewis and the news is playing as you go around Hill Valley Square and then you go to the future and you go way back to the old west and",
      "start": 4529.2
    },
    {
      "text": "and it's got like the out of time logo and that and it's Huey Lewis and the news is playing as you go around Hill Valley Square and then you go to the future and you go way back to the old west and I was like I can't **** believe this and they're like yes it's almost like we actually care and you're like yeah that's the thing like I'm not knocking anybody who makes licensed games or anything but this one had every one of the levels in Lego Dimensions and I don't mean the level packs I mean the stuff that's built on the disc with the three three characters it's built with the love and passion of the other Lego games. You know what I mean? The other Lego games I've fallen in love with when I play a Star Wars or DC one, right? Where it's like there's all these little things. They're all there and that you know then you play it and it's one of the rare occasions where I'm playing something like that and it works in reverse where I played the Doctor Who level and I was like \"Huh",
      "start": 4557.2
    },
    {
      "text": "there and that you know then you play it and it's one of the rare occasions where I'm playing something like that and it works in reverse where I played the Doctor Who level and I was like \"Huh Doctor Who seems kind of cool.\" And I went and watched Doctor Who level. I was like then I bought the Doctor Who level pack. You know what I mean? Like I It works. I got you. Yeah. You know what I mean? And I want to watch more even though I'm just bored. But I watched that one they that crossover Doctor Who they had with Jessica Jones. That was really interesting. Next game on my list. It was a joke. I got it. Okay. Okay. Metal Gear Solid 5. Uh there's not much left to say about Metal Gear Solid 5. You talked a lot about it. You meant you brought up the gameplay loop. You know I had to go back to another one. This is a a cell for me honestly when when Ground Zeros had come out at IGN. I was at IGN. I was on the hosting duties already. So I wasn't like going to preview events and stuff.",
      "start": 4592.4
    },
    {
      "text": "back to another one. This is a a cell for me honestly when when Ground Zeros had come out at IGN. I was at IGN. I was on the hosting duties already. So I wasn't like going to preview events and stuff. And so I remember I think it was Mitch came back and said \"You are going to love this. It's Peace Walker.\" You know what I mean? And I'm like \"Oh my god.\" And Ground Zeros came out and I took a day off work to play that and Titanfall and stream them. And I put ground zero in and I got through the main mission and I tried to do all the side stuff and I was like \"Oh, like I'm getting captured every 5 seconds. I feel totally impotent in this game.\" And like the way the concrete walls go up there on the side I'm like \"It doesn't feel freeing. It feels more constricting.\" You know what I mean? And I never I it was like whatever. And so then when we left a year ago today and I got invited down to that preview thing. I went down preview like this is cool. I'm excited to play and then it was",
      "start": 4628.4
    },
    {
      "text": "And I never I it was like whatever. And so then when we left a year ago today and I got invited down to that preview thing. I went down preview like this is cool. I'm excited to play and then it was like you played that and I was like holy **** like this is awesome. And I came back and told you like unless Fallout does something that's going to be my game of the year. You know what I mean? And then to go and play it and then be whatever 1 0 30 hours into it now it's just like that game for me is you know incredible. It's amazing. You know what I mean? And it's like what you said and I'm one of the guys who says it like I don't think story is that great. You know I don't think story is bad. I don't think it's like memorable Metal Gear. You know what I mean? I don't think it's like changing the life but the gameplay like you know what I mean? Even when we sat down and did the extra live stream and I was back here trying to platinum it. I'm I'm picking up and jumping in and immediately",
      "start": 4663.76
    },
    {
      "text": "the life but the gameplay like you know what I mean? Even when we sat down and did the extra live stream and I was back here trying to platinum it. I'm I'm picking up and jumping in and immediately it's just like oh this is feels so good. You know what I mean? This is so much fun to tackle these ops from different things and do this and I'm going to change my load out and it's just like yes this is peace walker ground zero wasn't. I think Phantom Paint is that's why I like it. Uh next up Rise of the Tomb Raider. Shout out to Nicole Tan. Um beautiful game. Another game that I think really nails a gameplay loop. You know what I mean? Like all right you're into this new environment. You come in and it's like great here's your little mission. There's your main mission. You do the little mission which gives you another little mission which gives you another here are the co coin caches and here's this thing. Oh there's a tomb over here. Oh and like hour and a half later like",
      "start": 4703.12
    },
    {
      "text": "mission which gives you another little mission which gives you another here are the co coin caches and here's this thing. Oh there's a tomb over here. Oh and like hour and a half later like whoa. Oh the main mission, right? I'm supposed to do that, but I'm so You hit pause and you see all the one out of fives and oh I got four out of five here. I might as well try to find this last relic or and I'd really like to get my Russian boosted up a bit so I can It's like hell yeah this game's awesome. You know what I mean? Like that is and this is what I always say and it gets me a lot of hate. I really wish that would have come to PlayStation cuz I'd love to add that platinum to my collection. Like I there's so many other things I want to play that I don't want to invest in Xbox to get the thousand points cuz I'm just not an achievement guy. You know what I mean? But playing through that game I'm it's it was just so good. It was so much fun to play. Story again though totally",
      "start": 4738.64
    },
    {
      "text": "get the thousand points cuz I'm just not an achievement guy. You know what I mean? But playing through that game I'm it's it was just so good. It was so much fun to play. Story again though totally forgettable. I feel like playing through it and they're like I was like \"Okay.\" And then they reintroduced this guy that you saw in the very beginning and he says something and she's like \"Oh.\" And I'm like \"Oh, right. You were in you were in the first Tomb Raider, weren't you? **** I don't remember any of you guys except the guy with the escape shirt. Did he even live? I don't know. Whatever. You all suck.\" Next up another Xbox One exclusive slash on PC as well. State of Decay Year 1 Survival Edition. My story with State of Decay is at IGN McCaffrey and I had done a bunch of let's plays for it. Uh it came out on 360 and PC and it came out I think right before or literally right after E3. And so I was exhausted when I came back from E3 try to play it. I was like I don't want to play",
      "start": 4770.64
    },
    {
      "text": "for it. Uh it came out on 360 and PC and it came out I think right before or literally right after E3. And so I was exhausted when I came back from E3 try to play it. I was like I don't want to play right now. I'll get back to it. Never got back to it. So when State of Decay Survival Edition came out I was like yeah all right cool. And then yeah that was two weeks of my life just bashing zombies in the head clearing off things because it was just it was scratching all the knees I or things itches I wanted from open world games of here's the map and I'm putting a big X over this building. I've searched everything in that building and now I'm going to go do that and in between those you're taking your rucks sack back to base and doing this and killing a zombie and oh wait there's somebody over there and there's a horror and you know what I mean? Like I existed in that world. This was a year where I just wanted to get into games and exist in them. VR, right? Next one. Tales from the",
      "start": 4807.2
    },
    {
      "text": "over there and there's a horror and you know what I mean? Like I existed in that world. This was a year where I just wanted to get into games and exist in them. VR right? Next one. Tales from the Borderlands. Oh man. What? The pause after Tales for a second. I was like thought you were **** around. Oh no. Thought you were going with some Tales of whatever the hell. Oh Tales of Axilia. No Tales from the Borderlands. Uh you know for Tales from the Borderlands like I like Telltale. Uh I don't play Telltale Games that don't interest me. So you know I didn't I don't like Wolf Among Us. Didn't play it. I you I've tried Episode One. Wasn't my bag. Tried Game of Thrones episode one. Just not my bag. I'm not fans of those universes necessarily. Meanwhile Walking Dead I'm going to jump into and be crazy with. Right. Tales of Borderlands came out though and it was the same thing of just like I've never given a **** about I I love playing Borderlands because I love co-op games with",
      "start": 4842.96
    },
    {
      "text": "into and be crazy with. Right. Tales of Borderlands came out though and it was the same thing of just like I've never given a **** about I I love playing Borderlands because I love co-op games with Christine and getting cool guns and leveling up and doing all that stuff. I've never cared about the universe. You know what I mean? Like that's never I'm like tell me a story in the Borderlands universe. I was like whatever. It came out downloaded it and it just sat on my PS4 forever. And then there was some day we had had here that went poorly and I was bent out of shape and grumpy at the end of the night and I was out here and it was one of those I wanted probably Fallout and nothing is not out. Nothing's filling that you know void of what I want to play. And I eventually came through the rotation on the PlayStation 4 and I was like Tails like sure I'll give this a shot. And I was totally thinking it's going to be it's going to be a Game of Thrones it's going to be Wolf Among Us",
      "start": 4884.24
    },
    {
      "text": "the rotation on the PlayStation 4 and I was like Tails like sure I'll give this a shot. And I was totally thinking it's going to be it's going to be a Game of Thrones it's going to be Wolf Among Us where I'll play episode one and be like this is not for me. and instead 15 minutes later I'm laughing and I'm totally into it and I love the characters. And then every episode after that came out and was hilarious and funny and endearing and like I still sit here and I I talk about you know Loaderbot when he's like it's a mixed bag and your introduction of or introduction of Gordis and stuff like that and it's just like this is awesome. Like there is so much comedy in that game that's so well done like and it was so it's my surprise of the year like you were talking earlier in the show which seems like a year and a half ago. I know it's ridiculous. It was we have so much to say about the games we love. Tales blew me away. Wasn't expecting it to be that great and it was awesome. I want to",
      "start": 4917.76
    },
    {
      "text": "seems like a year and a half ago. I know it's ridiculous. It was we have so much to say about the games we love. Tales blew me away. Wasn't expecting it to be that great and it was awesome. I want to give a shout out to Game of Thrones just real quick. I only played the first episode but I enjoyed it and it was one of those things oh I'll get to it when it's done and then I guess it's done now. I think so. Yeah Christine play through it. There's six episodes I think this one. And then final one uh cuz the alphabetical list Until Dawn in that one for sure. I don't have to beat. We all love Until Dawn. We've talked about Until Dawn. I I I was upset when I we did the live stream for Extra Life when I was over here trying to stay awake and I kept taking catnaps and I I don't know what made me think this but you were getting close to the ending and I just wanted to see your final confrontation in that house cuz I was enjoying watching you play period cuz it's fun after your first",
      "start": 4958.24
    },
    {
      "text": "made me think this but you were getting close to the ending and I just wanted to see your final confrontation in that house cuz I was enjoying watching you play period cuz it's fun after your first playthrough to watch other people and be like \"Oh they don't know what's about to h you know.\" Well I didn't do that. What's Oh okay. You know what I mean? And you were and I I'm like I just want to see who survives. I'm like I'll take I'll shut my eyes and I'll totally wake up before and I woke up as the credits are rolling like God **** did. But yeah until Dawn's great. Yeah it is awesome. All right let's check in real quick. Where are we at with stuff? Kevin can you give us any anything book? He can't help you. I got it. I got it. I got it. Yeah I know. Sorry. I didn't know what apologize for $56. All right so $800 away from having to wax me. I I want to wax you so bad. Please don't wax me. It's going to be great. All right moving on to the final topic the big one. Kind of",
      "start": 4990.16
    },
    {
      "text": "for $56. All right so $800 away from having to wax me. I I want to wax you so bad. Please don't wax me. It's going to be great. All right moving on to the final topic the big one. Kinda Funny Games. Game of the Year 015. Let's start this off just by talking about what is that? What does that even mean? You know do you have any thoughts in your head of what that should look like? Because what we did last year it was uh on January 5th actually we put out a first Gamescast topic. I think the first Gamescast topic ever was what's the game of the year 015. Yeah. Or 014. And we all just kind of gave our personal ones our one personal one and that was it. Sure. We could do that again or we could do that and then kind of pick you about what the one Kinda Funny Games one is or I don't know. Nick yeah. What's your game of the year? Metal Gear. Okay. Nick is Metal Gear. So just just so everyone knows for So it was either it was down to Metal Gear and Axiom Verge. Was it a",
      "start": 5024.72
    },
    {
      "text": "I don't know. Nick yeah. What's your game of the year? Metal Gear. Okay. Nick is Metal Gear. So just just so everyone knows for So it was either it was down to Metal Gear and Axiom Verge. Was it a Verge is a great game but it was down to Metal Gear. Oh you're right. Yeah you played Arkham. I forgot about that. Which was phenomenal and I agree with Yeah it's fine. Don't worry. We hear you. We love you. I got to give all I mean I don't know like the thing about it is I always I appreciate one award. You know what I mean? But the problem is like are we those is that what we are? No. I mean I think you know I honestly what Well I guess we did that though. I was I was going to say what we should do is what we did at E3 where we put up all the individual faces so we each had one but then we did come down to a game of the show there. It's just one of those things of I don't do we I mean like I like celebrating and like what you just said you want to argue about it. No. Under no",
      "start": 5070.32
    },
    {
      "text": "then we did come down to a game of the show there. It's just one of those things of I don't do we I mean like I like celebrating and like what you just said you want to argue about it. No. Under no **** I hate that. I hate saying like I love this game and somebody being like well I didn't and me being like well Colin doesn't like mustard and I do but I don't think we're going to sit here and decide if mustard's the condiment of the year. It was always I mean kind of knowing how the sausages was made having voted on game of the year many times. It's just it's just doesn't mean anything really at the end of the day. Like it's it's just we can celebrate several games or we can each have our own individual game which I think makes sense. Um and I just think that it's it's it's just an old way of looking at things you know in my opinion. It's it's why can't there be three or five games of the year? Why does why does everything you know I respect that. But what I do like about the way",
      "start": 5118.64
    },
    {
      "text": "of looking at things you know in my opinion. It's it's why can't there be three or five games of the year? Why does why does everything you know I respect that. But what I do like about the way we do things and we even do this when we review movies or review games or stuff we don't give the score. We just discuss it. And I think I like the idea of Kinda Funny game of the year being the discussion. You know it's like us kind of just put it all out there now. We all put out our 10 favorite but it's like I feel like I want to hear each of your kind of internal debates on what is game of the year for us personally. Yes. Sure. Mine's Metal Gear and there's no debate. Like there's literally nothing that I thought held held a candle to it. And I and I mean and that's and that's always funny to say because I know I was looking at the chat when we were going like \"Did any of them play Undertale?\" It's like \"No we didn't.\" You know what I mean? And that's on my list of **** to",
      "start": 5154.88
    },
    {
      "text": "funny to say because I know I was looking at the chat when we were going like \"Did any of them play Undertale?\" It's like \"No we didn't.\" You know what I mean? And that's on my list of **** to play just like Life is Strange is. But again Life is Strange and Undertale the two that I'm like people keep recommending. I'm like \"Oh **** that actually does right?\" But it's just one of those things you can't play everything. You're drawn to what you're drawn to all these different things. And like yeah like I kept waiting and thinking and you know I was like \"All right you know knowing Batman was coming I was like for me it was like I remember saying Witcher's my game of the year right?\" When it was Witcher and I kept saying of where we are you put you put a gun and then Witcher. Exactly. cuz you you you go as you go because you actually play things and you know games start coming out and so but which and that's what's weird I I always feel like if we were if you know",
      "start": 5194.08
    },
    {
      "text": "Exactly. cuz you you you go as you go because you actually play things and you know games start coming out and so but which and that's what's weird I I always feel like if we were if you know if we were talking about internal debate if we were at IGN still and we were sitting around the table and stuff you know it comes down to what are the nominees what where are we coming where do we vote you know what I mean and that's when I feel and this is where I always you know a lot of people don't agree with me on this that's where you put on your critic hat a bit more I think you know what I mean where it's like all right well didn't connect with me but as looking at the game and this that and the other. I can see the scope and why people love it and da da da da. Maybe that gets into the argument but for me when we're talking about our favorites and now Kinda Funny and for my personal game of the year nothing nothing got close to metal year. No game captured my attention more. I didn't",
      "start": 5225.52
    },
    {
      "text": "but for me when we're talking about our favorites and now Kinda Funny and for my personal game of the year nothing nothing got close to metal year. No game captured my attention more. I didn't have more fun with a game for is you know that those amount of hours. Um yeah I mean it's just so weird cuz it's just on paper I shouldn't like Metal Gear that much. You know what I mean? It doesn't have Hater who is Snake to me. It doesn't have the Metal Gear story which is what Metal Gear is to me but it has this gameplay that I just can't get enough of. And like you know it's one of those things Nick always gives me crap over there. He's like blah blah blah. And he's like I never get to platinum Metal Gear though right? And I'm like um no I'm going to Platinum. Like Metal Gear is a game I will legitimately get back to and I'm not it's not just one of those like oh I really wish I could get back to The Witcher. And I think about it like no no there's going to be a plan",
      "start": 5260.8
    },
    {
      "text": "a game I will legitimately get back to and I'm not it's not just one of those like oh I really wish I could get back to The Witcher. And I think about it like no no there's going to be a plan one day to do it but I'm just in no hurry for it but I know I'm ready whenever I chance. Yeah. what you were saying about the the critic thing. Like I do that a lot too because I like to think about games as a as a whole and that's kind of why we do this show you know and for me when I was thinking about game of the year I'm like \"All right what what am I going to say you know?\" And I feel like there's the obvious answer for me Mario Maker right? Then there's the the other answer that's like \"Oh well Tim also really likes Metal Gear Solid 5 so that makes sense.\" But in terms of the game of the year if I had to to do the critic thing and like the the IGN thing I think Rocket League is the game of the year. There's definitely an argument there that is I'd say the game of",
      "start": 5295.52
    },
    {
      "text": "of the game of the year if I had to to do the critic thing and like the the IGN thing I think Rocket League is the game of the year. There's definitely an argument there that is I'd say the game of 015. Like so many people love it so much and it connected with so many people that it's like it's like Kanye West you know when he has a year whether or not you like him it's like he's the the artist of the year everybody's talking about it whatever. And I think the Rocket League is a great example of that. Came out of nowhere. It has all the recipes for for what you know the game of the if there's one game you're going to play this year you should know about this you know and I think that's a great nominee. Having said that it didn't connect with me in in that way. Like we did the let's plays and stuff and it's very fun. I feel like if I gave that game more time and if I played it on on one screen instead of the split screen and all that stuff and just kind of sank some time",
      "start": 5329.6
    },
    {
      "text": "let's plays and stuff and it's very fun. I feel like if I gave that game more time and if I played it on on one screen instead of the split screen and all that stuff and just kind of sank some time into it I feel like I would fall in love with it. Totally. Rocket League is definitely one of those two ships in the night kind of thing cuz we had been totally This game's great. You know Colin came back and told me \"Hey Jeremy's game is really good.\" And I was like \"Really?\" And then we we played it and then they came onto the stream and we had so much fun playing it locally and we were talking a big game about it coming out of we're going to play a lot of this and we're going to do this. But then it came out right in the heat of okay now we're going to a million conventions this and like it would be one of those things you'd come back and like we'd all get back and you just want some alone time. You put that game in but you're getting your teeth kicked in. Like I there was games",
      "start": 5369.04
    },
    {
      "text": "like it would be one of those things you'd come back and like we'd all get back and you just want some alone time. You put that game in but you're getting your teeth kicked in. Like I there was games where I jumped in and played and I was just getting destroyed and it's like I know why this game's fun but in the same way of like when Mitch is like Dota gets really good 15 hours in. like I don't have time to get good enough at this to to have that fun. I want fun now. You know what I mean? Uh and yeah for me I feel like I could have that fun now even if I put the two hours in. It's just that never happens. But I I do think that that the Rocket League I want to give the the critic in me the like the nod for like I think that that would be a good a good vote. Sure. I definitely think that's a contender. Um but yeah having said that for me it is between Mario Maker and Metal Gear Solid. And I've been debating this in the shower a lot cuz I was like I knew we were doing this show",
      "start": 5399.28
    },
    {
      "text": "that's a contender. Um but yeah having said that for me it is between Mario Maker and Metal Gear Solid. And I've been debating this in the shower a lot cuz I was like I knew we were doing this show and I was like I don't know what I want to put out there if I had to choose one cuz my thing is Mario Maker is everything I ever wanted. It's just unlimited Mario whether it's Mario 1 3 World Yeah. or New Super Mario Bros. and it's like that's crazy. Like I would have never thought we'd get that officially from Nintendo. Yeah. We get the ROM hacks and all that stuff but like this is just unlimited Mario made by awesome people doing different things. And then the thing that sold me on the game even more is when I realized it's not just Mario. It's not just Mario levels. These are Mario levels that are made at least early on without checkpoints which changes it drastically. You know this is Mario where you're playing Mario one but you can go left. You know you can make it more",
      "start": 5436.56
    },
    {
      "text": "levels that are made at least early on without checkpoints which changes it drastically. You know this is Mario where you're playing Mario one but you can go left. You know you can make it more vertical. You can do all these things. And it's like people started **** with the physics of what a Mario game is. And all of a sudden these became Mario challenges instead of Mario levels. Yeah. because levels you need to build and learn things to be able to pass the next level and whatever. This is just not there's you have one level to teach you all that and go through that kind of uh difficulty curve and like you know just trial and error and teaching you things and the reward system is a perle basis and I'm like man that's awesome. It's not just making Mario games it's doing something different. Or it could be that you know and so I'm like that's why I I give that the uh a lot of credit that I don't think a lot of people see. Middle Gear Solid though I mean again just like",
      "start": 5474.24
    },
    {
      "text": "different. Or it could be that you know and so I'm like that's why I I give that the uh a lot of credit that I don't think a lot of people see. Middle Gear Solid though I mean again just like you were saying it's like I think of Metal Gear I think of story and that's exactly what I want. And I I love Metal Gear Solid 4 because that story was just pure fanervice to me of just hey I'm going to wrap things up. This is the most over-the-top and stupid thing ever. But at that point that's what Metal Gear was to me. And I'm like great. Then you get five and it's like oh man that's not there at all. But it's like for some reason I'm still addicted to this. And the gameplay loop all that stuff. We don't need to talk about that again. But what I do want to say about it is that unlike a lot of the games I like simple games you know? I like games that I'm like the gameplay is just impeccable. This is great. I talk about Amplitude right? You talk about um Mario or Shovel",
      "start": 5516.88
    },
    {
      "text": "unlike a lot of the games I like simple games you know? I like games that I'm like the gameplay is just impeccable. This is great. I talk about Amplitude right? You talk about um Mario or Shovel Knight or stuff like that. Those are simpler games at the end of the day but it's like and and Rocket League whatever. If it's a simple game it's fun to play whatever. Metal Gear Solid is addicting and rewarding and it's not simple. It's a 3D world. There's a lot going on and all of the systems feel right. All of the little things are fun to do. It's not like there's a thing where like I don't want to do this again you know? I'm waiting for my damn resources to process. Well that that in terms of platinum you're getting screwed around. Uh-huh. Every time they taught me something new I thought I was going to hate it and then I didn't and then I loved it and that all happened so fast. And the the gameplay is fun and it's not simple. That that's I think at the end of the day I got to",
      "start": 5554.64
    },
    {
      "text": "thought I was going to hate it and then I didn't and then I loved it and that all happened so fast. And the the gameplay is fun and it's not simple. That that's I think at the end of the day I got to give my nod to Metal Gear Solid because because it did something in 015 that other games didn't. And I think that it it's that was a new thing. It it made more complicated gameplay addicting and fun for me. Uh I played Metal Gear for about 10 hours over the break and it just wasn't for me. Um so I don't really have much valid information to say about cuz I didn't dump this. This is your time. This is your nearly dump enough time into it. Uh no I just I just wanted to say that like I did did give it a go and and it's just not what I'm looking for. I I I didn't I can see as I said I think on Colin and Greg Live or maybe on PS1. I don't really remember at this point. I said I could see that the systems are deep and there's like a lot to do in the game. I don't necessarily know that that's",
      "start": 5600.72
    },
    {
      "text": "Colin and Greg Live or maybe on PS1. I don't really remember at this point. I said I could see that the systems are deep and there's like a lot to do in the game. I don't necessarily know that that's Metal Gear to me. And so I and I don't I didn't personally find the gameplay to be above and beyond the best third-person shooters that I played by any stretch of the imagination. So to me it was um to me I was like \"Okay this is fine. I think it's a I think I can see it.\" I loved as I said I **** loved the intro and what I was what I was so disappointed about when you're walking into the hospital and the the the **** guy on fire and the psycho mantis type character whatever. I'm like this is so **** cool. And then it just rips you out of it you know? And I'm like why? Why did you rip me out of that? Like that was **** awesome. That's Metal Gear you know? And that was it almost playing it and actually experiencing it almost made me made me angry. It's like god damn it.",
      "start": 5653.12
    },
    {
      "text": "rip me out of that? Like that was **** awesome. That's Metal Gear you know? And that was it almost playing it and actually experiencing it almost made me made me angry. It's like god damn it. like 10 to 1 hours of that is a Metal Gear game and suddenly I'm in an open world. I'm like \"Okay like why am I here?\" I I I So I went through all the missions and I and I found you know doing some side quests and and and kind of just experimenting and and and faltering that's what it's called right? Guys out and experimenting a little bit with the with the the equipment and all that kind of stuff and and and making new things. And to me it was I was just like there was nothing. There was no gravity there anymore. To me I was this isn't what I was looking for. that that first hour that first 90 minutes god damn it that was **** rad. You and I wish that it was more like that. So that's kind of where I'm coming from with that. But I respect your guys' opinion and I also respect",
      "start": 5691.72
    },
    {
      "text": "first 90 minutes god damn it that was **** rad. You and I wish that it was more like that. So that's kind of where I'm coming from with that. But I respect your guys' opinion and I also respect that I didn't play it for a fraction of the time you guys played it as well. Um but that was that I almost wish I didn't play it in a way like at this point cuz I'm like there was always this like janessaqua about it where I was like I'm sure that I like this but I'm not going to play it. I'm not going to get to it. And then when I finally got to it I was like damn it I shouldn't have played it. Um but man that first hour and a half I was I was **** in it. I loved it. Um to me it's like we you have to like whittle whittle down what I'm s like the games on my list. Mega Man Collection Shovel Knight Uncharted Collection removed. Uh a game like Zod Drifter I thought was a lot of fun but I wouldn't vote for it. Witcher 3 is fun but there's it's got a lot of flaws I wouldn't",
      "start": 5730.24
    },
    {
      "text": "Shovel Knight Uncharted Collection removed. Uh a game like Zod Drifter I thought was a lot of fun but I wouldn't vote for it. Witcher 3 is fun but there's it's got a lot of flaws I wouldn't vote for. So you're left you're left with with to me three games come to mind. Um really you got to go to Rocket League you got to go to Dying Light. Um and you could really even end the conversation there. I would even consider something like Until Dawn. Um just based on the the resonance of the experience. Uh and then you can talk a little bit about Mad Max or like you know whatever you want to talk about. But I really think it probably comes to Rocket League. I I I uh Dying Light I'm not comfortable. Um we make our own rules right? Right. So I put I put games that I didn't beat on my list that I play I spend a lot of time with and Dynite was one of those games but I feel like if I'm going to if I'm going to give it that extra that extra nod um I have had to have seen at all and",
      "start": 5772.56
    },
    {
      "text": "list that I play I spend a lot of time with and Dying Light was one of those games but I feel like if I'm going to if I'm going to give it that extra that extra nod um I have had to have seen it all and I didn't. Uh the game could fall off a **** cliff uh but I liked what I played. Rocket League is a game unlike Greg who like was just traveling and didn't realize two ships in a night. I actually did play that game a lot and I played it online a lot and I played uh I played against computer a lot and I played you know multi a little or locally a little bit. We played it a lot before it came out. It's it's um so it's probably the game overall where I would be like well Dying Light's probably the game of the year for me if I was comfortable saying that having seen the entire game. And you can go to Mad Max and be like well Mad Max really gave me what I was looking for. That was a game I spent sunk a lot of time into because I just enjoyed playing it. I just thought it was fun. And",
      "start": 5817.76
    },
    {
      "text": "can go to Mad Max and be like well Mad Max really gave me what I was looking for. That was a game I spent sunk a lot of time into because I just enjoyed playing it. I just thought it was fun. And I like those games where it's just slowly whittling away. Like we talked about over and over again that Ubisoft style map sections that are getting that dark red and then they go pink and light red and then they're white and they're cleared and you got everything you know and there's **** eight billion collectibles. I like that kind of **** Yeah collectathons are great. Um not always but I like that. I mean that's why I play Far Cry because Far Cry is better I think than Mad Max in the sense that it's got superb gameplay as well in in in all senses. So I think I would settle on uh I think I would probably settle on Rocket League but I I I don't I don't know. You know I don't know if it's really important. There was a few games that I really really enjoyed but I think in",
      "start": 5852.48
    },
    {
      "text": "uh I think I would probably settle on Rocket League but I I I don't I don't know. You know I don't know if it's really important. There was a few games that I really really enjoyed but I think in terms of solid gameplay I think in terms of uh resonance I think in terms of performance I think in terms of uh uh staying power which I think Rocket League clearly has that uh it's probably my game of the year. Yeah. I mean that's good. I think that that I mean we've over we've overthought it. Yeah. Kinda Funny Games of the year. Damn I like that. You see what I did there? Because we're Kinda Funny Games. You just put of the year and you give multiple games. It's good. It's really good. I enjoyed this. I thought this was a good episode. I hope people liked it. Let us know in the chat if you're watching live. Yeah. Ladies and gentlemen this is the Kinda Funny Games cast. The first and last ever episode 5 of this big beautiful show. Uh come back next week",
      "start": 5888.96
    },
    {
      "text": "us know in the chat if you're watching live. Yeah. Ladies and gentlemen this is the Kinda Funny Games cast. The first and last ever episode 5 of this big beautiful show. Uh come back next week where we're going we're going to be back to a normal show. Back in the other room back in the other room. And also like this is the last I don't even know what we're going to do next week because the last couple weeks we've been knowing what we're doing because it's been like wrapping up things and and going from there. I know what Steve Gaynor will be here. You are right. So he'll talk about a bunch of stuff. Not just Gone Home and then he'll talk about the games with us and whatever happening in gaming. Tacoma. Tacoma. I'm in space. Gone Home in Space. A coming of age story in space as far as I know. Save it. Gone Home's out soon. You can get that episode early. patreon.com/kindfunnygames. And speaking of Patreon you can go to patreon.com/kindfunny to help us support Kindfunn the animated",
      "start": 5930.24
    },
    {
      "text": "I know. Save it. Gone Home's out soon. You can get that episode early. patreon.com/kindfunnygames. And speaking of Patreon you can go to patreon.com/kindfunny to help us support Kindfunn the animated series. We're trying to make it happen. Last I checked we crossed the 45K mark which means six episodes are funded. We're trying to get to 75 by the end of January. Yeah. Remember again to stress this to make sure that people know out there it's only for January. So $75000. Yes that is a lot of money that we're asking for but it is all going to animation. Animation very expensive. We want to do this right. Once February comes back to normal we're just going back to the normal Patreons. You guys can change your your tiers to whatever. So for all of you that are already on Patreon you're like I want to support this project just for January. If you want to go higher great. If no one wants to that's cool too. What we keep saying is if everybody who's giving us $1 on Patreon gave",
      "start": 5969.12
    },
    {
      "text": "like I want to support this project just for January. If you want to go higher great. If no one wants to that's cool too. What we keep saying is if everybody who's giving us $1 on Patreon gave us four more dollars we'd hit it. We'd be done. Yeah. I mean I mean at this point that's different. Yeah. Well then we'd have a lot. We'd have a lot of money. But there are some guys who can't give more than a dollar and I understand that. You don't have to. Or no dollars. It doesn't matter. Like if you want to support the show go to youtube.com/kindfunny. Leave a nice comment. It'll make me happy. Yeah. Until next time I love you.",
      "start": 6016.8
    }
  ]
}
