{
  "id": 1522,
  "video_id": "tW-NnDOpAj0",
  "show_name": "Miscellaneous",
  "hosts": [
    "Greg Miller",
    "Tim Gettys",
    "Nick Scarpino",
    "Colin Moriarty",
    "Portillo"
  ],
  "title": "Greg Miller Gets Waxed",
  "description": "Support Kinda Funny: The Animated Series!: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1454173201,
  "duration": 1083,
  "transcript_chunks": [
    {
      "text": "Oh, hey. What's up, everybody? You're watching this right now because Greg Miller has agreed to let me wax his back. But why? Why did I do that? Because for the kids, Greg, those big, beautiful animated kids. Jesus Christ. Yeah. Over on patreon.com/kindafunny. We've been raising money for Kinda Funny, the animated series that Nick wrote and he's really good at and is really fun. And we had a pilot and we want to do 1 episodes over there. People have supported us up to the point where we're doing how many episodes right now? Six. Six episodes. But they've also hit us up and one of the milestones on the Twitch chat was to get my backs whacked. Great. Thanks, Greg. Wait, on Twitch you can't show nips, so it gets to be kind of convoluted. So, I want everyone to know we're using this brand this brand of wax strip and we're going to we're going to attempt to get all of this hair off of Greg's back. Now, I don't like the wings. You got a lot going on here in this with this bag. I've been",
      "start": 3.68
    },
    {
      "text": "this brand of wax strip and we're going to we're going to attempt to get all of this hair off of Greg's back. Now, I don't like the wings. You got a lot going on here in this with this bag. I've been using the thing about the acne. I want you to know is that I didn't have it for a long time and I started getting it. So, I bought a loofah on a stick that I could It's definitely steroids. It's definitely the steroids. Good call. I bought a loofah on a stick, Tim. Mhm. So that I could rub it off and it was great. And then I went up to Styr's family's house and then they didn't have a loofah on a stick. So now I'm back and it's getting better. But it's Kevin, I need a tissue. Kevin, we need a tissue. And I need this chat. Make sure we're not breaking any rules. Stop. The face. That's enough. Oh my god. Think about me when you masturbate tonight, everybody. Well, I won't be masturbating tonight. I need a tissue. Cuz it needs to I need to wipe you masturbating tonight. Toilet paper's fine. Anything",
      "start": 53.56
    },
    {
      "text": "Think about me when you masturbate tonight, everybody. Well, I won't be masturbating tonight. I need a tissue. Cuz it needs to I need to wipe you masturbating tonight. Toilet paper's fine. Anything dish you like. I don't like when he gets **** honory. You know what I mean? Mhm. Mhm. He's always that way. You got to beat him down, dude. He's an angry little Wolverine. You got to lift him up, though. Sometimes I lift him up. You mean lift him up on the wings of the Lord. Love, lift us up where champion. All right. Now, it should be noted that there's a lot of directions for this uh procedure, and I didn't read them, but I'm just Are you going to hurt me, you think? Are is this going to hurt me? Might take some. What is the blue stuff? That's to if I in case I hurt you, it's to anesthesize you and then we take you to the hospital. You're gonna Here we go. Do you want to read the instructions to Nick? Yeah. No, it's fine. I got it. Instructions. Oh god, that's not our language. ****",
      "start": 98.4
    },
    {
      "text": "you and then we take you to the hospital. You're gonna Here we go. Do you want to read the instructions to Nick? Yeah. No, it's fine. I got it. Instructions. Oh god, that's not our language. **** Okay, here we go. Directions. Wash area where hair is to be removed with soap and water. Thoroughly pat. Do you want to do that? Warm wax by rubbing strips briefly and generally between your hands. Determine direction of hair growth before applying wax strip. What? What direction? Didn't just do that. Ah um press on wax strip firmly in the direction of hair growth. Right. Got it. Hold skin taut in one hand. With the other hand, pull off wax strip in opposite direction of hair growth. Keep I'm not throwing the instructions here. Keep your hand Oh. Oh, that sucks. Keep your hand some honey on them or something. As close as the skin. Let's up this hair. If the strip is peeled too remain on skin and hair will not come off. Immediately apply firm pressure to the wax area within fingertips and",
      "start": 137.2
    },
    {
      "text": "or something. As close as the skin. Let's up this hair. If the strip is peeled too remain on skin and hair will not come off. Immediately apply firm pressure to the wax area within fingertips and palm. Jesus **** in Christ. Yeah, it was a lot, right? So, I thought I can understand. You should just go get a razor. I I will do that right now. I'm just going to do one side. That seems kind of mean. I told you I was in I was You know, I don't like my my my angel wings of fur on the back. Oh, this is the angel wings of fur though. I do right the front. I can see them. You're going low. I want them. It's high or the whole wing, bro. Okay. Whole wing. You have a better vision of it than I do. I guess. O that hurt. It It's It's not a great feeling. It's not a terrible feeling. Doesn't feel like something you want to have happen to you. I wouldn't like to have that over and over again, for sure. Let's do it to your grundle. Give me your choke. Oh, no. Give me your **** choke. What do you",
      "start": 181.44
    },
    {
      "text": "something you want to have happen to you. I wouldn't like to have that over and over again, for sure. Let's do it to your grundle. Give me your choke. Oh, no. Give me your **** choke. What do you want? Oh, thank you. I'll put those right there. Thanks, bud. I'm going to wipe you down with some of this um other cream when I'm done. You need to heat it longer with your hands. I did, bro. Is that what the chat's saying? That's what the chat's saying. They're pros, dude. There you go. Throw it in the microwave. There you go. A little massage, Kevin. Little massage. Do we have any gaff tape? A lot of jiggle back here. Gaff tape then. Yeah, we got lots of gaff tape. Yeah, you're getting better. He's getting better. He's starting to sting more and more as he goes. It's coming off. Is it coming off? Show. Have you shown any? You haven't shown the camera. It's not really a lot. You don't have a lot back. It's not that thing. I'm going to goest. I'm going Yeah, give me your chest. Uh, I said",
      "start": 225.6
    },
    {
      "text": "off? Show. Have you shown any? You haven't shown the camera. It's not really a lot. You don't have a lot back. It's not that thing. I'm going to goest. I'm going Yeah, give me your chest. Uh, I said I'm going to do up here now. That's going to hurt a lot. Okay, good. Also, you're starting to bleed a little bit. So, why why do they bring why do they bring toilet paper? There's a whole thing of Don't zoom in on it. All right, Zoom. Yeah, zoom in on it. What are you talking about? Probably doing this. Everybody, keep supporting us on patreon.com/kindafunn. Kevin brought me just sold out. Also, if you're Whoa. Why do they bring Why did they bring I'm just going to do this. This might either feel good or sting like a **** Oh, is this the finishing oil? Yeah. Does that feel okay? How's that feel? I don't feel anything. Quiet, dude. It was worth it. It was worth it. It was really funny. Colin just loved it. I'm John. You've been listening to your TV loud lately. And the fact that he hasn't",
      "start": 265.68
    },
    {
      "text": "I don't feel anything. Quiet, dude. It was worth it. It was worth it. It was really funny. Colin just loved it. I'm John. You've been listening to your TV loud lately. And the fact that he hasn't calmed down I thought was interesting. All right, I'm gonna try a big big That day I tweeted you the other day when I could hear through the wall what you were watching. Oh, no. That's never happened. I've never heard your TV through the wall. I'm not saying I'm not saying Souls 316. You'd never get this on IGN. No. All right. We're sorry. Yeah. Just let it sit there for like 10 minutes. 10 minutes. The great part about waxing is it really just gets it. It takes the whole thing out. You know what I mean? the follicle and all. I don't know what that means. Well, you shave it, it grows back super fast cuz you don't get the follicle, but you get the you get a weed. Yeah. Oh, you get it right from the root. Get it right from the root. That makes sense. Okay. Yeah, that was a great one. That one",
      "start": 318.08
    },
    {
      "text": "fast cuz you don't get the follicle, but you get the you get a weed. Yeah. Oh, you get it right from the root. Get it right from the root. That makes sense. Okay. Yeah, that was a great one. That one definitely hurt. Look at that. That one definitely hurt more than son of a **** And we're still on the front page of Twitch. Well, they don't know. No one's watching clearly on Twitch. How's it starting to look good? Looking great. It's going to take 0 30 more minutes. Well, then let's just do one side. We don't have to do this forever. Wait, we can get this going both. Oh, sure. There you go. You know, I remember calling. You got to warm it up between your hands. There you go. There you go, Cole. What does this button go to? Why is there one button here? I found it on the ground. Oh, okay. You got to let it get it warm. I think it's mine from what? Uh, you know that blue? All right, that's good, Cole. You don't have to go that warm. Yeah. Okay. And be careful, Con, cuz you don't want",
      "start": 360.72
    },
    {
      "text": "You got to let it get it warm. I think it's mine from what? Uh, you know that blue? All right, that's good, Cole. You don't have to go that warm. Yeah. Okay. And be careful, Con, cuz you don't want the **** sticking to your hand. Which side do you put on? This stuff's like napalm. Don't let it touch you. Could you do both sides? I don't maybe there's only one way to find out. Yeah, Misty Moose Morotti till kingdom come. All right. Ready, Greg? I'm going to get this. This is going to be Support us, please, on patreon.com/kindafunn. Be a painful one. Here we go. Ready? Yeah. Three, two, one. Oh, holy **** **** That was good. Look at that. Look at the hair. See, now it's a competition between Nick and Colin. Sorry. Ready? You got it. Oh, these are big ones. These are so much bigger. We should have been using these the whole time. This is going to hurt way more. What's funny is like it's almost like a torture here. Use this. Really? You can do that, dude? I did it. They both work. You're",
      "start": 396.24
    },
    {
      "text": "have been using these the whole time. This is going to hurt way more. What's funny is like it's almost like a torture here. Use this. Really? You can do that, dude? I did it. They both work. You're supposed to heat the strip between the hands. I'm **** doing it, Tim. He's **** doing it, guys. All right. It's the first ever episode of together with the strip in the middle. Yep. Just like that. Well, it doesn't Oh my god. Jesus. It's not like it's hot wax that you get at a **** aesthetician. You want to drink a bourbon? You want bourbon? Me? Yeah. No, fine. I got the beer still. Thank you, though. Thanks for looking at all together. Yeah. No, that's okay. You got Well, you're supposed to stretch out the skin a little bit. Oh, okay. So, you got to go like this. So, one at a time. One at a time. Okay. These are coming off now. Ready? Trending gamer of the year. Oh **** Yeah, that was a big one. There's another one on your back, too. Oh, wait. What? Collins, you have another one. I",
      "start": 449.36
    },
    {
      "text": "a time. Okay. These are coming off now. Ready? Trending gamer of the year. Oh **** Yeah, that was a big one. There's another one on your back, too. Oh, wait. What? Collins, you have another one. I have another one like that. Mix felt like he tore my skin. Three, two, one. Hold on. Oh, that was not as bad as that last one. I'm going to look. I got goosebumps. Yeah, you do. There's just maybe seven, eight more of those on this side. I mean, we could stop anytime. Oh, the rapid succession. You got to get over. There's a lot of hair. The problem with this stuff is that you're not supposed to go over the area that you've already bit on. And it's not coming off even. So, it's like uh there's lots of blotches. So, I don't know how much more I want to go over. Maybe I'll go this right here. Just one more little scadoo. Scadoo. Go come back tomorrow and get the rest of the razor. Thank you. Thank you. We can do that on Calling Live in the morning. Are we doing Calling Live in the morning? We",
      "start": 497.44
    },
    {
      "text": "one more little scadoo. Scadoo. Go come back tomorrow and get the rest of the razor. Thank you. Thank you. We can do that on Calling Live in the morning. Are we doing Calling Live in the morning? We I don't know. We I don't Do you want to, Colin? Are we doing Colin and Drag Live tomorrow? Nah. What do you want to do? I don't care. I either way cuz I feel like we should rest tomorrow. Oh, this is going to hurt like a **** 000. We'll do it. Uh, real quick, I want you to know we won't even do our normal show. Polo, hold on, Nick, before you go. Yeah. Polo wasabi dog says, \"Hold the skin down.\" Damn it. That might make it hurt more for me. Holding it down. What the **** does that mean? Hold it down. Hold it down. Like my skin is like there's a lot of loose skin is what he's saying. Oh no. Yeah, that hurt, huh? Yeah. All right. Yeah, there's one more. Hold it down. What the **** does that mean? That's better. That help? Kinda Funny Girl says, \"I know Greg's the focus, but all I",
      "start": 544.88
    },
    {
      "text": "Yeah, that hurt, huh? Yeah. All right. Yeah, there's one more. Hold it down. What the **** does that mean? That's better. That help? Kinda Funny Girl says, \"I know Greg's the focus, but all I can focus on is Colin's hot dick.\" Oh my god, look at how long this one is. What the **** Knuckles 37. Knuckles 37 says, \"Kin looks like he's four months pregnant. The way his stomach is sticking out like that.\" And Matt Scarpino says, \"Look at Nick's chest.\" And then he follows up, \"Tim, tell Nick his chest is nice.\" So he really wants you to know. Oh, thanks, Matt. Thanks, bro. Good looking out. Thank you. I like he whispered into his **** ear. Joey Noel says, \"Chat ladies are so thirsty.\" Feel this one. Yeah, there is quite the bulge. Olli Olli CSIX says, \"I pledged $15 a month. Get the goddamn honey.\" That's what I'm saying. We could have solved this a long time ago with the honey and some duct tape. All right. Ready? This is going to be This one's big. This is a big one. Yeah. Hold",
      "start": 588.24
    },
    {
      "text": "honey.\" That's what I'm saying. We could have solved this a long time ago with the honey and some duct tape. All right. Ready? This is going to be This one's big. This is a big one. Yeah. Hold on. Oh, **** Tim, don't break eye contact with me. Three, two there's also this one. Oh Jesus. No, they're it's blood, Kevin. It's perfectly natural. That was some Fifty Shades of Gray **** right there. Yeah, Colin just like he didn't make love to you, Greg. He **** you hard. You got to get all this call. You went Look at your side versus my side. Better job than you. What? I said Colin is doing I was I'm saying I haven't done as many as you've done. No, I'm saying look at how much more damage you're causing on that side. Properly. All right, I might be done on this side. I don't know how much more times I can go over this. You know what I mean? It's like a battlefield. It really is. Go ahead and zoom in on it. Let's close it up. Close up shops. Give me a good",
      "start": 647.04
    },
    {
      "text": "side. I don't know how much more times I can go over this. You know what I mean? It's like a battlefield. It really is. Go ahead and zoom in on it. Let's close it up. Close up shops. Give me a good There's only two left. Let's do the Oh, sure. If you can finish it. Yeah. There's only three left. So, you want to just go one on each side. All right. **** it. We're in it now. We're in it to win it. It feels like sunburn. Yeah. It's cuz we're ripping your skin off. Oh, okay. So, you know. So, it's like sunburn. It's exactly like sunburn. I'm going to get this little area right there. That's going to hurt like a **** Looking at your ass right now. Beautiful. It's very white. Yeah. Yeah. It's like uh raw pizza dough. All right. There's this nice hairy patch. I got to get right here, buddy. Yo, you're doing the same one, huh? No, I was going to do it here. This is going to hurt. I'm sorry. Wait, wait. You're okay. I thought you were like on my hairline. Okay, that's just the way it felt.",
      "start": 698.08
    },
    {
      "text": "you're doing the same one, huh? No, I was going to do it here. This is going to hurt. I'm sorry. Wait, wait. You're okay. I thought you were like on my hairline. Okay, that's just the way it felt. You know what I mean? Like I can't see. We're good, buddy. Everybody keeps wanting to look my look look at my face. Can we do one where I'm looking like this and it's sort of Yeah, you can say ready covering my nips. Are you both do it at the same time? No. You do you. See, you ready? This is hard. I think at least you said it like really sympathetically. Oh, **** You had two. You Jesus. There's only two left. So, we're just Oh, I thought that was it. I thought that was the end. Oh, Colin's got a huge one. Get that thing. Oh, Jesus Christ, Greg. This one's the one that's going to hurt. I'm telling you right now. I'm calling it worst one ever. No, I think the other one was going to be I had that big ass strip was amazing. I didn't realize there was a rhyme and reason to this. Oh, no. It",
      "start": 741.76
    },
    {
      "text": "telling you right now. I'm calling it worst one ever. No, I think the other one was going to be I had that big ass strip was amazing. I didn't realize there was a rhyme and reason to this. Oh, no. It didn't even It didn't even It didn't even take any hair off. But this is sad. Is that All right. Really hairy. All right. I only have two more. He's just really hairy. You got to go in the direction of the hair. That's what the thing said. You feel sexy? No. You feel not even remotely. Just one left. Just one left on Nick set. How many you got left? I have Well, four technically. Two sides. Kowazit Tim says, \"Call looks like he just won the Bozo grand prize game.\" Oh no. Oh **** That one sucked. That one felt good too, huh? I think. Oh no. You're in luck. You're in luck. One more. Yeah. The **** we do for money. We would do it for free. You're not You're not even doing anything over there. Are you warming the **** Yeah, I'm warming it up. I'm doing the best I can do. You're right. I",
      "start": 791.12
    },
    {
      "text": "**** we do for money. We would do it for free. You're not You're not even doing anything over there. Are you warming the **** Yeah, I'm warming it up. I'm doing the best I can do. You're right. I apologize. And you were doing it for way longer than me. I apologize. It's true. I apologize. You're absolutely right. Now I know what Denzel Washington felt like in Glory. I turn around. I just have that one manly tear. Yeah. And then everyone gets **** blasted by a cannonball. Jesus. It was like that was like delayed. I was like, \"Oh, the sting we know if it's getting worse getting worse or Oh, are you putting it in the direction of the hair?\" I don't know. You got to put it in the direction the hair grows. So, you got to go that way with it. Get one spot that way. You're trying to You think this hair is growing in a direction? It's got a It's got a rhyme and a rhythm. It's going to hurt a little bit. It's growing sideways. **** And there's one more. Do I look like a butician? But",
      "start": 855.24
    },
    {
      "text": "this hair is growing in a direction? It's got a It's got a rhyme and a rhythm. It's going to hurt a little bit. It's growing sideways. **** And there's one more. Do I look like a butician? But look at it. It's all flowing. And what? Like No, it's not. Well, yeah. Now, now, Nick, am I good looking? You're something. I mean, it's definitely better than it was before. My son looks like I just took an iron and just put it on me. Yeah, it looks like you melted the hair off of it. Oh, look at how red my neck is. Yeah, we're going to put a little bit of this **** on it. It's going to make it all better. Finishing oil. It's going to make it all better. Finish it off. It's going to better. Grease the ham. Oh, look. There's a lot of blood. Calling him a ham. You're good enough. This is going to be so painful. I'm going to take a shower before I go to bed. Honey, the hot water might not be great on this. This is like a sunburn. Why are you using the finishing one? Colin's not even done yet.",
      "start": 900.4
    },
    {
      "text": "be so painful. I'm going to take a shower before I go to bed. Honey, the hot water might not be great on this. This is like a sunburn. Why are you using the finishing one? Colin's not even done yet. I'm on my side. It's already beautiful. You just went to Colin's side. We're going to use Nair next time. That would have taken five seconds. But that's but that's not funny. No, it's not. People did this more efficient. Get the finishing oil. I'm just going to block. I feel like you've been saying two more for quite some time. He's going over the same area, which it expressly says do not do. So when your shoulder's bloody tomorrow. Wait, I didn't I'm not trying to really hurt him, Cody, I'm trying to help him. All right. I'm not trying to I would never hurt. I know. Colin's my best friend. He would take care of me. I'm just having ready. Yeah. One more. Okay. Oh, that was for Nicole Tan. That was for Nicole Tan. Yeah, that's it. All right. Yay. I did it, everybody. Can do you",
      "start": 939.68
    },
    {
      "text": "friend. He would take care of me. I'm just having ready. Yeah. One more. Okay. Oh, that was for Nicole Tan. That was for Nicole Tan. Yeah, that's it. All right. Yay. I did it, everybody. Can do you want one? You want Wait, we got to put some finishing oil on your back over there. All right. Let me love the one. Can you oil him up? Look at this one red spot. That's just a perfect square right over here. Sorry. Yeah, that's uh All right. Here we go, ladies and gentlemen. The fruits of our labor. Well, no. There. Now he's zooming on my back. Not the strips. There you go. There it is. So, you can tell that How do I still have this much hair when it was because I did the You have like a pretty equivalent amount of hair over there. No, that's not even You did it longer than me. You guys doing this, but I'm really good at it. So, you can tell. All right. I'm going to cut. Can I do an outro? Hold on. I got to do an outro. Oh, I'm sorry. And then can we do a Nick? Do an outro while Colin rubs",
      "start": 982.48
    },
    {
      "text": "but I'm really good at it. So, you can tell. All right. I'm going to cut. Can I do an outro? Hold on. I got to do an outro. Oh, I'm sorry. And then can we do a Nick? Do an outro while Colin rubs you down. All right. So, that's uh am I in the shot? That's arguably the best we can do with waxing Greg's back. Thank you so much for watching. Uh if you're watching this in the month of January uh and you're you actually kind of liked what you saw. Can't imagine that you did. Uh but you if you did, go over to patreon.com/kindafunn. We're trying to fund 1 episodes of an animated show. It has nothing to do with this. It might though. A future episode might. Probably not. Uh okay. overt sexual acts on Twitch. Um thanks for joining us everyone. Subscribe to Kinda Funny and look up Kevin Quell nude. Let's make that a thing.",
      "start": 1026.84
    }
  ]
}
