{
    "id": 2819,
    "video_id": "3nPfiG0RwOY",
    "show_name": "Kinda Funny Morning Show",
    "hosts": [
        "Greg Miller",
        "Nick Scarpino",
        "Andy Cortez"
    ],
    "title": "Is it Too Late for Incredibles 2? - Kinda Funny Morning Show 07.14.17",
    "description": "Thanks to Me Undies for sponsoring this episode. Go to MeUndies.com/Morning\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1500062949,
    "duration": 2786,
    "transcript_chunks": [
        {
            "text": "what is up everybody Welcome to the morning show for this lovely Friday July 14th I'm Nick Scarpino TGF how you doing TGF you know what I mean they got to bring it back TG let's bring it back let's bring back the Olsen twins let's bring back no no no no they have the better one now which one Elizabeth Olsen yeah she's the better El twins yeah but she's not going to be doing TJ she's like an indie star she's also not a twin she likes Indies yeah she's one of the Olsen twins she's like a decade younger than them she is she's she got the better of them though she's she's the most accessible oh not successful so she was like the Olsen twins like um like they did an experiment on them and she came out like the more Superior they were doing genetic here's how the story goes in my brain they were doing genetic testing and they made these two super twins the Olsen twins you have the recessive gen brother Liquid Snake oh no it wasn't a Bane yes brother and then to test how effective",
            "start": 1.73
        },
        {
            "text": "We're doing genetic testing, and they made these two super twins, the Olsen twins. You have the recessive gene brother, Liquid Snake. Oh no, it wasn't Bane. Yes, brother, and then to test how effective they were in the public sphere, they shoehorned them into this show called Full House. I'm not sure if you're familiar with Full House, but St. a bunch of people in a house. Okay, they were the cute little babies, super full right, and then everyone's like, \"This is super successful. We should make another better version of the Olsen twins,\" and that's where you get Elizabeth Olsen, right? The third twin. The third twin. Now she's it's funny that you say the third twin even though they're they're probably a few years apart. Doesn't matter. Doesn't matter. They are if you want to go down my my deep knowledge of Metal Gear, they're exactly like Liquid Snake and Solidus Ocelot. Solidus was first. Solidus was first, and Big Boss and...",
            "start": 53.12
        },
        {
            "text": "the my deep knowledge of Metal Gear they're exactly like Liquid Snake and Solidus Ocelot and Solidus was first though, Solidus was first and Big Boss and Boss were in there too, and Boss Baby is in there too, one of my favorite encounters in the Metal Gear series, Boss Baby yeah, lots of great dialogue there, yeah it was, didn't Alec Baldwin play Boss Baby? was he like \"you're fired\" you're fired I'm the boss baby you're fired, I don't know if he had that accent oh my God you're fired you're nailing it am I crushing it it's crazy how accurate that sounds, if you didn't know Morning Show happens each and every morning at 11:00 a.m. Pacific Time on twitch.tv/kindafunnygames if you're watching it live very much thank you guys we love you uh of course you get all sorts of little cute perks and **** you're going to be a Twitch sub for us uh you can give us your hard ear money or you can go to",
            "start": 98.44
        },
        {
            "text": "live very much thank you guys we love you uh of course you get all sorts of little cute perks and **benefits** you're going to be a Twitch sub for us uh you can give us your hard earned money or you can go to Amazon Prime and uh use your Amazon Prime account to get one free Twitch Prime subscription which would like to go to us if not definitely give it to someone because it's free money take that money give it back out to the world because Amazon takes enough of ours of course if you don't have time if you're like dude I'm busy today I got **stuff** I got to do you know what I mean that's I'm out there I'm out there moving and shaking you can't afford to be here for an hour and a half you got **stuff** you got to do right every time I get stopped by the cops it's like yo cop I'm got something to do today I'm busy why was I speeding cuz I got **stuff** I got **stuff** to do man I got **my life** for a second so anyway long story short if you can't watch this live we respect that you have other",
            "start": 144.36
        },
        {
            "text": "I'm busy why was I speeding cuz I got stuff I got stuff to do man I got stuff me live my life for a second so anyway long story short if you can't watch this live we respect that you have other things to do with your life you can watch this on YouTube We post it there we also post it as a podcast to uh podcast Services everywhere including iTunes SoundCloud as long as it's around and uh bandcamp and all sorts of things like that I wish you didn't speak for me there because you said you respect them for that's a really cool Cup by the way those colors thank you you said respect them not being able to watch live I don't respect them I I worked a full-time job and I was still able to watch live so there are no excuses that's why they fired you from Rooster Teeth though and we picked you up at a bargain discount I was in The Bargain Bin I was in The Bargain Bin next was just shopping at the toy R Us it was you and all the remember bin it was me they begged him to leave it was me and Hs",
            "start": 178.84
        },
        {
            "text": "up at a bargain discount I was in The Bargain Bin I was in The Bargain Bin next was just shopping at the toy store it was you and all the remember bin it was me they begged him to leave it was me and Catwoman on DVD and the original Avengers: Stargate (corrected from \"St Troopers\") yeah it was like St remember did you ever see The Avengers with Robert Downey Jr. and Uma Thurman one of the worst movies ever made not no I almost I saw the Justice League movie though it's on YouTube the very first one good it's you're really great we should watch it now Andy before we get into uh the housekeeping I need you to say our uh our catchphrase for today's show I was about to tweet it out as well get it The Kinda Funny Morning Show where the pop culture news is popping and the cute boys we ain't never stopping we ain't never stopping we ain't never going to stop ladies and gentlemen there it is yeah uh what are people saying in the chat what do people think of us what's up bestie this is what that person said Weekend at Bernie's",
            "start": 219.56
        },
        {
            "text": "we ain't never going to stop, ladies and gentlemen, there it is, yeah, uh, what are people saying in the chat, what people think of us, what's up bestie, this is what that person said: \"weekend at Bernie Burns\" - there it is. Has Bernie ever done a short? I don't think so, but I don't watch their content; I'm not a loser. What I'm saying is, Fu losers, Bernie should do a short called Weekend at Bernie's, and it should start like \"Weekend of Bernies,\" where someone dies, but then just devolves into all of them doing cocaine and having sex with each other. Is that how the movie went? Ah, in my brain, that's how it went. No, I'm not sure that's a good idea. Did that sound like a bad idea? Yeah, you on some level think it's a good idea; like, that would be a funny ass short. Where the pop culture news is popping and the boys are popping - they're never stopping; they're never stopping. And I put a uh a little trademark symbol after it just in case.",
            "start": 270.6
        },
        {
            "text": "be a funny ass short yeah where the pop culture news is popping and the boys are popping are never stopping they're never stopping and I put a uh a little trademark symbol after it just just in case yeah oh I like that I like that it's trademarks just in case you did it yeah that's how you officially trademark stuff yeah you just put it out there when you put the symbol right after what you're trying to trademark it's it's lo I keep trying to trademark the word Nike they won't let me though really yeah is that weird I keep putting it out there in some other site called n some Twitter feed called at Nike keep saying hey stop that or we'll sue you I mean it's and then I just respond to them I respond to them this this totally cool thing that I came up with my brain I just go swoosh swoosh right it's a free country why don't they let you I don't know man First Amendment Second Amendment or please please start using swoosh all the time swoosh swoosh swoosh trademark put the trademark logo",
            "start": 308.68
        },
        {
            "text": "it's a free country why don't they let you i don't know man First Amendment Second Amendment or please please start using swoosh all the time swoosh swoosh swoosh trademark put the trademark logo if you put the trademark after after it's we're good it's yours we're good I can't wait to see you know how there's always um I forgot the gentleman's name but like on the YouTube break out no yeah definitely Tiger Woods is watching our content they break down minute by minute what the show's about penguin Von penguin is it penguin V penguin does that a lot I love penguin penguin for doing that I can't wait to see at minute 7 when it's like the boys try to get sued by Nike swoosh oh like like uh always Philadelphia style it's always sing Philadelphia I love that no that's not what he means at all doesn't matter it's like the breakdown which when they do the breakdown YouTube video likee foure I pictured like like the episode starting and then it's like no we're not going to get sued by Nike and",
            "start": 354.4
        },
        {
            "text": "Always Sunny in Philadelphia good show good show good show speaking of good shows you mentioned to me this morning that you are watching the Castlevania series on Netflix um it is very violent very gory um generally you can kind of tell where they are trying to save money in the animation Department cuz like everything is drawn really really pretty right the the background art is gorgeous the characters themselves look really cool and detailed but it's",
            "start": 396.28
        },
        {
            "text": "to save money in the Animation Department cuz like everything is drawn really really pretty right the the background art is gorgeous the characters themselves look really cool and detailed but it's like your classic anime where yeah we're going to make this we're going to make this one guy look super detailed but he's only going to have like two or three movements right because it's so hard to animate that **** yeah cuz that that level of Animation is like in depth bro there are there are a couple of really cool fight scenes that are really well done do they use the the faux 3D elements that a lot of people are using like we see on Attack on Titan where it's like mostly it's 2D but then when stuff when when the action happens we're getting 3D environments the I think the only piece that I noticed that was 3D was uh there's a part where uh Dracula is really pissed off and there's like a bunch of broken shards of glass that just broke and they're all sort of floating and they are",
            "start": 438.2
        },
        {
            "text": "that I noticed that was 3D was uh there's a part where uh Dracula is really pissed off and there's like a bunch of broken shards of glass that just broke and they're all sort of floating and they are 3D objects like floating in space kind of rotating and **** uh it is really cool I I I really liked it and it stops at the perfect part where you're like I want more because there will be more but it stops on a total Cliffhanger and you're like oh **** yeah let's do this **** very similar to The Fellowship of the Ring okay interesting way that movie ended The Lord of the Rings yeah that movie is terrible um that we don't like that movie what I'm not a huge fan of The Lord of the Rings because here's the deal in the hierarchy of high fantasy like what I would hold to be the most like Classic series like series that are better than anything else out there it goes The Lord of the Rings on the bottom everything else uh uh Daddy's home and then the what is the the Apex of fantasy series Harry Potter",
            "start": 476.6
        },
        {
            "text": "like series that are better than anything else out there it goes Lord of the Rings on the bottom everything else uh uh Daddy's home and then the what is the the Apex of fantasy series Harry Potter Harry Potter I mean Harry Potter is great I'm not I'm not going to I'm not going to say it's not great I love Harry Potter dude Daniel Radcliffe everybody is he here Daniel hey Danny he's with The Rock over there on the corner hanging out with The Rock and Kevin Hart **** what would you do if you got to party with The Rock Kevin Hart and Daniel Radcliffe man dude I'd be all up on social media dude I would be tweeting the **** out of that hell yeah dude so Andy last question about Castlevania then we'll move on to some news what how does it rank up against my two current favorite series Attack on Titan and One Punch Man I I was not as entertained as I am as I was during One Punch okay I've only watched like half of season one of Attack on Titan um but I was watching it subbed the I was",
            "start": 519.48
        },
        {
            "text": "on Titan and Hawkeye punch I I was not as entertained as I am as I was during One Punch okay I've only watched like half of season one of Attack on Titan um but I was watching it subbed the I was watching Attack on Titan subbed okay which is it's harder for me and I don't love doing that um so I enjoyed it more than Attack on Titan because I need to watch Attack on Titan dubbed and I'll probably like a little bit more um the characters are really cool one of the main characters is uh actually uh the main Aragorn from The Hobbit Armitage Stewards yeah yeah the Dark Lord Ganondorf yeah yeah Calamity Ganon DF still going remember remember when Sauron was like the dude the dude like St D dude I'd freak out freak outd freak out too he was blade man he was a bad guy from Blade he was like the awesome vampire that you wanted to be in Blade dude he was so cool he smoked cigarettes and that was when I was smoking cigarettes and I was like he doesn't care about",
            "start": 565.04
        },
        {
            "text": "was like the awesome vampire that you wanted to be in Blade, dude. He was so cool; he smoked cigarettes, and that was when I was smoking cigarettes too. I was like, \"He doesn't care about smoking.\" In Nails, yeah, just grimy, like rock and roll, and he wore... he just did that one thing where all vampires have to do, where you walk around without a shirt and low-cut, and he's like, \"I'm a vampire.\" He was hot; he was super hot. Then he started doing commercials, saying, \"Oh, where the boys are popping, and the news is hopping.\" Yeah, there he is, ladies and gentlemen. We're talking about Wesley Snipes, remember? See how hot Wesley Snipes was? Remember at the pinnacle of Wesley Snipes' career? What a hot-looking dude that was. Do you remember Wesley Snipes in the hit movie Blade? Yeah, how can I forget? And everyone at the time was like, \"This guy is as hot as it gets.\" This is this is the next big thing.",
            "start": 621.04
        },
        {
            "text": "do you remember Steven Dorff in the hit movie Blade, yeah, how can I forget, and everyone at the time was like this guy is as hot as hot, this guy got all this, this is the, this is the next big thing, Christian Slater move. I'm going to throw out I'm gonna throw a little piece of uh trivia at you, how would you feel if you found out today that Steven Dorff was cast as Ganondorf in The Legend of Zelda movie? thought he was alive, sure he's still alive, I think he's still alive, I don't know. how would I feel if he cast is Ganon, they just call him the dwarf now, they're just calling him the DF, so it's no longer Ganon Dwarf or Ganon, there's no the DF, it's Calamity dwarf, Calamity dwarf, it's Steven Wolfe in Justice League, they want to do that. okay how you doing good car drove a car in today did you yeah good for you going on a Sledgehammer Games today that's fantastic that's cool zip car yeah yeah there it is guess what you know how Zip Cars have code names guess what",
            "start": 663.76
        },
        {
            "text": "a car in today did you yeah good for you going on a Sledgehammer Games today that's fantastic that's cool Zipcar yeah yeah there it is guess what you know how Zipcars have code names guess what this code name is for this car I rented Jericho come oh that's stupid Greg  man Jericho's a way cooler code name for your car way cooler I just wanted you to know that way cooler well that's fun Uh Kevin what it's time for some news everybody says subbed sucks um or people say that dub is trash I just I have trouble keeping up when it's so visual when there's subtitled yeah because anime is like so great to look at and I'll be honest I I was with you up until I started watching One Punch Man um I watched that subtitled okay I was going to call it's called One Punch Man it's really good dub too like I watch I guarantee it is but for whatever reason the original Japanese voice acting in One Punch Man makes me  laugh so hard and I don't it's just because is it because you're racist",
            "start": 701.84
        },
        {
            "text": "too like I watch I guarantee it is but for whatever reason the original Japanese voice acting in One Punch Man makes me **** laugh so hard and I don't know if it's just because I'm racist uh partially because I'm racist probably yeah but not against Japanese people mostly just mostly just per um no I don't know why I don't know what it was but I'm normally with you like I I normally can't stand watching subtitles because I'm with you like especially in a medium like animation where it's like you have like the visuals are so beautiful and actually every frame is Art um it's hard for me to deal about my wife likes to watch a lot of like uh weird uh uh Dutch and Danish and Swiss shows she's watching this show right now called The Bridge which I believe is about a cop from Switzerland Sweden Sweden and a cop from Denmark and they find a body on this bridge that's in between the two and so they both have to get together to solve the murder which was that's super cool right but",
            "start": 756.68
        },
        {
            "text": "Sweden Sweden and a cop from Denmark and they find a body on this bridge that's in between the two and so they both have to get together to solve the murder which was that's super cool right but then she was like yeah and then in season 2 I was like wait a minute how the **** are they together in season 2 is there another body on the bridge just so happens people keep kill somebody somebody littered in that spot they're like ah who's whose job is this this is my jurisdiction no my that's how they speak in in in Sweden and it's like okay so what okay Swedish real quick I wanted to throw shout outs to generally awesome and Kum that's on YouTube and Reddit those are the people people that make the time stamps thank you who are they again say it one more time please generally awesome and Kumi yeah awesome yes you guys are amazing 786 I think it's fun for me too cuz sometimes I go back and I'm like what was that episode about and I'll get in there and I'll be like we are idiots yeah we",
            "start": 799.44
        },
        {
            "text": "yeah awesome yes you guys are amazing 786 I think it's fun for me too cuz sometimes I go back and I'm like what was that episode about and I'll get in there and I'll be like we are idiots yeah we absolute idiots yeah maybe I should finally fire off this tweet huh yeah fire it off bro let's get into some news can shoot that boy bam tweeted do first story for today Kevin are we seeing this yes uh Neil Blomkamp's zygote zygote am I saying that correct k in med school right zygote uh is live it's it went live today it's from Oats Studios over on YouTube uh if you're a fan of Blomkamp yesterday you liked yesterday excuse me if you're a fan of Neil Blomkamp's work District 9 and El Camino I'm chappy I'm Chy I'm Chy **** **** **** Bruns uh go check that out it looks really cool it's it stars Dakota Fanning and I don't know the gentleman's name because I can't tell by the fact that his face is all wrapped up I'm sure it's in the description you look it up but it's no it's actually not on",
            "start": 844.68
        },
        {
            "text": "Dakota Fanning and I don't know the gentleman's name because I can't tell by the fact that his face is all wrapped up I'm sure it's in the description you look it up but it's no it's actually not on um so I couldn't find it but I'm sure it's in the description here uh it's super cool it's a horror short uh he's been doing those on this channel for a while I did not watch raqa which I think was the other one no I did not watch that either um but heent I've always been a fan of him in the studios like visuals and the just the overall the concepts they make but like all I want is for his concept to team up with like a giant director and make here's what I told you here's what I told Nick in the back what you want what did you say I want Neil Blomkamp to make a **** met movie yeah that'd be the **** or just a series on Netflix or short what if they were like yo Neil Blomkamp your style is super cool why don't you make a movie about like Halo right I feel like they like that has been",
            "start": 889.24
        },
        {
            "text": "the or just a series on Netflix or short what if they were like yo Neil Blomkamp your style is super cool why don't you make a movie about like Halo right I feel like they like that has been in the talks before yeah it's too bad to feel they should have talked about to do that um uh one of the cool things though is if you actually go into the description of the video it actually links out to a Steam page where you can get access to all the assets they use for all of his shorts and I know he's been doing this I guess it looks like he's been doing this for the last few shorts Kevin are we seeing this right now apparently we have a problem running around making trying to fix it yeah oh no no I'm just reading chat I'm letting it looks like it's resolved okay uh Kevin are we seeing the Oat Studio assets from Steam there it is so if you go over to uh if you follow the link in the description and you're interested at all in playing around with some of these assets he's selling",
            "start": 929.92
        },
        {
            "text": "Oh, the oat Studio assets from Steam there it is. So if you go over to uh if you follow the link in the description and you're interested at all in playing around with some of these assets he's selling them uh looks like the one from looks like he has a free asset pack and then some of the uh the actual assets from his shorts Firebase Rock Cut and Zote are available for five bucks. It's kind of cool doing pretty much that you can go in there and kind of play with those models awesome as like a as a game developer to looking to see their process and see like how they were made from the ground up it's really cool uh Kevin click on the assets for Zygote and see if that pulls up some of those just bottom one it does uh that that lives asks oh did Andy finally get a laptop I've had this laptop for a long time I just I leave it at home it's where the poppers popping and the city's rocking yeah rocking getting en rolling the end I love watching this show with you you're goofball next story so here here",
            "start": 970.72
        },
        {
            "text": "Time I just leave it at home, it's where the poppers are popping and the city's rocking, yeah rocking getting even rolling. The end. I love watching this show with you, you're a goofball. Next story, so here, here was I was what I was wondering about story. I'm just giving you that cut point, Kevin, cuz the stream went down. Oh, I was just going to bring it back up from where we went back up. I'm going to have it go down, I'm gonna have it go down and then back up. You're going to go down for a little while and then come back up. Well, I mean, it's going to it's going to cut to black for so it's down right now and then it's going to come back up. Here's what you do: you just cut to the full frame of this bad boy, and then I go. Incredibles 2 will pick up exactly where the first film left off. This from our friends over at Pixar. Do you actually want me to do that? Yeah, why not. The Incredibles came out in 2004. The Incredibles 2 will come out in 2018, but for the characters, no time at all will have passed. It starts quote",
            "start": 1012.8
        },
        {
            "text": "at I9 do you actually want me to do that yeah why not The Incredibles came out in 2004 The Incredibles 2 will come out in 2018 but for the characters no time at all will have passed it starts quote right at the first as the as the first one finishes so it just carries on John Lasseter said to IGN at D23 Expo he continued with a bit more detail it starts with the Underminer and a big old set piece you know that at the end of the first film when it came up you'd finally see the family dressed as superheroes as well that's where the movie is about to start, the story goes on to read more which which is it's going to be hard to pull off because the characters are older now like the baby's got to be like 18 years old by now how are they going to convince us that that no time has passed Andy in movie world no time has passed because they can just pick it up right from there it's an animated movie they don't have to worry about the the character's aging but the girl's got to be like almost 30",
            "start": 1048.64
        },
        {
            "text": "world no time has passed because they can just pick it up right from there it's an animated movie they don't have to worry about the character's aging but the girl's got to be like almost 30 by now her voice that's why they cast all girls to do all the voices including Craig T. Nelson's voice so that the voices wouldn't change remember Bart Simpson they cast a female to voice Bart Simpson so that he could stay forever young just like the vampire from Interview with the Vampire and then she got hella pissed off and started killing everyone and they had to burn her in the sun that's what they had to do the lady from The Simpsons got hella mad and they had to burn her with the sun no um Christian Slater's character in Interview with a Vampire got hella mad that she never grew up even though she was like a hundred years old but she always looked like a kid so she started acting out and then the real vampires had to burn her she killed a couple of vampires I wonder if they're going",
            "start": 1090.48
        },
        {
            "text": "Was like a hundred years old, but she always looked like a kid, so she started acting out. Then the real vampires had to burn her. She killed a couple of vampires. I wonder if they're going to use the same technology on Tom Cruise's character, like in The Last Vampire movie. Remember, she had little twins; is the boy the main guy? No, it was Tom Cruise's character. Yeah, that was a different movie. The Vampire... yeah, the vampire he played in that I believe was actually Louis, uh Brad Pitt's character. Are they going to use the same technology on Craig T. Nelson's character, Mr. Incredible, that they used on Yul Brynner's character, Tarkin, to make him look young again? So again, yes, yes, they are. By now, Mr. Incredible's got to be what 68 years old; he's 68 years old. But the thing is, he's also two things: you're not taking into account here one, he's Mr. Incredible; two, he is probably going to use very similar facial animation technology with him like in Tron to make it exactly like Tron.",
            "start": 1126.0
        },
        {
            "text": "not take into account here one he's Mr. Incredible two he is they are probably going to use very similar facial animation technology with him like in Tron to make it exactly like Tron exactly like Tron everything's what they do um Bill Paxton what they do is they they take uh people that that they take like your image and they digitize it and they put it in the computer and then they animate it and then they spit it back out and it looks photo realistic I wonder how like freaked out he's going to be to see himself as a younger Mr. Incredible I'm I'm guessing Craig T. Nelson's just super happy that he's still alive every day yeah he just wakes up and he's like remember coach still here still here still loving life let's make some cash coach underrated show very no people loved coach when it was happening okay oh people loved it uh Kevin next story this is for all you Whovians Doctor Who's Next doctor",
            "start": 1176.12
        },
        {
            "text": "when it was happening okay oh people loved it uh Kevin next story this is for all you Whovians Dr Who's Next doctor is finally being unveiled this Sunday says James Whitbrook over at io9 it's been 165 days since we've heard that Peter Capaldi's time on Doctor Who was up now we finally know that it's going to be just a few short days until we meet his successor the BBC has just announced that this Sunday July 16th after the men's Wimbledon naturally uh finally has aired on BBC 1 oh finale excuse me final excuse me has aired on bbc1 they couldn't have made this more thoroughly British if they tried really that's what he said I made the joke already screw you Whitbrook uh the identity of the 13th Doctor will be revealed here's a needlessly dramatic trailer announcing the news Kevin can we play that and I'm sure this will be super pertinent for me and you since we're both Whovians do you actually",
            "start": 1216.16
        },
        {
            "text": "\"Doctor Who will be revealed here's a needlessly dramatic trailer announcing the news. Can we play that? And I'm sure this will be super pertinent for me and you since we're both huge fans. Do you actually watch Doctor Who? No, not the least. Why is this a minute long? I really like that. Can we just spoil the surprise right now? No, they don't say who it is. It's Jodie Whittaker. Oh my God, everybody go congratulate Jodie Whittaker on being the new Doctor Who. Don't congratulate Rahul Kohli on being the new Doctor Who. Everyone tweet at Jodie Whittaker and at BBC Doctor Who and say 'hey how come Rahul Kohli is not the new doctor?' Cuz he's just great. Also, tweet at Star Wars and say 'how can Rahul Kohli not be in a Star Wars movie? He would be amazing.' Is that also tweet at James Bond and be like 'hey Rahul Kohli would be awesome as Bond.' Either Idris Elba or Jodie Whittaker. Also, when's the new Miss Marvel movie? Rahul Kohli everybody tweet at Miss Marvel and at Riz Ahmed be like 'he'd be an awesome as that character yeah Kevin does this mean\"",
            "start": 1262.32
        },
        {
            "text": "awesome James Bond either ID Zelda or Rahul Kiy also when's the new Mission Impossible Rahul Coy everybody tweet at Mrs. Incredible and at Rob Co be like he'd be awesome as doubt yeah Kevin does this mean anything to you this trailer we're watching I haven't watched the last two seasons but I've watched like five seasons here's why I haven't started watching Doctor Who yet I hang out with Sean Pitts every once in a while you know he's got the Doctor Who tattoos he dresses up as the doctor with The Fez and stuff and all that stuff he carries around the phone booth with him whenever we cosplay or whatever um he's always telling me to get into Doctor Who and I'm always like cool how do I start he goes well here's what you do you got to start with episode two season 5 then go to the movie then go back to season six then started season two and I'm like bro I'm done I'm watching car restoration shows on Velocity CH I think it's like Netflix just watch episode one season I'll never watch it no",
            "start": 1307.52
        },
        {
            "text": "back to season six then started season two and I'm like bro I'm done I'm watching car restoration shows on Velocity, I think it's like Netflix just watch episode one, season I'll never watch it no but he says you don't want to do that because it gets progressively way better so start where it's better and then work your way backwards that's stupid why would you do that just start where it starts and like be like oh this is this is fine and then keep watching and it's like whoa this is excellent now I like where your head's at Kevin maybe I'll do that from now on maybe Sha pittz is wrong, Hash Shan Pitts was right still hasn't paid that check you believe that no I believe it I believe it still hasn't what uh he lost the bet with Greg and he needs to bring over the money hey there's a fake check though yeah what does that what does that do with us for us I don't know but uh Tim Schafer we gave Tim Schafer a fake check back in the day at UbiSoft and he tried to put it into a uh into",
            "start": 1353.24
        },
        {
            "text": "\"Fake check, though. Yeah, what does that have to do with us? I don't know, but uh Tim Schafer we gave Tim Schafer a fake check back in the day at E3 and he tried to put it into an ATM, which was hilarious. That was really funny. Tim is one of my all-time favorite developers. We gave him a real five-dollar bill as well. Did we? Yeah, what did he do with it? Did he just give it back to Greg like 20 bucks? I think I don't know if he knows how money works. No, it was an investment in his game. Fair enough, fair enough. That's awesome. It's King James now says who's Rahul Kaur wrong spelling? Yes, that's very much the wrong spelling. Rahul is one of our friends; we've had him on the podcast. He plays Ravi on iAmRavi (note: I corrected \"iami\" to \"iAmRavi\", assuming it was a typo). He's definitely our best friend and nobody is closer to him than he likes us, let's just start this narrative right now way more than he likes any other content creators whose channel he's been on like Funhaus, those psychopaths, like James, those drug-addled psychopaths except for\"",
            "start": 1393.92
        },
        {
            "text": "this narrative right now is way more than he likes any other content creators whose Channel he's been on like like fun house those Psychopaths like James those \"Adele\" Psychopaths except for Elise she's an angel everyone can **** off don't make fun of her but everyone can definitely make fun of Adam and Bruce and Lawrence and psychopath James with his **** beautiful blue eyes and his triceps so beautiful God he's such a good-looking Man. I I I hugged him way too much this weekend and I I noticed that started getting very like like I was trying to get something out of it right like it I was subconsciously trying to get more than a hug from him like it was way too many hugs Nick let me tell you we're crossing each other they're going to go sign autographs we're going to a panel it's like hey how's it going hug and then yeah oh **** yeah hug again and then after their panel there was like seven hugs that we exchanged and then before we left there was another like four or five",
            "start": 1439.8
        },
        {
            "text": "like hey how's it going hug and then yeah oh **** yeah hug again and then after their panel there was like seven hugs that we exchanged and then before we left there was another like four or five hugs before we came back to San Francisco so like was I trying to **** him yeah yeah actually I think if you touched him that much by the definition of Texas law you have had sex with him right true yeah right Texas is very very just easy going on the whole sexual laws from what I understand you basically can go up to and have sex with whomever you please there I I think it's very much the opposite is it the opposite I read I read I read twet they went to this I read tweets a lot Kevin I've read Wikipedia before I got cool Craig with that one k doesn't laugh at anything I say and occasionally he'll just giggle at something and I know that that was an actually either bad and or good joke Uh Kevin last news story yep man stuck in ATM machine is what you put on here this comes from huff post",
            "start": 1483.04
        },
        {
            "text": "\"He'll just giggle at something and I know that was an actually either bad and/or good joke. Uh, Kevin, last news story, yep, man stuck in ATM machine. Is what you put on here? This comes from Huff Post, uh, the weird news section, which I absolutely love that you're pulling stories from there. Uh, ATM spits out desperate note from trapped man - that's a headline if I've ever heard one. I'm fascinated about this; I'm clicking on that headline. The story reads: 'Imagine going to an ATM to get some cash and instead of a receipt, you get an eerie plea for help scribbled on a slip of paper.' That's exactly what happened to customers at a Bank of America branch in Corpus Christi, Texas, Wednesday afternoon after a repairman got stuck inside a room connected to the machine. Please help; I'm here, and I don't have a phone. Please call my boss.\"",
            "start": 1531.08
        },
        {
            "text": "Help, I'm here and I don't have I'm here and I don't have a phone. Please call 210 so he's from the San Antonio, Texas area code or area that's a 210 basically. Please call my boss. The note reads apparently uh he left the cell phone and swipe card he needed to get out of the room outside in his truck. Corpus Christi police Lieutenant Chris Hoover told the Associated Press the traffic man was stuck for about two hours according to CBS New York anchors who could barely contain their laughter while describing the situation, hey as a person who suffered from claustrophobia he's probably terrified **** you who the **** was this uh CBS news anchors nobody watches your stupid ass show anyway um Jesus. Corpus police officer Richard Allen told NBC affiliates uh KRI TV that some people who saw the note initially thought it was a joke. Luckily for the paraman, a contract worker who had been who had not has not been identified someone took it seriously and called for help but even",
            "start": 1577.04
        },
        {
            "text": "who saw the note initially thought it was a joke, luckily for the paraman, a contract worker who had been, who had not has not been identified, someone took it seriously and called for help but even the police were totally convinced it that wasn't real uh we quote \"we could come out here and sure enough we could hear a little voice coming from the sheen\" Olden said so we were thinking this is a joke it's got to be a joke, police uh freed the repair man by kicking down the door to the room where he was trapped or they could have just gone into his truck and grabbed the card and I guess it doesn't really matter let's kick that door down reminds me a lot of after two hours you're probably not making a lot of sense can you imagine being trapped somewhere for two hours in a small room that's dark with no one, not being able to get out be freaking out wait did they say it was dark I just assume it's dark you're around money it kind of reminds me of The Hobbit when he's stuck in the castle with all",
            "start": 1623.64
        },
        {
            "text": "No one not being able to get out be freaking out, wait did they say it was dark? I just assume it's dark. You're around money, it kind of reminds me of The Hobbit when he's stuck in the castle with all the gold around him, so like yeah you're The Hobbit one two or three where they told a 120 page story in 9 hours. Bite your tongue, remember the part where they were like hey let's go into the backstory of the Orcs wouldn't that be awesome? I am an orc, oh I kill you and then the dwarf's like the dwarf the king is like I don't know what's happening because the story should be over by now. It looks like an orc, I can eat that orc. That's an Australian accent, you can't do accents, sh I always cut into Australian always, you be doing like Russian and you go into Australian, you know what cuz the Australian accent is the most fun to do because Putin was like looking at Trump and he's like oh you can't go over here mate, you know hey Trump you got to do what I tell you to do uh but if",
            "start": 1659.08
        },
        {
            "text": "the Australian accent is the most fun to do because Putin is like looking at Trump and he's like oh you can't go over here mate you know hey Trump you got to do what I tell you to do uh but if you're doing the Australian accent you're just doing uh Laser Beast laser beam laser Beast his name is Laser Beam Lannon from the Let's Play Network very inside joke yeah very inside joke all right yeah Greg's coming in here to tell us move along show got got to do today I'm warming up the iron for my shirt so I thought i' just take a walk around the office okay cool man fantastic Greg you're how can happen you're dead you're **** dead right there oh too you just you're going to fall and break the damn LED I'm not going to break I just watched them destroy it on like what was it what event was that Balls of Fire Great Balls of Fire they destroyed L LED they would just mean that we have another one coming is that the the the mov no Great Balls of Fire no uh that's that's just ball of",
            "start": 1703.52
        },
        {
            "text": "Was that Balls of Fury? Great Balls of Fire, they destroyed L.E.D. They would just mean that we have another one coming. Is that the movie no, Great Balls of Fire. No, uh, that's just Ball of Fury. Balls of Fury, Great Balls of Fury, the best ping pong movie ever made by far, next to Dodgeball. Yeah, uh, Greg, yeah. Would you like to read our PS I Love This best friend xoxo for this for today? Yeah, I don't think this thing is like just just you got to go out and come back in if you didn't know. Ladies and gentlemen, Kinda Funny is all about community and friendship and love, and if you have a best friend you love, you post that on that you went to the leg, you want to actually molest you, you yeah don't grab his dick what the **** would get really mad at me? You can go to kind.com, bestfriend nominate a best friend in the community who's doing something awesome and needs to be recognized. They'll get",
            "start": 1747.0
        },
        {
            "text": "Greg would really mad at me you can go to kind.com bestfriend nominate a best friend in the community who's doing something awesome and needs to be recognized they'll get recognized here we all love each other it's amazing uh Robert wrote in to recognize Lamar Henderson I can't remember the last day I didn't see a post from Lamar wishing everyone a great day his posts are usually short and always full of Positive Vibes for the community thank you Lamar for spreading the true message of Kinda Funny chat sucks best friends whoa sorry what the chat do it's just you got the chat I mean yeah but think maybe that's why the internet cut died is cuz you guys have 15 versions of the chat open I don't think I don't think that takes that much yeah I'm sure text is a whole lot of information saying I'm just saying so on the internet son doing all those instant messages stop there's no LED wall to get where's the LED wall Kevin I mean there's a very expensive TV",
            "start": 1798.68
        },
        {
            "text": "\"A lot of information saying I'm just saying so on the internet son, doing all those instant messages, stop there's no LED wall to get where's the LED wall Kevin? I mean, there's a very expensive TV and then another one right behind you. Just let him do karate, man, that's not what he's doing. Jesus Christ, that was wow, no it's made to support a full man's body, that was very close. I just...I just uh spaced out there, what happened the last 5 seconds? That was very scary, is something that I want to know about, no so I just uh cool, I just blocked out, cool. All right guys great. Uh Kevin it's giveaway time, it sure is Andy, it's giveaway time, give away, give away now we give away a game here Spider-Man, give away spider pig SP pick does whatever a SP Nick if you get us all riled up and we start playing around during the uh giveaway time that's not on us, it's good point we're not going to do that. I specifically said don't screw around during the giveaway time and I blame myself for starting that Rampage just now.\"",
            "start": 1838.76
        },
        {
            "text": "the uh giveaway time that's not on us it's a good point we're not going to do that I specifically said don't screw around during the giveaway time and I blame myself for starting that Rampage just now uh how do you get entered in to win the daily giveaway codes four ways there's four ways one you can be in the Twitch chat right now don't spam the Twitch chat you don't need to worry about that you're just entered to win if you're in the chat right now two you can be a Twitch Prime subscriber we pull from that list as well how do you become a Twitch Prime subscriber well you can pay your hard-earned money or if you have an Amazon Prime account uh you can use that you get one free Twitch Prime subscription we'd like it to go to us if not make sure it goes to someone who's awesome because Amazon has so much money they're going to take over the world and we just want that to happen a little bit later we want it to happen but we want it to happen a little later uh also you can support us on",
            "start": 1891.72
        },
        {
            "text": "has so much money they're going to take over the world and we just want that to happen a little bit later we want it to happen but we want it to happen a little later uh also you can support us on Patreon or Patreon uh I'm sorry Kinda Funny on Patreon or Kinda Funny Games on Patreon uh and you're interested to win as well uh you named the other two already yeah I was waiting for you to go three three you can go to patreon.com/KindaFunny or four patreon.com/kindafunnygames and support us uh over on there and you're entered to win the daily giveaway before we announce this person and Kev let me know where this person came from as well Twitch chat that came from Twitch chat okay Twitch chat Twitch chat giveaway time I'm going to eat lunch soon this giveaway is sponsored today Andy like it's been sponsored all week by MeUndies now do you wear Me Undies I do not I don't wear them either but I'll tell you one thing one person who we know definitely does because he's forced me to touch",
            "start": 1928.76
        },
        {
            "text": "been sponsored all week by MeUndies now do you wear MeUndies I do not I don't wear them either but I'll tell you one thing one person who we know definitely does because he's forced me to touch them every day this week that I've hosted the show Greg Miller loves MeUndies can't talk about them enough says talk to HR about says they're super soft says they hug him in all the right places and let loose in all the right places as well they keep them they keep everything where it needs to be and dry which for a Greg who sweats a lot and when he does sweat it smells like old cheese that's a good thing mhm that's a really good thing uh MeUndies the softest most comfortable underwear you will ever wear if you're used to buying boring underwear MeUndies will change everything you really got to wear them to believe them every pair of MeUndies is sustainably sourced and made from micro modal a fiber a fabric that's three times softer than cotton because MeUndies comes in all kinds of colors",
            "start": 1975.64
        },
        {
            "text": "wear them to believe them every pair of MeUndies is sustainably sourced and made from micro modal, a fiber, a fabric that's three times softer than cotton. Because MeUndies comes in all kinds of colors and patterns, and they release new limited edition patterns every month; they always sell out. Right now you'll save 20% off of your first pair, uh, and receive free shipping only at MeUndies.com Morning, that's MeUndies.com Morning. And if you don't love your first pair of MeUndies, they're free. You can take them, you can do whatever you want with them; clean the house with them, give them to your friend. What you should do is, if you don't like them which I'm sure you will like, but if you don't like them wear them a bunch of times then give them to your friend rent them out here you go make profit $5 a day. You can wear MeUndies, get 20% off your first pair plus free shipping MeUndies.com Morning that's MeUndies.com Morning for the fourth time MeUndies.com Morning Craig are you wearing today",
            "start": 2020.92
        },
        {
            "text": "$5 a day you can wear MeUndies get 20% off your first pair plus free shipping MeUndies.com Morning that's MeUndies.com Morning for the fourth time MeUndies.com Morning Craig, are you wearing today? That close bend over and show us. Me Andy, guess what color they are? You see them purple no blue no, they got this blue pattern on. Oh those are sexy thank you, that's a man right there huh, that's a man little roses or something. I'll show you what you do you do this right no shake them off shake them off shake them off shake them off shake them off why are they coming off so slowly? I'm going to move this closer to the camera so it's bigger. I wear a tight I can figure it out no, I was trying to cover you up up okay oh Jesus oh wow those are really soft I can feel the softness right through my shirt told you thanks micro modal Fab am I saying that right modal modal micro modal fabric. I'm Ron Bodell this H today's winner wins Dead by Daylight on the PS4 we have pull the randomizer is pulled from the",
            "start": 2058.56
        },
        {
            "text": "you thanks Micro Modal Fab am I saying that right Micro Modal Micro Modal Fabric I'm Ron Bodell this H today's winner wins Dead by Daylight on the PS4 we have pulled the randomizer is pulled from the Twitch chat today and the lucky winner is Mars B0w that is M A R S B 0 W congratulations you've won Dead by Daylight on the PS4 courtesy of MeUndies uh enjoy that unless you don't have a PS4 in which case do what you would do with your pair of MeUndies wear it around play it around and then just gift it to your friend leave it all stinky and nasty yeah know here you go brother showare the love you're welcome show the love now they're You Undies now they're our undies Andy let's go into the Patreon to three and three in the Twitch chat the old Mor 3 and three I will take three questions comments or concerns from nonsubscribers and then we'll go to our subscribers oh we do have to three tips I apologize thank you thanks for uh let's do that first doing something on this show today yeah I'm useful",
            "start": 2104.2
        },
        {
            "text": "From nonsubscribers and then we'll go to our subscribers oh we do have to three tips I apologize thank you thanks for uh let's do that first doing something on this show today yeah I'm useful for something oh hold on everybody I'm going to read your two and then we're going to take some questions comments and concerns and then we're going to go hard our first tip today comes from Sean the Hugo says I'm flying to SF tomorrow what should I see when I'm here I'm definitely going to Wing Wings to keep up the great work especially with Kinda Funny Games Daily Now a couple things uh Wing Wings is fantastic go there's lots of Awesome music do not go to Pier 39 please don't really don't do it wait what it's a tourist trap go to the de Young Museum go to the Museum of Modern Art visit Fisherman's Wharf visit all the cool neighborhoods the Haight go to the Haight go to Wing Wings hang out at the Haight go to all the cool stores there don't buy a **** shirt with the sea lions on him they abuse those sea lions",
            "start": 2160.88
        },
        {
            "text": "visit all the cool neighborhoods the hate go to the hate go to Wayne Gretzky hang out at the hate go to all the cool stores there don't buy a **** shirt with the sea lions on him they abuse those sea lions those sea lions are slaves they're not allowed to leave that little platform really no they choose to be there the sea lions actually love it next tip comes from stsk F they already they already Tri yeah they got him man they got him **** good he's such a **** squib next you know he's going to be a sea lion like Nick Scarpino you don't use my insult against me you understand what I'm saying you don't use my over there what P39 check out Chinatown manat Japan Town **** Town sucks no Japan no Japan Town's cool man sucks the no going inside of that mall is chin is cool Japan's cool it's cool sty has given us another tip and says paying my mom's wedding tax she's getting married today and I can't watch live I love all the content you guys have been putting up hope you guys have a great",
            "start": 2209.32
        },
        {
            "text": "\"Thanks has given us another tip and says paying my mom's wedding tax she's getting married today and I can't watch live I love all the content you guys have been putting up hope you guys have a great Friday and keep that chicken thank you for that and congratulations to your mother, hope oh I hope we we hope she's happy with uh with the person she's chosen to spend her life with. Anakin says morning fellas, I was going to make a joke there but it just didn't feel right to make some fun of someone's mother, you know it's all good. I was going to talk about having sex with his mom but I was like it's her day today, yeah let her have it, let her have it tomorrow. I wouldn't let her have it with your dick dude. Wonder what she's doing with that dick. Anakin says morning fellas hope you guys didn't forget your 80 cent Donuts at Crispy Cream today. Question for Candy Andy being new to the Bay Area, what's your favorite place to eat so far and he gave us another tip follow up.\"",
            "start": 2256.52
        },
        {
            "text": "\"Hope you guys didn't forget your 80-cent donuts at Krispy Kreme today. Question for Candy Andy, being new to the Bay Area, what's your favorite place to eat so far? And he gave us another tip. Follow-up that says 'PS nasty love to Big Cat Dog.' Here's a fun clip - I didn't think it was that much fun; it was kind of like upsetting. Let me see it. Let's watch it real quick, okay? Hold on, what you mean... well, we'll watch this. I'll think of my favorite place, yeah. Mean, I'm going to screen it with you because I just... oh, he's going to get rocked. Oh my God, he got rocked. And I'm going to be honest - I hate the way it's edited. No, yeah, that's uh... let's not watch that. That's some dude getting hit by a car. Did he also go? Does a guy crash his car but like... he broke his for sure. My favorite place to eat so far in San Francisco is in Japan Town. Wait, your favorite place of all is in Japan Town? Yes. Oh man, he gets all high and mighty. Nick... to eat I'll tell\"",
            "start": 2292.56
        },
        {
            "text": "so far in San Francisco I'm showing I'm going to show him happens to be in Japan Town wait your favorite place of all is in Japan Town yes oh man he gets all high and mighty Nick  **to** eat I'll tell you one Kevin is professional and he is uh very good at a number of areas one of them is tech one of them is eating what I thought you're gonna say Tech and eat that would have been cool um so he knows his  Marukyu Ramen okay fell in love it's one of my like in my top three ramen places there's Ramen Tatsuya in Austin MH there is Ippudo Ramen in New York yep and there is Maru fuku here in San Francisco phenomenal no shout outs to uh what's that place over here called by Greg's old place that place is okay I don't know to me I am ho I enjoy the broth at at Marukyu Ramen so go to Marukyu Ramen yeah and then go to wherever Kevin tells you he'll tweeted him he'll tell you 15 other restaurants Amy gills uh has given us a tip says birthday tax for Mama Gilroy hope you Lads are having",
            "start": 2330.48
        },
        {
            "text": "Ramen, yeah, and then go to wherever Kevin tells you he'll tweeted him, he'll tell you 15 other restaurants. Amy Gill's uh has given us a tip: \"Birthday tax for Mama Gilroy.\" Hope you Lads are having a great Friday. Thank you, Amy. Happy birthday to your mama. And our final tip for today comes from Peppermint Gentleman, says, \"I'm sorry for your uh design exhaustion, Andy. I believe in your powerful creative brain. I'm hoping I'm holding out hope for the Kinda Funny Power Rangers logo.\" I'm **** and AI at AI with AI, so I can't uh make it my dreams Make My Dreams real. Jesus Christ, apparently words are hard for me today, guys. It's all good. Do you want me to read subs after the show's done? Yeah, you're going to read subs today after the show's done. For that, I appreciate it. Uh, let's take some questions from the chat. We're running late, kind of yeah we we still got to talk to some peeps. We're gonna have some Peps, yeah. We're gonna do it. Honey Boooo says can you guys give my friend Chris a shout out and",
            "start": 2390.28
        },
        {
            "text": "the chat we're running late kind of yeah we we still got to talk to some peeps we're gonna have some people yeah we're gonna do it honey boooo says can you guys give my friend Chris a shout out and call him CHEESE again I it really means a lot to me I don't know what that means what's the word what does it start with I'll just extrapolate hey Chris cheese again is that right that I do it right I don't know what are we doing uh Grumpy Goron says Nick can I can I hear that amazing Prince impression Andy can you give it to me too let's give him PRINCE on three ready one two three it's pretty good thank you it's pretty good mhm uh Andy Ryan Sania says I just met Hulk Hogan in the gym I'm lifting in oh yeah that's pretty AWESOME Ryan Sly just sent me the text look at that AWESOME oh my that's awesome Kevin can we get sky cam uh yeah give me a second okay this is Ryan Santilli and Hulk Hogan right there there look at that look how AWESOME good for you Ryan that's great Ryan tweet that out",
            "start": 2429.84
        },
        {
            "text": "\"Awesome, Kevin, can we get SkyCam? Uh, yeah, give me a second. Okay, this is Ryan Santilli and Hulk Hogan right there. There look at that, look how good for you, Ryan, that's great. Ryan, tweet that out so people can see how cool you are. Congrats, dude. Man, Hulk is looking rough, huh? I mean, he's getting up there in the... yeah, he's I mean, he's done all he can; he's got a lot of more money now, he does. Yeah, yep, yeah, he did; he won that **** he won that Gawker lawsuit right? Yeah, yeah, deserve to though they did, they **** over on that one bad. AER, all right, let's go into sub-only mode right now. I'll put us in there nice dude. And you've gotten a lot better at hacking and and computers. I hate both of you so much; your T Computing skills are really Advanced nice dude good job good job Joey. That's what you're supposed to do. Nick, who's the better Andy? Andy Cortez or Andy Circus? We talked about that this morning. Andy Cortez undeniably by a mile easily because he never stands on chairs and\"",
            "start": 2485.92
        },
        {
            "text": "\"That's what you're supposed to do, Nick. Who's the better Andy, Andy Cortez or Andy Circus? We talked about that this morning. Andy Cortez undeniably by a mile easily because he never stands on chairs and reads off of scripts. No, I've seen him do that three times now, Andy. Three times... Prove it! I have a video of it... Prove it! Remember you were doing that thing like I'm going... Prove it! Cab PQ says that's not the Hulkster; it's just some crazy homeless guy. Pretty sure that's Hulk Hogan. I'm not gonna lie, Lord of the Rings is the best movie trilogy ever made by anyone in history of ever. I agree, I agree, except for Star Wars and every other... Trilogy movie like Harry Potter. I like, I like The Lord of the Rings more than Harry Potter. Was The Lord of the Rings the best three-movie trilogy of all time? One-two-three punch, baby! Yeah, and then you know why it's the best because I call it a three-punch six-five more movies. Yeah, it's awesome. Sure did they... sure did. Nick is Hugh Jackman off from the movie Swordfish?\"",
            "start": 2539.12
        },
        {
            "text": "Two Three Punch baby, yeah! And then you know why it's the best cuz I call three punch six five more movies, yeah it's awesome. Sure did they sure did Nick is Hugh Jackman off from the movie Swordfish remember, yeah he gets jerked off was so hot he's like I can't focus know he gets blowy he gets a little blow blow a little blowy that was an awesome scene as a kid watching that I was like God I want I want to live that what's that you say how's the Hugh Jackman off going Andy uh it's going very well I worked out twice this week, yeah did one uh one for us no not today let's see Scooby-Doo, Daddy I think I'm chasing that pump now with the Pump Chasers. I don't know if you that that's the name of my squad, the Pump Chasers, Pump Dum is that like steroids or it could I keep telling people that we need to start using steroids and youf keeps saying no that's illegal yeah stopping in what country it's not illegal you can just use them right you have to you have to buy them illegally though you.",
            "start": 2586.16
        },
        {
            "text": "we need to start using steroids and you're keeps saying no that's illegal, yeah stopping in what country it's not illegal, you can just use them right, you have to buy them illegally though, you can't, I don't think go get proof that they're illegal, the problem is I don't think the use is illegal, I'm trying to research this, I just need to find a guy, you know what, I'll get you a guy, you want a guy, you got a guy, I'm sure that I can get you a guy, I would like to start cycling on and off of TRT because I'm an old man and I'd like more testosterone in my system, yeah, I'm hoping it makes me taller, is that medically sound, Nick and Greg how do you think humanity will end and how do you think the Earth will end, I don't think it'll ever end, I think what'll happen is uh we will invent the robots, the robots will kill all of us and the Earth and the robots will go on in perpetuity, we will invent the robots, yeah, there's a lot of robots that exist already, talk about the Rob the",
            "start": 2626.4
        },
        {
            "text": "the robots the robots will kill all of us and the Earth and the robots will go on in perpetuity we will invent the robots yeah there's a lot of robots that exist already talk about the Robo the robots do you see I was watching the CNBC this morning cuz my mother-in-law is staying with us and she likes to watch the channel That way they talk about stocks and investments and oh sure okay Bloomberg maybe it's Bloomberg I don't know which one is and there they have commercials for different companies and it's the trippiest thing because there's this commercial for this company that's like that has these robotic security guards that are these super cute little pod things and and I'm like that's cool I could just imagine those things having a laser that pops out and just shoots your head off is that terrifying is a great point by Justin Bieber the year will end in the year 2033 and we can save it with the Black Eyed Peas everybody",
            "start": 2664.84
        },
        {
            "text": "that pops out and just **** shoots your head off is that terrifying is a great point by Justin Ryan Bear the year will end in 2033 and we can save it with The Black Eyed Peas everybody please go watch our GameOverGreggy topic where we talk about recasting The Black Eyed Peas it is not a serious topic Andy they didn't like it let it go it's Andy why didn't people like this topic because they thought that we were being serious about it they how could people misconstrue that as being serious saw the topic name and we're like why the **** are they doing this no it's a joke Kevin don't interrupt me it's really really funny God I hate God I hate when he does that hate when he does that Nick if you didn't know ladies and gentlemen this has been The Kinda Funny Morning Show thank you so much for joining us on this magical Friday enjoy your weekend hopefully you can find some sun if not just do something fun this weekend for us think about me while you're doing it think about",
            "start": 2699.72
        },
        {
            "text": "you so much for joining us on this magical Friday enjoy your weekend hopefully you can find some sun if not just do something fun this weekend for us think about me while you're doing it think about Andy Cortez while you're doing it and you know what I'm talking about by that we'll be back Monday morning 11:00 a.m. Pacific Time West Coast is the best coast we love you all stick around Kinda Funny Games Daily is coming right now before that Andy's going to read you some subscriptions with a mic that actually works subscriptions Subs right he's going to read all of your magazine subscriptions right now oh God are we done honey says and did you know that pig skin tastes like vanilla and caviar what's Vanilla is he trying to spell vanilla it doesn't matter cut it it doesn't matter",
            "start": 2741.56
        }
    ]
}