{
    "id": 2848,
    "video_id": "62ti8ODRCuo",
    "show_name": "Kinda Funny Morning Show",
    "hosts": [
        "Greg Miller",
        "Nick Scarpino"
    ],
    "title": "Superman's Mustache - Kinda Funny Morning Show 07.25.17",
    "description": "Thanks to Dollar Shave Club for sponsoring this episode. Go to DollarShaveClub.com/Morining\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1501019155,
    "duration": 2581,
    "transcript_chunks": [
        {
            "text": "Champion Champions I **** up there it is the Champions hello and welcome back to the Kinda Funny Morning Show for this fine day Tuesday July 25th I'm your host Nick Scarpino with me of course my partner my other partner in crime Game Over Greggy, with me. I got two partners in crime. I got you, I got Tim what about Andy? What about cool Greg? Andy is my partner in lunch. Cool Greg is my partner in cool and Kevin is he is The Rock, he is the rock upon which all this is. I say that about you and a me's relationship, you and me smoke cigars yesterday we were drunk as skunks it was good times out there if you guys were not fortunate enough or actually very fortunate to not join us live for the uh the live GoG uh stream we did yesterday by the way if if you back us on patreon you can watch let me back up if you back us on Patreon, Patreon you can watch us live record the podcast which we did yesterday now what you miss sometimes is that yesterday's podcast everyone got real drunk real",
            "start": 0.88
        },
        {
            "text": "let me back up if you back us on patreon Patreon you can watch us live record the podcast which we did yesterday now what you miss sometimes is that yesterday's podcast everyone got real drunk real drunk except Tim Gettys so I was the one sober I was the designated driver of the podcast yesterday and every other host really didn't give a **** about me so they made fun of it but it was super fun I think it was a good podcast it was a great podcast even though you tried to say it wasn't a good podcast the last topic is great was every single person talking over each other and me just doing this Andy can I get what was your impression Andy and like YouTube chat loved it YouTube chat loved it oh what a surprise you **** Andy's on your side my partner in lunch my partner in lunch broke Tim Gettys' heart yesterday Tim Gettys got pissed yesterday because Tim Gettys had to do games daily and I was like I'm too hungry man Andy you want to go get some lunch real quick we had",
            "start": 58.64
        },
        {
            "text": "in lunch broke Tim Gettys' heart yesterday Tim Gettys got pissed yesterday because Tim Gettys had to do Kinda Funny's games daily and I was like I'm too hungry man GameOverGreggy you want to go get some lunch real quick we had a full schedule that day **** we had to do we had to record the podcast at 3: Kevin don't do that Kevin's doing pull-ups on the bar over here aren't you impressed that that's how all the weight it's great it's fantastic but it's also tens of thousands of dollars that are in here that Kevin ah come on that thing ain't coming down anyway if you didn't know Kinda Funny, The Morning Show brings you all the new news every day 11: a.m. Pacific time uh we'll be here we're here if you want to watch live if you can't watch live no big deal we're on YouTube uh we're on iTunes we're on Soundcloud you can get this pretty much everywhere we can put it in any orifice you want your ears your mouth your eyes we've got you covered our eyes in an orifice I I mean the your eye socket is an orifice yes cool",
            "start": 101.76
        },
        {
            "text": "you can get this pretty much everywhere we can put it in any orifice you want, your ears, your mouth, your eyes, we've got you covered. our eyes are an orifice, I mean the eye socket is an orifice, yes, cool. then without eyes, anything you can **** is an orifice. um, of course, if you're watching live with us and you want to give us a couple bucks to subscribe, you get cool little fun emotes, uh, you get private chat time with us, you get entered into the giveaway, give away a game every day, and also when we play games like Friday the 13th, you get to play them with us, which is super fun. and Greg has been playing a lot of Friday the 13th lately, true, I know because I every time I walk out of the office it's like \"no, there's no poo-poo\" you're saying Kaka and poo-poo, those are **** words that's what babies say about is that what they say, is that what they say, yeah, that's not the same thing man. um, of course, how do you become a subscriber well you can pay us your hard-earned",
            "start": 142.64
        },
        {
            "text": "\"Thanks to Dollar Shave Club for sponsoring this episode. Go to DollarShaveClub.com/Morning\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\n\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.\"\n\nI corrected phonetic mistakes and spelling errors, capitalized proper nouns like names and show titles, and cleaned up the text for grammar and punctuation. I also removed filler words (\"um\", \"yeah\") to make the text more readable while preserving the original meaning and tone of the hosts' conversation.",
            "start": 183.64
        },
        {
            "text": "it's true, it's true except for that SLR Gone Wild place, that place is very positive, I like incredibly positive uh a couple housekeeping uh pieces before we get into the news of course Kinda Funny Live uh three is live right now for patrons who are supporting at the $10 or above level on either of our Patreon rounds so if you are not at the $10 above level and you want to watch Kinda Funny Live three right now, up your pledge for this week, you can totally take it and throw it away next month doesn't matter um or if you're like hey dude I got bills to pay I got 10 kids I'm working at a McDonald's I got maybe I might get that Starbucks job one of these days I've got no time for this **** you wait a week it's going to go free to everyone be it'll be on our YouTube channel for everyone in one week so just cool your jets, but if you want to be part of the cool kids club like we are pay that $10 son um and our",
            "start": 214.56
        },
        {
            "text": "go free to everyone be it'll be on our YouTube channel for everyone in one week so just cool your jets McGee but if you want to be part of the cool kids club like we are pay that $10 son um and our last piece of housekeeping news right now before we get into the real nerdy news is uh there's a new Doodles up and holy **** it's a good one real good one great job Zack oh my God the classic how many 5-year-olds can we beat up how many 5-year-olds youtube.com/ kind of funny which is funny because I was listening to you know I'm a big fan of one Joe Rogan know that I was listening to his podcast and he had a similar topic where so I think his producer brought up how many 12-year-olds do you think you can **** up oh and I was like you're doing it wrong man cuz because 12 might be bigger 5-year-olds are all the same size you're not getting a **** 6' tall 5-year-old they're all waist high I like your face playing yeah again if you guys don't know what I'm talking about go watch the",
            "start": 259.04
        },
        {
            "text": "5-year-olds are all the same size you're not getting a 6' tall 5-year-old, they're all waist high. I like your face playing yeah again if you guys don't know what I'm talking about go watch the Doodles it's live right now. How you feeling today? Good, yeah, yeah ready to take on the day good, a lot of stuff happening. You look good, yeah, feeling good, yeah wearing my new \"Rain Man\" shirt, brown man, yeah oh I like that, I want one of those friend Ray, I bought this, he's our special Brown Man. This was an RT don't you can't say that, you can't say he's our special Brown Man all right he's our Brown Man no you can't no see you're it's you're leaving in the phrase I don't think you should say he's our special man there you go better raise our special man because I think out of context if somebody was to clip it out Nick Scarpino and I'm not saying they should but if somebody did clip out saying he's our special Brown Man that wouldn't be good, cool Greg knows that wouldn't be good the.",
            "start": 300.32
        },
        {
            "text": "somebody was to clip it out Nick Scarpino and I'm not saying they should but if somebody did clip out saying he's our Special Guest, Ray \"Brown Man\" that wouldn't be good cool Greg knows that wouldn't be good the inference is that you want people to clip it out I think that's what you're you're saying that I want people to clip you out saying he's our Special Guest, Ray \"Brown Man\" I'm not saying that I think you're saying that I mean I I would only I don't want them to because I'm thinking about how bad it could get the only way the only way it could get worse of them clipping it out is that if they clipped me out of it so then there's no context at all why we're saying Ray Brown Man on Twitch who you should go sub to as well why Nick saying he's our Special Guest, Ray \"Brown Man\" right right if you clip me out of it alt together and you just had a little little thing of Nick saying he's our Special Guest, Ray \"Brown Man\" part of just coming right up to that Cliff uh that is racial humor is just you never know you never know what's",
            "start": 337.72
        },
        {
            "text": "and you just had a little little thing of Nick saying he's our special Brown Man part of just coming right up to that Cliff uh that is racial humor is just you never know you never know what's happen that's part of coming up to the when you Nick Scarpino the comedian Go on stage and you get up to the clip you're like going to happen going to make some race J see where it goes see what happens H we love Ray go support Ray's on Twitch he's probably Twitch streaming right now don't support him yet probably stay an hour no an hour and 30 minutes after Kinda Funny a Games Daily sure sure sure and tell him that we love him and tell him that uh uh well you know what I'll stop right there he's you can go tell Ray he's our he's our special brand you can if you want I think Ray would be fine with that term I mean yeah we're promoting his stuff I mean he put it on his shirt well it's his name you go to twitch.tv/ brownman that's him I didn't know that that's why it says Brown Man",
            "start": 379.84
        },
        {
            "text": "that term I mean yeah we're promoting his stuff I mean he put it on his shirt well it's his name you go to twitch.tv/ brownman that's him I didn't know that that's yeah that's why it says brown man it's not like he doesn't just call himself Brown Man but it's not like related to anything I would if I were Brown I totally would ah cool Greg see if he is up there let's go into the nerdy news you need to know or the nerdy news we want to know or the nerdy news we just like to hang out with uh this is a story from yesterday I think we talked about this a little bit yesterday but I wanted to go into it because I think it's a very fascinating story from our friends over Variety Justice League extensive re-shoot cause headaches for Star schedules Greg have you heard this yet yeah but hold on I'm telling I just popped into Ray's chat to tell him he's our special Brown Man thank you thank you he's streaming Marvel Heroes it's an ad but it doesn't matter I love Marvel Heroes that's fun back to",
            "start": 416.88
        },
        {
            "text": "telling I just popped into Ray's chat to tell him he's our special brown man thank you thank you he's streaming Marvel heroes it's an ad but it doesn't matter I love Marvel heroes that's fun back to Justice League let's go let's get mad everybody get mad Mission impossible everything up go Warner Brothers in DC are spending big money to ensure that Justice League Builds on the success of Wonder Woman which had no comment on the schedule in trouble is spending approximately 25 million on extensive re-shoots that have dragged on for roughly 2 months in London and Los Angeles according to multiple insiders like The Avengers Justice League centers on a group of superheroes who band together to save the world we all know that the ensemble nature of the comic book movie and the fact that it its cast includes several of the most in-demand actors working in Hollywood today is creating scheduling headaches that have prolonged the shooting in Stand it's standard for big",
            "start": 456.84
        },
        {
            "text": "the fact that its cast includes several of the most in-demand actors working in Hollywood today is creating scheduling headaches that have prolonged the shooting in Stand. It's standard for big Hollywood movies to schedule a few uh weeks of pickups, but the cost and time required for the Justice League re-shoot or additional photography, uh, to use the preferred studio nomenclature, traditionally costs between 6 million and 10 million. Rarely do they have to juggle so many competing schedules; they typically last a week or two. Those stars like Ben Affleck and Gal Gadot, who play Batman and Wonder Woman, don't have anything else going on right now, enabling them to be on call for the film. Other cast members, such as Ezra Miller and Henry Cavill, have been scrambling to accommodate the additional photography. Now it goes on to talk about Miller and Fantastic Beasts, but I think the more salient point is that Cav's issues are are",
            "start": 495.0
        },
        {
            "text": "cavalry have been scrambling to accommodate the additional photography now it goes on to talk about Miller and Fantastic Beasts but I think the more salient point is that Cav's issues are even more authoritative Justice League's Man of Steel has had expected to be able to finish shooting the sixth Mission Impossible film before needing to don Superman spandex again that has not been the case however as the new scenes that have been uh shot require him to jump back and forth from each production because of this a mustache he grew for his character in Mission Impossible: sequel will need to be digitally removed in post-production Paramount which chose to shave the facial hair while production was taking place this is what I'm talking about all the time you don't need to talk anymore right now this is what I'm talking about all the time what's wrong with all of these movie people and all these actors and like it's part of a part of the blame is on Warner Brothers in DC again hire",
            "start": 534.48
        },
        {
            "text": "this is what I'm talking about all the time what is wrong with all of these movie people and all these actors and like it's part of a part of the blame is on Warner Brothers in DC again hire these people for a year just make all the superhero movies you want in that year yeah just make give me 17 **** DC movies release them over seventeen years or seven Years will'll be fine I don't care however that aside yeah the problem here now lies with Henry Cavill in the fact that again I'm telling you right now any movie exact or who's watching right now you want to cast me as Superman you get me in the shape and you teach me how to act I will be Superman and nothing else yeah I won't do any that I I will yeah sure I'll sign on for Mission Impossible if that needs to happen and then you're like oh **** you need to shave it hey Mr Mission Impossible Paramount I need to shave my mustache uh sorry you can't all right **** you I quit and I walk out I know where my Bread's buttered",
            "start": 572.64
        },
        {
            "text": "like oh **** you need to shave it hey Mr Mission Impossible Paramount I need to shave my mustache uh sorry you can't all right **** you I quit and I walk out I know where my Bread's buttered and it's buttered with the DC Universe I'm **** Superman not **** weird ass **** mustache British guy in Mission Impossible that no one's ever going to go see I'll tell you one thing that might be a minor flaw in your overarching strategy here there's no guarantee he'll get to be Superman again we know he signed off for two more movies but who the hell knows it's going to go without franchise sure but would don't you rather die for something than live for nothing you know what I mean you want to die for something because you know again you don't understand you're not wrapping your head around it because this is what I've said before I'm Gal Gadot I'm Van Damme I'm Henry Cavill whatever I get the role Superman Wonder Woman Batman whatever and what I do then is I'm like all right cool I make",
            "start": 619.4
        },
        {
            "text": "it because this is what I've said before I'm Gal Gadot I'm Van Affleck I'm Henry Cavill whatever I get the role Superman Wonder Woman Batman whatever and what I do then is I'm like all right cool I make the movies everybody loves me I'm great I'm going to die for it oh they cancel the next movies no big deal what I tell Warner Brothers animation is I want to be the voice actor for Superman and everything and I'll work at cost I'm not I'm not out here trying to I'm not going to ask Injustice to give me 14 million just let me be Superman you know what I mean let me be Superman I want to be Kevin Conroy you tell me Kevin Conroy didn't live for anything you tell me he didn't die for anything I'll tell you one right now Kevin Conroy by the way metaphorically speaking Kevin Conroy wants to grow a beard Kevin Conroy grows a beard exactly cuz Kevin Conroy understands where his bed is made and it's made over there he knows on which side his bread is buttered my friend that is",
            "start": 661.48
        },
        {
            "text": "to grow a beard Kevin Conroy grows a beard exactly cuz Kevin Conroy understands where his bed is made and it's made over there he knows on which side his bread is buttered my friend that is very true you you were right there you knew what I was trying to say but you saw me **** it up I hit a rock with my bike and I was down another Trail it's okay I started the show off by completely **** everything **** cares uh look the fact of matter is this this story is being probably blown out of proportions given that everyone wants to HTE on the DC Universe right now re-shoot are a common thing people were bringing up the fact that Rogue one was largely reshot the third Act was larg it worked out nobody's concerned are are people concerned about the re-shoot I think I think well the story is is uh is it that Jos Weidens in there and he wants more connective tissue isn't that what they were saying yeah I think overall that's what it is but but the fact matter is like I ultimately",
            "start": 703.16
        },
        {
            "text": "Is it that Jos Whedon's in there, and he wants more connective tissue? Isn't that what they were saying? Yeah, I think overall that's what it is. But but the fact matters like I ultimately I think people are saying hey this whole universe is trash. 25 million, you're crazy. This seems to be a big deal - 25 million is a lot of money to do re-shoots, but again not impossible. And the fact that I think that when when a franchise like this is under the microscope, a lot of these stories get blown out of proportion. That's all I'm saying. It's that I think uh the connective tissue idea and from what a little bit of this article hints at is that Wonder Woman was so successful to make it a little bit more like Wonder Woman. And I'd rather and I love Jos Whedon personally, I'd love to see him take that little banter dialogue do those little like moments that actually stand out and make you go oh that's cool they're a real team or whatever they really are connected. I'd rather see him put that in.",
            "start": 740.64
        },
        {
            "text": "that little Barry dialogue do those little like moments that actually stand out and make you go oh that's cool they're a real team or whatever they really are connected I'd rather see him put that in there than not have that me too so I say $2 million small price to pay true Henry Cavill over Paramount and never working with them again small price to pay I think just not a great idea though I gotta be honest with you there's only like four major movie studios in the world that will hire you for that amount of money and Paramount's one of them you really don't want to piss them off also Mission Impossible still a really good high grossing franchise no it isn't remember they did Mission Impossible 2 then they've never done another one and now they're trying to bring it out and they got V and they got Henry Cavill get they're on their could get Tom Cruise back they didn't get Emilio Estevez back John Voight not in it like this sh this sucks you that's a salient point by the way",
            "start": 776.08
        },
        {
            "text": "Greg Miller, Nick Scarpino, and they got Henry Cavill. They're on their could get Tom Cruise back; they didn't get Emilio Estevez back. John Voight's not in it like this sucks. You know that's a salient point by the way. Where's shout out to Eli Roth? Where's Emilio man? Did he get I know that he got stabbed in the face, but he could have survived. That did you ever watch the Emilio Estevez Martin Sheen movie that they put out recently? That was up for like it was like an award about the didn't they do one about the Mitchell Brothers Behind the Green Door? I think it was an indie film where Emilo Esz had gone off and he was a hiker, and he died. And then Martin Sheen went and tried to follow that's right. I'm sorry you said Martin Sheen not Charlie Sheen. Sorry Mar Amil EST and Charlie Sheen did a couple great movies together. The trash man one they did Men at Work which is at the time I was on my top five all-time comedies because of Keith David, Keith David is a",
            "start": 812.6
        },
        {
            "text": "EST and Charlie Sheen did a couple of great movies together, The Trash Man One. They did Men at Work, which is still on my all-time top five comedies because of Keith David. Keith David is a **** (Kei) David, voice of Spawn. Uh, yeah, I know who he is. Yeah, he does the Marines. Yeah, he was the one that like got put in with them as the Trash Man to make sure they weren't messing with people, and like I remember Amos (or Ames) goes to grab a fry, he's like smacks his hand, he's like \"Never grab another man's fries,\" and Charlie Sheen turns around, he's like \"What the ****?\" Anyway, maybe it was funny when I was a kid. Uh, no, I think that was actually really good. Amil (or Ames) IEST directed that movie you're talking about, and he directed his father, which was cool. Yeah, so I never saw it though. Never saw it. I started into it wasn't great. Was that great? Yeah, it was like a uh what's his name... Uh Robert Redford did that one where he was on a boat the entire time and doesn't talk, and I'm like \"I don't need to\"",
            "start": 854.84
        },
        {
            "text": "started into it wasn't a great was that great yeah it was like a uh what's his name uh Robert Redford did that one where he was on a boat the entire time and doesn't talk and I'm like I don't need to watch this I'm good yeah because we saw him in Captain America so that was great yeah he was great clearly that's that's my that's my Robert Redford quote for the year next story o this one's got me all hot and bothered James Bond 25 gets a 2019 release date not much here just saying the 25th film about the Legendary Super Spy will hit theaters November 8th 2019 there's no word yet on whether or not Daniel Craig will be asking for his Martini shaking the company said the additional details regarding the film's distribution including International lease State it's cast and director it will be announced at a later date however some insiders believe that there is a good chance Craig will return for at least one more outing as this is the whole deal right that he he got in hot water with",
            "start": 894.6
        },
        {
            "text": "announced at a later date however some insiders believe that there is a good chance Craig will return for at least one more outing as this is the whole deal right that he he got in hot water with the last uh James Bond because he was all like I'd rather be shot in the face and do it again he was on a promotional tour he was very tired yeah and he said it was taken I believe out of context or else he I guess he misspoke but what he meant was I'd rather I think he said I'd rather slip my wrists than than do another Bond film at this time cuz he was very tired he just come off of doing and then his his agent was like hey they're going to pay you a lot of money to do the next one get some sleep and reconsider and then like a week later he was like you know what I think it's cool but there's a followup to this story Greg do it because I'm going to try to find something interesting I saw on Reddit last go for it if you uh cool Greg can you bring up the next link the IGN article says",
            "start": 934.0
        },
        {
            "text": "a followup to this story Greg did it because I'm going to try to find something interesting I saw on Reddit last go for it if you uh cool Greg can you bring up the next link The IGN article says James Bond 25 Daniel Craig's return reportedly a done deal who there you go this is from Alex over there said Dan Craig is reporting on is reportedly on board to star as 007 in James Bond 25 uh as reported by The New York Times Two informed individuals who wish to remain anonymous said the actor's return is a done deal adding weight to prior reports that producer Barbara Broccoli recently secured Craig and is now working to get Adele to sing the film's theme song yeah they're trying to very desperately recreate the magic that was Skyfall uh because Skyfall I believe was the highest grossing Bond of all time uh not to be confused with Spectre that I think took a little bit of a dip I love Adele I love Daniel Craig but I want my my problem with Dan Craig is that he doesn't really want to do",
            "start": 972.48
        },
        {
            "text": "of all time uh not to be confused with Spectre that I think took a little bit of a dip I love Adele I love Daniel Craig but I want my my problem with Dan Craig is that he doesn't really want to do the role anymore and it shows so this is my issue I'm like let someone else do the freaking role man recast it it's fine it's not going to be a big deal having said that I do wonder what they're going to call it and I do love when they have like it's a big thing for me when they announce the name sure you and four other people James Bond is dead and they need to stop making these movies all the money they're putting into these put them into comic book movies hire all these actors for one year make all make just make a universe in one foul swoop it's easy if only we could have a comic book movie every like two months wouldn't that be an that would be awesome I'm sick of them being maybe we get two a year like four this year uh **** Justice League I'm waiting till November over here I'm still",
            "start": 1012.48
        },
        {
            "text": "like two months wouldn't that be an awesome one, that would be awesome, I'm sick of them being maybe we get two a year like four this year uh Justice League, I'm waiting till November over here, I'm St. Elsewhere's woman, good ones, I'm talking about the good ones, I'm sure I'm forgetting some in there somewhere, there's Guardians 2 is this year too right, yeah that's right, that's five, yeah that's literally almost one every two months, here's what I'm saying though, is like I think if anything, if we're going to be honest here, we're being honest, we're in the trust here, what we need to do is slow the roll on the Star Wars movies and make those go every other year and then use the Star Wars movie slot to put another comic book movie in because that's what we all want, I'm sick of waiting so long, these people speaking for all of us, on behalf of Kinda Funny, stop James Bond movies, stop Star Wars movies, make more DC",
            "start": 1047.08
        },
        {
            "text": "in because that's what we all want I'm sick of waiting so long these people speaking for all of us on behalf of Kinda Funny stop James Bond movies stop Star Wars movies make more DC movies thank you for representation of the kind of the official Kinda Funny opinion I would like that out and then but in between it I want him Nick saying he's our special brown man my statement for Kinda Funny he's our special brown man that's what I want okay well there's that what I was looking for is something I saw on Reddit last night one of the mods they put out there or whatever and what it was was a quote from Sir Michael Caine yeah is he sir I dropped I don't think he is but that's Michael Caine of course Alfred from two really good Batman films um he was talking about you were talking about James Bond Daniel Craig the money they'll dump on him right uh this is a quote from Michael Caine about Jaws: The Revenge remember when he was in Jaws: The Revenge yeah and it was terrible",
            "start": 1087.36
        },
        {
            "text": "talking about James Bond Daniel Craig the money they'll dump on him right uh this is a quote from Michael Caine about Jaws: The Revenge remember when he was in Jaws: The Revenge yeah and it was terrible yeah it was bad that was 3D was it 3D no was not 3D uh here Michael Caine talks about being I apologize stop rewind it is Sir Michael Caine he has been he has been knighted by the Queen of Buckingham breaking news congratulations the Queen of Buckingham no sorry Buckingham Palace on Thursday as Sir Michael White I guess that's his real name uh and this is a story as of breaking news November 16th 2000 so that happened the r Michael Caine was in his quote about it was I have never seen it but by all accounts it is terrible however I have seen the house that it built and it is terrific that is amazing that is amazing breaking news from the Queen of Buckingham the the Queen of Buckingham the Queen of Buckingham Palace is actually that's what they call her when she's walking on the",
            "start": 1133.32
        },
        {
            "text": "that is amazing breaking news from the Queen of Buckingham, the Queen of Buckingham Palace is actually that's what they call her when she's walking on the halls, they're like \"What's up, Queen?\" about Buckingham house I let you of course I have some more Kinda Funny Games Daily that's a show coming up next with Andrew Renee so I let you handle the morning show. Reigns assembling the news stories very excited for this next story which is titled \"Be Inside Harry Potter\" Nick Shands the title's this one's called \"Be Inside\" gets people super excited, this comes from the LA Times says find yourself in Game of Thrones Westeros or Hogwarts with Hollywood's new projection technology, Potter is now I put the story snakes snakes snakes where does your brain go I'm singing the Harry Potter song started the instrumental Harry Potter song and then I put in the Harry Potter lyrics here's what I imagine uh happens right is the whole time you're walking around normally",
            "start": 1186.36
        },
        {
            "text": "the Harry Potter song started the instrumental Harry Potter song and then I put in the Harry Potter lyrics here's what I imagine uh happens right is the whole time you're walking around normal society your brain's in this little cell it's in this little box that you have to put it in right and then sometimes when you do the podcast the door opens and you just you just your brain just goes out tentacle porn dudes right in the mouth and the ass at the same time at an Afterparty for the red carpet premiere of the seventh season of Game of Thrones at Walt Disney Concert Hall partygoers watched as Westeros came to life on a building before them and I see Visage of uh Night King loomed over a farewell Dragon Sword across the Halls sweeping arched facade breathing Flames that appeared to envelop an iconic structure uh not much here it's just really cool they can do this and of course they they um they went they went over to Hogwarts at some point too sure but that's all there is I",
            "start": 1246.36
        },
        {
            "text": "to envelop an iconic structure, uh, not much here, it's just really cool they can do this, and of course, they they um they went they went over to Hogwarts at some point too, sure, but that's all there is. I just thought this was a **cool** story so that's for cool Greg, thanks, you're welcome. Hogwarts, Hogwarts, Hogwarts, uh, this is a fun story if anyone still cares about Matt Groening and The Simpsons do you still care about Gra? Is it graining? I that's how you pronounce it, I always thought it was groaning, no, I don't care. Loved him for the first nine 10 seasons then just had to stop and then they continued well this is from no judgment if you like them that's fine with you. This is from James Whitbrook over at IGN says the man who brought us The Simpsons is heading to Netflix for a new animated series called Disenchantment, and it already sounds like it's going to do what fantasy did to Fantasy, what Futurama did to sci-fi, announced this morning the streaming service Disenchantment takes viewers to",
            "start": 1290.24
        },
        {
            "text": "called Disenchantment and it already sounds like it's going to do what fantasy did to Fantasy, what Futurama did to sci-fi. Announced this morning the streaming service Disenchantment takes viewers to the kingdom of Dreamland, which is slowly falling apart into rampant disarray as its hard-drinking young princess, voiced by Abbi Jacobson, goes on a series of misadventures with an elf named Elfo and her own personal demon, Luci Eric Andre. It's quoted about life and death, love and sex stuff, and how to keep laughing in a world full of suffering and idiots despite what the elders and wizards and other jerks tell you. That's weird; oddly reminiscent of what's happening in today's world. Oh end quote as he himself is quoted in a provided press release. So yeah, it definitely feels like Futurama and how it's going to lovingly poke fun at genre tropes. I'll give it a shot. Sure, you will? You'll give anything a shot. You know I'm currently working my way through all nine seasons of",
            "start": 1332.0
        },
        {
            "text": "Arma and how it's going to lovingly poke fun at genre tropes I I'll give it a shot sure you will you'll give anything a shot you know I'm currently working my way through uh all nine seasons of Overhaul on the Velocity channel so I feel like I can take a little break of that watching hell yeah I am although recently I have been kicking around on the idea of going back and watching all the seasons of Psych in preparation of course for the Psych movie coming out this holiday season and I say you know what I'm going to say movies because I'm hopeful that they just keep releasing one every year and then bring the show back Goa cuz we all know that James Roday is a pivotal character on One Day at a Time right yeah he plays the front of the house guy, Mr. or something or other he runs the Miami Dolphins right he runs I haven't watched the season yet I don't know it's only one episode it's cut Charles so I don't know what happened what happened I don't know what's happened it's unfortunate",
            "start": 1378.12
        },
        {
            "text": "Dolphins right, he runs. I haven't watched the season yet, I don't know it's only one episode, it's cut short so I don't know what happened. What happened? I don't know what's happened. It's unfortunate but you better watch to find out, sir. But he gave him a job didn't he after no, Charles works for him now. Yeah, exactly. Charles works in front of the house. He cut him as a player but now they're firing other people and Charles does know if he's on shaky ground or not. Oh right, he had to go fire people that was the problem that was the problem. So people are like \"Ballers\" you know, oh it's so good but I'm just saying Maggie Lawson, James Roday get them all back together. It can't possibly take longer than five six days to shoot the Psych movie, just let let just shoot five seconds, just do what I'm saying, just do it for Nick, what I'm saying, do it for the superheroes. Get these guys lock them into a year contract and just make a million Psych Psych movies yeah why not it's easy I mean he",
            "start": 1420.12
        },
        {
            "text": "I'm saying just do it for Nick what I'm saying do for the superheroes get this these guys lock them into a year contract and just make a million psych psych movies yeah why not it's easy I mean he wouldn't even need a year for million psych movies I'm I'm telling you one month you can knock out 15 16 psych movies have you written a spec script yet for a psych movie cuz I'll write one at lunch thank they're so good I'll just I mean literally I have all the 80s references in my brain right now I'll just go back and watch Stranger Things season one and just take all those steal all those jokes okay why not uh I don't know if I want to read this story or not this is an old story I flash it for one second I just wonder if we're not Andy Circus's Jungle Book you ha Andy Circus so wanted to put out there that you still hate Andy Circus he's you know we'll read this a little bit I didn't want that I was just saying we flash you ha this is an older story this is from the 22nd uh but it says",
            "start": 1452.16
        },
        {
            "text": "Andy Circus → Andy Serkis\nJohn fose → John Favreau\nAndy Cirus book differs from John Fosse → Andy Serkis' film, Jungle Book Origins, differs from John Favreau's adaptation of the classic novel\nBenedict cumberbach → Benedict Cumberbatch\nShir Khan → Shere Khan\nbeira → Baloo\nK → Kaa\nNisha → Raksha\n\nout there that you still hate Andy Serkis he's you know we'll read this a little bit I didn't want that I was just saying we flash you ha this is an older story this is from the 22nd uh but it says Andy Serkis' book differs from John Favreau uh Andy Serkis says his Jungle Book Origins I already don't like it film is more uh genuine is a more genuine adaptation of the classic novel and was shot using motion capture a combination of bad timing and a bit of bad luck have the circus helmed film following the hugely successful Disney version that was released in 2016 God it was already was I guess it was last year loaded with an All-Star cast itself in addition to directing circus will star as Baloo alongside Benedict Cumberbatch as Shere Khan Christian Bale as Baloo Kate Blanchett as Kaa and Naomi Harris as Raksha who the **** cares this much about Jungle Book that we need Origins I I don't know I don't know uh there's more to the story but you know I don't even bother reading it stop making make",
            "start": 1487.44
        },
        {
            "text": "as Nisha who the heck cares this much about The Jungle Book that we need Origins I I don't know I don't know uh there's more to the story but you know I don't even bother reading it stop making make more comic book movies this reminds me of the uh the era when I I believe in like the late '80s early 90s when every time a studio would make a movie a genre movie another Studio would immediately make that movie like Wyatt Earp versus Tombstone Tombstone's so **** good but kept doing that this is annoying this is annoying coolg this bro's already moved on bro he's doing lying draft letter cool I'm going to dictate a letter to you dear Hollywood TI ey y Greg Miller from Kinda Funny once again speaking on behalf of the company yeah we have the following demands that will not end in the dead Rock in per se but I'm just saying wink wink Dead Rising has to do with this no the Dead Ring from Grave got it **** let's get tip all right all right let's read some tips",
            "start": 1531.32
        },
        {
            "text": "\"Dead Rising has to do with this, no, the Dead Rising. Oh, the Dead Ringer from Grave got it. Let's get tips all right, all right. Let's read some tips, guys. Thanks so much. We have two tips for today. Still Live Gaming is giving us a very nice generous tip. Is we just wanted to tell you guys how awesome you all are. Like I said on my last tip, I'm on dialysis sessions are long and boring but you guys help me pass the time with all of your amazing content. Love you guys, keep on keeping on. My friend, dialysis, I can only imagine sucks. While you're out there, uh, we're thinking of you. You're thinking of us. Okay, think of Greg shirtless if you want. If that helps you. If not, if that makes you want to throw up more, just don't do it. Um, Shotgun McPain is giving us a tip. Says hey guys, just wanted to say thank you for helping me through the day. My great grandma's back in the hospital, not doing well and I also just found out her cat is dying.\"",
            "start": 1584.76
        },
        {
            "text": "is giving us a tip says hey guys just wanted to say thank you for helping me through the day my great grandma's back in the hospital not doing well and I also just found out her cat is dying and we need to have it put down, that's going to be tough, I'm sorry about that. Jeez, people out there struggling, man, they're doing their best, man, they're doing their best. We're here for you guys, we appreciate that. Uh, that's all the tips for now. Um, I believe we have a giveaway. Well, we have, we have, we have something before that giveaway. Oh, do we? We got to give back to the community. We got to give back, people give us so much, we like to give back and they like we like to give them an opportunity to give to each other. Yeah, if you want to take what you got and give it to someone else, you can go to kinda funny.com/bestfriends and nominate someone for a little section we like to call PS I Love This best friend xoxo, it's your opportunity to shout out someone in the community who's doing an awesome job or",
            "start": 1630.2
        },
        {
            "text": "best friends and nominate someone for a little section we like to call \"PS I Love This\" best friend xoxo it's your opportunity to shout out someone in the community who's doing an awesome job or inspiring to you or just is just a general cool person just like Mike Fen did he's shouting out the infamous Blessing Ado Jr, aka Bless, an extremely active and positive member of the community. You may know him from being the only baby on the admin team for the Kinda Funny Facebook group, but for those that didn't know, Bless also co-hosts the OK Beast podcast and helps run the OK Beast website. Recently, he also put together a video for the Kinda Funny Community to help brighten the spirits of Ryan McCaffrey after losing his dog. He's the real homie, well awesome good kid, good kid, he's all up in everything, he's in the comments, he's on Twitter how would you say this last name? I say Blessing Jor, I know",
            "start": 1667.84
        },
        {
            "text": "after losing his dog he's the real homie well awesome good kid good kid he's all up in everything he's in the comments he's on Twitter how would you say this last name I say blessing Jor I know blessing junor let's just say blessing Jun now your last name sir Ado Ado that's cool I I don't think that's right a d o I do that thing where I say it then I just run away from it real quick make sure that blessing J our friend blessing junor yeah it's I I I tried to do that um but it did not remember if you want to nominate a best friend for recognition in the community go to kindafunny.com/bestfriend you can do it right there it's super simple fantastic great Greg yeah let giveaway time if you didn't know ladies and gentlemen each and every day here on twitch.tv/kindafunnygames we give away a video game see I did the same thing but I think there's there's a name below it I don't know if that was from I don't know if that was I I don't know how to put together the show anymore so I can't",
            "start": 1712.48
        },
        {
            "text": "a video game see I did the same thing but I think there's there's a name below it I don't know if that was from I don't know if that was I I don't know how to put together the show anymore so I can't even check gotcha but Kevin we give away a video game each and every day how do you win it's simple be in the chat like so many of you are right now but if you want three other ways to win or ways to win if you're not actually watching live it's easy number one subscribe to us on Twitch if you subscribe to us here on Twitch you get the KindaFunny logo next to your name cool emotes private chat time with us you get to play multiplayer games with us when we play multiplayer games like do you get the show ad free unless I bake them in we're going to bake one in right after this of course um if you have Amazon Prime you have Twitch Prime that's a free sub you need to go give away each and every month they reset after a month so you have to give it away even if you're not give it",
            "start": 1765.68
        },
        {
            "text": "have Amazon Prime you have Twitch Prime that's a free sub you need to go give away each and every month they reset after a month so you have to give it away even if you're not give it to us give it to somebody maybe Nick's special brown man what why does he have to be mine when he does something bad why is he my special brown man and when we love him he's our special brown man if you want two other ways to support us and to get entered to win step go to Patreon.com KindaFunny or Patreon.com OfunGames where at the $2 level or above you are automatically entered to win each and everything we give away here today we're giving away Story of Seasons on the 3DS but first this giveaway is brought to you by the Dollar Shave Club you can get a great shave at a great price conveniently delivered right to your door no longer you have to go to the store and wait for all these razor sales people to walk up and give you advice and they say what do you want with this you know they'll send them to",
            "start": 1804.52
        },
        {
            "text": "right to your door no longer you have to go to the store and wait for all these razor sales people to walk up and give you advice and they say what do you want with this you know they'll send them to your door at a cheap affordable price how do I know this Tim gets them delivered Tim got a beard he gets everything delivered he's been chasing your beard for a while but he's stepping up his beard game by shaving with the Dollar Shave Club razors and getting that nice tight he gets it nice and tight you're all shaggy up here you could use the Dollar Shave Club I could right here too you got you got the St no I got it down here I use it here I don't like to shave here because it looks too clean I like to be a little dirty we should why did you wink at the camera when you said that and stick your tongue out why is your tongue still out this is this is that's not good at all how much do we have to get donated or subscribed or whatever milestone what milestone do we have to hit for you to lean",
            "start": 1844.72
        },
        {
            "text": "\"Tongue out, why is your tongue still out? This is, this is that's not good at all. How much do we have to get donated or subscribed or whatever milestone what milestone do we have to hit for you to lean back and let me straight razor or do the Dollar Shave Club shave or raise on your neck? I will never allow you to take a razor to my neck. I trust you implicitly with my life, but not my beard, sir, not my beard. All right, for a limited time, new members get their first month of the Ex Executive Razor with a tube of Dr. Carver's Shave Butter for only $5 with free shipping. After that, razors are just a few bucks a month. That's a $15 value for just $5 in your first month box you'll get the awesome Wy handle, a full case of four cartridges and a tube of their shave butter. After that, you can just get the cartridges ship automatically. You have to worry about it. There are no hidden fees and no commitments. Cancel anytime you like. You can get this offer exclusively at\"",
            "start": 1877.04
        },
        {
            "text": "after that you can just get the cartridges shipped automatically, you have to worry about it, there are no hidden fees and no commitments, cancel anytime you like, you can get this offer exclusively at DollarShaveClub.com Morning. That's DollarShaveClub.com Morning. Story of Seasons on the 3DS is going to someone in the Twitch chat lie 48, it might be a sub Kevin didn't update it properly but Live 48 has won it doesn't matter either way, Live 48, it's a Twitch person who's all that matters fair enough Kevin will I assume message you here moment I guess I could too. Live 48 congratulations you won don't worry about it don't start **** with me cool Greg yeah you damn right you lean back I love cool gr story of Seasons a quirky little game a quirky little have you played Story of Seasons not no idea what it is okay was it a Twitch chat member or Twitch sub Twitch chat member has won Live 48 thanks for watching live let's jump in for the patented three and three three and three",
            "start": 1916.76
        },
        {
            "text": "not no idea what it is okay was it a Twitch chat member or Twitch sub, Twitch chat member has won live 48 thanks for watching live let's jump in for the patented three and three, three and three we're to do three questions from the chat and then three questions from the subs then we're going to get start getting ready we're probably going to hang out we're GES well you got you got you got a lot of podcast today Adam guest 1985 says I want to see Greg and Nick do Sweeney Todd Al Affleck and Jersey girl that's a lot of references that I don't understand did you watch Jersey Girl no okay I watch Sweeney Todd no okay I haven't watched Sweeney Todd either but I watched Jersey girl in Jersey girl yeah they have to do like a scene from a musical for this stupid like school talent show or whatever like it's like the parents and the kid and they do Sweeney Todd and and the girl picks Sweeney Todd now was was was am I crazy or was Kevin Smith in Jersey girl it's his movie he directed",
            "start": 1968.12
        },
        {
            "text": "like it's like the parents and the kid and they do Sweeney Todd and and the girl picks Sweeney Todd now was was was am I crazy or was Kevin Smith in Jersey Girl? It's his movie, he directed it, but wasn't he in it? Wasn't he like the uncle, the weird Uncle? No, was Carlin George Carlin was the grandfather. Yeah, I think maybe Ethan Em... no, Ethan Embry was in that, he played the uncle of the kid, that like there was that Jennifer Garner movie he was in, that might be the one that I'm thinking of, chat let me know which one Kevin, I just remember the scene of Kevin Smith like fishing with a kid. I might have dreamed about it, it might have been the kid that Greg and I kidnapped the other day. Wait, we're going to raise him to be ours, buddy. She's going to be our special brown man, she's whoa you missed this whole thing Kevin, I'm wearing a shirt, this is Brown Man so we can throw that around watching uh ke here says my favorite country is Venezuela awesome thank you for that there might be a venezuel",
            "start": 2011.24
        },
        {
            "text": "this whole thing Kevin I'm wearing a shirt this is brown man so we can throw that around watching uh ke here says my favorite country is Venezuela awesome thank you for that there might be a venezuelan reference drunk kind of funny kind of funny game daily here in a little bit drunken hope says Greg when do you make your wrestling debut as Greg the Massacre Miller he he he pants for the win I don't know what that means he pants for the win hot pants for the win sorry no I'm catch and release is that what the name of the movie was that sounds very familiar it's the Jennifer Garner one we're going to look that up right now we're looking that up right now movie I my God this movie looks terrible what is this movie yes the Jennifer Garner one yeah and then they have to like adopt the kid or some **** like that and Kevin Smith plays Sam and he's just cool I'm go back and watch this movie tonight if I can find it I think it's going to be good I don't think it will be and I don't think you need to",
            "start": 2053.04
        },
        {
            "text": "like that and Kevin Smith plays Sam and he's just cool I'm going back and watch this movie tonight if I can find it I think it's going to be good I don't think it will be and I don't think you need to do that I don't think you know how uh terrible my taste of movies is I'm well aware D home Here's the deal here's the deal I don't have terrible Taste of movies I have broad Taste of movies what is and is not acceptable entertaining to me is here most people operate in this little space right here yeah but you're out there good bad this is is good bad mine is I got I'm I'm a wide spectrum man I'm like a film cam I got latitude when it comes to that I'm a wide gamut kind of guy okay there a lot of film terms I just threw out there you like to play the entertainment industry spread eagle I like to be spread eagle you like to just get with a spreader bar Dark Knight says what are your opinions on the Han Solo Star movie I'm kind of me about it Don lover man I'm kind of mad about everything",
            "start": 2100.76
        },
        {
            "text": "be spread eagle you like to just get with a spreader bar The Dark Knight Rises says what are your opinions on the Han Solo Star Wars movie I'm kind of me about it Don lover man I'm kind of mad about everything until I see a preview for it and then I'm all in so we'll see what happens we'll see how it looks I mean it doesn't all the stories that have come out about it so far don't give me hope but hopefully uh with Ron Howard coming on I can get a new hope big old A New Hope A New Hope For Old op for old op oh my God this show is a nightmare let's go into subscriber only mode kingdom or King franchise 88 says you all heard it Nick and M's tastes are terrible it's about time it's about time I didn't say terrible I said wide I have a wide I have a gaping hole of tastes is what I have today and always we're in sub mode actually did it for once like for real now Rudy o87 says there should be a weekly Movie Club like Greg Greg and Tim have the weekly Comic Club I agree I agree a weekly Movie",
            "start": 2142.36
        },
        {
            "text": "we're in submode actually did it for once like for real now Rudy O7 says there should be a weekly Movie Club like Greg and Tim have the weekly Comic Club I agree I agree a weekly Movie Club yeah sure sure fit that into our schedule somewhere you watch a movie every night we talk about we usually talk about it on Monday like what we watched over the weekend it's kind of a Monday thing we do but on Friday do you say hey everybody here's what we're going to watch over the weekend I can't commit to that okay yeah I got to watch should everybody watch Catch and Release and then next Tuesday we'll talk about it yes the first required viewing has been announced everyone we are all watching catch and release this week next week on Tuesday will be the Catch and Release review I'll put that in the put that on TT there it is movie Monday says the Steve uh Ryan Santelli says hey Nick if you thought about doing intermittent intermittent fasting with your keto diet I have I need to",
            "start": 2190.56
        },
        {
            "text": "that in the podcast it is Movie Monday says the Steve uh Ryan Reynolds says hey Nick if you thought about doing intermittent intermittent fasting with your keto diet I have I need to research it more cuz I want to do it right um I've hit a little bit of a plateau in the last couple weeks so I got to I got to figure out how to push through that I always hit this plate around 185 and I want to push through that so I can get into the 170s for once in my life uh J2 Jarvis says Nick's open to watch any movie quit hating yeah guys come on seriously why you why you hating on bad movies that should be comic book movies you know that's true uh Brian Regan says Nick put these five comics in order from best to worst Carlin oh comics me comedians yeah uh Carlin prior Hicks Chappelle CK that's hard that's hard I mean I would probably say prior Hicks Carlin Chappelle CK I've put out the Tweet prior and what I would like to do is retweet it",
            "start": 2234.48
        },
        {
            "text": "Chappelle CK that's hard that's hard I mean I would probably say prior Hicks Carlin Chappelle CK I've put out the Tweet prior and what I would like to do **** the Tweet is out saying that required viewings first movie club pick Catch and Release what I want to do is compliment the internet on the fact that there was indeed in the Twitter gift finder a catch and release gift from the movie featuring Kevin Smith very excited it's out we're gonna watch this together and then we're gonna watch Daddy's Home again I'm gon I'm gonna Point At You every SC why aren't you laughing at this part where talk for extra life one of the things should be if we hit whatever stupid amount of money that you and me you force me to rewatch Daddy's Home and we do a commentary track for it all right I love it I love it yes Richard Pryor died in 2005 some unfortunately did you know did you know that did you hear that **** Michael Keaton got knighted though awesome for him right awesome news for him I know it happened",
            "start": 2287.12
        },
        {
            "text": "it yes Richard Pryor died in 2005, some unfortunately did. You know, did you know that, did you hear that... Michael Keaton got knighted though? Awesome for him, right, awesome news for him. I know it happened 17 years ago, but uh, that was the joke. Thank you for that, thank you for that. We'll take one more comment and then we'll wrap this up. Prior over Carlin says RebelBot games. Um, yeah, I got to say because I think Pryor did more for forward comedy, but I mean are you doing... yeah, what are you doing though? Are you doing like who's got the more historical significance or what you enjoy, bro? Like changed it, bro, like changed it says Kevin, bro, like changed it. I mean they all did, I mean the thing is you can't... you can't, I mean you can take both of them, they're both icons of the sport so to speak. So to speak, I don't know, I mean again I don't know that much about Carlin do you consider the side of the car an athlete? Is that what you call it? You ever performed on stage, no, you ever gotten up on a stage in a one-man show",
            "start": 2336.84
        },
        {
            "text": "don't know I mean again I don't know that much about cars. Do you consider the side of the car an athlete? Is that what you call it? You ever performed on stage, no. You ever gotten up on a stage in a one-man costume and put your dick really close to Bruce's dick? Cuz I'm pretty sure you have a friend. I actually was out of the costume when I did that. Were you sweating when our heads touched? How hard was it to climb that table 57 times? You did that, come on, you kidding me? I got house want do you want to see me go straight from this? Give me your latte. Nobody wants to see that. Oh my God, he's going to snap not do this, that will break the table. I would also hit my hand on this and kill myself. There's so many things you'll fall over and break the LED. I'm just going to do one up. Please don't do this, just don't. I could do it. Oh, I dare you. The problem is this is not weighted. If you were on this, it would flip over and put your head righteously. Do it on this side, thank you both how",
            "start": 2379.24
        },
        {
            "text": "do this just don't I could do it oh I dare you the problem is this is not weighted if you the second you on this it would flip over and put your head righteously do it on this side thank we both how great would it be if we did it though we both took off the corners you know what I mean just just crash the F go straight down to the comic book shop that's what I'm saying no we wouldn't go to the comic book shop I think technically we'd go right into the the is the comic book shop directly below us or is it the barber shop no it's the empty spot that's over here where's the barber shop no one's above it that's cool for them are yeah God the comic the comic book people must hate us they love us we bring them free food all the time I almost went down there and bought Comics last night but I was a little too drunk cool gave him a uh hung to cool Greg gave him that giant Zelda thing that was shipped to us and they're like we got to give this back we don't yeah like we can't we can't keep",
            "start": 2424.2
        },
        {
            "text": "was a little too drunk cool gave him a uh hung to cool Greg gave him that giant Zelda thing that was shipped to us and they're like we got to give this back we don't yeah like we can't we can't keep this down here it's too **** big and we're like it's yours now bye we just ran away they're like ding ding donging the whole day yeah right um Mr. Yas man 300 says Nick did you see the trailer for Daddy Home Too I have not but I feel like we should watch it right now I really do feel like we should watch it right now we'll watch it afterward uh that'll Let's do let's watch it it's it's 11:42 I mean we're actually on time for once I know but let's watch let's pop in the Daddy's Home Two trailer watch that together let me find it for you this will be the thing that kicks off YouTube though right should we end the morning show proper and then we'll watch it watch it with the chat then you read your subs I'll get ready for GamesDaily is that sound right Kevin sounds great",
            "start": 2464.64
        },
        {
            "text": "though right should we end the morning show proper and then we'll watch it watch it with the chat then you read your subs I'll get ready for Games Daily is that sound right Greg sounds great Perfect all right then ladies and gentlemen guess what this has been the Kinda Funny Morning Show for Tuesday, July 25th, 2017 thank you so much for watching if you're still live with us right now uh we'll end this we're going to watch Daddy's Home trailer 2 Daddy's Home 2 trailer react together with it and then Nick we'll read all the subs uh the remaining tips uh all the people who jumped in to help us remember if you could sub or tip it helps us out a lot please do remember if you have Amazon Prime you have Twitch Prime that's a free subscription you can give away remember there's Patreons there's all this different stuff but most importantly remember that right after all this I'll be back with Kinda Funny Games Daily so there's another show to watch and all this is available on",
            "start": 2502.76
        },
        {
            "text": "there's all this different stuff but most importantly remember that right after all this I'll be back with Kinda Funny Games Daily so there's another show to watch and all this is available on the YouTube channels and podcast services around the globe please subscribe to the channels rate the podcasts even if you're just somebody watching on Twitch right now if you don't mind taking two seconds out of your day to go over there and do it be great all right uh cool Greg I put the Daddy's Home 2 trailer or what I think it is in the uh link right at the bottom of the document there um oh remember that yes required viewing for next week is Catch and Release Catch and Release ladies and gentlemen until next time it's been our pleasure to serve you",
            "start": 2540.2
        }
    ]
}