{
    "id": 2865,
    "video_id": "g3QGj13R2q8",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Peter Brown"
    ],
    "title": "Every Game We Are Gonna Play This Year - Kinda Funny Gamescast Ep. 129",
    "description": "Gamespot's Peter Brown joins us to discuss all the games we are gonna play for the rest of the year. (Released first to Patreon Supporters on 07.28.17)\n\nThanks to MVMT Watches for sponsoring this episode. Go to MVMT.com/Kinda\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1501516804,
    "duration": 5351,
    "transcript_chunks": [
        {
            "text": "you guys know Movement, they reinvented the watch business by selling direct to you with over 1 million watches sold today, well they did it again except this time with sunglasses. They were tired of having to pay for cheaply made throwaway shades, overpriced designer sunglasses which sometimes can cost just so much money, so they're like \"you know what we'll make our own\" starting at just $70. So here's the deal I got these, they're black, they look a lot like the glasses that you know Big C dog, big Nick Scarfo. Weare um, you can get them for risk-free with free shipping and free returns, it's a pretty good deal if you do ask if I say so myself. I also got GSM, she's walking around looking all stylish and stuff, so good for her. I'm really happy with that uh Movement sunglasses started just $70 with the option to upgrade to polarized, most designer brands cost hundreds. Mov figured out that by selling online they could you know I already said this, you can cut out the middleman we can",
            "start": 0.09
        },
        {
            "text": "$70 with the option to upgrade to polarized most designer brands cost hundreds. I figured out that by selling online, they could cut out the middleman; we can cut out the markup. It's a great time for everybody involved. These are high-quality pre-premium acetate frames. Kevin is that how you say that word, acetate frames? No cheap plastic here. They have plenty of styles to choose from: this classic, trendy round Aviator mirrored polarized; for him, for her; you'll be sure to find the perfect pair. Get 50% off today with free shipping and free returns by going to MVMT.com/Kinda. That's MVMT.com/Kinda. Do it. Movement. Join the movement. Join the movement. What's up guys? Welcome to the first ever episode 129 of the Kinda Funny Gamescast, as always I'm Tim Gettys joined by one of the coolest dudes in video games Greg Miller. Cool Greg, yeah it's lit; it's lit. And joining us for the first time on this show is GameSpot's Peter Brown. For me, yeah it's all for you. Wow.",
            "start": 46.6
        },
        {
            "text": "joined by one of the coolest dudes in video games Greg Miller cool Greg yeah it's lit it's lit and joining us for the first time on this show GameSpot's Peter Brown, for me yeah it's all for you wow for a second and be like GameSpot oh I know I do we're doing that GameStop Expo soon it's going to I feel like every time we lead up to E3 or the GameStop Expo I I have to do a couple days of like PR spot GameSpot GameSpot GameSpot just rolls off the back now I'm used to it yeah no I know yeah I'm sure it's got you a few times how how's GameSpot doing great I don't know we're having good we're having a lot of fun a lot of new faces working in the office and uh yeah I feel like I'm the old man there now I've been there almost six years so I'm just kind of you know filling that role I guess for those that don't know what do you do over at GameSpot oh uh I run reviews over at GameSpot so every review that comes through us I edit it and I write a bunch myself like what what you",
            "start": 105.2
        },
        {
            "text": "that role I guess for those that don't know what do you do over oh uh I run reviews over at GameSpot so every review that comes through us I edit it and I write a bunch myself like what what you written oh oh Crash Bandicoot you gave probably like what like a 9 point no n like a six okay and then there was um Friday the 13th ladies and gentlemen of the jury what I present to you is Friday the 13th an early Contender for Game of the Year and this is the audacity to give it a 4.0 a four out of 10 sir what do you have to say for yourself that is two whole numbers less than Crash Bandicoot exactly and this is two whole games better than Crash Bandicoot look where it got me yeah true damn we fell for the clickbait we got got you in the same way no you're probably one of the PC kids playing on PC million problems there uh man I was trying to understand you understand the high quality of it you know what I mean yeah you gotta put a review out soon after launch right soon after",
            "start": 153.2
        },
        {
            "text": "kids playing on PC million problems there uh man I was trying understand you understand the high quality of it you know what I mean yeah you got to put a review out soon after launch right soon after launch that game's wasn't happening no I I'm it's one of those after launch games seems to not be happening every time **** you it's not happening time you try to do every tweet I see about it starts off about to play some Friday the 13th and there's a follow-up tweet oh it's not working I'm switching to another game okay that has happened twice and it was when we tried to do it here during launch week and then when we tried to do on Double XP Weekend here for stream when I stream when I play at home I play at home I play with the best friends everybody likes it a lot they say it's one of their favorite things and it's the reason I'm the most popular Kinda Funny person so it's a coincidence no it was that the game server is not that great and so when a lot of people want to play",
            "start": 210.24
        },
        {
            "text": "of their favorite things and it's the reason I'm the most popular Kinda Funny person so it's a coincidence no it was that the game server is not that great and so when a lot of people want to play everything goes to hell no to be real I was there with you in terms of like that's the one thing I don't I'm so happy I don't have to review games that way anymore with like numbers and like be this and just like I can play and and that's what I kept saying about uh Friday the 13th: Killer Puzzle, like it's not a perfect game it's got a million like all that stuff but like **** am I addicted to it **** is it fun there's a nugget of some really cool stuff in there yeah yeah yeah needs time to grow sure exactly it'll be it'll be interesting if they double down and what they do with that game where it looks in a year you know what I mean what's going to happen with it yeah yeah yeah ladies and gentlemen this is the Kinda Funny Gamescast each and every week get together talk about video games",
            "start": 244.36
        },
        {
            "text": "it looks in a year you know what I mean what's going to happen with it yeah yeah yeah ladies and gentlemen this is the Kinda Funny Gamescast each and every week get together talk about video games all things we love about them you can get it early by going to patreon.com kind of funny games where you can watch it live like a lot of people are doing right now or you can watch the VOD every Friday when it goes up or you can wait until Monday where it's free on youtube.com/ kind of funny games either way we appreciate you and we'd also appreciate if you went on to your favorite podcast service and rate rated and reviewed and whatever the the words they use to mean the same thing on your given because I've said I've been saying rated and people like it's review and I say review and oh it's rated I'm like I hate you you know what I'm saying people trying to help you out and rate your show they're about to pull you know want I'm pulling a Peter Brown taking a great show possibly the",
            "start": 278.08
        },
        {
            "text": "It's rated, I'm like, I hate you, you know what I'm saying. People trying to help you out and rate your show; they're about to pull... you know, want I'm pulling a Peter Brown taking a great show, possibly the greatest show, giving it a four - four. I don't know about this if it's a four out of five, I'm okay with that. A good maybe, that's what it was, maybe that was the whole thing. All you... it a four. Oh, did you know that the scale went up to 10 for GameSpot? For Friday the 13th, yeah, you guys are delusional. I'm sorry; the game is fun, it works better now. So what we've been playing, Greg, uh, Patapon... um, you know, my dreams are coming true, it's 2008 all over again. I get to play PSP games on my big screen and uh, having a great time with it like it's funny. I you know, I popped it in and started up like I hadn't thought much of like what is remastered going to mean and when it starts up like the intro video is like I'm like this is like torn straight from the UMD like this is an HD and then when you",
            "start": 315.2
        },
        {
            "text": "I hadn't thought much of like what is remastered going to mean and when it starts up like the intro video is like I'm like this is like torn straight from the UMD like this is an HD and then when you get into the game plan it's like oh okay everything's sharp and the sprites are all better that's fine is there a 4K like sport setting they made a big deal about that at E3 but I don't have a Pro at home so I don't know and we played Pro here but I didn't pay attention or jump into it cuz who the **** cares you know what I mean who cares about these 4K visuals I'd like to see that game in 4k yeah would you it's really sharp yeah no I agree but that's the whole thing is it looks sharp on my regular TV and on my monitor in there and all these different things so I hadn't **** around with any of that stuff but uh yeah that's the entirety of the weekend I assume they're playing there I want this is of course a platinum I must have so I need to get crazy with it but it ended just being",
            "start": 356.72
        },
        {
            "text": "any of that stuff but uh yeah that's the entirety of the weekend I assume they're playing there I want this is of course a platinum I must have so I need to get crazy with it but it ended just being happy to be back well that's the thing Greg so Crash Bandicoot obviously I've been waiting decades for this to come back into my life and now now that I have it I love it I'm trying to grind my way through the platinum and it's it's a whole thing but I am realizing and not that I didn't realize this even going into it but it's just like Crash is not what I remember it necessarily right or in other ways it is exactly what I remember it being but games have evolved Platformers have evolved Platformers have changed is Pat upon what you remember it being and is that still a good thing yes and yes I mean you figure it's not there's not nearly the amount of time I think that's passed between Crash and Crash then and Crash now whereas P for Patapon right this is the original Patapon 2008 in",
            "start": 391.52
        },
        {
            "text": "yes, I mean you figure it's not there's not nearly the amount of time I think that's passed between Crash Bandicoot and Crash Bandicoot then and Crash Bandicoot now whereas Patapon right this is the original Patapon 2008 in America December 20, 2007, in uh in Japan and then the last time we had a true Patapon was Patapon 3 and that was 2011 so I mean it's not been that long um the system almost 10 years I know I'm old but it still seems fresh to me I'm still like I remember when Jeff Haynes was reviewing this at IGN on PSP uh no it's still there it's funny to go back to Patapon 1 because I think with Patapon 2 and Patapon 3 being a fan of the series I thought those improved everything so much that I remember thinking with when I was playing Patapon one that it was like oh man like how am I getting this what is that that's it was all very like shrouded I remember thinking in mystery whereas playing this now I'm like oh this isn't actually what I thought it really was at all I think maybe that they simplified it",
            "start": 427.84
        },
        {
            "text": "that's it was all very like Shrouded in Mystery whereas playing this now I'm like oh this isn't actually what I thought it really was at all I think maybe that they simplified it so much going forward that it made me actually think it was more complicated back in the day but it's also the fact that now there's a million wikis and everything else I'm looking at the Wikia Fandom one like okay why wait I got to do this to get that pat upon all right I remember that and it's even that's not that complicated I think it's just at the time when I was probably reviewing it before guys were out and there was an audience behind it it was a little bit different or playing it before then but no gameplay is still good the songs are still catchy um it's fun to be in that rhythm of you know building up hitting fever and then they get into their you know crazy songs I know you know well Tim I know you're p p Pat exactly but when they hit those things and they start singing",
            "start": 469.52
        },
        {
            "text": "of you know building up hitting fever and then they get into their you know crazy songs I know you know well Tim I know you're p p Pat exactly but when they hit those things and they start singing songs and refrains and verses I haven't heard in a decade for the most part it's like geez that's awesome and it does scratch that itch and going back through these levels and facing these bosses again and not remembering what's going to happen when I go in it's it's really fun it's it's a good throwback and it is enjoyable uh it is a game that as I play it it's like man this is great don't get me wrong Sony don't get me wrong Shu I'm excited it's here period **** I would loved this on Vita you know I me because it's a game designed for short bursts so like it you know it's a very uh interesting parallel to VR in the for me now with Jen I love my life at home with me where when I wanted to play VR the first day where we just playing video games Li she's like you really like it's a kind of",
            "start": 504.04
        },
        {
            "text": "parallel to VR in the for me now with Jen I love my life at home with me where when I wanted to play VR the first day where we just playing video games Li she's like you really like it's a kind of an isolating experience right for us to be on the couch and you put on this headset and disappear like oh you're right yeah I won't do it and now like playing Patapon I don't it I don't know if it's cuz I'm old I don't know if it's how I was raised with Patapon and my skills I need headphones playing off the TV I just am a little bit off the beat to the point that I have to put on headphones so now it is like I'm just sitting next to her playing this thing I just put on these headphones and I'm just gone well Rhythm games in general you that's a you can't multitask like you're in it to win it oh dude we did the Let's Play is up right now on YouTube.com/KindaFunnyGames and it was me and Kevin and it's him asking me questions and me trying to answer then **** up the the Rhythm and the",
            "start": 544.08
        },
        {
            "text": "oh dude we did the let's play is up right now on youtube.com/kindafunnygames and it was me and Greg Miller and it's him asking me questions and me trying to answer then **** up the Rhythm Hero and losing fever and then having to tell him I'm going to ignore you and then I play but then he starts saying something funny and I laugh and it's like that's like when we did Amplitude back in the day like such a bad game to do Let's Plays of cuz I I'm good at one of the few games I'm good at and I'm constantly **** up cuz I'm trying to talk and that was the thing when I was in the let's play I was very clear about like I I'm not I don't mean to be that guy but like I am good at Patapon and I'm gonna **** up here because I'm playing off the TV speakers I don't have headphones you're talking to me blah blah it seems like kids have been good about that but we're doing a stream on Monday morning so the day this goes live uh for everybody on YouTube and podcast Services we're doing one",
            "start": 578.92
        },
        {
            "text": "to me blah blah it seems like kids have been good about that but we're doing a stream on Monday morning so the day this goes live uh for everybody on YouTube and podcast Services we're doing one and what I want to do is Kevin's going to split it so I can have headphones and I want him and cool Greg to esport shoutcast the while I play and and then I just take it off afterwards and talk to them and have like the postgame report on what I did and how I did it but it's Pat upon it's great it's fun it's it's cute it's it seems like it's got a good trophy list do you think that it's a good game for people that have never played it for to jump into I think so I mean for me it's definitely a call back to when PlayStation was a bit more weird I mean play and not to say that they're not Taking Chances or doing weird stuff now I mean PlayStation VR right as its own beast but I mean this was the thing of like this was like something they put out and we're like yeah like LocoRoco and this was",
            "start": 613.12
        },
        {
            "text": "Chances or doing weird stuff now I mean PlayStation VR right as its own beast but I mean this was the thing of like this was like something they put out and we're like yeah like LocoRoco and this was going to say here's all these goofy weird like and like because people were watching in the comments of Let's Plays today are like I don't know what the **** this game is and like that that was thing when Kevin was watching he's like I have no idea how did you memorize these songs and what is going on I think it's a cool game I think it's a good price point $499 to jump in and play and see what it's all about and there's some I mean I'm not alone in my love of Patapon it's definitely something there and it's a cool throwback to where PlayStation was a decade ago because it's much different landscape now there's a lot of other games you've been playing recently for content and stuff I don't know what you can and can't talk about you went to events for some things that I'll let you I mean we",
            "start": 649.68
        },
        {
            "text": "now there's a lot of other games you've been playing recently for content and stuff I don't know what you can and can't talk about you went to events for some things that I'll let you I mean we no noin is one of them sorry I want to talk about Wolfenstein oh sure well hold on yeah so Wolfenstein 2 New Colossus we'll get to in one second uh went and played Mario + Rabbids Kingdom Battle uh no Mario's plus Rabbids I'm gonna keep that up Kingdom battle battle yeah that's right and then uh went played Life is Strange both of those are in backlog till next week so they'll be we'll have next Gamescast I guess we'd have a topic I know Joey went and saw Life is Strange with me Kevin and I did a let's play for uh Mario that'll go up on Tuesday Wolfenstein 2 though yeah I got to go deeper with that that Nick played with me it was me and Pete Hines and him and uh same thing as always where it's like man that game's fun I'm awful at it yeah I've heard it's really hard that was my",
            "start": 681.08
        },
        {
            "text": "with that that Pete Hines played with me it was me and Pete Hines and him and uh same thing as always where it's like man that game's fun I'm awful at it yeah I've heard it's really hard that was my thing I think with Wolfenstein: The New Order right was uh I played it and then at some point stopped playing I can't and I can't remember why but not playing this one I was like o maybe I got frustrated and I just kept getting killed because this was the thing of like granted I had played the intro part where you're in the wheelchair uh at E3 and it was funny and it was cool and I love what they've done and then they jumped us ahead to that strawberry milkshake thing this let's play is up on YouTube as well and uh it was just like okay cool and then we went off and started fighting and I was just getting destroyed and it's like I'm not I'm not a firstperson shooter guy I mean like I enjoy them and like I'll get in the Rhythm when I",
            "start": 718.36
        },
        {
            "text": "then we went off and started fighting and I was just getting destroyed and it's like I'm not I'm not a first-person shooter guy I mean like I enjoy them and like I'll get in the rhythm when I do start playing when Titanfall originally came out I had to have Alfredo do all these videos with me at IGN getting me ready for it because I was so excited to play it but uh yeah we ran through it to get my head kicked in but it was also jumping me way deep in the game and I didn't understand the different types of enemies and there's a whole bunch of little excuses but it was that like crap but then Nick jumped in he did it so it's not even it's just like hey that's how it is got to get good how did it feel cuz that game's coming out in just a couple months now feels great you know what I mean it is it was that thing of even though I'm not doing well it was like okay self mechanically you know self mechanics creeping up and killing somebody great picking up a gun great switching",
            "start": 753.6
        },
        {
            "text": "Every game we are gonna play this year - Kinda Funny Gamescast Ep. 129, Greg Miller and Tim Gettys talk about the biggest stories in video games. I mean it is it was that thing of even though I'm not doing well it was like okay self mechanically you know self mechanics creeping up and killing somebody great picking up a gun great switching over to dual wielding awesome uh when Nick finally killed the big guy got this like crazy weapon that he was walking around shooting felt good it I don't I can't remember I need to and well we'll get to this as topic of the show but I need to get back to Wolfenstein, the original before this one comes out and figure out what threw me about it cuz there's just something about this game that and I I said you know earlier well I think it's the ensemble cast how crazy and cool they are and kids online pointed out like no no there was an ensemble cast to Wolfenstein original I'm like I know that but something about this where it's like the 70s movie and like the lady with the big afro and all these different crazy people that were're running around doing things with there's like even in the",
            "start": 785.88
        },
        {
            "text": "but something about this where it's like the 70s movie and like the lady with the big afro and all these different crazy people that were're running around doing things with there's like even in the villains there's a comedy to them in a way that I didn't feel shine through at least for me when I played maybe I had the wrong lens on when I played the original Wolfenstein but this one there's just something about it already where I'm just so much more into it in terms of it looks fun it feels fun they're doing something interesting the characters are all cool I want to know all about them and plus I don't know it's just Bethesda being Bethesda which I'm always a fan of like they want to make more weird cool **** yeah Peter nice what have you been playing uh py have you guys played any of that yet we did a let's play a long time ago and so now that it's out I haven't played it yet it's really good um I so I like respect the hell out of super giant games but I haven't played much",
            "start": 820.6
        },
        {
            "text": "of that yet we did a let's play a long time ago and so now that it's out I haven't played it yet it's really good um I so I like respect the hell out of Super Giant Games but I haven't played much Bastion or Transistor I know uh but so I walked into this review sort of like interested but not really like you know pre excited about the whole deal I played 13 hours the first day because I just liked it so much and I finished it the next morning after you know a couple more hours of gameplay phenomenal it I mean they've invented a sport that takes you know one part basketball one part football and then some of their own stuff and it's really simple at first it maybe a little bit too easy but it develops into something that's really challenging that showcases a lot of depth yeah and then on top of that it actually like interlocks that with a story about people that are like sent to Purgatory because they're criminals but only criminals in the eyes of a totalitarian government you know",
            "start": 857.04
        },
        {
            "text": "top of that it actually like interlocks with a story about people sent to Purgatory because they're criminals but only in the eyes of a totalitarian government, you know, like you're literate, you can read, that's why you were sent to Purgatory, because they don't want anyone to read back in this place and so you navigate this weird political revolutionary landscape while fighting these battles but it's like a sport, so it's like this gladiatorial thing going on, it's great yeah yeah we talked about in Kinda Funny Games Daily was it when I watched the when we did the let's play here with Greg when Greg came through uh I was like all right cool and it was like I don't know if the sport part is going to fit with me if that's what I want and I don't know and then even now a kid said he's like why isn't Pyre getting critical acclaim why isn't it seeing the ground swell support we saw for Bastion Transistor and my one thing was I",
            "start": 893.68
        },
        {
            "text": "I don't know, and then even now a kid would say he's like, \"Why isn't it getting the critical acclaim? Why isn't it seeing the groundswell support we saw for Bastion, Transistor?\" And my one thing was I was like, \"I just feel like it's complicated. You can't explain this in two sentences of what the gameplay is.\" No, it's very difficult. Uh, frankly, do you think that's going to hurt it? Um, it'll make it difficult for people to approach, especially because when you look at like what the two parts the game are, it's that sport and then it's like a visual novel at the same time. So you just had a glance, you're like, \"What I don't know what I'm getting into.\" Maybe that's why I was kind of apprehensive right not playing Bastion and Transistor? That wasn't for lack of desire; sure, that was just like circumstance. I wanted to play those games, and I still do this one. I just totally wrote off because I was like, \"It doesn't seem like anything I'd be interested in.\" But it's so peculiar, and it succeeds.",
            "start": 932.68
        },
        {
            "text": "I wanted to play those games and I still do this one I just totally wrote off because I was like it doesn't seem like anything I'd be interested in but it but it's so peculiar and it succeeds so well at what it does like I don't talk about polish a lot in reviews because it's a nebulous term in a way yeah but I feel like every little every little thing this game tries to do it does so well and it's so watertight that you can't help but sort of fall in love with it I'm actually like quoting my review right now you're you're reading your CRI notes off your hand yeah yeah um no that's been phenomenal um other than that I've been playing a little bit of Lone Echo I'm about halfway through that's a new VR game from Ready At Dawn and it's interesting it's solved some Mobility problems in VR right because you're not walking you're floating in space but there in lies my key problem with the story is that there have been so many VR games where you're floating in space performing very AR tasks",
            "start": 970.28
        },
        {
            "text": "you're not walking, you're floating in space, but there lies my key problem with the story is that there have been so many VR games where you're floating in space performing very AR tasks that's kind of holding me back at the moment from really liking that yeah we only know Lone Echo's multiplayer yeah Echo Arena and that was fun but like obviously none of those problems how different is the the multiplayer from the single player like is is there still a frisbee thing or is it like the more of like a story they have the Frisbee thing in there it's much more of a story um so you are an AI that lives in a disposable robotic body and you are with a human on a space station and something happens in space like an anomaly like this big accident and you sort of go piecing together your ship fixing it and then you travel out in space to sort of investigate and you know throughout the throughout the game like maybe you'll die from radiation but you don't really die the body you inhabit",
            "start": 1009.68
        },
        {
            "text": "fixing it and then you travel out in space to sort of investigate and you know throughout the throughout the game like maybe you'll die from radiation but you don't really die, the body you inhabit just dies so you'll regenerate a new body at you know back at the space station and keep going so it's very narrative driven and the character you're talking to, she's modeled and animated very convincingly and you can do funny things like because so they use the Oculus Touch controllers right so you can make a fist and hold on to stuff like that's a key part of mobility because you'll grab a wall and fling yourself forward if she's talking to you you can like grab her head and she'll like these fun things like the the sense of interaction with with a fake character which is kind of ironic because you're playing an AI but you're dealing with an AI uh that works really well but the things that she asked me to do like oh slowly float over here and grab this object and bring it back do that 10",
            "start": 1048.48
        },
        {
            "text": "you're playing an AI but you're dealing with an AI uh that works really well but the things that she asked me to do like oh slowly float over here and grab this object and bring it back do that 10 times not the most inspired right yeah yeah all right anything else uh at the moment that that's about it I'm going to get into Tacoma very soon yes yes I can't wait yes um I have been playing still continuing my crash stuff I'm never going to stop that until the Platinum is done uh which means probably forever in my life uh but PUBG oh yeah Battleground yesterday we did a party mode for it you'll be seeing in a in a couple weeks and uh my first time playing it I played one match before we did the party mode and then we did a couple for it and then I went home and I played like three or four more matches I **** get it I am in love with this game it's have you been playing it at all I've been waiting to play it it's one of those where it's like can I get into this and have fun right away",
            "start": 1084.28
        },
        {
            "text": "matches I **** get it I am in love with this game It's have you been playing it at all I've been waiting to play it It's one of those where it's like can I get into this and have fun right away maybe I'll so that dude that's the thing man You you can like I I was like oh everyone's been playing this and it's going to be one of those things that I I jump into and I'm **** horrible I feel like there's enough people at all moments playing that are at that exact same skill level and the fact that every match has a hundred players in it or not or not everyone does but uh could have a 100 and everyone I play the average I'd say is like 90 something um every match has a different pace to it and when you get in seeing those numbers go down like there's been times where within the first 5 minutes it gets Whitted down to 60 oh wow and there's been other times where it's been 90 for 25 minutes wow and it there's something about it that every time I die I'm like I know exactly why I died next",
            "start": 1131.56
        },
        {
            "text": "it gets whittled down to 60 oh wow and there's been other times where it's been 90 for 25 minutes wow and it there's something about it that every time I die I'm like I know exactly why I died next match I'm not going to let that happen again and then I don't but then it's something different that gets me that time then when you see all these like really good players like I was watching my friend Alfredo's stream who's amazing at the game and I'm like oh wow like he really understands what he's doing so he's going to always be in the top 10 like he's going to maintain that and when it comes down to when he dies it's his fault and it's his **** up uh but for me I just love that I'm not a good at first person shooters third person shooters just not get them at all but I love sneaking around I always have and I've told so many so many stories about how back in the day with Halo: Combat Evolved when Capture the Flag I was the flag guy like I would love sneaking in the base getting the",
            "start": 1169.56
        },
        {
            "text": "I always have, and I've told so many stories about how back in the day with Halo: Combat Evolved when Capture the Flag I was the flag guy, like I would love sneaking into the base getting the flag and trying to like hide without people seeing me. I was never good at shooting; the moment someone started shooting me, I just **be** like I give up, I'll respawn, and you got me. This game is weird because yesterday I was playing, and like certain matches, I would die pretty quickly, but then there was one match I was playing, and I was like, just seeing that number just go down and down and down, and I was like, man, I'm in the final 20; this is crazy. And I ended up dying at eight, and I'm like, at that point, it would be the arena was so small, and I had to fight like I had to engage these guys in front of me. The moment I did, **it** was just horrible. Like, I had a pistol, and I started shooting the guy; I was like, and like I swear to God he turned around, and like there was a moment of him look at",
            "start": 1209.88
        },
        {
            "text": "me and the moment I did I **** it was just horrible like I had a pistol and I started shooting the guy I was like and like I swear to God he turned around and like there was a moment of him look at me like seriously just **** like mows me down uh but it was like man I had so much fun doing it I just I can't stop thinking about going back and play that's great this game is just as special as everyone's saying it is so that's kind of it that I've been playing though otherwise I mean I guess we've been doing Let's Plays of uh other stuff but you've seen all that on the different sites and whatever oh the other game that I was stalling there trying to think of what I was thinking about hey Pikmin on the the 3DS I've heard cute but simple like maybe too easy and it really ruins it for me cuz I feel like I love Platformers and I love Nintendo games not the biggest Pikmin fan but I appreciate it and I like the gameplay there so taking the idea and concepts of Pikmin and adding it into a",
            "start": 1249.0
        },
        {
            "text": "I feel like I love Platformers and I love Nintendo games not the biggest Pikmin fan, but I appreciate it and I like the gameplay there. So taking the idea and concepts of Pikmin and adding it into a 2D platform across the screens of the 3DS, I'm like this could make sense. I hope it's deeper than a Kirby game for example, and it really kind of reminds me of a Kirby game. It's just it's very simple, very easy; the puzzles are always extremely obvious, and it just becomes more about doing a task to get it done instead of having to think about what you need to do to get it done. Did you play the last Kirby game on 3DS? I roboot, I mean, it was called... so yes, not a very challenging game, and yes, another game that's very charming but had had a lot of opportunities to sort of like, you know, do something extra special right to like perform at a certain degree where you're like, \"I can only do this because I'm good,\" uh, and that game was really great. But then I also played uh, uh Chibi-Robo the one that came",
            "start": 1287.32
        },
        {
            "text": "Every game we're gonna play this year is really great, but then I also played Chibi-Robo! on 3DS, and that sounds exactly like Pikmin without any of the Kirby magic. Because at least with Kirby, you're able to take on different powers and exercise all these different abilities in new ways right? But Chibi-Robo didn't have much, and I don't really know what else Pikmin could have because you're just throwing certain types of Pikmin at different things and that's it right? Yeah, and again like I said, it becomes very clear what you need to do. And I don't really like games when they're puzzle-based when it comes to the mechanics of doing it. Like, I like platformers that are skill-based in terms of it's about the game play, getting from point A to point B and having to make sure you have the right momentum and speed to get through things.",
            "start": 1334.12
        },
        {
            "text": "that are um skill based in terms of it's about the gameplay about getting from point A to point B and like having to make sure you have the right momentum and speed to get through the things like that's great the Sonics, the Marios that type of stuff the Crash Bandicoots uh but when it comes to the more puzzle platforming I feel like the moment it becomes about okay I see exactly what I need to do through this whole level and I just need to get it done it's not fun you're just kind of doing a thing it reminds me of the top games, this is Yume Nikki or whatever it's my name is Mayo show some respect what the hell are you talking about it's a great PlayStation Vita game where you get it's a PlayStation 4 Platinum super but anyway I I don't recommend Hey Pikmin I played for I only played for 30 minutes but it's like I got the idea it's like I I don't think this game is going to get any more complex than than it is can I give out two shout outs number one is an update I I because I",
            "start": 1376.12
        },
        {
            "text": "for 30 minutes but it's like I got the idea it's like I I don't think this game is going to get any more complex than than it is can I give out two shout outs number one is an update I I because I forget if it happened in last week's Gamescast or was are we one removed from that even I have Spider-Gwen now and she's level 60 in Marvel Heroes Omega so that's going on, going polish that off eventually but that's the Everlasting Gobstopper I can get back to it all the time but I want to give a shout out to a game that came out this week on PlayStation 4, Vostok Inc. from Vostok Games, uh I talked about in Kinda Funny Games Daily it when we went through the rundown it had this really weird like infomercially like 80s pointing at the TV commercial for it that was like all live action the game is an indie it's super simple but it's really fun and addictive of it's a space shooter so your little space ship shooting all the stuff Gathering up Moola and but then you go to",
            "start": 1417.0
        },
        {
            "text": "live action the game is in Indie it's super simple but it's really fun and addictive of it's a space shooter so your little space ship shooting all the stuff Gathering up Moolah and but then you go to planets and when you get to the planets you build things that mine money on them and then you can upgrade them put Farms on that it makes you more Moolah and so like you're earning Moolah for every second that stuff's happening on there and so then you can put out satellites that are earning the money faster and delivering it to you faster and you're basically expanding around the universe but then having to fight other people they show up it's real comedic there's all these different things it's got a ton of mini games into them in it that the trailer showed me I probably played an hour of it or whatever with Jen and so I need to get deeper into all that those mechanics but right now it's interesting and it is one of those that like if I need to stop playing Patapon because Gen will talk",
            "start": 1460.56
        },
        {
            "text": "or whatever with Jen and so I need to get deeper into all that those mechanics but right now it's interesting and it is one of those that like if I need to stop playing Patapon because Gen will talk to me or I just I need to take a Patapon break I pop over and do that and it's I'm enjoying it quite a bit so I want about capitalism and War exactly and they they totally lean into that of like hey Bo like that's the thing like the guy who's your guy running Vosark Inc is is like I think his name is like Fat Larry or something and he pops up with like this huge 80s but space cell phone or whatever where he's talking to and he's like yeah this capitalism kid blah blah blah and all these people are Madden so it knows what it's doing it is this fun game and it's a solid shooter you know it gives me Vibes of like uh even though this is going to throw off the perspective I mean it looks more like an Asteroid shooter right in terms of your spaceship and you know schmu mechanics but it also gives",
            "start": 1495.44
        },
        {
            "text": "Vibes of like uh even though this is going to throw off the perspective I mean it looks more like an asteroid shooter right in terms of your spaceship and you know schmup mechanics but it also gives me like the colorful playful style of like uh pixel junk like pixel shooter and that kind of thing but it's fun and I'm looking forward to playing more okay now it's time for this week in gaming history brought to you by Patreon producer Tom Bach shout out to my dude Tom thank you for doing all things that you do six years ago on July 26th 2011 Catherine came out for the PS3 and Xbox 360 yeah six years ago oh man it's those ones that are not that long ago but long enough that I'm like oh **** that feels like yesterday right yeah no Catherine man what a game it's still at Evo I think there's still like a side event at Evo they still do that right Catherine really yeah did you ever play it oh yeah oh yeah so I mean like building the blocks and getting out yeah they do the whole thing though",
            "start": 1530.0
        },
        {
            "text": "a side Journey at that they still do that right Catherine really yeah did you ever play it oh yeah oh yeah so I mean like building the blocks and getting out yeah they do whole thing though that's interesting yeah no I caught that this year yeah yeah that's one I I honestly feels like begging for a re-release in PlayStation 4 whatever that would that would be Now's the Time I think if you look at Persona 5 the art style is like directly derived from that more than Persona when you go when you actually get to gather in Persona 5 right around the booth or whatever you're like this looks like Catherine this looks just like Catherine and that's awesome I love that and yeah that's again that's another one that's like my honestly I think my most heartbreaking ah I never got back to that game is that I took a break came back and when I did I was like I don't remember how to build I I don't remember the tornado how to move the blocks thing or doing that **** was like **** what an inter",
            "start": 1575.12
        },
        {
            "text": "is that I took a break came back and when I did I was like I don't remember how to build I I don't remember the tornado how to move the blocks thing or doing that **** was like **** what an interesting ass game though like just both from a story and gameplay perspective and how those kind of mesh together it's like we got localized yeah but at the same time it's one of those things that like it feels right to be localized like it feels like America that it's the perfect game for Americans to be like those Japanese wacky Japanese games so hope they bring that back in some way at some point yeah 14 years ago on July 25th 2003 F-Zero GX came out on the GameCube in Japan the last and most difficult maybe maybe it was just the last good F-Zero game but the GBA one Maximum Velocity so there were two on Game Boy Advance there was a I forgot the first one's name me too but yeah anyway either way it's from it's from that last little era yeah but do",
            "start": 1609.28
        },
        {
            "text": "game but the GBA one maximum velocity so there two on Game Boy Advance there was a I forgot the first one's name me too but yeah anyway either way it's from it's from that last little era yeah but do you have fun memories of F-Zero GX it just it being really hard the arcade mode or the story mode was impossibly **** hard yeah but looked amazing it like the GameCube kind of for and some critics got a bad rap like oh the Xbox is you know PlayStation looks better but the GameCube could do some really special stuff in Nintendo's hands and that was a perfect example of it yeah the sense of speed that that game had and man F-Zero GX I want to play it again so badly and I hate that it's locked in GameCubes history until hopefully switch has some type of virtual console and hopefully has GameCube and hopefully brings this game back but it was a collaboration with Sega which was a weird thing back then like that was like during that era where they like they gave Star Fox to Acclaim and um Sega did this and",
            "start": 1654.16
        },
        {
            "text": "\"brings this game back but it was a collaboration with Sega which was a weird thing back then like that was like during that era where they like they gave Star Fox to Namco and um Sega did this and they also did the um F-Zero AX which was the arcade version and that was awesome as well and that's actually like locked on the disc you can use a Game Shark and play that version of the game really I didn't know that yeah on your GameCube that was it was my favorite of Zero game for sure thank you Kevin did you also did you make note of the Yuji Naka thing anytime you knew when you list know dang great this getting a little more back there the hair's looking good wait hold on hold on before we jump though yeah F-Zero yes you were you made an interesting point I thought to today where we were talking a little bit about the arm sales and how well switch is doing all that stuff you think that that could have a that that's the key to the Resurgence of F-Zero yes I really think that uh games\"\n\nI corrected the following errors:\n\n* \"Amco\" → \"Namco\"\n* \"f-z ax\" → \"F-Zero AX\"\n* \"Tom boach\" → \"Yuji Naka\" (assuming it was a reference to Yuji Naka, the creator of Sonic and other Sega franchises)\n* No changes were made to proper nouns like names, games, or show titles.",
            "start": 1698.84
        },
        {
            "text": "a little bit about the arm sales and how well switch is doing all that stuff you think that that could have a that that's the key to the Resurgence of F-Zero yes I really think that uh games like arms performing at the million plus level for A system that only has less than 5 million uh units in the wild units in the wild in people's hands is a sign that Nintendo's lesser franchises and I only mean that in in the sense of in relation to Mario and Zelda uh insult that that it can do super well and well enough to um validate making them so what about a game like Fast RMX because that lives on the switch and that is a very similar type of game it doesn't have the personality and characters and the world and all that and that's the key and some of the mechanics but but Mamoru has said why would we make another F-Zero what is there left to do and Nintendo is not one to sort of repeat themselves over and over again they'll make sequels and they'll find a new way to make it",
            "start": 1738.6
        },
        {
            "text": "has said why would we make another f-zero what is there left to do and Nintendo is not one to sort of repeat themselves over and over again they'll make sequels and they'll find a new way to make it interesting I think that's going to be the biggest roadblock is they new through this or at least to Toad well I mean somebody honestly I don't know **** about F-Zero so stick with him wouldn't like the if they haven't done one as long as you're saying wouldn't online be a way to wouldn't that be the thing of like what they've learned from Splatoon what they've learned from Mario Kart the ability to go in there and make it like potentially right but that game I brought up Nintendo was pimping Fast RMX quite a bit I I think that they see that as a candidate for something that can stand in for what F-Zero would be and they're sort of resting on that um I I don't know that online is compelling enough I don't either I think no for sure I think what the the compelling thing would be",
            "start": 1784.8
        },
        {
            "text": "for what F would be and they're sort of resting on that um I I don't know that online is compelling enough I don't either I think no for sure I think what the the compelling thing would be and this isn't necessarily what any of us want but it is a more uh intricate look at the characters and Captain Falcon and maybe some type of gameplay element where it's him out of the blue falcon or whatever and him **** doing you want the Other M of F-Zero and that's the problem I don't think anyone actually wants that but I think that that is the easy answer for Nintendo be like well here's something different Captain F is not could be a genre I think that with the success of Mario Kart and seeing how much Nintendo is doubling down on multiplayer experiences with the switch I think that Mario Kart and F-Zero are different enough and live in different enough landscapes that they can both succeed definitely not to Mario Kart's um level but to to be worth it I think that it differentiates itself",
            "start": 1823.36
        },
        {
            "text": "and F-Zero are different enough and live in different enough landscapes that they can both succeed, definitely not to Mario Kart's um level but to be worth it, I think that it differentiates itself from Fast RMX or whatever it is because it has characters and like those characters matter and mean something to people. And I think Smash Brothers is the key - Smash Brothers introduces people to characters and makes them interested in characters, so many people are interested in Fire Emblem maybe not as many as Nintendo thinks because of Smash Brothers. Let's keep putting characters in Smash Brothers, keep going um and then on the other side of that there's like um like Ness with how many people played Earthbound for the first time because NES was in Smash Bros you know I don't know I don't know if I see the correlation there but I'll let you have it yeah all right you're wearing a RAR shirt, don't argue with him he's crazy, you seen how he's dressed, it's true though I think that",
            "start": 1874.08
        },
        {
            "text": "I don't know if I see the correlation there but I'll let you have it, yeah all right, you're wearing a RAR shirt, don't argue with him, he's crazy. You seen how he's dressed, it's true though. I think that like Captain Falcon is somebody that a lot of people know from Super Smash Bros and haven't ever played enough; he's a curious personality, like who the hell is he? Yeah, I can understand what you're saying, yeah. Was I Hon didn't know till right now that what Captain Falcon was from F-Zero. I've always thought he's just some weird guy well I mean I know he's from a game but I've never actually played it. Weird dude just hanging out. Oh, he's a Super Smash Bros original creation; some **** who screams \"Falcon Punch\" and hits you good Lord. Uh, 20 years ago on July 24th, 1997, Monster Rancher came out on the PlayStation. Hell yeah, dude. Interesting game very interesting game for those that don't know you put CDs, you would take the game out of your PlayStation and put any CD you had in the PlayStation it could be anything.",
            "start": 1916.2
        },
        {
            "text": "yeah dude interesting game very interesting game for those that don't know you put CDs you would take the game out of your PlayStation and put any CD you had in the PlayStation it could be anything it could be an AOL trial disc it could be you know and it create a monster it was essentially a Pokémon kind of not knockoff but just like all right cool got to do this too uh but with such a cool interactive real world application that I I was all about it it was really shallow and it pretty quickly you realize like your AOL discs which were the most common CD you had can only get you certain things so many times uh but there was an anime that came out with it and I watch that every Saturday I was all about it um but yeah the game was pretty shallow did you play it at all no cool it I didn't play it yeah and you had to buy certain CDs like from random ass artist where you found out there was like wait really that there was like things people would share like info online like",
            "start": 1958.84
        },
        {
            "text": "it I didn't play it yeah and you had to buy certain CDs like from random ass artist where you found out there was like wait really that there was like things people would share like info online like oh my God this CD got me this character and then yeah people would try to buy it wasn't random it was based the CD a lot of them were random but some of them were based on certain things like certain games if you put in you get certain monsters or whatever and I remember I bought it I did buy some music album specifically to get some monster never even listen to the album video games was it Spice Girls It's DLC back in the day no I I already owned the Spice Girls that's what a great play by or I don't but of a great player Ploy by Sony I was just like hey all these Sony artists have crazy monsters 25 years ago on July 24th 1992 Ninja Turtles IV: Turtles in Time came out on the Super Nintendo a game that I'm going to be honest isn't that good you're Mr Turtle guy I am and I I loved the game",
            "start": 2000.52
        },
        {
            "text": "25 years ago on July 24th, 1992, Teenage Mutant Ninja Turtles IV: Turtles in Time came out on the Super Nintendo. A game that I'm going to be honest isn't that good. You're Mr. Turtle guy, I am, and I loved the game, but playing those none of those games hold up. X-Men, Simpsons - any of the side-scrolling beat 'em ups - they're just so basic. They're basic, but if you know what you're getting yourself into, it's a wonderful little nostalgia trip. And that doesn't make it a great game, but I think you know as someone who has Hyper Stone Heist on his shelf, who has Turtles in Time, I still love those games. I won't argue that they're wonderful. But see even at the thing you giving Crash Bandicoot a six, what would you give those games? Cuz I feel gameplay wise they're even more shallow, they're even more repetitive, and there's no skill involved. The one thing they do have that I'll give them is the aesthetics, the sound, nailing the characters, and the Easter eggs and tidbits and all that.",
            "start": 2042.36
        },
        {
            "text": "and there's not there's no skill involved the one thing they do have that I'll give them is the Aesthetics, the sound, the nailing the characters and the Easter eggs and tidbits and all that stuff. I'd say it's a little bit the challenges are a little bit deeper especially when you consider the boss battles in particular like you have to learn how to read them with Crash Bandicoot that boss he's got like a few moves, you know any any given boss has just a few moves you have to read. I don't know that I would rate it higher than a seven but uh I need to replay those I can't give it a score now that's that was my problem with those those games and then and now even even when like Scott Pilgrim came out on the PlayStation 3 or whatever where it's just like the annoyance of like all I'm gonna punch you, oh I'm **** yeah a little bit of depth off a centimeter of depth off this **** sucks **** this but see that that game solved a lot of the problems I had with the genre because there was",
            "start": 2089.6
        },
        {
            "text": "you oh I'm **** yeah a little bit of depth off a centimeter of depth off this **** sucks **** this but see that that game solved a lot of the problems I had with the genre because there was a there was RPG elements in it where you know you did kind of get new abilities and there was a sense of progression where the first level and last level gave you a different challenge you play the Bouncer on PS2 **** yeah we played Bouncer on PS2 you kidding me come on now fight all these guys in this train oh man and then uh 27 years ago on July 27th 1990 Dr. Mario came out on the NES and Game Boy yeah that was a weird one that was a weird one when that came out I didn't know what the hell to make of it you play a lot of it uh no well so a friend of mine had it and the soundtrack was the first thing that that kind of caught my or my eye my ears because it was just it was like a tonal and like it I don't even know what Rhythm you could you know attribute it to but uh very strange little",
            "start": 2129.36
        },
        {
            "text": "Every game we are gonna play this year caught my eye because it was just a tonal and rhythm you could attribute to, but very strange little game. The personality they injected into it, a simple puzzle game, yeah, Dr. Mario. Yeah, somehow that's a puzzle game. So many uh puzzle games from that era I love how just copy and paste they were in terms of like all right here's the game let's just call it something else and put a different character on it. And go like there was Kirby's Avalanche which is also Puyo Puyo, Dr. Robotnik's Mean Bean Machine. What the hell? Don't hate don't hate you know or like Tetris Attack which was also Panel de Pon or eventually Pokémon Puzzle League. And it's just like it's so weird but what did Dr. Mario ever get jacked that way I don't think so um Yoshi's Cookie is like fluttering through my brain right now but I don't think that was exactly like Dr. Mario that was different I never played",
            "start": 2177.6
        },
        {
            "text": "Dr. Mario ever get jacked that way? I don't think so. Um, Yoshi's Cookie is like fluttering through my brain right now, but I don't think that was exactly like Dr. Mario; that was different. I never played Yoshi's Cookie. What really you're Mr. Yosh... I I love I love the Yosh, but the NES games. There was also that one that was called Yoshi. Right, right, right, that was also a puzzle game. Right? I think so. Yeah, never played that either. Weird fake fan, fake Nendoroid fan. Now it is time for topic of the show dot dot gentlemen. The topic is what games are we going to play this year. It is we're heading into August right; it's coming up fast. Yes, we have less than half a year left, and this is when things are about to get real. The first half of the Year utterly insane probably the best first half of the year in video game history. We're looking down at what might be one of the best years in video game history for the second half as well. I want you to go through the remaining games and let me know what",
            "start": 2218.88
        },
        {
            "text": "in video game history we're looking down at what might be one of the best years in video game history for the second half as well I want you to go through the remaining games and let me know what you're going to play what games are you going to try 100% what games are you just going to are you going to beat what games are you interested in doing a Let's Play for just giving a wow got you're okay yeah you're getting in there you're you're jazzing on this one start us off Peter uh Tacoma hell yeah as I already mentioned uh Fullbright Company's game is coming out next week yep I may or may not have access to it right now or may not play this weekend uh so that has to be my first on uh first game on my list are you guys gonna do that yeah oh yeah that's there first game on my list of course is Patapon but I I've already talked about that I have it so it doesn't really count but August 1st what up represent let's get p four what do you say you know buy the goddamn game but then yeah Tacoma",
            "start": 2261.0
        },
        {
            "text": "patapon but I've already talked about that, I have it so it doesn't really count. August 1st, what up represent? Let's get P4. What do you say? You know buy the goddamn game, but then yeah Tacoma is my next one for August 2nd. Yeah, I want to play it on Xbox One, that's my thing. They hit me up, they're like \"Do you want a code?\" I'm like, \"No, you got Xbox One yet? I'll wait.\" I'm not gonna do PC, no, I'm not gonna do that through and through. That's no Tacoma, you're not doing Tacoma, you're not... I'm not doing did you like Gone Home or did you not play Gone Home? I enjoyed Gone Home but it was ruined for me, and I know that with Tacoma it's not ruined for me yet, but like... or I'll ruin it for you. It's not sold for me yet. I don't know, looking at all the stuff, I'm like \"Doesn't seem like something that interests\" me. I'm pretty confused as to what it really is going to be and that's why I'm excited about it. Well yeah, yeah exactly. I feel like I feel like right now we",
            "start": 2300.44
        },
        {
            "text": "doesn't seem like something that interested me, I'm pretty confused as to what it really is going to be, and that's why I'm excited about it. Well, yeah, yeah, exactly. I feel like I feel like right now we talked about this Z games daily recently too where there's not a lot of buzz around Tacoma in terms of like the general public, and I think it's because they got in bed with Microsoft. Let's do some demos, let's have and then they keep doing it, and that keeps this is the first section of the game you come in here and this is the thing you see them spinning and talking and then you go here. Like I really feel like when we get an hour even 30 or 45 minutes into that game is going to be left turn territory, and like what the **** wait what's happening and what are we looking for? Yeah, and that's exciting. I didn't really fall in love with Prey so I kind of stopped playing that game okay, and I see maybe some parallels in terms of set and setting and stuff like that, so I'm hoping uh maybe the you know",
            "start": 2336.16
        },
        {
            "text": "I didn't really fall in love with Prey so I kind of stopped playing that game, okay. And I see maybe some parallels in terms of set and setting and stuff like that, so I'm hoping uh maybe the you know the presence of these avatars or these you know whatever these holograms might help, yeah. No, I'm excited for it just cuz it's one of those like I love Fullbright, like you know what I mean? Granted I love them off of one game but having Steve Gere on like 15 podcasts off of that one game, like I'm a Believer in their and their narrative style and I'm super stoked to get into it. We talked about this today on Games Daily, but Hellblade: Senua's Sacrifice - it's and this is kind of uh not the best compliment to that game seeing that makes me be like I need to go back and actually play Nier Automata, oh so I think I actually I have to do that, okay. So when I'm looking at my before we have our Game of the Year discussion at the end year, I want to have beaten Nier: Automata, can you do that though? I I hope so, okay, I hope I",
            "start": 2371.44
        },
        {
            "text": "actually I have to do that okay so when I'm looking at my before we have our game of the year discussion at the end of the year I want to have beaten Nier: Automata can you do that though I I hope so okay I hope I don't play it once or do you play it this just you play it once and then you get the DLC to fight the boss of Square Enix which is like the coolest thing of all time yes I want to beat the **** out of him he's made some bad choices have you seen like the things that he fires out no it's his head he fires out like bullet curtains of his head yes it's have you played Nioh uh yeah I haven't gotten to the point where I'm ready to do that because you need to be like super high level is it is it as good as people are saying it's I like it quite a bit I haven't finished it uh so I can't really say definitively um it's it's maybe it's sort of a weird one for platinum because it really does mix like arcade shooting and it's sort of open world but not quite as big as you",
            "start": 2415.44
        },
        {
            "text": "uh so I can't really say definitively um it's it's maybe it's sort of a weird one for platinum because it really does mix like arcade shooting and it's sort of open world but not quite as big as you might expect but it's also very narrative driven as well it's like so many different things at once and it they're all kind of very interesting so super interesting CU I played the demo and absolutely loved it yeah yeah the demo is a great slice of gameplay if I'm if I remember the demo what section it's from but it gets into very you know existential questions and things like that and I think that's what people are latching on to especially when it comes to multiple playthroughs okay so I want to give some credit to Greg Miller all right because this topic is my topic you brought I told you I wanted to talk about I've been making a list I said cuz there's so much stuff coming up yeah I'm going find out who's naughty and nice Candy Andy is going to be naughty don't worry about it don't ask",
            "start": 2455.68
        },
        {
            "text": "wanted to talk about I've been making a list I said cuz there's so much stuff coming up yeah I'm going find out who's naughty and nice Candy Andy is going to be naughty don't worry about it don't ask questions welcome to kind of funny what I want to point out is I have 22 games on my list for the rest of the year I want to play right that are still upcoming okay of those I think this is a **** up stat right of those 11 of them come out in August now all that is said you brought up near I want to bring up my list of Shame there are three games I still need to play Andor beat I have Nier on there I don't think I'm going to end up probably even beating Nier but I want to play Nier I want to figure out what's going on I I was excited about it forever and then just came out I am running out of time of course as we talked about in the show so I won't be dead horse Persona 5 I'm 30 hours into two I need to **** at some point bite down and finish it and then I got it I don't I do not feel comfortable",
            "start": 2495.84
        },
        {
            "text": "as we talked about in the show so i won't be beating Persona 5, i'm 30 hours into it, i need to **** at some point bite down and finish it, and then i got Wolfenstein, i don't feel comfortable playing The New Colossus until i've beaten the original Wolfenstein, so i got to set aside a Saturday or whatever a weekend to play through that, then you get into this though Patapon, Tacoma, then then i count the PlayStation 4 release date because this is another one i'm sure actually you've checked your email, you have this code today as well uh Batman: The Telltale Series season two yeah i want to get into that i want to know what i mean i want to get in there i want to play that i want to be all over it because i did you play this one are you a Telltale fan i'm not a big Telltale fan are you a Batman fan at all uh i say i'm not a huge Batman fan i like some of the films okay, fine season one of Batman for Telltale was so good in terms of oh wow you're really making this own",
            "start": 2537.44
        },
        {
            "text": "you a Batman fan at all uh I say I'm not a huge Batman fan I like some of the films okay film that's fine season one of Batman for Telltale was so good in terms of oh wow you're really making this own you're really changing this you're drastically you know uh deviating from what we know as Batman so now to get in there and see what they're going to do with the characters they introduced there let alone the ones they're teasing for this I'm super excited for so for me that's a big deal what's up next for you oh man the next one let's see yeah Hellblade yeah uh Nioh 2 oo did you guys play Nioh original oh yeah we did yeah Nioh 2 seems weird yes it's like 16 bit right or whatever is that the weird thing or is there more to with than that ugly looking yeah yeah purposeful I think uh but that the gameplay I think was really great and it looked fine the first one I like the fact that they're embracing the sort of grotesque visuals like it reminds me of something like Ren & Stimpy in a",
            "start": 2575.96
        },
        {
            "text": "the gameplay i think was really great and it looked fine the first one i like the fact that they're embracing the sort of grotesque visuals like it reminds me of something like ren & stimpy in a way it's not exactly like that but it's that same parallel like just it's odd it's kind of gross and i'm just oddly attracted to that visual style yeah um after that uh Sonic Mania so Sonic Mania is on my list to yeah that is my one that I honestly just counting down the days like I keep bothering Greg I'm like can you ask them for a code there I know the code has to be coming soon like I need to **** play that game man and that's going to be one that I'm planning on 100% platinuming whatever **** you want to call oh yeah if we talk about Crash Bandicoot and Reviving things I think Sonic Mania having seen it in3 played in front of me I haven't had a chance to play it myself watching it it has all the facets of old Sonic like Sonic one and 2 good Sonic and then all these little new bells",
            "start": 2623.12
        },
        {
            "text": "having seen it in3 played in front of me I haven't had a chance to play it myself watching it it has all the facets of old Sonic like Sonic One and 2 good Sonic and then all these little new bells and whistles an original soundtrack it so good like it's I feel like cuz I hated Sonic 3 personally what yeah how why I hated the level design I really yeah I mean two is my favorite I think it's undeniable I think first one is the best I like the first one the most oh no you can't hate on Three's level design and have One I can no he's like I it's a free country I'm allow to do whatever I want man um yeah no but Sonic Mania just looks like I think some of the like the most balanced Sonic I've seen in a long time yeah like it it just knows what it is it's doing that and then it established that base and is just sprinkling little great **** on top great great **** so excited no Sonic Mania I got to play at uh judges week right and for me it was that thing of grow grew up a Sega kid",
            "start": 2662.8
        },
        {
            "text": "that base and is just sprinkling little greatness on top, so excited no Sonic Mania, I got to play at E3 week right, and for me it was that thing of growing up a Sega kid, obviously. Eventually you wake up to the fact they care about you and they hate you and they just want to steal your money and ruin your dreams with the Shadow the Hedgehog and uh it was that thing I remember when Sonic 4 Episode 1 was coming out and I was like oh man I could totally miss Sonic, and I jumped in and played that, I'm like this sucks and I think that soured my opinion so much that it actually affected my nostalgia for Sonic but sitting down and playing Sonic Mania I was like all right this is a lot of fun, this is cool, and there's enough nods in here that to me even a casual Sonic fan, not even a crazy one, thank you, that's for you, oh uh casual Sonic fan if you because I haven't touched it since Genesis or whatever I was like this is cool, this is fun, I want to play",
            "start": 2713.04
        },
        {
            "text": "Sonic fan right now not even a crazy one thank you that's for you oh uh casual Sonic fan if you because I haven't touched it since Genesis or whatever I was like this is cool this is fun I want to wrap myself up in that blanket I'm not crazy enough to say I'm 100% at Platinum oh man I'm I'm all about it you're going to totally get **** you won't be able to do it guarantee no for Sonic \"Sonic Mania\" should be easy there's going to be some time trial **** do this in this amount of time I hope there's not Sonic I mean traditionally they haven't had that sh but the people making this game I think they understand what is so endearing about retro games and how to make that accessible but also super challenging and not in the unfair way that old games used to be yeah uh I think I think Greg might be on something I think this game has some challenges they're going to be out there to challenge and push them Sonic Forces have look fake Sonic Boy I don't I don't know I've 100ed One Two Three & Knuckles CD have you",
            "start": 2752.52
        },
        {
            "text": "Every game we are gonna play this year have some challenges, they're going to be out there to challenge and push them. Sonic Forces has a look that feels fake, I don't know, I've 100'd One Two Three & Knuckles. Have you Googled \"Sonic the Hedgehog\"? Have you seen what comes up? No, I haven't. We should figure that one out. But no, I'm so excited for Mania and I've played it multiple times and it feels perfect, it feels so good because it's by the dude who made all of the ports of the versions - official and two at least, that guy with the awful splash screen that shows up before all his games, it's like this bright orange thing with vector graphics. Oh, I love that as a design nerd, I hate that, that's so funny. But but unfortunately, those games are stuck on mobile which really sucks because obviously playing the Sonic game without a controller is hell, but it's way better because it's widescreen and it fixes a lot of the issues.",
            "start": 2794.88
        },
        {
            "text": "are uh stuck on mobile which really sucks cuz obviously playing the Sonic game without a **** control pad as hell but they're it's way better cuz it's WID screen and they it fixes a lot of the issues that the original Sonic games had but yeah very excited for Mania sharing a release date with Sonic Mania two games I'm very interested in number one city skylines okay which I **** around with a little bit on PC because I'm such a big Sim City nerd but again PC is horrible I don't want to play it so I just shut it down threw it away and then walked away and so then it came to Xbox I'm like maybe I'll get to that and didn't because there's no trophies now it's coming to Playstation 4 now is the time to get serious about it and see what's up with it if you want a really interesting perspective on that game and I'll expansions go to Gamespot read our reviews because we had an actual mayor review them we have a mayor on our freelance team okay from Canada oh wow does that count they got",
            "start": 2838.48
        },
        {
            "text": "on that game and I'll play its expansions go to GameSpot, read our reviews because we had an actual mayor review them; we have a major on our freelance team okay from Canada oh wow does that count? They got like the Prime Minister they got Skylines Rob Ford's in charge though the whole city the whole thing don't take gide on this - Rob Ford's alive if you believe in him so I'm interested in that and then but I'm interested in that and like I really think if it works and it plays the way it played on PC and I can control the controller I'm going to put a lot of hours in that; I bet if it doesn't then I won't. On the same day coming to PlayStation 4 and Vita so you know only care about the Vita version Undertale, yeah Undertale - I've never touched it and all I've heard is this amazing how great this game is; all these things it's a treat it's really quirky and surprising and unusual and funny so that'll become I think a playing game for me for sure of like all right let's see what this all about",
            "start": 2874.64
        },
        {
            "text": "game is all these things it's a treat it's really quirky and surprising and unusual and funny so that'll become I think a playing game for me for sure of like all right let's see what this all about and stash it in there for the next trip we have after August 15th yeah Uncharted The Lost Legacy **** yeah August 22nd sign me up God I can't wait for that okay you I'm not a huge Uncharted guy your yours the we God and you think you can trust his Friday the 13th review ladies and gentlemen I might just be a Small Town Pizza I will play it eventually let's put it what is it about Uncharted that doesn't grab you no uh I don't know I can't put my finger on what doesn't grab me what does grab you what's your favorite game of all time my favorite game of all time uh Final Fantasy Tactics OHP uh Mario & Luigi: Paper Jam (note: corrected to match the actual title) August 29th you're going with uh you're jumping ahead you already yeah no no no you've forgotten the other big game coming on the 22nd Thimbleweed Park oh another",
            "start": 2916.08
        },
        {
            "text": "Mario + Rabbids Kingdom Battle August 29th you're going with uh you're jumping ahead you already yeah no no no you've forgotten the other big game coming on the 22nd Thimbleweed Park oh another game I downloaded to my Xbox One and then never even turned on my Xbox One to play it when's the last time you played Maniac Mansion long time it's been a long long time that's a hard game to revisit and if this is like that the demos I took had a lot of humor in them they were and it wasn't like I traditionally like old Telltale Games right like and like Full Throttle was my first Adventure game I brought it to my house we played it on my computer had a great time you started venturing out and then it was like I hate this genre and then old Telltale were still like that where it's like how does this beer bottle go to that light bulb and turn on the door well let's find out you know what I mean like this is awful so playing through Thimbleweed Park at demos I've",
            "start": 2961.08
        },
        {
            "text": "how does this beer bottle **** go to that light bulb and turn on the door well let's find out you know what I mean like **** this is awful so playing through Thimbleweed Park at demos I've always been like it seems like Ron Gilbert isn't really pushing me to the edge of like sanity here but I want to jump in and see it seemed like it was a fun story it seemed like it was quirky and comedic fair enough coming off Twin Peaks maybe it's a good little yeah exactly right my favorite shirt of 2016 was everyone kind of funny did love the Thimbleweed Park shirt it's really good shirt what does it look like it's it just says thimble like weed Park but it's like gradient yeah but it's a sexy ass gradient like going through it of the colors and I'm like that's all Geto I have so yeah now you jumped you then jumped to Mario + Rabbids Kingdom Battle the 29th that's on there as well I got to give a shout out to my boy Madden Madden on the 25th but are you actually going to",
            "start": 3005.16
        },
        {
            "text": "so yeah now you jumped you then jumped to Mario + Rabbids Kingdom Battle, that's on there as well I got to give a shout out to my boy Madden, Madden on the 25th but are you actually going to get into it, it I'm going to play I'm for sure playing that uh whatever the mode they call I forget their Road to Glory or whatever that whole story mode they have in there is that new this year yeah yeah yeah I want to get in there I want to **** around with that and then I I I have already laid down the gauntlet and I'll do it again ladies and gentlemen if you want to clip this out ever go ahead send it over Bobby Amos at ign.com is a coward and he's afraid of me to come back and play me in Madden and he won't do it again and Fran won't let him cuz IGN is up in their Ivory Tower they're they're they're they're not going to come down here and play with the commer is it kind of funny you think Fran Mirabella III another man who **** up a review when he **** said a 7.9 for Mario Kart",
            "start": 3043.96
        },
        {
            "text": "they're they're not going to come down here and play with the commer is it kind of funny you think Fran Mirabella III another man who **** up a review when he **** said a 7.9 for Mario Kart Double Dash you think he's let Bobby off the leash come over here no no they're both cowards not a chance in hell I'm 99% sure FR will say yeah sure both the whole thing s up there a wrestling unless he's lazy no he wants Bobby just might not want to come I I can see that Bobby hates his job he'll come over you K God I'm kidding loves it he's been there forever Wind Jammers Wind Jammers all right my want to pop in and play it I I know I'm not going to invest too much time in it but D wait until okay so I grew up with this in a movie theater near my house and got into it organically just through my friends and playing it it is it is oh it's so good it's so so so good what what about it so good I know cuz I had never heard of Wind Jammers then comes out there's a Dave Lang joke about it",
            "start": 3083.68
        },
        {
            "text": "my friends and playing it it is it is oh it's so good it's so so so good what what about it so good I know cuz I had never heard of Wind Jammers then comes out there's a Dave Lang joke about it apparently that then comes out and I'm like I don't know what's happening yeah yeah so I mean like Giant Bomb kind of popularized it more recently but it's one of those Neo Geo games right and Neo Geo games back then had super personality very bombastic very loud bright colors and stuff and great energy and this game has superb energy uh so it's like Pong, like tennis but you have these like superhero players and so it's this Dynamic where you're throwing a disc back and forth you can bounce it off walls every character has a different bounce you know Behavior or you can just throw it directly and when the disc comes to you you can either catch it and throw it or you can hit it up in the air and like charge up this power attack and it's this moment of tension when you're waiting for the disc to",
            "start": 3124.84
        },
        {
            "text": "the disc comes to you, you can either catch it and throw it or you can hit it up in the air and like charge up this power attack and it's this moment of tension when you're waiting for the disc to come down, the other person doesn't know if you're going to follow through with that or not or if you're just going to do a regular attack and it's just it's super fast-paced, bombastic, competitive head-to-head action and when the disc keeps going and gets really fast goals happen before you know it and you just feel like **** when you get dunked on, it's really good all right let's get really good at it and then **** Nick up I'm down all right cool for the world championship I think you guys have you ever played it at all no you're in for a treat it's really good all right cool I'm excited I'm excited we got next Yakuza: Kiwami, remake of the original Yakuza did you guys play Zero this last year real briefly my here's my my one my thing is I love Yakuza don't get me wrong I did the run at IGN",
            "start": 3167.2
        },
        {
            "text": "we got next Yakuza: Kiwami, remake of the original Yakuza. Did you guys play Zero this last year, really briefly? My here's my one thing is I love Yakuza, don't get me wrong. I did the run at IGN where I reviewed all the Yuzas, so now it's really hard for me to pop in and like I got a lot of hate on the internet when I played Yakuza Zero and I was like \"more Y is more Yakuza\" and everybody's like \"ah **** you\" and I'm like \"but did you play them all?\" cuz it really is more like... Yakuza, and I've put in a lot of time. Yes, I will say to Zero's credit, the storytelling - I mean it's always just a really dramatic story and like whatever dog looks weird, but the story stuff is actually really good, like despite all the crazy **** they go through these characters actually like sort of mean something at the end and their struggles, and it took me like 70-80 hours to beat zero and that was just going",
            "start": 3201.28
        },
        {
            "text": "like despite all the crazy **** they go through these characters actually like sort of mean something at the end and their struggles and it took me like 70 80 hours to beat Zero and that was just going through the game, that was not actually finishing everything in there um but man just like wonderful personality and now that it's on a next-gen console it really does make a difference cuz Tokyo looked great before, Tokyo looks a lot better now I agree so Kiwami for me cuz then you know that's the remake of one so technically that's the sequel to Zero there you go continue this know what they're doing yeah so my we're jumping around a bit so after Madden comes Mario + Rabbids of course however life grinds to a screeching halt on August 29th not because of Mario + Rabbids because Everybody's Golf is back now if you want to talk about possibly the year of Greg Miller you want to talk about it's my I'm celebrating a decade in this industry this year PlayStation not only brings back Patapon",
            "start": 3245.64
        },
        {
            "text": "golf is back now if you want to talk about possibly the year of Greg Miller you want to talk about it's my I'm celebrating a decade in this industry this year PlayStation not only brings back Patapon they bring back Hot Shots Golf oh come on who we **** kidding you know what I mean this was made to be my year will I die at the end of it maybe maybe this is as good as it gets kind of thing but I'm ex I'm excited for August 29th when this comes out because I'm going to **** do an all day long stream we're we're going to finish the stupid podcast we have to do that suck and everybody hates and then we're going to go in and we're just going to golf all day long Tim we're going to sit here and wear to golf am I am I going to wear a golfing outfit you godamn right I am now I don't want to commit early oh the little weird hat to the side with the the dollop thing on it yeah you know what I'm talking about I know what you're talking uh now you say who am I going to play with am I",
            "start": 3286.96
        },
        {
            "text": "to commit early oh the little weird hat to the side with the the dollop thing on it yeah you know what I'm talking about I know what you're talking uh now you say who am I going to play with am I going to probably play a Shoei probably however is this a return to what was great on Hot Shots PSP from these golf games cuz you remember that was the character customization do I want the crazy x-ray glasses in a coconut bra you're goddamn right I do but I didn't have to be committed to it this of course is what got messed up on the PlayStation 3 and what got messed up on the Vita version on the Vita version do I want to change the color scheme of this outfit no I want to put her in a coconut bra in x-ray glasses can you put sh Yos that's what I'm saying that's why I'm not jumping ahead of myself I need to see this I need to I Joey Noelle was on a call earlier because we talking about like looking down the line we're going to do this stream we don't know how the online works of course I want to come",
            "start": 3325.6
        },
        {
            "text": "to see this I need to I Joey Nova was on a call earlier because we talking about like looking down the line we're going to do this stream we don't know how the online works of course I want to come **** kick the **** out all of you best friends you know what I mean I want to be getting Eagles over there birdies meanwhile **** emit Watkins just hitting off into the he doesn't know what he's doing he he's hitting off into the water I'm over there getting you know yeah you know what it's all about I had a Hot Shots Golf 2 on a demo disc back in the day and I played that demo many many times good good didn't feel the need to buy the game cuz like this is enough you're hor get it having a lot of fun with this I mean I literally played that probably 30 times so you're saying you're better than me at Everybody's Golf when it comes out this is a challenge come on up set up no absolutely no way I'd **** not okay fine fine still don't fully understand golf how a concept see I'll tell",
            "start": 3365.6
        },
        {
            "text": "than me at Everybody's Golf when it comes out, this is a challenge come on up set up no absolutely no way I'd **** not okay fine fine still don't fully understand golf how a concept see I'll tell you I'll tell you what the video games whether it's Mario Golf or Hot Shots Golf, SL everybody's golf now uh they make golf seem real easy and I went to a bachelor party a few decades ago and I played golf and it just not easy and I hated it I just drove the cart you hated it yeah but you got to drive the cart I'm assuming you drank oh yeah maybe you had a cigar yeah I don't know that all happened yeah you know how the bachelor party golf game hat it yeah well I mean like that part well I mean like it's the you get who wants to get out there and just find out you're impotent you know what I mean I'm over there I'm I went three holes I'm like nine plus on every one of them I'm like yeah you know what I'm good and all these other idiots they had been playing golf their whole life three holes I if",
            "start": 3402.44
        },
        {
            "text": "over there I'm I went three holes I'm like nine plus on every one of them I'm like yeah you know what I'm good and all these other idiots they had been playing golf their whole life three holes I if you're impotent but oh golf right there you go hey um next up for me is so this this is where things get interesting um I I got to give a shout out to Knack too I'm not going to play it oh God but I want you're not going to play it you want to give a shout out to it but you're not going to play it knack is God you got to just remember that if na 2 gets really good reviews I will play it and I think there's a chance I played it in3 and I'm like wow this isn't **** so hey n out of 10 isn't **** isn't **** no I think that they they could have something good if they really worked hard on it and I don't know this is the year of the platformer so we'll see but that's the problem is like I I don't want to spend time playing that too when I have Mario I have I do have crash I have Sonic",
            "start": 3438.76
        },
        {
            "text": "and I don't know this is the year of the platformer so we'll see but that's the problem is like I I don't want to spend time playing that too when I have Mario I have I do have Crash I have Sonic I have all I'm saying of all the games you would but really The Metroid: Samus Returns on the 3DS September 15th yeah I I really hope the the story is confused and not accurate in regards to the Hard Mode being locked to an amiibo because that is **** I'm sure it is though I don't see them so they they put out info multiple journalists have followed up with them and they have not given a they've responded send go to our Facebook page yes they've responded but they've not actually like said one way or the other so that basically confirms it in my mind 100% Metro 2033 one of the few Metro games I didn't beat yes it is a weird one I I came to it only maybe a decade ago which was still a long time after it came out the ratio of Samus to the rest of the screen absurd have you seen this it's crazy",
            "start": 3476.68
        },
        {
            "text": "\"Beat yes it is a weird one. I came to it only maybe a decade ago, which was still a long time after it came out. The ratio of Samus to the rest of the screen is absurd. Have you seen this? It's crazy. Yeah, it's a really hard game I think to play if you didn't uh play when it came out. So yes, it's a perfect example of a game that should be remade. But it's also a little weird because we had that fan remake earlier this year that everyone loved and uh so now we get to kind of compare what MercurySteam and Nintendo are doing alongside that which will be interesting. I don't like the graphic style one bit of the new one or the remake of the 3DS one. Sorry, they're both yeah yeah. I just I don't like there's like this 3DS look that games have and it just I just hate it. It's like that 2.5D everything is super jaggy lines everything looks kind of blurry. I just don't like it at all and I think a lot of it has to do with just the 3DS's screen especially when you plan on XL, the resolution is just shitty.\"",
            "start": 3519.6
        },
        {
            "text": "super jaggy lines everything looks kind of blurry I just don't like it at all and I think a lot of it has to do with just the 3DS's screen especially when you plan on XL the resolution is just shitty it's yeah it's super low res and I think that's why there's no anti aliasing because they don't necessarily need it and it wouldn't be that effective be too expensive on the hardware but what I want to know is why isn't this coming out on switch they need to sell those 3DS's out there and they're like we got to give them something to play yeah but yeah hopefully a few few months from now they say hey guess what it's coming to switch six months going forward a little bit one of the audience questions for the day is one second this isn't their moment of the show don't give it to them Giovanni asked what are the odds of getting a switch version of Metroid: Samus Returns I say zero wow I I don't I think if you look at Xenoblade Chronicles as an example of a game that you never",
            "start": 3567.08
        },
        {
            "text": "them Greg asked what are the odds of getting a Switch version of Metroid: Samus Returns? I say zero, wow. I don't... I think if you look at Xenoblade Chronicles as an example of a game that you never would have expected to get ported somewhere and that went opposite - that went from Wii to portable. If that **** happened, Fire Emblem Warriors coming out on both 3DS and Switch, I wouldn't put it past Nintendo. And they... it was a couple years ago back when Aonuma was still running things, one of the things they were working on was a way to make games portable across platforms, that was like one of their big messages at an Investor's call one year. So have we really seen that come to fruition? Not necessarily. The Fire Emblem Warriors game might be one example, hopefully this is another example of how that works. Yeah, I just doubt it. I think that them putting it on 3DS is a message that they're still supporting the 3DS... yeah but give right to give... yeah but I just I think that once time I feel like there's a",
            "start": 3607.44
        },
        {
            "text": "yeah I just doubt it I think that them putting it on 3DS is a message that they're still supporting the 3DS yeah but give right to give yeah but I just I think that once time I feel like there's a higher chance of us getting a Metroid Prime Trilogy on Switch than there is of this being ported and I don't think that's likely right okay I don't know I'm keeping my fingers crossed I'm hopeful. Mar's Capcom Infinite comes out on September 19th and I I love that franchise but just to pop in and play I I'm really bummed with how it seems like it's not going to be good at all yeah um Cuphead, hell yes finally finally put it into my veins again you're the platformer like this is we're getting so much quality I hope the Cuphead hits that I hope that the platforming is more fun than it was when I played it like when I played it the first time was just Boss Rush mode and I was like this is awesome I love how trial and error it is that's all it was at first and then we bitched",
            "start": 3649.12
        },
        {
            "text": "it was when i played it like when i played it the first time was just Boss Rush mode and i was like this is awesome i love how trial and error it is that's all it was at first and then we bitched and complained we were like oh i wish there was platforming and then the next D3 there was and it was like this sucks this is not fun to play and it doesn't feel right uh this game was obviously designed to be a Boss Rush mode and so i hope that in the time since we've seen it which granted for me has now about been that wasn't even this E3 it was last E3 that i played the platform and stuff so hopefully they tighten things up and i can i can see them fixing those problems i can see this ended up being really good you both disappointed me my f for two reasons my final August game August 31st episode one life is strange before the storm let's go Chloe what is wrong you man she said hello you're supposed to love her she did that's how it's supposed to be yeah i want to see what they got",
            "start": 3699.32
        },
        {
            "text": "one Life is Strange: Before the Storm let's go Chloe what is up you man she said help you're supposed to love her she did that's how it's supposed to be yeah I want to see what they got it's Prey or whatever let's see what's up and then September 6th Destiny 2 come on where are my Guardians at man okay so I missed Destiny 1 and the whole thing was yes I'll be excited for Destiny 2 because I want to get in on the ground level and be a part of that excitement and enjoy the experience yeah the game reminds me of Phantasy Star Online which I played to death on Dreamcast and I've been waiting for something like that again the beta has come and gone and I haven't played it and I said to myself when I was making this list today maybe you don't care about Destiny 2 the way you think you do okay see for me it was a very similar thing where Destiny 1 hit and I played the beta and I was like oh wait this is actually cool Destiny vanilla's there jumped into it had a great",
            "start": 3739.52
        },
        {
            "text": "you do okay see for me it was a very similar thing where Destiny 1 hit and I played the beta and I was like oh wait **** this is actually cool Destiny vanilla's there jumped into it had a great time took a weekend or a week off or whatever and came back and everybody's already done the raid and blah blah I was like uh this isn't funny for me anymore I left came back a little bit for the expansion stuff didn't really i' I've never been the Destiny guy but I think part of that was the fact that in our Core Group when even I was at IGN obviously when it launched there there weren't in my I mean like don't get me wrong I love Destiny and stuff like that but like and I love Alfred Angelo but we're not like besties or anything the fact that Andy is like I'm in and Andrea is I'm in like Andrea is super into Destiny right thanks so much she's super into Destiny and so to have this group of there's three people right or two other people there that makes this you know a group of three that like that's",
            "start": 3781.0
        },
        {
            "text": "into Destiny right thanks so much she's super into Destiny and so to have this group of there's three people right or two other people there that makes this you know a group of three that like that's what I want I want a group of like even if I popped out and came back in all right we've done a raid but let's have some fun we're still doing I'm like that's cool and like the idea of like on launch date the stream I want to do there is dual screen Andy and I sitting here maybe even get a triple one get Andrea in here as well and just **** play Destiny all day like that sounds awesome if that works you know the other problem though we have all these games we want to play how the hell are you going to play Destiny like in Earnest I know well here's the way I sh the way I shake it out of it right is if I can somehow keep up with these August games which I can of course but if I can keep up with August Destiny is my only September game it's the only game I have listed for September",
            "start": 3820.76
        },
        {
            "text": "right is if I can somehow keep up with these August games which I can of course but if I can keep up with August Destiny is my only September game it's the only game I have listed for September right now maybe I've missed something maybe I'm forgetting something please shout it out but like Cuphead I totally I know that's a September game that's cool not for me but it's like I feel like Life is Strange is a one is on the 31st right that's done in a day Mario is going to be a switch game so it's going to be on the go for me it's not really like I'm going to be coming home and be addicted to it I think that way I think I'll be **** around on the off time Everybody's Golf will be the rest of my life until there's Everybody's Golf 2 on PlayStation 4 I'll be playing that so like you start dialing backwards Destiny gets a pretty good gap uh wide I think and it is that thing of like to Peter I know we we know each other professionally we like each other remember I'm full of",
            "start": 3854.96
        },
        {
            "text": "Every Game We Are Gonna Play This Year - Kinda Funny Gamescast Ep. 129 starts dialing backwards Destiny gets a pretty good gap, uh, wide I think there and it is that thing of like to Peter Brown I know we we know each other professionally we like each other remember I'm full of **** I will cut and run on any of these games at any point you know what I mean it's such a great thing of like I the Persona thing I've been talking about forever that I got to play Persona 5 and I was like, \"This week I'm gonna do it\" and I sat down like I don't enjoy this and I played like 90 hours of Marvel's Avengers over the weekend like that's how it's going to go where like I don't think the best part when you've been talking about games throughout this thing and I can feel it and see it in you of like where we used to be the same person of like oh I missed that because I was working you were working on something else you were reviewing something else the next game came in for a review right and like we at Kinda Funny has been great of like this it's",
            "start": 3892.4
        },
        {
            "text": "that because I was working you were working on something else you were reviewing something else the next game came in for a review right and like we at Kinda Funny has been great of like this it's super weird of like I don't like this game I can stop playing oh like in in this one moment this game isn't hitting what I want it to hit I can try the other game I'm thinking of you know what I mean like because I remember that of like no **** it I have an embargo to hit yeah I know right like I like this to begin with and now I don't and I want to play other thing everybody else playing like if Destiny 2 hit and we're all in like that can be my night for a month or whatever and not have it be a big deal which is weird that's fair that's totally fair I guess looking at the schedule you're right there is a pretty big gap yeah um because the next thing I have on my list is maybe unusual Star Fox 2 the SNES classic Mini that was my next thing too have you played Star Fox 2 before I've played",
            "start": 3926.68
        },
        {
            "text": "there is a pretty big gap yeah um because the next thing I have on my list is maybe unusual Star Fox 2, the SNES Classic Mini that was my next thing too. Have you played Star Fox 2 before? I've played the prototype set of leaks that are online in ROM form and it's not a great game no it's not it's fine um but I'd love to see what they have actual I'm interested in that too but I just is Star Fox 2 all of my least favorite things about the Star Fox franchise and that is keeping in mind all of the the horrible motion controls and the getting out of the the cockpit stuff that Assault had like the Command game on DS was essentially the spiritual successor to it. Rem things and I it just did not like that at all like it made it way more like a tactical game and like this isn't what I like about Star Fox no but when you think about and this is something I think about a lot is old video games, Super Nintendo is one of people's you know first four Rays",
            "start": 3962.04
        },
        {
            "text": "game and like this isn't what I like about Star Fox, no but when you think about and this is something I think about a lot is old video games. The Super Nintendo is one of people's first 3D console gaming experiences, I mean it - you look at even Super Mario World, Super Mario Kart - 2D graphics, but that's a 3D racing game, you know? I mean Star Fox 2 is sort of like the farthest they could go with that on the Super Nintendo and we missed out, we didn't really get to see what the Super Nintendo was capable of. Yeah, which is what this is - I mean it's not a genuine Super Nintendo but it was basically finished. It's such an interesting game, but I think another thing too is like I enjoyed from what I played Star Fox one way more than Star Fox 2 and I would never want to play Star Fox one over Star Fox 64, no you know? So it's like yeah it'll be a fun little history lesson to look at but I don't know. But I am very excited to get my hands on the",
            "start": 4011.84
        },
        {
            "text": "would never want to play Star Fox One over Star Fox 64, no you know so it's like yeah it'll be a fun little like history lesson to look at but I don't know but I am very excited to get my hands on the SNES Classic and again I don't think that there's going to be any game there that I'm like excited to play through again because I've either played through it again 10 times on Virtual Consoles, Get Excited Every Time You Play Super Metroid But That's True That That Is True but I'm not going to beat the game you know what I mean I'm not going to sit there and play through it all again I just did last week um that's that's what I'm saying like there just random I've done that so often and I've been able to so often and it's like knowing that eventually I'm going to get them all on the Switch I can wait for that but I I'm excited just to kind of pop in and just see what else they got for me there I was celebrating cuz I agree it's all coming to Switch one day and I'm very I'm very big fan of",
            "start": 4052.4
        },
        {
            "text": "wait for that but I'm excited just to kind of pop in and just see what else they got for me there I was celebrating cuz I agree it's all coming to switch one day and I'm very big fan of that I hope it all comes South Park: The Fractured But Whole October 17th there was someone at work I will not name names who only a week ago or like two weeks ago was like oh fractured butthole oh my god oh I got it someone I respect who's very smart and if you're watching you're probably not but initials KP no no so here's the thing Destiny 2, 96 my next two games are on the 17th number one WWE I like I just like **** around with that it'll be hoping the switch version comes out day and date do you think it will I can't wait to see what a garbage fire the switch version is **** God I liked you a lot for a reason Peter and yes yes stop falling for this stop this **** why it doesn't need to be I've told you it doesn't need to be the video ver this has been a this has been a long running",
            "start": 4086.44
        },
        {
            "text": "a lot for a reason Peter Brown and yes yes stop falling for this stop this **** why it doesn't need to be I've told you it doesn't need to be the video version this has been a this has been a long running Kinda Funny Games daily thing where people like no no no like pair on NVC got this quote from 2K that it's going to be feature complete and it's going to be that and I'm like I understand that let's wait and play it cuz I have just been as a WWE fan so used to hey I'm reviewing every **** version of the game great and here's the Wii version and I put it in and the Arena's empty and it totally sucks and all like if it isn't like that I mean I'm hoping like the best case scenario is 2K comes in one day and they're like hey here it is and drops it to me like **** go and I play it I'm like **** I was wrong like goddamn right you were they turn on the camera and I'm like I was wrong I don't want to be that cuz I we talked about it before of like",
            "start": 4134.04
        },
        {
            "text": "I was wrong, like goddamn right you were. They turn on the camera and I'm like, \"I was wrong.\" I want to be wrong; I don't want to be that guy. We talked about it before, like the idea of it being great on the Switch, and us all having that, and we just mess around every morning, bringing our creative characters in and do that. I'm 1,000% in; I just can't see it. I just can't see what that engine would tell you that I mean, you guys are making very strong points, and you're right. The difference is this is the Switch; this isn't the Wii; this isn't the Vita; this isn't the PSP. I'm going to say there's less of a gap because things have sort of plateaued a bit in terms of like yeah, textures and lighting that that'll make a difference. But the Wii was so underpowered compared to like PS3 and 360. But I just, I don't know, man; like two, the WWE games seem to always have issues year to year that could have been solved very easily. I just don't have",
            "start": 4176.88
        },
        {
            "text": "so underpowered compared to the PS3 and 360, but I just don't know, man. The WWE games seem to always have issues year to year that could've been solved very easily. I just don't have faith that they can really capitalize on this. You're making great points; you're making a great point. I just want to believe, and I feel like this is going to be make or break. And if it does come out and sucks, they're not going to fix it next year, you know? When you look at it now, the things that leave me believing you guys are totally right is FIFA, and um, what was the other game that third-party game that's announced for all of them on Switch? That uh, is like going to be the weird toned-down version. I don't know; FIFA is the one that Danny played; he said it feels, I mean looks a little bit worse but it plays well. Like FIFA is actually mechanically fine, right? Yeah, but it's a lesser version of okay, okay, yeah, yeah, there was one other one, I just forgot what it was but",
            "start": 4214.04
        },
        {
            "text": "a little bit worse but it plays well like FIFA is actually mechanically it's fine right yeah but it's it's a lesser version of okay okay yeah yeah there was one other one I I forgot what it was but it's just like yeah so maybe they'll do that but it's just like what I I just feel like looking at these wrestling games I'm like it doesn't need to it should be scalable it should be able to come on the switch and the PS4 and be fine but no it can't no it I mean yes it should because all they should ever do is making no mercy again or WrestleMania 2000 and make that look awesome and HD and high quality but that was made by company that was well I know but I mean like come on it's not that hard to rip off that entire thing you know what I mean my thing is that the whole hook to WWE 2K whatever and before it Smackdown and all that jazz is the fact that it was supposed to look as real as possible and have the hair that bounce around yeah yeah this is their wrestling Sim",
            "start": 4256.24
        },
        {
            "text": "2K whatever, and before it SmackDown and all that jazz is the fact that it was supposed to look as real as possible and have the hair bounce around, yeah **** yeah, this is their wrestling sim, this is their Madden, and it would be like, \"Hey, we're putting Madden over here,\" and it's like, \"Hey, well, EXA, yeah, exactly.\" They're not hitting it because guess what, uncanny valley? You can't make real wrestlers and all this stuff look real, so **** make it look like a cartoon. Have no one listen to Greg Miller except for Patreon and now Everybody's Golf, but no big deal, you're listening, thank you very much. Now what I want to do is also on the 17th I have South Park on there of course, but as I said, add3, and you're my witness, as you know, let's see if it actually comes out, yeah, cuz I was the first person ever to predict, and I'm just throwing that out there, it's **** hyperbole, but I from the get-go when they announced their original release date, I'm like no way H, and then they push this date, I'm like",
            "start": 4293.6
        },
        {
            "text": "Every time they pre-announced and I'm just throwing that out there, it's hyperbole, but from the get-go when they announced their original release date, I was like no way. And then they pushed this date back, and I'm like, well, this is exactly what they did before. They punted it out, and we'll see. You're jumping ahead of some pretty heavy hitters here. Uh, South Park, before South Park, yeah, okay, who else you got? Evil Within 2, Grand Turismo Sport, Middle Earth: Shadow of War. Well, sure, if you're a huge loser, those are games you want to play. Which ones are those? Are you excited about them? I'm going to forget all those for now. Oh, they're on his list; I'm sure they're on my list. But before that though is Battle Chasers: Night War, which is a game that has kind of flown under the radar for a lot of people. Joe Madureira, yes, yes, I played this week. It's a pretty cool RPG that looks great and is just... it's going to be a PC RPG that's going to come",
            "start": 4331.08
        },
        {
            "text": "of flown under the radar for a lot of people Joe Madera yes yes I played this week it's a pretty cool RPG that looks great and is just it it's going to be it's a it's a PC RPG that's going to come out on switch it's not going to be any lesser it's got great art style interesting combat uh good dungeon crawling and it's made by the people who made Darksiders yeah Joe Madera man's awesome man yeah and and I did play this at judges week and I played it on PC but on switch I could actually see and let me for a second put down the Greg Persona of like I hate PC like I was playing I'm like oh this seems like a giant rig running this like simple game I could totally see that on switch being like oh this is a great RPG I'm really enjoying this yeah that would be cool um but to go back to the list of stuff that I sort of ran off uh middle earth uh shadow of war is definitely introducing some real depth to a game that was already pretty deep with the nesis system and you get to",
            "start": 4369.88
        },
        {
            "text": "stuff that I sort of ran off uh middle of Mordor uh Shadow of War is definitely introducing some real depth to a game that was already pretty deep with the Nemesis system and you get to carry over your nemesis from the first game now I didn't know that that's cool that's that's really freaking cool I think yeah Lord of the Rings guy so yeah that was my thing and me neither like I I I jumped into the original one I was like oh cool like Troy's in it I want to do that and the systems are cool and Nemesis is cool but then they're like oh yeah this was originally going to be a Batman system you're like oh no that's way cooler **** like that was my thing of just like I don't like the universe so it's like respect what you're doing jumped in judge week and played like because it's like now take down the base tear on the walls get people on your side I was like that's an addition to all the other things yeah exactly and I'm like yeah this is like super cool super deep I can",
            "start": 4409.88
        },
        {
            "text": "like now take down the base tear on the walls get people on your side I was like that's an addition to all the other things yeah exactly and I'm like yeah this is like super cool super deep I can understand what Peter said yeah it's ambitious I think that's why I'm I'm super curious about it um The Evil Within 2 the first game had a lot of flaws right the second one I think maybe they had a chance to learn from that first game and look at where Bethesda is now look at where they were a few years ago right they've got new found confidence they've learned a lot they know how to work with their different Studios to make games that sort of fit this mold if The Evil Within 2 can do that that that'll be pretty special but The Evil Within is one of those games that I I'm almost sure is going to be very very good I just looking at this year I'm like I don't know when I'm actually going to have time to to play it yeah well I have to yes see yeah The Evil Within one one passed me by where was that thing I was",
            "start": 4447.56
        },
        {
            "text": "good I just looking at this year I'm like I don't know when I'm actually going to have time to play it yeah well I have to yes see yeah Evil within one passed me by where it was that thing I was when I saw it for the first time I remember being like this game looks bad no I I didn't like that game yeah but I have I have high hopes for two yeah uh Gran Turismo Sport I don't know do you guys like Sim racing games The C-Dog does he's not there yeah is Claing the only thing is I'm very excited to pop into the VR and see what they do with it did you do that with Drive Club at all uh was it Drive Club yep yes okay cool yeah I did and it's it's fine but I while I was playing I kept thinking like what would Gran Turismo be Gran Turismo would be convoluted for its own sake up its own ass with its style and design I mean those games are so odd and I I just I can't believe this one's coming out already Gran Turismo 6 really sucked five was amazing on PS3 6 took microtransactions",
            "start": 4483.76
        },
        {
            "text": "ass with its style and design I mean those games are so odd and I I just I can't believe this one's coming out already Gran Turismo 6 really sucked five was amazing on PS3 6 took microtransactions to a level that is totally unnecessary I'm hoping this is like the about face the 180 for them where they really turn it into something I don't know if it's going to topple Forza Forza is just everybody who loves racing loves Forza yeah exactly and I don't think everyone who loves racing loves Gran Turismo 100% yeah we'll see well it's crazy to think about like that that you know on the PS2 era that was like the bestselling PlayStation franchise like everyone loved Gran Turismo 4 is an amazing game it's so good three was fine but four is just like it nailed that original Grand Turismo Vision yeah uh five kind of tiptoed into like a new era well that was the thing when we started moving to the PS3 generation that's when it started becoming a joke like well the game's taking forever so here's",
            "start": 4529.96
        },
        {
            "text": "Uh, five kind of tiptoed into like a new era well that was the thing when we started moving to the PS3 generation that's when it started becoming a joke like well the game's taking forever so here's prologue like what the **** yeah yeah uh but then at the end of the month uh Super Mario Odyssey yeah well I mean that's 27th all right yeah I'll walk out if it's not another one I'm I want to 100% that game like I I will I didn't know where you were going with that oh no no I want to play it but there's going to be so many other things coming up no no no no no dude I mean that that's definitely like I'm naming a whole bunch of games but that to me is the the one that I'm I will drop everything for I **** love Mario so much you have tried it already Super Smash Bros. Ultimate and and to be honest with you as much as I love it like I'm not like infatuated with it but I also wasn't infatuated with The Legend of Zelda: Breath of the Wild when I played Super Smash Bros. Ultimate so I I'm actually excited that I wasn't just like obsessed with it playing",
            "start": 4571.88
        },
        {
            "text": "as I love it, like I'm not in love with it, but I also wasn't infatuated with Breath of the Wild when I played it at AT3 so I'm actually excited that I wasn't just like obsessed with it playing it because I feel like it has room to wow me. Yeah, I really hope that they have enough diversity in terms of you know the worlds that they offer because right now it's a sort of open-ended thing like oh in Hyrule there are all these different shrines to find right but I don't want it to just be Hyrule and that desert with crystals in the jungle. I don't want it to be like just five worlds, I need I think we've seen there were levels in Super Mario Sunshine, seven Days to Die if you count uh one of the world that didn't have all the stars and then there was 14 and a half in Mario 64 so if we can get up to that level but I even want more than that right like I want to get up there to like get more. Yeah, I think Nintendo certainly knows if you look at Breath of the Wild I think it's an",
            "start": 4612.64
        },
        {
            "text": "get up to that level but I even want more than that right like I want get up there to like get more yeah I I think Nintendo certainly knows if you look at Breath of the Wild I think it it's an example of maybe a a more mature Nintendo in terms of understanding like what it needs what they need to do to succeed and differentiate themselves from everybody else um and Koji (corrected from \"kuis\") is the same guy who ran the Breath of the Wild team from the outside you know at the executive level he is running the Mario team at the executive level I have to imagine he is also like we need to make sure that people can play this game for 50 hours 60 hours 70 hours like that has to be the case and I believe that it will be because even looking at games like Super Mario 3D World (corrected from \"3D world\") that I know are uh very divisive when it comes to people's opinion on it and whether they think it's good or bad it was great it's good no yeah it's it's fantastic I think and I think that the only reason people don't like it is because it's not",
            "start": 4657.16
        },
        {
            "text": "to people's opinion on it and whether they think it's good or bad, it was great, it's good, no, yeah, it's it's fantastic, I think, and I think that the only reason people don't like it is because it's not open world and they're comparing it to Super Mario 64 in a way that it's like unreasonable, it's a different type of game, yeah. And for me, I thought that what New Super Mario Bros. U Deluxe did best was it had so many levels, so much challenge, so much just varied gameplay, the multiplayer and all that. Remember getting the crown obviously though the multiplayer is probably the worst thing going for the game when you're trying to play it single player because a lot of design was based around being open enough to allow four people so it felt kind of empty when you're just one person running through um but once you beat the game and it opened up all the challenge levels those are some of my favorite levels in Mario history and the amount that there was the amount of postgame content there was, that to me I'm like all",
            "start": 4700.32
        },
        {
            "text": "the game and it opened up all the challenge levels those are some of my favorite levels in Mario history and the amount that there was the amount of postgame content there was that to me I'm like alright for an open world Mario game there better be a butt ton of content and seeing the amount of moons in this game in Super Mario Odyssey uh yeah yeah I think I think it's I think you're right yeah even in the 15 minute less play we doing we're knocking those things off left and right and granted that might be one of the earlier stages but like that just shows to me like there is so much content in this game because there's not going to be six of those per level there's going to be 30 50 of those per level totally but I but I just want to make sure that I'm not being stuck in just that one spot yeah like I was in New Donk City for about an hour and I had a lot of fun it was great like I discovered all these little things like oh I can possess a human who's you know driving a",
            "start": 4742.96
        },
        {
            "text": "that one spot yeah like I was in New York City for about an hour and I had a lot of fun it was great like I discovered all these little things like oh I can possess a human who's you know driving a remote controlled car and I can become the car and like all these little things cute there was some side quests even but at the same time like it is so much about the diversity of what you're doing and where you're doing it I I really hope that there's a lot of that yeah and it's not just 20 hours in New York City 20 hours in this other place and you know I'm saying same day of course we already talked about Wolfenstein to that's on there for me and then the one I this is the first game I have on there that is very much like excited for it want to see where it's going don't know if I'll play it on really St where I'll play it is Assassin's Creed Origins I have no interest I I like Assassin's Creed I've taken time off you know what I mean like I just they took time off and then even before that",
            "start": 4780.08
        },
        {
            "text": "really St where I'll play it is Assassin's Creed Origins. I have no interest, I like Assassin's Creed, I've taken time off, you know what I mean? Like, they took time off, and then even before that, I didn't play much of Unity and Syndicate, so it's like to come in Egypt looks cool, the world looks cool, I'm interested to see where they go. But that strikes me very much as maybe like in December on break, I'll play that or January when we come back, I'll be playing it, but I don't know. Yeah, I haven't seen enough evidence yet, like the setting, yeah, there's potential, yeah. When I played Assassin's Creed III, I was like all right, cool, this is more Assassin's Creed, that's what I like. But then it was also the thing where I was super depressed about the Pirate game, what's the name of it? Oh, AC4 no, Ubisoft's Pirate game, that we're all like, \"Oh my God, they're making an Assassin's Creed\" and I'm on the ship, that's weird as **** but I was like, oh that looks great why.",
            "start": 4818.48
        },
        {
            "text": "Every game we are gonna play this year - Kinda Funny Gamescast Ep. 129, Greg Miller good, stop being a ****, uh do you guys have anything else left on list oh I'm sure do do you not well so for me I can run it out pretty quickly because just throughout the rest of the year there's nothing else that I'm super excited for so Wolfenstein 2 that's on my list of like it might get cut based on time uh Fire Emblem Warriors I'm going to pop in and see what it's about Sonic Forces is same thing I don't think it's going to be good but on switch it might be a fun you make character so there I'm not ready I don't want to do that **** if Odyssey comes this year which I doubt it will um there's that uh but besides that for me boiling all this down the three games I'm",
            "start": 4853.8
        },
        {
            "text": "make character so there I'm not ready I don't want to do that **** if ory comes this year which I doubt it will um there's that uh but besides that for me boiling all this down the three games I'm most excited to play this year Sonic Mania Mario Odyssey Battlefront too ah November 17 specifically oh yeah that's that's that's why it's on there too Kevin and I had a great time playing Battlefront uh multiplayer when it originally came out but the idea of number one that Mitch wrote the story number two that Janine are friends in it but more importantly hey what happens when the Death Star blows up and you're a bad guy like yeah I want to play that story what the **** is happening all about it loved Battlefield 1's single player last year battle huh Battlefront Battlefield okay Battlefield one just making sure we're jump last year loved that loved Star Wars Battlefront for what barebone **** there was it's authentically Star Wars and I love that you combine those two things",
            "start": 4899.32
        },
        {
            "text": "one just making sure we're jumping last year loved that loved Star Wars Battlefront for what barebone **** there was it's authentically Star Wars and I love that you combine those two things together sign me the **** up I am so stoked for this game do you know uh who likes Battlefield one quite a bit is the director of Xenoblade Chronicles 2 and I'm not joking that's super random I was talking to him at E3 and he's he was one of the guys behind Chrono Trigger he's been in this game a long time right really yeah and and so I was talking to him and just sort of like like you have this crazy Legacy you're still making RPGs like how do you still feel about the genre at large and he's like well I make them but I don't actually like to play RPGs I was like what do you like to play he wasted not even a second he's like Battlefield one damn that is that is the game he plays the most the the the most Japanese developer in the world plays Battlefield 1 and and likes VR awesome yeah but",
            "start": 4941.32
        },
        {
            "text": "even a second he's like Battlefield One, damn that is that is the game he plays the most, the most Japanese developer in the world plays Battlefield One and and likes VR awesome yeah but that is the last game on my list is Yousei Ponyo Chronicles 2 oh nice do you think it happens this year oh absolutely really yeah cuz man I mean they're sticking to it they're sticking to Holiday 2017 and I think that it's weird that they haven't put an actual date to it cuz they have for everything else Fire Emblem Warriors is another one too for me where I'm like why isn't there a date for this yet yeah I don't know they might be trying to figure out like okay do we do special editions you know do we do a simultaneous release um simultaneous releases are kind of a big deal now when it comes to these sort of story-driven games like we saw a minor delay between Japan and America for actually no sorry it was like eight months for Persona 5 was mind yeah it was a big delay but that's like the biggest in",
            "start": 4981.48
        },
        {
            "text": "of story-driven games like we saw a minor delay between Japan and America for actually no sorry it was like eight months for Persona 5 was mind yeah it was a big delay but that's like the biggest in memory uh that I can recall but like Final Fantasy XV was day and date I feel like they're waiting to figure out okay is the English localization done can we say firmly that's gonna come out at this time yes um so I think it'll happen this year I really do yeah in both America and Japan yeah day and date man that's lofty the thing is I I that could totally be true when E3 was coming along and things were happening I was like one of my predictions was uh like if they mentioned that this game is coming out in 2017 it is going to but that I wouldn't be shocked if it moved I mean way through the year to say that for what it's a it's a pillar for them right I mean it's a pretty big game for a lot of people I'd be shocked if they didn't follow through with that yeah they could have left it out they",
            "start": 5023.4
        },
        {
            "text": "to say that for what it's a it's a pillar for them right I mean it's a pretty big game for a lot of people I'd be shocked if they didn't fall through with that yeah they could have left it out they could have not said anything about it they could have just been like it's right yeah so we'll see what do you got Greg all right so there's three games left on my list outside of Battlefront, Battlefront we've all confirmed Battlefront is great November 17th these are ones that the first one I think is one I'll either be totally hooked and beat it or just bounce out second one I think I'm going to long play it and play it longer after however both come with caveats it's Call of Duty: World War II and then Lego Marvel Super Heroes 2, both Call of Duty of course I hosted the panel so if you want to take my uh you know opinion with a grain of salt go ahead, Lego Marvel I hosted the panel and we're in the game so like I'm just a heads up if you don't want to listen to us on those",
            "start": 5064.44
        },
        {
            "text": "\"So if you want to take my uh, you know opinion with a grain of salt, go ahead. Lego Marvel I hosted the panel and we're in the game, so like I'm just a heads up if you don't want to listen to us on those either way. Call of Duty - every Call of Duty that comes out, I usually am like, 'man, the story looks really interesting' and then I jump in and I'm like, 'like Infinite Warfare last year, I was like man, that story sounds really cool' and I did a panel for them too and I started playing, playing and I got into this and I was like, you're all being too bro-y, like I just can't deal with like yes, the Admiral generator - I hate that **** generator, there's just a generator with all these stripes on it of like yeah but like World War II, it strikes me the way they're setting it up in a way the same way I even though I didn't fall in love with like you did Tim of Battlefield 1, of like hey here is a here are multiple for Battlefield one grounded stories, hey here's this cast of characters in World War II like Band of\"",
            "start": 5104.72
        },
        {
            "text": "Didn't fall in love with Battlefield 1 like you did, Tim. Of like, here are multiple stories for Battlefield one, grounded stories. Hey, here's this cast of characters in World War II, like Band of Brothers, which I enjoyed. And hey, you're going through this one mission, it's not let's go kill Hitler; it's these guys for a year or a year and a half with them, or maybe even nine months, you're with one group, and you're going, and I'm like, that gets me excited - all right, cool, tell me a story about those people. Let's go through and do this, and I know eventually it's going to get very... we're shooting people, and that's what I'm doing, and there's a monster closet or whatever, but it's still sounds like there's something there that interests me, and I want to give it a shot, and then Lego Marvel - I just love Lego games, so I'll do it. But it's the same thing too, of like you know, I've hopefully found my new love for Marvel, the way I... you know, fostered it.",
            "start": 5144.4
        },
        {
            "text": "Every game we are gonna play this year, and then Lego Marvel. I just love Lego games, so I'll do it. But it's the same thing too - like you know, I've hopefully now found my new love of Marvel, the way I foster Spider-Gwen on the cover. Come on, I'll be deeper into that final game on the list, uh, A Hat in Time, which just has a fall release date at some point. This is the indie I talked about in one of uh the videos I did uh during E3, that was called like uh the five best things I've played at E3 so far, where it was like everything from Judge's Week and this is a game where the guy I sat down next to, the guy handed me the controller - like all right, so we're uh trying to be Mario 64 and I was like that's a no, oh this is really cool. This game has been in development for a long time and it was just the other day, like two days ago, that they said yeah it's coming out, yep, yeah - PlayStation 4, PC, Xbox One, I think that was Judge's Week, yeah, that's really surprising, that's cool for them. It was",
            "start": 5180.16
        },
        {
            "text": "just the other day like two days ago that they said yeah it's coming out yep yeah PlayStation 4 PC Xbox one I think that was that judges week yeah that's really surprising that's cool for them it was just PC at the time yeah yeah and it was well Nathan Vella from Supergiant posted that hey this is the Indie night you went there and played a Million Indies or whatever right you have that weird like not the weird the really nice sort of like apartment rented out no no I was a thing one year where he had like an apartment with like TPS like set up with uh Hidetaka Miyazaki showing off ten teens I think it was or something else anyway no this is just at a bar it was great okay yeah no no but yeah and then hat and time plays a little bit like Mario Kart around it's really funny you put on different hats to get different abilities I was like this is actually really cool so they when they were like it's coming to console I'm like great looking forward to that awesome yeah cool well there you go",
            "start": 5217.24
        },
        {
            "text": "\"Hats to get different abilities, I was like, 'This is actually really cool.' So they were like, 'It's coming to console,' and I'm like, 'Great, looking forward to that.' Awesome, yeah. Cool. Well, there you go, Peter. Thank you very much for joining us. This is an excellent episode of the Kinda Funny Gamescast, if I do say so myself. Uh, thank you guys for joining us. We will see you next week. Until then, I love you. I... I want to point out before we sign off fully: all right, don't cut this yet. Cool. Greg, leave this all in the Reptar shirt. I... love it, but the Reptars at the very corner of your pocket look like they're... no, right underneath that finger. No, go back now. Yeah, show them Peter. Those two are definitely repti; they're loving it; they're really enjoying that. I don't understand. So in between it there's like little triangles and circles, and I get that, but then there's like dog bones, and I don't understand the narrative of this t-shirt. Well, you remember a pork chop...\"",
            "start": 5257.08
        },
        {
            "text": "so in between it there's like little triangles and circles and I get that but then there's like dog bones and I don't understand The Narrative of this t-shirt well you remember a Porky Pig of course from Looney Tunes okay yeah what's that have to do with this there's there everybody loves Nickelodeon I don't know man kind of weird and also before kind of before anyone Cuts anything I was supposed to say this in the beginning of the episode and I didn't I totally **** up I was going to let you go yeah um I we apologize that this episode is a day later than it normally is we had to record a bunch of things uh that were like scheduled and we had to do them at the certain times yesterday which is when we normally record the show so it's a little bit late thank you for on Patreon so we love you guys hey what's up guys hope you guys liked that if you did you should click here to subscribe to Kinda Funny Games if you want some other stuff from us click there to subscribe to Kinda Funny",
            "start": 5296.4
        },
        {
            "text": "hey what's up guys hope you guys liked that if you did you should click here to subscribe to Kinda Funny Games if you want some other stuff from us click there to subscribe to Kinda Funny if you want to support us with real money you can click right there to support us on Patreon or if you click right there you can see some of our best videos we've ever made",
            "start": 5331.8
        }
    ]
}