{
    "id": 2834,
    "video_id": "SnyUfAMvleU",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Andrea Rene",
        "Danny O'Dwyer"
    ],
    "title": "Legendary Pokémon Mark The Return of Go! - Kinda Funny Games Daily 07.20.17",
    "description": "Subscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1500581865,
    "duration": 2758,
    "transcript_chunks": [
        {
            "text": "Hello everybody, what's up, and welcome to Kinda Funny Games Daily. As you can tell, I am not Greg Miller; am I? No, you're not either. What's going on here today is Thursday, July 20th. I'm Andrea Renee. Welcome to our daily video games podcast. I am joined by... do I have to call you the Irish? You don't, you know, but you did anyway. This was supposed to be my respite for once, wasn't it? Not here. Let's pick a new name for you, okay? What would you like it to be? Oh no, we're on the spot; I'm putting you on the spot. You are... and I'm kind of all right. You think about it. I kind of like that. If you guys have some alternate names for Danny O'Dwyer, you can be part of the show. Join us at Kinda Funny.com/KFGD, and you guys can submit alternate names for Danny O'Dwyer. Than Irish Cream? Cuz let's be honest, that's not that great. Greg, you could have done better. It's my mom started calling me... now it's weird; she just Skypes me and says, \"Hey, Irish Cream, what's going on?\" I'm like, \"Hey, Mom.\" You guys can join us here each",
            "start": 2.17
        },
        {
            "text": "that great Greg, you could have done better. It's my mom started calling me now it's weird she just Skypes me and says hey Irish Cream what's going on I'm like hey Mom, you guys can join us here each and every weekday at twitch.tv/kindafunnygames of course we're not answering any questions you put in the chat, you have to put all of those at kindoffunny.com/kfgd because this is a podcast and we enjoy the fact that you guys listen to us talk about video games and now Danny and I are finally getting to do a show together. If you guys have not yet subscribed to Kinda Funny Games Daily on podcast services, we would greatly appreciate it if you could do that iTunes Google Play wherever you listen SoundCloud. I know there's like a dozen places people can listen to podcasts these days, Pod Shuffle Overcast Overpods yeah just all over the place. We would appreciate it if you guys could give us a nice review leave us a rating subscribe on those services even if you watch live on Twitch or you",
            "start": 66.52
        },
        {
            "text": "overcast overp pods yeah just all over the base we would appreciate it if you guys could give us a nice review leave us a rating subscribe on those services even if you watch live on Twitch or you watch on YouTube so that would help us out a lot so thank you so much for all of your support and um we've got some do we have any other housekeeping I think that's you're wrong Oh wrong keep us honest ladies and gentlemen that's kinda funny.com your wrong Danny's going to be mentioning that at the end of the show the best part of the of right now it's just clean it's like a newborn baby there's nothing on it but maybe like a newborn baby it's been washed maybe yeah yeah that's good Greg of course is at San Diego Comic-Con oh my God he goes he's in a panel I believe right now as we speak I so I'm taking a selfie with quite a lot of people that I know from a lot of movies so well you know he's got famous friends that Greg Miller um I'm going to be at San Diego Comic Con uh tomorrow I'm leaving",
            "start": 114.72
        },
        {
            "text": "taking a selfie with quite a lot of people that I know from a lot of movies, so well, you know he's got famous friends. That Greg Miller, um, I'm going to be at San Diego Comic Con uh tomorrow, I'm leaving immediately after the show is over to go to the airport, I'm hosting the Life is Strange: Before the Storm panel with uh Deck Nine and Square Enix uh tomorrow night so sweet yeah it'll be great. I'll be here doing this, I'm not going to keep the show float Dan O'Dwyer all right, so I think that's it for housekeeping, Kevin correct me if I messed anything up um good awesome that means it's time for the Roper Report he almost missed it that's F time for some news H H Greg does it right, Kevin you're getting good hopefully a month from now you'll have mastered it maybe sooner than a month from now you could practice a little bit more it's not like you're a busy guy or anything I I practice all the time hear me yes of course we hear you so today on The Roper Report we have three items of news",
            "start": 157.04
        },
        {
            "text": "Could practice a little bit more, it's not like you're a busy guy or anything. I I practice all the time. Hear me? Yes of course we hear you. So today on The Ropers Report we have three items of news - A Baker's Dozen perfect and uh today we're going to start with Pokémon Go yeah so the first legendary Pokémon will arrive this weekend according to Polygon. Pokémon Go is finally getting some legendary monsters, and this weekend trainers around the world will be able to catch their first legendary Pokémon. Pokémon Go Fest attendees will get first dibs on legendary monsters on Saturday July 22nd at the event. Players who have tickets to this event in Chicago's Grand Park will have the chance to catch a Legendary Pokémon during an epic raid battle, that is if they catch enough Pokémon to unlock it first. Now if they succeed in defeating it, Pokémon Go players everywhere will be able to start catching that same monster at their own local gyms starting July 23rd. Players will have their chance to team up.",
            "start": 205.16
        },
        {
            "text": "now if they succeed in defeating it Pokémon Go players everywhere will be able to start catching that same monster at their own local gyms starting July 23rd players will have their chance to team up and have legendary raid battles with their friends these monsters will be much the same as typical Pokémon except they won't be able to defend gyms other than that they'll be great for showing off in battle or to friends via your Poéx yeah so are you still playing Pokémon Go did you play Pokémon Go it's the hot new game everyone's playing right now um I did play it when it first came out I played it I used to walk around Lake Merritt in Oakland having a go of it uh um when I went to Ireland me and my buddies you know you could get those Maps where you could like hack where people where Pokémon were popping up and so we'd get in the car and like use it yeah totally and like there's a Snorlax up you know behind De La Salle College let's go find it um so we did a bunch of that as well but like most",
            "start": 255.2
        },
        {
            "text": "popping up and so we'd get in the car and like use it yeah totally and like there's a Snorlax up you know behind Diesel College let's go find it um so we did a bunch of that as well but like most people I taper it off you know a couple of months in what about yourself I dabbled very briefly when it it came out I also did a special piece for Playboy Gaming last April when San Francisco had a POC crawl I don't know if you went to it or heard about it but it was thousands of people on the streets uh if you guys want to see just how many thousands of people I'm talking about that video still exists on The Gamer Next Door YouTube channel you can watch it um Andrea Rene's Poké Crawl I think it's called um it was a really interesting experience meeting so many people who are so invested in the Pokémon franchise people who were cosplaying people who had been playing since they were kids and everyone was comparing you know techniques at gyms and who has what in their Pokédex and it was really",
            "start": 299.2
        },
        {
            "text": "franchise people who were cosplaying people who had been playing since they were kids and everyone was comparing you know techniques at gyms and who has what in their Pokédex and it was really fascinating in a really fun experience and it was interesting to see how a single game could really unite this giant community of players did you get the sense that the people who are at that were folks that had like because what was this you said April of were these people who were still playing it or were these people who were uh who had kind of fallen off and were jumping back in no this was last year oh this is before it came out no this is when oh when did it come out it came out last year it did around that time yes okay so that was hot it came out in like February I think when it came out some reason I had it as a summer game uh well it was really big over the summer right um and so yeah so one if they did a crawl well I guess this Go Fest is going to be a good example of that like",
            "start": 346.4
        },
        {
            "text": "Reason I had it as a summer game, uh well it was really big over the summer right, um and so yeah, so one if they did a crawl well I guess this Pokémon Go Fest is going to be a good example of that like if they do one now how many people turn up and are they folks who have continued to play or will this get you know armchair Pokémon Go players back out there? I mean it might if you guys are playing, you know let us know leave us a comment below or you know write to us tweet to us whatever let us know if you're still playing Pokémon Go. I think you know adding the Legendary Pokémon is coming a little bit late but I had the opportunity to speak to the folks at Niantic at The Game Awards um earlier so that was what December and I one of the things that they said was obviously the reaction worldwide was much bigger than they anticipated clearly they had server issues and uh other technical problems um throughout the launch of that game and so they weren't able to implement some of the creative",
            "start": 390.12
        },
        {
            "text": "was much bigger than they anticipated clearly they had server issues and uh other technical problems um throughout the launch of that game and so they weren't able to implement some of the creative content that they wanted into the game as soon as they could because they were focused on just making sure the game wasn't broken and that it was functional for as many players as possible in as many territories as possible so they're kind of getting around to it now yeah I mean they also made hundreds of millions of dollars so clearly they were able to increase their work force get more people on board but it's probably you know it is the thing where like it's a shame where they couldn't get a lot more creative content as you said out sooner but you also don't necessarily want to rush that stuff so at least hopefully they're doing a good job of it now I mean this does sound like the type of thing where it's extra content for the game but it's also like the visible thing that works with",
            "start": 433.64
        },
        {
            "text": "stuff so at least hopefully they're doing a good job of it now I mean this does sound like the type of thing where it's extra content for the game but it's also like the visible thing that works with this game so much is these big events where there's all these people and if they have this like epic raid and it's essentially like couple of thousand people with their phones out in the middle of a park like that's the type of thing that's going to get people talking about it you know that'll be like pictures shared on social media and news crews probably and everything so um that's probably what they need to kick started again it seems like it's a little bit late in the summer though I would have thought that they would have come out swinging for when people are living in evergreen of the world it's always kind of out here but like you tend to get people in other parts of the country uh like in other parts of the world where I'm from North Dakota where there's snow on the ground",
            "start": 475.4
        },
        {
            "text": "of the world it's always kind of out here but like you tend to get people in other parts of the country uh like in other parts of the world where I'm from North Dakota where there's snow on the ground like six months a year right so when it's when it's gone you're like all right we're going outside exactly um so it's yeah maybe a little bit late on that end but uh better late than ever I guess yeah true um all right I think it's time to maybe move on unless you have some deep Pokémon thoughts you would like to share I'm looking forward to hearing what people think about this I think I'm looking forward to seeing with the reaction this will kind of be like the are you going to go out try to get this legendary Pokémon I'll probably give it a go again like I did have fun with it I was more into the social aspect of it than I was like trying to hunt them all down cuz I'm like man this just too many of them I got all these eggs I got to hibernate these eggs and walk the eggs yeah it's like I",
            "start": 513.4
        },
        {
            "text": "the social aspect of it than I was like trying to hunt them all down cuz I'm like man this just too many of them I got all these eggs I got to hibernate these eggs and walk the eggs yeah it's like I I just like love like when stuff appeared outside my house and I lived like there was like two gyms on the way to the bus when I was going to GameSpot every day and like now I work from so like my main initiative or like situation to go get Pokémon is now completely gone so I heard a really good hack from somebody that said if you tape your phone to a dog to a ceiling fan what it'll it'll like simulate you walking if you keep it on a slow speed oh my gosh I'm like that's a really good cheat I could tape it to my cats and then it would simulate sleeping most of the day okay uh moving on up new Nintendo trademark filing gives hope for N64 classic oh my God so of course we've all speculated that this was going to happen given the success of the NES Classic and the upcoming success we can",
            "start": 549.36
        },
        {
            "text": "new Nintendo trademark filing gives hope for N64 classic oh my God so of course we've all speculated that this was going to happen given the success of the NES classic and the upcoming success we can anticipate for the SNES classic once it launches so from Gamespot Nintendo's next micro console the SNES classic is set to launch this fall but that might not be the end of the company's retro plug-and-play line a new trademark filing suggests that a miniature Nintendo 64 could also be on the way the filing in question is for a controller that appears identical to that of the Nintendo 64 Nintendo are they sure I mean have you seen the photos I mean it's impossible to like look at an N64 controller and think it's something else that's true it is the weirdest controller ever created um Nintendo recently applied for a trademark for the distinctive three-pronged Gamepad with the European Union intellectual property office now this comes via NeoGAF the application is listed under",
            "start": 596.4
        },
        {
            "text": "\"Nintendo recently applied for a trademark for the distinctive three-pronged Gamepad with the European Union intellectual property office. Now, this comes via NeoGAF, the application is listed under goods and services which suggest the trademark pertains to a physical product. SNES Classic, meanwhile, releases in the US and Europe on September 29th and comes with 21 of the console's best titles, including the never-before-released Star Fox 2. Yeah, this really looks like an N64 pack. Yeah, you guys can find the image pretty much anywhere online right now. It's this news has spread far and wide, but yeah, and these stories came out ahead of the SNES Classic and ahead of the NES version as well. So it's looking like we are going to get a mini one. I mean, why not? That was my favorite Nintendo console, N64, and it does seem like...like we talked about this yesterday, um, myself and Greg, about how they're like the generational of video games and how, you know, everyone's\"",
            "start": 644.64
        },
        {
            "text": "consoles n 64 and it does seem like a like we we talked about bit about this yesterday um myself and Greg about how they're like the generational of video games and how like you know everyone's first Mario Cart is their favorite Mario Kart and all that and to some people like the NES classic is like the the be all end all I feel like probably for us maybe SNES classic is probably the one that has the most Nostalgia uh but then to a lot of folks n 64 would be equally as nostalgic um and in fact then you're basically collecting all the people who played SNES games as teenagers and maybe in college and stuff were super into the N64 and things like that um or maybe in the later teens so like or everybody or everybody right it's a no-brain and it also like all of these consoles like I think that it kind like it kind of stops after that like my first real Nintendo console was a GameCube so for me it's kind of like wait really yeah I was I grew up playing Commodore stuff the NES Commodore",
            "start": 692.4
        },
        {
            "text": "that it kind like it kind of stops after that like my first real Nintendo console was a GameCube so for me it's kind of like wait really yeah I was I grew up playing Commodore stuff the NES Commodore 64 was basically my my at home that was like a lot of European people were either playing Atari Commodore Amiga 600s and stuff like that Spectrums stuff like that so did you get the classic did you have you gone back and played those games since bought the old consoles kind of when I was later in my teens and stuff then I started going back and getting a bunch of stuff but I wasn't my first NES I only got like last year and my first I played Neses in like my friends houses and stuff when I was a child I wasn't like I had not played them but yeah like I hadn't owned any of that stuff until recently I got my first Dreamcast last year as well so I mean that's a waste of time Greg would get mad but he's not here so it's kind of a no-brainer for them to do this uh it's got such",
            "start": 736.72
        },
        {
            "text": "recently I got my first Dreamcast last year as well so I mean that's a waste of time Greg was here he'd get mad but he's not here so it's kind of a no-brainer for them to do this uh it's got such a great suite of games as well like oh so many I mean that's I think going to be the challenge you know if Nintendo continues making these Classics is that how do you Weed out the library of games because you know as we moved forward with each generation of console the libraries just got bigger right and so you're right yeah if they had to pick 20 games yeah for the N64 classic I mean do back and forth I'll I'll start it off start so GoldenEye AI yeah I mean Mario 64 yeah um Majora's Mask they need a little spice in there a little bit of yeah yeah you know why not um Mario Kart 64 okay my favorite Mario Kart uh let's go for like pack in stuff like I don't know Wave Rally I feel like it was one of those games that like sold us you're like games can look like that you know",
            "start": 779.24
        },
        {
            "text": "Mario Kart, uh, let's go for like pack-in stuff like I don't know Wave Race. I feel like I love Racer, that was one of those games that like sold us, you're like, \"Games can look like that.\" You know, that was like 3D super nice frame rate, 64 bits man, and water effects. Like water effects have been selling games for donkeys years. Like I remember playing the first Far Cry basically just because of its water effects in 64 man okay uh yeah, Tck Jesus um let me have a look at I'm sure there's got we going to look should I look up a list Donkey Kong 64? I mean um yes, ay people like that game but I don't think it's actually very good. What yeah I don't know why don't you think it's very good? Have to defend yourself. It's like if you go back and play Crash Bandicoot now, like those games aren't really... I'm sorry Tim Gettys isn't here. You mean the um you mean the original not the Remake that just came out yeah I mean yeah either probably if you play like like crash is like a game that sells on Nostalgia",
            "start": 833.48
        },
        {
            "text": "sorry Tim Gettys isn't here, you mean the um, you mean the original not the remake that just came out, yeah I mean yeah either probably if you play like, like Crash Bandicoot is like a game that sells on Nostalgia, like it was a fun kooky looking you know 3D ass game on a PlayStation but like it's also like the world's most infuriating platforming game okay okay I'm I'm not going to I'm not going to double down on that I didn't spend too much time on Crash but um per Star Fox 64 we've got Pokémon Snap yeah there's of course Ocarina of Time, never heard of it, never heard of it F-Zero I thoroughly enjoyed that game but there really wasn't an F-Zero game that I didn't like the first uh Paper Mario I've never actually played that Super Smash Bros right from 1999 Bomberman 64 that was probably a good one, I like the Genesis one, the Mega Drive one, sorry my bad dude, there's so many good games you got Resident Evil 2 cruising USA one of my all-time favorite games of all time it's on my top 10 list of all time",
            "start": 880.72
        },
        {
            "text": "the Genesis one the Mega Drive one sorry my bad dude there's so many good games you got Resident Evil 2 cruising USA one of my all-time favorite games of all time it's on my top 10 list of all time Cruisin' USA what's Body Harvest I have literally never heard of that but it looks rad it's called Body Harvest that's a badass name Okay so we've talked about a couple games um that we would like to see Gex on the N64 classic um let us know what you guys would like to see let's get a let's get a good list going um okay so when do you think this is going to come out H so if the NES was last year the SNES was this year do you think that this could come out next next September next holiday the thing weird thing is about the NES the SNES classic is I feel like they could have like a retail cycle on that for like two years easily like I like we're probably going to run into supply issues let's be honest like it's going to be crazy Christmas like holiday stuff means you're going to get",
            "start": 933.04
        },
        {
            "text": "cycle on that for like two years easily like I like we're probably going to run into supply issues let's be honest like it's going to be crazy Christmas like holiday stuff means you're going to get mainstream people trying to buy it as well as all of us uh so like they get easily sold out next people who don't what does that mean like mainstream folks I like people who don't own a home console but like they're buying like Christmas presents are difficult but if you know somebody has like an Xbox One or PlayStation 4 or Nintendo Switch but they would buy the N64 yeah cuz they'd be like oh maybe playing those games when we were kids like the loads like my brother right who like loves games but just he's got kids and he's got a job he just doesn't have time for it like you could totally see them getting something like that a couple of quid you know um so I feel like a lot of what' you say couple of quid that's what you signed up for every once in a while an Irish guy says",
            "start": 979.24
        },
        {
            "text": "totally see them getting something like that a couple of quid, you know, um, so I feel like a lot of what' you say, couple of quid, that's what you signed up for every once in a while. Irish guy says top of the morning to you, Kevin, you know your name is in Irish Quine no, I don't think there you go it is, I swear to God, ask Amy, yeah, I don't I don't know what Andre is, I'm sorry that's okay, Quine, I used to go to school with a guy Kevin McWeeny was Quine MWI sounds like a Klingon or something, yeah, anyway I digress, I'm 1/16th Irish nice, yeah, I'm like a quarter English according to my DNA thing, oh and they they spit in a jar and like six months later let you know I swear to God you literally spit in a jar there's a bubble line they're like make sure the bubbles are up to here keeps spitting, yeah never keep give us that Irish cream, oh no that went to a dark place, yeah so hey um um okay that's where you get the red hair from I'm trying to hold it together",
            "start": 1017.32
        },
        {
            "text": "are up to here keeps spitting yeah never keep give us that Irish cream oh no that went to a dark place yeah so hey um um okay that's where you get the red hair from I'm trying to hold it together actually you as an Irish man know that red hair is not an Irish thing it's like dark hair blue eyes that's the Irish thing pretty much yeah freckles sometimes if it's sunny if it's sunny like everyone gets freckles when it's sunny I got sunburn well I got sorry I really turning this into Irish Corner man but I got sunburn here and here two days people listening he is um pointing to his the side of his forearm you're not really supposed to get burned CU you don't have any melon in there no but I I was I was walking around my hands behind my back wait the whole time I guess I Saun her like that I didn't realize till I got home and I had like the Irish Stigmata on my on my wrists yeah so anyway care I'm glad to see there's no permanent damage you're okay you moisturize it's gone to a normal",
            "start": 1068.76
        },
        {
            "text": "I didn't realize till I got home and I had like the Irish Stigmata on my on my wrists, yeah. So anyway, care I'm glad to see there's no permanent damage, you're okay? You moisturize it's gone to a normal level of red that I did. You did you shed some layers of skin? I put a lot of aloe vera on it so it was okay. Okay, glad to hear it because if you get burns that can cause permanent damage which can lead to skin cancer. I know it's not good especially when you're an Irish person in the global warming hell spot that is west coast of America, yes. So well, luckily we're not too far south, that's true, we're not that close to San Diego for instance. Watch out Greg Miller, watch out, wear your sunscreen, yeah I live for the sun, I'll be fine okay. We digress, yeah back to the news um number three John Romero is the the Doom guy, yeah this was some interesting news so from his Blog the body model I took oh yeah so I should I should I contextualize this bit for you yeah how about you do this sure so uh John's",
            "start": 1117.8
        },
        {
            "text": "the Doom guy yeah this was some interesting news so from his blog the body model I took oh yeah so I should I should I contextualize this bit for you yeah how about you do this sure so uh John Carmack's got this blog Rome which is pretty good URL um where he like randomly sets up these stories about old Doom stuff right and I went to interview him for NoClip stuff back in January he is just like of he has like this thing I used to think he just never shuts up about Doom but he has like this unbelievably good memory where he like retains like I asked him about interviews he had done years before and he remembers everything about them like he just has like a photographic memory or something I don't know what it is so one of the things he was talking about was they were basically doing the Doom box art the like famous shot of the Doom Marine standing on the thing with all the demons coming up to get him and he's like shooting one and handing off another one um he was",
            "start": 1164.12
        },
        {
            "text": "doing the Doom box art, the like famous shot of the Doom Marine standing on the thing with all the demons coming up to get him and he's like shooting one and handing off another one... he was talking about how they basically got in a body model to like do the shot and then the artist was going to like draw around us but they needed some sort of framework for it so he said uh the body model this is in the ID Software offices, I'm guessing the old ones um Greg I guess uh the body model took off his shirt and started posing with our plasma gun toy. He asked us for suggestions as the photographer, so I asked him that the Marine was going to be attacked by an infinite amount of demons it would be cool if he was on a hill and firing down at them... uh the model was holding the gun in various positions and none of them were interesting to me he did this for about 10 minutes this poor man he's like topless in a shirt full of programmers doing this um he did it for about 10",
            "start": 1210.56
        },
        {
            "text": "gun in various positions and none of them were interesting to me. He did this for about 10 minutes. This poor man, he's like topless in a shirt full of programmers doing this. Um, he did it for about 10 minutes and we just didn't see anything that we thought looked cool on the cover. I kept telling the model what to do but he couldn't see the scene in his mind. Frustrated, I threw off my shirt and told him to give me the gun and get on the floor. He grabbed my arm as one of the demons defeated. He deferred. I aimed the gun in a slightly different direction and told Don, \"This is what I'm talking about.\" Don took several pictures. I moved the gun some, and the demon grabbed my leg, other arm, etc. At the end, we all decided the arm-grabbing pose was going to be the best, and that's the story of how the cover composition was created. I am the Doom guy; that is incredible. Like, my favorite part of that story is like he also took his shirt off. Like, was the Doom guy not topless? No, he's in armor. Why are they taking pictures of me with a gun?",
            "start": 1252.92
        },
        {
            "text": "was created I am the Doom guy that is incredible like my favorite part of that story is like he also took his shirt off like was the Doom Guy is not topless no he's in armor why are they taking their shirts off it's like for effect maybe he just needed to really you know go into his masculine uh psyche tapping testosterone to feel like he was superpowered I don't know when you look at the cover oh okay so as Greg has pulled up here the cover of Doom and Doom Guy has a cutout it's so a midriff cutout which I didn't notice before he also has a cutout on his pants now it's all I see so you can see his six-pack abs like underneath is like very chiseled pictorial muscles the one on his leg looks like he's been cut the one in on his abs looks ous AB it's just like yo check out my abs I'm wearing like metal armor but feel free to shoot me in my midsection he's going to kill a demon on those abs cut cut glass with those abs also my armor is you know short sleeve because you know sometime it",
            "start": 1295.48
        },
        {
            "text": "like metal armor but feel free to shoot me in my midsection he's going to kill a demon on those abs cut cut glass with those abs also my armor is you know short sleeve because you know sometime it gets hot welcome to being a woman in all video games oh yeah good point i' never noticed that before somehow you know we just cover the boobs and everything else is exposed right yeah most important including our butts because who needs armor on their butt me I want armor on my butt when people are shooting women they're always trying to shoot the boobs right that's clearly the way it works yeah video games Okay so this was an interesting story and um we had somebody on the website kind of.com kfgd get involved with the show GDB says hey Danny and Andrea actually says Hey Andrea and Danny with the news that Doom DLC is going free for everyone what are your thoughts on a developer doing this 14 months after releasing the game and completely nullifying the season pass that many people paid for",
            "start": 1351.04
        },
        {
            "text": "news that Doom DLC is going free for everyone what are your thoughts on a developer doing this 14 months after releasing the game and completely nullifying the season pass that many people paid for on one hand it is a way to save reignite a multiplayer Community but on the other it turns the season pass into almost a subscription that now means nothing less than a year and a half that means nothing less than a year and a half after the game was released absolutely love what both of you bring to the show thanks JDub yeah this is such a difficult Balancing Act um I mean I think if the DLC was more single player stuff I would be more sympathetic uh to players in this situation but knowing that like it's all essentially multiplayer modes which has in essence fragmented and already probably not particularly large multiplayer crowd I can see the fact that they waited a year and a half I guess it came out in I'm trying to think we did the dock back in November so I think it was maybe it was",
            "start": 1400.6
        },
        {
            "text": "particularly large multiplayer crowd I can see the fact that they waited a year and a half I guess it came out in I'm trying to think we did the dock back in November so I think it was maybe it was April or something of last year came out maybe March um the fact that they waited like that long at least a year is at least something and in a way you can see that perhaps they're not really giving away the season pass but it's kind of bundled in with the game so people are paying for it but they're paying less for the game if you can sort of maybe think about it that way it's easier pill to swallow um but yeah it does suck to like nobody wants to pay extra for something and then be treated like you know like you got had basically I mean I I think this is a little bit of an unfair heal to D for this guy for for Greg like listen I get it you paid for something and then it became free but 14 months later that's over a year later and as you mentioned it was multiplayer content people who are",
            "start": 1448.64
        },
        {
            "text": "for this guy, for Greg Miller, like listen I get it you paid for something and then it became free but 14 months later, that's over a year later, and as you mentioned, it was multiplayer content, people who are still active in a multiplayer game that isn't constantly releasing updates like a Call of Duty or Battlefront or Battlefield, uh just to name a couple of the large franchises. I mean I don't think that this is Bethesda doing the community wrong, I think they're saying hey our servers are almost empty, the only people left playing Doom multiplayer are like the hardest of the hardcore fans probably most of them have the DLC right right I'm guessing yeah and so so they're saying hey if we want to get more people in the servers to make the experience better for existing players and new players. I mean giving it away for free, I don't think is a crime right, I think this is fine and maybe it solves that problem where instead of yeah creating cuz I I am just guessing that if somebody waited this",
            "start": 1497.92
        },
        {
            "text": "mean giving it away for free I don't think is a crime right I think this is fine and maybe it solves that problem where instead of yeah creating cuz I I am just guessing that if somebody waited this long to play Doom they probably aren't necessarily going to then go ahead and pile DLC for the game so exactly you know at least that will hope you know uh I'd love to see numbers on how many people are actually playing Doom multiplayer I mean I played it at launch and I also played it I guess it was 14 months later and I played it half a year later when we were capturing stuff for the the the Doom we actually ended up not doing anything about the multiplayer stuff because id didn't actually really make that um but I played a bunch of it and uh even then it was kind of like spotty you know like and there was a bunch of different game modes so you kind of like I'll just go into the you know whatever comes up first kind of like um look dip uh servers instead of instead of being particular about it",
            "start": 1543.4
        },
        {
            "text": "was a bunch of different game modes so you kind of like I'll just go into the you know whatever comes up first kind of like um look dip uh servers instead of instead of being particular about it right uh so yeah I don't know like I I agree with you I think it's it's sucks but it's also like come on you know you you got all that stuff for all that time and hopefully this is also benefiting you as a player um if they get more people than yeah get more people on the server the more the merrier the more the merrier I think it's fine just give all games away for free well hold your horses not quite that all right so that's it for news Danny yes have you been practicing oh God damn it I was hoping you didn't know about this I'm hoping you didn't know what do you mean of course I know about this I listen to the show when I'm not on the show the official list of upcoming software on each and every platform as listed by the Kinda Funny Games Daily show hosts each and every day you nailed",
            "start": 1581.92
        },
        {
            "text": "I listen to the show when I'm not on the show, the official list of upcoming software on each and every platform as listed by the Kinda Funny Games Daily show hosts, each and every day. You nailed it, really? Yes, nice work, boys! I was covering my face but then realized I was still looking this way, and I thought all people are going to say, \"Think I'm looking on it.\" No, so he didn't look at the script; he did it from memory. Congratulations, he did a great job. Um, so this list may be a little incomplete, fair warning. So again, Kinda Funny.com, you're wrong; you can correct us if we've left stuff out of this list out today. Boost Beast - this is a digital title on Switch that is I just want to say it's a great, great name for a video game. Yeah, Boost Beast, Boost Beast! Yeah, I'm into it. Crypt Crawler also; we're on an alliteration home run here. Keep going. An Oculus and Gear VR. Um, the Samurai Showdown - what is going on? What are we just talking about? The Samurai Showdown. Cryp CW, Boost Beast, also on Switch. That of course",
            "start": 1621.12
        },
        {
            "text": "we're on an alliteration home run here keep going an Oculus and Gear VR the Samurai Showdown what is going on with the Samurai Showdown Cryp CW Boost Beast also on Switch that of course the 93 classic from Neo Geo um and then Lone Echo is also on Oculus I added that I kind of wish I hadn't now cuz we had broken but but we did get to play Echo Arena uh me and the kids yeah it was really fun that video is coming out next week Kevin August 1st the week after next I think so so so um keep a lookout for that it got pretty shenanigan right yeah Tim also got pretty sick it sounds like 4v4 oh did Tim get sick apparently he was he got motion sick at the size I could see how you could get sick in that game cuz it's a lot of like Fast movement and boosting and you're like floating it's it's like Enders Game kind of disc throwing and yeah it was um it was fun though I had a good time we all got really sweaty though so I kind of felt bad when we left I was like here's your sweaty",
            "start": 1665.64
        },
        {
            "text": "it's like Ender's Game kind of disc throwing and yeah it was um it was fun though I had a good time we all got really sweaty though so I kind of felt bad when we left I was like here's your sweaty Oculus back you got like yeah cuz the face part does yeah it's really it's a thing um new dates not really any new dates except for one One Piece Unlimited World Red Deluxe Edition is coming on September 29th for the Switch eShop it was previously announced for other platforms that's Xbox One PS4 and Steam for August 25th so this is interesting that it's coming uh a month later for switch but at least it's coming to switch for people who are One Piece fans do you uh do you play One Piece? I do not um uh my anime um that is an anime right yes yes well there answer finishes the rest of the question I like how to be bop a couple of other things and that's about it that's not a problem but it's cool to see uh I mean I like the idea that some of the smaller you know developers are not some",
            "start": 1725.8
        },
        {
            "text": "I like how it be bop a couple of other things, and that's about it. That's not a problem, but it's cool to see uh, I mean I like the idea that some of the smaller you know developers are not some of the big AAA guys are also saying hey it's actually worthwhile for us to put this on Switch like maybe it's not particularly difficult to port it over as previous consoles Nintendo consoles and does a market so yeah why not. There you go, I probably buy more I probably go into the eShop on my Switch more than I do on my PlayStation and Xbox One, like to specifically Go download a game quick for something like for a flight or you know you're going to Comic-Con or when you forget your Zelda game card at home and you need to buy it again. No did you have to do that? Did your save work when so I hadn't um uh no because the save was John's save, and so I started a new save. Um we were going to Europe, and I have what better time to play Zelda than on a 10-hour flight across the Atlantic? I just did that, yeah.",
            "start": 1773.48
        },
        {
            "text": "\"um no because the save was John's save and so I started a new save um we were going to Europe and I have what better time to play The Legend of Zelda than on a 10-hour flight across the Atlantic I just did that yeah and so uh we got to the airport and I went to go boot it up and I was like uh what was in there like Mario Kart, Super Mario Maker so I had fun time playing that while until we got to internet where I could download it but right yeah so I paid for that game twice nice hey if there's a game to play twice for The Legend of Zelda is fine yeah all right deals of the day this comes from Top Five Bananas, Top Five he says PSA totally digital sale on PSN includes The Witness, Inside, and Snake Pass - nice Kevin endorsed Snake Pass, Kevin those snakes. PSN is having a totally digital sale you guys can check that out three g games really like all those games those are all great games you want to watch the documentary on The Witness your boy O'Dwyer's got you no clip video check it all right read or mail now unfortunately because\"",
            "start": 1814.4
        },
        {
            "text": "really like all those games those are all great games you want to watch the documentary on The Witness your boy od's got you no clip video check it all right read or mail now unfortunately because I do have to um skip to the airport to go to Comic-Con we're cutting the show a little bit short today than it normally would be so apologies see you later that's it we're done go Kevin um um so I'm going to skip that first one and go down to this one from Ryan Ryan writes into us at kind of funny.com kfgd just like you can and says hello to the busiest lady in the business and our sweet Irish cream I was excited when we found out you'd be co-hosting together for the first time then it dawned on me that you are both former GameStop employees I'm a current store leader and as such hyper aware of the internet's deep burning desire to see the specialty retailer go the way of other brick and mortar dinosaurs like Blockbuster and strawberries do you see I don't know strawberries but apparently",
            "start": 1867.96
        },
        {
            "text": "the internet's deep burning desire to see the specialty retailer go the way of other brick and mortar dinosaurs like Blockbuster. do you see I don't know strawberries but apparently it's mostly music. do you see the company's days as numbered or is the move to all digital within the industry still so far out that they will have time to adapt and rebrand. they already seem to be making big moves with the acquisition of ThinkGeek and infusing locations with pop culture collectibles and hard goods as well as increasing market share in the cellular space. are these high margin additions enough to overcome lost sales from digital and online retailers. is there anything you think they need to do better either from a product or service perspective to shut up their chances. what about a potential buy out coming from a location in mostly rural part of New England far removed from conventions and other hubs of geek culture our store is a destination for like-minded guests to converge",
            "start": 1910.56
        },
        {
            "text": "a potential buy up coming from a location in mostly rural part of New England far removed from conventions and other hubs of geek culture our store is a destination for like-minded guests to converge and share their passions with staff and other guests it would be a shame to see it go the way of the dodo bird thanks for your insights and so glad to have you both as members of the team Kinda Funny thanks Ryan um PS Andrea it is pronounced Lara oh is there cof thing I I did a stick thing about right Loft when I hosted a segment at E3 2015 in the Xbox booth and I asked uh one of the members of the development team at Crystal Dynamics I was like how okay like set the record straight yeah how do you say her name and they said Lara yeah so but Lara if you look to VI the video game though characters in the game say her name differently what did they say like like Laura some of them say it as Laura Croft okay yeah it's it's a thing anyway yeah my wife's American I'm Irish this sort of",
            "start": 1948.88
        },
        {
            "text": "characters in the game say her name differently what did they say like like Laura some of them say it as Lara Croft okay yeah it's it's a thing anyway yeah my wife's American I'm Irish this sort of **** happens on a minute by minute basis in our house so Ryan thank you very much this is a very insightful question that you have posed to us so I feel like you've got particular insight into the business aspect of this that I don't I I worked brick and more I worked behind the till at a bunch of different game space I worked at a GameStop don't say GameSpot um although I also did work there um uh for like probably maybe three years over the course of ACH of different places um but yeah I feel like you sort of know it from a more business perspective you've got better insight into that tonight well I mean my access to you know the the business side of GameStop was pretty limited I did get the opportunity to interface with the executives a few times and obviously went to GameStop manager show",
            "start": 1998.0
        },
        {
            "text": "I mean my access to you know the the business side of GameStop was pretty limited I did get the opportunity to interface with the executives a few times and obviously went to GameStop manager show a couple of times as well and you know from my perspective GameStop is doing well there is this perceived notion that they are struggling and that they're failing but really they're not they're doing okay because they've Diversified their brand in such a way that they've been able to bolster the waning sales of retail discs with digital sales with merchandise sales through ThinkGeek and as he mentioned here cellular space so many people don't realize that GameStop owns a lot of um Cellular stores under Brands Simply Mac and Spring Mobile so this is all like publicly available information because they are a publicly traded company on uh so those are the Fortune 500 phone reseller like right so 18th stores essentially where you can go in and buy phones and buy plans and things like that and so",
            "start": 2044.0
        },
        {
            "text": "they are a publicly traded company on uh so those are the Fortune 500 phone reseller like right so AT&T stores essentially where you can go in and buy phones and buy plans and things like that and so that makes up a big chunk of their business uh Danny and I were looking at their quarterly um their first quarter 2017 results um for sales and numbers and things like that and their total Global sales are up 3.8% which is great year on year I'm assuming yeah so um so it's increased to 2.05 billion it's says here um comparable store sales growth of 2.3% uh new hardware sales increased 24.6% led by the highly successful Nintendo Switch um and new software though declined 88.2% due to tough overlap of a few key AAA titles that launched last year so this is I think what a lot of people assume is that because of the digital movement yeah stores like GameStop are going to suffer and I'm not saying that they haven't clearly they've had to diversify what they're doing and really Branch out their",
            "start": 2096.28
        },
        {
            "text": "that because of the digital movement, yeah stores like GameStop are going to suffer and I'm not saying that they haven't clearly they've had to diversify what they're doing and really branch out their business to keep their overall financial picture healthy but they are doing a really great job of changing how they're running stores when I left GameStop earlier this year, they were just on the verge of changing up the content that is broadcast and stores GameStop TV which I was a part of for a long time; they're doing some really interesting stuff now with Rooster Teeth and I know Kinda Funny has worked with them as well and been at GameStop manager show and Expo and things like that, and you know they are really trying to tap into this community in a really meaningful way the thing that I always like to reiterate to people is I had an overwhelmingly positive experience working with GameStop right sometimes they get a reputation of not being um as in line with a community as",
            "start": 2149.6
        },
        {
            "text": "that I always like to reiterate to people is I had an overwhelmingly positive experience working with GameStop right sometimes they get a reputation of not being um as in line with a community as they truly are I mean there's sometimes people online like to pit them against mom and pop shops like this big corporate Overlord against these tiny stores that's really not how they see their business they don't look at it as like oh we have to crush the competition you know I mean obviously they are they stack up against other retailers that way like Best Buy Walmart Target etc but I mean they really want to embrace the gaming culture and serve that Community as best as they can and we've seen that through the acquisition of ThinkGeek and how now when you go into GameStop stores you see merchandise everywhere it's really front and center it's a big part of what they do in stores now they have a dedicated Steam section inside stores now so really bringing the PC gaming Community into the",
            "start": 2193.76
        },
        {
            "text": "everywhere it's really front and center it's a big part of what they do in stores now they have a dedicated Steam section inside stores now so really bringing the PC gaming Community into the fold they sell digital codes all over the place as well exactly for DLC you can buy digital codes directly from Gamestop for you know AAA retail games as well and so I think that they are doing well could they be doing better of course but are they going to fail I don't see that happening anytime soon I feel like the move towards merchandise and all that sort of stuff um makes a lot of sense as like gaming culture like the way it exists now is very different to like remember going to game stores in my local town it's like a small enough Town 40,000 people and like the game shop that that was there like it was a small community people that were into it whereas like games are so much more popular now so much more mainstream um that you can sort of support a business I feel with with selling",
            "start": 2240.08
        },
        {
            "text": "like it was a small community people that were into it whereas like games are so much more popular now so much more mainstream um that you can sort of support a business I feel with with selling merchandise and and sort of you know the stuff that exists outside of the actual software sales I mean you go into a into a Hot Topic now it's half video game stuff there as well so I think that makes a lot of sense for them I mean they do have that bad reputation of of being like a hard sell which also if they're selling less games and there's less stress pressure that's kind of a good thing you're not going in and buying a game and they're asking like and I was part of that machine right and you ask like 20 questions and try and sell somebody a game and get a subscription but like you know if if financially I know they were shuttering a couple of shops a couple of years back um but I think the world of like game sales has changed a lot I but I still think they've got things like",
            "start": 2284.2
        },
        {
            "text": "know if financially I know they were shuttering a couple of shops a couple of years back um but I think the world of like game sales has changed a lot I but I still think they've got things like Hardware people are always going to go to a store to buy it there are certain people who will just don't buy that type of expensive item over the Internet um you know there's always going to be stuff that people want to see firsthand controllers amiibos like there are certain things that you just don't necessarily want to buy off the internet um so I think that probably helps as well but uh yeah it's a it's a weird thing like to hear that he's from like a a store in rural New England right where that's like that's the Hub like if you have that Community around us then I can totally see how if you're facilitating people within that Community then there's enough uh you know you'll have enough sales to be relevant I mean I was from a town that had video game stores that were independent",
            "start": 2320.6
        },
        {
            "text": "you're facilitating people within that community then there's enough uh you know you'll have enough sales to be relevant I mean I was from a town that had video game stores that were independent that I worked at that couldn't compete with GameStop and then I ended up working at GameStop so I I do think that there there has been a negative effect on some mom and pop places um oh I'm not trying to like for the record I'm not trying to say that that effect is not like out there that that hasn't happened of course it has but from the perspective I have of working you know with GameStop they aren't actively trying to like close those places down they're not like these evil people who are like you know trying to destroy people's businesses that's not what they're doing there's actually a really good article I forget who posted it on uh and I think it's I hope it no it's Polygon did an article about some of in mom and pop stores in the US recently I think it was on Tuesday",
            "start": 2365.08
        },
        {
            "text": "good article I forget who posted it on uh and I think it's I hope it no it's Polygon did a an article about some of in mom and pop stores in Royal America recently I think it was on Tuesday or something which is pretty good insight into like how everyone's doing in that space as well and interestingly enough they're doing the same stuff they're getting into merch they're getting into like building community and stuff you know so it it like I think what we think about games retail has changed I think if you were to judge uh the health of them on software sales like sure there's probably more being sold online but to your point like yeah like it's so much more than that right totally and if if you're in a mall and if you are a human being you find yourself in a mall pretty often more so when you're a teenager probably uh but if there's a game store like you're always going to go into it and there's always a chance you're going to pick something up so absolutely yeah and I I",
            "start": 2406.24
        },
        {
            "text": "more so when you're a teenager probably uh but if there's a game store like you're always going to go into it and there's always a chance you're going to pick something up so absolutely yeah and I I hope they stick around it'll be a real shame if if you know if another if they went down then like what happens the the infrastructure probably you can't have a mom and pop store in in every city like it doesn't work that way so um yeah I hope they keep it up I enjoy I enjoyed working there too it's good place thank you for your question Ryan good question all right so now I'm going to kind of run through this last little bit here Squad up if you are looking for people to play with online you can tell us your gamer tag your PSN ID your Xbox Live ID your steam name or your Nintendo friend code at kindof funny.com kfgd today we got two I know we normally only do one lady Knight who plays on Battle.net that's lady knight # 21331 says I'm a console noob who migrated from PS4 to PC and",
            "start": 2447.0
        },
        {
            "text": "At KindaFunny.com KFGD today we got two. I know we normally only do one Lady Knight who plays on Battle.net, that's Lady Night #21331 says \"I'm a console noob who migrated from PS4 to PC and would like to play fun and laid-back matches of Overwatch and the upcoming Destiny 2 with the Kinda Funny best friends.\" If you would like to play with Lady Knight, you can friend her or him them at Lady Knight #2133 one. And then because we both got a tweet and a message on the website about this, we're also going to give a shout out to Joe Medforth who's playing on Nintendo Switch. Joe says \"top of the morning to you Danny and Andrea, Jesus or whoever is presenting today if I got it wrong.\" Sorry's not here, I caved, I did it. My name is Joe Medforth, and after the global test fire in Splatfest, I gave in and pre-ordered a copy of Splatoon 2. I resisted the spring season, but the squid kids in their lack of 2017 part in-game voice chat have me now. Never owned a Wii U so I need some",
            "start": 2486.36
        },
        {
            "text": "and pre-ordered a copy of Splatoon 2 I resisted the spring limb loaded in brace of arms but the Squid Kids in their lack of 2017 part in game voice chat have me now never owned a Wii U so I need some kind of funny best friends to Splat up with and put up with my kind of competent Splat duels Splat Duel skills Splat Dues I don't know what that means either that or play Mario Kart 8 Deluxe until my copy of Splatoon 2 actually arrives shakes fist curse you Rainforest Conglomerate with two-day free shipping thanks for keeping all the game news fresh stay groovy all right Joe's Nintendo Switch friend code is 5 2 5 7 3 0 0 1 6 53 6 damn you Nintendo and your stupid friend codes let me do that one more time for Joe 52 57301 6536 good luck Joe happy Splatton do it all right so that's wrong what tell you what what we got wrong oh yes tell us what we got wrong missed one game on the LCK gigantic is out H it's leaving early access uh Xbox One and PC that's that crazy uh Squad shooter with",
            "start": 2537.32
        },
        {
            "text": "what tell you what what we got wrong oh yes tell us what we got wrong missed one game on the LCK, Gigantic is out, it's leaving early access uh Xbox One and PC that's that crazy uh Squad shooter with the big um massive um dudes it's like Overwatch with giants um go check it out it's been at like every pack ever I feel like so it's good to see that getting out um uh we got another one apparently um this one's for from uh Lucid Games, I think you said each successive Nintendo console release the library became bigger uh which I agreed with I thought that was the case uh while here are the total number of US releases for each one um uh NES 662 SNES 719 N64 29 s well and then GameCube 552 should we only count US releases though I I it's probably Rel I mean I can see that's it N64 probably still dipped because of 3D right like people were like oh how do we make games so SNES had over 700 yeah so that was the highest so NES s NES and then N64 was like H polygons polygons",
            "start": 2592.2
        },
        {
            "text": "\"Probably still dipped because of 3D, right? Like people were like, 'Oh, how do we make games so SNES had over 700?' Yeah, so that was the highest. So NES, then N64 was like, 'H polygons are hard,' and then GameCube was like, 'We figured it out - 552.' So that was an interesting okay, well thank you for that correction, not bad. Uh, Pokémon Go came out on July 6th, 2016. Um, was the other one... And uh, we've got one Zanther saying Sarah says uh somebody in the chat apparently I think it was UN Theore Danny O'Dwyer said 'Straight from the Shire.' Danny, I'm not but you're not from the Shire, no. I'm not from England or New Zealand, no matter how you cut that. I love the way that rhymes, but yeah, straight from the Shire. I have an impossible name to make a nickname from - no one in school could ever do it. O'Dwyer, like what? We'll figure it out, the Kinda Funny best friends are on the case, yeah. Probably Danny, this has been fun, pleasure we should do this more often. Who's this Greg Miller guy? Who is he? Yeah, we don't need\"",
            "start": 2644.88
        },
        {
            "text": "we'll figure it out the Kinda Funny best friends are on the case yeah probably Danny this has been fun pleasure we should do this more often who this GameOverGreggy guy who's he yeah we don't need that Greg Miller he just yells all the time we need Kevin though he basically runs the show Kevin you want to co-host with us yeah sure Perfect all right well Danny thanks again you guys have a great weekend Danny will be back tomorrow with GameOverGreggy GameOverGreggy will be back he's going to be flying back as you're flying over exactly people are crazy we're going to high five in the sky it'll be great don't do that all right well thanks guys uh don't forget to subscribe YouTube Kinda Funny Games do it just shake hands",
            "start": 2695.6
        }
    ]
}