{
    "id": 69,
    "video_id": "pG34yNQhvAw",
    "show_name": "Miscellaneous",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "What is Greg and Colin's Nashville Livestream?",
    "description": "Nashville is wrapping up its first season Wednesday, May 22nd. To celebrate, Greg and Colin are livestreaming their reactions to the hit ABC show and creating one place for every Nashville fan to come and discuss the episode and the season.: http://www.youtube.com/user/GameOverGreggy/featured?v=XNMEYvN8T7g\n\nCatch up on Nashville before the finale: http://itunes.apple.com/us/tv-season/nashville-season-1/id550311456\n\nFollow Greg on Twitter: http://twitter.com/GameOverGreggy\nFollow Colin on Twitter: http://twitter.com/notaxation\nFollow Nashville on Twitter: http://twitter.com/Nashville_ABC\n\nGet the Nashville soundtrack on iTunes: http://itunes.apple.com/us/artist/nashville-cast/id576010239",
    "published_at": 1368450042,
    "duration": 158,
    "transcript_chunks": [
        {
            "text": "Colin, you know what I love? Nashville. Me, too. Yeah, everybody loves Nashville. You out there, you you tweeted us all the time about how much you love Nashville. Want you to meet Juliet Barnes. My mama was one of your biggest fans. She said she'd listen to you while I was still in her belly. Well, that is a charming story. You probably got to go on soon. I'm sure you're going to want to make sure you got those girls tucked in there real good. Yeah. What do you say with this season finale coming Wednesday, May 22nd, we live stream it? I think that's a great idea, Greg. Here's what we're going to do, ladies and gentlemen. We're going to do a Nashville season finale live stream. And basically what it'll be is a place for you to come talk about Nashville. Portillo, knock it off. Come talk about Nashville with us. Hear us talk about Nashville. We'll do it as we it will be a second screen experience as all the cool Portell, come here and give me the meat. So you stop squeaking it. I'll",
            "start": 2.0
        },
        {
            "text": "about Nashville with us. Hear us talk about Nashville. We'll do it as we it will be a second screen experience as all the cool Portell, come here and give me the meat. So you stop squeaking it. I'll hold it up here. Anyways, so here, let me hit all the information. Okay. So Nashville starts 10:00 Pacific Standard Time. We'll start our stream at 9:45 Pacific Standard Time. 15 minutes of us talking about Nashville, recapping season one, everything else we need to know about. All right, 10 o'clock the show starts. Important to point out, we are not streaming Nashville. What we are streaming is a second screen experience where we'll have basically the TV will be behind the camera there. We'll be filming us the whole time. We can talk during the show if we want to, but we'll probably talk during commercial breaks, have a few reactions. Then at 11 o'clock when the show is over, we'll do, hey, here's the whole breakdown of season one. What we thought we thought of this episode. We'll have a",
            "start": 37.6
        },
        {
            "text": "commercial breaks, have a few reactions. Then at 11 o'clock when the show is over, we'll do, hey, here's the whole breakdown of season one. What we thought we thought of this episode. We'll have a rundown. Of course, it'll be here on youtube.com/gameoverreggy. You can leave comments there. We'll have a live chat going. We'll be able to talk to people. We'll be able to bring in your Twitter questions at gameoverggy at no taxation. It it'll be a huge community experience about Nashville. You think they'll play down? I I think that's how they're going to that's what they're going to that's how the finale ends at the Grand Old Opry. They start playing down by 311. I hope it all right. Let's get the hell out of here. All right, ladies and gentlemen. Uh the 22nd of May, Nashville season finale. It's a party with Greg and Colin. It's a live stream event. youtube.com/gameover greggy. There's your damn toy for squeak as much as you want. Well, we'll be that never needed to be fixed.",
            "start": 76.72
        }
    ]
}