{
    "id": 1010,
    "video_id": "-HYp65Nqrbw",
    "show_name": "Community",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty"
    ],
    "title": "Thank You, Kevin Dunkel!",
    "description": "Thank you for your three months of support on http://www.patreon.com/kindafunnygames!",
    "published_at": 1436846121,
    "duration": 250,
    "transcript_chunks": [
        {
            "text": "thank you Kevin Dunkle Flavio call the dunks jeez the dogs young madam don't Kevin Duncan got a dunk by Gatorade thank you Bruce report on patreon.com / kind of funny games sorry little video is a bit later than we wanted to be heaven Dunkle is in the service yes yes for the Navy oh so easy like this is a problem can you don't want I don't want to say the wrong things very got you don't have enough information on your patreon page here you know Twitter no Facebook yet the link to its gotta be navy red dodge the Coast Guard were the same out uniforms his navel nose away yes got a Navy yeah that's my assumption is just I don't want to offend someone in the coast guard Jake Long image was gunning by Kevin by appreciating a service no but if it's like if you call marina soldiers I think about really fence I know personally alone that's cuz they're Marines exactly but what do you call Ranger Ranger Parker they're coming so soldier probably what about a Navy SEAL he's a naval officer a seal mm-hmm",
            "start": 0.0
        },
        {
            "text": "Fence, I know personally alone that's cuz they're Marines exactly but what do you call a Ranger? Ranger Parker, they're coming so soldier probably. What about a Navy SEAL? He's a naval officer, a SEAL. Mm-hmm, I think thanks you yeah alright there's eight million Kevin Dunkleman put this one's a Navy Kevin... yeah this must be him all right click on it he is 5 tweets games chicks it's great fun facts it's gotta be him but he hasn't tweeted since 2011 but nonetheless my assumption is some Navy making you smile games chicks and random funny toys / where the Navy takes me this must be him see I like this detective work we're doing you are a gumshoe Greg, true detective true um do you guys know where the term gumshoe comes from? Gum gets on the sheet on this detective she wants when he was going through a crime scene and they wouldn't have found a clue stuck between the floorboards except the gum got down there grabbed it yanked it up and like holy **** the killer's name was Charlie Mackintosh.",
            "start": 45.39
        },
        {
            "text": "a crime scene and they wouldn't have found a clue stuck between the floorboards except the gum got down there grabbed it yanked it up and like holy **** the killer's name was Charles Manson make it is exactly how they solve those murders yes Charles Manson that's how nice he was how I solve this murder yeah the household slaughtered and he left a piece of paper with his name underneath the floorboards I said I did it I look for the guy that carved the swastika in his forehead that's me Charles Manson good PS this floorboard squeaks you should buy get down like that oh my goodness gracious what a fun time what was that call with those murderers called the Manson Family like now they were like the I thought I was just I don't know Manson, I mean, the Manson Family it's like a massacre Kevin want you ask you shitty watch okay well tell me who google ha like I like what I call him Charles Manson killers it comes back it's like if you want to Swanson TV dinner go to the stock if you",
            "start": 90.93
        },
        {
            "text": "Kevin wants you to ask you, \"Shitty watch?\" Okay, well, tell me who Google has like... I like what I call him Charlie Manson killers. It comes back; it's like if you want Swanson TV dinner, go to the stock. If you want Tyson chicken, that's about as coherent as the tweets that Kevin sends out there, that big so though it's all it's all perfectly legal; it's all perfectly legal. Kevin Duncan we don't know much else about you but you seem like a great young man. Thank you for your service, yep, and thank you for supporting this stupid show and this awesome endeavor that we have going on right now, that this also may be stupid uh I wish I knew more about you but you only follow well he only follows six people right but he followed Platonic; I i wonder if he did this recently right let me cuz yeah he has been on here all day like I'm confused by this phone so I want to know more about them, so files I'm cooking though I want to use one father when you don't the Platonic thing okay what the hell's going",
            "start": 139.61
        },
        {
            "text": "on here at all day like I'm confused by this phone so I want to know more about them so files I'm cooking though I want to use one father when you don't the platonic thing okay what the hell's going on in that picture followers and Leigh Larry Cole isn't real blogger undergraduate and electronics and telecommunications who hasn't used his Twitter account since February 10th when he tweeted out a bunch of things that are clearly not from him so let's see when the last time you actually tweeted something that that he meant to tweet out because I want to know more about this looks like that YouTube video in a minute it's unclear right now these are all slept tweets I camp you're right it's unclear somebody's if you see Larry on your boat tell Larry he's been hacked shuttle a shout out to Larry shout out to Kevin Dunkel thank you for your support Kevin thank you Kevin",
            "start": 197.63
        }
    ]
}