{
    "id": 1066,
    "video_id": "a6rBMq-N6Vc",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "Let's Play Legend of Zelda: Tri Force Heroes - Kinda Funny Plays",
    "description": "Greg and Tim went to Nintendo and partnered-up for Link's latest adventure.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1438282800,
    "duration": 526,
    "transcript_chunks": [
        {
            "text": "what's up everybody welcome to another let's play here on youtube.com/ kind of funny games I'm Greg that's Tim we're still in Nintendo cuz Nintendo's got a bunch of amazing games coming out this one's coming out in Fall The Legend of Zelda Tri Force Heroes I said it faster than you sorry all right hold on I got to select my character okay o I know what I'm doing what are you going to do just tell me I'm going to be Zelda Zelda costume the Zelda dress so I can just be I can be hero tunic oh you know the big bomb outfits pretty cool I'm going to do that cool there we go you excited for this yes I am we got to work together we were told we've been at each other's throats we're not alone we have Mr Nintendo himself here with us Mr Nintendo came all the way out here for us little old us and he's going to play with us so you got a bow on two special shoot Arrows with Y I'm pretty special we all have it oh ah I'm figuring it out hey that's me I'm the blue oh I'm the blue guy on your screen Tim welcome",
            "start": 0.16
        },
        {
            "text": "play with us so you got a bow on two special shoot Arrows with Y I'm pretty special we all have it oh ah I'm figuring it out hey that's me I'm the blue oh I'm the blue guy on your screen Tim welcome there we go Tim get over here get up there you got to get at this key Tim Tim jump there we go it's me now got it yay I'm doing all the real work here you know what this reminds me of Greg what's that it reminds me of The Legend of Zelda: Four Swords Adventures, that was a great game I loved it a lot look at us we did it Triforce Heroes yeah it's true true oh I see what they did there with the title yeah they know they're good oh I'm getting totem oh what the hell time what let me I'm going to do that to Tim now hold on wait where are you Tim I got do something here oh God no oh see this is where things get bad guys right we think we're all safe we think we're all cool and then we're not we're not at all all right don't try to stab me just there we go okay it's",
            "start": 37.24
        },
        {
            "text": "oh God no oh see this is where things get bad guys right we think we're all safe we think we're all cool and then we're not we're not at all all right don't try to stab me just there we go okay it's fighting time I got a Rupee I have one Rupee so do you oh I no stupid stupid oh we share Rupees this is a game of teamwork okay see Greg when you beat all the bad guys the doors open oh okay that's how video games work oh you can call me oh damn oh I just got lunged kind of liked it though all right it's teamwork mhm that was good see it's good thing we got Mr. Nintendo himself is cheering us on all right so for those at home that don't know I am the green one Greg is the blue one and Mr. Nintendo himself is red I like your trading cards quite a bit it's amazing what you've done with this Trading Card Company playing cards damn it screwed up my own joke it's all right all we've all been hey question for you yes that or no no okay no okay running around cuz it's totem time and I'm",
            "start": 101.96
        },
        {
            "text": "Trading Card Company playing cards damn it screwed up my own joke it's all right all we've all been hey question for you yes that or no no okay no okay running around cuz it's totem time and I'm a little scared totem time and we're running away wow you're just you're just straight up leaving got this man he can handle I don't know Mr. Nintendo got this he's over here we'll be there in a second guys I'll throw you Greg go for it see we're get up there and hit that thing we got a totem time all right totem time oh God hit it you got me blocked I can't I can't hit it oh dang it all right tot him Greg come on you know y'all make it act like it's so easy oh we have just just Mr. Nintendo's going to get him Mr. Nintendo ah now all right well one's dead guys we're dying I'm dying somebody's dying get on get on you know can you just stop ordering me around like I thought aiming I'm aiming you perfect Mr. Nintendo there everybody happy no we have 139 rupees that's all that matters someone",
            "start": 175.44
        },
        {
            "text": "get on, get on, you know, can you just stop ordering me around? I thought, aiming, I'm aiming perfect, Mr. Nintendo, there everybody happy, no we have 139 rupees, that's all that matters, someone aim me, I'm trying, everybody, there we go, yeah, Mr. Nintendo, so happy, you got to hit that one over there, no, all right now, there some mistakes were made on that one, I'm not going to lie, oh we're so sad, it's a good thing we have fairies, this is fun, yeah, okay, I just want to be, yeah, put me in the middle, I think that's the best place for don't need to do anything and I just get, I just chill back up, Mr. Nintendo, send you to back up, listen to Mr. Nintendo, what you you're doing the exact opposite got to aim him too see it's not so easy it's not talking a lot of everybody's talking a lot of crap about Greg Miller not no more all right oh God totem you got to aim Mr. Nintendo I was back in control taken over yeah let's have him oh God where'd you go oh God all right I can shoot real good I'm just not",
            "start": 240.6
        },
        {
            "text": "Miller not no more all right oh God totem you got to aim Mr. Nintendo I was back in control taken over yeah let's have him oh God where'd you go oh God all right I can shoot real good I'm just not going to name it you can shoot real well I can't speak real good don't worry we're a Flawless team Mr. Nintendo running us over there won't be dangerous at all team is low on Hearts but that doesn't matter we're only Low video oh my God M you're going to kill Mr. Nintendo oh God all right go go door's open Mr. Nintendo where we going I'm not sure Mr. Nintendo is leading oh there's Hearts yeah again oh doctor right yeah run uhoh don't don't be a hero Mr. Nintendo can't oh yeah Greg's real happy about that yes all right all right making good progress all right okay he teleported I'm feeling it n it's okay I got scared didn't need to false alarm everybody Tim don't hit this guy with your sword okay I don't know if he ever played these games before oh now o I figured he shocked me get him",
            "start": 306.32
        },
        {
            "text": "it's okay I got scared didn't need to false alarm everybody Tim don't hit this guy with your sword okay I don't know if he ever played these games before oh now o I figured he shocked me get him get him there we go there we go hold on oh yeah yeah yeah that was good that was real good what kind of funny is all about Mr Nintendo oh Lord Mr Nintendo to of time recharge you we did it everybody that was pretty good I credit you thank you you did some good shooting here all I'm a shooter oh I didn't realize that there's all that stuff on the bottom screen on to our next adventure yep once again Triforce Heroes it's who we are oh there you go the next adventure will come later sometime in the fall mhm 2015 2015 Tim Greg Mr Nintendo the Triforce Heroes themselves thank you guys so we are the Triforce Heroes we are it's kind of weird they made a game about us like thanks Nintendo Mr Nintendo can you tell Nintendo thank you I I will do that I assume I assume this means thank me",
            "start": 396.04
        },
        {
            "text": "we are the Triforce Heroes we are it's kind of weird they made a game about us like thanks Nintendo Mr. Nintendo can you tell Nintendo thank you I I will do that I assume I assume this means thank me so we are literally one step away from being AI's yeah well that's that's the next step ladies and gentlemen thank you so much for watching YouTube.com/KindaFunnyGames every day noon every weekday let's be real yeah Monday through Friday some days we screw them up and we take them down so you know we won't do that for this one though",
            "start": 486.56
        }
    ]
}