{
    "id": 1022,
    "video_id": "MNsRP3nRAe8",
    "show_name": "Gameplay",
    "hosts": [
        "Tim Gettys",
        "Colin Moriarty"
    ],
    "title": "#ThankYouIwata - Let's Play Kirby's Adventure - Kinda Funny Plays",
    "description": "In honor of Iwata, we play Kirby's Adventure.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1436900402,
    "duration": 759,
    "transcript_chunks": [
        {
            "text": "greetings and salutations welcome back to Kinda Funny Games I'm Colin Moriarty and this is Tim Gettys we had some unfortunate news this past weekend Satoru Iwata, the former president of Nintendo, a longtime Nintendo employee who'd been there and bouncing around different developers including HAL Laboratory for 30 years, uh, he passed away, uh, we figured the best way to celebrate the man because everyone has poignant things to say about him right they're saying all the right things and we appreciate that we how can we contribute to that well let's just celebrate one of his games this is Kirby's Adventure it's a very late NES game came out in 1993 how Laboratory uh put it together and he produced this game so I figured that I figured that we would uh just play through it a little bit and just kind of remember this game and how good it was and of course maybe this is our best way we can sync up with Iwata and pay him our respects yeah it's crazy to think about it man 1993 a new NES game coming out like",
            "start": 0.04
        },
        {
            "text": "this game and how good it was and of course maybe this is our best way we can sync up with Satoru Iwata and pay him our respects yeah it's crazy to think about it man 1993 a new NES game coming out like the that means the Super Nintendo has been out how many years couple years at that point so like that's that's insane like I I was never the biggest Kirby fan um like playing the games cuz I I always felt like they were just like a little too easy and I felt like I wasn't the exact audience um but then after playing Smash Bros and you know obviously Masahiro Sakurai and a lot of the the creators of Smash Bros worked on Kirby as well right yeah Sakurai directed this game yeah and um you can see the influence and when you play it it's like it feels like Smash Bros like the physics of it all and everything about it and it's it made me appreciate the game a lot more and um you getting all the powerups and then just the way the jumps work and all that stuff it's funny that when you use Kirby in Smash Bros",
            "start": 36.52
        },
        {
            "text": "it and it's made me appreciate the game a lot more and um you getting all the power-ups and then just the way the jumps work and all that stuff it's funny that when you use Kirby in Smash Bros he feels I think better than a lot of the characters just in the sense of like he he makes sense you know and having the multiple jumps and all that stuff it really kind of it just feels right there's something about so let me back up this is you know this is a Kirby game that people really know but it is not the first Kirby game of course, of course Dream Land is the first Kirby game came out 91 for Game Boy but I think that this was the first game that realized him in a way that I wanted to play him as I needed that color I needed I needed a little bit of that that hue I like using the NES controller people that remember when this game came out 93 will'll remember that this was one of the first Nintendo games published with the red top box which means it's a it's a top loading era NES",
            "start": 79.88
        },
        {
            "text": "controller people that remember when this game came out in '93 will remember that this was one of the first Nintendo games published with the red top box, which means it's a top-loading era NES game. It's one of the last first-party games Nintendo released, up there with Mega Man 6, which they published in the West, and things like Yoshi's Cookie and stuff like that. So, it is a very late NES game. And I also agree with what you're saying that these games are not hard. I don't think they were really designed to be hard at least during this era; they were a little more accessible than the Marios for instance. But there's something authentically special about this game and its creator, Satoru Iwata, and of course, the king is in this game as well. Um, but I really, really do enjoy this game, and um, I feel like even though um you know a lot of stuff's going on, I'm learning a lot about him, and I've known quite a bit about him, but just all the games he touched or worked on.",
            "start": 117.6
        },
        {
            "text": "this game and um i feel like even though um you know a lot of stuff's going on about Satoru Iwata, i'm learning a lot about him.  i've known quite a bit about him but just all the games he touched or worked on yeah this is still one of the most consequential games that he definitely helped make.  i mean what's really interesting to me is like you know i've known his influence on video games and on Nintendo and all that stuff for years because he's been such a prominent figure and Nintendo is my favorite of all the video game things at all and so he was the dude at the press conferences you know he was the guy that i was like waiting to hear make announcements and do all that stuff but now that like this happened and everyones kind of respecting all the things hes known for im learning so much about him that ididnt know like i didnt know that he had his hands in all of my favorite games of all time like i know smash Pokemon Gold and Silver like its crazy like he he was the guy",
            "start": 153.24
        },
        {
            "text": "so much about him that I didn't know like I didn't know that he had his hands in all of my favorite games of all time like I know smash Pokemon Gold and Silver like it's crazy like he he was the guy that got the code um running for Pokémon Stadium on N64 like that's crazy and he's the one that got Kanto into being the extra world in uh Pokémon Gold and Silver and it's like that's very special you know I agree yeah he's touched a lot of different games there's a lot of interesting stuff I was reading something from our friend Jeremy Parish about how he really helped out with Balloon Fight back in the day during the launch that they were having a lot of trouble you know um getting some of their games finished in time or getting their games finished in a timely fashion to get them out to market and one of the things that you really learn about Satoru Iwata is that he was apparently like a master programmer you know you you have to have the designers you have",
            "start": 192.52
        },
        {
            "text": "fashion to get them out to market and one of the things that you really learn about Satoru Iwata is that he was apparently like a master programmer, you know. You have to have the designers, you have to have more of the design aesthetic with guys like Masahiro Sakurai right, the guys that design the games and create the games, maybe draw the games, you have your animators and your artists, your dot artists, and all those kinds of things. But then you have the guys who really have to make the games run, and not that he didn't have creativity because of course he had a right brain creativity to him as well. But he was the man that really helped these games run, yeah. And uh so a design is great and an idea is great but if you can't make it run then who really cares and he was the guy that was able to do that and that's how he really gained respect first at HAL with games like this and then when he came to Nintendo um and by 2002 he really took over Nintendo a company that was very",
            "start": 236.48
        },
        {
            "text": "was able to do that, and that's how he really gained respect first at how with games like this, and then when he came to Nintendo. Um, and by 2002, he really took over a Nintendo company that was very different than the Nintendo he came up helping um in any meaningful way. I think that uh that's what's so interesting about his legacy, I think to me is that he showed great brilliance and foresight with uh releases of platforms like the DS and Wii but also saw some struggles and some tribulations with things like the Wii U um and the 3DS early on, but he wrote that 3DS ship. And um a lot of people can't help but wonder um what the company is going to look like without him, and who's going to take over for him? Yeah, I mean there's so many questions, and it's also interesting, but I think my favorite thing of all this is seeing all the PE all the tributes and all the the people with all the different quotes. And how come I keep messing that up um like there's that quote from his GDC",
            "start": 270.92
        },
        {
            "text": "\"Thing of all this is seeing all the tributes and all the people with all the different quotes and all. How come I keep messing that up? Um, like there's that quote from his GDC speech well, like in 2005 or six where he was like, 'You know, on my business card it says I'm a corporate president, but on my business card it doesn't say \"I'm a corporate president,\" it says \"I'm a corporate president\" - no, that's not right. It says \"I'm a corporate president\" in my head, I'm a game developer, but in my heart I'm a gamer.' Right? And it's just like, that's awesome, you know? I agree, and that's what Nintendo, I think, is always engendered, and why I have such respect for Nintendo as game developers. I might not have too much respect for them anymore as a hardware developer, but their games just work - their games are just fun. They have some misses, yeah, but they're still the cream of the crop developer, um, as far as I'm concerned. Their whole team, their whole system of studios and internal games that they create, a lot of variety and stuff like that. And again, this is a lot of this is incubated by people that really do understand.\"",
            "start": 311.32
        },
        {
            "text": "their whole you know system of of studios and internal um games that they create a lot of variety and stuff like that and again this is a lot of this is incubated by people that really do understand games and have been in the industry for a long time like Satoru Iwata for instance so that's what I have a lot of respect for someone like him because he really was in the trenches he worked his way up from a very Junior member of an organization to the senior most member of the organization and so they through a lot of financial success and one of the things you have to you can't ignore about Nintendo specifically is when they were fi when they were finally having For the First Time Financial problems in terms of you know they had money in the bank but they weren't making money they were losing money he uh he took a pay cut 50% which is symbolic because it's not going to obviously do a dent to what the money they need it was just symbolic to say like we maybe we don't have to lay as many people",
            "start": 357.84
        },
        {
            "text": "he uh he took a pay cut 50% which is symbolic because it's not going to obviously do a dent to what the money they need it was just symbolic to say like we maybe we don't have to lay as many people off or maybe we you know I'm in the trenches with you and I could easily just sit here and point fingers about what things people are doing right and what people are doing wrong but the fact of the matter is I can help make this problem right or at least show solidarity yeah and uh who can't help it respect that yeah by the way you can totally see I think it's mebe just reading into it uh these platforms remind me of Mario 3 but but parts of this game remind me a lot of Mario 2 oh yeah no definitely Parts remind me of Mario 2 and a lot of it reminds me of um Yoshi actually like Yoshi's Island and that stuff so it's cool to see what this game would later influence and what it was influenced by sure yeah it's fun it's fun to watch it man cuz I really Dam I really just really did dig this game",
            "start": 392.6
        },
        {
            "text": "that stuff so it's cool to see what this game would later influence and what it was influenced by sure yeah it's fun it's fun to watch it man cuz I really Dam I really just really did dig this game um there was something there's something approachable about it it's not difficult like we were saying it's not going to make you want to throw your controller it's fun I mean I think that's kind of the cool thing about is this is like such a uh a Nintendo game where it's like it's just fun and this is really this isn't Kirby at his embryonic stage but this is Kirby at his very at a very young age um being only the second Kirby game of a couple of dozen that exist now or whatever but I haven't played a new Kirby game in in a long time I was saying since maybe this 64 days I I haven't actually played any of the games that existed since Crystal shattered Crystal or whatever it was um I got the Master Sword here later seen in Smash oh God man some slowdown yeah the slow Down's killing me here",
            "start": 433.36
        },
        {
            "text": "any of the games that existed since crystal shattered crystal or whatever it was um i got the master sword here later seen in smash oh god man some slowdown yeah the slowdowns killing me here it's cuz the stars on the screen there this i don't remember this game having significant slowdown like that especially such it's somewhat rare to have an elite nes game that's mhm they they knew to use the the hardware so much better than they did eight years before yeah you're cruising right through yeah i'm going to do one more level let's do one more oh is this the one that ends with the actual boss fight well i don't remember yeah i i like how that particular enemy looks like a slime from dragon quest oh god who don't shake your butt at me see what weird i feel like they changed this in the uh in the later kirby games but you don't keep hitting jump to jump you have to hit up i don't remember that yeah that seems natural to me but i guess it's probably not the most obvious way to play it",
            "start": 480.28
        },
        {
            "text": "in the later Kirby games but you don't keep hitting jump to jump you have to hit up I don't remember that yeah that seems natural to me but I guess it's probably not the most obvious way to play it damn this guy is up this guy's life is up yeah boy done look at this poor Mushroom Man I ain't gotten nothing from it oh God it is funny looking at the aesthetic how how basic the aesthetic is yeah um I don't necessarily think it's a bad thing it's just it's just like when like this came out at the same time as Mega Man 6 for instance right and like they're night and day but like this was really created off of the shell of a Game Boy game which we also have to keep in mind I mean it's not a Game Boy game they did things to it a lot of things to it but how complicated can you really make it how complicated do you want to make it you know yeah it's just it's interesting to me whenever I play these games I always wonder like who is the audience like it you know it's the the oh",
            "start": 534.2
        },
        {
            "text": "it how complicated do you want to make it you know yeah it's just it's interesting to me whenever I play these games I always wonder like who is the audience like it you know it's the the oh **** it's the easier Mario but then it's like why do we need that is Mario already the easier Mega Man or whatever you look at it but then I don't necessarily think that this is just for little kids no I don't think so either I I think that it's probably supposed to be accessible to them but I think there's something cute about the characters I think that I I personally like the game because I think it's just it's cute I think Kirby's just an authentically like he's a cool dude he's just a yeah he's just a dude like just hanging out you know that's just what Kirby is he's just a dude hanging out did the light go off again cabin mhm we're having these chronic problems is it back y that makes me nervous we should probably look into that no it's out again yeah that's weird it's back again that's it",
            "start": 592.56
        },
        {
            "text": "the light goes off again cabin mhm we're having these chronic problems is it back yeah that makes me nervous we should probably look into that no it's out again yeah that's weird it's back again that doesn't really matter at this point we're almost done with this let's play oh you know a lot of people forget too that it was partially responsible for one of the most classic Super Nintendo uh games which is Earthbound as well so maybe we'll download that and play that in the future as well but in the meantime that's Kirby's Adventure um on NES came out in 1993 um very late NES game as we said earlier you can play it all over the place you can get on Virtual various virtual consoles if you want to buy it digitally of course you can also get the NES cartridge um you should play it it's a it's a cool piece of gaming history and we wanted to definitely show it to you as Satoru Iwata was one of the producers of this game along with many other games and we appreciate him",
            "start": 632.44
        },
        {
            "text": "Play it, it's a cool piece of gaming history, and we wanted to definitely show it to you as Satoru Iwata was one of the producers of this game, along with many other games. We want to appreciate and show him love and respect. So as we uh fight this uh this this is actually a classic boss. I I I remember this boss from the commercial. I feel like yeah it's also in the Super Smash Bros stage in Dreamland stage. Um so yeah that's Kirby's Adventure. Any any final thoughts, Tim? No man, just you know, like, just everybody keeps spreading your positive words about Iwata all your memories and all that stuff because you know it's we his memory will live on forever in games like these, and people are going to be playing these games forever, whether it's Super Smash Bros or Kirby or Pokémon or Earthbound or whatever. Just sure, whatever your memory is, try to play a little bit tonight and see how it feels indeed. We tip our cap to you, um, and wish our very best to his family and friends of course and his",
            "start": 682.52
        },
        {
            "text": "just sure whatever your memory is try to play a little bit tonight and see how it feels indeed a we tip our cap to you um and wish our very best to his family and friends of course and his colleagues at Nintendo uh we are kinda funny games we do a new let's play every weekday 12 p.m. Pacific time you can come check them out of course we have a lot of other content what did I say 12:00 p.m. oh no so that's not true at all no it's not no 12:00 p.m. is the new Game Over show on youtube.com/ kindafunnygames that's a different channel it is noon Pacific time all right bye",
            "start": 722.64
        }
    ]
}