{
    "id": 993,
    "video_id": "NSjXfhaN9tI",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Our Worries About The Final Fantasy VII Remake - Kinda Funny Gamescast Ep. 26 (Pt. 1)",
    "description": "Tim and Colin discuss their worries about Final Fantasy 7 Remake.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1436187600,
    "duration": 1494,
    "transcript_chunks": [
        {
            "text": "what's up guys welcome to the first ever episode 26 of the Kinda Funny Gamescast as always I'm Tim Gettys I'm joined by the coolest dudes in video games Greg Miller Colin Moriarty yay it's your golden episode cuz you just turned 26 I did so this is your golden episode if episodes were years this would be how old I the show would be how old I am I mean were years the show would be as old as you are that would make sense yeah yes but they're not they're just episodes yeah but the number the number is still how old you are numbers don't mean anything El okay this is a nice shirt how about that it is I like it a lot It's upsetting there's a lot of origin story to this I won't get into the whole thing but I originally bought my pigeon shirt because I was jealous that Scott Lowe had a dinosaur shirt sure and I wanted that dinosaur shirt and they stopped selling it so then I saw the pigeon shirt I'm like pigeons will do so now I've just the dinosaurs of the sky yeah this D this like",
            "start": 0.31
        },
        {
            "text": "shirt sure and I wanted that dinosaur shirt and they stopped selling it so then I saw the pigeon shirt I'm like pigeons will do so now I've just the dinosaurs of the sky yeah this D this like struggle I found the Sharks and um here they are they're the dinosaurs of the sea so that was that was your story that was like a long story just that no there's more details we don't need to get into all that you bought a pigeon shirt and then later bought a shark shirt yeah that was the story we just heard yeah yeah yeah okay there's a Mickey Mouse shirt in there somewhere too yeah mhm it's part of your new prints I just like all these like all over animal print stuff it's good it's a look do we still count Mickey Mouse as an animal mhm he is a mouse I know I know don't get me wrong I technically he's a mouse but he's also a person yeah guys this is the Kinda Funny Gamescast every week we talk about video games four topics broken up day by day Monday through Thursday on youtube.com/ kindafunnygames",
            "start": 51.76
        },
        {
            "text": "He's a mouse, but he's also a person. Yeah, guys, this is The Kinda Funny Gamescast every week we talk about video games. Four topics broken up day by day, Monday through Thursday on YouTube.com/kindafunnygames. Full episode on Friday at that same place. Also, you can get it early on Patreon.com/KindaFunnyGames. It's great; you should do it. It's awesome. This one is worth a dollar. I don't know if they've been worth a dollar for a while, but this one definitely is. This one's going to be good; it's going to be good specifically because the first topic of the day is Final Fantasy VII and I am so excited to talk about this. The remake's coming, and I want to know you guys' thoughts on this: what's it going to be? When's it going to come out? Will it ever come out? What systems it's going to be on? All the questions there are these burning questions everyone's talking about on the internet; everyone's excited about it, but everyone's trepidatious. But why? Because they haven't started it yet. The director hasn't even begun working on it.",
            "start": 90.32
        },
        {
            "text": "Our worries there's these burning questions everyone's talking about on the internet everyone's excited about it everyone's trepidacious but why because they haven't started it it's the director didn't know he was the director C years away that was my favorite story was when I think it was Nomura right yeah was saying that uh it was on Kotaku I think when they were saying that he didn't even know that he was in charge of the game until they saw like some sort of slideshow or whatever in the at at Square Enix in Japan and he's like wait I'm the director of the game they're like yeah you're the director of the game he's like no one told me that so off to a good start yeah Final Fantasy remake yeah that game I mean the thing the thing the reason people have trepidation about it is because and they should is because it's a Square Enix game coming out of Japan so you have every reason to be nervous about it not only in terms of its quality but in terms of its timeliness Right Final",
            "start": 134.6
        },
        {
            "text": "should be because it's a square enix game coming out of Japan, so you have every reason to be nervous about it not only in terms of its quality but in terms of its timeliness. Right, Final Fantasy XIII - very questionable trilogy; some people like it, a lot of people don't. Um, and so it makes sense to be nervous about this. But I think moreover people are nervous about it because it seems like square enix has a lot of balls in the air, um, and some pretty important balls as well with Final Fantasy XV and Kingdom Hearts III - some very important balls. Kevin, yes. So uh adding another important ball in the air when they're already juggling the clown known as square enix, and I'm not I don't mean that as a derogatory thing but let's just imagine that the clown is juggling. You're painting this metaphor two balls is usually enough yeah two balls is enough three balls you know it's getting crazy so yeah I think people are nervous about it because the game is so clearly in pre-production or",
            "start": 175.64
        },
        {
            "text": "Our worries about the Final Fantasy VII Remake is a big deal, two balls is usually enough, yeah, two balls is enough, three balls, you know, it's getting crazy, so, yeah, I think people are nervous about it because the game is so clearly in pre-production or just, you know, as they've entered production, so you're looking at 2019 probably for this game and I would and I'd be shocked if you saw it before then, that's like a best-case scenario, 2019, yeah, because Square Enix hasn't had a lot of best-case scenarios lately in terms of getting games out, yeah, it's it's a problem just in the sense that this isn't something you do lightly, this is a game that is now 18 years old, it can't be just remade or remastered, they are releasing the PC port of it to kind of tie people over on PlayStation 4, which I respect, but and I'll play it and I'm excited about it actually, I'm very excited about it, um, but are you going to play through it, are you just going to play no, I'm going to play through it, you're going to beat it, yeah.",
            "start": 221.2
        },
        {
            "text": "play it and I'm excited about it actually I'm very excited about it um but are you going to play through it are you just going to play no I'm going to play through it you're going to beat it yeah really I haven't beat Final Fantasy VII since I think I was in high school so man um yeah no I'm going to play it and beat it and uh I'm looking forward to it it'll be an old kind of experience that that I'm looking forward to but this isn't a game that you just hand off to someone it's it's important that they do this right which is why I think that they could probably do it in three years but I don't think they will because they have to now sit down with the script and figure out like well do we want to rewrite certain parts they have to S sit down with the battle uh system Materia and all these kinds of things be like is there anything that needs tweaking here uh they have to be very very careful with what they do with this game this is a game that is going to sell millions and millions of",
            "start": 261.6
        },
        {
            "text": "Our worries about the Final Fantasy VII Remake - Kinda Funny Gamescast Ep. 26 (Pt. 1). kinds of things be like, is there anything that needs tweaking here? Uh, they have to be very very careful with what they do with this game. This is a game that is going to sell millions and millions of copies and needs to be done right because Final Fantasy VII while I don't think it's this incredibly sacred game that a lot of people think it is, the fact of the matter is a lot of people do think it's a very sacred game so I feel bad for them that they you know now that it's real that they're actually doing it. It's something people have been asking for for years but I didn't think they'd ever really do it and I thought that part of it was the fact that they don't think they could do it, yeah so there's every reason to be nervous about it but there's reasons to be excited too mhm so that's thing is like I'm I'm very excited about it but I just as nervous because it's like there's no way that they're going to recapture the magic this there's no way this is going to be what people want it to be.",
            "start": 296.76
        },
        {
            "text": "like I'm I'm very excited about it but I just as nervous because it's like there's no way that they're going to recapture the magic this there's no way this is going to be what people want it to be in their heads and that's because really that's my question is what do you want it to be like what is it that you want because if you just want uh the exact same game but just prettier that's not going to happen like there's no way they'll ever do that and it's like should they even do that like is there a purpose for that and would that game even be the same released now right now you're talking n stuff I'm going to go get a coffee I I don't like Final Fantasy VII yeah never played I started playing it I never could get through it cuz it was really boring um no I mean I would want a scene for scene shot for shot remake of the game I mean I think that's like the kind of how you have to treat it it's not a reboot right so it's implicitly called Final Fantasy VII or explicitly called Final Fantasy 7",
            "start": 330.12
        },
        {
            "text": "shot for shot remake of the Game, I mean I think that's like the kind of how you have to treat it. It's not a reboot right? So it's implicitly called Final Fantasy or explicitly called Final Fantasy VII Remake, which they said that that's not going to be the title and that they only did that to show at the D3 press conference, at E3, that like this isn't a movie, this isn't a whatever, this is a game. And to me, that means you know I think that you know, and these are this is what we always talk about with words needing definitions. Like I don't know what a lot of people think about with remake but to me it means you remake what is already existed. You remake it again, um which means that you stay true to it as opposed to a reboot which is like the Devil May Cry reboot from Ninja Theory or something which is a different game, um or you know the reboot of whatever movie you know has been rebooted in the last seven years which is you know everything so I I personally want to see something",
            "start": 368.6
        },
        {
            "text": "Our worries about the Final Fantasy VII Remake. I personally want to see something that's totally true to the original, so something similar to Resident Evil on the GameCube compared to the PS1 one, where it's like it was very faithful but you know there was added stuff that would be to me the ideal situation. I just still don't think they're going to do that. I don't either. I I I I just to me if they want to re you know obviously they if they want to rewrite it parts of it, I think that's fine. The translation we got in the States on PS1 for Final Fantasy 7 is notoriously bad. Um as a lot of translations were at that point. I mean when we were talking to EA about Castlevania: Symphony of the Night and I said to him um what is a man he was he didn't know what I was talking about and Ben Judd was talking about how like that is not even in the original game of Japanese he asked what is",
            "start": 407.88
        },
        {
            "text": "the Night and I said to him um what is a man he was he didn't know what I was talking about and GameOverGreggy was talking about how like that is not even in the original game of Japanese he asked what is a person and that's a totally different thing you know so I think that there's a lot of that kind of stuff going on in Final Fantasy VII so a lot of the translations are just bad so if they want to rewrite it on the Japanese front to make it even better in their language and then have a proper localization like we get now I think that's totally fine but there are just certain things you cannot remove from the game and I think it's very dangerous to start talking about Final Fantasy VII in in a revisionist sort of way because I don't think that people that want this game want that if that's what they wanted they would get a new Final Fantasy VII game which we already got with Crisis Core Etc so mean that that's kind of the problem though is that you know this revisionist thing where if they were",
            "start": 447.6
        },
        {
            "text": "wanted they would get a new Final Fantasy VII game which we already got with Crisis Core, etc. So mean that that's kind of the problem though is that you know this revisionist thing where if they were to rewrite it like you're talking about just making the quality of what already existed better, like the grammar and just like the storytelling telling the same story just you know more concisely and and just better creating a better world with Midgar and all this stuff but the problem is with what we've seen of the universe of Final Fantasy VII since 7 has come out there hasn't been anything that's been amazing, there's been some stuff that was decent I enjoyed Crisis Core a lot, yeah I like Crisis Core as well, Duran (corrected from \"curus\") was obviously not very good, not well received and like having children I mean it's one of those things where it's like everyone was so excited for that being a movie and like continuing and stuff but really what it comes down to is that movie was just fan fiction you know and it",
            "start": 482.4
        },
        {
            "text": "one of those things where it's like everyone was so excited for that being a movie and like continuing and stuff but really what it comes down to is that movie was just fan fiction you know and it was a fan service is a better way to put it it was just like it gave everyone what they thought they wanted at the time but then once they saw it they're like this isn't what I wanted like that's not Cloud that's not like why is Sephiroth back like this like all these questions came up and they weren't you didn't feel fulfilled watching it you were just like oh this is cool they're fighting you know but it just felt like a glorified CG cut scene sure which is great but it's like that wasn't what Final Fantasy 7 was it didn't have the humor and it didn't have the just personality of the characters you know and it it was it was like a weird Hot Topic meets realism meets Dragon Ball thing you know and we kind of saw that then go forward into the aesthetic of Final Fantasy 13 but what's",
            "start": 524.96
        },
        {
            "text": "You know, and it was like a weird Hot Topic meets realism meets Dragon Ball thing, you know. And we kind of saw that then go forward into the aesthetic of Final Fantasy XIII but what's interesting is I don't think, and especially now that we've seen this trailer, it obviously looks at like Advent Children. It's like I don't understand how they could rewrite it without just making it more for lack of better term emo and just more fitting the aesthetic of their the rest of the Final Fantasy VII universe as opposed to the one standalone thing that is the original game. Sure, yeah, I, I, and this is the hazard of doing something like this is that I don't really feel bad about it because I often said that the financial imperative is for Square Enix to do this because they can make a lot of money doing it, and at some point you do have to listen to your fans. Final Fantasy VII for many younger gamers put Square Enix on the map when they were still Squaresoft, and it wasn't for me, I mean.",
            "start": 566.12
        },
        {
            "text": "Our worries about the Final Fantasy VII Remake. Of money doing it, and at some point you do have to listen to your fans. Final Fantasy 7 for many younger gamers put Square on the map when they were still Squaresoft and it wasn't for me, I mean I was playing, you know, many of us were playing Square games long before that, but for a lot of people that was a come-to-Jesus moment about westerners liking PlayStation games, liking role-playing games, liking Japanese games. And so it's a game that holds a special place in people's hearts. So I don't think, although I don't disagree that they can go in different directions with Final Fantasy 7 or they can go in different directions with other games, they remake. I think with seven you have to be very careful because people are going to have a certain expectation of what it's going to be like. And I don't necessarily think it's controversial to say that most Final Fantasy 7 fans want a prettier Final Fantasy 7, yeah, with cutscenes and beautiful environments and beautiful character models.",
            "start": 615.36
        },
        {
            "text": "I don't necessarily think it's controversial to say that most Final Fantasy VII fans want a prettier Final Fantasy VII, yeah, with cutscenes and beautiful environments and beautiful character models. I don't think they should mess with the fighting system; I don't think they should mess with the Materia system and have the same flow through the game, you know. Don't I don't that's the one thing I still know the game in my head pretty well, you know, like where it goes and the places you visit and those things are still important so I'd be disappointed if they added a new town or a new playable character or some it's like that's not what your charge is right now; what you're charged with doing over the next few years is remaking what already exists. And I understand that the biggest problem, and people have brought this up in the past, and I think it's a really important thing to think about, is that the people at Square Enix, as any game developer, are they're creative people, and they want to",
            "start": 652.96
        },
        {
            "text": "people have brought this up in the past and I think it's a really important thing to think about is that the people at Square Enix as any game developer are they're creative people and they want to make games and they want to make they want to implement their own ideas and to be put on a task like this might be exciting for some people but for many people it's going to be harrowing and it's going to be what they don't want to do because they have a certain confinement in which they have to stay within the rules already been made the parameters exist for Final Fantasy VII and so they're going to have to dance the tightrope of what can we do and get away with but how true do we want to keep it and the fact is they at the end of the day they are just going to get picked apart for what they did wrong if if they did try to perfectly remake the game no one's going to be there like oh good job guys it's going to be like oh you",
            "start": 696.8
        },
        {
            "text": "the day they are just going to get picked apart for what they did wrong if if they did try to perfectly remake the game no one's going to be there like oh good job guys it's going to be like oh you **** this up why didn't you do that like oh this character Design's off oh this you know all these little things and that's if they do it perfectly like if they try to actually remake what was already done if they just try to if they do what is going to end up happening and just kind of like make a spiritual REM I don't even what it is it going to be like what would you even call that I think they should call final I think they should just call Final Fantasy 7 and just be like this is Final Fantasy 7 and that's so like yeah what what what what you would call something like that a spiritual successor a spiritual remake of I don't I don't know what I know is that um they have their work cut out for them what I know is that this game is nowhere near coming out um years away years away",
            "start": 730.56
        },
        {
            "text": "successor a spiritual remake of I don't I don't know what I know is that um they have their work cut out for them what I know is that this game is nowhere near coming out um years away years away and that's what's the most interesting to me about this entire announcement is we've talked about it so many times like this being what Square needed to do to please the fans and all that stuff but it's funny that it happens now because now is the time when I'm like this is not when they need to do this they should have done it a couple years ago or a couple years from now like specifically with Kingdom Hearts and Final Fantasy 15 it's like let's get those going let's get those good you know and uh or else cancel one of them and make this the priority like not that I would want them to do that specifically not this **** long after I've waited for these games but it's like don't announce this third thing that's just like you're they're either going to work on it and it's going to take away",
            "start": 768.56
        },
        {
            "text": "not this **** long after I've waited for these games but it's like don't announce this third thing that's just like you're they're either going to work on it and it's going to take away from the other two games or they're not going to work on it and everyone's going to be pissed off that this game just keeps being shown in like really obscure long CG trailers that you know a couple points down the line it's going to be oh that character you saw in that trailer doesn't even not even in the game anymore as an outside of s next think that's the whole point of what's going to happen with this it's going to be trailer after trailer talk after talk every show now they're going to ask about these three games and what's happening and the News will never be good the news is never going to be all right it's almost done it's coming out this September you know finally that Tri Trigger is going to fall or be pulled I should say for Kingdom Hearts for you know the Final Fantasy they're working on",
            "start": 812.92
        },
        {
            "text": "Our worries about The Final Fantasy VII Remake - Kinda Funny Gamescast Ep. 26 (Pt. 1). It's almost done, it's coming out this September, you know finally that Trigger is going to fall or be pulled I should say for Kingdom Hearts for you know the Final Fantasy they're working on too with the guys going on that road trip but it's like now this is hanging over their head larger than it's looming larger than ever you know what I mean and I thought PlayStation Experience was a weird thing to come out toy with everyone's emotions then just do the PC port but then come out at E3 and say oh no it is he's like what are you doing like what's the plan here well it's clearly it's clearly something that happened in between you think it's reactionary to everybody's reaction yeah I think I mean I don't know for sure you know like these these these decisions are made lightly but it's it was about seven months six and a half months between the announcement of the PC port and then the Final Fantasy 7 reboot which or remake which is just entering production now and mind you we",
            "start": 850.16
        },
        {
            "text": "it was about seven months, six and a half months between the announcement of the PC port and then the Final Fantasy VII Remake which or remake which is just entering production now and mind you we still have no idea who's making the game um which is not a good sign either so uh we know that Square Enix leadership is producing and directing it but that doesn't really mean anything Moto's directing or producing Star Wars doesn't mean anything um unless you're like the director or the producer of that team but some a lot of these things are more symbolic or like you know uh like in Armature for instance is is is helping create directing and producing recor with a studio that is 5,000 miles from from Tokyo so how how intimate do you think his his relationship really is with Armature on a day-to-day basis probably not very um and I'm not saying the game's going to be good or bad but it's just something to keep in mind as an ancillary kind of thought sure but the with the Final Fantasy VII",
            "start": 880.4
        },
        {
            "text": "a day-to-day basis probably not very um and I'm not saying the game's going to be good or bad but it's just something to keep in mind as an ancillary kind of thought sure but the with with seven is indeed was this a reactionary move and if so good on them because they're listening to what people want but and I still think Final Fantasy VII remake sells more than Final Fantasy 15 you know like I don't think that's out of bounds to say I don't think that's out of control to say I think the Final Fantasy VII remake is going to be huge yeah uh and it's going to be huge regardless of when it comes out or how good it is um but I agree with what Greg's saying in the sense that Square Enix is setting a weird optic issue for themselves where it's like well what do you like where are your games like when are they actually going to come out and they have all these Western games coming out which is great you know something like you know Tomb Raider for instance but um which they're",
            "start": 922.16
        },
        {
            "text": "Our worries about the Final Fantasy VII Remake. Your games like, when are they actually going to come out and they have all these Western games coming out which is great you know something like you know Tomb Raider for instance but um which they're publishing but it's it it calls up interesting questions about like how are they using their own teams and their own internal resources and also how are they tapping outside story uh sources because as the stories that I was reading after E3 said you know CyberConnect was connected to the Final Fantasy 7 thing and I haven't seen that since which means that it's probably just a fleeting rumor but I don't believe they're making this game internally and one of the big questions you have to ask is who the **** is making it and then uh from there you uh kind of go into a direction of okay when is it going to be ready and when are you going to announce the release dates for these other games that people are really waiting for because I know some people were mad at me when I said it but Final Fantasy VII Remake.",
            "start": 962.6
        },
        {
            "text": "it's going to be ready and when are you going to announce the release dates for these other games that people are really waiting for because I know some people were mad at me when I said it but Final Fantasy XV, the demo, the fact that they're patching the demo is still some of the stupidest **** I have ever heard in my life why are you doing that you you put the demo to get feedback and then you put it in the main game who cares about the demo anymore it shows to me that they have a whole whacked out view of um of when these games should come out and how much time they should be taking on them yeah um that's why I still say Final Fantasy XV probably fall 2016 Kingdom Hearts fall 2017 probably at the earliest if not 2018 Final Fantasy VII 2019 um it would have been nice for it to be ready on the 20th anniversary but that wouldn't mean that they would have to accelerate the **** out of this and I will say as an aside that Square has an interesting example although an unusual example of",
            "start": 1000.08
        },
        {
            "text": "the 20th anniversary but that wouldn't mean that they would have to accelerate the **** out of this and I will say as an aside that Square has an interesting example although an unusual example of how they can do this game which is in Final Fantasy IV um when they remade four on the DS it was you know they made they made the characters like chibi and all these kinds of things and and they rewrote some of the story and and balanced the difficulty but it was the same game yeah and that's the example I want to see I want to see retranslation I want to see pretty graphics and all sorts of things and throw in a few elements and balance things that weren't unbalanced and get rid of some **** that sucked but or add some new things in if you really want to but make sure it doesn't affect the fabric of Final Fantasy VII and that's and so I actually think that that is a great example of a game they've already done exactly but so my question to you Colin is what is the percent chance that",
            "start": 1037.36
        },
        {
            "text": "the fabric of Final Fantasy VII and that's and so I actually think that that is a great example of a game they've already done exactly but so my question to you Colin is what is the percent chance that they'll do that compared to doing something else and what do you think that something else is like do you think that they would change the battle system to be more lot of rumors about that I know but where do those rumors come those aren't like the rumors are just rumors of people worried you know this is the well that and the problem with Japanese game rumors as I think a lot of fans of Japanese games know is that a lot some of the rumors are just unfounded you don't know where they come from a lot of them comes from sites that we don't read and sources that are totally trusted that we just don't know so um it's hard to like boil all that stuff down sometimes so yeah you have to take things on a case-by-case basis with those kinds of issues with the with the rumors and stuff like that I",
            "start": 1075.04
        },
        {
            "text": "don't know so um it's hard to like boil all that stuff down sometimes so yeah you have to take things on a case-by-case basis with those kinds of issues with the with the rumors and stuff like that I think it's about 50-50 I think that it's going to be an internal fight with the team and the good news is that you have some people involved in the leadership that worked on the original Final Fantasy VII game and I think they're going to want to stay true to it but the the aside from that is that they probably have looked at that game over the last 18 years and been like I wish I could change something about this and now I can yeah you know it's not just static on a black bottom PlayStation 1 disc anymore now it's something that they actually can get into the code and mold again and so while I I have faith that the leadership will keep it true I also have faith that the leadership will now be able to rectify the issues that they were not able to rectify the first time around so it's a it's a super",
            "start": 1108.8
        },
        {
            "text": "that the leadership will keep it true, I also have faith that the leadership will now be able to rectify the issues that they were not able to rectify the first time around, so it's a super dangerous game. I don't know, I just know that they messed with the battle system is a huge mistake and that that's what scares me, that is going to be the news that I'm most excited to hear is if they mess with the battle system, what they do with it and if they change it and it almost worries me though because it's just like I don't know that the battle system makes sense with the aesthetic of Final Fantasy VII, what it is now and what this is going to be. I think I think it does well because what we've seen of this CG trailer is that it's Advent Children and from Advent Children the battles look like crazy ass Dragon Ball Z, that doesn't lend itself to Active Time Battle, we're just going to walk and hit and walk and hit, you know what I mean so it's just like it's I'm going to be shocked if",
            "start": 1142.04
        },
        {
            "text": "crazy ass Dragon Ball Z that doesn't lend itself to Active Time Battle, we're just going to walk and hit and walk and hit, you know what I mean, so it's just like, I'm going to be shocked if they actually go through with that because it's they're going to want it to look right and to look modern and to look like a 2019 game, yeah but ATB is still is still um random encounters, it's it's turn-based in the sense of stamina so it's not turn-based like Dragon Quest but it is turn-based like in the sense that you are taking turns, it's just that some guys go quicker than you and So eventually it Stacks up where they they lap you and stuff like that, so I think that is still classic, like that is a classic way to fight in a in a in a Final Fantasy game and they shouldn't **** with that because then it has the law of unintended consequences how does that affect the material system how does that affect like the material system will not work properly if you don't have a system",
            "start": 1180.84
        },
        {
            "text": "that because then it has the law of unintended consequences how does that affect the material system how does that affect like the material system will not work properly if you don't have a system like that just doesn't work because then they become more like summons maybe but that's not really the intent of Materia the the intent of Materia is to make yourself stronger and attach it to your weapons and your accessories so and then it has the effect of how does it affect the enemy designs and the enemies and how many enemies there are and all these kinds of things they can't **** with that **** well see that's what I'm saying though is it's just like I can't imagine so okay that we're really in a in this game in an Advent Children-style game we're going to see ice monsters little like ice triangles you know what I mean well they don't have to be triangles they can in other words like I'm always thinking about the intro with the soldiers with the guns right and like the the",
            "start": 1223.24
        },
        {
            "text": "like ice triangles, you know what I mean? Well, they don't have to be triangles; they can be, in other words. Like I'm always thinking about the intro with the soldiers with the guns right, and like the harrowing intro to Final Fantasy VII, which is a great intro on the train and they go up into the tower, and there you meet a bunch of humanoid enemies with guns right, they're soldiers, they're Shinra-like whatever guys. And you could imagine a situation where, like I in my head, when I saw the free...like that's what I can't wait to see what this looks like, you know? Um, there's still a place for first-person like I know a lot of people think JRPG systems like that are archaic in a sense. Like okay, you're going to run around; you can't see the enemies; you magically appear in a battle with them and then you take turns fighting each other. I'm just saying like there are games that do that very well still and",
            "start": 1257.88
        },
        {
            "text": "around you can't see the enemies you magically appear in a battle with them and then you like take turns fighting each other I'm just saying like there are games that do that very well still and and and I don't and I don't think that that that's going to be a massive issue so if yeah there's like weird polygonal **** garbage enemies well I was thinking about how cool are those Shinra soldiers going to look like in the in the remake and how real are they going to look and how is Cloud Strife going to look in that fight with a sword and all you know I don't know I think I'm talking less about that though and more about the how the actual fight looks because like it's not so much about the gameplay CU I'm with like the game play should be that way but it's more about the Aesthetics of what we're seeing like is it really just going to be Cloud Strife just kind of like standing there bouncing waiting for the the bar to go up and then walking up and doing a slash because from what we know from what",
            "start": 1298.56
        },
        {
            "text": "seeing like is it really just going to be Cloud just kind of like standing there bouncing waiting for the bar to go up and then walking up and doing a slash because from what we know from what the rest of the Final Fantasy VII universe is it's never like that it's throwing the sword up jumping grabbing and slicing like doing a million like freaking combos on him you know what I mean it's it's more like the Final Fantasy XIII battle system yeah that if they if they put Final Fantasy XIII's battle system which is fine Final Fantasy XIII's battle system is actually very good I enjoy it a lot but it's not Final Fantasy VII no it's not it's a totally different game and um that was actually one of the only good things about Final Fantasy XIII was actually the fights MH um I don't know man wasn't enough of them there there's that's the thing is that there are no answers and I don't think there are any answers at all period that's the thing is what I'm saying is that I don't think they know I think",
            "start": 1329.52
        },
        {
            "text": "of them there there's that's the thing is that there are no answers and I don't think there are any answers at all period that's the thing is what I'm saying is that I don't think they know I think right now they're trying they're probably rewriting the script and trying to figure out how **** they're going to do this and it's all super nebulous yeah exactly and the fact that the director didn't know he was the director is all you **** need to know about this project and how quick it was coming from fruition which is why I think it's a direct reaction to the ultimate troll moment at in at PSX in December you know like that's but that's nuts though that they're releasing that game that they are releasing a PS4 native version of Final Fantasy VII and then going to do this even if it is a couple years later like it's confusing to say the least I guess it's confusing I don't think it's that confusing I think it's them saying they expected it to be done earlier it's clearly not it was",
            "start": 1365.32
        },
        {
            "text": "a couple years later like it's confusing to say the least I guess it's confusing I don't think it's that confusing I think it's them saying they expected it to be done earlier it's clearly not it was supposed to be out by now um and them saying like to me it's not confusing at all it's them saying like here you have your Final Fantasy VII game and good luck if you think you have any idea when you're going to get the next one which is their whole MO I still can't believe there are people that think that Final Fantasy XV and Kingdom Hearts III are like a year away that's like that's the shocking thing to me I'm like you're out of your mind MH you so but Goofy said it so just that's how Square Enix works and I appreciate them they clearly have a lot of money to burn so cuz the burn rate on Final Fantasy XV must be astronomical at this point and they're still going to put it out and they're patching the demo so um I don't know man they're a confusing company but I do",
            "start": 1399.64
        },
        {
            "text": "the burn rate on Final Fantasy XV must be astronomical at this point and they're still going to put it out and they're patching the demo so um I don't know man they're a confusing company but I do appreciate them I think that this is a good arc forward for them now I just want to see Dragon Quest XI yeah of course you do call hey everybody it's me Greg Miller and I wanted to let you know Comic-Con is coming up and Kinda Funny is going to be there so if you're at San Diego we have a bunch of stuff you can come do with us and you don't even have to have a Comic-Con badge on Thursday we're going to Petco Park we're doing the Game Over Greggy show at 3 pm no Comic-Con badges required then I'm moderating a whole bunch of Comic-Con panels if",
            "start": 1435.24
        },
        {
            "text": "doing the GameOverGreggy show at Petco Park is part of Geek and Sunry Studio stage no Comic-Con badges required we're doing that at 3 pm and then I'm moderating a whole bunch of Comic-Con panels if you do have a Comic-Con badge so come hang out with me in the convention center all the details are up on KindaFunny.com news so head over there for the full rundown",
            "start": 1475.36
        }
    ]
}