{
    "id": 1047,
    "video_id": "Th-LXeme5Tc",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "How To Fix The Things That Suck - The GameOverGreggy Show Ep. 85 (Pt. 3)",
    "description": "Colin Moriarty would make the best Mega Man game ever.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1437548401,
    "duration": 1330,
    "transcript_chunks": [
        {
            "text": "Colin, what's your topic all right so I don't know how to I don't know how to express this uh succinctly so just deal with me for a moment if you will um so we often talk about uh IP we talk about our movies our favorite movies TV shows comic books games um and we we're we criticize things right but the reality is that we probably couldn't do any better with a lot of the things that we criticize right but I'm curious about and it doesn't have to be something you criticize it could be something you love but you know we criticize Game X but we certainly could have done Game X any better um but I'm curious about what is the one thing you can identify the one IP the one series whatever that if given the opportunity to do something with it that you're confident that you can do it better than what's being done to it right now like uh in other words like you could be the writer the director whatever you want to be and you have the means necessary to execute on the plan what are you",
            "start": 2.85
        },
        {
            "text": "than what's being done to it right now, like uh in other words, like you could be the writer, the director, whatever you want to be, and you have the means necessary to execute on the plan. What are you confident in that you could do better than what's being done with it right now? So for instance, I've criticized I don't know uh Batman: Arkham or Batman: Arkham Knight's tank battles but I don't know what the **** I would do if I I can't do it any better. You know, I mean that's just the reality of the situation. But there's something specifically that I think I can actually do really well and I'm but before I answer, I'm curious what your guys' answer is uh to that question if it makes any sense. It does make sense. I don't I don't have any illusions the uh making me think that I could actually do anything better than what people are doing out there when you get up to the level of you know my brain instantly thinks uh Colin and Greg, let's just go around this. I do just want to put it on the table that when Colin and I",
            "start": 55.76
        },
        {
            "text": "what people are doing out there when you get up to the level of you know my brain instantly thinks uh Colin and Greg live so **** around I do just want to put it on the table that when Colin and I hosted the first time I hosted it did get 10,000 concurrent uh which we have only gotten those types of numbers uh during rare instances namely E3 or when I host those are the two things those the two things so I do think that in in a nutshell um that is one thing but you know when you start talking in when you get up to levels of like you're talking Batman v Superman it is funny because you hear people criticize right you're like oh that movie wasn't good that was there is such a difference between criticizing someone's work and actually doing the work it is there's no comparison right like I have no there's no way I can compare myself and what I do with Zack Snyder that man is on a different a whole other level right and it takes a lot of effort and a lot of talent to make Man of Steel even",
            "start": 96.44
        },
        {
            "text": "no there's no way I can compare myself and what I do with Zack Snyder that man is on a different a whole other level right and it takes a lot of effort and a lot of talent to make Man of Steel even though everyone didn't necessarily love Man of Steel that movie was a technical marvel it was beautifully made the acting was superb in it um it had some minor story elements that I think if they had tweaked it could have been it could have hit on all cylinders but ultimately there's no way I would there's no way I would say stepping in there right now I could do a better job than him it's not going to happen sure um having said that I think if someone went to Tim Gettys and said Tim I need you to write either a Transformers movie or a Pokémon movie I would like to see either of those films not direct just write the story for what the what should happen in the story of these I think it would be hilarious to see what you come up with it's funny that because this topic immediately I start",
            "start": 144.76
        },
        {
            "text": "Not direct, just write the story for what the what should happen in the story of these. I think it would be hilarious to see what you come up with. It's funny that because this topic immediately I start thinking about what I think you guys would like. A Superman by Greg I think would be my answer. Not that that would be your answer, no. My answer is a Superman video game. Okay, okay, that makes sense for you. Mega Man, I think, is the clear answer. Where it's like, feel like you understand Mega Man so well that probably better than anyone, like even the people that make that game. Just because it's like you are in love with it and you're in love with everything about it, which I think is what makes it important. You also love playing it, and I think that adds an extra level of like, what do you love about playing it? Not just the creation of it, so you would bring that into whatever you created from it. But then for me, it's like I love Transformers, but it's like I am not the right person to... I know",
            "start": 187.56
        },
        {
            "text": "playing it not just the creation of it so you would bring that into whatever you created from it but then for me it's like I love Transformers but it's like I am not the right person to like I know taking I've said this a million times I'm not that funny of a person yeah you are but I know what's funny and like I know how to curate things together so it's like that's why I'm such a big fan of lists so I think I could do BuzzFeed better than BuzzFeed but that's not true because BuzzFeed is **** good at what they do certain lists I I can do better but my point is I'm good at like taking the little things and putting it together into what I know is right and in that way I can take the aspects of Transformers put that into one thing and be like this would be an awesome story taking bits and pieces of what other people are doing but I don't think I could come up with that good of a thing Pokémon on the other hand yeah I think I do I bet you could I would love to see like I'm not",
            "start": 227.04
        },
        {
            "text": "bits and pieces of what other people are doing but I don't think I could come up with that good of a thing Pokémon on the other hand yeah I think I do I bet you could I would love to see like I'm not and I'm not talking about the technical standpoint of writing a script I don't I don't think you could learn but that's not what we're talking about what I'm saying is you know often times you'll see Story by this person right and what that really is is that person just sat down and wrote the story of like I think this should happen first this this this here's this beat and they just wrote a you know 20-page treatment or whatever it is gave that to the screenwriter or worked with the screenwriter that person put it in this specific format would then you deliver the lines I think you writing I think you could do that for Pokémon and I think it would be I think Poké and I think it would be just the right amount of modern with just the right amount of fan service for the class being just like",
            "start": 268.0
        },
        {
            "text": "think you could do that for Pokémon and I think it would be I think Pokémon and I think it would be just the right amount of modern with just the right amount of fan service for the class being just like without it being bad obnoxious and I think you would also be good because you are an adult who has the perspective more often than not of younger generations with that adult uh uh mindset if that makes sense and that's the single most important and powerful thing for a Storyteller to have especially when you're making a movie like like or movies uh it's Brad Bird has it for instance right when Brad Bird goes to make an animated movie well that movie to him I don't think is any different than if he were to make a live action it just happens to be animated which appeals to kids and he has those right touchstones in the in the films that the kids that appeal to kids but really I'm gonna watch Invincible when I'm 50 I'm probably like God damn this is just a good incredible",
            "start": 300.8
        },
        {
            "text": "and he has those right touchstones in the in the films that the kids that appeal to kids but really I I'm gonna watch Invincible when I'm 50 I'm probably like God damn this is just a good incredible excuse me Invincible talking like you're 50 uh what who am I where am I uh I'll watch that and it's still a phenomenal film I think you would also write a really good Superman story that and that's what I'm saying with you with the game technically sure you would be like these mechanics don't work but realistically what you're really talking about is you're going to ride a good experience at Superman one of the thing I mean I'll eventually make it for this Channel and it's funny because Justin Roiland just did it for Polygon like what how to make a good Superman game or whatever but we all know he's a completely horrible human being he's a son of a **** he's a terrible human being that stole your idea no my original plan was to have the video ready when we launched Kinda Funny Games in",
            "start": 340.0
        },
        {
            "text": "he's a completely horrible human being he's a son of a **** he's a terrible human being that stole your idea no my original plan was to have the video ready when we launched Kinda Funny Games in January but obviously the end of December was so packed but I have a whole treatment in my head that I've actually put on the phone in terms of like what it is and where I'm going and what like and it's me sitting down and explaining the mechanics and what the story is and how it all pieces together but yeah it would be like if tomorrow Sucker Punch called me was like we want you to come up and make it fam Miss 3 or whatever we use we loved what you did there right it would be me walking in and explaining I want this power and this and this is how you get it and it wouldn't be me like designing on you be producing for yeah exactly I'd be doing the story idea and think going from there yeah um we should put that video together you never no didn't you just tell me that uh was it Max Landis",
            "start": 375.32
        },
        {
            "text": "on you be producing for yeah exactly I'd be doing the story idea and think going from there yeah um we should put that video together you never know didn't you just tell me that uh was it Max Landis is doing a comic book run now yeah he's getting to do uh yeah well he did yeah Max Landis has his own \"Sun Man\" books, the longest short end of that story right but that's awesome right and that's him putting out that energy over and over and over again now Max Landis is crazy love to meet that man one day um he was at a Comic-Con party was he yep I was really I was drinking uh pineapple vodka and letting everyone make fun of me for being back in college no **** I love making drinks now like it's that's just so perfect uh Anthony's wife the last night well no she wasn't at that party but Anthony's wife every single person that I ordered that around was like what are you a sorority girl You're pledging her sorority like leave me alone I like it I just I was really craving um pineapple",
            "start": 411.2
        },
        {
            "text": "white every single person that I ordered around was like what are you a sorority girl, pledging her sorority, leave me alone. I like it, I just, I was really craving um pineapple juice, pineapple juice, I don't know why but uh you know that's funny we should put that together, you never know, happens every time. I want to do it right with graphics and the visuals, I want to pull from comics, it's just a big project yeah so yeah we should probably sit down and like I should make the script and we should film that part so I can start chipping away at it but I'd love to help you with that. I can also just talk about it forever, you could but talk is cheap, that's what they say actions are expensive. You know what are you gonna do um well there two things came when I thought of this idea two things came to mind first thing came to mind was GI Joe but I don't think that I don't think GI Joe is one of those things I think that needs to be left alone I don't think",
            "start": 451.96
        },
        {
            "text": "when I thought of this idea two things came to mind first thing that came to mind was G.I. Joe but I don't think that I don't think G.I. Joe is one of those things I think that needs to be left alone I don't think that it's relevant anymore and I think its timeliness in the 80s and early 90s is what makes me or uh G.I. Joe G.I. Joe but Mega Man to me Tim nailed it I am 100% confident that I can write and direct a reboot of Mega Man and make it relevant like I like I am so a game I am so confident in that that like completely confident it if like if if given the team and the means to do it I could do it and and like I'm just I'm just I'm just saying like I I could make Mega Man relevant again and uh my vision for it is is uh following the story of the first two Mega Man games in one game and reversing them um and making it an open world game so Wily and Dr. Light work together they're friends they create all these robots so they make Proto Man who's Break Man and then Mega Man and Roll and then Fire Man Iceman",
            "start": 489.64
        },
        {
            "text": "\"um and making it an open world game so Wily and Light work together they're friends they create all these robots so they make Proto Man and then Mega Man and Roll and then Fire Man, Ice Man, Cut Man, Guts Man, Elec Man, Fire Man, so the the the the the robots that have like applications so Fire Man is like you know um well a better example's like Ice Man is like an Arctic exploration robot and Guts Man's like a construction robot and all that kind of stuff and they're corrupted by Wily and they're taken but to get those robots back for Light they have to deal with the robots in Mega Man 2 so to like to reverse the Mega Man games to make Mega Man 2 so basically two games in one make a game longer and bigger um while he has all these other robots that he's created and everything would be like basically individual dungeons in an open world and you can do them in any order um and things would like open up depending on the weapons you had equipped on you because Mega Man Would Still steal the\"",
            "start": 533.6
        },
        {
            "text": "individual dungeons in an open world and you can do them in any order, um, and things would like open up depending on the weapons you had equipped on you because Mega Man would still steal the weapons from the enemies he killed and stuff like that, um I think you can make like a dark and gritty Mega Man game and make it super relevant and make a lot of money for Capcom, um and uh I would love love love the opportunity to write that you know, um because I think I could do it like so for all the criticisms that we like Tim's right like there are things I I feel like I understand but I would never really gamble with you know, um I criticize BioShock Infinite but I couldn't have done BioShock Infinite any better you know not even close like their Visionaries they're they're brilliant I just didn't feel the game mechanics of that game, um but whenever we criticize something it's just you know you don't have to be able to create to criticize I mean criticism is is important for",
            "start": 575.24
        },
        {
            "text": "I just didn't feel the game mechanics of that game, but whenever we criticize something it's just you know you don't have to be able to create to criticize. I mean criticism is important for creators; we are creators and people criticize our work and we take it to heart. But Mega Man is one of those things I care about and understand so deeply that I could do it, you know, like write the game. You let another studio make it and execute on the vision. I don't know anything about the technical aspects of making a video game; I know what goes into making a video game, but I don't know how to do any of those things. Sure, but you don't have to know how to do any of them to be able to lead people who are doing them. So like, get a team that you can work with because I don't have any technical skills; I don't have any artistic skills.",
            "start": 612.04
        },
        {
            "text": "to be able to lead people who are doing them so, like, yeah, get a team that you get a team that you because I don't I don't have any technical skills I don't have any artistic skills I don't have you have to find the talented people that are able to do that kind of stuff but I could write it yeah you know and I could lead that project um and I'm confident that I'm bold enough to say that I'm totally confident that if if it was executed in the way it appears in my mind it would be awesome it's the same reason with Superman is that I'm just sick of people saying it's impossible to make a good Superman game and it's this hard to do this no like I know how to tell that story I know how to make it make sense I know how to explain the opening cut scene why he can't fly to space and why this do you know what I mean like to set the limitations and tell the story people always overlook that and assume they have Christopher in the suit which then yeah he can",
            "start": 647.0
        },
        {
            "text": "can't fly to space and why this do you know what I mean like to set the limitations and tell the story people always overlook that and assume they have Christopher in the suit which then yeah he can **** fly around the earth the other way in reverse time and like that wouldn't be the Superman we're using you know what I mean two questions for you why can't he fly to space in my game yeah I'm not going to tell you I'll see it for the video and two that's the thing it's like mine's a real video mine's a real full on production thing I'm two at what point do I get the awesome level where meteorites are falling from the sky and I just have to keep shooting them and going after them and then it's the most annoying level on the planet well there's a lot of rings in my game you got to fly through yeah I want I really want I want just all sorts of mundane challenges that sure prove that the flying mechanic is broken sure you got it can we get that I'm on it don't worry cool and then I want",
            "start": 682.28
        },
        {
            "text": "yeah I really want I really want I want just all sorts of mundane challenges that sure prove that the flying mechanic is broken sure you got it can we get that I'm on it don't worry cool and then I want not to be able to use any of the good powers ever okay done is that a possibility that's possible great because what I'm going to do in the beginning is he gets completely depowered and so then you have to find your X-ray vision and find your heat vision but only use them in controlled circumstances where the B button pops up can I you know what I'd like though is some sort of upgrade system or leveling up system where I don't actually get to be Superman until the very last level sure and then even then it is then the game's over yeah great I would like to and no no uh second replay you got to just start from start from scratch there's no there's no game plus what they call it Game+ new game plus yeah I don't want that **** game plus don't want that **** okay one thing that I think that I",
            "start": 713.08
        },
        {
            "text": "Start from scratch, there's no game plus what they call it - Game+ yeah I don't want that **** Game+. Okay one thing that I think that I actually know I have Batman in there but don't let me talk to him or be sure thank you something I I know so well that I actually think because I I was thinking this is a hard topic for me because I don't think that I could do anything that well like something that I was thinking about was Sonic I don't think that I have the answer to how to fix Sonic but I would like to try to fix Sonic and I have ideas I have some things that I'm like I this might work to make him relevant again but it's not like Colin who's like I can **** fix Mega Man and like bring it back whatever and not that this needs fixing at all but I would love to write a season of Red vs. Blue like I know that world and I know those characters so well that'd be cool and I know all of the things that the fans would want",
            "start": 753.0
        },
        {
            "text": "fixing at all but I would love to write a season of Red vs Blue like I know that world and I know those characters so well that'd be cool and I know all of the things that the fans would want and I know all the like the stupid jokes that were made 10 seasons ago and how it can like come into play now and like how the world can all work and introducing new characters to that matter and how to grow that and I would love to do that I think you'd be really good at that it'd be fun be cool you know maybe one day though that we'll have to make that happen for you you know I I know some people you know some people yeah shout out to Miles who killed it in the last three seasons very true uh the on the Sonic note there and that does raise an interesting question can Sonic be good now I'm asking that specifically to reference Colin's point which was I don't know that a G.I. Joe movie can be good like bringing that franchise back I don't know if that's uh to use another",
            "start": 788.12
        },
        {
            "text": "asking that specifically to reference Colin's point which was I don't know that a G.I. Joe movie can be good like bringing that franchise back I don't know if that's uh to use another Colin point a hill worth dying on so to speak um just because a lot of a lot of the 80s stuff relied heavily on the camp and they were kids there was nothing in there for adults so trying to make them for adults is is a waste of energy I think yeah absolutely you'd have to do the G.I. Joe have to change G.I. Joe so radically that it wouldn't be G.I. anymore same with He-Man right like they tried to make a He-Man movie and they did it the best they could they made it was kind of hardcore and gritty and weird and like there's a lot of stuff going on that you're like well this isn't the He-Man that I know from when I was a kid and actually probably thank God cuz that would be a really really really weird movie um but can they make a good tonal property what do you think I I think",
            "start": 828.04
        },
        {
            "text": "He-Man, that I know from when I was a kid and actually probably thank God cuz that would be a really really really weird movie um but can they make a good Sonic property what do you think I I think I think it's possible and that's the problem is I I've I often think about this when I'm alone just lay in my room I imagine you when you're alone lay in your room you have your phone and there's just nothing but lists of lists of list documents that's definitely true one of those list how Sonic there you go I don't have anything on the list but it's there 10 ways to fix Sonic I I just I believe it's possible and I I want it so badly and it's not something like Crash Bandicoot, a Sonic fan yeah I really like Sonic and it's one of those things where it's like there's so many aspects my favorite thing about Sonic 1 through 3 is the overall feeling of those games it's not the gameplay and it's not the like level design or any of that it's the overall feeling of the the atmosphere with the music with",
            "start": 870.56
        },
        {
            "text": "about Sonic 1 through 3 is the overall feeling of those games, it's not the gameplay and it's not the like level design or any of that, it's the overall feeling of the atmosphere with the music with the like the time that I played it and all that stuff and I do think that you can capture that feeling in a new game it is not in the direction that they've even that they're even going down at all like right nowhere new there and I don't even know what it could be because it's not just go back and do the same thing again it would have to be something new completely fresh re-boot and re-imagining of everything kill all the other friends except for Tails and Knuckles and call it a day no no I don't I don't know man I get I get so excited thinking about like a Mega Man reboot that needs to be done yeah I I'm it's not even like an arrogant thing like I could do it I could write that game you know it's just like it's one of those things where it's like I don't know if it's",
            "start": 908.04
        },
        {
            "text": "to be done yeah I I'm it's not even like an arrogant thing like I could do it I could **** write that game you know it's just like it's one of those things where it's like I don't know if it's I don't know if that's something a director they want to go in or whatever it's just like I have this awesome vision of an open world city megalopolis like the the city where all like Mega Man takes place where it's just you're going to like it's just open you can just do whatever you want and but there's like a billion **** secrets depending on like what you have at any given time and and I love the idea of like going to for some reason I have in my head like Flash Man stage um in Mega Man 2 is like a very it's like blue and and you know you can probably see in your head or whatever I for some reason I picture that as being like a TV studio or something you like and like that's his stage as like some sort of like game show you know that's cool or like Wily is in the woods and and but",
            "start": 956.8
        },
        {
            "text": "Reason I picture that as being like a TV studio or something, you like, and like that's his stage as some sort of game show, you know, that's cool. Or like Woodman is in the woods, and and but like I picture like he's at the zoo for some reason, like in some place, and like you have to go there and fight him or whatever, like that's the part of the city he took Air Man would be like an airport, and all, and like the airport, and all these kinds of things. And I'm like this would be so cool, you know, to do this um, that you fight the guys from Mega Man 2 first in order to get to the guys from Mega Man one who are the robots you're trying to reclaim for Light, like the whole idea is not to destroy the robots in my mind. The whole idea is to get the robots back that were made, you know right, and to get the robots back that were made, you have to first kill the robots while he made himself, and then like so then when you beat his eight robots",
            "start": 997.96
        },
        {
            "text": "robots back that were made, you know, right? And to get the robots back that were made, you have to first kill the robots while he made himself. And then like so, then when you beat his eight robots, then you fight the reprogrammed Iceman or the reprogrammed Fireman. But the idea is to get them alive so that you can bring them back to life and reprogram them. I love this so much. So I don't know what this could be. It's not a new show, but we should do like a miniseries or something that's like called... Like how cool would it be? And it's just your Superman thing, you making the Mega Man pitch, like just doing that and just like explain what is the perfect thing you would make if you could. I'd love that, love that. Like describe a perfect trailer for whatever it is. Yeah, what we would want from Fast and Furious 8, cuz like that's Fast and Furious is another thing where I would love for me and you to come up with this story for Fast 8 through 10 go on that right now and wrap it up they got to get",
            "start": 1031.68
        },
        {
            "text": "and Furious 8 cuz like that's Fast and Furious is another thing where I would love for me and you to come up with this story for Fast 8 through 10 go on that right now and wrap it up they got to get cars they drive around the cars no but on on your note I would love for them to do that because I would love for Mega Man to be a mega franchise again I would love it if you know obviously Capcom wouldn't do this but it would be amazing if Pixar got a crack at a Mega Man movie oh hell yeah I mean they're they they're doing something they are planning something with that series because it's the 30th anniversary in in 2017 they announced the cartoon that's coming out next year at a **** nowhere and I'm like they're doing something there're someone is making the game and Greg came up with a good point it's probably Capcom Vancouver that's making the game you're the one who came up that idea the Dead Rising guys and that's that's totally fine with me it's just the reason I love that",
            "start": 1068.84
        },
        {
            "text": "a good point it's probably Capcom Vancouver that's making the game you're the one who came up with that idea the Dead Rising guys and that's totally fine with me it's just the reason I love that particular story arc of getting Mega Man 2 out of the way because those enemies are iconic you can tell a Mega Man story by itself but it's just not as iconic as you need Quick Man, Metal Man, Wood Man, Heat Man, and all these guys and you can figure that out and then you can wedge in Mega Man 1 and just reverse them and I think that's a really great solution to that problem what makes me more excited about the Mega Man reboot in my mind is the sequel to it because then the sequel to it can be Mega Man 3 in its entirety like Mega Man three's story is Wily and Light get back together and are friends again they make a peacekeeping robot called Gamma that Wily then reprograms and tries to take over the world within it's this huge machine when's Light gonna learn when you",
            "start": 1105.92
        },
        {
            "text": "Together and are friends again, they make a peacekeeping robot called Gamma that Wily then reprograms and tries to take over the world within it's this huge machine. When's Light gonna learn? When you gonna learn, bro? And it's like seven or eight, and I, I love, I just love that idea of like, then once you get that that origin out of the way by putting Mega Man 2 first, which is so essential to getting people's attention, and then burying Mega Man 1's story in it, which is a story of struggle between two scientists, you know, that were friends, and and one feels like he's being overshadowed, so he just steals his robots. But that Dr. Light still wants those robots back, like in Mega Man 1, he goes and your idea is to destroy them, but Light in my mind wants those robots back; he built them, and they're useful, like Quick Man was made to kill people, but or Flash Man was created to kill people, but you know Cut Man was was used to help, like lumberjacks, like fell Timber.",
            "start": 1140.32
        },
        {
            "text": "they're useful like they're useful robots like Quick Man was made to kill people but or Flash Man was created to kill people but you know Cut Man was used to help like lumberjacks fell timber and **** like they just have practical applications whatever so he wants them back and I like that idea of like having to kill Wy robots and then somehow capture the other robots and get them back that's cool um and then Mega Man 3 telling the whole story of Gamma and like their friendship again and my idea with the mega which this would be Mega Man 2 in the new canon or whatever would be to that you don't even know like Wily and Light are friends for almost the entire game and you don't know you're not supposed to know that Wily is the one behind Gemini Man and Magnet Man and all these guys and like they're just popping up and you don't know why you're fighting him until the very end when like Wily is controlling Gamma himself and I I like I like I like those ideas because they never made it on NES",
            "start": 1176.0
        },
        {
            "text": "like they're just Pro cropping up and you don't know why you're fighting him until the very end when like Wily is controlling Gamma himself and I I like I like I like those ideas because they never NES games didn't allow you to tell deep stories but there is a **** story in Mega Man and it's good you know it's just it's just it needs to just be fleshed out more and I've said it before but but Mega Man's Wily the song Wily is **** awesome because it's it is the story of Mega Man and he's telling the story of it he and in a rap song He in three minutes he tells the story so eloquently and I'm like Capcom should listen to this and figure out like how they can make this resonate again because you're not going to make Mega Man resonate again until you can reimagine what he is you know and so yeah would I be able to make the game no would I be able to write that game yes yes I would be able to write it and i' and I'd be so I'd be so so excited about it I I don't want to probe too far into",
            "start": 1214.96
        },
        {
            "text": "yeah would I be able to make the game no would I be able to write that game yes yes I would be able to write it and i' and I'd be so I'd be so so excited about it I I don't want to probe too far into Greg's thing because he does want to make a video about it but I have questions about that Superman game too I'd love to ask you know so it's it's specifically how he wouldn't be able to just kill anything he ran into yeah U but I'm sure you can explain that yeah so I'd be interested yeah we should do a series where are made of kryptonite exactly at the very beginning you're given a Kryptonite inhibiting collar okay and Lex only gives you so much of your abilities right that's good that's real good but these are but these are I mean these these very high and and questions high level questions about Superman is the reason why it's very hard to make a Superman game I think I always feel like that's lobbed by people who don't understand the character and people who do shrug and put up their",
            "start": 1252.96
        },
        {
            "text": "about Superman is the reason why it's very hard to make a Superman game. I think I always feel like that's lobbed by people who don't understand the character and people who do shrug and put up their shoulders. I think don't understand the character, you know? I mean look at Superman 64 or whatever - a rush project they got off track or whatever you know what I mean. I feel like the \"super\" but that was their solution was to make them fly rings and Superman Returns right well yeah but I we're in a different day and age now you know what I mean and that's why it's still so surprising that nobody's nailed it or put one out that's figured out the what I feel are eloquent solutions to all of this. All based, we'll have to talk about this tonight because I I'm I'm super curious about I'll bring up the doc I super curious super curious",
            "start": 1291.2
        }
    ]
}