{
    "id": 1069,
    "video_id": "y_5C8mPq7us",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "Console Mergers and Game Magazines - Kinda Funny Gamescast Ep. 29",
    "description": "From Kojima to Miyamoto, which developers could fins success on their own, is it awesome or weird to name your kids after video game characters, will Nintendo ever merge with PlayStation or Xbox, and we discuss our favorite video game magazines we grew up with. (Released 07.24.15)\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1438347602,
    "duration": 4717,
    "transcript_chunks": [
        {
            "text": "today's episode is brought to you by Loot Crate, the subscription box for the geek, gamer, and nerd in all of us. For less than $20 a month, you get 68 items of gamer and pop culture licensed gear, apparel, collectibles, unique one-of-a-kind items, and more. Make sure to head to loot.com/kfam and enter code KFGames to save $3 on any new subscription. Remember, you only have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate. And when the cut-off happens, that's it; it's over. So go to loot.com/kfam and enter the code KFGames to save $3 on your new subscription today. What's up guys? Welcome to the first ever episode 29 of the Kinda Funny Gamescast. As always, I'm Tim Gettys. I'm joined by the coolest dudes in video games, Colin Moriarty, Greg Miller, and Portillo. The wiener dog. Thank you for not leaving him out. Yeah, I know he's... he's doing some things today that I really star power. He doesn't have enough star power. We tried one time where we had him laying and",
            "start": 0.04
        },
        {
            "text": "you for not leaving him out yeah I know he's he's doing some things today that I really star power he I'm sorry he doesn't have enough star power we we tried the one time where we had him laying and stay out here and I couldn't handle it right I've been seeing this new dog bed that's shaped like a hot dog bun that might be a good fit for him just to sit there I mean I like that I'm definitely into that still still concerned with the notion that he must be involved I'm just letting you know necessarily in the show since he typically slays there and he is he is he's not only typically the big thing I wanted to present to you guys on this is if you watch this on YouTube of course there's the intro I do think we need to put a Portillo's face in there at some point cuz it goes and it's us but we where's Portillo should have a little flash frame he has a lot of insight and interesting analyses and anecdotes about the industry you know through his long-standing exposure to the industry sure",
            "start": 48.6
        },
        {
            "text": "we where's Portillo should have a little flash frame he has a lot of insight and interesting analyses and anecdotes about the industry you know through his long-standing exposure to the industry sure you know what here's what I'm going to say you ask any fan who's your favorite character from peanuts they're going to say Snoopy Snoopy had a longer career than any of these idiots Charlie Brown Peppermint Patty nobody cared about these guys it was all about the Snoop yeah the Snoop why are you saying their names like that are you afraid to get are these like the are these like the off-brand toys you find in Walgreens exactly exactly no what what do you think Portillo's favorite games would be if Portillo was a human civilization five he he would be into that a deep so yeah he I think he'd like Civilization games he likes to play I just don't let him do it I forced him into this like Dan Central he's all about that yeah he could get into that Colin",
            "start": 88.72
        },
        {
            "text": "I think he'd like connect games he likes to play. I just don't let him do it. I forced him into this, like Dan Central. He's all about that, yeah. He could get into that, Connall. He sees other cats for change. I liked uh I liked uh Skittles. Jesus reminds me of David Clayman. Um I like that you brought up the point that when you're not around, Portillo gets depressed, yeah. Now what is the nature of his depression? When he... I can show you images. Christine will tell you about it. We got get well. He's on the show to describe him. He looks he looks a little depressed all the time. He looks a little something actually. I don't know if depressed is the right word. He's something though. I mean he's definitely something, yeah, yeah. There's no doubt. I mean y wait hold on this week I'm I'm leaving this week and you're staying. You can you can observe him for yourself. Do I have to? Look at how look at how look at how sad that dog is. Look at his head down just not happy. That's kind of his natural condition. I just",
            "start": 129.44
        },
        {
            "text": "staying you can observe him for yourself do I have to I look at how sad that dog is look at his head down just not happy that's kind of his natural condition I just don't believe that he's this is what I was saying about this about Portillo I'm not sure that he's self-aware enough to know that you're not here I assure you he is I think I I think it's I think it's not as deep as you think I think he knows he loves you more than anything right but I think once you're gone like when he goes to pet camp I think he just goes about his business and then he smells you again or has this identity with you again where he remembers that he loves you more than anything like in other words I don't think there's a pining or a long mhm you want me to call Christine you don't have to call Christine cuz she has no way she could possibly know the answer to this since she'll tell you how he acts differently it's not that important we could talk about this another time I",
            "start": 172.56
        },
        {
            "text": "have to call Chris cuz she has no way she could possibly know the answer to this since she'll tell you how he acts differently it's not that important we could talk about this another time I just wanted to say that I don't think Portillo is a deep enough thinker he's not exactly an existentialist he's not out there in the woods with the Henry David Thoreau thinking about you know no one they're dead they are dead but no one's out in the woods talking to them at some point some talking to them he's doing okay he's doing them I mean he's doing something he's doing I'm not putting him down I'm just saying I don't think that like when Greg leaves he's probably sad for a minute then he forgets what sadness is he's sad the whole time and then he just forgets what sadness he sleeps for 18 to 20 hours a day and he eats and he runs around and does things and then he doesn't and over time I think if not exposed to Greg he would forget Greg existed and then he would remember because sent being",
            "start": 212.08
        },
        {
            "text": "a day and he eats and he runs around and does things and then he doesn't and over time I think if not exposed to Greg Miller he would forget Greg Miller existed and then he would remember because scent being the closest uh sense tied to memory remembers that he indeed loved Greg Miller more than anything else which is why he gets excited when Greg Miller gets home I don't think it's getting close enough to him being gone me being gone long enough that he's getting to forget me forever territory I I maybe after a few days it starts to wane but don't they say about dogs that like when when you leave the house the dog thinks every time that you're not going to come back yeah they have no idea how much time passes is what's said yeah this is the Kinda Funny Gamescast the show where we talk about video games and all the cool stuff going on in video games only sometimes most of the time we're not going to do that but see how could we when we have this every week over on youtube.com/ kindafunnygames",
            "start": 248.24
        },
        {
            "text": "and all the cool stuff going on in video games only sometimes most of the time we're not going to do that but see how could we when we have this every week over on youtube.com/kindafunnygames we break this show up topic by topic Monday through Thursday full episode on Friday but if you want that episode early you can go to patreon.com/kindafunnygames and you can get it early is this one worth the dollar I can tell you it will be you know why because this is the special patreon episode I just decided that so here's the deal over on patreon.com/kindafunnygames there's a bunch of different tiers right some of the tiers get you different stuff for a dollar you get the exclusive episode that we do monthly you have access to that for $5 you get this show early $10 you get this video early and some other number that I don't remember but I think it's 15 or 20 you get thanked visually so Kevin can you please put it here thank all the good people for all their good work 20 huh",
            "start": 283.12
        },
        {
            "text": "early and some other number that I don't remember but I think it's 15 or 20 you get thanked visually so Kevin can you please put it here thank all the good people for all their good work 20 huh 20 say Kevin yeah this one's worth the 20 I'll tell you that much 15 yeah that's right 15's the um you get the at 15 you get the monthly chat and you get Colin or Greg live yes as a YouTube video hate Twitch want to watch it on the go wherever you are get it on YouTube archive now there's an important thing one of these tiers that are up there yeah 50 perhaps I don't know but if you go to patreon.com ofun man you did a lot of research on this one Whatever it's not about the money it's about the the what the tier is I know the tier the tier is you get your topic on the show right now every once in a while we sprinkle them in but I decided today because we had to do the the thank yous and stuff I want to sprinkle all over the place and I just want I want this to be the the Patreon extravaganza so",
            "start": 329.0
        },
        {
            "text": "a while we sprinkle them in but I decided today because we had to do the thank yous and stuff I want to sprinkle all over the place and I just want this to be the Patreon extravaganza so it's good every question I don't know excited I I didn't want to get too yeah it was a little much I don't know who's in this house right now I don't know if Christine's here or not I want to respect her space I want to respect her audio levels and put I don't want to scare Portillo that's true he was trying my keep him around so every topic in this is going to be brought to you by someone from Patreon and I think it's kind of cool yeah it'll be fun it'll be fun wait a minute yes before we get into any of these topics now look at Portillo's face right now he looks depressed right now he looks depressed he looks like he depressed he looks tired he looks like he's had a long day look at that like he's very tired he's so sleepy the world's got you down Portillo things are hard",
            "start": 373.16
        },
        {
            "text": "now he looks depressed he looks like he's depressed he looks tired he looks like he's had a long day look at that like he's very tired he's so sleepy the world's got you down Portillo things are hard he loves this he loves that you like it's like the crack of your butt but it's the crack of his face he loves this you like that when someone does that to the crack of your butt who doesn't you me up right now D to you'll see it's like swiping yeah you're going to just swipe your finger right down there why you do that to your friends credit card stuff what a bunch of weird perverts we were I don't know that I ever ever did that actually to my friends like a piece of cardboard put through the butt crack well like not not like their naked butt but like you know just you'll I'm sure it all be in my documentary all right okay so before we get into all that Leaping Tiger want to give a nice little shout out to them the last couple weeks we've been doing this thing called Game Over Greggy's game nights yep and",
            "start": 413.92
        },
        {
            "text": "documentary all right okay so before we get into all that Leaping Tiger wants to give a nice little shout out to them the last couple weeks we've been doing this thing called Game Game Nights yep and uh G Night on Wednesdays yep we at what time was it 7 o'clock he's so good I think it's a really cool thing like I mean we always talk about this right this being the Patreon episode there you know the they went up and SP they were the first people to come to Kinda Funny Games and take the sponsorship tier right and that they did that because they're fans of what we do and so they want to integrate with us and the fellow best friends the best way they can and they do that by planning game nights where they give away a Vita to somebody and since the app's brand new you're only playing with other Kinda Funny people and it's awesome yeah so right now everyone's playing Rocket League which you're playing that anyway so might as well play with Kinda Funny people and Wii U that's",
            "start": 457.8
        },
        {
            "text": "with other Kinda Funny people, and it's awesome, yeah, so right now everyone's playing Rocket League, which you're playing anyway, so might as well play with Kinda Funny people, and Wiita - that's pretty damn cool. So the leaping Das Tiger.com is where we can go to get it or you can get it there's an iOS app and all that stuff, pretty much it's just a way to it's a friend-finding app to be able to play games together see who's playing what go on Quest and do all that stuff, it's like a mixture of FourSquare and some kind of FriendFinder, yeah, cuz you're like I'm about I'm checking into Rocket League and then it shows you who's playing Rocket League around you and then you can message them like hey do you want to play together you're like yeah sure are you Kinda Funny people? Yeah, I hate Colin, no, I love Colin, I'm going to drive to your house and kill you, don't do that, that's all bad, don't do that. So yeah, some of those things happen, some of those things don't but definitely",
            "start": 497.32
        },
        {
            "text": "yeah I hate con no I love Colin I'm going to drive to your house and kill you don't do that that's all bad don't do that so yeah some of those things happen some of those things don't but definitely check out the The Rocket League game nights for us and uh LeapingTiger.com yeah so Wednesday go play it 7 to 9 use Leaping Tiger you have a chance to win a Vita yay yeah we need more Vitas in the wild Colin sure do Greg and I'm glad to get a Vita out there because you know that Persona for dancing all night is so goddamn close yeah I thinking about that over this trip when we were we were going to SGC playing the Vita and I'm like this is fun a game and I oh wait it's coming it's coming Persona Dancing Yeah so I was uh I I tweeted about this but after all the so as you guys might know Greg Miller has a new nickname and it's Greg Meet and Greet Miller sure because Greg Miller loves his meet and greets yeah we all do but Greg really loves did you see that when we got back for out of the The",
            "start": 532.6
        },
        {
            "text": "has a new nickname and it's GameOverGreggy meet and greet Miller sure because Greg Miller loves his meet and greets yeah we all do but Greg really loves did you see that when we got back from the meet and greet in Frisco Texas it took him less than an hour to tweet out about the next meet and greet like give you guys a lit just Saturday at Buena Park Portillo's come eat at the restaurant with GameOverGreggy Tim Nick Kevin that was so good I named my dog after you name your dog after Kevin Portillo's restroom oh my God anyways the point is over the last couple months we've been doing a lot of meet and greets and you guys have been doing them for a long time via IGN and all this stuff but I swear to God that we must have autographed over half of the Vans in existence Yeah by this point I like the best one at this at the SGC meet and greet at Wild Wings was the guy who bought it right before he came to us he had it he unwrapped it and like he was like I just bought minutes ago so you guys could",
            "start": 572.12
        },
        {
            "text": "One at this, at the SGC meet and greet at Wild Wings was the guy who bought it right before he came to us; he had it, he unwrapped it, and like, \"I just bought this minutes ago,\" so you guys could sign it. I was like, \"Yeah, cool good purchase.\" All right, so you are welcome back to the topic at hand, topic number one is from our boy Kenny Char - what up, Kenny Char? Long time supporter; he's been yeah, he in the long run a down ass...ass...in light of the recent Kojima Konami debacle as well as NoA's recent comments regarding Amy Hennig's departure, I was wondering which individuals in the gaming industry would be able to go to a new studio and be granted the resources to create a new game. I originally came up with a long list of candidates, but Igarashi and Aon's inability to fully fund Bloodstained: Ritual of the Night through traditional routes has me rethinking things at this point; it would just be Kojima, and not that he would ever leave Konami. Thanks and Kinda Funny, that's a good question.",
            "start": 621.56
        },
        {
            "text": "blood stain in Mighty Number 9 through traditional Roots has me rethinking things at this point would it just be Kojima and not that he would ever leave PlatinumGames thanks and kind of funny that's a good question I and that's a good point he raises a very very interesting point with Inafune and Igarashi in the fact of what games are publishers currently funding right and I think that Kojima I mean is in a different boat right the fact that his game is is I mean Metal Gear has been going on forever evolving it is third-person adventure you know what I mean it isn't not stuck in a bad way like Mega Man or a traditional Castlevania Symphony of the Night right 2D side scroller um so with that in mind you'd think what Neil Druckmann or Bruce Straley right if they left Naughty Dog they could go anywhere they could go they made The Last of Us Uncharted two now Uncharted Four like they'd be able to just write their own ticket and do whatever the hell they wanted to and that's one of again because they're",
            "start": 662.24
        },
        {
            "text": "they could go they made Last of Us Uncharted two now Uncharted Four like they'd be able to just write their own ticket and do whatever the hell they wanted to and that's one of again because they're making games that are in the Zeitgeist right now that are super popular right Colin yeah I mean those are the names that came to mind for me too I I think that I think there's two things one is that there are more obscure names in the industry or or uh for in not even obscure but someone like Kojima for instance and ID like like he could have gone and done whatever he wanted and he did he left he left it and he's and he's doing Oculus stuff now um but I think that there's we look almost almost at The Visionaries in terms of the artistic Merit or the creativity um and that's how you get um you know guys like Neil Druckmann and Bruce Straley or or Amy Hennig from Naughty Dog um but I think that there's probably names we don't even know our names certainly our audience would know that we're not going to get to",
            "start": 708.84
        },
        {
            "text": "know guys like Neil and Bruce or Amy all from Naughty Dog um but I think that there's probably names we don't even know our names certainly our audience would know that we're not going to get to too into the weeds that would easily be able to do other things based on their prowess to make engines their prowess to code or their prowess for multiplayer design and all these kinds of things so I think that we we look at it just on based on the names that we know but I think there are a lot of names that we don't know that can probably do uh some pretty big things at pretty big studios too but I think Hideo Kojima is the one great example and maybe D'Man in Australia and a few others um that if given the chance not only can do whatever they want but we'll probably have a significant bidding war um between multiple big Publishers because I I don't think you can compare Inafune to unfortunately to someone like Hideo Kojima or Mamoru Oshii or Shinji Hashimoto or Bruce Straley just because they've not had the critical",
            "start": 746.0
        },
        {
            "text": "between multiple big Publishers because I don't think you can compare Hidetaka Iguro to unfortunately someone like Kojima or Motomori or Hideo Kojima or Bruce St just because they've not had the critical success that they have not had the commercial success that is necessary for these big Publishers to pay attention to them so it makes somewhat some sense that big Publishers wouldn't be interested in Bloodstained because not because they can't make money on it but because they can't make a lot of money on it so it's not if Activision is going to get involved with the Gashi and they can make you know uh $5 million in profit that's probably not even worth it for them to do it you know what I mean so um I think that we have to keep those kinds of things in mind so I am most excited for Metal Gear to come out because I want to see what Kojima does because I think that Kojima will reemerge probably at a Western studio or Western publisher",
            "start": 783.36
        },
        {
            "text": "of things in mind so I'm most excited for Metal Gear to come out because I want to see what Hideo Kojima does because I think that he will reemerge probably at a Western publisher with his own studio. You think that's more likely, yes. I mean, like, I don't you think he's looking at Inafune and he's thinking like I got to get on this Kickstarter thing all this goodwill... like I said last week right? Like he's going to come out of this a folk hero, you know? I mean people would throw money at him. Sure, but I think that we overestimate how big Kickstarter is for cash and for getting money through that. But what about Suzuki, who got only $6.5 million which is still the most funded game I think of all time on Kickstarter for Shenmue 3. You know, I think that if Kojima",
            "start": 821.08
        },
        {
            "text": "money through that, but what in or you know, you Shigeru Miyamoto got only $6.5 million, which is still the most funded game I think of all time on Kickstarter for Shenmue 3. You know, I think that if Hideo Kojima went to Kickstarter, he'd be able to do more than that, but he's still not going to get the money he needs to make the game he wants to make. So, I think money on Kickstarter is just part of it, you know, like of course, like that helps and that's a nice little Kickstart to the whole thing, but it's like it's also the stories, the articles, the controversy of \"oh should he be doing this or should he not?\" He can make money this way, like all of that kind of feeds into it, and then it's just going to retell the story of Kojima being this like folk hero and all that stuff, and it's like that, it kind of creates the underdog thing where the end goal of the money isn't really the story if it be all it needs is 7 million to become the most funded game, all of a sudden that's a headline but he can't but but",
            "start": 861.56
        },
        {
            "text": "the underdog thing where the end goal of the money isn't really the story if it be all it needs is 7 million to become the most funded game all of a sudden that's a headline but he can't but but the point that's not the point the point I'm trying to make is that he can't make the games that he makes for $7 million so like so it's it's more and I do think that it would be I personally believe that it would be a little weird for Kojima can absolutely make a studio at a for an exclusive studio for a triple publisher I have no doubt about that you know and he would need way more than what he's going to get on Kickstarter to to make the games that he makes we don't want I don't want him to go to Kickstarter because he doesn't that's not going to be good enough for him you know like like and I don't mean that he's the greatest developer of all time because I don't think he is I I in many ways I think he's somewhat overrated because I I'm curious like what the people behind the scenes are",
            "start": 900.52
        },
        {
            "text": "I don't mean that he's the greatest developer of all time because I don't think he is. I think he's somewhat overrated, because I'm curious like what the people behind the scenes are really doing to make these games great. He's worked with the same you know same core group of guys for a long time; he's got a great team. But it's more that he is one of the few names that I think, because of his situation with Konami right now, there are publishers that would die to get him on board. So I don't you know like like he's not making something obscure - Metal Gear Solid is still a pretty obscure game and Bloodstained is a 2.5D Metroidvania game; it's just it's not big-budget games like he makes, big cinematic games that you can't make for seven or ten million. And so I'd be curious to see like I think going to Kickstarter is a silly route for him - my side thing to that is I'm interested",
            "start": 939.6
        },
        {
            "text": "you cannot make for seven or ten million and so i'd be curious to see like i i i don't i think going to kickstarter is a silly route for him my side my i mean my take on that is i'm interested to see if he wants this next game to be a big crazy ass budget game you know what i mean like i don't know where i'm not saying that like metal gear solid got out of control on him or something right but i i think that he might just be ready to go and exhale and make something like that sun game remember that thing on the Death Stranding tie right and like do something different and just feel it out you know what could i do what does the audience expect of me where do we go from here and be an artist again in quotes since there are no more make another Metal Gear you know what i mean sure time is of the essence for him though i i think he's got a i think that if he wants to keep everyone's always going to respect Kojima and i think and rightfully so but i think if he wants to keep his cache",
            "start": 974.64
        },
        {
            "text": "the essence for him though I think he thinks if he wants to keep everyone's respect gojima and rightfully so but I think if he wants to keep his cache he needs to immediately make another Triple A game you know because he doesn't have roots in more modest games unless you go back to like really his days in the 80s and early 90s like he really doesn't have roots in more modest games you know unless he was like executively producing something even Zone of the Enders was still a pretty substantial game compared to a lot of games around it um especially like in terms of its engine and graphically and stuff so I think that unlike igarashi who's known for making really handheld games and Inafune who's known for making you know he was the producer and creator of some big franchises but he's really known for a very simple style of game they can get away with more something that is more uh that is looser",
            "start": 1014.84
        },
        {
            "text": "know he was the producer and creator of some big franchises, but he's really known for a very simple style of game they can get away with more something that is more uh that is looser and of course remember that even with Bloodstained and they raised you know whatever $5 million around that that they still had other investment that game's going to be a lot bigger than a $5 million game so there's there's a lot of different ways in there I'm just interested because I really do believe that Hideo Kojima can get a 100 plus person Studio from a big publisher um for his own to make a tria game do what he want think he He's the kind of guy who comes as a guy who wants to do like that what he does he's all about I don't want to say he's all about himself because that is not true but he's all about his vision and he's the Marquee guy and he's the guy on the on the box and stuff so you know he's certainly the example others but it we shouldn't discount that there are a lot of other people that can do that too and we",
            "start": 1053.76
        },
        {
            "text": "Marquee guy and he's the guy on the box and stuff so you know he's certainly the example others but it we shouldn't discount that there are a lot of other people that can do that too and we might just not be able to know their names or they not might not be household names but they're certainly names in the industry what's interesting to me about the question is yeah I think what's a more fascinating question is who do we think couldn't do this I think the fact that we know someone's name is already establishing that they are the face of this brand company whatever which already gives them so much and I think that that's the thing is with this question specifically it's like you're talking about all the people that we don't know about and stuff it's like they're almost not the answer to the question because they're not going to be given those things even regardless of them having the talent it's like kind of like Hideo Kojima everyone knows who he is and he gets all the attention but what about other developers who are just as talented",
            "start": 1090.68
        },
        {
            "text": "to the question because they're not going to be given those things even regardless of them having the talent, it's like kind of like Kim Kardashian - everyone knows who she is and she gets all this stuff regardless of talent; it doesn't matter, she's known right? So it's like really thinking about there's only a handful of people that you could even I think it falls into two camps: there's the people that you know their names - there's the Hideo Kojima, the Shinji Mikami, the Cliff Bleszinski - those people that are characters themselves; and then there's the people like Inafune, that people don't know his name like I think you know on a general level but if you're like oh it's the creator of Mega Man that means something, the creator of Castlevania that means something; it needs to be you need to be in a position where you're tied to a thing so it's like I think Bruce and them - it's like the creators of Uncharted all of a sudden that makes sense but then once you start going down the the the tree",
            "start": 1122.16
        },
        {
            "text": "in a position where you'd tied to a thing, so it's like I think Bruce and them - it's like the creators of Uncharted all of a sudden that makes sense, but then once you start going down the tree a little bit, it's like I don't know, you can't really just give everyone credit for Uncharted even though they all made Uncharted. Well, David Balder did most of the heavy lifting, exactly, exactly, so him, he'd be one of those people, exactly right. But my only point is that there's a level of like Carmac was the example I used - of a guy who has I mean back in the day, he was very creatively driven in terms of content, but he's known for engines, he's known for the fidelity of the game's graphics and how it runs, and those things were really important to ID, so and they still are, really. I mean, he would obsess over frame rates and stuff like that, and and he doesn't necessarily have the chops as we saw - his level of engagement with games like",
            "start": 1161.64
        },
        {
            "text": "still are really it I mean he would he would obsess over frame rates and stuff like that and and he doesn't necessarily have the chops as we saw I don't know his level of Engagement with games like Rage that I don't think were like super well received but no one could question that the game didn't run perfectly you know and that was a product of his obsession over the tech and we don't hear a lot about those kinds of guys and in a way the guys that make your engines are even more valuable than the creators because you can get five games out of that engine you know um and so that's the point I'm trying to make is that I'm sure that there are names well-known names within in the Trenches of the industry that people would fawn over and probably make **** tons of money to not leave that really are the refiners of these various engines and the technical Fidelity the the multiplayer coding and all these kinds of things um I think uh you know that's relevant I mean so not for every Ken",
            "start": 1196.24
        },
        {
            "text": "really are the refineries of these various engines and the technical fidelity of the multiplayer coding and all these kinds of things um I think uh you know that's relevant I mean so not for every Ken Levine you have to have a guy that you know Ken Levine's not the programmer Kevin  is not the the the you know he's the Creator he's the the writer he's the the Visionary and those are important at a at a base level but um of course but we shouldn't undercut the fact that we're still playing a game you know what I mean Port stop Kevin will be back it'll be okay don't worry so that's basically where I stand on that but I think it's an interesting question I I it's more about if teams were mobile in my mind like who you know like for instance like how much would Microsoft kill to get Naughty Dog you know or how much would uh you know Sony want to get you know one of the you know like uh one of Nintendo's internal studios or something like that like it's I I look at is more as a it's",
            "start": 1233.4
        },
        {
            "text": "Dog, you know or how much would uh you know Sony want to get one of Nintendo's internal studios or something like that. It's a team effort, there's a lot of people behind the scenes doing important work too. If you just took the visionary, they might not all go along with that person, which is why I'm interested in seeing what Kojima does with poaching people from those studios and how much value that will be when he's on the market soon. I'm more excited about that than Metal Gear Solid 5, which is fine, but I'm not really excited about it personally. I am excited to see what happens to this particular person, and I want to play that game - can't wait for it.",
            "start": 1278.44
        },
        {
            "text": "excited about it at all but I'm I'm that's just me personally but I am excited to see what happens to this particular person I'm excited for both but I really want to play that game can't wait for that game it looks great it's just not a game I'm I'm going to play Mad Max before I play Metal Gear I know that's crazy oh my God you're silly man Colin all right so topic two comes from Min-Chung hi this is very exciting my question is what are your thoughts on naming babies based on video game characters I named my daughter Ellie when she was born 10 months ago it was heavily influenced by The Last of Us I've seen people name their kids weird and frankly stupid names based on books or movies but Ellie is a real name the name was cute but it was the damn judging Ellie and Joel had that really inspired me I wanted to be a Joel figure to my daughter I wanted to be a father who would do anything to protect his daughter though Ellie isn't Joel's daughter spoilers that's pretty known anyways I",
            "start": 1315.44
        },
        {
            "text": "Inspired me, I wanted to be a Joel figure to my daughter. I wanted to be a father who would do anything to protect his daughter. Though Ellie isn't Joel's daughter - spoilers, that's pretty known anyways. I wanted to hear your thoughts on this matter. And lastly, the Korean barbecue in Atlanta is still available whenever you guys come back here. Thank you, man. Thank you. I think it's cool. Yeah, I like that. I like that we're at a point where video games can be taken seriously enough and like you can do that and not - I mean don't get me wrong, people are still going to scoff there's going to be people who meet you where you explain the name they're playing but I mean the majority... Don't get me wrong, those people will die soon; they're aging out of the demographic. And then it'll just be a point where yeah, you can respect somebody when we met Logan at Comic-Con during our panel and I was like \"Oh, who?\" And his mom was like, \"You named after Wolverine.\" She's like, \"Yeah,\" I was like, \"That's awesome.\"",
            "start": 1355.08
        },
        {
            "text": "where yeah you can respect somebody when we met the when we met Logan at ComiCon during our panel and I was like oh who and his mom was like you named after Wolverine she's like yeah I was like that's **** awesome that you named your son after Wolverine are you kidding me like I love the fact that that kind of stuff's happen yeah that's really cool a couple days ago someone on some social media I saw this on Instagram yeah and I don't know if it's a true story I don't know if he actually named his daughter after Harley Quinn really all so he was like yeah in 2003 whatever everyone I met was like oh so you must really like motorcycles and it's like oh you must really like uh have you seen the Suicide Squad trailer yeah it's like that's crazy that Harley is now and I remember that I remember when he did that cuz I was a huge Kevin Smith fan obviously I well I am a huge Kevin Smith fan and I am a huge DC Comics fan even back then and I remember that I remember being like that's awesome but really weird",
            "start": 1390.88
        },
        {
            "text": "he did that cuz I was a huge Kevin Smith fan obviously I well I am a huge Kevin Smith fan and I am a huge DC fan even back then and I remember that I remember being like that's awesome but really weird that this animated series character has caught on to this level that he's comfortable doing that you know what I mean but now like being an adult right I wouldn't bat an eyelash at that right yeah what's interesting for me is like names are names you know whether it's a a game character or a movie character comic book whatever it's like or a real person you know it's like when you hear it if it resonates with you if that per there's a couple ways to look at it because you're not necessarily naming someone after the character you could just like the name you know but then there is the other side that you are naming it after this character because this character means something to you he wants to be a Joel to This Ellie you know whether it's that or if it's something you meet someone in",
            "start": 1431.28
        },
        {
            "text": "that you are naming it after this character because this character means something to you he wants to be a Joel to This Ellie you know, whether it's that or if it's something you meet someone in real life and you're like oh I'm naming this person after Kevin who is the best person I've ever met in my life you know it's like that means something but it could just be like oh I like the name Kevin yeah you know and I've actually I've thought a lot about it in in my time of if I have kids what would I name them and why and all and M Pokey and mon yeah you'd have to poke gettis M gettis that'd be good I was thinking of naming my kid Spaghetti, that's actually really good that's actually awesome yeah it is um but you know there's been a lot of video game characters that i' I've kind of made a mental list where I'm like if I have a kid these are potential names and a couple of them have been names I've heard in video games and I'm like oh I like that a lot of them Final Fantasy",
            "start": 1469.2
        },
        {
            "text": "of made a mental list where I'm like if I have a kid these are potential names and a couple of them have been names I've heard in video games and I'm like oh I like that a lot of them Final Fantasy characters a lot of them names that I'm not going to name my kid cuz they're **** weird but no not not so much TI Blitz ball was a close second like Yuna I think is a very pretty name and I think Yuna is a pretty girl name I'm not naming the I wouldn't be naming her after the character Yuna though you know it's just I like that name and it's Unique and weird but I'm unique and weird if you think about it are you're unique and weird butterfly um but yeah I'm blanking now but there there's definitely uh other ones and I feel like a lot of them tend to be Square games like I like Kyrie a lot from Kingdom Hearts again not naming it after Kyrie but that's a pretty name goofy um goofy goofy Gettys what are you get up to GG I like that goofy told you Kingdom Hearts is coming out this year told you",
            "start": 1514.52
        },
        {
            "text": "Kingdom Hearts again, not naming it after Kyrie, but that's a pretty name. Goofy, um, goofy, Gettys, what are you getting up to, GG? I like that, goofy told you Kingdom Hearts is coming out this year, told you, mother... doubting me. What about you, Colin? Um, I'm of two minds because I think that when you're naming someone after a character, you have to give it a little bit of space. Um, I think that so Ellie is kind of safe, but you just don't like when characters are active. I'm always interested in like we haven't seen the last of Ellie and I'm interested in like what if something terrible happens, what if she turns into like a terrible person, like what if she ends up being the villain or something? Like I think someone I heard someone named their kid Kairi or something like that. I'm like that's like really not a good idea because like you have no idea what the... that character could be by the end of that.",
            "start": 1557.56
        },
        {
            "text": "their kid like Kisi or something like that I'm like that's like really not a good idea because like you have no idea what the **** that character like that character could be by the end of that Series be a **** villain and be awful or be dead in some like you named her named your kid after a **** character that's going to get decapitated I don't know what the **** happens to her but you know like there's just all these wait until it's over you know and then and then go in that direction so I don't think it's necessarily capricious but it's it's like a little bit when people are rushing to name their kids after things that are like very new I think that's just it's not it's it's your prago but I think it's just dangerous because you don't know what the ramification of that name is going to be when it's all said and done yeah and that's going to **** matter you know especially Ellie you can get away with because it's it's Ellie short for Ellen first of all and it's it's you",
            "start": 1612.36
        },
        {
            "text": "going to be when it's all said and done yeah and that's going to matter you know especially Ellie, you can get away with because it's it's Ellie short for Ellen first of all and it's it's you know or Eleanor, yeah and you can't that we know like what necessarily her name is in the game, Ellie is not just a normal name I mean like that's a that's a shortening of something maybe he did well K, you know K Andrea it's a it's and K is the title isn't it it's not the name yeah uh but to me it's it's it's just you just don't know what's going to happen you don't like with Ellie you can get away with and be like if just a family name or no one's no one's going to ask like how she got her name Ellie no one's going to ask that but when you have a kid named Keesa it's like well we know where you got that from and God forbid she ends up being like the end of the world you know villain or something like that now you just named your kid after a cat you can't do anything about it and",
            "start": 1644.6
        },
        {
            "text": "that from and God forbid she ends up being like the **** end of the world you know villain or something like that now you just named your kid after a **** cat you can't do anything about it and everyone knows why you named your kid Kelsey so like I just think you have to give yourself a little bit of space from some of these fictional from some of these fictional characters that said I have no like no problem with it I personally wouldn't do it uh but I'm not I love video games but I'm not going to name my character video games but that said I want to name my kid after historical figures so it's like so it's the same it's exactly the same although those were real people that did real things so I think that that's there's there's a big difference there but you know like I want my um I've always wanted to name either for a boy or a girl my first kid Roosevelt and um for Teddy and for FDR and because we're from New York and all those kinds of things just like they are um and I love",
            "start": 1685.24
        },
        {
            "text": "always wanted to name either a boy or a girl my first kid Franklin and um for Theodore and for Franklin D. Roosevelt and because we're from New York and all those kinds of things just like they are um and I love that name but that's a real like they're done we know like we know everything they did good and bad and they're not perfect people but I have a good vision of what FDR and Theodore Roosevelt did and it's way more positive than negative and so I'm inspired Enough by their their real life events both of them to to name my kid Franklin um as a first name and I think that's awesome but if it was like the 40s and I didn't really know or the 30s and I didn't really know what the **** FDR was going to do yet it might be a little dangerous kind of thing you know so that's the only point I'm trying to make I think it's one of those things though that you can do it you could name your kid Ellie or if we're in the 40s you could name it Roosevelt and not I for me it was just like I I we always talk about",
            "start": 1718.24
        },
        {
            "text": "I think it's one of those things though that you can do it, you could name your kid Ellie or if we're in the 40s you could name it Roosevelt and not - for me it was just like I I - we always talk about how we wanted when we were both remember when we first started at IGN we were like we're so into this and when we're both EIC's of channels we want to get IG and Tattoos right and I kicked around with that for a long time and people used to try always say that's a dumb thing, don't do that, what are you talking about, don't do that. If I had done it and I had gotten my IGN tattoo, I wouldn't regret it now that I don't work at IGN, that would still be something that was Cherish and very important to me - that time just like if might I'm telling you I wouldn't well I mean like I I don't have it so I guess I can't say it but I I'm tell in my mind said I would not regret it, I think about it all the time, I would I honestly I would probably then be getting more CU if I liked how it looked or whatever",
            "start": 1759.76
        },
        {
            "text": "I'm tellin' in my mind said I would not regret it. I think about it all the time. I would, I honestly, I would probably then be getting more ink if I liked how it looked or whatever. Now I'm talking about would I regret the motivations of it? Not do I think my arm would look good in the tattoo. It's the same way there. I think in fact that you named your daughter Kesi and because you like the first three seasons of Game of Thrones, or whatever. And then yeah, in season what are we on? What we just ended five six, we're going into six, Season 6. She starts drinking blood and killing babies and punting them across the sky and stuff, and it's on a forest preserve. God damn I'd pay to see that. Yeah, I mean like I don't think that like ruins the kid's name because it was like from this one spot and then she's growing into her own name. It's not like the name no longer is still only the name as soon as it's given to the child upon birth it becomes theirs and they do what they want with.",
            "start": 1794.56
        },
        {
            "text": "and then she's growing into her own name it's not like the name no longer is still only the name as soon as it's given to the child upon birth it becomes theirs and they do what they want with it you know what I mean if that makes sense whereas like it no longer is just this you got it from this one point of origin and then went off I suppose I I don't know I don't know that I necessarily agree with that because it's it's like you know the 12 apostles or whatever right and you're like you're looking through the names but it's like before Jesus was crucified you're like oh I'm going to name my kid Judas sure and then Judas is the one that betrays Jesus you know and like that name is loaded forever forever you know that name means something Hitlers are out there like you think that there's like a bunch of kids named Hitler I'm sure that there are some white supremacist kids that are named that are Nam that is like just unfortunate you know yeah um but I think but I think the",
            "start": 1834.44
        },
        {
            "text": "like a bunch of kids named Hitler, I'm sure there are some white supremacist kids that are named that - that's just unfortunate, you know? Yeah, um, but I think the Hitler family... he had a sister or cousins, I don't know, something like where they changed their names and stuff like that. But, um, like I think that's a dead name for a good reason. Uh, but so I think that yeah, in you're just setting your kid out there and that's your intent, and that might be their intent. But if your kid's named Judas and it's out there in the real world, well, that name has a connotation that is extremely negative, you know? And there's nothing you can do about that. So like that's the only point I'm saying to be a Judas is to be a traitor, right? And exactly, that's why you wouldn't do it because the name's already so tainted. Right, but I'm saying if in the time they didn't wait long enough to watch Jesus get",
            "start": 1870.72
        },
        {
            "text": "judice is to be a traitor right and exactly that's why you wouldn't do it because the name's already so tainted right but I'm saying if in the time if they didn't wait long enough to watch Jesus get betrayed to wait to see the one man who betrayed the Son of God yes I mean yeah I don't know if K's Story Game of Thrones is the exact same but I mean I'm also the guy who always does that thing where it's like you I I don't like I always if I'm mean to somebody or say I'm we always joke around we're mean to each other like I would be like oh hope your plane crashes which I would never say but if I did right and if his plane crashes you're going to feel really bad and it did crash I'd be like well that was weird I wouldn't feel bad about it in the same way like yeah not at all I didn't **** will your plane to crash get over yourself I don't got psychic powers even though maybe I would go I hope that I hope that Stay Puft Marshmallow Man falls over and I just say it over and over again",
            "start": 1911.12
        },
        {
            "text": "your plane to crash get over yourself I don't got psychic powers even though maybe I would go I hope that I hope that Stay Puft Marshmallow Man falls over and I just say it over and over again to see if I do have powers that can make Stay Puft Marshmallow Men fall down God damn it great that's what I see I can say the camera I could say Kevin it doesn't matter um but it's the same way with the name where it's like I like the name like I like the name Barbara right and I'd be naming whatever after Batgirl and I'd call her Babs and all these different things right but I wouldn't like you know spoilers for what happened a long time ago in The Killing Joke right she gets paralyzed or whatever it's not like I don't think I'm setting my kid up to get paralyzed or to be cursed or something I granted after New 52 she miraculously started walking in but she but that's not the point that's not what I'm saying like that's not her fault that that happened it doesn't make her a bad person or",
            "start": 1952.56
        },
        {
            "text": "I granted after New 52 she miraculously started walking in but she but that's not the point that's not what I'm saying like that's not her fault that that happened it doesn't make her a bad person or taint her character I just in other words what I'm saying is that if you're going to do this it's fine uh I think you should do whatever you want as your kid but give it enough I just encourage people to give it enough space to make sure things are wrapped up and you have a full feeling of what the the name means in general popular culture whether it's with games or with Comics or with movies and stuff like that because you just don't know like I I just I would hate to find someone in a position where that person ends up like that name ends up being a stain on that child who didn't ask to be that name that because there an association that they wasn't anticipated because they didn't wait long enough and that kind of **** definitely is going to happen to people that are I don't think",
            "start": 1989.76
        },
        {
            "text": "be that name that because there's an association that they weren't anticipating because they didn't wait long enough, and that kind of thing definitely is going to happen to people. I don't think there are that many names though that would never be Judas - what I'm saying is just my example. I don't know what's so funny about it really; like I don't see how that's like... I'm just being honest. Like, Kojima is just an example of a character where you just don't know what's going to happen with that character. What's the point? Just be patient and wait - you know, if you're naming your kid after a fictional character that you have no control over until all said and done, there's no reason to just not wait. That was the point I was trying to make: I want to name my kids after historical figures, and if I have kids, we'll have enough time and distance to judge them - you can't really hold off on",
            "start": 2024.8
        },
        {
            "text": "trying to make was like I want to name my kids after like historical figures and if I have kids and we have enough time and distance to just be able to judge them you can't really like hold off on your kid you know no but you can hold off on using a name that you don't that's that could be loaded later on I'm just saying it's not it's it's not going to hurt you it's going to hurt them I think that's a totally reasonable not funny thing to say I I don't you know like that's just it's interesting I was reading an article a while back and I think I talked about this on Game Over Greggy show at some point but it was like looking at each year and what the most popular names are and that there's always a high percentage of them that are names that are unique to that year based on pop culture and what was going on at that time and it's so weird to look at and just be like there was I'm sure there was a lot of yeah that going on and and then um someone out there is million when High School",
            "start": 2057.04
        },
        {
            "text": "and what was going on at that time and it's so weird to look at and just be like there was I'm sure there was a lot of yeah that going on and and then um someone out there is naming their kid after High School Musical came out like in the top 10 names of the year like five of them were character names from High School Musical really and like uh or the actor's names like one of them was Corbin Blue oh okay and um the Corbin there was more Corbins than ever before and like yeah now Game of Thrones characters are just being thrown out there and there was certain video game ones too like I remember Hodor at some point someone named their kid Hodor there's got to be a Hodor how many what I really want to know now is how many Judases do you think there are born every year some **** like I don't care I like that name yeah I mean I'm sure that there are Judases out there I just think that that that is like that's just an example of an exceptionally **** loaded name yeah obviously",
            "start": 2092.48
        },
        {
            "text": "I don't care, I like that name, yeah. I mean, I'm sure there are Judases out there. I just think that that's just an example of an exceptionally loaded name, yeah. Obviously, you know, um, probably the most extreme version of that you could possibly think of, really. You know well, I'm sure there's other ones but I don't know. To me it's just like names are important they mean something and people always talk about how like you you you might have a nerdy idea for a name or whatever it has necessarily nothing to do with games or comics or pop culture but that ultimately that child is the one that has to go through life with that name and so you just have to be very careful with, you know. I don't think that's a reasonable thing to say at all, frankly, you know, just to just make sure um that that's a name they can be proud of or at least in a name that that doesn't conjure up other images in people's minds of things that are not necessarily good, you know. All right I",
            "start": 2135.04
        },
        {
            "text": "make sure um that that's a name they can be proud of or at least in a name that that doesn't conjure up other images in people's minds of things that are not necessarily good you know all right I looked up the most popular names of 2015 so far yeah and I'm not I don't know the sources of many some of the I mean people are getting real creative I'll tell you what there's uh for girls names Anley A i n s l e y That's a character from West Wing um that's probably why it's happening the proliferation of Netflix Bion enough time enough time has passed Bryn Yon Bion b b r y n y Elanora era e this isn't a real thing no these are these is like most popular new names yeah no the 100 hottest baby names of 2015 yeah it's the most kids being named this **** chair leg I mean I'm reading I'm reading Primrose p r i m r o That's from The Hunger Games the oh is it yeah well so there you go Pandora yeah that's a great name to name your kid um next like are you like that's example that's an example",
            "start": 2170.56
        },
        {
            "text": "Primrose is from the Hunger Games, the oh is it yeah well so there you go Pandora, yeah that's a great name to name your kid um next like are you like that's example that's an example of like people maybe are just maybe most people will go through their lives out that's like a really negative name to have Pandora why are people like not thinking about about these they're taking it back con it's a pretty name man these yeah there Pax someone a dude named PX, Pax, yeah God damn it Penny Arcade all these babies getting con popping up I'm I'm going crit to R link for that one all right all right all right anyways yeah it's it's interesting to think about I'm glad that people are getting more creative with names because names are just very stagnant right now you know like I I I wanted that's why like I just want to go back and just find when I was younger I",
            "start": 2231.88
        },
        {
            "text": "like I I I wanted that's why like I just want to go back and just find when I was younger I always knew I wanted to name my kid after kids after historical figures and I used to when I was younger I was like Madison would be a great name stuff like that that name is so overused now so like that you have to get like more and like and it just happens over and over again with names that are once creative that then people latch on to and use over and over again Jackson's another great example um those are great names but now everyone's named Jackson Madison so like I i' I've been in like so many situations where like with little kids running around a store whatever where like parents are yelling at them \"Jackson, come here\" or \"Madison, stop that\" like Jesus Christ there's a lot of these kids out here um so you have to like go deeper into the well based on like what you're inspired by and so I i' I've wanted to um I love I love the idea of even taking names that are not necessarily even that don't even really sound like first",
            "start": 2278.4
        },
        {
            "text": "into the well based on like what you're inspired by and so I, I've wanted to um I love I love the idea of even taking names that are not necessarily even that don't even really sound like first names and and working the first names Roosevelt's a great example of that so like and just calling if just a girl calling her Rose or whatever um but just finding just finding a name that you can identify with his great and whether that's in history whether that's in comics or movies or whatever I just say like wait until that if it's a real person wait until they're dead so there's nothing bad that can happen and if it's a video game character wait until you know or a comic book just wait you know because ultimately you know you could be setting your kid up for for getting teased and and just having to carry through this name you know K's probably end up being a terrible person at the end of the at the end of the books M if she's not already dead I don't know I don't really",
            "start": 2315.16
        },
        {
            "text": "just having to carry through this name you know K's probably end up being a terrible person at the end of the books M if she's not already dead I don't know I don't really care at this point all right so topic number three comes from Reed Booming yes I well hold on see there's here's the problem with these uh things they always have their question but it's surrounded by a bunch of like notes to us and all this stuff so I don't even know the context of this because you just copy and paste it in I should probably erase that before I read these I'm going to do that but anyway my topic is with the four main gaming companies SLS Services Nintendo Xbox PlayStation and PC AKA Steam Steam do you guys see a future where any of them merge together or buy each other and do you think they should for example Nintendo publishing games for PlayStation or Steam store on Xbox Colin yes I don't merging no I making games for each other sure uh I think Nintendo is obviously the",
            "start": 2352.24
        },
        {
            "text": "you think they should for example Nintendo publishing games for PlayStation or Steam store on Xbox Colin yes I don't merging no I making games for each other sure uh I think Nintendo is obviously the most likely candidate to make games for someone else um out of that group of four individual Steam I I think uh is so ingenious and makes so much money that there's no reason for them to do anything I think that if they just like kind of held back that they'd be fine although I I still wonder what the future of PC gaming is all ultimately when compared to console gaming as well I don't know that either of them are necessarily safe and what I mean by that is that there might be some sort of ubiquitous gaming apparatus in the future a unified console that is neither that is neither necessarily a console nor PC that is just something you plug into a TV or plug into a monitor or whatever so I don't know that I don't think any of them are necessarily safe from one another um I think people talk",
            "start": 2392.76
        },
        {
            "text": "console or PC, that is just something you plug into a TV or plug into a monitor or whatever. So I don't know, that I don't think any of them are necessarily safe from one another. Um, I think people talk about PC gaming as having longer legs and I think that's probably true but I think that um ultimately all these guys if they want to survive in the space will be making games for one system in the future. I just don't know when I think people thought that that might have even been now um 10 years ago for instance um yet we are still in this space so who the **** really knows but Microsoft, I think it's likely that Microsoft sells Xbox at some point, that that's been rumored for a long time and I think that that's entirely possible uh Sony makes so much money off a PlayStation compared to what Microsoft makes on Xbox that they kind of need them although I think it's possible that they spin off eventually as well um and then Nintendo, I think you know we'll see what happens with NX but I I",
            "start": 2437.4
        },
        {
            "text": "Microsoft makes on Xbox that they kind of need them although I think it's possible that they spin off eventually as well um and then Nintendo I think you know we'll see what happens with NX but I I think that uh um I don't think it's it's out of this world at all to consider the fact that they'll probably be making games for those two guys um if NX fails yeah that's I mean I think the fact how it will go down right that Nintendo will eventually end up putting games everywhere becoming Sega 2.0 but being successful going out and doing that and then yeah they're not going to get bought they're going to still have money in the coffers because they're getting be making money because their developers are making awesome games that work and are super fun to play and now you can play them on anything I think the most likely scenario he has in there would be yeah Xbox doing something with Steam you know what I mean that's interesting I've never even really thought about that I don't know how",
            "start": 2469.88
        },
        {
            "text": "I think the most likely scenario he has in there would be yeah Xbox doing something with Steam, you know what I mean, that's interesting. I've never even really thought about that. I don't know how it would work though because, because just the fact of the you need the controller compared to but that's the whole thing with Steam, the Steam Boxes and their controller and all that goofy stuff right. I mean there is a Big Picture Mode like I it's not out of the realm of possibilities to think about there being CL you know how do you compete with Guai or whatever you know PlayStation Now, not that you really need to anymore because it's nothing but you know in the future right when it is better and there is there's even less latency that yeah you're using your Xbox 2, your Xbox 2 to get and you have your Steam app Big Picture Mode app that is connecting to the games you've bought on Steam to play them through here to do this like you know stream it off or download a little bit and play.",
            "start": 2506.32
        },
        {
            "text": "you have your Steam app Big Picture Mode, connecting to games you've bought on Steam to play them through here, to stream it off or download a little bit and play through it, and keep downloading in the background and stuff like that. That could work, it wouldn't be every game obviously, but there'd be games where it could work and do that. And that would be the thing you'd need to figure out, like the way it is right now with Windows 10, as like the walls continue to fall down so Microsoft is just one company right, and it's one platform and all that stuff. When those barriers are gone, then it hopefully communicates even better with Steam, and does give you that PC-like experience if that's what you want. And so that's the thing, the problem there would be if they get spun out, if Xbox does which you hear the rumor about all the time, that's a way Microsoft would want",
            "start": 2543.04
        },
        {
            "text": "the you know the problem there would be if they get spun out if Xbox does which you hear the rumor about all the time that people are looking at that that's a way you know a way Microsoft would want to do Xbox well think of stuff that's not likely but just like hypothesizing on what could happen if Nintendo were to actually merge with one of the companies do you think that there'd be a major difference between Nintendo merging with PlayStation or merging with Xbox what I mean in terms of like equal like what the companies would look like in ter yeah I mean whoever emerged with would be that'd be insane and that would be really really really hard to overcome I feel like right especially if it was like we've merged with Xbox and now on Xbox Live everything from virtual console is up right like that would be insane and there's a CH there's cheios on and everything like that in terms of like what it looks like I assume right I mean I feel like Xbox is such a western company",
            "start": 2579.44
        },
        {
            "text": "right like that would be insane and there's a CH there's Cheo's on and everything like that in terms of like what it looks like I assume right I mean I feel like Xbox is such a western company that would be the thing right is like they're already so Western versus how so Japanese Nintendo is whereas with Sony I feel like as siloed as Sony is on territory to territory developer to developer that they'd pretty much be left alone you know what I mean it's whereas I think Nintendo would try or Xbox Nintendo would try to make it much more Mario's everywhere on your dashboard or whatever like the chief and him are doing stuff all this left and right whereas like I feel like if they were to merge with Sony and I'm obviously I keep talking as if I'm giving the Sony's buying Nintendo is how I'm thinking it in my head right but it would be that yeah that they would just be another first party developer right and they'd obviously there's that's not exactly what it would be but that's how I feel",
            "start": 2624.68
        },
        {
            "text": "it in my head right but it would be that yeah that they would just be another first-party developer right and they'd obviously there's that's not exactly what it would be but that's how I feel like they'd be run you know what I mean like from the Nintendo group here's what we have D yeah I think I mean that would never happen for I mean was all hypothetical Nintendo Nintendo is way more valuable than than Xbox or PlayStation so if anyone was going to merge with anyone else I think it would be like Xbox and PlayStation merging to survive um in a in a future sure just because Nintendo's IP alone is is worth so much more than than what you know PlayStation and Xbox's prolific outputs are uh because of the bad blood between Sony and Nintendo going back a long time as we've said before there's no way that they I I I I find it if they were going to make if Nintendo was going to go third-party but do something exclusive they would actually do with Xbox um but I think that the future is",
            "start": 2668.92
        },
        {
            "text": "no way that they i i i i i find it if they were going to make if Nintendo was going to go third party but do something exclusive they would actually do with Xbox um but I think that the future is that they just make games for everybody um but yeah I mean just monetarily it's it's hard to talk about that even in a hypothetical sense because Nintendo is just worth is just really valuable compared to the PlayStation as a brand is very valuable and the Xbox as a brand is very valuable but I think Nintendo based only on their IP um and the fact that when you buy them they wouldn't turn into with first party Su they already have like 15 of them so it would be like you know you're getting a it's like an incred it's it's that's a big that's a heavy lift you know um I'd be super interested to see how how that all went down how many conversations you think there's been Colin have there been ever legitimate conversations you think between Xbox and Nintendo in terms of getting an exclusive game",
            "start": 2707.28
        },
        {
            "text": "how how that all went down how many conversations you think there's been Colin have there been ever legitimate conversations you think between Xbox and Nintendo in terms of getting an exclusive game no no I don't I would love to think that there have been I would just love to think when Xbox was trying to **** overthrow the world they knock on the door and like hey just check no okay cool I mean I mean maybe they had those out there I don't think I think Nintendo would laugh at and I totally agree with you I totally agree with you I just wonder maybe I I I you know it's again was we said so many times I wouldn't have ever guessed that they would have finally swallowed their pride and went on on mobile so um I don't think we're too far off if especially if NX is a disaster um like Wii U is then like we're not too far off from from them putting their games on other consoles and they should that's what they should do they they they're not they don't make good hardware and that's fine",
            "start": 2746.96
        },
        {
            "text": "is then like we're not too far off from them putting their games on other consoles and they should that's what they should do, they make great games and they should focus on that, not even worry about the hardware anymore. I wish that we were in that future, I think that would be fantastic for gamers, but um we're not in that place yet. And I'm still interested to see what Nintendo's NX is - I think they can pull a rabbit out of their hat, it's totally possible. The rumors, whether substantiated or not, don't sound too promising, um in terms of power anyway, which is going to be necessary to attract third party support. It seems like it's just kind of like Groundhog Day, you know? But who knows, I'm trying to remain optimistic about that because we literally don't know anything substantial about it at all - we don't know anything about it other than rumors",
            "start": 2785.16
        },
        {
            "text": "Day you know, but who knows? I'm trying to remain optimistic about that because we literally don't know anything substantial about it at all. We don't know anything about it other than rumors. So yeah, um, I don't know what do you think the difference would be between Nintendo going third party for everybody and Nintendo merging with one of the two straight up? What do you mean? I mean, the difference would be huge for whoever they did that with, but I mean, so what do you like? What do you think it would mean not for the companies themselves, but more just for like how like what would the products... how would the products differ between those things? Uh, I think the digital offerings on whoever netted Nintendo would be huge, like Greg said. I mean, they just have a huge catalog of hundreds and hundreds of games they can put on uh those systems, and then they're going to get all their developers. So it's... you're going to have your Fire Emblems and your Mario I mean it would finally...\n\nI corrected the following errors:\n\n* \"thatx\" → \"that\"\n* \"rumors so yeah um\" → \"rumors. So yeah, um\" (added period for clarity)\n* \"what do you think it would mean not for the the companies themselves but more just for like how like what would the products how would the products differ between those things\" → reformatted to improve readability and grammar\n* \"Mari I mean it would finally what\" → \"Mario I mean it would finally...\" (corrected name and added ellipsis to indicate incomplete sentence)",
            "start": 2818.8
        },
        {
            "text": "of games they can put on uh those systems and then they're going to get all their developers so it's it's um so you're going to have your Fire Emblem and your Mario I mean it would finally be what we're talking about all the time with PlayStation 4 and Xbox One is the fact that there's no no diversity between these two consoles they're it's the exclusives and that's it you know what I mean and that's why we're always like well it would have been really interesting to see Xbox commit to their vision we are this entertainment box and we are connect and you're we're going to show you why you should love it right cuz then there would have been parody there there would have been something different when you finally if in this weird world Nintendo comes in and merges with one of them then finally there is I think hands down a definitive winner there's a definitive leader there's this is what which box should I buy you should buy Sony's Nintendo box you know what I mean like you should get it's",
            "start": 2855.0
        },
        {
            "text": "there is I think hands down a definitive winner there's a definitive leader there's this is what which box should I buy you should buy Sony's Nintendo box you know what I mean like you should get it's everything you love from Sony and everything you love from Nintendo in one you know what I mean and sure you're going to miss exclusives like Halo or vice versa you're going to exclusives like Uncharted but you're going to get every one of these Nintendo games classic things you've missed you're going to get the brand new Mario the brand new Metroid eventually the you know what I mean like yeah I guess I guess the question I'm asking to put it in a better way is do you think that Nintendo going third party would mean that you're only getting the like a few core games everywhere whereas if they merged then you would get all the little developers making the different games because I I if Nintendo were to just go third party does that mean games like F-Zero and I mean Metroid",
            "start": 2888.4
        },
        {
            "text": "merged then you would get all the little developers making the different games because I I if Nintendo were to just go third party does that mean games like Fire Emblem and um F-Zero and I mean Metroid would probably be safe but like there's certain ones it's like they would not be a thing anymore and all of a sudden third like it's you look at I see you're saying I see saying I see you're saying I don't no I don't I think even third party you're still getting Fire Emblem you know what I mean there's still an audience for that whether but it' probably be a phone game if they're trying to be you know mobile and stick with what's already working right if they're trying to CH I think that's what you would see right is that the big exclusives you think about your Zelda your Mario and I'm talking about you know the console quality Games that they put on Wii U now right would go everywhere and the games you think of for your DS would probably go to the mobile market or be at maybe it's mobile",
            "start": 2928.08
        },
        {
            "text": "you know the console quality game that they put on wii u now right would go everywhere and the games you think of for your ds would probably go to the mobile market or be at maybe it's mobile and download stuff you know what I mean like they're downloadable titles but they'd still be there i think they'd be in the if they're going to go that way they'd be in the psn store and the xbox live marketplace you know download thing i don't think it would be okay these are only on phones and these are only there that's not what they want to make money they wanted as many places they can get it yeah i don't i think it's the exact opposite really i think that the smaller big games are going to do even better and the smaller games will have a bigger platform for people to play them because they're not going to be stranded on nintendo hardware anymore so like i think that like it opens up a whole new world of wonder for metroid and f-zero and all these things like if you could not strand it on wii u but put",
            "start": 2963.96
        },
        {
            "text": "Stranded on Nintendo hardware anymore, so like I think that like it opens up a whole new world for Metroid and F-Zero and all these things. Like if you could not strand it on Wii U but put it on consoles that people actually own and play and engage with on a regular basis, then obviously Mario's going to do even better. But of course, then you're going to be able to open up a reality where an F-Zero game could sell a few million copies or a Metroid game can sell more than a million or two million copies. Like I think that if anything it helps the smaller games, you know. And I think that Nintendo just grows from that point, you know. That's why it's so exciting for them to be an Activision almost not necessarily an organization, but that's the thing. There is like if they went third party what would that even look like? Because I've always kind of thought in my head just that it would be they'd be much smaller and they would just be making these games and they would have more.",
            "start": 2998.56
        },
        {
            "text": "\"Party, what would that even look like because I've always kind of thought in my head just that it would be they'd be much smaller and they would just be making these games and they would have more of a a schedule of you know maybe the two games a year or whatever but to think of them as an Activision where they are doing a whole bunch of **** at once is very interesting. Yeah, I mean if they I mean if they if they went third party cut out hardware and kept the status quo otherwise I mean they would have they would still be putting out 10 12 15 games a year. I mean plus they could be a publisher of games you know they can they can they can be uh they would be obviously publishing their own internal games like they do now but and but they can be identifying and finding uh developers to work with like they have been on Wii U especially like Platinum Games to deal with and publish their games too. Nintendo could be huge, I feel like I feel like the ironic thing is that Nintendo and Shigeru Miyamoto, I think\"",
            "start": 3037.0
        },
        {
            "text": "with like they have been on Wii U especially like Platinum Games to deal with and publish their games too. Nintendo could be huge, I feel like. The ironic thing is that Nintendo and some Nintendo fans think that Nintendo is best equipped to be a hardware manufacturer but think Nintendo can be bigger than ever if they weren't. Oh yeah, and um be like a dominant force in quality trip A games not to me, and but then unlike Activision, um and to a lesser extent unlike Ubisoft, and unlike you know EA, they would have smaller games too because I think that's part of their heritage, and they don't have to charge $50 or $60 for all these games. They can charge 10 or 15 or $20 if they want to release those games on something like Virtual Console, although one gets the games with something like a mobile platform in the future or future handheld. I think it's it's it's unpredictable, it's an interesting question because I think Nintendo's complex of Nintendo",
            "start": 3073.04
        },
        {
            "text": "games with something like a mobile platform in the future or future handheld um I I think it's it's it's unpredictable it's an interesting question because I think Nintendo's the complex of Nintendo changes radically if they if they do something like that and I think we're going to see that and um depending on the fate of NX cool all right guys final topic as always is a whole smorgasbord of questions from the audience these are are taken these are not patreon these are from kind of funny.com forums so go there leave your topic we'll get to it it's going to be a fun time just like Dan Phillips did he wants to know what game magazines did we grow up reading and have a subscription to egm or trying to give me one was it for me man like uh I I had Game Informer to obviously when they made their deals with EB at the time um I picked up game pro that was like the gross you know the supermarkets one where i' page through it and then asked Mom if I could get it but egm was the one that I",
            "start": 3111.56
        },
        {
            "text": "their deals with EB at the time um I picked up GamePro, that was like the grocery store one where I'd page through it and then ask Mom if I could get it, but EGM was the one that I subscribed to straight up and was with forever, you know what I mean, until it ran out, until it was over. And like, that's you know my stories always go back, I always talk about the fact that you know in fourth grade I had GamePro, and that's when I all but abandoned it. But like the review crew of you know Shu Ouma and CH, and stuff like that, like that was the one, those were my like idols growing up, you know what I mean. And like to the point that like obviously I always tell the story of like there's only been two times in my life when I couldn't stop talking, number two was when I met Shu for the first time when I was working at IGN and just unloaded on him at a holiday party how he changed my life and all stuff, and he's like cool and like backed away, like left.",
            "start": 3157.8
        },
        {
            "text": "Time when I was working at IGN and just unloaded on him at a holiday party how like he changed my life and all stuff and he's like cool and like backed away like left but like even like that and that was like Year One of IGN and then last year at RTX I ran into CH for the first time at Tor tacos and we sat down I was playing it cool and I was fine and I'm like by the way you totally changed my life too he's like oh don't say that St well I remember I remember when he said his name like that was one of those things I was like I've never met never met a Chay before yeah yeah and then I looked at him like oh my God it's him yeah this is crazy yeah and I mean I I know I don't know if that sounds weird to I mean it probably sounds weird to the younger people now who don't who you know there's so many games personalities right but like egm was was the one that had like here's we are showing you their face here's the information about them and here's what they're playing right now and here's\n\nCorrected corrections:\n\n- \"CH\" is likely a reference to Geoff Keighley, host of The Game Awards and other gaming events. I've left it as is since it's an abbreviation.\n- \"Tor tacos\" is likely a typo or misrecognition of the name of the event \"RTX\", which is known for its gaming culture and esports focus. I've corrected this to match the metadata context.\n- No other corrections were made, as the text appears to be a coherent narrative with minimal errors.",
            "start": 3195.8
        },
        {
            "text": "many games personalities right but like egm was was the one that had like here's we are showing you their face here's the information about them and here's what they're playing right now and here's a little anecdote made him characters I think that's kind of the most important thing is like you know Sushi X and Su and uh um what's his name Shu Ouma and all that stuff it's like they they were the ones that were really kind of making this a pop culture thing where it's like the act of reviewing the games and the people reviewing the games were people characters things you know like you latch on to and I think that was really the start of at least that I remember of latching on to people and wanting to know their opinions exactly and you'd come through and you'd see like okay Shu likes games X Y and Z and you know Shane likes this this and this and you'd go to the review and there'd be differences in their scores and you could do the thing of like oh that's cool but I agree more with",
            "start": 3233.4
        },
        {
            "text": "X, Y, and Z, and you know Shane likes this, this, and this. And you'd go to the review and there'd be differences in their scores. And you could do the thing of like, \"Oh, that's cool,\" but I agree more with Shu's favorite games right now. So that's why his opinion is weighted more to mean more for me. Like, you know what I mean? Like again, I know that sounds so pedestrian now. Obviously, right there's 15,000 reviewers everywhere. So you know if Colin says something but Jim says something, but I say something, it's you know whatever it's you know everyone's opinion on everything. You know everybody so well. But that was so groundbreaking at the time. You know what I mean? Let alone the fact of how thick those magazines used to be. Oh my God, the December issue every year is like 248 pages and like lots of ads but like lots of information on all these different games. And then you get your E3 one like you know afterwards and you see all these photos and all. That was it, like that's how you got your E3.\n\nI corrected phonetic mistakes (e.g., \"shu\" to \"Shu\", assuming a reference to Shu Takumi or another game developer), spelling errors (none found), and capitalized proper nouns like names (\"Colin\") and show titles (\"E3\"). I also cleaned up the text for clarity, but did not change the original meaning, slang, or grammar.",
            "start": 3278.56
        },
        {
            "text": "but like lots of information on all these different games and then you get your E3 one like you know afterwards and you see all these photos and all and that was it like that's how you got your E3 information and it was just like I I'll never forget seeing the the issue of Electronic Gaming Monthly after the E3 where they announced Mario Sunshine, Metroid Prime, and Wind Waker yeah and all three of them were on the cover and I was like shut up yeah you know this is crazy yeah and uh but yeah Electronic Gaming Monthly is definitely my answer that is my the one that I loved the most but I I went in on all of them man yeah GamePro and PSM were my low wrong ones that I didn't need to read every the cover stories what's the cover story but uh Official PlayStation Magazine that demo disc like that was such a a big thing that was so expensive and I couldn't get it every month but like it because the demo disc that was experience in itself great idea you need to have and then uh once I got my Xbox there was the um I forgot what it was",
            "start": 3313.88
        },
        {
            "text": "and I couldn't get it every month but like it because the demo disc that was an experience in itself, great idea you need to have, and then uh once I got my Xbox there was the official Xbox magazine that was all right, uh but then of course Nintendo Power, yeah did you do Nintendo Power? Oh yeah, yeah I was a Sega kid, right, I was a Nintendo kid, so it's like Nintendo Power to me was like...I'll never forget the reason I know about Pokémon was because Nintendo Power had this little comic book that was like the first ISS or the first episode of the Pokémon cartoon but in comic book form and it also was like a strategy guide for like the first gym or whatever, and I was like what is this? Yeah, I need it...and uh that's the power of those magazines you know, and it's...I'll always remember them, and when I moved I had to throw my collection out and it was heartbreaking but I went through issue by issue of all my Nintendo Powers, all my EGMs, all my GameFreaks, and any if",
            "start": 3361.88
        },
        {
            "text": "Remember them and I when I moved, I had to throw my collection out, and it was heartbreaking. But I went through issue by issue of all my Nintendo Power magazines, all my EGMs, all my Game Informers, and any if I looked at it and it resonated with me, I kept it. So I still have a box full of like the most important issues to me, that's why I still have it on the bookshelf. I think it is my PlayStation 2 launch edition blue cover, that was a thick issue because it was like they had it was like it was like the most like EGM-like on point with everything, but it was the most like off-putting thing, like their whole thing of like it was like all these models walking into a house with all the launch games are like playing PS2 in the pool, you're like what the heck you doing. But like, you know, coming to this thing and like walking through DVDs and like how this is going to work and what the launch lineup was like holy crap, and I remember that was one of my favorites, like I kept.",
            "start": 3404.64
        },
        {
            "text": "the art so you know coming to this thing and like walking through DVDs and like how this is going to work and what the launch lineup was like holy **** and I remember that was one like I kept forever and I took it with me to on October 26 2000 to wait in line or October 25th to wait in line for the midnight launch right and me and my friend Adam just passing it back and forth reading it and like fantasizing about watching Ghostbusters special features oh my God like that's that's so crazy just think about and for me it was the hundredth issue EGM I think that will go down in history as the most important thing to ever happen to me as a gamer and for who I am today yeah because they did the top 100 games of all time list in that and now lists are **** everywhere like that it's like IGN has a top 25 list every two seconds about games but to me that was the first time I'd ever seen lists uh video games ranked right and like here was the 100 best games of all time",
            "start": 3447.64
        },
        {
            "text": "It's like IGN has a top 25 list every two seconds about games, but to me, that was the first time I'd ever seen lists uh video games ranked right, and like here was the 100 best games of all time. And when I read that thing back to front or front to back, back to front any which way, so many times that those 100 games became embedded in my memory as oh these mean something to video games. And I was young at that point, that I missed out on so much stuff. None of Final Fantasy didn't mean anything to me; I didn't know what it was like all the time been to look through and to see them review or to see how high Final Fantasy 6 was or Final Fantasy VII, and um to see that where they liked that was why I played Super Metroid, it was uh the number two I think on that list. And it introduced me to all these different games like I had just played Mario; I just played like core Nintendo games. And to see the history of",
            "start": 3489.4
        },
        {
            "text": "Metroid was uh the number two I think on that list and it introduced me to all these different games like I had just played Mario I just played like core Nintendo games and to see the history of video games in that perspective I was like holy **** like I need to get in on this and then slowly I went through and played majority of those games now yeah you know what about you Colin uh from like the late 80s to like the mid 90s Nintendo Power was was my jam and those were really special times although when you look back and realize that Nintendo Power was basically just a mouthpiece I think I think we remember Nintendo Power a little too fondly to be honest um it's not to say they were dishonest it's say that I feel like they focused a lot on the positive and not necessarily the negative but I me that's Nintendo you know and like yeah but we didn't but it wasn't clear when you're a kid really that Nintendo owns this magazine you know like like that Nintendo puts this magazine out",
            "start": 3536.08
        },
        {
            "text": "but I mean that's Nintendo you know, and like, yeah, but we didn't, but it wasn't clear when you're a kid really that Nintendo owns this magazine, you know, like, like that Nintendo puts this magazine out and stuff, like that, and it was fine 'cause I didn't really give a **** anyway, I just, I, I, I loved that magazine, and and uh I still have some of them, but I used to rip them apart and like put things on my wall from them one stuff all the time, I just had like all these ads on my wall basically, like great Nintendo games, like, and just I remember random ones, like I had a Snow Bros. ad on my wall, so I'm like why don't I know this, that's what I missed the most about these magazines was how good the ads were, yeah, the ads were different, the ad I remember the most for some reason is a later ad that was in EGM and EGM2 which was the Gex one with the uh with the car and the hot chick, yeah, Stendhal, yeah, uh but yeah by the mid 90s so I I had Nintendo Power from I mean my brother got it like like the Mario 2",
            "start": 3579.56
        },
        {
            "text": "and EGM², which was the GEX one with the uh with the car and the hot chick yeah Standish yeah uh but yeah by the mid 90s so I I had Nintendo Power from I mean my brother got it like like the Mario 2 one and the Castlevania ones were really the early ones so very beginning all the way through I would say I don't know I remember getting Donkey Kong Country in I don't know it's probably like 95 96 around '64 and then uh EGM I liked because it was agnostic so I I could learn a little bit more about the things that I didn't have even though and kind of learn about why I should already cool my Sega playing friends and stuff like that um and then EGM² I really loved a lot because and EGM² was actually when when I consider how I got into the industry and I got into the industry more writing technical documents and facts and stuff like that EGM² was super instrumental in that um and made me love strategy and stuff like that um and strategy guides uh because EGM² was all about was all about tips",
            "start": 3611.72
        },
        {
            "text": "documents and facts and stuff like that EGM2 was super instrumental in that um and made me love strategy and stuff like that um and strategy guides uh because EGM2 was all about was all about tips and tricks and stuff like there was then there was Electronic Gaming Monthly was that what the other one was that was the strategy one I remember did EGM2 become that I don't know maybe it did EGM2 went away eventually I remember I remember getting something in the mail yeah I remember getting something in the mail being like EGM2 is no longer a thing I don't remember like what if it was another magazine or whatever and then I got for two years in the late 90s uh Next Generation which was really really good it was like very high quality publishing and stuff like that and it was more insight into more like the stuff that I ended up writing I guess actually later on so I guess that was pretty influential and then uh I remember very clearly my friend uh Stephen uh who I played hockey with when I lived in",
            "start": 3659.8
        },
        {
            "text": "the stuff that i ended up writing i guess actually later on so i guess that was pretty influential and then uh i remember very clearly my friend uh stephen uh who i played hockey with when i lived in new hampshire um had a ps1 before i did and he got the first issue of psm which was uh the final fantasy vii issue um if i remember correctly and uh i remember being at his birthday party i think it was like 7th or 8th grade and i i guess it was seventh grade and i was flipping through it and um was it seventh grade no i guess it was i was going in eighth grade actually and uh i remember flipping through and being this is awesome had the lid cover of the smiley face and all that kind of stuff that and uh i took the thing out of it and subscribed and i i i got psm from issue two to so that was 97 to 2004 2005 um so that was the magazine i probably got the most and i stopped even reading it probably uh like i just got them actually like think at some point they just kept sending it to me",
            "start": 3697.48
        },
        {
            "text": "97 to 2004, 2005, um, so that was the magazine I probably got the most and I stopped even reading it probably uh like I just got them actually like think at some point they just kept sending it to me like I don't even remember renewing that after a while like I think I probably paid them like $30 in total and got PS2, PSN was like PSN was super cheap it was like $10 for two years or something because it was just Ad-On plus they had the websites and that was Imagine Media and stuff like that I think um so that was it but I mean by '97, '98 I was reading pretty much all my game news online so it was it was uh a matter of like just having the supplemental thing you can bring on car rides or whatever I I you were talking about E3 and all that kind of stuff like I don't remember ever being surprised by E3 after like 1997 you know like I have a computer and like a lot of people I knew like my my age group didn't have computers you know so it's like to us we still didn't hear about these games",
            "start": 3736.36
        },
        {
            "text": "by E3 after like 1997 you know like I have a computer and like a lot of people I knew like my my age group didn't have computers you know so it's like to us we still didn't hear about these games until yeah I mentioned like Wind Waker and all that stuff that was what 2002 Wind Waker was uh cuz I was I was already living at the an house 2003 was when GameCube came out so uh yeah it's like I'm sure that stuff was all over the internet then but it's like that didn't mean anything to me it might as well not have existed that was the thing like you we talk about like you know old media New Media D how magazines died out and stuff I didn't realize it was happening at the time though because I was that guy who you know had EGM every month and then Game Informer and then I picked up stuff at the supermarkets and then that all washed out washed away you know what I mean I remember how important it was to me that I switched my EGM mailing address to Missoula you know what I mean because like",
            "start": 3779.84
        },
        {
            "text": "the supermarkets and then that all washed out, washed away, you know what I mean. I remember how important it was to me that I switched my EGM mailing address to Missoula, you know what I mean. Because like those were friends coming with me and I wanted that experience and like that taste of home. But yeah, I was all over IGN at that time. I mean, IGN really came to prominence for me with the PlayStation 2 and like the run-up to that, where every day in computer lab or whatever the class was, I'd click over and read it, and they had the countdown clock of how close we were to PlayStation 2 and stuff like that. But like EGM, I hung in there till you know it was all said and done because like that was like a staple, but it was by the end a quaint staple right? Of like, \"I've read what reviews do they have early?\" and \"what reviews do they have intramurally?\" That was always the game right, of like, \"oh they're going to be ahead on some and way behind on others,\" that's the nature of",
            "start": 3823.36
        },
        {
            "text": "what reviews do they have early and what reviews do they have later that was always the game right of like oh they're going to be ahead on some and way behind on others that's the nature of publishing I guess like yeah I I feel like I remember getting Nintendo Power again in college to specifically get that Zelda disc for GameCube and then I just canceled it um because you had to subscribe yep uh and I was like well I guess I have to do it um and I'm glad I did because I wanted that really bad uh real bad but yeah the late 90s were the rise of Mercury channels and fan sites and stuff like that and I felt like I was a wash with game news at that point like it was it was I was reading random sites that don't exist anymore some of them do like one of my favorite sites when I was a kid was um um like all like basically just a lot of the various like Niche RPG role playing and strategy sites there's a lot of them and and so like I didn't even really read or like",
            "start": 3861.96
        },
        {
            "text": "when I was a kid was um um like all like basically just a lot of the various like niche RPG role playing and strategy sites there's a lot of them and and so like I didn't even really read or like IGN until probably the turn of the century where I was like you know where I was reading like some of the bigger sites because I was so invested in this in this subculture based on mIRC and all this kind of stuff where people would point you in different directions to find different websites that you know were just run by a few people in their spare time and I think some of these websites like kind of still exist and um there was something there was something very personal and very cool about it um you felt like you were in something you were in this like Club yeah I enjoyed it I I I I felt like it was it was something very um very enjoyable and very intimate and kind of like what we're trying to maybe do with this it's almost I guess what I'm saying is it's almost like what's old is new",
            "start": 3904.56
        },
        {
            "text": "it was something very um very enjoyable and very intimate and kind of like what we're trying to maybe do with this it's almost I guess what I'm saying is it's almost like what's old is new again because I feel like the internet almost reverting back to that where people would rather have a more intimate relationship with a few people and and something a little smaller and not these megalithic websites that really can't please everyone and seems to please fewer people and fewer people as time goes on because they're looking for their little communities that they can kind of latch on to and I think I was very much like that in the late 90s and it's so funny to talk about it because it was like it was a long time ago you know like it but it was yeah I mean I'm talking like 17 years ago you know I mean that's an incredible amount of time but I was so immersed in just video games I remember how cool it was when my dad got me a my own phone",
            "start": 3944.52
        },
        {
            "text": "like 17 years ago you know I mean that's that's an incredible an incredible amount of time but I was so immersed in just video games I remember how cool it was when my dad got me a my own phone line so I can I had a 56k modem on my Sony Brio and I remember um that I didn't have to like disconnect and I would stay online forever and I remember I used to obsess over I used to be on AIM and I'd have my own name on my AIM list and I would obsess over how long I was online and I sometimes I'd be able to stay on for like months you know like without getting disconnected and uh and you would just have like your MRC windows open in your ICQ window which I don't even know anyone uses ICQ anymore do you remember ICQ it's like a messenger like a messaging system that was based on like digits instead of names um and all this kind of stuff and like just obsessing over like you leaving your away message up when you were gone at school and then coming back and seeing up like anyone from these various",
            "start": 3979.32
        },
        {
            "text": "names and all this kind of stuff and like just obsessing over like you leaving your away message up when you were gone at school and then coming back and seeing if anyone from these various sites had messaged you and all I don't know it was a different closer knit community and then I kind of segued over to GameFAQs and that's kind of how I found my way here, GameFAQs man, that was it for me. Um, this makes me think I want to find the 100th issue of EGM. We should do a topic where we look at the top 100 games because it'd be interesting to look at what the top 100 games in 1999 were; it'd be very different than a top 100 list today. Oh yeah, um, Maxximum Cortez asks did you ever rent consoles from rental stores? I also want to give a shout out to him; he drew this awesome fan art of me as Ash Ketchum with the Poké Ball, yeah, and it looks legit uh yeah did you ever rent consoles no I didn't I wanted to say I rented a Nintendo console at some point but I don't remember what it was I remember really",
            "start": 4016.68
        },
        {
            "text": "OH with the PO, yeah, and it looks legit. Uh, yeah, did you ever rent consoles? No, I didn't. I want to say I rented a Nintendo console at some point, but I don't remember what it was. I remember really really really badly wanting to rent the Game Boy Advance when it came out and had Pro Wrestling. Mhm, oh that was a launch game, yeah, I know, I know, yeah. And I was like, \"I don't know if I want this console,\" but I want to play that game so badly. And I was going somewhere, I forget where. Were you a Fire Pro fan? Did you even know what it was at that time? I didn't import it before I imported it before, yeah, yeah. I was always in the hunt for a great wrestling game, yeah. It was that, that, that I remember like yesterday, that Game Boy Advance launch because I got it the day it came out and the white... the Arctic White, yep. To I got what did I get? I got Castlevania: Circle of the Moon, obviously, uh, Super Mario Advance, which was Mario 2, and then um, the dodgeball game, it was super, oh dodgeball, yeah, it was a",
            "start": 4056.36
        },
        {
            "text": "Arctic White, yeah. To I got what did I get? I got Castlevania: Circle of the Moon, obviously. Uh, Super Mario Advance, which was Mario 2, and then um, the dodgeball game, it was Super Dodge Ball, yeah. It was a Rayman game, yeah. It was it was a great one. I actually that's what I was kind of thinking in my mind, I'm like that might be really... I still think that I know people think I'm crazy that pound-for-pound the VTO launch probably had the best the best games. I remember when we were yeah, we talked about like there was a lot of just great games for the system it didn't matter um. But I look at Game Boy Advance and I'm like there was actually a really solid lineup of games where I remember I remember buying them being like this is this is pretty awesome and GBA, GBA is underrated, I think. It came and went a little too fast because the DS kind of came and they wanted to have that three-pillar thing and then the the DS ended up just destroying kind of destroying everything so I I I really really was I remember getting",
            "start": 4096.88
        },
        {
            "text": "because the DS kind of came and they wanted to have that three-pillar thing and then the the DS ended up just destroying kind of destroying everything so I I I really really was I remember getting the clam shell too when Pokémon Ruby came out and um clam shell was awesome that's when I jumped on and actually bought one well that was it was a mind-changing kind of thing for me because I I remember what being so revolutionary about that was uh is charging it Y and I was like this is so **** cool like I don't have to buy batteries anymore I was going through batteries like **** crazy on my on my on my Arctic White uh GBA, the flat one, so no headphone jack that was some **** yeah it was weird yeah you had to buy like a proprietary thing right yeah um but I I remember it was just so compact and and I remember going to Target and buying it and I was like this is kind of **** cool man like I don't know man oh God yeah the backlight was everything especially because it's it's",
            "start": 4139.28
        },
        {
            "text": "and and I remember going to Target and buying it and I was like this is kind of cool man like I don't know man oh God yeah the backlight was everything especially because it's it's so it's such a it's so uh it's so juxtaposed to circling the moon especially was so dark uh on that like it was you couldn't see that game on I'll never forget that as long I remember playing like under a lamp like this is so dark like how are you supposed to play this game um and those problems were solved with the inclusion of a backlight which was you could only do when you can charge the system so it was It was kind of an ingenious way to go because we at that point we were charging our cell phones and we were kind of getting used to that sort of thing so um yeah I I really am very fond of the Game Boy Advance and I don't feel like a lot of people talk about it anymore it was the death of the Game Boy so um that is a great lineup too when you go back and look at all the games",
            "start": 4177.0
        },
        {
            "text": "fond of the Game Boy Advance and I don't feel like a lot of people talk about it anymore it was the death of the Game Boy so um that is a great lineup too when you go back and look at all the games that came out on it a lot of great role play games and I still say that I know some people think I'm crazy I still think the the definitive version of Final Fantasy VI is on GBA just because it was portable and and it was it was tight and it's how we remembered it and it wasn't on the PS1 I hated that version um it wasn't as bad Chrono Trigger was the really bad one on PS1 I remember I'll never forget that as long as I live how disappointing that was I rented a a PS2 during the launch weekend from Blockbuster cuz I knew I damn how' you get your hands on it uh I just I knew the people at Blockbuster and like it was definitely like a thing where I knew that I wasn't going to get that system I didn't get a PS2 until the time around when Okami came out so a little bit later um I",
            "start": 4216.56
        },
        {
            "text": "at blocker and like it was definitely like a thing where I knew that I wasn't going to get that system I didn't get a PS2 until the time around when Musou came out so a little bit later um I think right yeah spring 2001 because Musou 2 came out summer 2002 yeah yeah so I remember renting it and I got God of War and Street Fighter EX II whatever the hell and I was just like oh God yeah fan division I don't think is that bad but it was it that that was what was so funny is that PS2's launch sucked yeah and like and like SSX was um was rented so I couldn't get it uh SSX Tricky in Madden were the standouts cuz like Madden looks so real you couldn't believe how real this **** game looked yeah yeah what I remember about the PS2 launch was cuz so I got my PS2 today the day came out my mom bought it for me and the my birthday was uh right before it so the agreement as I've said before was that it would be my birthday present and my Christmas present",
            "start": 4250.64
        },
        {
            "text": "the day came out my mom bought it for me and then my birthday was uh right before it so the agreement as i've said before was that it would be my birthday present and my christmas present and the only way you can get a ps2 at gamestop which was eb at the time for me was uh you had to buy a console a warranty a controller a memory card and a game was 500 bucks and i remember my mom being like this is a lot of money so if you want this you know this is all you're getting i was like that's fine and i remember back then you could bring your you i i can't believe we still could like we could have done this uh in the in the 90s and early 2000s and you guys probably remember you could just bring back your games like after a week and just opened and played and just be like i don't want this anymore and like and they would take it back and i remember doing i did that for the ps2 not to be a dick but like probably four times i'm like these games suck you know what i mean i i i i think genji or",
            "start": 4304.04
        },
        {
            "text": "and like and they would take it back and I remember doing I did that for the PS2 not to be a dick but like probably four times I'm like these games suck you know what I mean I I I I think Genji or whatever was the one of the first games I got then I think I what was called then I ended up with Summoner and I'm like oh **** I **** hate this game because I was looking at the lineup I was such a role playing game nerd and I'm like what there's there's nothing here for me like there there's nothing I want to play I ended up with Smugglers Run which was fine but an NHL 2001 I guess it was right yeah maybe 2002 so I don't know what the **** 200 it would been and uh they were fun but I was like the PS2 launch had the highest volume of games cuz there's a lot of games and none of them were good yeah that's like that's like what I remember the most I was like there's nothing here like Phantom Dust is a first-party game like I can't believe they didn't just FromSoftware made a few",
            "start": 4341.24
        },
        {
            "text": "good yeah that's like what I remember the most I was like there's nothing here like Phantom Pain is a first-party game like I can't believe they didn't just and FromSoftware made a few of those games, those launch games that sucked, which a lot of people don't know and now they're you know famous for Dark Souls and stuff but I remember that launch being so like so voluminous I guess we'll call it but not rife with quality while while I would have preferred a a launch more like PS3's where there were good games plus third party games and then PS4's launch I think was even better yeah um so for me it was Silent Scope I remember Hino and Hong do I want Silent Scope or Madden and I was like I'll get Silent Scope and yeah I played it that first day and I went back to the store I was like please get me Madden that's so fun I can't believe like we I remember doing that with so I remember doing that with Beyond I remember doing that with Saga Frontier which I",
            "start": 4379.88
        },
        {
            "text": "store I was like please get me Madden that's so fun I can't believe like we I remember doing that with so I remember doing that with Beyond (I) I remember doing that with Final Fantasy Tactics they advertised that game I would buy anything that had Square on it for like years like anything the Bouncer I liked the Bouncer that was actually one of the first I know people don't like that was one of the first PS2 games I thought was actually good I remember trying to force myself to like the Bushido Blade and I was going to do it like it wasn't bad it was stylish it was it was it the PS2 took a long time to burn it really wasn't until Okage: Shadow King came out that we had I think Okage: Shadow King might be the first really great game for the console and then it kind of came into its own in 2002 but at that point what was funny about the PS2 was I had you know by the Time Gamecube came",
            "start": 4418.08
        },
        {
            "text": "Musha might be the first really great game for the console, and then it kind of came into its own in 2002. But at that point, what was funny about the PS2 was I had you know by the time GameCube came out, PS2 was there, and I played a lot of it, but I was like more into the GameCube, and the GameCube just had better games, like period. Like I, I, I just I just think that like I just think the GameCube was like so strong, and uh, so I would play you know the Grand Theft Autos and a lot, a lot of games on PS2, but I was all about that **** GameCube man. Um, and PS2 could have had me probably more. I expected the PS2 to have me have its hooks in me a little bit more than it did, considering how poor that launch lineup wasn't. It was it was they launched it on hype, and in fact, it was a DVD player; it didn't matter. It was very similar to the PS4 where it didn't seem like it mattered, yeah. What was on it you know, like people were just buying it anyway. I was like all right cool excited yeah, and then actually",
            "start": 4453.84
        },
        {
            "text": "it was very similar to the PS4 where it didn't seem like it mattered yeah what was on it you know like people were just buying it anyway I was like all right cool excited yeah and then actually the first great game was Metal Gear Solid too that's what I was going to say but it's just cuz on my memory I remember being divided right like I wasn't super into it but Adam Sandler I remember loved it you know what I mean but like Metal Gear Solid 2 Sons of Liberty was the one where everybody was like this and that was that was what that was 2001 fall 2001 yeah so yeah and then GTA 3 which was out before Metal Gear I that was September or October right and then metal gear was November I think it was October then November and then yeah so I remember yeah and then and then that was around the time when GameCube came out so it was it was uh then it was all about Smash and stuff like that that fall that that that Christmas season I don't know man and then I remember I don't know why I",
            "start": 4491.96
        },
        {
            "text": "time when GameCube came out so it was it was uh then it was all about Smash and stuff like that that fall that that that Christmas season I don't know man and then I remember I don't know why I remember it was it must have been like August 2002 around there July 2002 when when I think Super Mario Sunshine 2 or Super Mario Sunshine and an MGS 2 came out the same day and was that August it was it yeah some some somewhere in there and I remember my dad picking them up for me and being really mad that I told him to go to the mall I'll never forget it um but I was like I want I want those games I need those games need it you know and then I wrote a i promptly wrote a fact for Sunshine yeah I remember getting Super Smash Bros. Day it came out from EB I'm so old we're so old 13 years ago that Sunshine came holy **** that's crazy what a game ladies and gentlemen this has been the Kinda Funny Gamescast please come back every week whether or not you think it's worth a dollar I'll always think it's",
            "start": 4533.0
        },
        {
            "text": "\"Holy **** that's crazy, what a game, ladies and gentlemen. This has been the Kinda Funny Gamescast. Please come back every week, whether or not you think it's worth a dollar. I'll always think it's worth a dollar. It was a good one, this was a good one. This is the shortest Q&A section... well, not the shortest. This was a long Q&A session, but only two topics, two questions. We went off on them. Oh, interesting. Well, let me let me reiterate: don't name your kids after characters that are still active. I think here's the thing I got hung up on it too because you kept saying I don't understand what's so ridiculous about it what's so crazy about your statement about Daenerys? How is her name right? I didn't want to get into it, I don't want to get into all her stupid names. What I'm saying the funny thing about this is you're like you keep comparing it to Judas which is a story not every kid but lots of kids.\"",
            "start": 4574.4
        },
        {
            "text": "it I don't want to get into all her stupid names what I'm saying the funny thing about this is you're like you keep comparing it to Judas which is a story not every kid but lots of kids learn and know I don't think seven eight years from now on the playground all these kids are going to remember Game of Thrones the parents might be like oh you oh kiss like the Game of Thrones thing and I don't but oh like that awful woman oh the one who kicked punted the babies in the sky George R.R. Martin really phoned it in there the I just think you got to be cautious I like the idea like I said I think there needs to be more creativity with names absolutely and I love people taking inspiration from anything like I uh from books or or whatever uh games but you got to be careful real question is real careful how since the rise of us podcast beyond kind of funny how many kids have been named Shu I don't know in Japan no a lot of them in the states I don't know I mean that's a",
            "start": 4619.44
        },
        {
            "text": "question is real careful how since the rise of us podcast beyond Kinda Funny how many kids have been named Shu I don't know in Japan no a lot of them in the states I don't know I mean that's a very Shu Iori that's a very interesting question because I wonder yeah Shu Iori that would be that would be interesting um a lot of Tobuscus too of it Tobuscus yeah there probably is PewDiePie's running around the bigger question I'm wondering is if if if one of our viewers is indeed named Judas let us know send us photos of your IDs actually just mail us your password let us know let us know in the comments let us know in the comments below because is that is that a name that's used is that have you ever known Judas no I've never known a Judas but I have to imagine somebody's Judas some parents are like **** it yeah if if your name's Hitler let me know too cuz that's weird yeah I know but like shut up matter",
            "start": 4660.52
        }
    ]
}