{
    "id": 13217,
    "video_id": "fiPOEcfgYn0",
    "show_name": "Highlights",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Mike Howard"
    ],
    "title": "The Worst Unboxing of All-Time",
    "description": "Greg breaks the Indiana Jones Collector's Edition. Thanks @bethesda for the gift! Also, sorry @bethesda for breaking the gift. \n\nFrom this episode of KFGD: https://www.youtube.com/watch?v=GyW1-Vt4GVI&t=3389s\n\n\nFOLLOW US ON EVERYWHERE!\n---------------------------------------------------  \nYouTube: Youtube.com/KindaFunnyGames\nTwitch: https://www.twitch.tv/kindafunnygames\nPatreon: https://www.patreon.com/kindafunny/\nTwitter: https://twitter.com/KindaFunnyVids\nInstagram: https://www.instagram.com/kindafunnyvids/\nTikTok:  https://www.tiktok.com/@kindafunnygames?lang=en",
    "published_at": 1733255734,
    "duration": 71,
    "transcript_chunks": [
        {
            "text": "scared the hell out of with the biggest box I've ever seen look at that it's here Indiana Jones great circle collector edition just show up guys it's not a circle it's a rectangle it's got storage I'm really excited to see what the jumbo steel book looks like what's a jumbo steel book I'm very excited it's bigger than a normal steelbook oh it wasn't a bigger steelbook it was a thick boy Ste thick with two C's y'all so check that out thick Tim Tim take a look at that when it's thick thick that's it is really thick it is surprisingly thick I thought it would be tall but no oh don't forget about your keychain nice I like a good big box for a collector's edition especially one that can house Tim Tim is 6 feet tall and we've covered him with a box here it's a globe ladies and gentlemen got a Hing okay it's got a hinge yeah we see that holy okay I think there might have been a collapse on game and deck building step number two to access the globe's hidden storage attach the plane magnet to",
            "start": 0.68
        },
        {
            "text": "okay it's got a hinge yeah we see that holy okay I think there might have been a collapse on game and deck building step number two to access the globe's hidden storage attach the plane magnet to the correct point of interest and Trigger the opening mechanism no W see that holy",
            "start": 50.44
        }
    ]
}