{
    "id": 208,
    "video_id": "6UFAZXfU15c",
    "show_name": "Gregway",
    "hosts": [
        "Greg Miller"
    ],
    "title": "Greg Tricked a Newspaper into Buying a 360 - Gregway",
    "description": "Some mysteries can't stay unsolved...\n\nBig thanks to FCB713 for the question.\n\nSUBSCRIBE/LIKE/SHARE/BUY T-SHIRTS: http://www.districtlines.com/gameovergreggy\n\nLeave your questions for Greg as a video response and check back every Wednesday and Friday to see what he's saying.\n\nSubscribe to our channel: http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nCheck out our Merch Store: http://www.districtlines.com/gameovergreggy\n\nThe Vlog playlist: http://www.youtube.com/playlist?list=PLOlEpGVXWUVv1g9oZi6O95CwRHQd0ulT6\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy",
    "published_at": 1390572005,
    "duration": 234,
    "transcript_chunks": [
        {
            "text": "Hola , welcome to a Greg Way. Every Wednesday and Friday, I take one of your questions or comments or tweets, answer them, talk to you right now about it because we're friends whether you want to admit it or not. Uh, today's topic comes from FCB 713 and why don't I have the chance to talk about FCB, one of the most dedicated GameOverGreggy.com fans here on YouTube. He is, you know, I wake up at 6 :00 a.m. to post these videos and I'm in there for an hour with you commenting. FCB is there every time. Great dude or girl, I don't know, dude or dudette. That's what these Turtles used to say. Uh, his question or her question is what's the story behind GameOverGreggy? What, how did I, where did this come from, the the the moniker GameOverGreggy? Sadly, it's not that interesting of a story. No, I'm just kidding, it's kind of interesting. Uh, I played video games for a long time in my life, right? Every time I'd play a Legend of Zelda or anything where you had to make a save file or a character, I would name it Greggy. It's my",
            "start": 0.6
        },
        {
            "text": "interesting. Uh, I played video games for a long time in my life, right? Every time I'd play a Legend of Zelda or anything where you had to make a save file or a character, I would name it Greggy. It's my nickname, right? Greggy, that's what it was. So for years and years and years and years and years and years, that's the moniker I went by in the Video Game World, right? So then jumped to when I was working at the Columbia Daily Tribune, I convinced them to give me a video game column and a video game blog and that was all of a sudden we had to come up with a name for the column and there was a bunch of goofy ones thrown around that weren't great and for some reason game over is the one that stuck. So I, I wrote the game over column and the game over blog. It was the game over column with Greg Miller and so did that, did that, did that. It was great, great, great, great. Then I got an Xbox 360. Now I actually, I got the Xbox 360s through totally screwing over my newspaper. Sorry about that, Columbia Daily",
            "start": 45.88
        },
        {
            "text": "and so did that, did that, did that. It was great, great, great, great. Then I got an Xbox 360. Now I actually, I got the Xbox 360s through totally screwing over my newspaper. Sorry about that, Columbia Daily Tribune, right? Where it was just like, I asked them, hey, will you guys expense me a 360 so I can, you know, write about 360 games for the paper and they're like, no, we, we're a daily newspaper, we're not going to pay for a 360 . I'm like, that's fine. So I eventually started a whole campaign to have like on the blog, on the video game call on blog or whatever to have someone like maybe a sponsor, I could get a sponsor to have it and it would be like, you know, whatever the CJ's downtown Columbia Wings Xbox 360 and I would mention that whenever I talked about the 360, I would have to say like, oh, it's from blah blah blah, whatever business, Kmart, the Kmart 360 or something like that. And eventually somebody bit on this and did this and bought me a 360 and I was like great. And the next day my editor was like, what",
            "start": 82.76
        },
        {
            "text": "blah blah, whatever business, Kmart, the Kmart 360 or something like that. And eventually somebody bit on this and did this and bought me a 360 and I was like great. And the next day my editor was like, what the hell are you doing? Like, you think you, did you not take a journalism ethics class? Did you think and I was like, well, I thought journalism ethics is supposed to protect, you know, people from, uh, journalists doing things behind closed doors. I was publicly doing this entire thing for like a month and a half, so I look like quite the, but being good people, the Columbia Daily Tribune bought the 360 from the the person so that it was like their 360. So I have this 3 60, I now tricked the newspaper I love into buying for me and I go home and I turn it on and it's like, all right, now you have to make an Xbox Live account. And so I of course tried for Greggy and that was not happening because I was way late to the Xbox 3 60 thing, but what was open, GameOverGreggy. So the game taking the video game column I was",
            "start": 123.84
        },
        {
            "text": "account and so I of course tried for Greggy and that was not happening because I was way late to the Xbox 360 thing, but what was open, GameOverGreggy. So the game taking the video game column I was doing along with the moniker I used forever in video games and shoving them together and now here we are how many years later? Geez, seven, well probably then eight, almost a decade later and it's still stuck. It's everything now. Now I don't really go by Greggy all that much. I still name my characters Greggy in video games I guess, but most people probably know me as GameOverGreggy on Twitter, Facebook, Google Plus, YouTube, everything else in the world. So FCB, as always, thank you for your support. Thank you ladies and gentlemen for watching this video. Thank you Columbia Daily Tribune for buying that 360 and not firing me. I hope you still play it once in a while. Uh, this is how Gregory works. You leave a question or a comment on these videos or you tweet at me then I answer them every Wednesday and Friday.",
            "start": 164.24
        },
        {
            "text": "not firing me. I hope you still play it once in a while. Uh, this is how Gregory works. You leave a question or a comment on these videos or you tweet at me then I answer them every Wednesday and Friday. Thank you for watching. [Music] One, oh, that's it. Yeah, that's that's the ending. Do you like it? Terrible. You [Music] suck.",
            "start": 205.52
        }
    ]
}