{
    "id": 194,
    "video_id": "BaWEVSvhbfY",
    "show_name": "A Conversation With Colin",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "Abortion Should Be Legal (Some of the Time) - A Conversation with Colin",
    "description": "The abortion debate is a serious issue, and today, Colin and Greg tackle it.\n\nToday's topics were submitted by lots and lots of our viewers. Leave your suggestions for future conversations in the comments below.\n\nSUBSCRIBE/LIKE/SHARE/MERCH: http://www.districtlines.com/gameovergreggy\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nSubscribe to our channel: http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Tim for filming.",
    "published_at": 1389103204,
    "duration": 833,
    "transcript_chunks": [
        {
            "text": "I think I'm personally with my own decisions pro-life, but I can't be pro-life for a woman. I can't make those decisions. I believe in Liberty. What's up everybody? Welcome to A Conversation With Colin. I'm Greg and this is my roommate, Colin. Now sometimes Colin says crazy stuff, so every Tuesday and Thursday I reach into my random topic pile, pull one out, toss it at him, we talk it out for your amusement. If you like that, like the video, share it with your friends, subscribe to us on YouTube. Colin, are you ready? Yes. Today's topic of conversation is abortion. Now this one's been suggested a million times with a million variants on it. You know, abortion after rape, abortion or adoption, abor- there's no one credited to this. Many people have written in about this. I don't know how you want to tackle this one . It's an obtuse one. Yeah, abortion. Where do you stand on abortion? Should it be legal? We'll start there. Yes. Why should it be legal? Um, so why should it be legal? You're saying legal, right? You're",
            "start": 0.08
        },
        {
            "text": "this one it's an obtuse one. Yeah, abortion. Where do you stand on abortion? Should it be legal? We'll start there. Yes. Why should it be legal? Um, so why should it be legal? You're saying legal, right? You're not saying yes, should abortion be legal? Yeah , I'm pro-choice. Okay. Um, yeah, the way I always explain it is that there has to be a way out, right, for woman. There can't be like this, there can't be this line in the sand that says if you're pregnant, you have to have the child. There can't be a line in the sand like that. It's just not, it's not right, it's not proper. Now I understand and I really respect the pro-life argument. Yeah, I get it. I get it completely. And one of the interesting things about pro-life , the pro-life argument, the pro-life movement is that while the computer age is destroying the more culturally conservative aspects of politics, including marijuana prohibition or things like that, the only thing that's getting more popular because of the internet is pro-life and because because of",
            "start": 41.24
        },
        {
            "text": "culturally conservative aspects of politics , including marijuana prohibition or things like that, the only thing that's getting more popular because of the internet is pro-life and because because of pictures of babies, because you can easily illustrate what an abortion is and like yeah. And so that's actually true that the pro-life movement is actually getting bigger. Yeah. Um, but I think that we need to just as a society, as a free society, we have to respect both the rights of the baby and the rights of the mother. Um, and I think that what there needs to be a cut off where abortion is absolutely illegal. And I think that the fact that we argue over three or six months is like, you know, to me it's 14 weeks should be the cut off. Why 14 weeks? Um, 3, 6, 9, 10, yeah, that's right. So my girlfriend and I were talking about this, that's um, you have three months, right, to to figure out like the first trimester or whatever to figure out if you have like, are you pregnant? That might take a two, that might take two",
            "start": 83.8
        },
        {
            "text": "about this, that's um, you have three months, right, to to figure out like the first trimester or whatever to figure out if you have like, are you pregnant? That might take a two, that might take two months, right? And then like how do you feel? You know, are you all right? We can even bring it down to 10 weeks would be fine for me , you know, like you have to have that two week buffer after the two months or the three months to to say like okay, like they know and they have time to think about and stuff and then it's over because then the baby starts really developing and yeah. Where are we right now in the first trimester? Are we getting, we're getting what, eyes and stuff? This thing talking? What's happening? No, thing's not talking, but like it it the the growth of a baby in in a mother, the mother's womb is somewhat exponential. I mean like it starts show when you start showing, I think you start showing like four months, five months, right? I mean like when the baby really starts to grow, I mean I'm not I'm not",
            "start": 129.56
        },
        {
            "text": "exponential. I mean like it starts show when you start showing, I think you start showing like four months, five months, right? I mean like when the baby really starts to grow, I mean I'm not I'm not a doctor, but you're not an OBGYN. No, no, certainly not. What were you do with my girlfriend? That's another, that's another conversational. Um, so I think that you have to give a mother a way out. You like I I always think about it this way, right? And it's not about like everyone always brings up the rape victim and all this stuff and that's fine. Obviously the rape victim should have the right to have an abortion. That's that's **** given. My concern is like what about the 16-year-old girl, you know, or the 18-year-old girl that gets pregnant, hides it for a long time because she's scared of telling anyone, she can't have this baby. How is she going to support it? We don't need another baby that can't be supported in society. We already have a **** bunch of people that we like that can't support themselves. Why",
            "start": 171.48
        },
        {
            "text": "have this baby. How is she going to support it? We don't need another baby that can't be supported in society. We already have a **** bunch of people that we like that can't support themselves. Why do we want more? You know, yeah, but you don't want to, you don't want her, I mean she's committed that long for some reason she's stupid and not telling people, tell people stuff like that. But like what about adoption? Have it through and get it out and get it because that doesn't really work either. I mean the fact of the matter is like there's a a vibrant adoption, you know, uh, you know, I don't want to say an economy, but like , you know, a system in the United States, but the fact of matter is a lot of these kids go to group homes and stuff too. You don't want that. Like, but there's an important book at a certain hard point, whether it's after two and two and a half months , three months, whatever it is, no, you can't have an abortion anymore. It's over. Like that then it's legal and I think that the whole argument",
            "start": 209.4
        },
        {
            "text": "hard point, whether it's after two and two and a half months, three months, whatever it is, no, you can't have an abortion anymore. It's over. Like that then it's legal and I think that the whole argument that was happening recently in Texas where they were having like second trimester abortions and even abortions, you know, try people trying to say like having abortions in the third trimester, which is **** heinous , that's murder and I'll be like really clear about that, that's murder, you know. Yeah. Um, it's it's there has to be, it's not black and white the way people, we have to find some gray area in the middle to come to come to some sort of consensus and the consensus is we have to give you enough time to make a decision and once that time is over then and your decision is made then it's made and that's it. Yeah, you know, because we have to protect the right of the baby and I think that the right of the baby at two months is frankly not as important as the right of the baby at seven months",
            "start": 244.84
        },
        {
            "text": "and that's it. Yeah, you know, because we have to protect the right of the baby and I think that the right of the baby at two months is frankly not as important as the right of the baby at seven months because at seven months you could that baby could actually live outside Mom's, right, right, right. So I think people this is a very politically divisive issue and I understand that, but I think we talk about consistency, right, in conservatism and I think the consistency and conservatism can be brought brought into line with abortion too because conservatives are often pro-life. I'm pro, I'm a pro-choice conservative. Um, and my whole thing is this, we believe in a small government, we're tired of the welfare state and we're tired of paying taxes and we're tired of seeing uh people um that you know instead of being brought out of poverty by giving being given a job, they're given money from the government to live a substandard life when they really should pull themselves up and be given and be given",
            "start": 281.96
        },
        {
            "text": "of being brought out of poverty by giving being given a job, they're given money from the government to live a substandard life when they really should pull themselves up and be given and be given the the means to pull themselves up, right? Yeah. We don't want more of those people. We want more people that can support their families and support their their you know themselves and lower taxes and make and and bring profitability to everyone and bring the sort of American dream to everybody. If we have more kids that come from you know young mothers or out of wedlock and you know which is, I don't think that's a moral, I'm just saying you know you're you're you're paying a picture of babies being born to families that aren't ready for, right? Exactly. It needs to be okay for these families to say like we can't do this right now and and not be shamed when they go to the clinic and not you know have this whole argument about it there. That's one side of the coin, right? Like that like that's okay",
            "start": 325.64
        },
        {
            "text": "like we can't do this right now and and not be shamed when they go to the clinic and not you know have this whole argument about it there. That's one side of the coin, right? Like that like that's okay. That's actually good for the system. We have too many kids that no one can care for and that's just the reality of the situation and that's something pro-life hardcore pro-life Evangelical voters ignore. On the other side of the coin is is the people that say like the the baby's basically a parasite on the mom. The mom still exists as a person as a citizen and she has the right to kill the baby even up to you know the third trimester. I think that's murder and there needs to be that needs to be squashed out as well. You need to have made your decision by that point and I'm not saying like if the mom's in danger at the last second you can't abort the baby obviously, but if you're just having an abortion because you lazily sat around for six months and didn't know and vacillated back and forth",
            "start": 364.88
        },
        {
            "text": "mom's in danger at the last second you can't abort the baby obviously, but if you're just having an abortion because you lazily sat around for six months and didn't know and vacillated back and forth that's your **** problem, you know, the baby's going to be born and then you can worry about what's going to happen it later because the baby at that point is viable. It's not black and white. The baby's viable. I repeat the baby is viable. It's just not a black and white thing. We have to meet in the middle somewhere, right? Pro-choice and pro-life can meet in the middle by saying this thing is basically just a molecular set of cells right now two months and it's okay that the 16-year-old that got knocked up by her you know her stupid boyfriend in high school doesn't want to have the kid. That's good. We don't want her to have that kid. She can't take care of it. She can take care of herself, you know. Yeah, there's got to be the other side that says the 25-year-old you know woman that got pregnant by",
            "start": 407.28
        },
        {
            "text": "we don't want her to have that kid. She can't take care of it. She can take care of herself, you know. Yeah, there's got to be the other side that says the 25-year-old you know woman that got pregnant by her you know boyfriend or whatever her husband and then they're like I don't know I don't know I don't know for months you know and then they have the abortion it's too late sorry after three months you **** up it's over you know there needs to be that sort of consensus. We shouldn't be having barbaric arguments about having second and third trimester abortions in this country. I think it's barbaric and it's murder. We shouldn't have be having arguments saying that a person who has an abortion after two months is a murderer, you know, there's somewhere in the middle we must meet. So I appreciate and respect the pro-life argument. I know a lot of pro-life people where I'm cultur my family's Catholic, yeah, and that is a very Catholicism pro-life go together like you know Peanut B and jelly, but",
            "start": 445.0
        },
        {
            "text": "respect the pro-life argument. I know a lot of pro- life people where I'm cultur my family's Catholic, yeah, and that is a very Catholicism pro-life go together like you know Peanut Butter and jelly, but I guess what I'm saying is much like everything else there's a place in the middle that we can meet. We never will. Everybody sucks. I two sides never come together. Yeah, no, well we you know we have to because I'm an example I think of someone who's like rational about a lot of these things and understands both sides of the argument. It's all about intellectual honesty, you know, you can't be you can't be having abortions at six or seven months. You can't be having abortions at four or five months, you know. Yeah, but you can't ridicule women for making a decision that's best for them and best for the child. Sometimes we don't want to deal with the unfortunate reality that sometimes what's best for that child at 2 months in that 16-year old girl's womb is to not be born, you know. Yeah, yeah and we need to",
            "start": 483.48
        },
        {
            "text": "sometimes we don't want to deal with the unfortunate reality that sometimes what's best for that child at 2 months in that 16-year old girl's womb is to not be born, you know. Yeah, yeah and we need to have those hard arguments and those hard conversations with each other and really come to that consensus. So that's where I stand on abortion. Okay, what about you Greg ? No, I'm with you. It's there's no way place for me to jump on. I'm with you. Here's the thing I was I'm yeah I'm pro-choice or you know I think I think you know what's going on there in what that what's a little piece of dust little dust well gosh darn this freaking studio. Uh no I it's I can't ever put myself into that woman's shoes you know what I mean like that's the whole thing and like I think they should have that to go have an abortion like you know what I mean like I always talk about it with you know with you know friends or my girlfriend or whoever right of just like oh yeah and if anything went wrong you know I I we we",
            "start": 530.56
        },
        {
            "text": "abortion like you know what I mean like I always talk about it with you know with you know friends or my girlfriend or whoever right of just like oh yeah and if anything went wrong you know I I we we would you know have an abortion or whatever and then I don't know like if that there'd be so many emotions stirred up by that happening to me that I have no idea how I'd feel let alone if I was a mother who was 16 whatever you know what I mean this is a drunken one night stand anything even if it was with a long-term boyfriend but you had plans or whatever like that's totally their life and I don't pretend to be like I know what's best here I know how this **** all shake out you know what I mean what you're saying is I'm on board with it there needs to be a line somewhere but like I don't I would have I mean like has have we had a doctor come around lately and say what the line should be or where this all goes like because yeah you just have the you know this same thing I always talking",
            "start": 568.92
        },
        {
            "text": "would have I mean like has have we had a doctor come around lately and say what the line should be or where this all goes like because yeah you just have the you know this same thing I always talking to you with like politics right that you know you have the left and you have the right and there's like on the spectrums it's the people who are loudest that you hear all the time so you know what I mean like life begins a conception you keep hearing non-stop then over I haven't heard the you know the other side of where they're saying life truly begins or where this goes or how this person it's about viability versus you know life beginning conception versus the life beginning of viability yeah yeah and yeah I I think that we don't hear a lot of arguments that a lot of this has to do with a lot of you know abortion doctors are very pro-choice obviously and it's not because of their trait it's because of what they believe and also the different states have different laws um so it it",
            "start": 606.84
        },
        {
            "text": "a lot of you know abortion doctors are very pro-choice obviously and it's not because of their trait it's because of what they believe and also the different states have different laws um so it it creates like a cacophony of like just different opinions and different systems um which I think is fine that's the idea of the the whole 10th Amendment states rights kind of thing is that like you know if you don't want have if you can't have an abortion in Texas just **** go somewhere else I mean like I understand that that's not practical but like that's that's the way the system kind of works um and I I just I feel like with you know it's just a shame with abortion because there because you get pregnant doesn't automatically mean that child will should exist in this world and I don't mean that in a in a barbaric way I mean that in a can that is that child going to have a good life is that child you know going to be able to make good choices is that child going to have a good foundation",
            "start": 642.44
        },
        {
            "text": "in a in a barbaric way I mean that in a can that is that child going to have a good life is that child you know going to be able to make good choices is that child going to have a good foundation because if not that child becomes a burden on society and that child also becomes a burden almost on itself in a way because it doesn't know any better and it's not going to be taught properly maybe or it's not going to and I'm not saying that every baby born in this situation is born out of wedlock or born to a young mother I'm just saying like this is usually kind of how it goes and you know there just needs to be a way out there needs to be a way out for a woman you know that has that that that gets pregnant. I know that my girlfriend and I talk you know have talked about in the past and you know we we couldn't in good conscience have an abortion you know and like I I I think that's right we're both you know 29 years old have good jobs we make money like we're in a position there where we",
            "start": 688.84
        },
        {
            "text": "we couldn't in good conscience have an abortion you know and like I I I think that's right we're both you know 29 years old have good jobs we make money like we're in a position there where we have the child it might not be convenient but child right now yeah but that's just the way it goes you know so it's complicated issue it's a very complicated issue it's a very American issue too you know and a lot of countries have sorted this out already but we we haven't and uh I don't think we're you know I I agree through that I'm not sure we ever will but I think we we can't Rel legislate things that have already happened Roe versus Wade is the law of the land yeah and we're not going to overturn Roe versus Wade and we shouldn't want it to overturn Roe versus Wade you can't tell a woman what to do with her body but you can tell her that she has a time limit I guess is what I'm saying you know what I mean no it's interesting it's just funny spelled out like that I'm with you I agree you",
            "start": 727.32
        },
        {
            "text": "to do with her body but you can tell her that she has a time limit I guess is what I'm saying you know what I mean no it's interesting it's just funny spelled out like that I'm with you I agree you have three months to figure this out three three months yeah you know and we give you a little bit of buffer room because you might go up six weeks without even knowing you're pregnant and you need time to think about it you need time to consult your your spouse or your partner or your family and figure things out that's okay four months five months no it's over for you like you can't you can't go like we can't be barbaric like that yeah as a society so um I I understand pro life I think I'm personally with my own decisions pro-life but I can't be pro life for a woman I can't make those decision I believe in Liberty yeah no I like that well that was a good conversation thank you everybody for submitting it of course I'm sure you have some thoughts on the matter let us know in the comments and",
            "start": 767.64
        },
        {
            "text": "believe in Liberty yeah no I like that well that was a good conversation thank you everybody for submitting it of course I'm sure you have some thoughts on the matter let us know in the comments and then while you're down there make sure you tell us what you'd like to see us talk about on a future episode until then have a conversational day",
            "start": 809.32
        }
    ]
}