{
  "id": 199,
  "video_id": "j7um7UETdoU",
  "show_name": "The GameOverGreggy Show",
  "hosts": [
    "Greg Miller",
    "Tim Gettys",
    "Nick Scarpino",
    "Colin Moriarty",
    "Portillo"
  ],
  "title": "'90s Girls and Burritos - The GameOverGreggy Show Ep. 6",
  "description": "Tim wants to know who your '90s crushes were, Greg wants to know what superpower you'd want, and Colin asks if American exceptionalism is a real thing. No one remembers what Nick's topic was because we drank whiskey for two hours.\n\nSUBSCRIBE/LIKE/SHARE/BUY MERCH: http://www.districtlines.com/gameovergreggy\n\nMentioned in this episode...\n- IGN interviews the Green Ranger: http://www.youtube.com/watch?v=aY8rHA0QzG8\n- #365Thanks Gregway: http://www.youtube.com/watch?v=j3QF4clbAqc&list=PLOlEpGVXWUVv1g9oZi6O95CwRHQd0ulT6&feature=c4-overview-vl\n\nEach and every Monday, Greg, Colin, Nick, and Tim get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nSubscribe to our channel: http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy the MP3 version of the show on Band Camp: http://gameovergreggy.bandcamp.com\n\nMerchandise available for you body: http://www.districtlines.com/gameovergreggy\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\nNick - http://www.twitter.com/nick_scarpino\nTim - http://www.twitter.com/timgettys",
  "published_at": 1389621603,
  "duration": 8188,
  "transcript_chunks": [
    {
      "text": "[ Music] what's up everybody? Welcome to the GameOverGreggy Show. I'm one of your hosts, Greg Miller, alongside me as always, the pride of Long Island, Korey. Hello. Hey, how are you? I'm all right. It's good to see you. It's good to see you too. I see a little too much of you though. Your beard's not in that creepy state yet, so I like it. I'm gonna rub it on the mic. The old mic is SEF trick over here. The producer, Nick Scarpino. I like, I just once I'd like to be called, he only does everything. Nick, that's not, that's his name. You can't know and you don't. I do everything. Just once, Colin, like to sleep with your wife. It doesn't work. Can have my wife tonight if he wants. He can come home with me. This show's getting interesting. We do everything. It's quid pro quo, literally. Oh, really? Yeah, well, I mean, I can't make those kinds of decisions for other person. I mean, a man would. I'm just saying , I'm put that out there. Colin is a modern man with a modern woman. He's not going to go in there just make decisions for",
      "start": 0.78
    },
    {
      "text": "those kinds of decisions for other person. I mean, a man would. I'm just saying, I'm put that out there. Colin is a modern man with a modern woman. He's not going to go in there just make decisions for her. Should we have hung the other picture that was there last week? If you want it, you want who? Let's just keep going. Okay, no big deal. And then at the other end of the table, the pure one, Tim Gettys. I'm pure. How you doing, Tim? I'm pure. We haven't seen a lot of you. You just got back. I did. You were, you were in Austin, Texas, down there. They got thick paper towels. They, they have ridiculous paper towels and their street lights are sideways. Sideways street lights. If you're just joining us for the first time, the show is simple. Four best friends come together each and every week, each bringing a random topic to the table. We don't tell each other what our topic is, then we discuss it for an hour and a half. You love it. You get the show two ways. One, every Friday, we put it up on Bandcamp for a dollar. You",
      "start": 39.92
    },
    {
      "text": "to the table. We don't tell each other what our topic is, then we discuss it for an hour and a half . You love it. You get the show two ways. One, every Friday, we put it up on Bandcamp for a dollar. You go to gameovergreggy.bandcamp.com. You give us $1, whatever you want. There it is, a high quality MP3. You get to go listen to it while you jog, while you work in the factory putting together the tin cans, getting ready to take on the Nais factory. We have a vibrant Tin Can economy. That's where we're at. Vibrant. Uh, or you wait till Monday, we post it on YouTube, gameovergreggy.com. That's youtube.com/gameovergreggy for free and you get to watch the video version and enjoy yourself. Are we going to iTunes, Colin? Uh, yes, we are. One day we will go to iTunes. This is a, this is a question I'm been getting a lot. What we're going to do is go to iTunes as like an anthology, correct? Yes. So I think what we'll do, we'll do it on B Camp too and we'll do it everywhere we can. Amazon maybe and maybe you know Android and",
      "start": 74.04
    },
    {
      "text": "what we're going to do is go to iTunes as like an anthology, correct? Yes. So I think what we'll do, we'll do it on B Camp too and we'll do it everywhere we can. Amazon maybe and maybe you know Android and stuff. But, uh, every 10 episodes, we'll just put them together, um, into an album and then we'll put them, put them up for half price actually. So, so even if you're listening to it on YouTube now and you want to kind of wait a little bit and you don't really know if you're, you know, interested in buying an episode on Bandcamp, well, you can buy them half off when we put up 10 at a time, right? So now if you're, if you're asking yourself why don't you just put it on iTunes right away, you don't listen to Super Knocking Boots, of course. Super Knocking Boots, a relationship podcast with some other folks. It's a whole deal to try to put up one track. If you put up something longer than 10 minutes or 15 or whatever, iTunes will, or they'll automatically put it up for $10. So then and then you have to, you have to",
      "start": 115.92
    },
    {
      "text": "whole deal to try to put up one track. If you put up something longer than 10 minutes or 15 or whatever, iTunes will, or they'll automatically put it up for $10. So then and then you have to, you have to manually email them and ask them to dial a price. It's a huge, it's a huge hassle. So we don't do that. We put it on Bandcamp. If it's that big of a deal to get it there and get it into iTunes, you download it from B Camp and you drag it into iTunes. Yeah, not the, not the end of the world. We do appreciate your patronage though. Uh, we, we are getting actually quite, quite a good response on B Camp, so we do very much appreciate that. But yeah, stay tuned for iTunes and Amazon and Android and all those things. We'll be there soon. Yep, five more episodes, I think after this, right? I believe unless something has gone horribly wrong. T-shirts are shipping. That's good. Yes, they should be shipping. If you went to districtlines.com/gameovergreggy and you purchased a pre-order for your shirt, your shirt should be",
      "start": 149.0
    },
    {
      "text": "has gone horribly wrong. T-shirts are shipping. That's good. Yes, they should be shipping. If you went to districtlines.com/gameovergreggy and you purchased a pre-order for your shirt, your shirt should be shipping, should be on your way. Make sure you take a photo of it, tweet it at me. We'll Rune, what did I do? You just like, you sure should be shipping, should be sh. Did I put all that on there ? No, no, I just thought it was funny. Did I do, I did I do good or you making fun of me? You're good. Did a great job. You did, you did real good. Okay, I do real good work around here. All right, who's starting this week with topics? It doesn't matter. I'm going to start. Oh, here we go.'90s girl crushes.'90s girl crushes. Nicole, that's easy. Edgard. You guys remember Nicole Ed? She, she the Baywatch one. She came from Charles and Charge. She was the oldest child in Charles Charge. 91 cuz I no Charles and Charge. I think was'80s maybe early late'80s maybe early maybe early'90s, but I don't think so. That that was when I first",
      "start": 182.8
    },
    {
      "text": "and Charge. She was the oldest child in Charles Charge. 91 cuz I no Charles and Charge. I think was'80s maybe early late'80s maybe early maybe early'90s, but I don't think so. That that was when I first discovered her. Then she became a Baywatch girl after some enhancements that she had gotten to her upper torso area. Good. But were you, so were you, did you, was your crush, my crush was because of Charles and Charles. Great. Okay, so you're not, she was so unbeliev, well, I was young too. I was way younger. Well, that's how crush is work. I want to make sure we're all on the same page here. We're not just some kind of lust. There's something going on. What do you know, baby? We're not calling Mori already the, uh, yeah, I'm depraved, bro. You're just disgusting. I wish they could hear the conversation in the car right over here. That was the Genesis of this podcast. I wish they could do that. Uh, it's x-rated, but no, yeah, no, I mean, I used to, I just, I was in love with, I had, she was one of the only people who posters I",
      "start": 218.28
    },
    {
      "text": "over here. That was the Genesis of this podcast. I wish they could do that. Uh, it's x-rated, but no, yeah, no, I mean, I used to, I just , I was in love with, I had, she was one of the only people who posters I had in my room back in the day and it was Nicole Edgar and I remember she was like it was one of the original power couples, right? So it was Nicole Edgar and Cory Haim were like together. I don't remember that. You're old. Yeah, yeah, yeah, it was this whole thing, man. And then you know, pop magazine, all these things they had was like Cory and Nicole, they're the bomb. They kind of broke up for a while then one it was like all of a sudden everyone was doing cocaine and I don't know why but that that that was a thing and then as her career derailed after Baywatch because life after Baywatch for everyone is really, really hard, right? It's not easy. It lived hard. Um, she eventually started doing softcore stuff on like HBO with Cory Haim. What they were like together, they were starring these movies, but they were",
      "start": 259.16
    },
    {
      "text": "really really hard, right? It's not easy. It lived hard. Um, she eventually started doing softcore stuff on like HBO with Cory Haim. What they were like together, they were starring these movies , but they were a little Cory Haim was in softcore porn movies. Yeah, really? Yeah, not Feldman. Feldman happened for a while, but they were in a movie. I forget what it's called, but yeah, it was it's always one of the two, sore porn or finding God. It's a thin line, Razor's Edge between that's what I mean. That's what happens when you, those are the two recommendations when you're addicted to cocaine that they say the treatment facility, they say either they're go into porn or Nick Scarpino loves cocaine . Not doing cocaine, just talking. I've never done cocaine. True story. Never done. He has never done cocaine, but he will bring it up at least four times a day. Four times a day at least four times. It's a fact. It's a really cool word to say. Colin, say it for me. Cocaine. COC. Just saying it makes you cool. Yeah, what? Uh, not doing it.",
      "start": 295.2
    },
    {
      "text": "it up at least four times a day. Four times a day at least four times. It's a fact. It's a really cool word to say. Colin, say it for me. Cocaine. COC. Just saying it makes you cool. Yeah, what? Uh, not doing it. Doing it makes you, smoking makes you, makes you look cool. I know, yeah, smoking does make you look cool. You used to smoke. Remember when I used to be smoker? I used to be a very a hard smoker. Hardcore. Yeah, now he's hardcore drinking. H. You know who's saying that song? I can't think of it. Who sing COC? It was Cream. I don't think it was Clap. Yeah, so well, same, yeah, same thing. Uh, yeah, I just, I was actually listening to that with, uh, my girlfriend. We were, we were driving back home on Long Island and I was like, how is this song even allowed on the radio? Like, yeah, it's awesome. I'm glad that we're allowed to listen. It's a great song. The only thing I can glean or think of is that they didn't really know how devastating cocaine was at the time. I think it was just different age. You didn't have all these",
      "start": 335.0
    },
    {
      "text": "to listen. It's a great song. The only thing I can glean or think of is that they didn't really know how devastating cocaine was at the time. I think it was just different age. You didn't have all these damn restrictions and for some reason it's grandfather in like every time got grandfathered into any anytime you no, but I mean like right now right now like right remember like we always make fun of, uh, we always make fun of the the Everclear song, right? Where it's like like they blur out like normal words just like a you suck I hate you. Yeah, the Everclear song is a huge joke because of all the chicken noises and **** in it. You were talking a second ago, you and your girlfriend, you said we were driving around Long Island. Have we ever talked on any of these shows that you don't have a driver's license nor can you operate a motor vehicle? We talk about that. Wow, we could talk about that. I think it's come up before. I'm beond probably is that is that because you don't want to be in the system? No.",
      "start": 378.72
    },
    {
      "text": "nor can you operate a motor vehicle? We talk about that. Wow, we could talk about that. I think it's come up before. I'm beond probably is that is that because you don't want to be in the system? No. has nothing to do with that. That's that's a logical conclusion. That's a logical conclusion. I have an ID though because I know you when it comes to Off the Grid. I know you when it comes to your theories. I'm being off the grid like you don't like giving the government any more information about yourself or letting them have any more access to you than you deem necessary. Yeah, exactly. I was really uncomfortable when I got my ID in California that you have to give your thumb print. I didn't want to do it. I made a fuss about it at DMV. No, like you could just do it or not. I make minimum wage to take I don't know I can't talk to anybody about this. You sir are going to walk out and have a nice life and I'm stuck here. The first time I saw the thumb trint thing was going through customs in the airport and",
      "start": 415.08
    },
    {
      "text": "know I can't talk to anybody about this. You sir are going to walk out and have a nice life and I'm stuck here. The first time I saw the thumb trint thing was going through customs in the airport and you can't really tell those guys no. They're like put your thumb on the thing and I'm like I would **** around I don't want to because I don't that is the one thing that kind of freaks me a little bit is that now everywhere you go there is 100% proof that you were there like you there's no PL there's no deniability anymore if you went and did something and you're like I don't know if I should have done that or whatever someone can absolutely like no you cuz I have your fingerprint like you were there like the iPhone like when you murdered someone you're going to murder someone if you're going to take them out to the woods and like you know cut their heads off or something like that um but the iPhone for instance now think about this for a second though you put your fingerprint on there it",
      "start": 450.64
    },
    {
      "text": "to take them out to the woods and like you know cut their heads off or something like that um but the iPhone for instance now think about this for a second though you put your fingerprint on there it scans it in it won't unlock the phone and every single email anything you do on that phone it has to be you right I mean that's that's pretty that's a good thing or it could be someone cutting your finger off and yeah that's the scary thing has has any tried don't work with that yeah the first couple days they like somebody somebody cut off their finger and try no I how they figured it out but there was like a big thing on the internet I remember there you could use your dick that was a big thing on the internet no that's I said that and no that's a real thing real thing that everybody immediately jumped I justtin yeah you know where I'm starting with this yeah she she was a big fan of the the dicks on the iPhones like trying to figure out if it could happen because she got her new iPhone",
      "start": 483.96
    },
    {
      "text": "jumped I justtin yeah you know where I'm starting with this yeah she she was a big fan of the the dicks on the iPhones like trying to figure out if it could happen because she got her new iPhone when we were in Texas a long time ago how do you do that how do you unlock the thing while you're driving though well I don't think you do it for practical purposes you're doing it to see if you can fun so there's not an app that like when you open up the cuz I don't have iPhone 5 when you open it up it doesn't say like fingerprint and then like a mushroom head no no you have to put your you never you never see it put your mushroom head your unique snowflake mushroom head well you they say they say fingerprints um the the Rings from trees and mushroom heads are all those are the most unique things in the planet not a snowflake huh nope snowflake a strong fourth on that list snowflake maybe maybe top 10 for be a nice all right and there's other things too Tim's a beautiful unique snowflake so",
      "start": 519.8
    },
    {
      "text": "in the planet not a snowflake huh nope snowflake a strong fourth on that list snowflake maybe maybe top 10 for be a nice all right and there's other things too Tim's a beautiful unique snowflake so why didn't you ever learn to drive it seems I did learn a drive so uh when I was on Long Island I used to it's funny because like I think about this now like I used to drive my dad's Xterra he he taught me how to drive in that thing or whatever and I would just gun it I think I used to what is it is that an exter big it's an SUV okay but like I remember very clearly driving down this road on Long Island it's like a wooded Road or whatever and drive I used to get like I could not line up the car with like the middle divider line like it always seemed like I was two on top of it you have to get used to kind of riding right right right and like so I would ride like almost in the shoulder I remember my dad I remember I just like there's like these trees and **** like out like in the street",
      "start": 554.52
    },
    {
      "text": "used to kind of riding right right right and like so I would ride like almost in the shoulder I remember my dad I remember I just like there's like these trees and **** like out like in the street and I just dragging them along the car my dad's like what are you doing um but ultimately so um so this is the way it went like what do you do if you get pulled over what if you're driving a car right now you get I don't drive a car it doesn't drive perod drive so do you have people that drive you plac well I don't really need to like well I have actually it's funny because I've had Greg driving me places twice in like the last two weeks but uh but a from that like gck and I Liv together for like over a year where I bothered him one time I have a dentist a very specific dentist in Delhi city and I don't want to change I like him that's where I'm going and I had to pay for like new in out huh is it the does new Inn out uh no he's near s we probably should stop narrowing it down until he pays",
      "start": 593.48
    },
    {
      "text": "I don't want to change I like him that's where I'm going and I had to pay for like new inout huh is it the does new Inn out uh no he's near s we probably should stop narrowing it down until he pays us no one gets a free ride in here so here's D but here's the story so and Bourbons so as a lot of people do depending on your age I went to college when I was 17 right M and in New York you can't drive at least you could when I was growing up until you were 18 unless you had uh Junior's license which meant that you could drive to work and uh you could drive to school all my friends had so the big thing was getting your Junior's license you had to take uh driver's ed to do that and then we would just drive wherever we wanted that was like the whole thing it's like everyone had Junior's licenses no one gave a flying **** everyone just drove everywhere anyway um but my school was right down the street for me and my work was not too far away from me either I worked at at Delhi um so I would",
      "start": 635.48
    },
    {
      "text": "no one gave a flying **** everyone just drove everywhere anyway um but my school was right down the street for me and my work was not too far away from me either I worked at at Delhi um so I would just I would and I love your story so much so I would just walk to they're like Seinfeld plots every single time so I so listen so I'd walk to school it would take like 5 minutes not even and then I would just I used to be I used to a lot of little thing that people don't know about me I used to BMX like pretty hardcore in high I didn't know that and uh so you take like sweet ramps and jump yeah yeah so I had a red line which is like a really nice bike uh and uh so I used to bike to work and then when I was 17 I moved to Boston to go to college and so I missed the whole transition period to getting a license but the thing in Boston then notorious thing in Boston is that you don't want a car there you don't want anything to do with a car there because it's a **** **** show especially",
      "start": 675.6
    },
    {
      "text": "getting a license but the thing in Boston then notorious thing in Boston is that you don't want a car there you don't want anything to do with a car there because it's a **** **** show especially for six months when it's snowing every yeah you told me about that bit um like they'll like in Boston and probably in Chicago too they have big things like huge dumpster looking things that will take up like a lot of a street probably like five parking spots where the snow where the plows dump their snow in to in order to melt it because it gets so crazy there's nowhere to put snow anymore after like a few months so like it's just a bad why do people live there why would you live in that environment ra so it's just so anyway I lived there and I didn't need a car there I didn't want a car I had no money sure no reason to do anything so basically what I'm saying is I aged out of this thing where I was eager to learn how to drive and before I knew it uh I I moved to San Francisco and when I",
      "start": 716.32
    },
    {
      "text": "no money sure no reason to do anything so basically what I'm saying is I aged out of this thing where I was eager to learn how to drive and before I knew it uh I I moved to San Francisco and when I was 22 and again didn't need a car and I still don't need a car so I just never learned how to drive now this is a big point of contention with my girlfriend don't get me wrong this is a big Point there's no way Cheryl's like I she **** hat the the thing the thing that I always tell her though she's like you got to R Drive she always bought I'm going to I'm like I know how to drive like it's just it's not that hard it's just like when as you get older you kind of get a fear of it and I don't really want to do it now what do you mean as you get older you get a fear of it when you haven't done it when you have not had to do it to I I will I will come to your defense on this one because my wife who grew up in La used to drive from Camio to all the way to all over La every day of her life",
      "start": 753.68
    },
    {
      "text": "it when you have not had to do it to I I will I will come to your defense on this one because my wife who grew up in La used to drive from Camio to all the way to all over La every day of her life till she was about 16 like you know 19 or 20 when she moved out of that this dog is having a he's going P's here he's excited to be here he's shown his toy there he is it's a good toy too he's had that for a while she will not drive my wife she uh it's it started as a joke first of like oh my husband you're the man you drive me around it's fun I'll DJ whenever and she has pretty good taste of Music although sometimes she plays prints too much um if there is such a thing but now Raspberry Beret I love I like that one that's my favorite Rasberry all right if you sing it it's lovely delicious I got to stop cuz I'm so good and so in tune that we'd get flag flag for that yeah don't do that don't go that far but she will not she actually has a thing now where she she hasn't driven in so long and",
      "start": 790.08
    },
    {
      "text": "to stop cuz I'm so good and so in tune that we'd get flag flag for that yeah don't do that don't go that far but she will not she actually has a thing now where she she hasn't driven in so long and driving in San Francisco is not very easy by the way I mean there's a lot of Hills there's lot like parking is ridiculous in the city you're going to hit something just get over it um and she won't she's right there with you she's like I don't I don't think I need to do that ever again I'm like ever again cuz she's we're in our 30s so there's a good possibility we're going till 90 maybe that's that's that's it's one of those things I know people like like I my girlfriend and I get in a quarrels about this where I'm like I just don't want to drive like I don't I don't ask you to like she's like but I drive you we drive to the supermarket stuff but I'm like I don't ask you to do that like we before you moved back here when because you lived in Pennsylvania for a year to do her internship uh I",
      "start": 832.12
    },
    {
      "text": "I drive you we drive to the supermarket stuff but I'm like I don't ask you to do that like we before you moved back here when because you lived in Pennsylvania for a year to do her internship uh I was totally self-sustaining I would do everything I needed to do by myself without a car you know like it's convenient that she drives that's great yeah but then but then there's this whole thing where I'm like I don't I I I'll eventually have to get my license right I'm gonna have to do necessarily but I'm gonna have to do it eventually I say you've gone this far why not let it ride let it ride but I I set down rules with her I'm like there's certain things that I'm not going to do right I'm not driving in San Francisco ever I'm not driving anywhere around San Francisco from maybe Foster City in the South all the way to let's say Marin County in the north then wait wait these are the these are the hypothetical rules you're going you're going to lay these down no I already did I already told",
      "start": 868.32
    },
    {
      "text": "the South all the way to let's say Marin County in the north then wait wait these are the these are the hypothetical rules you're going you're going to lay these down no I already did I already told her I'm like so well you don't drive period now well no so if I get a license cuz she's like get a license and then we get split driv but I'm like you don't understand you don't get it I'm not doing that because well it just has no practical purpose here because I want to move eventually to the middle of the country I have no fear of driving in the middle of **** North Dakota I don't give a **** you know that's fine but I don't want to drive around now here's the X Factor to all this from 2008 to 2011 I owned a scooter had a that's right had you and Damon you and Damon used to like scooter Brigade in every day I had an M license yeah and you still do just drove a scooter around it actually expired like you can reup it though EAS you just go reup it so that's the most ironic thing is",
      "start": 907.84
    },
    {
      "text": "Brigade in every day I had an M license yeah and you still do just drove a scooter around it actually expired like you can reup it though EAS you just go reup it so that's the most ironic thing is that the fear of getting hurt in a car all that kind of stuff didn't stop me from driving a scooter that I could lift off the ground that I used to drive like 65 miles hour way more dangerous statistically speaking oh yeah no doubt way more D drive it on the highway right and get honked at and getting fights which is illegal by the way I don't think you're supposed to drive those in the highway so do I still have my license so I don't know that's that's just where it is okay that was a good aside my 90s Crush I'm going to give you brought it up I know I know I you should still have this the the M on your who whoa let me see this thing that's not good I had a fauxhawk yeah really weird it was kind of strange how old is this photo it's like first year I got here like 8 years old holy **** I",
      "start": 949.96
    },
    {
      "text": "M on your who whoa let me see this thing that's not good I had a fauxhawk yeah really weird it was kind of strange how old is this photo it's like first year I got here like 8 years old holy **** I mean you don't look you look good don't get me wrong I'm just saying you look so Italian in this uh it was a little tan yeah plus the uh I mean the printing doesn't help out there it gives me a little more Olive to my complexion no but my ense was provisional so that's oh so you didn't actually go take the test you do the eight you don't have to do that no remember like so in California you can take the the written test every year to reup your M license but there are just certain restrictions and then to get it permanently where you can drive like in another state or something you have to go take so I used to I didn't have to take the I had to take the test at my the safety course that I took E Mark Ry tried to get me to do that but I didn't want you should have it was way easier to",
      "start": 988.08
    },
    {
      "text": "go take so I used to I didn't have to take the I had to take the test at my the safety course that I took E Mark Ry tried to get me to do that but I didn't want you should have it was way easier to you have to like use like 250s or whatever right like I don't even know how to use well they teach you there you go and they teach you how to do that that's the whole safety course it's fun it's terrifying though I'll be honest with you guys right now so I started I started riding motorcycles I was like out of a practical need like in San Francisco it's impossible to park car I had no money back then and I I just wanted to be able to go home park my car somewhere in between cars I.E a motorcycle in between cars and get out and go up to the thing and then I thought it was cool I thing so I went and got my license and it just never like I was like it's going to be cool I'm going immediately stick to it and it was the first time in my life I tried something and I was like I'm not that into",
      "start": 1023.56
    },
    {
      "text": "and got my license and it just never like I was like it's going to be cool I'm going immediately stick to it and it was the first time in my life I tried something and I was like I'm not that into this but I kept going cuz I was like I'm going to finish this you dumped a bike right when you were driving I did dump a bike once so I rode for a while I tried Mark Ryan's a phenomenal human being by the way he's actually probably one of the best human beings I've ever known in my life um I don't know why he continues to consort with the likes of me um he still invites me you hang out we do every once I'll watch UFC fights with him every once in a while he invited me to the last Anderson Silva fight I I'm pissed I didn't go CU I don't know if you guys saw that gift that's when he he broke his leg you know who broke his leg a guy from Long Island yeah yeah the Long Island siren anyway uh so yeah no I was I was right and I was riding up to Alice's which if anyone rides motorcycles in Northern",
      "start": 1059.44
    },
    {
      "text": "you know who broke his leg a guy from Long Island yeah yeah the Long Island siren anyway uh so yeah no I was I was right and I was riding up to Alice's which if anyone rides motorcycles in Northern California you for of Alyses it's a great bar where people ride on up on Sundays and any kind of bikes or welcomes you see Harley you see you know Imports you see Ducatis you see how many scooters you see out there you don't see a lot of scooters mostly because it's hard for the scooter to actually make it up some of the hills you need a little more power to do that but you'll see a few I guess every once in a while more power I think I'm actually being nice I don't think I've ever seen a scooter there but if you've been to Alis anden a scooter tweet at me and let me know and show me a picture of that cuz it's it's cool it'be cool to see that um but yeah so we were going and and he was he had called me in the morning up he's like you know it's kind of raining are you are you comfortable",
      "start": 1091.32
    },
    {
      "text": "of that cuz it's it's cool it'be cool to see that um but yeah so we were going and and he was he had called me in the morning up he's like you know it's kind of raining are you are you comfortable riding in the rain I'm like yeah you know do whatever I you know you don't know what the consequences are you're Fearless for anything um so I went we had a great breakfast at at at Alice's and then I started going and I started sprinkling a little bit well what I didn't really understand maybe I didn't pay attention to that point on my test was you know when you're in a car you have four wheels and so there's four opportunities for your car to have friction with the road so if one of your tires loses friction you have three more tires or two more tires depending on what you're hitting that can actually compensate for that on a motorcycle ccle if one of your tires loses you're you're done you're out and so they tell you to anything painted watch out for which I kind of glossed over I was",
      "start": 1132.48
    },
    {
      "text": "actually compensate for that on a motorcycle c cle if one of your tires loses you're you're done you're out and so they tell you to anything painted watch out for which I kind of glossed over I was like okay I guess that makes sense but like what am I I'm on I'm on a road I'm not going to hit a painted line until I kind of Veer just a little bit over and the marks on the road that are painted were wet and they just newly wet and my front tire just lost traction before I knew it I was skitting across the road and thankfully like Alice is you they have they have those steep drop offs like winding up and winding down this wasn't one of them I just kind of slid over and it was only going 20 mes did youur yourself no I didn't surprisingly I was wearing all the pads you're supposed to wear armor like protective armor so I was wearing Mark Ryan's jacket uh and I had the pants that like these Kevlar like uh textile pants that I had they went Kevlar but they were like the hard you're getting",
      "start": 1166.36
    },
    {
      "text": "like protective armor so I was wearing Mark Ryan's jacket uh and I had the pants that like these Kevlar like uh textile pants that I had they weren't Kevlar but they were like the hard you're getting shot in the legs just to see if they RoboCop the **** out of him um no I I went down I was wearing these textile pants which are the opposite of leather you get leather you can get the more synthetic materials and I chose those cuz I wasn't sure if I really wanted to be a part of it and I wore a nice hole through them I wore a hole through my boot that I was wearing uh cuz I wasn't wearing proper riding boots cuz proper riding boots are made out of a harder material that can actually skid uh and I wore my boots had strings on them and I just wore right through the laces of those and I got up and I was fine and like the cool thing about riding motorcycles and I'm not sure I haven't read them all over the place but in Northern California it's a ridiculously cool community of people it's a",
      "start": 1201.04
    },
    {
      "text": "and I was fine and like the cool thing about riding motorcycles and I'm not sure I haven't read them all over the place but in Northern California it's a ridiculously cool community of people it's a bunch of people that no matter what who they are or who you are they don't know you they have a respect for you and they do this cool thing when you're writing yeah they do the point where they'll do this they'll just put their they'll put two fingers out as they're riding by you as a show of just like camaraderie respect and as I literally was getting up three guys stopped just are you okay stay down if you need to stay down I'm like you ever **** point one of us again well no you're not one of us you're not ride or die um no but they helped me up and we got up and I felt the only thing I felt bad about was it was Mark Ryan's bike he had a he had a 350 a DRZ 350 which is kind of like a dirt bike which is another reason why I mean kind of fatter tires would have helped me out a little bit",
      "start": 1235.16
    },
    {
      "text": "bad about was it was Mark Ryan's bike he had a he had a 350 a DRZ 350 which is kind of like a dirt bike which is another reason why I mean kind of fatter tires would have helped me out a little bit um but I loved that the look at that bike and uh he they came up and he came back cuz he was like well I didn't see you for 10 minutes I assumed you went down and he looked at his bike and I was just like dude I'm so sorry because it was bent like the the the frame was a little bent and the handlebars were a little bent B it back rode it home and they fixed it and I paid him for it and that's the last time I got on a bike and it's not the last time I it was like 200 bucks okay I mean older bikes motorcycle what's that mission motorcycle I don't know where he brought it to actually I think he brought it some place down that that was a stolen bike he Mark Ryan being the stand up guy that he was was like don't worry about it I'm like absolutely not that's not I'm paying you everything like",
      "start": 1272.6
    },
    {
      "text": "brought it some place down that that was a stolen bike he Mark Ryan being the stand up guy that he was was like don't worry about it I'm like absolutely not that's not I'm paying you everything like tell me take it to the best place you can find it yeah I'll pay you for whatever it is I don't care this is ridiculous and I think he was like but the bike's only worth like you know 700 I had like a gorgeous paint job on oh no it was beautiful early neon pink and neon blue it was amazing Google DRZ 350 I don't know how many times Suzuki made that but they had some beautiful colors in the early 90s so that that was that I not to say I would never get back on that that that train I actually liked it enough but I was I was like this close to buying a bike then that happened and then eventually I decided to get married and then once you get married all your disposable income is gone no it's not even that it's like you need a couch not a bike oh you can get a motorcycle cool or",
      "start": 1309.2
    },
    {
      "text": "eventually I decided to get married and then once you get married all your disposable income is gone no it's not even that it's like you need a couch not a bike oh you can get a motorcycle cool or we can get a couch and din room table of potatoes he's trying to he's doing his like WWE drops on these toys he wants just real just real quick in a side we'll wrap up the motorcycle convers you know side conversation it was just funny watching Mark Ryan because I know Mark Ryan very well I've known him for 10 years and uh like when I was an intern I used sleep on his floor and stuff like that I go way back with Mark Ryan but it was funny watching him get into motorcycles out of nowhere and I didn't see I know ever since I've ever known him I I just I saw him with the Shadow of the Colossus reflector on the back of his helmet The Wander um handle and he was just he was there man chilling it he used to drive like a beautiful Pontiac like really beautiful car for people at home that's not any",
      "start": 1350.4
    },
    {
      "text": "on the back of his helmet The Wander um handle and he was just he was there man chilling it he used to drive like a beautiful Pontiac like really beautiful car for people at home that's not any of us that's Portillo playing with last week I had he's so adorable and everyone on the internet loves him so don't even start picking everyone internet doesn't have to **** live with him that's the oh yeah so much in inconvenience on your life he just doesn't stop being annoying though he never stops he's a dog he's doing dog things look at him right now he so I don't I'm not even looking at him he's cute he's not even doing anything thing right now all right what was the what was the question what was the question at hand'90s 90s I I'm I'm going to have a tie I'm going to say Tiffany Amber Thiessen of course and then Courtney Thorne-Smith you remember this one which one was she she was the blonde who is now on According to Jim right and she was on Melrose Place I'm going to Google this to make sure Google",
      "start": 1386.36
    },
    {
      "text": "and then Courtney Thorne-Smith you remember this one which one was she she was the blonde who is now on According to Jim right and she was on Melrose Place I'm going to Google this to make sure Google it Courtney Thor it sounds familiar Courtney Thorne-Smith fuzzies anyways Tiffany Amber Thiessen where was she on in the in the 90s Melrose Place as I the wife in accord yeah now she's older I mean obviously that's how that's how it works she gets older Courtney Thorne make sure I'm talking about the right one here make sure I'm not screaming up and yep that's her there you go uh yeah so she was into Billy on Melrose's Place but yeah Tiffany Amber Thiessen of course I think everyone in the world had a crush on sure that makes sense you know what I mean Save By the Bell I missed out on just cuz I'm young you're a little young aren't you that's incredible how are you too young for Save By the Bell and not too young for Boy Meets World they're not that far away from each other I think they are well no like say by the Bell is",
      "start": 1428.72
    },
    {
      "text": "aren't you that's incredible how are you too young for Save By the Bell and not too young for Boy Meets World they're not that far away from each other I think they are well no like say by the Bell is like 88 to 93 Boy Meets World is like 93 to 2000 right so they really kind of I guess there was there was a gap there was there a Gap but but say by the Bell was Sy that's what I was going to say yeah I don't know just never never worked for you by the way underrated from say by the Bell T Tiffy the's **** sex Lisa Turtle though was hot too and I don't think that she got a whole lot of credit for being hot because she was overshadowed much like Slater was probably very attractive man to a lot of people but Zach was obviously you know was like the cream of the crop last thing we're talking about crushes here you he Crush he don't even know how to do these feelings at that time now is if that is the girl from Summer School it is staring Mark Harmon yes it I had a ridiculous crush on her back in",
      "start": 1468.88
    },
    {
      "text": "here you he Crush he don't even know how to do these feelings at that time now is if that is the girl from Summer School it is staring Mark Harmon yes it I had a ridiculous crush on her back in the day pict yeah that's Summer School never seen that photo of her that is an amazing photo it's it's yeah that's a great blue bathing suit lovely color aquamarine look for this uh yeah blue bathing suit she was so hot in that movie she was so hot she just had that like she was like that aloof hot surfer girl she was the Southern California aloof hot Surfer Girl absolutely that was her she she would just walk that's the one with Christy Alli right yeah she's the that was that was when Christy Ali was like smoking hot too yeah yeah I'm not saying but doesn't Courtney Thorne-Smith who's Mark Harmon's student in that makes a play at him right he's like he's like no he's like no yeah and guy yeah uh that movie do you remember Summer School yeah of course I love that yeah I love it's so I love the way",
      "start": 1513.68
    },
    {
      "text": "in that makes a play at him right he's like he's like no he's like no yeah and guy yeah uh that movie do you remember Summer School yeah of course I love that yeah I love it's so I love the way that begins because you can kind of feel that movie the way that the teacher is kind of remorse at the beginning of that he's so excited to get the **** out of there and they just tracking him down everyone's hiding and like jumping behind bushes and screeching out and he gets stuck like like they wouldn't Plan Summer School well ahead of time right they left in the day before it starts they're like shoot we need a teacher was he the teacher in that or I'm sorry was he the gym teacher okay and they got him to teach I forget what class I'm bringing up for for uh uh comparison sake how I I still think Courtney Thorne-Smith incredibly attractive yeah she's hot but this picture well I know she's she she was like 18 19 she had that fah fos she is in back to school or not back to school Jesus I'm",
      "start": 1552.6
    },
    {
      "text": "think Courtney Thorne-Smith incredibly attractive yeah she's hot but this picture well I know she's she she was like 18 19 she had that fah fos she is in back to school or not back to school Jesus I'm stupid that's Quest is it oh no that is that doing the triple is back to school cuz he had like that baller house on the on the in like Malibu yeah you on a teacher salary that's awesome but no she I crush on her like she was just this she was this down chick in Melrose Place right she wasn't she wasn't crazy Melrose Place well later she was of course but like Melrose Place of course a soap opera at night there go ahead were you cuz I always equated Melrose Place to Beverly Hills 90210 right they were on right after each other and I never watched Melrose Place Oh see it was like I it just rolled together I was I was batting out of my league I was way too young for Melrose Place but I was still watching it I used to watch it too cuz I my sister my older sister watched it I watched 90210",
      "start": 1592.84
    },
    {
      "text": "together I was I was batting out of my league I was way too young for Melrose Place but I was still watching it I used to watch it too cuz I my sister my older sister watched it I watched 90210 and Melrose Place I also watch Party of Five if you want to talk about like what these crushes party yeah of course Matt Fox party what do you think I I get him there was another one there was another show around that time with a girl from Lost in Space but that might have been Party of Five yes it was that party of five okay okay CLA D was in one of them my so-called life that's the other one I get confused with Party of Five that's on completely different I don't know why my life's awesome too and it was like one season it was like one of those like short go I just remember the guy from on for probably six or seven the guy from Heroes was in Party of Five right the guy with that play the cop yeah um now you derailed my thought process you were saying something about Melrose Place and how it",
      "start": 1635.92
    },
    {
      "text": "probably six or seven the guy from Heroes was in Party of Five right the guy with that play the cop yeah um now you derailed my thought process you were saying something about Melrose Place and how it was an adult adult oh if you want to talk about like crushes coming to fruition Tiffany Amber Thiessen when she went to 90210 because she had been Kelly Kapowski Forever on 90210 you're like oh I have a crush in her that's cool and then she I'm sorry and then she went to 90210 and like the teaser shots they released she was like the bad girl who smoked drugs next she like had she like her thing was like her put she was in like a braon panties putting on a dress like what the hell is this I need to watch I remember racing home from school that day wasn't her first episode cuz I I saw I've seen I I think I've seen every episode of 90 210 wasn't her first episode her smoking at Jay like in the bedroom at the window yeah I was like what in the God's name it just it didn't resonate with me it",
      "start": 1672.08
    },
    {
      "text": "I I think I've seen every episode of 90210 wasn't her first episode her smoking at Jay like in the bedroom at the window yeah I was like what in the God's name it just it didn't resonate with me it didn't make any sense cuz Kelly Kapowski was very wholesome oh yeah she was hot as the day is long but she was very she was very wholesome yeah yeah 100% yeah and again with her I didn't watch the show but now everyone's all like oh retro and stuff you see her on t-shirts yeah you have no idea the reference I mean I know she's that girl she she was outrageous I really get it see I'm I'm d my crushes here weren't even about I think hotness you know what I mean I wasn't like oh man look at how hot that girl is right it was like something about them I didn't I think I when I think about crushes that's what I think about right like the fact that it wasn't a manifestation of lust yet or anything like that it's just like you just want I get that like they're pretty yeah no it was I like their",
      "start": 1706.32
    },
    {
      "text": "that's what I think about right like the fact that it wasn't a manifestation of lust yet or anything like that it's just like you just want I get that like they're pretty yeah no it was I like their personalities yeah all the crushes too but my first different topic my first manifestation of lust yeah Jessica Alba in the movie Idle Hands when any any single person any single human being male who fancies themselves a woman who saw that **** are you trying to so a man who fancies himself so he thinks he's a woman no I'm sorry let me ref fanes women who likes women any het any heterosexual male who saw Idle Hands had the exact same thought at the exact same time who the **** is that girl exactly who is that girl Sheely some casting agent was like this like just raised his hand triumphantly when he found her because no way she she was on some show when she was younger right I don't know about the showy the first time I saw her she was in a Disney movie punks maybe that's what I'm",
      "start": 1745.96
    },
    {
      "text": "when he found her because no way she she was on some show when she was younger right I don't know about the showy the first time I saw her she was in a Disney movie punks maybe that's what I'm thinking punks I'm thinking that maybe was wasn't for some **** Lake City pun is that what you're talking p nks and Johnny Tsunami was in it too and it was awesome but she was like 14 yeah but I was like eight so it didn't matter but then when I was like 10 and then she did this Idle Hands thing Idle Hands man a fuck ick if you turn the back and look at that the back of the VHS of that one she's in her the white Bron panties right cuz like that's like I love how much bur would you like a fun Greg Miller fact yes for I think it was six years every Halloween me and my friends watched Idle Hands that is amazing like that's what we we should watch Idle Hands this Halloween we should do it now turn off the camera no but and like yeah like set I mean like everyone's amazing in Idle Hands Deon sa",
      "start": 1795.12
    },
    {
      "text": "is amazing like that's what we we should watch Idle Hands this Halloween we should do it now turn off the camera no but and like yeah like set I mean like everyone's amazing in Idle Hands Devon Sawa amazing Seth Green awesome what happened to Deon Sawa supposed be **** he was actually on on the last like four three seasons of Nikita Nikita yeah yeah he was he got jacked like he's actually like you wouldn't even recognize him anymore he's like like the next big thing for a minute wasn't he like he like teen actor like he was late he did the Final Destination and everything yeah yeah but he never like really materialized true fact Devon Sawa huge IGN fan is he really we follow each other we I've already been talking about that for a long time getting him on the show so in a future game over gregy show I imagine he'll be here and then he'll go to up at he there in the scene where her like costume got ripped off little yeah remember he's trying to pull her off the car and he Yanks it off and",
      "start": 1842.36
    },
    {
      "text": "show I imagine he'll be here and then he'll go to up at he there in the scene where her like costume got ripped off little yeah remember he's trying to pull her off the car and he Yanks it off and like my God it's a burn it's one of those you're talking about yeah like lust moments or whatever like when you're a teenage boy that was burned in your memory right of yeah was amazing I can't believe you blew off heaven to kick it with me I've seen Idle Hands a few times yeah why we just clean the whole **** kitchen or the whole **** house this ain't our mess that movie along with Crazy Taxi solidified My Love For The Offspring all right kid you've had your fun his head gets ripped off or hair whatever oh what was the movie he was in Slackers that's what it was have you seen Slackers yes I think so blew under the radar the only reason I know it is because Bren and IU when we used to work with used to be our all postproduction manager he and I good friends he was like you got to watch",
      "start": 1883.68
    },
    {
      "text": "I think so blew under the radar the only reason I know it is because Bren and IU when we used to work with used to be our all postproduction manager he and I good friends he was like you got to watch this movie he which one is it give me the synopsis he and his friends it's Jason Segel and I forget the other guy's name there three friends who cheat who cheating their way through college and they get found out by Adam Schwartzman who goes either either I'm Gonna Get You expelled or you have to hook me up with the girl that you have a crush on like he has his crush on this girl who Devon Sawa always like also likes so Devon Sawa basically which one's the girl it's not clear for is older Pete in this from Pete and P don't know it's like Jason Segel's one of his first movies that he ever did he's like super before we look it up is the redhead from that 70 show in this movie yes all right she masturbates in it like she's like yeah okay old Pete's in this too it's really obviously con",
      "start": 1927.76
    },
    {
      "text": "did he's like super before we look it up is the redhead from that 70 show in this movie yes all right she masturbates in it like she's like yeah okay old Pete's in this too it's really obviously con it takes the whole movie to realize it though they're both like filthy horrible people oh that's old meat yeah yeah the the other third in the trio yes yeah yeah yeah okay I remember that movie I like that movie oh was so good I had never seen it and I was blown away by it's now to this day one of the millions of favorite movies that I have yeah you like a lot of movies I do like a lot of movies I can't pick one so yeah Colin what do you got for me got two picks for you oh good look at this we're going in twos now uh Candace Cameron is one of them oh yeah and but not not a classic beauty that can the game no no but full house girl yeah again this wasn't this I don't think crushes are like what a h I can't believe like I mean like she's beautiful now not oh yeah she's like but she when she's",
      "start": 1965.44
    },
    {
      "text": "can the game no no but full house girl yeah again this wasn't this I don't think crushes are like what a h I can't believe like I mean like she's beautiful now not oh yeah she's like but she when she's like when I would watch the Full House and I would see her on I would think like we are contemporaries right that was the thing like I guess now I don't know how kids view other kids on TV now contemporary like you believe she's a kid it seems like she's a kid right like we always talk about this nowadays you talk about models or actors and actresses and like Ryan Gosling takes off his shirt and it's all **** abs like what the hell I don't see how this guy could ever not do anything correct you know what I mean perfect he's perf yeah Candace Cameron like not in the old full houses but like as she got older like when she started dating the football player and stuff like that she like she I used to think she was really hot when I was a kid and now she's like she's absolutely gorgeous if you",
      "start": 2005.72
    },
    {
      "text": "she got older like when she started dating the football player and stuff like that she like she I used to think she was really hot when I was a kid and now she's like she's absolutely gorgeous if you look up pictures of her she looks hot I'm got look pict um and uh the other is so we have like the kind of the more innocent crush the lust kind of thing is Tara Reed and we and we and like Tara Reed is like my girlfriend get so she gets so mad at me about tar cuz I love tar when I was like you know Big Lebowski American Pie kind of Arrow I always forget about her in the Big Lebowski always remind me she so hot she's so hot like I just like can't she's the first girl I've ever seen why is C's camera is so hot right now girl I ever realized broke herself oh yeah oh yeah she went pictures leaked after all the surgery and that was I same for me too cuz up until that point I actually bought in most of the pretty much Hook Line and sinker to the Hollywood like life where everyone just aged perfectly",
      "start": 2042.68
    },
    {
      "text": "all the surgery and that was I same for me too cuz up until that point I actually bought in most of the pretty much Hook Line and sinker to the Hollywood like life where everyone just aged perfectly forever cuz they were just in generally better human beings than I was that's what I thought and then for no reason she decided to get some sort of weird tummy tuck yeah which she didn't need because she was already sadly anorexically skinny and she just messed herself up there was that whole remember there was that whole like two or three year-long period where she would like be in bikinis and people were like why what did you do to yourself like what surgery could possibly have C like on taradise on E which I wanted to like a lot more than I did teradise so but like look at this picture like are you kidding me yeah she looks she looks like an anime character in that she looks like a Final Fantasy character in that like I don't know so that was like the first that was the first like start",
      "start": 2086.88
    },
    {
      "text": "are you kidding me yeah she looks she looks like an anime character in that she looks like a Final Fantasy character in that like I don't know so that was like the first that was the first like start like it's it's it's timely that I bring her up because my girlfriend and I been arguing about Tara Reed for like weeks she like e Tara Reed's like a **** and stuff and I'm like but like when you're in ninth grade and you're watching you don't know that and you care you you like the sexual part of your mind that's what you want you know like the wholesome girl the girl like with depth like you don't understand that's what you really want until you're older like when you're finding yourself sexually and St like that the Hot Tar re kind of chick is what you want I love tar re man she was she was she was the ideal girl she was she was in the movie with Shannon point in American Pie she was at no point no she was never the ideal girl she was I I will give you I think in American Pie one wasn't",
      "start": 2127.2
    },
    {
      "text": "she was the ideal girl she was she was in the movie with Shannon point in American Pie she was at no point no she was never the ideal girl she was I I will give you I think in American Pie one wasn't one where she was still a normal person that was what I'm talking about look at her though she's hot when she but there's more than hot is what I'm saying we know I don't get to I don't get to know tared as a person you watched taradise yes you did that's all you need to know that's all you need to know I'm just saying we don't get to know them any depth this is all aesthetic these are crushes and and and things you lust after I don't you know just saying you said the perfect person you didn't say the perfect female or perfect sex partner no yeah okay so I misspoke I mean I'm I'm just telling you where I'm coming from Colin loves to give me half facts and then bite my head off when I act on them do you think that she refers to her HOA as paradise no well yeah I guess actually I bet she has",
      "start": 2164.8
    },
    {
      "text": "you where I'm coming from Colin loves to give me half facts and then bite my head off when I act on them do you think that she refers to her HOA as paradise no well yeah I guess actually I bet she has if she doesn't because I'm pretty sure I have it on good authority she watches this show now she's going to start referring to that for T Tara if you're watching tweet me would like to go to paradise he would like to go to paradise Bay don't make it all weird you're making it weird again is that weird why do I always why do to me why am I always the guy that to you that makes it weird is it because I actually make it weird or is that because you just know me for too long I think it's you make it weird I'm pretty sure that get a verdict on this I mean do I make it weird or are you guys there so many things I want to say I'm not going to say say one thing no don't say that I'm not I'm not saying I know what you're going to say yeah I know I'm not saying by the time they based half the movie of Wolf of",
      "start": 2210.52
    },
    {
      "text": "things I want to say I'm not going to say say one thing no don't say that I'm not I'm not saying I know what you're going to say yeah I know I'm not saying by the time they based half the movie of Wolf of Wall Street off that time we were in Vegas together it's not what I was going to say okay but it's similar to it no anyway moving on crushes Tim you still oh you haven't gone yet what's up no I haven't gone oh sh I thought it was it's going to be Tanga we know it's be I'm giving the obvious answers but it's like it's obvious because my life yeah Tanga pink ranger Tanga just like you're saying she's not she's not teror read she didn't need to be you know that was the girl she was Thea's hot and I'm not even talking about early years early year high school yeah she had a good look to her she was a good looking girl another contemporary you believed you could know to panga she still hot today oh my God she's beautiful Daniel Fisher yeah falal Faval sorry my did she change her name now she's",
      "start": 2251.0
    },
    {
      "text": "was a good looking girl another contemporary you believed you could know to panga she still hot today oh my God she's beautiful Daniel Fisher yeah falal Faval sorry my did she change her name now she's all married stuff no I don't know no she's an actress she can't do that up until the point where she got married did you think you had a shot some hair yeah I still think I have a shot you're all a long game okay gool pink ranger also I'm pretty sure just got married recently and I'm I'm convinced I'm going to end up with her it's GNA happen end up with there's like three or four girls on your list like you're going to have either a lot of divorces or you're going to have to move to like Utah I mean you know just rolling them dice roll what happens all right it'll be good though but yeah I mean know TOA like we've talked about Bo's world so many times and like bad we can oh sorry I know we get we get lost just drinking at the table that is going into someone's eard drum yeah I'm going to",
      "start": 2296.76
    },
    {
      "text": "know TOA like we've talked about Bo's world so many times and like bad we can oh sorry I know we get we get lost just drinking at the table that is going into someone's eard drum yeah I'm going to get blamed for that too why is there someone drumming at the table but the Cadence was perfect oh there you go good commenter voice yeah thank you oh yeah great comment on these videos where did The commenter Voice come from by the way I have my thought on this yeah Fran was I always thought it was strong bad from uh no it no no it was dates Strong Bad really well I have too much ice can I have one ice here when it melts I can't do with my mind gra it we got an ice bucket too from as far as I'm concerned early Boy's World late Boy Meets World are they're great but they're not that great it's the high school years that are the best wait it went beyond High School yeah they were in college oh yeah oh it never gets that's when of the Lawrence boy joined the cast right and that redhe head yeah and",
      "start": 2333.6
    },
    {
      "text": "school years that are the best wait it went beyond High School yeah they were in college oh yeah oh it never gets that's when of the Lawrence boy joined the cast right and that redhe head yeah and the red what's her name she was real hot who was the kid with the long hair that was his friend that dealt drugs did he he looked like a drug dealer yes he did look like a drug dealer yeah he came from an abusive home so do you do know like that there's that Sigma right of like any show that is a high school show only has four years and then eventually it goes downhill it but this thing it didn't go downhill it's just not as good it also started in middle school yeah there's three distinct eras middle school high school college the the middle school was just weird all the characters were just I'll tell you is it on Netflix and in college they were weird too damn it can can I find I have the Ser did you did you get I know you had them all before did you ever get the I did not buy the new box",
      "start": 2375.56
    },
    {
      "text": "tell you is it on Netflix and in college they were weird too damn it can can I find I have the Ser did you did you get I know you had them all before did you ever get the I did not buy the new box set okay I have them in individual DVDs give me the DVDs I'll start watching these I'll try to get through them all and that way we can one one day have an entire podcast dedicated to see know here's the thing me and Colin talked about this for a long time before this show started before the YouTube stuff started that what we wanted to do was watch all the Boy Meets World and then after every episode do a podcast about that episode we let's do this this we already have too many projects to do that is a that is this one we just live the discussion season by season okay there's seven seasons what we should do is a second screen experience for every episode so we we'll do it while we're watching the episode that's for girl me world commentary yeah girl me world when me World come out this is a",
      "start": 2415.4
    },
    {
      "text": "we should do is a second screen experience for every episode so we we'll do it while we're watching the episode that's for girl me world commentary yeah girl me world when me World come out this is a thing right you guys said it was coming out soon and that's not true I did Google it they were filming it already well I know but you guys said it Wasing thought it was in post you said it was coming out in January it's not coming out that's what I long time ago post post yes but generally TV shows go into post as they're filming so you film an episode and then that episode's in post as you're filming the next episode unlike movies that shoot for 8 to 14 to whatever weeks and they stop and they go sometimes they post during the filming too so it is a term Chiron's a term too no I know that I know about that what's your favorite term when it comes to film oh K sometime in 2014 according to a great one you know why also it's just a good it's a good name for any you know female Google Google",
      "start": 2455.84
    },
    {
      "text": "about that what's your favorite term when it comes to film oh K sometime in 2014 according to a great one you know why also it's just a good it's a good name for any you know female Google Google also Iris is a Great's some video nerd out there that named his daughter Chiron you damn well know you guys are clearly video game people I've asked you this question before I know neither one of you are particularly hipop met you today sir and I know you're a video game person have we ever met before this production no excellent I've seen a couple of the video game console system controllers on your entertainment centers uh if you had a kid I know I know you're not big on kids but if you were going to name something else would you name it after a video game character no and what character would that be you wouldn't name a kid Joel no why Joel's not even like my favorite character in video games what's your favorite character in video games probably patapon uh that's a horrible name Piller",
      "start": 2491.04
    },
    {
      "text": "that be you wouldn't name a kid Joel no why Joel's not even like my favorite character in video games what's your favorite character in video games probably patapon uh that's a horrible name Piller I'm a big I'm a big I'm a big Zeke fan Zeke yeah okay Ezekiel Zeke from Infamous the infamous the infamous one and two Zeke is a badass name Mega Man Mor your kid cuz your kid would be tall I used to you should be you should name a kid zek that be cool yeah what's your character that you used to do called Zeke he sold watermelons on the road in Tucson Arizona where does he sell watermelons he sold them in the **** videos we did me and my friends that me and my friends broke out where are these videos and why are they're not on this channel right now all they are all at my father's at you get them here I will personally pay out of my own wallet to get them converted to put on YouTube I have 24 hours of backyard wrestling featuring gruesome Greggy and his cast I saw a",
      "start": 2539.04
    },
    {
      "text": "father's at you get them here I will personally pay out of my own wallet to get them converted to put on YouTube. I have 24 hours of backyard wrestling featuring Gru esome Greggy and his cast. I saw a little bit of that when we did the P.O. episode on noon. I remember that we could convert those to the office pretty easily. You know that, right? Well, not easily. Somebody has to sit in there and play them and make them go and do all this stuff. Yeah, that's what Alex is for. Okay, great. Good job, Alex. You've been volunteered. Uh, I'm going home in a couple weeks. If it's easily accessible, I will find you a Zeke tape and Bri will bring you in the **** we used to do, which if you think this is bad or Up at Noon is bad, oh doctor. Yeah, you guys were pretty intense about that. Yeah, if I remember not , I don't mean all the backyard wrestling stuff's all here. Those those travel with me. I'm talking about the Z the Zeke stuff. Racist against no, what it wasn't racist at all. There was no race to it. It was well, I guess",
      "start": 2586.92
    },
    {
      "text": "all the backyard wrestling stuff's all here. Those those travel with me. I'm talking about the Z the Zeke stuff. Racist against no, what it wasn't racist at all. There was no race to it. It was well, I guess we'd be if there if we were ISM against anybody, it would be against it was like it was my best southern accent and then my dad's old cowboy hat, this windbreaker, and then I act like I had no hand and I had a watermelon. I tried to sell people legitimately. You weren't this is legitimately what we would do. We would say let's put on a Saturday Live and then just be stupid. Not even I can't tell like you would have been one of those people growing up that if we didn't meet under the right circumstances, we would have hated each other. I think really? I think so. Maybe see, I always think about I always think that what if I had been cuz I'm a loudmouth and you're a loudmouth and I would have been like no, there can't be two loudmouths in the room. I think what would have happened? I would have been a",
      "start": 2621.96
    },
    {
      "text": "think that what if I had been cuz I'm a loudmouth and you're a loudmouth and I would have been like no, there can't be two loudmouths in the room. I think what would have happened? I would have been a millionaire and never gone to college cuz if I if I could have been on YouTube, if you sold that watermelon, that would have been it. I mean, imagine like the if we water we were making this content for no one. We were making hours. Yeah, we like there'be all these dumb videos. Is there anyone Tim, you know this, I'm sure there's thousands of channels today. Are there anyone that does backyard wrestling on YouTube? Are there big channels that do that? There's got to be, right? One Jericho. Oh, Jericho does backy Jericho Jer jerck jerck. Yeah, that we met at VidCon who did bad he's a backyard wrestler. Yeah, she's not an amateur or like a you know, he's an amateur independent pro wrestler. I that's a different there's a big difference here. There is is there any I remember being amazed that we did we you know, we",
      "start": 2664.36
    },
    {
      "text": "not an amateur or like a you know, he's an amateur independent pro wrestler. I that's a different there's a big difference here. There is is there any I remember being amazed that we did we you know, we were called BWF, right? And then there was a BWF decom that was another group of kids who did wrestling. I want to say out on the east coast and they like filmed their stuff and then put it up on not YouTube, but like in videos on their site and we're all like how do they do this? What kind of black magic are they using to get these videos from a C the QuickTime player? If you would have started putting those videos up, that would have been huge, huge. If you could have done that back in like what 2005 back in the bum fights days. Oh, bum fights. That's art. It is Art. Who the hell would do that? Colin would do that. Colin would pay two bums to fight each other. Py no, I wouldn't do that. It's inhumane. Are we done with all the crushes? I think we're all in the crushes. I do need to give a shout out to the",
      "start": 2704.2
    },
    {
      "text": "do that. Colin would pay two bums to fight each other. Py no, I wouldn't do that . It's inhumane. Are we done with all the crushes? I think we're all in the crushes. I do need to give a shout out to the Pink Ranger. Like she did not have her time to shine deserves time to shine. Why I didn't remember her. She's perfect. Everything about her. She was not perfect. Amy Jo Johnson. I had a crush on Amy Jo Johnson. I do too. The the only problem I had with her was that she was in the Mighty Morphin Power Rangers that which was like that's fair one of the most ridiculous shows ever brought to America and produced for America shows ever. That's not true. But one day one oh, there he go. See, that's the first time I've ever actually heard you break and say it's actually not that good of a show. Why do you like that show? Power Rangers. Power Rangers is terrible, but it's so funny. Why you like that show so much? So good. What is so good about it as the ridiculousness like just describe this to me because I know there's I",
      "start": 2746.76
    },
    {
      "text": "Power Rangers. Power Rangers is terrible, but it's so funny. Why you like that show so much? So good. What is so good about it as the ridiculousness like just describe this to me because I know there's I don't know the term for it. I'm not as smart as Colin and Greg here. I don't have the Lexicon that these guys do. I don't say things like contemporary and yeah, you know, parking lot. I don't know. I I was trying to think of something you said earlier park. That's what he came up with the snow bank. What call the snowb what were those things that the the trucks dump their snow into dump snow dump. So I don't say things like contemporary or snow dumpsters, but what is the term for when something that you find you see and it's completely ridiculous to you and there's no way you're going to like that. What is the term for the moment where it crosses over and you go oh my God, wait a minute, I actually like this. I'm actually enjoying this like Fast and Furious for instance was ridiculous for all of us up",
      "start": 2788.56
    },
    {
      "text": "is the term for the moment where it crosses over and you go oh my God, wait a minute, I actually like this. I'm actually enjoying this like Fast and Furious for instance was ridiculous for all of us up until that point when it became so ridiculous it was awesome. What what is the what is the word that I know that's a really good like with Power Rangers thing it's like there is that that moment that happened there's a point for everyone right where anyone who watched Power Rangers that loves Power Rangers the first episode you watched you like this is ridiculously stupid and then no see you're talking as an old guy like no no no no I wasn't an old guy though I was only like 14 when when Power Rangers I was too old for Power Rangers and still loved Power Rangers joined the fan club and like this is like when like the ship was like being overtaken by fans it was it was liveaction superheroes that's it it was a live action cartoon the movie came out on my sixth birthday it was the best",
      "start": 2828.8
    },
    {
      "text": "this is like when like the ship was like being overtaken by fans it was it was liveaction superheroes that's it it was a live action cartoon the movie came out on my sixth birthday it was the best birthday young I've ever had and it was C when Kimberly come they get their new Zords how negative just start there that's amazing and then K comes in she just like oh I love the stereo how um how old how negative old yeah like going back years how many years how many years earlier would you have needed to be born for the Teenage Green inters movie were you born during that movie 1989 one was that 89 no it was not TMNT the original movie was with ail O'Neil that's live action movie yeah I'm I think so I think it was we're checking keep it was 90 not that it's the biggest thing in the world but could be 90 but I think it's 1989 yeah I saw in the anyway the point is the Power Ranger movie was amazing when it start saw I couldn't get I",
      "start": 2867.32
    },
    {
      "text": "was 90 not that it's the biggest thing in the world but could be 90 but I think it's 1989 yeah I saw in the anyway the point is the Power Ranger movie was amazing when it start saw I couldn't get I couldn't get past the second episode of the TV show I watched a lot of the TV show not because I wanted to just because it was on it was on that was it that was all was on it's so good anyway though Amy Jo Johnson also star of the first Disney Channel original movie Suzie Q what was that one about it was about um her and her boyfriend who were going to prom and drunk drivers hit them and they died they they crashed and went off a bridge and she came back as a ghost had to like finish some unfinished business it's kind of Casper is sure but with the pink ranger movie starts off her getting ready to go to prom putting on a dress with just camera shots panties and happiness and it was the best thing ever yeah like it was my pink ranger speaking Kimberly speaking of Casper by the way Darkhorse",
      "start": 2911.64
    },
    {
      "text": "to go to prom putting on a dress with just camera shots panties and happiness and it was the best thing ever yeah like it was my pink ranger speaking Kimberly speaking of Casper by the way Darkhorse candidate for Crush Christina Ricci oh yeah oh yeah Casper she was cute in well she was too young well no that's that's about right if you were your Tim's age I young I remember having a I remember having a crush on her she's too old for me I remember having a crush on her in Family she was so cute she was and I remember coming to the realization that she was a hot woman in Buffalo 66 oh that was a good movie though she was like all sexual grown into herself was hot she was hot uh I think God who was in that it was an indie film it wasn't very good I don't being Christopher Walken no I can see the guy's I can't it's not Paul Rod it's a guy like Paul Rod um then she was in Black Snake Moan and you were like okay that's Samuel Jackson that was that was just a phenomenal film if you've ever",
      "start": 2953.64
    },
    {
      "text": "the guy's I can't it's not Paul Rod it's a guy like Paul Rod um then she was in Black Snake Moan and you were like okay that's Samuel Jackson that was that was just a phenomenal film if you've ever seen that one she's basically chained to a bed the entire time I got to give a shout out to Sarah Michelle Geller just because to me Buffy Buffy she she was a woman see Sarah Michelle G to me was always the the girl that was like she was just very accessible to me she wasn't like out she was your contemporary she was my no she always seemed a little bit older she was she yeah she want the breast milk that sound bad sound wor sound worst needed to be I didn't mean it like that but she was but dude she had a great great run of it in the 90s still still on TV right she's still doing a show I forget what it is she just came out with something yeah she do for love Hewitt which also good for oh yeah Can't Hardly Wait Can't Hardly Wait by the way oh my God can't hardly wait good movie bring it back",
      "start": 2997.44
    },
    {
      "text": "what it is she just came out with something yeah she do for love Hewitt which also good for oh yeah Can't Hardly Wait Can't Hardly Wait by the way oh my God can't hardly wait good movie bring it back though Jennifer Love Hewitt Boy's World Halloween episode best episode of Boy Meets World oh you've just re jogged a memory too of another Crush Alex Mack oh yeah right right right she eventually lenic sounds right she in she went from Alex Mack canceled or whatever then she was a Boy Meets World Sean girlfriend for a bit and then off the radar Forever Until one random Mad Men episode she popped up his no no no you're missing the there's a Missing Link in there lay it on me it's uh uh is it 10 Things I Hate About You right no yes where she was like smoking hot with Heath yeah Heath Ledger and JLG that JGL yeah that's one I can the girl with the curly hair like she was the right she was the Julia Styles Julia Styles right yeah like yeah I loved her in that movie I thought she was like so cute in that",
      "start": 3046.96
    },
    {
      "text": "yeah that's one I can the girl with the curly hair like she was the right she was the Julia Styles Julia Styles right yeah like yeah I loved her in that movie I thought she was like so cute in that movie she was cute never had a thing for Melissa Joan Hart though oh interesting never why not like Clarissa Explains It All teenage wish yeah I don't agree with that she was beautiful she's cuz to me it was always her and Alex Mack they both on Nickelodeon I I'm with you on that one when you come down to my Nickelodeon Allegiance sure yeah yeah good for her good for her it's good topic Tim this is a good one good one was it was it really I'm going to say yeah we got talk about the Pink Ranger I'm talk what about 90s man crushes 0 man crushes the White Ranger oh my god Tommy yeah oh my God I such a crush's good dude I love him yeah we've met him now that was weird but yeah I had a total M crush on Tommy for sure sure he's he's the coolest person when you're a little kid was Tommy the Green",
      "start": 3092.48
    },
    {
      "text": "a crush's good dude I love him yeah we've met him now that was weird but yeah I had a total M crush on Tommy for sure sure he's he's the coolest person when you're a little kid was Tommy the Green Ranger yeah you met the green awesome yeah if you weren't checking your phone you would no I was trying to figure out what my topic was cuz I'm I'm slowly but Sur forgetting I I I think I probably Sean too from Boy Me World you're always like can we go back can we go back for a second for Tommy no we've moved to man crush no no this is happening we do this show Tim you were there you were there Colin you were not there we do this great amazing live stream uh live at S Theo Comic-Con the producer of it did a great job uh is in the description yeah uh you can watch us talk to Tommy or watch really really really amazing we had all these cool like amazing celebrities on that are doing great work and who does the crew nerd out most about when he comes through the Green Ranger yeah 100% everyone",
      "start": 3140.72
    },
    {
      "text": "really really amazing we had all these cool like amazing celebrities on that are doing great work and who does the crew nerd out most about when he comes through the Green Ranger yeah 100% everyone went and got a photo with the green everyone not only did they go and get that they sent anyone who was free to the show floor to get Green Ranger paraphernalia so he would they would have something for him to sign they didn't want oh Ransy was like I got someone has to go was it you Ransy that was Ransy went for me oh yeah cuz you were like you I respected it still it was you were hot I was a little sad you said underneath your breath you were like **** well no cuz there was a limited edition Comic-Con Green Ranger tour and they whoever it was lied to him and said oh yeah this is it it was some weird Japanese knockoff Ransy he still signed it I have it it makes me very happy he was a cool guy though very cool I want him to come on up and and come on the Game Over on that show I tweeted",
      "start": 3179.36
    },
    {
      "text": "some weird Japanese knockoff Ransy he still signed it I have it it makes me very happy he was a cool guy though very cool I want him to come on up and and come on the Game Over on that show I tweeted at Greg and asked him to ask the Green Ranger how was it kissing Kimberly and I did and he did and it was awesome we got answers I don't remember that b yeah yeah amazing I'll you know what I'll click on the link I'll watch it myself there go links in the description below there you go but finish this episode first speaking of finishing this episode Greg way Nick what's your topic I so this is my thing I always like doing this this is fun for me this will be a this will be a fast topic I like to rank things you know that right yeah you're a ranker I'm a huge ranker so to start off we're going to start off a little slow we don't have to go hardcore into it we're going to just rank the following okay from best your favorite to the thing you would eat if you had to eat it 1 00% burritos Pizza",
      "start": 3222.24
    },
    {
      "text": "to start off a little slow we don't have to go hardcore into it we're going to just rank the following okay from best your favorite to the thing you would eat if you had to eat it 100% burritos Pizza Chinese food tofu or cottage cheese those are again burritos Pizza Chinese food tofu or cottage cheese pizza Chinese food uh one more time what were they burritos burritos yeah then it would be Kades tofu you go K before tofu I love KES really yeah there's a lot of there's a split Camp really of people yes bottom can't do that here's the thing that I I will horrify I would think most in this room and I think I don't know where it comes from in my family genealogy but my mom passed this down to me and I'm sure she she had it passed down by one of her ancestors awesome meal for Greg Miller and Greg Miller's mom you take take pasta you butter the pasta and then you just put huge scoops of cottage cheese on it you mix it all together eat it have mercy it looks like the food those aliens and",
      "start": 3262.52
    },
    {
      "text": "Greg Miller's mom you take take pasta you butter the pasta and then you just put huge scoops of cottage cheese on it you mix it all together eat it have mercy it looks like the food those aliens and Men In Black get killed in remember you can you can kill us but you'll never have the Galaxy oh that's horri so it's so good that sounds **** horing there'll be days when you just wake up you're like God I got to eat that you want to hear want to hear a funny story Greg told me about pasta he was telling me once that he went to a restaurant and he I he didn't like sauce on his pasta my when I was a kid I didn't like sauce on my pasta my mom would wash it my mom wouldn't put sauce in my ravioli so he went to a restaurant with his aunt right mhm and he ordered just a dish of pasta and the pasta came out with sauce on and he started crying and my aunt was like what is wrong and I'm like this isn't ravioli so she had to like scrape it off with her fork and my M my aunt and",
      "start": 3322.12
    },
    {
      "text": "pasta and the pasta came out with sauce on and he started crying and my aunt was like what is wrong and I'm like this isn't ravioli so she had to like scrape it off with her fork and my M my aunt and my uncle are like you know they have no kids this amazing life in Chicago and like you can just see like how I am now when I hear anything about a kid I'm just like this is totally their moment of like never I thank God we made the right decision my aunt my aunt Val and Uncle Vince God bless and they're awesome they tried to get me to eat a yam which is a sweet potato well they are different well they are different but they wanted to get me get me what so they back in the day I didn't I didn't like anything like that I lik but you know regular potatoes this yam thing I don't understand why it was sweet so they made me sit out at the dinner table for like an hour and a half until I tried some of the like I can't I couldn't choke this thing down if you paid me and I had to eat almost did",
      "start": 3363.36
    },
    {
      "text": "it was sweet so they made me sit out at the dinner table for like an hour and a half until I tried some of the like I can't I couldn't choke this thing down if you paid me and I had to eat almost did like I no I hated it I almost threw up it caused yams are awesome back when I was was like I was like five though I didn't understand I to me a potato was supposed to taste Savory and this was sweet so I didn't get it now I love yams of course I like yams like sweet potatoes like sweet potato pie best the old yam bag the old yam bag the old snow dumpster yam bag um I think Greg's got the order right with the exception I I actually really like tofu I think tofu is fine I would put tofu cottage cheese I'd **** rather real quick for my case here what I'm saying is I like all those Foods tof food is not last because I don't like it it's just that I would rather have cottage cheese but we have to be very specific Long Island pizza number one yeah which Define it to people who haven't gone to",
      "start": 3405.72
    },
    {
      "text": "is not last because I don't like it it's just that I would rather have cottage cheese but we have to be very specific Long Island pizza number one yeah which Define it to people who haven't gone to New York or Long Island what do you what is Long Island Pizza how is that different than Manhattan Pizza is that is that a difference no it's similar it is a little it is a little different uh you know thin crust doughy uh doughy crust yeah a little bit like but but thin be like really nice sauce with a little bit of you know maybe put a little sugar in the sauce when they make it make a little sweet put a little you know mozzarella you can see some pictures of it on my Twitter oh you see a lot yeah yeah I just want to make sure I I think this is my problem sometimes when you when you haven't gone to New York and someone starts talking the virtues of New York and you have no idea what it is it's hard to be like I don't understand why that pizza is better yeah you understand when you go",
      "start": 3451.24
    },
    {
      "text": "gone to New York and someone starts talking the virtues of New York and you have no idea what it is it's hard to be like I don't understand why that pizza is better yeah you understand when you go there and eat uh San Chinese would be specifically what I would want New York style San Chinese food which means so San's a little cooked a little bit with uh a lot of red peppers and that so it's yeah it's got a little B more of a kick and you they eat more you eat more like Hunan style in California which is very sweet no you just explain this to me for those of you who don't know I didn't know what is the difference between Hunan and sesan well so Hunan like tends to use more sweet ingredients a good example is sesame chicken if you order sesame chicken here it tends to come with things like pears in it which is **** weird really yeah I've never had if you order there's a great place actually a Broadway I don't I don't remember the name of it Cheryl really likes it's like really really",
      "start": 3489.36
    },
    {
      "text": "pears in it which is **** weird really yeah I've never had if you order there's a great place actually a Broadway I don't I don't remember the name of it Cheryl really likes it's like really really popular Chinese place I can't think of the name of it they put pears in their in their Chinese food or in their sesame chicken but if you order sesame chicken out out uh in uh in New York you get it with like Water Crest and like red peppers and stuff like that here's my here's what I want to propose I think you've had bad luck ordering from certain Chinese food places because I still order Chinese food a lot here and I go from one or two places and I've never I I get the the sesame chicken you're describing where I'm not yeah where I'm not getting it's there's there a pair came in there shit's going south I'm going to go get I we had we had a great idea uh me and a few groups groups of friends so it was like me and like four other couples with my wife we wanted to have dinner parties",
      "start": 3524.04
    },
    {
      "text": "going south I'm going to go get I we had we had a great idea uh me and a few groups groups of friends so it was like me and like four other couples with my wife we wanted to have dinner parties where you would come over and eat what we thought was our favorite Chinese food and then the next week we'go to your house and eat your favorite Chinese food and then at the end we you know you vote and there be some sort of prize that was involved um we only got As far as to have people over to our house and we got so drunk we totally forgot about the idea but now and then the keys went in the bowl and the inhibitions went flying yes key party see I'm saying you you at that party yeah I know me and Pell toss his collar in theall don't don't talk about pello in that manner ever my presence please Tim yeah your order I remember them okay so go do you need all five five might be a little too hard next week I'm going to do four I think there's a couple I just I cannot do my entire life cottage",
      "start": 3563.56
    },
    {
      "text": "Tim yeah your order I remember them okay so go do you need all five five might be a little too hard next week I'm going to do four I think there's a couple I just I cannot do my entire life cottage cheese the cottage cheese is one of them yam y sweet potato stuff I just it messes with me cannot do it that's weird the M the the dumb purple food the the Thanksgiving stuff oh cranberry oh cranberry cranberries are red I'm not a fan of Thanksgiving food like there's some of stuffing down with it ham love oh don't say it to my wife my wife has this thing at Thanksgiving is her favorite day of the year where she goes she has to do a piece of turkey okay stuffing and then the cranberry over is it on top of it everything's on top on top of each other and then it's individual bite has to have the perfect portion of each one of those things in it that is her Jam I like what you're I like what your maybe I don't think she even uses the I don't think recall her using the gravy even it's just she",
      "start": 3603.6
    },
    {
      "text": "perfect portion of each one of those things in it that is her Jam I like what you're I like what your maybe I don't think she even uses the I don't think recall her using the gravy even it's just she gets the wet sauce not the dry stuff the wet sauce that goes on top maybe actually no I'm sorry it is turkey gravy then the stuffing than the cranberry I like everything but not the **** that comes in the can she likes like actual like oh cranberry that actually has I got a couple can of cranberry out there I love cranberry sauce out of a can I can take I can take the fresh stuff I know it's just ay I also used to when I was a kid cuz I was insanely fat after church I'd go to Coco which is a big chain in Southern California and because I was so hungry cuz my parents would make me wait till after church to eat I used to eat the jellies that were on the table you know you peel them back and you just eat the strawberry jam and the waiter would come and I I would actually have the audacity",
      "start": 3656.12
    },
    {
      "text": "after church to eat I used to eat the jellies that were on the table you know you peel them back and you just eat the strawberry jam and the waiter would come and I I would actually have the audacity as like a seven-year-old kid to be like can I get some more of the strawberry Jabs because I've eaten them all with a spoon and he would just they would every time without fail they would look at me just disgust no see I'm okay with that e the EA the jellies so you can't do tofu you can't do cottage cheese you can't do tofu's fine T I don't like tofu but that's not on my list of the main question I want to know is do you put pizza before burritos so that that is the hardest part of this I do I do you you put pizza before burritos I've had bad burritos I've never had bad Pizza really I've had I've had bad pizza but even bad Pizza is all right yeah B burritos will mess with you like yeah I've had unable Pizza to me the burrito is the perfect food the burrito is the perfect food somewhere",
      "start": 3695.04
    },
    {
      "text": "I've had bad pizza but even bad Pizza is all right yeah B burritos will mess with you like yeah I've had unable Pizza to me the burrito is the perfect food the burrito is the perfect food somewhere around here but Pizza can be yeah Pizza generally is more fulfilling but on like if I had to just have one I'd probably pick burritos because there's so many different things you could do with a burrito there's so many things you can do with pizza man thank you like people always ask me what's your favorite pizza when you know come visit what do you want from P what's the best pizza to get P cheese and I I change it up all the time varieties did you get that was that pese P cheese oh no it was Extreme Pizza that used to the buffalo chicken pizza oh my God no but ex Pizza sucks I hate extreme Pizza I'm so yes Extreme Pizza does a buffalo chicken the buffalo chicken I tweeted about all the time is yeah for a while P cheese would make me the special buffalo chicken pizza and they wouldn't put",
      "start": 3733.2
    },
    {
      "text": "I'm so yes Extreme Pizza does a buffalo chicken the buffalo chicken I tweeted about all the time is yeah for a while P cheese would make me the special buffalo chicken pizza and they wouldn't put on the menu cuz they're stupid and don't like money that would sell like hot cakes they don't care about money why trush me about Extreme Pizza I wanted to put a pin in that now to come back to that yes Extreme Pizza is quite bad it's **** garbage when ordered in bulk IGN would order 400 pizzas and no **** they're all terrible when I would order a oneoff buffalo chicken pie from them not terrible not great don't get me wrong not right home but for pizza if somebody's eating Pizza Hut then I think you're okay with Extreme Pizza in the long R Pizza Hut is much better than Extreme Pizza in my experience like I like in the 10 or 12 times I ever had Extreme Pizza while we were at work that **** sucked every time single time it Su you're ordering way too much you're putting the the stupid",
      "start": 3772.8
    },
    {
      "text": "experience like I like in the 10 or 12 times I ever had Extreme Pizza while we were at work that **** sucked every time single time it Su you're ordering way too much you're putting the the stupid chain restaurant they're like I don't know I mean by the time they don't know what's happening by the time that last one rolls off of the oven like how much time has passed between that and the time the first one has rolled off the oven right you're talking like an hour maybe that thing been s there and Pizza Extreme Pizza is one of those things like if you don't eat that immediately it's like Taco Bell right if you don't get Taco Bell in your system immediately something weird happens to itals all that cheese just I know exactly what you're saying the pizza but also what's so extreme about it they took they they put like uh AR chokes on it man it's extreme it's extraordinary no yeah they do like we never we always was just like yeah pepperoni or cheese and a sausage and then you know yeah",
      "start": 3810.76
    },
    {
      "text": "they took they they put like uh AR chokes on it man it's extreme it's extraordinary no yeah they do like we never we always was just like yeah pepperoni or cheese and a sausage and then you know yeah they put like lingua or something they have something else on it to it's honestly one of those things where little pepperonis made pepperon I think the concept behind extreme which is weird cuz I I open late but it's one of those places that's only good when it's open late you know like there's a like New York like New York pizza or Escape from New York in San Francisco that pizza is legit yeah they like that that's good I mean there's a place New York there's a place in San Francisco called Pizza orgasm would you oh my god Pizza orgasmic is really good too it's really good and it's especially good when you just stumble out of the bar right next to it and you smell it you talk smell it and you're like a I need and people will I have seen women like being propped up by their boyfriends",
      "start": 3851.12
    },
    {
      "text": "good when you just stumble out of the bar right next to it and you smell it you talk smell it and you're like a I need and people will I have seen women like being propped up by their boyfriends because their boyfriend wanted a piece of that pizza so bad they're passed out in their arms and they're dragging them through the line like baby do you want a piece of cheese do you want cheese I'll get you piece of cheese and the woman's like throwing up all over herself but they still wait in the line for it it's amazing you want to talk about great drunk pizza in San Francisco Irving Street Pizza oh how was that I've never been to Irving Street Irving Street Pizza is the most disgusting Pizza When You're Sober when you drunk it's so good so I I I pulled a I one of my favorite moves I was with I was with I was with Greg and Ryan Clements we got drunk at Yancy Inner Sunset there was a lady outside selling we leave we're drunk we're all bombed we leave Yancy and go to the street and there's a",
      "start": 3882.72
    },
    {
      "text": "I was with I was with Greg and Ryan Clements we got drunk at Yancy Inner Sunset there was a lady outside selling we leave we're drunk we're all bombed we leave Yancy and go to the street and there's a woman out there who's cooking sausages on that little thing like one of totally illegal totally disgusting yeah totally awesome yeah Colin walks up Colin goes up and buys the bacon wrapped hot dog yeah and I I I dip it I get it all in Mayon with mayonnaise and ketchup on and onions and I'm eating it down the street and then we so like nine blocks later I'm done with it we get to Irving Street Pizza at which point I order like a bunch of mozzarella sticks but uh so I eat twice in that that time span but needless to say I get home and the next morning I wake up and there's just a huge like thing of mayonnaise on my glasses from the sausage so when he ate the sausage at block two he got mayonnaise on his face didn't notice walked all the way there ordered food with food on his face it was",
      "start": 3920.4
    },
    {
      "text": "of mayonnaise on my glasses from the sausage so when he ate the sausage at block two he got mayonnaise on his face didn't notice walked all the way there ordered food with food on his face it was like a huge dollop of mayonnaise I don't know how there there's been Craig Baron used to live in our neighborhood and there was a few glorious time we would usually we would always text each other when one of us was drunk I'm going to Urban Street Pizza like there was a few glorious times where it worked out like I was coming home and he was coming home and we would meet there and get like boneless wings and all this horrible stuff I understand how Craig Baron stays fit cuz he works out like a mad man oh God man he's so fit it's annoying it is annoying it is annoying it's annoying how good-looking he is it's annoying how well he dresses I don't like any of that like God he's not that smart so we have something over him he does everything better than me uh so there's there's a place by my house",
      "start": 3962.6
    },
    {
      "text": "he is it's annoying how well he dresses. I don't like any of that . Like, God, he's not that smart, so we have something over him. He does everything better than me. Uh, so there's there's a place by my house that if you guys are ever drunk with me, if you ever come venture all the way out to, if we ever invited that'd be nice. All the I know you're having all these coupl the guy who at Starbucks at 9:00 in the morning, I'm like, oh, just good Starbucks. Oh, Greg Miller and Ty Root are here, **** blasted out of their mind. You hammered at 9:00 in the morning. It was a Missouri game. It was Missouri Texas. There was a reason, guys. I live two blocks from here and you guys are like, great, see you later. Why didn't you come? Sure, we had like yoga or something. Well, okay, again, not something I was invited to. Now Ty sometimes doesn't invite me places. I it's t he doesn't like not being the most handsome man there. It's well, he's way better looking than I am, but there's a place if we all go drink that was delicate. You're",
      "start": 3999.12
    },
    {
      "text": "doesn't invite me places. I it's t he doesn't like not being the most handsome man there. It's well, he's way better looking than I am, but there's a place if we all go drink that was delicate. You're delicate, man. That real quick. So I just was in Austin with my girlfriend. Sure. Whoa. Yeah, that's a thing. What what did you catch that? What's the thing? Did you girlfriend your girlfriend? What the hell, guys? What the hell? I feel red right now. This F this is fun. That's awesome. There we go. Okay, congratulations. Is that the first time you ref totally not my first name. I'm texting her. I don't have her number, but Greg text her, give me her number and send me any pictures she sent to you. Yeah, okay. Well, my point is we met up we met up with Ty in in Austin. Why is he always always in Austin? It's crazy. And um I have never seen her like she did the thing the the I'm a girl around Ty thing. Yeah. Oh God, it and Ty just eats that **** up. He loves it. It was so funny like the entire she flirted with him so hard. I",
      "start": 4038.8
    },
    {
      "text": "never seen her like she did the thing the the I'm a girl around Ty thing. Yeah. Oh God, it and Ty just eats that **** up. He loves it. It was so funny like the entire she flirted with him so hard. I didn't even care cuz I'm like it's **** Ty this makes sense. He's a **** good-look dude. Yeah, he's he has this crazy like magic power around girls. Every single woman I've ever known I've ever I've ever come in contact with who I just met. I can't believe that just happened. What an awesome way to drop that in by the way. Didn't my girlfriend what what is weird about that? You've never said that before that you have never said that. How long have you been girlfriend and boyfriend? I don't know. It just happened. Did you have a disc did you have to talk about it have to talk about I just texted her about it. Is she going to respond back like whoa no we're not making that step think are fine. Don't take it too far. Do you love her? Have you said you no I don't let me ask you think about it you think",
      "start": 4085.84
    },
    {
      "text": "about it is she going to respond back like whoa no we're not making that step think are fine. Don't take it too far. Do you love her? Have you said you no I don't let me ask you think about it you think about it no I'm thinking about like have you said the L word to her outside of godamn it Nick I won't go there I won't go there um can we please title this episode Tim as girlfriend the GameOverGreggy Show all caps exclamation No but but every every single every single I've ever come in contact with while Ty was there inevitably asked me who who is that guy who is he and it's usually within the first 5 minutes of seeing him they pull me aside and they go hey who is that guy yeah and I go that's Ty and they go what does Ty do and I usually I it got to the point where you know when I was younger we were we were all single it got to the point where it didn't hurt but it was so annoying to me that they like they would it was it was literally like looking at me to get information so they can go",
      "start": 4134.24
    },
    {
      "text": "we were we were all single it got to the point where it didn't hurt but it was so annoying to me that they like they would it was it was literally like looking at me to get information so they can go talk to Ty that I would just make **** up about him I would good sorry Ty but I mean cool stuff like was a pilot or whatever uhhuh or like he played CER fi for the Yankees I was going to say didn't you once tell somebody that he was like a millionaire or that you made no I told someone myself that I made $200,000 a month and Ty being the standup man that he is she came over to him and said does your friend actually make $200,000 a month and without missing a beat Ty goes yeah we **** hate him we hate him because of that and she was just like that is awesome this guy's amazing and then you married her no no sadly I think Ty man ended up making out with her that night but it doesn't matter it's funny because at Comic-Con a couple years ago a few years ago when in New York Comic Con when",
      "start": 4180.96
    },
    {
      "text": "married her no no sadly I think Ty man ended up making out with her that night but it doesn't matter it's funny because at Comic-Con a couple years ago a few years ago when in New York Comic Con when I was there with Ty we had like a meet and greet and my my aunt you know my my family all like 10 minutes away so my aunt came and she and she was like and she was like that who is that guy that guy's hot about Tai my **** Aunt no it was we were hanging out we were just hanging out and then um Ty like saw that I was in Austin like oh dude like hey let's hang out whatever **** and then um I was like yeah **** by way Austin is a phenomenal place to hang out with Austin is aw so good because Austin might be one of the only places where Ty is not the best looking person in the joint no **** like Austin has good looking people everywhere we went he was the best looking all right continue your statement s anyway like I was just oh hey like my friend's here you want to he let me see a",
      "start": 4217.88
    },
    {
      "text": "like Austin has good looking people everywhere we went he was the best looking all right continue your statement s anyway like I was just oh hey like my friend's here you want to he let me see a picture of him like yeah let's hang out with that guy like immediately yeah immediately it's like a switch flips you just flip a switch for a couple hours she brings it up a couple hours later hey so we're hanging out with uh with your friend well you know you know so you yeah we're hanging out with my friend when T oh she Cara brought that up yeah I don't want to say this you might not want them in the room together for too long just I know I was in the room with them time like Tai with girlfriends and Tai's never done anything bad at all well yeah no Ty but he ignored me in an airport once did he yeah there's a Greg way about it thanks for watching oh okay well I I you know I check my phone when I film those things right I have no idea what you're talking about I'm looking at watches online",
      "start": 4261.28
    },
    {
      "text": "yeah there's a Greg way about it thanks for watching oh okay well I I you know I check my phone when I film those things right I have no idea what you're talking about I'm looking at watches online um no Ty uh Tai's like with women with girlfriends is like you know like when in like The Princess Bride where he had to take the poison and it didn't kill him cuz he like over years he had to give himself little doses of it so he could like build up an immunity to it that's what you have to do with your girlfriend and tie limited amount of time with him 5 seconds then pull her ass away let her detox a little bit from it then bring her back in she's going to have five more minutes with them then slowly after about 2 or 3 years they're good to go they can stay in the same room with him without wanting to see what he's wearing underneath all that Madness just I don't know just words yeah they Callum Spanish Fly Tai tie we used to actually refer to him as a cartoon airline pilot that's good",
      "start": 4305.16
    },
    {
      "text": "wanting to see what he's wearing underneath all that Madness just I don't know just words yeah they Callum Spanish Fly Tai tie we used to actually refer to him as a cartoon airline pilot that's good that's that's that's much better that's much better did you rank your Foods uh yeah I'll rank mine real quick uh I go burrito burrito to me is the perfect food pizza you used to you used to be when you were fat and cool and smoked you'd go home and eat a burrito every night and watch Point Break yeah I actually found a place in the marina that served burritos late there a late night burrito place and that was amazing that's something special they make they'make them for you fresh too then they started losing profit so then they started pre- makak them they wouldn't deliver but you can go there's a place in my in my area that delivers it's amazing um there's a place in my in my neighborhood called La Canasta and that place doesn't stay open late but they would deliver and every day I'd",
      "start": 4343.88
    },
    {
      "text": "there's a place in my in my area that delivers it's amazing um there's a place in my in my neighborhood called La Canasta and that place doesn't stay open late but they would deliver and every day I'd order the same thing every time i'get a bre order the same thing finally the guy on the end of the phone was like Hey look really nice old older Spanish and I'm and he like look can I'm just going to make you something different and I just want you to try it if you don't I'm going to put it in with the other thing that you get just because and it's not even more expensive I just want you to try something else other than like a carne asada burrito and I'll be damned if that wasn't one of the best things I've ever had and I went right back to the carne burrito cuz I'm not going to be you find a good thing you stick with it I go burrito PE is a girlfriend no it's not damn it I was H she's like you tell my girl can we call her right now on the show I'll prep a mic for her and talk to her",
      "start": 4382.28
    },
    {
      "text": "a good thing you stick with it I go burrito PE is a girlfriend no it's not damn it I was H she's like you tell my girl can we call her right now on the show I'll prep a mic for her and talk to her real quick about this is this a thing we can do can we put can we put that yeah I mean sure Greg's doing it now all right um Pizza is amazing she never returned the text I go burrito pizza because Pizza is my other guilt food uh Chinese food because it's more sustenance then I go cottage cheese and tofu just CU I love cottage cheese cotage cheese I like to put salt on cottage cheese though salt cotage cheese Sal I like I like Savory cottage cheese I don't like sweet cottage cheese I'm a weird guy like that cottage cheese can go straight to hell it's disgusting it's curdled cheese it's like rotting cheese yeah it's just horrifying you don't like it you talk to her no you talk to her what am I were you going to talk a little Nick she doesn't really know me though she knows you so why the",
      "start": 4419.44
    },
    {
      "text": "rotting cheese yeah it's just horrifying you don't like it you talk to her no you talk to her what am I were you going to talk a little Nick she doesn't really know me though she knows you so why the **** did you just have me call her she knows you more everyone's backing she definitely knows you Nick I'll talk to her oh Lord put it to the mic does she know we're on the podcast right now she knows she knows well the other girlfriend and boyfriend sleeping though at 10:30 she's not going to she's smart she's not going to answer hours are mess up yeah she's she's she's smart leave a message be funny well not I can't be funny at the tone please record your message when you have finished recording you may hang up or press one for more options hey Cara it's Nick Scarpino from the GameOverGreggy Show um you might know me from that time Tim introduced us at a party I was just like a **** Obi-Wan Kenobi uh Tim just dropped a knowledge bomb on us right now that you guys are actually official",
      "start": 4459.56
    },
    {
      "text": "show um you might know me from that time Tim introduced us at a party I was just like a **** Obi-Wan Kenobi uh Tim just dropped a knowledge bomb on us right now that you guys are actually official you guys have put a title on it which we just wanted to talk to you we're actually doing the podcast that strongly we're actually we're actually doing the podcast right now so I'm in a room there's a camera on you can watch the episode it posts Fridays on Bandcamp uh Mondays for a dollar um anyway you don't have to.com gameovergreggy.com Mondays uh on Mondays for free conversation every day we do a lot of stuff so you don't have to call us back it'be lovely if you did but if you do you're going to be on the podcast and we want to talk to you a little bit about this as our first official special guest I guess there it is so anyway um if you're asleep or you're smartly avoiding this call have a lovely evening bye that was good see you thought you screwed up you did good yeah I'm good at leaving",
      "start": 4504.96
    },
    {
      "text": "I guess there it is so anyway um if you're asleep or you're smartly avoiding this call have a lovely evening bye that was good see you thought you screwed up you did good yeah I'm good at leaving messages for women yeah see I don't like the way you see the word official Tim's got a girlfriend everybody official that changes things I'm not backing out of it but it's just makes things sound scarier it's scary your heart misses like skips a beat right when you you have to put that title on it you put a title on it's not official doesn't how is Alfredo taking the news oh he's not taking it well not all Alfredo has no leg to stand on when it comes to anything that has to do with relationships I love Alfredo to death but if there's one man that actually women swim to more than Ty Root it is Alfredo Diaz Ty I don't know what it is about Alfredo I think it's because he represents like every ethnic background in the world he does have that goofy like no he's got a really ex like he's like 19",
      "start": 4545.4
    },
    {
      "text": "Diaz Ty I don't know what it is about Alfredo I think it's because he represents like every ethnic background in the world he does have that goofy like no he's got a really ex like he's like 19 things so he can look like anything so he's Every Girl's like fantasy of the the guy the Exotic guy cuz at first I saw him and I was like oh I think he's Mexican right he's not well he is Diaz but Filipino black part Chinese part like all these things he has all the good stuff none of the bad stuff he's like Blake none of none of the bad he has all he has all our greatest strengths and none of our weaknesses it's like Stephen dwarf hates him uh what the **** what were we talking about Alfredo oh yeah so Alfredo is one of those guys that that I mean literally I've seen him walk into Starbucks and have girls that are like I'm and again this makes me feel great about myself I'm like I'll have a ven IED coffee unsweeten you know no extra ice or anything no milk and they go um cool and then they I",
      "start": 4590.16
    },
    {
      "text": "girls that are like I'm and again this makes me feel great about myself I'm like I'll have a ven IED coffee unsweeten you know no extra ice or anything no milk and they go um cool and then they I can just see that they're biting the time that I'm ordering to get to Alfredo who is next to my line and I've seen them ask for his phone number straight up off the bat like talk they talked to him for like three minutes and then they just asked for his phone number Alfredo and Starbucks is just a conundrum he does well there he does very well there I can't go to a Starbucks here like every time I'm out with Alexus we'll go somewhere and I'm like oh man that's Alfredo's ex-girlfriend and she's like really this is a different girl and I'm like yeah every everywhere we go in San Francisco it's either Alfredo's ex-girlfriend or Alfredo's ex-girlfriend's best friend who hates him so side note Alexa says I was leaving today you know we had to take the sexual harassment stuff at the office oh what",
      "start": 4634.72
    },
    {
      "text": "Alfredo's ex-girlfriend or Alfredo's ex-girlfriend's best friend who hates him so side note Alexa says I was leaving today you know we had to take the sexual harassment stuff at the office oh what a segue there yeah have you done thisway you work on this channel Jesus man pimp the brand **** started she's starting to do this new thing where she cat calls me have you seen her do this to me yet no it's it's unnerving it is unnerving for the first time I'm like I don't know that I like that she'll go like this no she today when I was when when I walked by she blew she did that kiss thing to me and I kissed back she like no I'm trying to creep you out I was like oh sorry it got me a couple times I I was actually creeped out I was like I didn't think I could be but she she got me it it hit that like thing where I'm like like I wanted to just cover up any part of me that might have been exposed and just run away yeah so there's that there you go but Alexa is cool person cool peeps cool",
      "start": 4672.28
    },
    {
      "text": "that like thing where I'm like like I wanted to just cover up any part of me that might have been exposed and just run away yeah so there's that there you go but Alexa is cool person cool peeps cool peeps good Peeps who's left it's me and Colin Colin I'm going to want you to close out the show well how long are we going though I mean an hour and a half we're going an hour and a half we're pretty deep in I was say anymore Al I want to give a shout out to Senora's Pizza before we move on you're the already like born and raised SF and yours is it really I need to try this pizza the good well yeah if you want to keep going right that's why I was just saying we even need another topic today but well I mean we I don't know let's talk it out we've never talked this out before so we're 12 I believe I believe you I don't care if we go longer I got nothing else I got show is long yeah we can keep going you going I I okay we should talk this out is the podcast format that we go an hour and a",
      "start": 4714.0
    },
    {
      "text": "I believe you I don't care if we go longer I got nothing else I got show is long yeah we can keep going you going I I okay we should talk this out is the podcast format that we go an hour and a half or is that we go every topic we go the four topics what do we do when we introduce a fifth guest yeah we should just keep going I guess all right go go we can make them faster if you want no it's okay whatever you want mine is a tried and true one this is you you've wrestled with this with your friends before but today we need to pick and talk about what the and the pr no I did not at any point back WR if you could have a superpower what would it be yeah what you no now why are you saying no I'm just I'm not prepared to answer this I'll go first I don't have a great answer the that's I've been able to come up with and see I I come down to practical purposes would love I would cuz you're not going to go out there assault you're not fighting crime let's see and that's exactly that's what it",
      "start": 4754.2
    },
    {
      "text": "able to come up with and see I I come down to practical purposes would love I would cuz you're not going to go out there assault you're not fighting crime let's see and that's exactly that's what it comes down to right there's a lot of concerns I have with all of these things the best I ever came up with is that I would want Wolverine's healing Factory because you only get one is what we're talking about right so I take Wolverine's healing factor and then go be a wrestler with it and do crazy stunts like you want it for like personal gain well that's what we're just talking about like I don't think honestly with one super power I'm not sure if you can really do that much if you're super Speedy what do you do you I guess you can still get into fire get into a fire and get somebody out no but You'still asfixiate like you take one deep quick breath and you just fall that's always the misn number with flash how that happen the second you take a breath of smoke it's going to like but no",
      "start": 4793.92
    },
    {
      "text": "but You'still asfixiate like you take one deep quick breath and you just fall that's always the mis n number with flash how that happen the second you take a breath of smoke it's going to like but no you're moving so quickly though you take a breath and you're running off go you come out I see okay that might that Mak sense I'd like flight if I if I didn't get if I see the problem with the Wolverine Factor right having the healing Factor my concern would be that if anyone ever got wind of it and caught me I'd be **** I'd be over you know what I mean because you live for pretty much ever right like Wolverine's not I think lives for ever but yeah he Liv he has an expanded life life by quite a bit and I don't want to I do not want to get into a situation where I'm in jail for life or something or they find out that I have this power and captivity then yeah you're a c that's the always the problem with the superhero conundrum is the second they find you they're going to if I could have",
      "start": 4831.56
    },
    {
      "text": "or they find out that I have this power and captivity then yeah you're a c that's the always the problem with the superhero conundrum is the second they find you they're going to if I could have it be guaranteed not anything I wouldn't ever you know go into like I wouldn't be a Outlaw just by having it I wouldn't be a science experiment I would want to fly fly would be cool no would be the best no more immun no more public transit getting get up there get a fresh breath of air every time'be awesome so my wife's not mine but my wife who loves to travel but hates long plane flights was like teleportation that's the one I'd want most she goes I don't care about like personal gain of course you could rob a bank I guess if you wanted to but she's like to me it would be worth it just to have this so I didn't have to pay for long airline flights and sit for like 15 hours and coach now granted if we were wealthy she would change it to something else because she loves first class so she's",
      "start": 4867.12
    },
    {
      "text": "this so I didn't have to pay for long airline flights and sit for like 15 hours and coach now granted if we were wealthy she would change it to something else because she loves first class so she's like she like I'd sit in first class for 16 hours cuz it's first class and it's awesome and it's a great feeling teleportation for her is great I think I would pick super strength okay and I think for the similar reasons why you would think was because I would probably become a fighter then and just beat the **** out of every or a football player and just like cuz I always assume that super strength goes along with like being impervious where you're not really like if you know you're so tough someone's going to hit you it's not going to hurt right so you could probably be like an All-Star linebacker or like running back you could just kill it might not line back you probably running back and just do whatever you want no one can tackle you it's awesome and you do the same thing they did in",
      "start": 4905.56
    },
    {
      "text": "or like running back you could just kill it might not line back you probably running back and just do whatever you want no one can tackle you it's awesome and you do the same thing they did in like what was that which which was it Smallville where he played yep Smallville foot Bill and they're like dude you they did an episode before that and then they went back on for some reason but yeah we yeah there was a guy who had meteor Powers who was like basically he was a he was a running back I do believe and he could when he touched you he could stun you and so he would you he would give off a little stuns when he was doing when he'd be running and he won the Heisman or whatever and had a great career my only problem with flight is that unless you're strong you're not saving anything what are you gonna do like you can't really be again I I I I think I mean what if you have super strength what are you saving you're you're I'm not saving I'm personal I'm saying if you're going to be a",
      "start": 4944.0
    },
    {
      "text": "are you gonna do like you can't really be again I I I I think I mean what if you have super strength what are you saving you're you're I'm not saving I'm personal I'm saying if you're going to be a superhero you want you're like I'm going to be the superhero that flies what are you really going to do with that other go from point A to point B and still be the guy that can't really punch someone without breaking his hand but I mean you could still carry people you I mean could you I I can't can car I carry Tim for like 2 feet and I drop well again though like you're thinking that if you're a superhero that means there's a bunch of super villains that you need to punch like what am I do superer super strength is the only thing that could really probably benefit me because then if someone's getting mugged I can walk up to them and punch their head through the back of their like like their skull through the back of their head and they're they're dead or whatever or I'm picking them up and",
      "start": 4978.2
    },
    {
      "text": "mugged I can walk up to them and punch their head through the back of their like like their skull through the back of their head and they're they're dead or whatever or I'm picking them up and throwing them or whatever but like fly I just fly in and they got a bullet and I'm dead you know fast might be the best thing actually let's be perfectly honest cuz then you can then you can be like the best but here you can Excel Sports if here's the here's the D well you could also save lives like what you're were saying yeah you could save lives but here's the downside to being fast right if you want to do that if you were fast you I don't I don't know how happy you'd ever be again you could never ride in a car with your friends Invincible touches on this how one time when Mark's still trying to keep a secret identity from his friend they drive to college and he's just like I can't I can't believe how slow this car is how long this trip is he's like it's two hours dude **** off but like",
      "start": 5011.36
    },
    {
      "text": "to keep a secret identity from his friend they drive to college and he's just like I can't I can't believe how slow this car is how long this trip is he's like it's two hours dude **** off but like that would be the thing if you could move if you could make a second last an hour for you to get everything done in your day and then dick around video games or whatever it's still there's going to be load screens and there's going to be car rides and there's going to be sh I never thought about that that's solid see there was a great annual once for Superman that dealt with this where Superman you know in he had already come and gone and then in the future there was this like League of Superman kind of thing right and they each took on one of his powers and so when they out in public they were like doing all these great things you know guys x-raying through bombs the other guys shooting out heat vision uh blah blah but the problem was that when they were in private they all had horrible",
      "start": 5045.16
    },
    {
      "text": "like doing all these great things you know guys x-raying through bombs the other guys shooting out heat vision uh blah blah but the problem was that when they were in private they all had horrible downsides this right the the X-ray guy couldn't turn off x-ray vision he had to wear lead glasses the guy who did heat vision would occasionally have to open Windows and shoot heat vision into the sky cuz it would just build up and kill eventually stuff like that yeah there double-edged swords here that is true what would be the Del serve for teleportation though I don't think there would be well for going off the X-Men movie like you can only see as far as like your wife wouldn't be able to teleport easily to like oh I want to go to Rome I'm in Rome cuz like she'd she'd say that go into a wall no no we're not going to we're going off of uh what was that one with Hayden Christensen the jumper it would be like jumper where you can just if you've seen a picture of it you seen it you just go",
      "start": 5079.44
    },
    {
      "text": "no no we're not going to we're going off of uh what was that one with Hayden Christensen the jumper it would be like jumper where you can just if you've seen a picture of it you seen it you just go there and you're ready to rock although there was an awesome episode of Wolverine and the X-Men where Nightcrawler had to teleport across he could only do like 200 ft before he could see and so he did the entire like Pacific Ocean yeah cuz he just kept going from what was the island that uh Magneto owned Magneto Island no new uh New Geneva it was com I think it was anyway had an island it wasn't a big thing in the space and it was cool it was cool josha new that was my argument that I mean that would work but I'm just saying it wouldn't be super easy think you know what I mean like that is that's you're right that's more of a bird it's B basically easier at that point fly yeah you just go to that's a good point and that's the other thing too of like how the other practicality of superhero",
      "start": 5115.08
    },
    {
      "text": "you're right that's more of a bird it's B basically easier at that point fly yeah you just go to that's a good point and that's the other thing too of like how the other practicality of superhero Powers right is like what is that doing to your body like are you burning calories are you going to be exhausted can you really teleport that far and you know I don't know there's got to be some downside where you're like you're not it's not burning calories but you're losing time or something like that right where you get there but you're still maybe like it still took like 10 hours for your molecules to or maybe you're the different it's that concept of the transporting in Star Trek where you're like you're technically a different person every time you're killing yourself and your bodies are reforming into a new Mass which is a new person you heard this Theory I've heard this Theory yeah it's completely outlandish and to me it breaks mythology but there's got to be something bad about that",
      "start": 5156.44
    },
    {
      "text": "into a new Mass which is a new person you heard this Theory I've heard this Theory yeah it's completely outlandish and to me it breaks mythology but there's got to be something bad about that where your body your molecules are like dematerializing and rematerializing somewhere else you might be a different person with no spirit this is another cool one from Invincible right that there's this girl in there called Atom Eve who can take I got to read I got to read this series I love invincible so much but anyway she can take any object right and change its you know molecular structure to make it into something else or whatever right so she like one point they're drinking coffee on a roof and this is how she explains it to Mark actually that he you know he's drinking tea or coffee and he wants sugar so she picks up some leaves and changes it into sugar and drops it in and he asked this great question that I would have never thought of like she she explains her powers that you know she's",
      "start": 5188.52
    },
    {
      "text": "sugar so she picks up some leaves and changes it into sugar and drops it in and he asked this great question that I would have never thought of like she she explains her powers that you know she's rearranging molecules and he goes well what if you do if there's like leftover what if you do there's like leftovers you know what I mean like it's not like you know one in is one out yeah yeah she's like well let's just say if I use my Powers a lot in a day it's not it's not uncommon for me to use the bathroom like five times and he goes gross that's really so she go go straight so she can't take a car and make it into a mouse she could but she have to go to the bathroom I guess or whatever car she's got to what shut that car boom right thean matter I forget I Just [ Music] sh it's a liquid Pat Colin what's yours did you do your already I don't know telekinesis would be pretty cool you telekinesis would be you would pick that though you want to know what people are thinking telekinesis no",
      "start": 5218.84
    },
    {
      "text": "Colin what's yours did you do your already I don't know telekinesis would be pretty cool you telekinesis would be you would pick that though you want to know what people are thinking telekinesis no which one telekinesis is moving things which one's the one reading Minds telepathic telepathic that would be that would be especially handy but that's one of the ones every X comic I hate it when it's just like like Gan Gray and freaking Xavier and all this stuff they can do anything but col are you just do you just want telekinesis that you don't have to get up to get another beer when you're watching the Jets game no I I think it would be cool to I think that would be practical and also just cool be about as close as you get to being a Jedi oh there you go think about think about Darth Maul opening that door in the fight at the end of episode one how he just that he just yeah it's awes I I actually really love that one that one shot of him when he just points at the thing and like and",
      "start": 5257.56
    },
    {
      "text": "opening that door in the fight at the end of episode one how he just that he just yeah it's awes I I actually really love that one that one shot of him when he just points at the thing and like and sends it to the like it hits the panel on the door it's like very subtle I didn't even notice it the first time I saw it's one of the coolest things one of the coolest like choreographed emotions they could have possibly put in that fight and I know we've talked about this you guys have talked about this a little bit we might have actually talked we this show we we rank the star still again Darth Maul should have had more screen time he should have the trilogy he should have been in the trilogy 100% Anakin and him should have F at the end of episode three 100% no reason to have greedus or dark Count Dooku in and he should have you know that would have been a great thing too because an he could have gotten into a situation where like he was vulnerable and then Anakin chose to kill him and",
      "start": 5297.12
    },
    {
      "text": "Count Dook u in and he should have, you know, that would have been a great thing too because and he could have gotten into a situation where like he was vulnerable and then Anakin chose to kill him and that was the completion of, you know, I mean essentially they the dark side like L instead yeah like it yeah but that was lame that was just like who cares about Dooku he was he was a poorly set limp lightsaber but man Maul was badass yeah was awesome Park a badass yeah Ray Park was awesome and he was the only good part of any of the trilogy but anyway I digress Tim I want to make little firecrackers with my hands you want to be like juile get out of here this is such a hard question like Tim it's not hard it's not it is hard what do you like most what in I mean okay I can say a bunch of **** like I think you would be no I think you be it's **** it's all **** because this is one of those questions since you're a little kid you think about but then Greg's right you got to think about all",
      "start": 5334.84
    },
    {
      "text": "I think you would be no I think you be it's **** it's all **** because this is one of those questions since you're a little kid you think about but then Greg's right you got to think about all these other things that you don't know we're wait Cara say something yeah it's just like you and your shenanigans lucky my phone happened to be on silent I th really enjoyed the voicemail yeah she's watching signed Tim's girlfriend she's watching some **** she's watching some **** smartly avoiding the call while watching People's Choice Awards is my answer there you go I appreciate that but taking that out of it cuz when you were a kid you didn't give a **** about any of that stuff you didn't care about the repercussions of having like someone found out like the really cool stuff it was just like oh any of these are cool you know I for you since you love making content and you wish that you could everything made was like a 2 million views I would say what is like being able to will",
      "start": 5377.4
    },
    {
      "text": "just like oh any of these are cool you know I for you since you love making content and you wish that you could everything made was like a 2 million views I would say what is like being able to will people to do things that you want them to do doting everyone in San Francisco to watch one of your videos would be Jesus that's the super villain stuff though hey you said you said power well I guess power you say I will say one of the like the a really cool power is like Magneto's I think that's really interesting because in such crazy unique ways like to me it's like oh great you control like mental things who cares but then he does some crazy **** like oh I'm going to use the iron in my body and stuff good for him my thing about Magneto's power was the same problem I always had with Superman's power Superman Superman which was and you can answer this question for this is a legitimate question God is he as powerful on another planet as he with not our son like with a red Sun as he is on",
      "start": 5417.48
    },
    {
      "text": "power Superman Superman which was and you can answer this question for this is a legitimate question God is he as powerful on another planet as he with not our son like with a red Sun as he is on Earth no he'd be a human being so that sucks to me yeah no totally that's one of his weaknesses Superman okay when it comes down to it **** Superman's dumb I don't care what you say also as far as it goes though like what actually let me let me stop you what are your thoughts on the Green Lantern because to me if you're not a superpowered you're not a superhero yeah if your power comes from a ring Green Lantern I think if see this is an interesting thing because we were saying what superpowers would you want to be if we were to say what super hero would you want to be I'd want to be Green Lantern because Green Lantern has all the benefits of being a Superman or whoever but none of the not as many of the drawbacks he will die he can die he can't be a normal human the problem with being",
      "start": 5457.16
    },
    {
      "text": "Lantern because Green Lantern has all the benefits of being a Superman or whoever but none of the not as many of the drawbacks he will die he can die he can't be a normal human the problem with being Superman right is that we do roll the dice of can how much do I feel you know what I mean what are my limitations do I always have to be thinking sex you really can't have sex I think you could but he did in the comic books right at some point yeah and he did in Smallville but I there's definitely he could but he they talk about this on Smallville in a million other things too right like he has to be he has to be cognizant of that at all times yeah at no point can he get lost in that moment cuz yeah he could break somebody like a twig in two seconds and that split him like a canoe oh my God you know what I mean yes yes that is that is also true but Green Lantern right like Green Lantern you can like it's a weakness don't get me wrong you can take off the ring huge weakness what if you",
      "start": 5500.52
    },
    {
      "text": "you know what I mean yes yes that is that is also true but Green Lantern right like Green Lantern you can like it's a weakness don't get me wrong you can take off the ring huge weakness what if you lose the ring you're like a **** I guess you can will it to you but well but here's the thing I've always thought about that right what I would do is if I was Green Lantern what I would I would when I got my ring and I put on my power ring I would will it to drive into my bone so that it would always be attached to take it off you'd have to take off my hand that sucks cuz then someone takes off your hand well I'm already I'm already screwed by that point I guess you're you're saying it's it's I would have return it's too late too late that will a shield all around you all the time yeah not only pick one of them because she's like oh I guess it's the same problem with she's got that wh I wouldn't pick one of them but like her powers I guess it's the same with Superman though super oh yeah",
      "start": 5538.0
    },
    {
      "text": "pick one of them because she's like oh I guess it's the same problem with she's got that wh I wouldn't pick one of them but like her powers I guess it's the same with Superman though super oh yeah yeah same as Superman same drawback as in you can't touch a normal human being she dat a Batman at some point right there's a little Batman in Justice League yeah yeah the car hot it's hot but there's there don't look at the other people you know it was hot no I'm with you I'm I'm 100% I love that relationship I thought that was awesome to me the the superheroes that are coolest and the super villains that are coolest still we've talked about this a million times are the ones that are grounded in reality though so if I could choose to be a superhero be like Batman or something like that but see that but like Batman's whole life is torture all the time you know now granted you're just not a happy person to begin with I always talk about it right that I'm Superman and you're Batman you're",
      "start": 5572.2
    },
    {
      "text": "see that but like Batman's whole life is torture all the time you know now granted you're just not a happy person to begin with I always talk about it right that I'm Superman and you're Batman you're always like oh one one of us is totally contemporary and cool I didn't mean more like I'm always trying to look for the good and people and you're always like **** everybody I don't care you know what I mean like everyone Batman knows is going to die in a horrible way Batman's villains are always going to come back and kill a mil all right so like Iron Man would be pretty cool tooon man would be or villains like the Shocker [Laughter] my favorite of all Marvel Super Villains I uh I like he's not even a super villain he is just a bad guy Sinister 6 bro he's running away this bag of money with the six BR there's currently There's a comic book series now called The Superior Foes of Spider-Man and it's the Sinister 6 as it is now but there's only five of them and it's all just B people led",
      "start": 5606.64
    },
    {
      "text": "the six BR there's currently There's a comic book series now called The Superior Foes of Spider-Man and it's the Sinister 6 as it is now but there's only five of them and it's all just B people led by the Shocker or not led by but uh he's one of the main guys and it's hilarious because it them **** up the the Sinister Six that I remember though was like what Rhino Sandman octopus yeah oh Mysterio I was say myio Dr Octopus Mr Sinister right was Mr Sinister he was was like an X-Men villain okay no vulture was in there for a little B there's always a ton of them then scorpions I love Mr Sinister was their leader who is he the leader Mr Sinister was the guy who was like harnessing all the X-Men for their powers to make the ultimate like mutant okay and chameleon yes he was one of them okay yeah see I know a little something I know a little more than I let off though not real heroes not real com like d better the only reason I like the only reason I'll tell you I think the best villain",
      "start": 5648.44
    },
    {
      "text": "yeah see I know a little something I know a little more than I let off though not real heroes not real com like d better the only reason I like the only reason I'll tell you I think the best villain on the planet ever ever written though is Magneto though because he's not a villain he actually is the hero he is the hero of his own story he is the guy who thinks he's doing right he's not trying to be an evil **** in take of the world he's just fighting for his people and I always that I always found that ultimately really really compelling see here's my thing to that though hand this back jug of bourbon back to you I think Lex in most in good Superman stories Lex is the same way Lex is out there to save the human race from the Alien Inv aders the Alien Invasion this use that as a red herring to like really take over the world like that was his political agenda in the end yeah he wants to be in charge of the world because he thinks it'll make it a better place granted if he ever gets",
      "start": 5694.52
    },
    {
      "text": "to like really take over the world like that was his political agenda in the end yeah he wants to be in charge of the world because he thinks it'll make it a better place granted if he ever gets it he fails like Maniac in the hit MMO DC Universe Online still playing that one are you I am they just released game update 33 T that I can't wait to go play what was the uh God there was an alternate universe episode of Justice League where he comes back one of the Syndicate what I no he was from an timate Dimension where he's from like the opposite Dimension where he's actually good yeah and they try to kill him cuz he killed flash or something like that oh okay yeah and that was I can't remember it was really good I remember being good I love the Justice League cartoon yeah are you you should read Injustice the comic book it's like you were talking about that you were saying out of all the comic books they've done recently that was actually really good it just came back for its second",
      "start": 5729.8
    },
    {
      "text": "read Injustice the comic book it's like you were talking about that you were saying out of all the comic books they've done recently that was actually really good it just came back for its second season or whatever started off so strong it's so good they have it in digital yep that's like is it $19 a comic book like it's 99 C cuz they they releas chapters okay but you can buy bundles now Marvel's for a while they're still expensive they're really expensive and for com for got a lot of really good stuff going right now though do they like there's stuff that D drew the line and this is this you know I'm going to save this one for a another show but I've always wanted to ask you to because you guys read a lot of comic books right give me the rundown of how to start reading comic books not now I'll sa that for another show but that's what I want to know for someone who's never read a comic book he save it for another show get your Marvel fcking goel out of here this uh the the Batman is",
      "start": 5768.12
    },
    {
      "text": "I'll sa that for another show but that's what I want to know for someone who's never read a comic book he save it for another show get your Marvel fcking goel out of here this uh the the Batman is awesome going but um I just started reading the All-New X-Men yeah yeah yeah All-New X- Men is actually awesome it is awesome and it's just like tell them give him the setup he'll like the setup well okay give me give me the yeah give me the Spiel wet my appeti as they say is Cyclops is now the leader of the bad guys really yeah because it's the crazy **** that happens and then um because there's some crazy **** that happen Beast is like damn there's no way our homies doing this this sucks we need to change this direct line yeah we need to go there's no way our homies doing this what do you mean doctor heast thought he was like dying and stuff so he's just like oh man with my dying breath I'm gonna go back in time get the old original Cyclops bring him now so he can talk to himself and be",
      "start": 5805.04
    },
    {
      "text": "doctor heast thought he was like dying and stuff so he's just like oh man with my dying breath I'm gonna go back in time get the old original Cyclops bring him now so he can talk to himself and be like dude stop and he's like yeah it's a perfect plan so they do that they go back get the original like five6 X-Men bring them to present time and then it causes all these crazy awesome time story now of people who yeah like they're talking to Jean Gray and they're like well do this and she's like how could I do that and he's like oh right you don't know how to do that yet like there they're like there's all these powers like then she realizes she dies she's like she finds out she dies close to the mic it's crazy though and then I don't want spoil anything but eventually like the story length that is now keep going on they the X-Men from the Future come to the present time too so there is three sets of certain of the X-Men and it is awesome is Wolverine one of the X-Men yeah he Wolverine's",
      "start": 5849.48
    },
    {
      "text": "is now keep going on they the X-Men from the Future come to the present time too so there is three sets of certain of the X-Men and it is awesome is Wolverine one of the X-Men yeah he Wolverine's the leader of the good guy see did you watch Wolverine and the X-Men there's one season of this show that was on TV and it got cancelled because it's too I guess excuse in which all of like Professor X something happens in the very first episode Professor X and Jean Gray disappear some explosion happens and you have no idea what's going on and and Wolverine has to lead the X-Men and he doesn't he doesn't know how to he doesn't want to cuz he's Wolverine he's like I'm not the leader I'm the guy that like goes in like kill people and it's awesome I thought it was really really really good and they do with that it's the Age of Apocalypse kind of backward where he's talking to Professor X in the future and what happened was he gotele it's the whole thing but I thought it was really really good and",
      "start": 5891.88
    },
    {
      "text": "with that it's the Age of Apocalypse kind of backward where he's talking to Professor X in the future and what happened was he gotele it's the whole thing but I thought it was really really good and like everything I love in life they cancel it after one season which totally sucks but if you guys have a chance on Netflix you just check it out it's really good and Spectacular Spider-Man because it's amazing and Ultimate Spider-Man because it's just a great escape they have a Die Hard reference in one of the episodes it was amazing it's horrible Colin yeah what was your topic tonight did we go to get to it we haven't gotten to it do we want to do it or we want to save it for another show I mean we can keep talking about that here's the thing how do you think it's a long one should we save it do you want us to save it I don't think it should be a long one Ser no let's talk about it then we're only4 I I like the idea that every show isn't I I like that our minimum time delivered ever is a",
      "start": 5933.6
    },
    {
      "text": "do you want us to save it I don't think it should be a long one Ser no let's talk about it then we're only4 I I like the idea that every show isn't I I like that our minimum time delivered ever is a an hour and a half but we want to get you know we want to get through all four topics I'm having a good time I'd like to hear your topic if that's okay call yeah it's last week's episode was like 14 we should absolutely right now though we should order a pizza if that's possible cuz I'm oh Mr Salad I'm joking about that I'm sure you are I'm sure you are there is there is a piece of pizza from last night left over and a whole bunch of chicken wings okay oh I'll eat the chicken wings for sure earlier tonight we're driving here and we're ordering can we please dick go ahead he's pulling up his we're order we're ordering some food yeah and uh the three of us we order Underdogs I get a he gets a what you get pork burrito pork burrito he gets a cheeseburger burrito right cuz that's",
      "start": 5964.96
    },
    {
      "text": "up his we're order we're ordering some food yeah and uh the three of us we order Underdogs I get a he gets a what you get pork burrito pork burrito he gets a cheeseburger burrito right cuz that's awesome and then I have to pass the phone to Nick Scarpino who tells the bar we're ordering from he like a bed of lettuce and three servings of chicken on top it was grilled chicken and to it replied I don't have grilled chicken cuz they just have that pulled chicken which I think is complete rubbish it's grilled or not it's grilled or nothing so I told them carne asada what the only reason I wanted that was cuz I was craving just lettuce and protein I didn't want I don't want all the crazy tortilla stuff I want to stay Nimble for the podcast so I can think not be weighed down by a cheeseburger burrito Greg has no problem with it super I'm fine I have to I'm also sitting on the sides here and I feel like that bows me out a little bit so I have to be like 10 to 15 maybe 35 75 lbs lighter than I",
      "start": 6001.04
    },
    {
      "text": "Greg has no problem with it super I'm fine I have to I'm also sitting on the sides here and I feel like that bows me out a little bit so I have to be like 10 to 15 maybe 35 75 lbs lighter than I am right now it's not a big deal it's not a big deal now you want piz and wings anyways Colin top that's always happens that's why I always stay the same weight because I just binge so I've been encouraged by a lot of people on Twitter to stay with the serious and intellectual topics and so I'm going to you are a serious and intellectual person uh but I this is the first one I also thought about with a a title in mind for the podcast but we already have our title so sure um do you know who Alexis de Tocqueville is by chance have you ever heard so Alexis de Tocqueville was a uh French writer and he was one of the in the 1830s 1840s he traveled to America he was here for a long time and he wrote a series of books about life in America and he was one of the first people to tell Europeans about what it was like",
      "start": 6044.44
    },
    {
      "text": "in the 1830s 1840s he traveled to America he was here for a long time and he wrote a series of books about life in America and he was one of the first people to tell Europeans about what it was like in the United States like because they didn't really know and obviously the traveling here was very weird the United States was growing independently of Europe and he wrote a lot about what would end up being known as American exceptional ism and the idea that Americans thought that they were better than everyone else still do and so I wanted to ask you what you think of American exceptionalism and here's what how Wikipedia uh defines it defines it sure American exceptionalism is a theory that the United States is qualitatively different from other states in this view US exceptional ism stems from its emergence from a revolution becoming what political scientist Seymour Martin Lipset calls the First new nation and developing a uniquely American IDE American ideology americanism based on",
      "start": 6087.48
    },
    {
      "text": "from its emergence from a revolution becoming what political scientist Seymour Martin Lipset calls the First new nation and developing a uniquely American IDE American ideology americanism based on Liberty egalitarianism individualism republicanism populism and Le Fair although the term does not necessarily imply superiority many neoconservatives and American conservative writers have promoted its use in that sense to them the United States is like the biblical shining City upon a hill and exempt from historical forces that affect other countries so my thoughts on this are you know you always you always hear that argument of is the United States the dominant superpower right which you have talked about a number of times and for lon's purposes you know we're not China is up and coming China's got a lot more economic value too it's they're doing a lot more stuff to me America is not it's not about are we better than anyone else it's about sort of do we have do we have the mentality that",
      "start": 6127.28
    },
    {
      "text": "got a lot more economic value too it's they're doing a lot more stuff to me America is not it's not about are we better than anyone else it's about sort of do we have do we have the mentality that we can be like every single person in this country thinks that we have it in us to be the best country and that's what the that's why this place is so special to me anyone can come here who has that driving Spirit to want to be to want to do better than he did yesterday and he can call himself an American and that's the power of our country to me and that's why I would I don't agree agree necessarily with that with the concept that you just read but I think we have it in us and always will have it in us to be the best country in this on this planet forever that sounded awesome I really liked that yeah it's good I zoned out for a second there I blocked out was it good that was good yeah that's how you debate that's how you debate I mean I think Nick puts it in a good place but I think you",
      "start": 6167.16
    },
    {
      "text": "that yeah it's good I zoned out for a second there I blocked out was it good that was good yeah that's how you debate that's how you debate I mean I think Nick puts it in a good place but I think you know he said you know it's about can we be better than America is about can we be the best country can we be this I think America is about we right that's what it is I don't think that most Americans to whether it be good or bad don't think about the rest of the world this is always this is always the thing that you can't explain to someone else from another country CU we're lucky enough to have fans from around the world thank you so much but when we're on a podcast and we say something about the UK and we don't mention Ireland or whatever they get offended and it's like we really don't know the difference from that and that's a detriment to obviously the American educational system that it's not driven home more I think what is happening in the rest of the world how these other",
      "start": 6213.72
    },
    {
      "text": "know the difference from that and that's a detriment to obviously the American educational system that it's not driven home more I think what is happening in the rest of the world how these other countries interact what it all comes down to but it's also driven out cuz we're so so prideful of what we do and what we are and where we came from right and I do love America and I think that is driven into a lot of people the patriotism of we all like we talked about this when we were playing BioShock and even in just in general the way that no other country really looks back at its Founders like we do we really do put them on a pedestal like Gods like they do in BioShock Infinite and stuff right like this they are larger than life they are these things that they were just men who did this but they did something so crazy and gave us so much that Benjamin Franklin and you know I was going to say Thomas Edison cuz I've been drinking Jefferson you know you look back at these people and I would",
      "start": 6251.24
    },
    {
      "text": "did something so crazy and gave us so much that Benjamin Franklin and you know I was going to say Thomas Edison cuz I've been drinking Jefferson you know you look back at these people and I would I would have gone with that you would have just been like yeah and the guy who made the English money sign that but you know what I'm saying like there's like there is something in this country that you are super proud of it you know what I mean like you are proud of what it is and that's for me where I get super offended when we start talking about people who I I and I know this is such a stupid thing to say but I it boggles my mind that there's still racism and that were like for legal immigrants that were such **** to them and all this other stuff and it's just like **** we we all pretty much everyone's ancestors came here to from Ellis Island to find a better life and bootstraps and build something and yada Yad Y and you're like so offended this guy wants to drive drive your cab or do",
      "start": 6290.32
    },
    {
      "text": "everyone's ancestors came here to from Ellis Island to find a better life and bootstraps and build something and yada Yad Y and you're like so offended this guy wants to drive drive your cab or do whatever to make a better life for his family so his family can go be doctors whatever you know what I mean like that and that's what it's all about that's what I love about it yeah I cannot follow up what either of you guys said with anything nearly as intelligent or should we call your girlfriend back no no we she lives in Texas Mr America yeah it's pretty American there Texas as bad as americ American is gets Stars and Stripes but uh I mean I agree with what you're saying about the racism like I don't understand how racism still a thing and it's like I know that it is I'm just saying like I I don't understand how you're that shortsighted of it you can't be like three generations ago you didn't exist here either exactly it's crazy yeah it's ridiculous but you have to also understand as",
      "start": 6329.36
    },
    {
      "text": "I I don't understand how you're that shortsighted of it you can't be like three generations ago you didn't exist here either exactly it's crazy yeah it's ridiculous but you have to also understand as Colin will probably point out that we're are we we're not the newest country right no we're the first we're the First Republic like the first modern Republic but in this in a grand scheme of things the United States of America no we're not even remotely the newest every country that was in the as far as like the bigger as as far as superpowers go we are the the latest of them all right no Canada would be newer and I guess is Canada consider super Australia well I'm just saying there's a lot like we're not no offense Canada we just don't know much about you I didn't learn a lot about geography but I don't think you're taught it in school anyway my point was this we are a relatively young country still in the grand young in in the European tradition right which is what is most important to",
      "start": 6371.04
    },
    {
      "text": "but I don't think you're taught it in school anyway my point was this we are a relatively young country still in the grand young in in the European tradition right which is what is most important to us what we could use evidently is stronger uh geography lessons in school because apparently I have no idea what I'm talking about any of that stuff happens I also didn't learn a lot about grammar too Sor when that email went around today I had to look up all those things doesn't matter um about verbs no there was well I so so when I was young I never really paid attention in school and I specifically didn't pay attention to like grammar school when we were learning grammar um so the the differences between what types of verb do what and what those designations are still sort of elude me I find myself more and more as I get older and as I start creating more content wanting to speak a little bit more eloquently trying to research a little bit more about the English language which is",
      "start": 6410.52
    },
    {
      "text": "I find myself more and more as I get older and as I start creating more content wanting to speak a little bit more eloquently trying to research a little bit more about the English language which is fascinating because I know you guys you went to journalism school so you're clearly up to speed on it no no see that's the thing I went the opposite direction really where my life was journalism school and AP the AP book getting the new book and seeing what they changed doing this and like you come to IGN I'll never forget that first time when I turned in I'm like hey here roer here's my review he's like cool publish it like nobody reads these over he's like no I'm like what about style he's like like holy **** that's why there's like four different versions of okay on IGN at any time and so like I've been there seven years now nobody cares about it at all wow see to me that's that's actually one of those things I don't know if you guys have this thing about yourself people care about it",
      "start": 6452.76
    },
    {
      "text": "like I've been there seven years now nobody cares about it at all wow see to me that's that's actually one of those things I don't know if you guys have this thing about yourself people care about it now I'm sorry I'm talking about in the beginning no there were the Doug PA yours um oh sorry that's going to come back to H me uh there are those things in in normal conversation that I do I I get nervous about right grammar is one of those things when someone says oh you use the wrong adjective there I'm like does somebody really say that to you sometimes it happens that's a dick you should tell them to **** off that's the big thing about what we do is like what or like for instance like my I got an argument with some the other day when they were talking about I said I feel bad and they were like no it's badly and I'm like I don't think it is and then I looked it up and I was right but I was like I didn't know at the time that I was right cuz I was talking about the emotional state",
      "start": 6487.28
    },
    {
      "text": "like no it's badly and I'm like I don't think it is and then I looked it up and I was right but I was like I didn't know at the time that I was right cuz I was talking about the emotional state of being of feeling bad not how I actually feel the action feeling and so that was the whole thing but I'm like oh my God if I'm if I'm wrong about that what else am I wrong about and it starts to spiral more of like I'm losing confidence in myself I mean there's the thing that there's conversational English and that's I think what most of what we do as a professional in a day job is and whether that's right or wrong that's somebody else to decide but I you know I always talk about it right like I sit down and like and I talk and right like I'm talking and writing in my basement to my friend pop what am I telling you about right now you know what I mean and and when in that grand schema thing things am I ever going to say Well since this you know since you have a beard I'm going to say this",
      "start": 6523.4
    },
    {
      "text": "what am I telling you about right now you know what I mean and and when in that grand schema thing things am I ever going to say Well since this you know since you have a beard I'm going to say this and he's going to go no no no Greg it's because you have a beard since would imply time Nick wow right and it's like get **** who who's calling that it's like I that's not a day that goes by that I don't say uh Les and per Schneider who our amazing SVP of Ian goes fewer he says fewer it's fewer it's fewer yeah like well that's more or less but if you wanted to write that's the difference between you and I you and me excuse me there he goes see there another one if you wanted to write a novel right now you could to whatever potential you wanted to I would still be behind I I don't think I write eloquently I don't think I could I see I even you and I you and me why is it not you and I I think it's you and me he and I it is you why yeah it's cuz it's long it's a thing I got corrected on",
      "start": 6557.92
    },
    {
      "text": "write eloquently I don't think I could I see I even you and I you and me why is it not you and I I think it's you and me he and I it is you why yeah it's cuz it's long it's a thing I got corrected on that one that was one of I still get corrected in tweets about that all the time like that is still like it's one of those things for me magazine editing going through and learning and having to do all that I always felt like you know like in Die Hard or whatever when like you're hitting your bleeding but you're just trying to make it out alive that's totally what those classes were it's like I'm never I'm always on the verge of bleeding out here I just need to get through learn enough to get through in my in my at my desk at work if you open up my drawer there is still a green f a green folder in there that has all my magazine editing notes that I kept with me when I was a newspaper reporter that I brought with me there's a book they do every yeah AP style gu no I mean I have yes I have",
      "start": 6598.76
    },
    {
      "text": "in there that has all my magazine editing notes that I kept with me when I was a newspaper reporter that I brought with me there's a book they do every yeah AP style gu no I mean I have yes I have an AP Style guy but I I have a I have a a a folder of notes that I've written of things that I had weaknesses with that I wanted to keep up on but what I'm talking about is like it's all such it's a muscle I haven't flexed in so long that I'm totally not like I'm no better than anybody else anymore now I wouldn't trust me anyways back to come right back to it I think I think that's part of being American you know what I mean that we all do not wor about grammar 100% no in a lot of ways it is like right like we Blaze our own path we're going to do our own thing whatever well I think what a lot of people lose sight of with Americans is you know we came up from this revolution isolated from the rest of the world and like in a literal sense we were separated by an ocean from the the world at",
      "start": 6636.56
    },
    {
      "text": "of people lose sight of with Americans is you know we came up from this revolution isolated from the rest of the world and like in a literal sense we were separated by an ocean from the the world at the time which was Europe and uh that allowed us to create our own sense of identity a lot of people don't realize that even American English is actually old and it's not old English literally O L D E English it's it's like the English that was being spoken in the 18th century our our version of English is actually older than British English and people didn't speak with British accents in the United States they or in Britain back then they spoke like we speak you know so like so when did they break so British people started speaking with the accent to uh there's a whole I think I sent out an article on Twitter a while ago about this but like they started speaking out with this accent to you know to differentiate themselves from lower class people and it ended up being like the whole",
      "start": 6678.16
    },
    {
      "text": "an article on Twitter a while ago about this but like they started speaking out with this accent to you know to differentiate themselves from lower class people and it ended up being like the whole different way they speak so um but this this growing up in isolation in the 19th century which is when Alexis de Tocqueville came over and told everyone what America was like was like in England you're only 17 18 miles away from France over the channel or whatever like France is next to Holland and Belgium and Belgium's next to you know Germany and Germany which by the way every single time my Italian relatives come over they don't understand this year scale of what the continent like the United States America is to them if they hop on a plane two hours later they're in Amsterdam if they want whatever yeah it's just not like that here and it certainly wasn't like that as we were coming of age as a country sure um but what what really bothers me is that people are down on Americans they think we're stupid",
      "start": 6720.6
    },
    {
      "text": "just not like that here and it certainly wasn't like that as we were coming of age as a country sure um but what what really bothers me is that people are down on Americans they think we're stupid they think we're a lot of people think we're fat, stupid, and like all these things and that frustrates me because yeah we're some of us are fat some of us are stupid but a lot of people take for granted this is the thing that always bothers me a lot of people take for really for granted like the things we've given this world as Americans and a lot of that comes from our entrepreneurial Spirit our free enterprise we have insane work ethic comparatively speaking we are we are a small Republic that is a People's Republic and not the Communist sense uh that you know allows uh you know a a sense of democracy a sense of you know pulling yourself up you can get rich you can be poor there are winners there are losers you know those kinds of things and that system allows like Greg said to for",
      "start": 6758.96
    },
    {
      "text": "of democracy a sense of you know pulling yourself up you can get rich you can be poor there are winners there are losers you know those kinds of things and that system allows like Greg said to for immigrants to come over here like my parents you know uh you know great great grandfather whatever did during the Civil War and all those kinds of things to make a better life for themselves which is awesome that's what people still do today but everyone you know my always my favorite thing to always say is like people talk shit like you know fat stupid Americans as they're tweeting on Twitter the American company with the computer that was invented in the United States on the internet that the American Military invented with all these it's like you know like that kind of shit like really bothers me whatever I'm being specific the worldwide web was invented Internet was invented there we do have people in this country that could stand to lose a few you know sure sure no I mean and when we",
      "start": 6800.72
    },
    {
      "text": "me whatever I'm being specific the worldwide web was invented Internet was invented there we do have people in this country that could stand to lose a few you know sure sure no I mean and when we go to other countries we are not the most I mean I don't want to generalize but I I'll speak just for myself on this one I'm not the most courteous person when I go to other countries I enjoy being the loud American in the room that did not learn the language of the people that I around I don't I didn't pay them the courtesy of even knowing how to say excuse me or may I have this thing right and so I'm guilty of that too when I go over but that happens here too I understand what you're saying totally understand but again I think it comes down to size of the country right like we are so large that there are pockets of people who in the Midwest you know maybe you don't travel maybe you never go to France maybe you never do this you know what I mean or if you do I was a group in Southern",
      "start": 6834.72
    },
    {
      "text": "that there are pockets of people who in the Midwest you know maybe you don't travel maybe you never go to France maybe you never do this you know what I mean or if you do I was a group in Southern California there's a lot of people I know that never traveled outside of the 40 mile radius of where they they have to work and live and so again like when we're talking about a uh a people who are like that right who which I would have been right if I hadn't ever come to IGN or if I never took this job if I was a daily newspaper reporter I'd never be going anywhere you know what I mean except for like big time vacation right once every seven years or whatever but if we're talking about those people right what is their motivation to learn about something else you're in the middle of the country you're never going anywhere else for what your daily needs are and what you need to do to survive and understand your country and blah blah blah blah what would you ever need to know about what is",
      "start": 6874.64
    },
    {
      "text": "you're never going anywhere else for what your daily needs are and what you need to do to survive and understand your country and blah blah blah blah what would you ever need to know about what is going on in another country unless it's a war or you know something that's that kind of level or the collapse in Greece that may bring down the entire economy like that's the difference you know what I mean and so like I think the fact that real quick sorry that you know you're living in Italy and then you know everything about what's going on around you is because like it'd be the similar fact of if you lived in Illinois and knowing what was happening in Wisconsin and Indiana and all these other states you tend to know the things that that directly affect you right you have to um but that's the thing that when I met my wife she had traveled a lot I was speaking the devil look at that stop playing with your toys come home she's like what she's going a bad um by the way every impression any",
      "start": 6910.84
    },
    {
      "text": "thing that when I met my wife she had traveled a lot I was speaking the devil look at that stop playing with your toys come home she's like what she's going a bad um by the way every impression any of us have done of any other person we know whether it be male or female I think you did a pair one earlier have just been the worst impressions of those people we're not good we're not good at impression always the same Colin's impression of his girlfriend went from just a normal like a little higher pitch and then he started putting like the New York accents on things it was awesome you went New York you went New York Jewish person I did really earlier too that was I I laughed in the kitchen the other day theas your girlfriend was talking wonderful woman love her love living with her uh but she was like coffee and I was like ah she talks like Mike Myers on SNL um the my earlier point was going to be you know when I first met my wife she had lived in uh Vienna she had lived in England she",
      "start": 6946.96
    },
    {
      "text": "was like coffee and I was like ah she talks like Mike Myers on SNL um the my earlier point was going to be you know when I first met my wife she had lived in uh Vienna she had lived in England she had lived in a couple places she loves that sausage no she's not a big fan Vienna sausage yeah they make the no she actually said she used to go she just eat cheese and bread and then occasionally she had some chocolate she loved it um but she will kill you know she always hates when I say things like that when I get you know you go to America we kind of tend to overdo it I'll get like my my pride built up and I'm like we're the best country the planet don't need I don't need to know anything about anything else that's going on everyone should know what's happening to us and she goes that's just so damn one-sided like there's a whole other world out there that's not the United States of America and there's so many wonderful things to see and experience and there's so many wonderful people to",
      "start": 6983.48
    },
    {
      "text": "so damn one-sided like there's a whole other world out there that's not the United States of America and there's so many wonderful things to see and experience and there's so many wonderful people to meet that you really can't you you got to stop being close-minded but because of her I am more open-minded had I not met her I don't know who I would be she is the one that has brought me out of my shell so to speak and she's the one that wants to go to Paris for you know next year's Christmas and things like that I'm like I'm down for it because you know I'm open to the idea now because that had I not been for her stay right here right here in the old US subve for the rest of my life eat a burrito yeah burrito America's burritos is there any way for us to edit out that first high five cuz that was awful no this we did it we like we like we like ghosted the first one and then we nailed it but like the first one that was crap I mean to me you know we have you know people like to bring up",
      "start": 7025.24
    },
    {
      "text": "was awful no this we did it we like we like we like ghosted the first one and then we nailed it but like the first one that was crap I mean to me you know we have you know people like to bring up our we have very sorted history in this country you know of racism and bigotry right no doubt about that sure I saw the Butler yeah yeah which one's the Butler and that's the one that like it goes through the ages and basically like follows the Civil Rights Movement Oh I thought you were making a joke of some kind but there's that's not funny that's a pretty strong film good J what what people what people seem to misunderstand about a lot of the things in our history that there are people that are always trying to fight these bad things and people seem to focus on I guess what I'm saying is people seem to focus on a lot of the bad things about America and Americans you know for all for for the Confederates that seceded during the Civil War and left you know two two like two and a half or 3%",
      "start": 7062.2
    },
    {
      "text": "seem to focus on a lot of the bad things about America and Americans you know for all for for the Confederates that seceded during the Civil War and left you know two two like two and a half or 3% of the of the United States died during that war to bring them back in like I was telling Greg the other day that's about 12 million people if we fought the Civil War today died 12 conversation with Colin every Tuesday and Thursday on GameOverGreggy. like like that's you know 3% of the population died to to to get them back and like stop slavery you know I mean like so there were there were righteous people with alongside the people even in Jim Crow America which was a terrible place there were people in the north trying to stop that people seem to forget you know as we get made fun of that you know we went to Europe we didn't have to do that in World War II we went to Europe we had our own war to fight in the Pacific but we went to Europe and helped over there we didn't have to do that you",
      "start": 7099.24
    },
    {
      "text": "know we went to Europe we didn't have to do that in World War II we went to Europe we had our own war to fight in the Pacific but we went to Europe and helped over there we didn't have to do that you know there's like we give billions of dollars of Aid to almost every third world country in the world every year you know we give food Aid even to our enemies like North Korea every year like we do really good things and so I just want people to keep in context like are is there something better about Americans or America than other places or other people no is it's not about it's not in our DNA it's not it's about system you know it's not a coincidence that we're the richest country in the history of humankind it's not a coincidence that our military is the strongest in human history yeah you know it's it's not a coincidence that we invent almost everything that everyone uses in the world you know yeah but then it gets outsourced to China or Japan they for a fraction cost but",
      "start": 7134.28
    },
    {
      "text": "you know it's it's not it's not a coincidence that we invent almost everything that everyone uses in the world you know yeah but then it gets outsourced to China or Japan they for a fraction cost but like you know what I'm saying like these things aren't coincidences because it's a product not of who we are but of the system that we allow to germinate over time you know and so next time people want to hate on America that's fine and American exceptionalism may or may not exist I don't really know you know but I do know that you know those blue jeans you're wearing are American that Facebook you're on every day is American that computer that Apple is American that Xbox is American you know the movies that you're watching are American the TV shows that you're watching are American the music that you're listening to is American you know you're saying the Xbox One is American that's why it barely works Xbox turn on so I just so I just I want people to keep in context like you know",
      "start": 7168.52
    },
    {
      "text": "music that you're listening to is American you know you're saying the Xbox One is American that's why it barely works Xbox turn on so I just so I just I want people to keep in context like you know criticize us because we deserve it but remember plenty of reasons that we but remember all the things that we've given you to make your life better and I'm not saying me I didn't give you shit you know but our fathers and our forefathers you know have given you have given you great inventions great things and put great things into the world and I feel like people forget about those things a lot just like I enjoy you know British music sometimes or German food or you know I want to say Chinese food that's not real Chinese food but when I was in Japan I really enjoyed the culture there the food it was awesome you know you like we I don't feel like we get a lot of credit for the things that we have done because this all goes back to I think in a lot of ways Colin the fact that we are very",
      "start": 7206.28
    },
    {
      "text": "it was awesome you know you like we I don't feel like we get a lot of credit for the things that we have done because this all goes back to I think in a lot of ways Colin the fact that we are very proud of what we do and who we are and I and I correct me if I'm wrong and this would have to be something in the comments like I don't think anybody really argues that we're the dominant superpower right we're the superpower right and it's the old Hillary Goldstein adage right that Coke doesn't talk shit on Pepsi everyone Pepsi talks shit on Coke everyone who's not number one is going to talk shit about it because and Coke is definitely number one are they or is really the bourbon buet whatever we get for free never going to give us anything for free yeah but I mean you know what I mean like that's part of it right like everybody criticizes everybody first off everybody's a critic yeah y y you see that on the internet about everything but you know it is easy one of I think we take so",
      "start": 7246.04
    },
    {
      "text": "that's part of it right like everybody criticizes everybody first off everybody's a critic yeah y y you see that on the internet about everything but you know it is easy one of I think we take so much pride in who we are as a country and where we came from and what it is whether you know you and I had nothing to do with it but you still feel that connection but we but we contribute to that every day and again it's not about like I don't I hope to God one of us one day invite invent something as as Monumental as as Facebook I don't know if that's going to happen but but it's not about that it's about every day we come here and we try to do something like this and we don't try to do it for the monetary aspect of it we we know you got know we do it because we have fun and we want to put something great out into the world right and we want to try to be better tomorrow than we were today and to me that's the American Spirit that's why our country I hope fingers crossed as long as the",
      "start": 7285.0
    },
    {
      "text": "something great out into the world right and we want to try to be better tomorrow than we were today and to me that's the American Spirit that's why our country I hope fingers crossed as long as the majority of us continue to believe that way will always succeed so other people don't do that yes other people do do that but what they don't have is they don't have the the the drive to come from thousands of miles away to this country because of that and that's what makes us great it's not the people that were born here it's everyone that wants to be American that's not American that shows that motivation and comes over to this country and is like I'm willing to work for it I'm willing to kill for it I'm willing to die for it I'm willing to do a job that sucks just so my son can have a better life and I know that happens in other countries but we are the country that historically was known for allowing that to curate and cultivate and that's what makes us fantastic yeah because people",
      "start": 7322.44
    },
    {
      "text": "life and I know that happens in other countries but we are the country that historically was known for allowing that to curate and cultivate and that's what makes us fantastic yeah because people don't it's true because people don't understand the whole history of you know the the the stat the stratification of classes and how what was going on in Europe at the time in the 19th century and how you can come here and be like and it goes all the way back to the Mayflower and like escaping things that were bad escaping social persecution about being in a cast system basically where you couldn't rise up and you couldn't be more than what you were born into there wasn't literal rules about that in Europe at the time but there were there were implicit rules about that at the time in Europe where you know if you were born the son of a coal miner that's what you were going to be you know and like like that's okay but the United States was always about come over here you know give us you're",
      "start": 7361.0
    },
    {
      "text": "you know if you were born the son of a coal miner that's what you were going to be you know and like like that's okay but the United States was always about come over here you know give us you're tired and you know you're weary and all that kind of stuff and and and that that represents America to me in a really great respect like a lot of people say what say what speaks volumes about America even though a lot of people hate it is that we have 14 million of people that got into this country illegally and are afraid to leave you know that like are afraid to be removed we have millions of people waiting in a line to get into this country you can't really say that about a lot of other countries you know that people are des ate to get do to get here you know and so should we be criticized for the things we've done in the past yes do we make mistakes all the time currently doing do we have a lot of douchebags yep yep do we have a lot of bravado four of them sitting right here but like I just",
      "start": 7398.44
    },
    {
      "text": "things we've done in the past yes do we make mistakes all the time currently doing do we have a lot of douchebags yep yep do we have a lot of bravado four of them sitting right here but like I just encourage people to you know to every Monday GameOverGreggy I just I just encourage people to respect like you know when we you know to to understand the things we've given the world and like that we made the world a better place and that when you criticized in the United States uh understand that not a lot of people think that we're Superior by Nature we just think you know in my opinion anyway the system is superior and that's like what gives us the economy that we have and that's what gives us the inventions and Silicon Valley and when you say system you you mean the the sort of environment we've curated to allow those kinds of things the entrepreneurial Spirit like you know in the 1970s when when computers are being invented basically only in the United States and a very specific area that's",
      "start": 7439.08
    },
    {
      "text": "curated to allow those kinds of things the entrepreneurial Spirit like you know in the 1970s when when computers are being invented basically only in the United States and a very specific area that's not a coincidence you know what I mean like that's not a coincidence like that that's because we nurtured that sort of spirit you with the Space Race for instance and all those things these kids grew up with these things they wanted to build computers you know it wasn't like all these countries from all over the world were building all these computers in the 70s it was no it was Apple you know and then it was Microsoft making software and it was IBM you know and Hewlett Packard and Dell and Compaq you know what I mean like and it doesn't mean that there aren't other like countries companies in other countries that were doing that thing I guess the point I'm trying to make is that that entrepreneurial Spirit we should be commended for that because it's made the entire world better think I I",
      "start": 7481.52
    },
    {
      "text": "other countries that were doing that thing I guess the point I'm trying to make is that that entrepreneurial Spirit we should be commended for that because it's made the entire world better think I I think that's that's the other problem is where we have the thing that makes us greatest is also our greatest weakness and that's the thing that's that opens up for so much criticism is that we are super competitive to the point where you know we start going a little bit too far overboard with it and we start abusing the system you know got anything with Wall Street here's my question about all this is the fact that we're saying all this stuff and our spirit and yada y y and that we're the superpower but whenever you bring up the facts of education and reading comprehension and we're always not dead like dead yeah America is never great about that right why is that the case well I think this is what a lot of people ignore I think when they talk about like why don't you have Universal",
      "start": 7521.2
    },
    {
      "text": "not dead like dead yeah America is never great about that right why is that the case well I think this is what a lot of people ignore I think when they talk about like why don't you have Universal Health Care you know it's not hard why don't you care for more people why don't you it's because there are 315 million people inates we got a big country you know there aren't 10 million people here there aren't 15 or 5050 or 100 million people there are 315 million people in the United States so like there's a you know in Middle there's a there's normal like smart intelligent do you know people that can do on the bottom there are people that can't and on the people there there the top there are people that really Excel and advance but like those statistics are mixed together you know our education system sucks there's no doubt about it but it has produced I'm being ironic I'm not trying to be factious about ourselves Like It produced People Like Us that are intelligent normal and have jobs",
      "start": 7556.68
    },
    {
      "text": "system sucks there's no doubt about it but it has produced I'm being ironic I'm not trying to be factious about ourselves Like It produced People Like Us that are intelligent normal and have jobs and went to college and did all these things like that's normal America you know and I think we have this stigma of being stupid but the things we give the world fly in the face of that stupidity sure because the we live in San Francisco right above basically the Bastion the hot bed of all sorts of tech inventions yeah that happen nowhere else in in the world Four Square yeah Four Square you know like a company like you know it's not to say that there aren't tech companies in the rest of the world it's just to say like you won't find a stretch from San Francisco more yeah with more of that so what what's up with Japan like I say that what's up like I don't know what the **** I'm talking about Japan awesome that's what's up no but I feel like like all this Tech and invention stuff I Japan had",
      "start": 7597.96
    },
    {
      "text": "what's up with Japan like I say that what's up like I don't know what the **** I'm talking about Japan awesome that's what's up no but I feel like like all this Tech and invention stuff I Japan had that inventions electronic stuff I think Japan I don't think America at all well yeah Japan no I mean Japan has its own thing going on Japan has a vibrant not so much anymore but tech company Korea South Korea has a very vibrant tech company or tech tech sector uh Japan itself I don't think evolved quickly enough because Japan is very much about especially in business about honor and about you know we threw that out the window a long time ago America Wolf of Wall Street in theaters now oh God it's so good you know like for instance the thing I was thinking about and I've talked about it with Greg before is like one of the most symbolic things I ever saw out of Japan from business was when PlayStation Network went down and uh in uh in the United States something like that went down there'd",
      "start": 7640.08
    },
    {
      "text": "before is like one of the most symbolic things I ever saw out of Japan from business was when PlayStation Network went down and uh in uh in the United States something like that went down there'd be a press conference and there would be press releases and all this kind of stuff in Japan Kaz Hirai and the rest of the Sony Executives got on the stage and bowed for 60 seconds or something like that you know yeah that's it you know like they talk too there was I mean there were video that's what they got they got on stage that was their first thing they did first thing they did they got on stage and just bowed and just camera flashes going on because they were ashamed you know yeah business is different there it was personal you know yeah so us we wouldn't do any make Goods we wouldn't do it we we just have a conference apologize like through you know eyes that didn't really give it we've let down our consumers and we want to make sure it never happens again sorry about that and then we'd",
      "start": 7681.04
    },
    {
      "text": "we just have a conference apologize like through you know eyes that didn't really give it we've let down our consumers and we want to make sure it never happens again sorry about that and then we'd find somehow some way we'd try to find a way to make that better us and and there's something to be said about the way they did that I mean I I have so much respect for Japanese culture and the way they they do business in Japan and how it's like you know you're a life r at a company and and they respect you and they respect your family and they respect the product I uh in the United States still a faster little different than that's about money and and that's not right and that's not wrong but that's it's about money in the United States no it's always about money and but that's why you know so that's just the way it is so anyway that's just that's just how I I want to talk a little bit about American exceptionalism because I like this is a good topic something I think is really",
      "start": 7719.72
    },
    {
      "text": "you know so that's just the way it is so anyway that's just that's just how I I want to talk a little bit about American exceptionalism because I like this is a good topic something I think is really interesting and I I feel like you know I understand like I love country like Canada right I love Canada a LS and not only because of hockey like I love hockey I love but I love Canada I love maple syrup too your mic back I love red and white and and I love and I love Canada like like I like going there I used to play hockey there when I was younger and and I enjoy you played hockey in Canada yeah in Quebec cool that's cool and like the it's cool I've never played hockey have you played hockey and Quebec Quebec and hockey no uh okay no but it always really soccer in Riverside California I played that in Costa Rica once a so soccer yeah I was on the Olympic team no I've never played soccer in my life you kidding this the great Costa Ric Olympics I'm sorry continue no I was just gonna say",
      "start": 7753.24
    },
    {
      "text": "that in Costa Rica once a so soccer yeah I was on the Olympic team no I've never played soccer in my life you kidding this the great Costa Ric Olympics I'm sorry continue no I was just gonna say like I great Costa Ric Olympics 1988 but uh we uh but we I feel like when we go to Canada or Canadians like you know some people talk very disparagingly about about the United States even in Canada and I'm like we're Kindred like yeah we're like I love your country as get to us can you're basically the United States Canada is like the little brother that does better at everything that we kind of resent a little bit in my opinion they're like the little brother they're slightly shorter better looking and they just do things a little bit more efficiently than we do and we're just like God damn it why couldn't we have been a little brother that's my opinion on Canada okay fair enough I think I think I mean everyone I've met from Canada is just so even keill and cool yeah Canadians are very cool",
      "start": 7791.64
    },
    {
      "text": "couldn't we have been a little brother that's my opinion on Canada okay fair enough I think I think I mean everyone I've met from Canada is just so even keill and cool yeah Canadians are very cool and they just love their country and there they don't have to they don't feel the need to constantly vly offend like defend it like we do in America we're like they're not of under attack they're under attack in factious ways sometimes make fun of them yeah because you always poke fun of the guys that have their shit together right but like but I poke fun of him look at him he's L all look at his hair it's perfect oh man I look beautiful and I got a girlfriend I'm every good I spent time in Aus the Canada this table I enjoyed barbecue I'm not the Canada you the Canada thisable I don't want to be Canada but yeah that's how I feel about exceptional so I think we I think we deserve in Warren and earn more respect and doesn't mean you have to like us doesn't mean you have to like what we do",
      "start": 7838.28
    },
    {
      "text": "be Canada but yeah that's how I feel about exceptional so I think we I think we deserve in Warren and earn more respect and doesn't mean you have to like us doesn't mean you have to like what we do you have to kind of acknowledge what we've done I think it's one of those things where I don't know that you can over generalize it too much I think we do I hope that we do more good for the world than we do bad we absolutely do just the very invention of the medicines we made or the computers we've invented or all those things like the thing that I think you get hung up on right when you're talking about American exceptions more America in general right is the fact that all the stuff we're hanging our hats on all these amazing things the founding fathers Republic Mayfl all that stuff computers even to an extent right feel like they happened forever ago and now you talk about Obama and Bush and then like Clinton you know he unemployment was super down yet Y national debt and stuff but since",
      "start": 7872.76
    },
    {
      "text": "even to an extent right feel like they happened forever ago and now you talk about Obama and Bush and then like Clinton you know he unemployment was super down yet Y national debt and stuff but since then right like it seems like there's always negative news coming out of us and I think that's one of the reasons it's easy to hate on us right yeah I think Iraq brought a lot of bad feelings to the for for rightful reasons I we were absolutely wrong to go you know I think Europeans were actually you know England helped us and stuff but most Europeans were right about being opposed to that War I agree I I think there's political reasons to not like us I'm just saying on practical reasons like America and Europeans or Chinese people or Japanese people or Koreans or Africans or whatever very similar to each other in many respects you know share the same goals of wanting to make a better life for their families and they enjoy their friends they enjoy their families they love their kids they",
      "start": 7906.32
    },
    {
      "text": "to each other in many respects you know share the same goals of wanting to make a better life for their families and they enjoy their friends they enjoy their families they love their kids they work you know they do all those kinds of things like we're not so different after all but I feel like there has to be like some sort of s like respect like I said of the system and I'm not saying the government I'm not saying any of those things just whatever it is here that allowed us to do what we've done in such a short amount of time to become so iconic it's not an accident and like so and that's that's American that is divine intervention either it's not like Divine Providence no it's just that it's just that our Founders stumbled on something that was not stumbled upon by anyone else you know yeah and has been off mimic since um but I think that the you know the system kind of speaks ourselves especially in the 20th century you know yeah all the great things we did in the 20th century",
      "start": 7944.4
    },
    {
      "text": "yeah and has been off mimic since um but I think that the you know the system kind of speaks ourselves especially in the 20th century you know yeah all the great things we did in the 20th century getting involved in wars that some we shouldn't have got involved in a lot we really helped save you know the system Around the World As We Know when we fought the Nazis and the Japanese for instance others we were boondoggles like Korea and Vietnam there are reasons to not like us you know we use Napalm in Vietnam we use nuclear bombs in Japan like there there are things that we're much maligned for but I feel like people ignore the positive that we've fed the you know fed the hungry give money to poor countries you know send our you know doctors over to other countries to take care I me honestly the reason people think that though is because those things are so easily dismissed like you don't really see the effects of those cuz longterm right you feed the hung that takes a long time to",
      "start": 7983.48
    },
    {
      "text": "the reason people think that though is because those things are so easily dismissed like you don't really see the effects of those cuz longterm right you feed the hung that takes a long time to affect change whereas you drop a nuclear bomb on something that's an instantaneous reaction that's an instantaneous negative effect that ripples throughout the world and it's so easy it's always easier to to look at the negative right it's always easier to just to spot out something that someone did wrong than right you know it's like they have this old saying that if you're in production talking about going back to post-production we come full circle now that as an editor if you've done your job right no one ever notices but if you do it wrong yeah you get pointed out right so and like like the Long Snapper mhm the only time you ever hear about a Long Snapper on a football team is when he **** up if you that I forget who it was there was some famous Long Snapper who **** up and that was",
      "start": 8024.28
    },
    {
      "text": "Long Snapper mhm the only time you ever hear about a Long Snapper on a football team is when he **** up if you that I forget who it was there was some famous Long Snapper who **** up and that was his quote that I remember on like some retrospective right of like I never wanted people to know my name because if they knew my name that meant I **** up screwed up yeah yeah it's true this is all crazy to me it's a good episode yeah this good this is a great episode ladies and gentlemen thank you so much for joining us this is The GameOverGreggy Show this is what we do every Friday if you go to Bandcamp which is of course GameOverGreggy.bandcamp.com or Monday if you go to GameOverGreggy.com we get together four best friends and talk about whatever comes to our head so we have four topics and then there's a lot of lot of asides in there a lot of a lot of threads we chased to the end of the blanket yeah speed of that during this I had a random thought isn't it weird that dinosaurs were a",
      "start": 8059.16
    },
    {
      "text": "then there's a lot of lot of asides in there a lot of a lot of threads we chased to the end of the blanket yeah speed of that during this I had a random thought isn't it weird that dinosaurs were a real thing yeah they sound like Bullit weird yeah they sound like Monsters do you want to know what something is weirder is that Evangelical Christians that believe in creationism suggest that dinosaurs are only 5,000 years old I thought they I thought they said they never existed or they just don't believe Evolution side by side oh okay okay so **** sleep on that Tim be great Tim like I'm I'm a creationist Tim Tim would legitimately you would be the first person in line for Jurassic Park if it were a real thing I think uh maybe not the first I have let's just end the show ladies and gentlemen thank you so much for watching this episode of The GameOverGreggy Show of course we've gone through four topics many more we'd like to know what you think let us know in the comments then make sure",
      "start": 8097.4
    },
    {
      "text": "thank you so much for watching this episode of the GameOverGreggy Show. Of course, we've gone through four topics, many more. We'd like to know what you think. Let us know in the comments. Then make sure you come back everyday to GameOverGreggy.com for a nerdy conversation and until next time, have a conversational day. America, **** yeah. Tim Allen, the most American American, you know. You did, we didn't do it in one of them people. Miss yeah, people got pissed. People yelled at us. No, in one episode we didn't do the like, where was the Tim Allen grunt? Awesome. So there you go, you're welcome. Oh yeah, we got to get Tee out on this show. Oh man, sure that would be amazing.",
      "start": 8144.2
    }
  ]
}
