{
    "id": 20,
    "video_id": "sLs7Za_Rlck",
    "show_name": "A Conversation With Colin",
    "hosts": [
        "Greg Miller",
        "Andrew Goldfarb",
        "Colin Moriarty",
        "Ryan Clements"
    ],
    "title": "I Hate Mustard: A Conversation with Colin",
    "description": "Colin HATES mustard. Why? Let's find out.\n\nSUBSCRIBE/LIKE/SHARE\n\nThe AWESOME animation is the work of Pandamusk. SUBSCRIBE TO HIM: http://www.youtube.com/pandamusk\n\nThanks to http://www.ign.com for allowing us to use Podcast Beyond audio. You should listen to Podcast Beyond each and every week: http://www.ign.com/articles/2012/10/02/podcast-beyond-xcom-enemy-unknown-looks-dope\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nLeave your suggestions for future conversations in the comments below.\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp",
    "published_at": 1349374594,
    "duration": 173,
    "transcript_chunks": [
        {
            "text": "I sometimes tell people at restaurants that I'm allergic to it to make sure that I'm not getting around that I don't want mustard on anything because like I could I could taste like I could taste a molecule of it. Yeah. Like it smells awful. Like I can't deal with mustard, man. I can't deal with it. Colin Moriarty. Least food you can't stand. Mustard. Least favorite food you can't stand. Mustard. That's like a condiment all the way. It's funny. Oh, I hate mustard. Colin is a fan of mayo to the ends of the earth. And I think you like ketchup, too. I love ketchup. Yeah. You love ketchup with your fries, with your burgers, all these things. With his rice. Oh yeah. How was your rice? Don't give away my secrets. To me, there's no condiment more American than traditional yellow mustard. Oh god, I hate hot dogs. What? Is it just the taste? Like the tartness of it? Hate hate mustard. Like I know. I know. We've talked about it. I mean, didn't you freak out",
            "start": 0.16
        },
        {
            "text": "I Hate Mustard: A Conversation with Colin\nyellow mustard. Oh god, I hate hot dog. What? Is it just the taste? Like the tartness of it? Hate hate mustard. Like I know. I know. We've talked about it. I mean, didn't you freak out too if you saw it or something? Yeah. Like was like near anything? When I went to the airport with you, I got a turkey sandwich. I was like really self-conscious about putting mustard on cuz I didn't want to upset you. I did it like under my hand. Do you Now see the thing is I know plenty of people myself included who are averse to other kinds of mustard like Dijon and peppercorn and all this crazy Yeah. Daikon mustard. Yeah. That kind. So I understand this but to me yellow mustard that's you can't beat it. Oh my god. I just want to I just want to suplex Greg over this table right now just thinking about yellow mustard. That would be impressive. I'll tell you I'll tell you right now the story. Did I tell you the story about about McDonald's in Connecticut when I was a kid? This is when I realized I",
            "start": 39.92
        },
        {
            "text": "I Hate Mustard: A Conversation with Colin\nyellow mustard. That would be impressive. I'll tell you I'll tell you right now the story. Did I tell you the story about about McDonald's in Connecticut when I was a kid? This is when I realized I hated mustard. We went to McDonald's cuz I love McDonald's so much. I was with my mom. I was like seven or eight, maybe. Maybe maybe not even. And uh and you know, all right, so the thing that people don't know, and this is 100% true. This is 100% true. People from downstate in New York can attest to this. They do not put mustard on their burgers in New York City or on Long Island or any of those places in McDonald's or Burger King or Wendy's anywhere. They do not do it. They **** do not do it. And when I when I tell people when I tell people that they're like, \"No, that's **** They don't.\" No, I grew up and lived there my entire life. They don't do it. And when I go home and order to McDonald's, I don't have to like give them a special order. They just do it the right way. So, being",
            "start": 81.52
        },
        {
            "text": "No, I grew up and lived there my entire life. They don't do it. And when I go home and order at McDonald's, I don't have to give them a special order. They just do it the right way. So, being a young kid, I didn't know that they put mustard on burgers at other places like they do almost everywhere else. And uh so I went to McDonald's in Connecticut with my mom in Hartford and uh the waiter the whale the waiter and uh they I got this burger and I bit into it and I was like nauseous at the table all grossed out and I opened it up and there's like mustard on And I'm like, \"Mom, there's mustard on my burger.\" And she's like, \"It's not mustard. It's like butter or something like that.\" It's like, \"It's not\" And like did she know or was she I don't think she I don't think she I don't know cuz she was confused about it, too. And uh yeah, so like that was like ever since then like I mustard makes me cringe. Like I hate I hate it.",
            "start": 116.32
        }
    ]
}