{
    "id": 13026,
    "video_id": "_g1ZqdwhjjU",
    "show_name": "Highlights",
    "hosts": [
        "Greg Miller",
        "Mike Howard",
        "Ryan Payton",
        "Ryan Darcey"
    ],
    "title": "The Story Behind Arkham Shadow Early Release",
    "description": "Batman Arkham Shadow was released early on Meta Quest by accident, here's the story.\n\nFrom our #sponsored stream: https://www.youtube.com/watch?v=xjRmXePXU5k\n  \nFOLLOW US ON EVERYWHERE!\n---------------------------------------------------  \nYouTube: Youtube.com/KindaFunnyGames\nTwitch: https://www.twitch.tv/kindafunnygames\nPatreon: https://www.patreon.com/kindafunny/\nTwitter: https://twitter.com/KindaFunnyVids\nInstagram: https://www.instagram.com/kindafunnyvids/\nTikTok:  https://www.tiktok.com/@kindafunnygames?lang=en",
    "published_at": 1729640457,
    "duration": 64,
    "transcript_chunks": [
        {
            "text": "the public reaction has been great you gave them a special gift You released the game early yesterday yeah entirely intentional right uh things are frantic cuz we're going to be launching at 10: a.m. Pacific the next day lining up the the Embargo for the reviews The Players like can't wait for it to launch it's been so cool and all that accompanied stress you have right before you launch start getting these DMS on Discord from the Batman Arkham videos Community has been wonderful and they said people started sending me screenshots of the main menu like how the heck are they seeing the main menu yeah the unfortunate circumstance on the back end one way that players can redeem the game in advance just end up working somehow some way that a subset of players were able to download the game early obviously Panic ensues and so yeah that we decided um because only a subset we're going to be playing we're like fine we just flip the switch and we feel really bad for all the all the reviewers",
            "start": 0.12
        },
        {
            "text": "obviously Panic ensues and so yeah that we decided um because only a subset we're going to be playing we're like fine we just flip the switch and we feel really bad for all the all the reviewers and the media that got Early Access and they're preparing their their reviews to go live this morning and everything just went up right so the players were really happy and the again the public reception seems really strong right now so yeah I think all that ends well but it's been a very frantic last 18 hours or so",
            "start": 36.92
        }
    ]
}