{
    "id": 2651,
    "video_id": "XfQhNEW9-rg",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Remembering Blockbuster Video - The GameOverGreggy Show Ep. 181 (Pt. 2)",
    "description": "We reminisce about Blockbuster video.\n\nThanks to Dollar Shave Club for sponsoring this episode. Go to DollarShaveClub.com/Greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1495522801,
    "duration": 1387,
    "transcript_chunks": [
        {
            "text": "There's no reason to use a cheap disposable razor or pay a ridiculously high price for gimmicks. Make the smarter choice and join Dollar Shave Club, like my boy Tim did. Have you seen him lately? No more neck beard; it's beautiful. Get a close shave every time, and you can't beat the convenience or the price. If you haven't tried Dollar Shave Club yet, you're missing out. It's an amazing shave at an affordable price. There's no smarter choice on the market, and right now they're giving away a one-month trial of any of their razors for $1 with free shipping, and after that it's just a few bucks a month. There's no long-term commitment, no hidden fees, and you can cancel whenever you want. Get your dollar trial at DollarShaveClub.com/Greggy. That's DollarShaveClub.com/Greggy. All right, next topic: Blockbuster. Blockbuster. So here's the thing I want to talk about Blockbuster Video and whatever little mom and pop shops you got going around Andy and I were doing a gamescast exclusive for last month where we",
            "start": 0.08
        },
        {
            "text": "Blockbuster so here's the thing I want to talk about Blockbuster Video and whatever little mom and pop shops you got going around Andy and I were doing a GamesCast exclusive for last month where we started talking about Ultimate Video which is uh this Mom and Pop video rental house that existed back in the 90s and you had a whole bunch back in wherever the **** you were from Texas yeah uh like Vulcan Video that's an awesome well I'm not from Austin but I've the first that's the first place I went to to rent movies yeah when I moved to Austin in '98 yeah I love are they still around I don't know yeah Vulcan won some kind of Jimmy Kimmel commercial contest where Jimmy Kimmel and Matthew McConaughey produced a commercial for Video it's when he came down for like South by Southwest last year okay but I think they were on little tiny little uh was by the university tiny little video shop and then as everything else in that home video industry is kind of shrunk shrunk shrunk it's like the Hipster film spot",
            "start": 53.4
        },
        {
            "text": "they were at a little tiny uh video shop by the university and then as everything else in that home video industry is kind of shrunk shrunk shrunk it's like the Hipster film spot where like all the film buffs are there talking about pontificating about obscure movies that nobody gives a **** about like and they write the notes on like they have little white stickers they put them on the DVD covers and it's like Bill or whatever Bill's like I this movie fell apart halfway through can't stand it but it does feature young Natalie Portman or something like that yeah see that's cool I like that there's still like that culture of people that are just like I just want to keep like this sharing kind of going on and spreading it around it's like real life internet yeah in a way internet commenters making five bucks this movie or whatever just angry people on the internet yeah yeah it's just weird that like the home video thing was so important to culture for so long",
            "start": 92.96
        },
        {
            "text": "Way internet commenters making five bucks this movie or whatever, just angry people on the internet. Yeah, yeah, it's just weird that like the home video thing was so important to culture for so long, and then it's just gone, you know? And like, that happened in the blink of an eye - like within 3 years, Hollywood Video, Blockbuster, all those Mainline ones just like fell off the face of the Earth. And it was because of things like Netflix coming out, changing their model, even like Netflix going from being the rental service where they would send you DVDs to streaming - that just killed it entirely. Yeah, and I'm especially bummed by that because video store clerk was like my backup job, if you know what I mean. Either everything fell apart and I couldn't get a job doing something else, or if I made enough money where I didn't give a ****, I would love to do that - just hang out in the freaking video store all day long and talk about movies. That kid calls you over and over, \"Hey...\"",
            "start": 130.2
        },
        {
            "text": "if I made enough money where I didn't give a **** I would love to do that like just hang out freaking video store all day long and talk about movies that **** kid call you over and over hey uh is Godzilla on VHS in yet that was me I did that you wanted the Matthew Brock 1998 Godzilla movie and it just kept **** selling out that was they had those like weird tier plans like this was like before crowdfunding in Patreon or whatever but it'd be like all right new releases cost $5 and you get them for two days but then old movies we'll practically give them you get three for $5 and it's just like but that really made you think when you were a little kid you're just like all right like Rush Hour 2 do I want to see Rush Hour 2 or am I going to watch these things that have boobs on the the cover you know what I mean the amount of times I was in a Blockbuster just walking around and like I'd see like an attractive girl on a the box of a movie that I didn't know",
            "start": 175.36
        },
        {
            "text": "have boobs on the cover you know what I mean the amount of times I was in a Blockbuster just walking around and like I'd see like an attractive girl on the box of a movie that I didn't know about and I felt so wrong looking at it and I'm like but I couldn't so I kept walking back everybody knows I have everyone here's looking at me and they know but I'm looking at the back of this Idle Hands box and oh my God good choice holy **** Jessica Alba entire movie franchises that came into existence solely for the box art to be displayed at Blockbuster like those Jack Frost movies with the killer snowman they had holographic covers you remember where didn't Jack Frost start as a family movie and it didn't turn into I think those are two separate things that's the Michael Keaton family movie but am I wrong was there ever and halfway through the movie Michael Keaton's like **** you if I remember correctly there the horror franchise started with two no get out of here I think it branched off",
            "start": 215.64
        },
        {
            "text": "I was there ever and halfway through the movie Michael Keaton's like \"**** you\" if I remember correctly, there the horror franchise started with two no get out of here I think it branched off like this franchise got way cooler always under the understanding that it was just like a going off the popularity of the I love stuff like that you learn as a kid that's completely wrong but you're like I swear to true no the first movie was I don't think it was called Jack Frost like obviously he was Jack no but he was a **** snowman though Jack Frost too, Revenge of the Mutant Killer Snowman yeah you don't remember this I totally do with the holographic thing no I remember it too but no but Jack Frost the first one isn't the one with Michael Keaton it's a different movie yeah what's okay so there's this he's a snowman this is not Michael Keaton's movie that is not Michael Ke it's not, I was wrong yeah five years after Batman I think he would have been you know still times have been tough on",
            "start": 261.36
        },
        {
            "text": "this he's a snowman this is not Michael Keaton's movie that is not Michael Keaton it's not  I was wrong yeah five years after Batman I think he would have been you know still times have been tough on Keaton oh man but that was the thing though was like I would rent movies like that just because they looked cool exactly right mhm an entire like and then they would become enormously successful at home video and they would make two or three more you know and these huge franchises were built just because of cool box art yeah you know Good box arts rad yeah I remember renting a game called Road Runner's Death Valley Rally, no that's not it,  Running Wild was a racing game where you're were just animals that ran and I was like this looks cool this now was it cool no not not even a bit but I rented it cuz it looked awesome the animals look cool that's why I rented Mega Man Soccer cuz the box I'm like like oh **** that's Mega Man playing soccer I am so sold on this **** Mega Man Soccer was a thing on the Super Nintendo",
            "start": 305.72
        },
        {
            "text": "That's why I rented Mega Man Soccer, 'cause the box I'm like, \"Oh, that's Mega Man playing soccer.\" I am so sold on this Mega Man Soccer. Mega Man Soccer was a thing on the Super Nintendo. League football, yeah, dude. There's so much stuff. I didn't play Mega Man Soccer. There was a soccer game on the original Xbox, I freaking loved it. It was a Sega game, and it was uh, soccer. I'll look it up, but it was it's so great. It was backwards compatible on the 360; it was so fantastic. But uh, yes, so with the thing about Blockbusters is not just movies. We would rent video games, and you could rent a video game console there. Oh yeah, PlayStation 2. Yeah, there was an ice storm in Austin. It's the reason I got back into console gaming 'cause I was exclusively PC gaming. I grew up playing uh, Commodore 64, 'cause I'm old as ****. And then I played PC games. I had an Atari when I was a kid; never really got into Nintendo. I hated the square controller, but I hated it. And then there was an ice storm in Austin.",
            "start": 356.4
        },
        {
            "text": "I'm old as **** and then I played PC games. I had an Atari when I was a kid, never really got into Nintendo - I hated the square controller but I hated it. And then there was an ice storm in Austin; I was living with Matt, and we were iced in, and everything was canceled, so we just walked down to Blockbuster and rented a Nintendo 64, played Mario 64, and just fell in love, dude - it was magical, like a great night. It was awesome. Was F? I Stay playing list; I can go way deeper on this weekend if you want to. We got a case of Cokes, which when you're in college is like the cokes in the bottles not the cans so it's serious. And we put it out on the porch 'cause it was an ice storm and everything kind of froze just a little bit, so you had to Coke, and it was like you could feel the flakes of ice. You get to the ice level in Mario 64, like World 3, and you're just like this feels so real - console gaming man. Also I was in college, so I could drink 12 Cokes in a weekend that was okay yeah yeah well",
            "start": 394.52
        },
        {
            "text": "you get to the ice level in Mario 64 like World 3 and you're just like this feels so real console gaming man also I was in college so I could drink 12 Cokes in a weekend that was okay yeah yeah well I was I drank 18 Matt only got six of them oh my God yeah man Blockbuster is it just going to a blockbuster is so much fun like I feel like me and Kevin still to this day do a similar thing where we'll go to Best Buy just to walk around and like just to like look at the different stuff like we're not going to buy and if we're going to we're going to go to Amazon but like just looking at the Blu-rays just seeing what's out there looking at the game section and it's like I know every game that's out like why am I doing this there just something about holding the box for a second picking up and looking at it it's just like the smell of the store something about it man like people just get annoying you constantly of like hey do you need help it's like no I'll ask you if I need help oh like",
            "start": 438.52
        },
        {
            "text": "at it, it's just like the smell of the store something about it man, like people just get annoying you constantly, of like hey do you need help? It's like no, I'll ask you if I need help. Oh, like oh man, I don't speak that well Spanish but they see and like can I get Andy, how my name tag is yeah, yeah hated that crap. I always thought Best Buy had a terrible model to me now where they let people sell things in the store like they'll have a booth that has their selling like some internet service, I don't know if they do that in California but but in Texas you walk in there's a guy going hey what's your home internet like? It's like dude really, I'm in a store already and you're going to sell me a different thing while I'm in the store it's just too much. Clear Wireless I'm on the other end of that though because so we have to deal with Comcast here which I'm sure you have some shitty internet in Austin we have some crappy internet and it's horrible, worst in the world but see I",
            "start": 479.92
        },
        {
            "text": "that though because so we have to deal with Comcast here which I'm sure you have some shitty internet in Austin we have some **** shitty internet and it's **** horrible worst in the world but see I would CH that I would give anything I would have given anything to get Time Warner back after I left my old apartment and had to switch to AT&T and it was going out four times a day a **** nightmare oh my God I'm getting like heated right now okay keep going sorry shout out to the dude though because in Best Buy there'd be a little Comcast kiosk and as annoying as that is walking in when you're not looking for Comcast **** being able to skip the phone situation and just walk in and talk to someone what like like an account service thing I mean they're they're trying to sell you the service so if you're talking to him and you're just like so here's the deal I want a better deal they make like commission too so they want to sell you the service so he they they'd always be like all",
            "start": 518.28
        },
        {
            "text": "so if you're talking to him and you're just like so here's the deal I want a better deal they make like commission too so they want to sell you the service so he they they'd always be like all right so we're going to pretend you've never had Comcast before cuz this deal happens right now and if you sign up for two years then we you get the NFL package all that **** you ratting this guy out he doesn't work there anymore I miss him I miss him too man I wish he was still there from St 1193 just yeah exactly you walk in and he would just be like like he recognized me and Kevin after a while cuz we just kept sending people to him and like getting deal those $100 Kickbacks and **** we'd just come back every year cuz once their like main deals up it's like oh but then you have to come back and we'd be like hey dude what can you do and you'd always get us the better deal and you didn't need to wait and listen to the **** **** phone and they get disconnected they say they're going to",
            "start": 564.04
        },
        {
            "text": "and we'd be like, \"Hey, dude, what can you do?\" And you'd always get us the better deal, and you didn't need to wait and listen to the **phone** ring and they get disconnected; they say they're going to call you back but they never call you back. Oh, shout out to Lisa. We'll just go, dude. We had such different experiences with this – it's crazy. Yeah, I was like, \"Get the **away from me.\" No, the worst thing about working at Best Buy was hearing the DirecTV guy have to approach people and feeling awkward as hell because I wouldn't... I hated hearing him get rejected. Yeah, and and I and I it put me in such an awkward spot to the point where when I would hear him say \"Oh, God.\" A few of them had like their own catchphrases; they had their own like way that they approached these things, right? So they'd see a customer and and one of the guys would be like, \"Hey, what's up? Have you heard about the great deal DirecTV is having today?\" And I was just like, \"Oh, God,\" I have to walk away and like talk to",
            "start": 605.04
        },
        {
            "text": "Had a customer, and one of the guys would be like, \"Hey, what's up? Have you heard about the great deal DirectTV is having today?\" And I'd just be like, \"Oh God, I have to walk away and talk to myself so I can avoid hearing this guy get rejected. It was awful.\" Which is like it does feel a little too sales-y when you're in a retail store and you've already made the choice of, \"Look, I can get this on Amazon and get it tomorrow,\" but I'm going into Best Buy because you're here and I'll get it today. And then they just make you deal with so much stuff like they want your phone number, everything... It's like, just make it easy, guys! This is a retail store. I liked the employees that weren't good at what they did and just kind of sat back and didn't really try. Then why'd you quit? \"Roo\" - your teeth are our specialty. You're right, you're right. Sega Soccer Slam was the game I was talking about earlier... Sega.",
            "start": 642.88
        },
        {
            "text": "of like sat back and just didn't really well then why'd you quit? That's our specialty. You're right, you're right. Sega Soccer Slam - by the way, it was the game I was talking about earlier. Sega Soccer, Sega Soccer Slam. Great game, tons of personality. Awesome. You just did your Rooster Teeth podcast, um... The new thing that you've been doing recently is like when Bernie forgets about what topic he was trying to talk about, you'll revisit it. Yes, I love that. Yeah, that's such a great little thing. Feel crazy, you're like, \"Oh man, I was in the store and this guy said this crazy thing,\" and like... I was in the store and it tells a story about... melted ice cream or something, and then you lose that thing. But we actually have a Twitter tradition where we say, \"Tell us what we... what we stop talking about.\" Like, what did we forget to talk about? We could not do that on our show with Nick; that'd be impossible. Nick is the type of person that just tells a story and then we'll",
            "start": 677.48
        },
        {
            "text": "what we stop talking about like what did we forget to talk about we could not do that on our show with Nick that' be impossible Nick is the type of person that just is telling a story and then we'll think of something else and then forget about both of those things and just kind of just start then he'll just make start making a joke and reference an 80s movie then he'll start talking about some other 80s movie at the end of the day he's talking about 89 Batman and it always comes back to 89 Batman or Die Hard or die hard all trains end at the same station yeah and then at some point he'll reference the fact that Joe Pesci was an 86-year-old man in in sync when the band started it's like why do we always say that like how he's a 70-year-old man 70 I don't even remember he Nick changes the number every time God BL Nick Blockbuster man I just going back to it like I was talking about how I just walk around in the best bu like Kevin I would like in our younger days go to a blockbuster",
            "start": 723.28
        },
        {
            "text": "number every time God BL Nick Blockbuster man I just going back to it like I was talking about how I just walk around in the best buy like Kevin I would like in our younger days go to a blockbuster without even intentions of renting just like kind of walk around and like yeah get educated it was like walking into what we now think of as Wikipedia you know you kind of go down that rabbit hole of like oh I wonder what other or IMDb right it's just like it's fun to kind of do that whole uh Spider Web of figuring things out but like I'd love just kind of like look and what's the history of drama movies you know just kind of walk through and read the back of boxes yeah and we would walk to the Best Buy no the Blockbuster from our house and that was like what half a mile away which for us at the time seemed like nothing no it seemed like so much yeah like do you want to go I was like no but all right yeah it got me thinking about it though like it got me thinking about the way media is as a",
            "start": 764.12
        },
        {
            "text": "Time seemed like nothing, no it seemed like so much yeah like do you want to go I was like no but alright yeah it got me thinking about it though like it got me thinking about the way media is as a business because when I was a kid and I'd go to Blockbuster and you'd see the wall of new releases with all the tapes facing out um and you could see clearly this movie is four shelves units and this movie is half of a shelf unit and why does this movie have 100 copies in stock and that one only has 10 and even as a kid I was thinking well if Blockbuster would put 100 copies of that movie it would probably do a lot better like I I didn't realize I was thinking about what marketing is and everything else but having done some retail stuff with Red vs Blue DVDs all that stuff is paid for like the posters on the wall and things like that how many movies they place everything all of that is a very intense negotiation and sometimes a lot of money like a poster on the wall",
            "start": 806.24
        },
        {
            "text": "that stuff is paid for, like the posters on the wall, and things like that. How many movies they place everything all of that is a very intense negotiation, and sometimes a lot of money - like a poster on a wall in a retail shop if it goes into every store across the nation can sometimes be just I mean it advertises what's in their store but they still make you pay for it sometimes it's a tune of like $80 to $100,000 to put up a poster in the store, you know, across 2,000 stores depending on the chain. But it's something you don't think about then they take that out of your cost of whatever they sell it for and what they're going to pay you - it's all this like cycle. I mean, I'm sure it paid off at the time obviously it doesn't now because they don't exist but uh it's the same idea of like when you go into a record store or even GameStops now do it where it's just like whatever's on the front of the aisle - that is prime real estate 'cause people are seeing that.",
            "start": 853.76
        },
        {
            "text": "like when you go into like a record store and like it's or even GameStops now do it where it's just like whatever's on the front of the aisle like that is prime real estate cuz people are seeing that and they're like oh what's this why does it have its own little kind of this thing matters showcase yeah I think if you go to Every the thing that pisses me about GameStop I haven't I hadn't been in one in forever until I needed a Nintendo Switch case and uh I guess that's partly my fault because I hadn't been in one forever but their wall has empty boxes of all of the stuff that they sell so of course I walk in and I'm expecting like oh here's this empty box I'll take this item which you probably have somewhere in the back like no we're sold out of everything yeah like well why do you have it why is it there I just want to talk to somebody yeah well I mean it's it's interesting seeing GameStop go through what Blockbuster went through which is now you go to a GameStop and it's more like a Hot",
            "start": 894.68
        },
        {
            "text": "why is it there I just want to talk to somebody yeah well I mean it's it's interesting seeing GameStop go through what Blockbuster went through which is now you go to a GameStop and it's more a Hot Topic than it is a game store where it's just Funko Pops and clothing items and just bags and a bunch of that crap keychains a bunch of like just cheap stuff right and then you look over at a a Blockbuster and I remember there was a turning point where they also their magazine section got a lot bigger than uh used to be and there they had a lot more playable game demo kiosks and there was a lot more just gimmicky stuff um and then it started there was like clothing racks and I'm like okay this is uh the beginning of the end and then they opened up the Game Zone or whatever the hell and it was just like half the Blockbuster ended up being a a video game store Hollywood Video had that thing as well where Hollywood opened up Game Crazy with a store within the store and where it was like it",
            "start": 938.72
        },
        {
            "text": "just like half the Blockbuster ended up being a video game store Hollywood Video had that thing as well where Hollywood opened up Game Crazy with a store within the store and where it was like it didn't have the same color scheme it was green colored and it had uh like it had its own off yeah it was caged off it had like these things like actually caged off our Hollywood videos they did that too and they would sometimes close before the regular store open which was infuriating it's like I I want to play Mortal Kombat whatever like let me let me go in there yeah wouldn't do it that's it's so crazy to think about because like even the game stores those things like explode there was a bazillion of them and then all of a sudden it stopped like I remember growing up there was Funko Land GameStop and and we didn't have bages here but uh EB was so big in San Francisco that the Embarcadero store I've told the story before is uh was three stories in the Embarcadero Center each story",
            "start": 979.56
        },
        {
            "text": "GameStop and we didn't have many Blockbuster stores here but uh EB was so big in San Francisco that the Embarcadero store I've told the story before is uh was three stories in the Embarcadero Center each story was a different console so it was it was Nintendo um at the time SEGA, Sony, and then Sega and PC shared one but it was just like that's crazy it was crazy and then at uh the mall near a cemetery there was an EB and a GameStop and eventually GameStop closed so there were two GameStops across the street there were three more GameStops and I'm like we don't need this many damn GameStops no yeah it's great and then now they're gone now they're gone where you camp out for the midnight releases yeah man what a great time that was like waiting outside of a Hollywood Video for Halo 2 release was just like oh my God those are the days man it's how like I think like geek culture lends itself to line culture as well because the first movies that people would line up for",
            "start": 1022.92
        },
        {
            "text": "the Halo 2 release was just like oh my God those are the days man it's how I think like geek culture lends itself to line culture as well because the first movies that people would line up for were Star Wars sequels they camped out for that kind of stuff Greg and Tim camped out like four days for episode one one oh man oops the um but yeah I've always I've lived through that retraction twice in a way because arcades were the same way oh yeah in the 80s I mean arcades were everywhere and if you went into a convenience store every convenience store every gas station uh every bar everything had at least two or three video game cabinets in it and that just kind of stopped you know we do a um a series of documentaries at RT and one of the ones I've been pushing for a while is something that not a lot of people know about which is there was a massive crash in the video game industry in 1982 like after Pac-Man Fever and all that the Atari was huge and everything",
            "start": 1073.36
        },
        {
            "text": "Is something that not a lot of people know about, which is there was a massive crash in the video game industry in 1982, like after Pac-Man fever and all that. The Atari was huge, and everything. The reason why there was nothing between the Atari and the Nintendo was because in 1982 ET (the Extra-Terrestrial) and Pac-Man - Atari doesn't get enough credit for how much damage it did. Uh, it fell apart so quickly that the video game industry declined by 95% in one year. It just went; it just dropped off a cliff, and it was over. It was like, \"Oh, that was a cool trend, that video games thing - that was okay,\" and then it just went away until Nintendo released the NES and just lit everything back on fire. And now it just seems like it would be impossible for the video game industry to go away. Yeah, no, I mean, and even the arcade industry; it's crazy to see like so yeah, it did the same thing there, and then it came back with the Street Fighters and the you know, the fighting game community and all that stuff in the",
            "start": 1120.08
        },
        {
            "text": "the arcade industry it's crazy to see like so yeah it did the same thing there and then it came back with the Street Fighter and the you know the fighting game community and all that stuff in the the '90s and the arcades were huge and then DDR like lit that **** on fire again and arcades were the hotness for like two years and then just tanked and now there's just things like Dave & Buster's that are like bringing it back in a different way all ticket stuff and it's all ticket based and it's all app games like phone games just giant it's just a giant touchscreen of Flappy Bird and it's like holy crap Crossy Road you can get it you know better than any game I ever played on mobile device you know it's just it's perfect it can't compete with that yeah you know they had to do stuff like DDR and you know those jet ski games or whatever cuz they were controllers You couldn't possibly have at home well that's the crazy thing about arcades is DDR happened and around the time same time there",
            "start": 1163.16
        },
        {
            "text": "and you know those jet ski games or whatever cuz they were controllers You couldn't possibly have at home well that's the crazy thing about arcades is DDR happened and around the same time there was Tony Hawk's Pro Skater so you're on the skateboard and then there was the punching game where there's like the actual punching bag in front of you and you would punch it and it's like it's crazy cuz you can actually see all right cool then Guitar Hero came out and DDR wasn't home and uh the Wii happened with motion control and all that gimmicky stuff went out the window because people got sick of it so it went from being the thing people would pay a dollar for instead of 25 cents to being the thing that everyone was just like I have enough stuff in my closet I don't want it anymore yeah and that happened over the course of fell off so freaking fast and they started coming back yeah it I mean it was huge it was every convention you went to they had tournaments with you know",
            "start": 1203.28
        },
        {
            "text": "yeah and that happened over the course of fell off so freaking fast and they started coming back yeah it I mean it was huge it was every convention you went to they had tournaments with you know Guitar Hero and Rock Band and then just overnight gone I mean Freddie Wong is a perfect example of somebody that rode that wave to the sky yeah jumped off in a golden parachute right before it ended and then started a whole new career out of that stuff yeah you wouldn't think a guy would transition from being a world competitive Guitar Hero guitarist to visual effects superstar it's just like what how do those two things cross over see the thing is he did such a good job even at the time of like he knew that like the Guitar Hero thing could only last for so long but even then he was making VFX fueled videos about guitar here like there was that guy that did uh he did some video that was like playing through the fire and flames on Expert and that video went viral and then Freddie one of",
            "start": 1239.0
        },
        {
            "text": "fueled videos about guitar here like there was that guy that did uh he did some video that was like playing \"Through the Fire and Flames\" on Expert and that video went viral and then Freddy one of Freddy's First videos was him being like Oh you think that's cool and he kind of played a character like Andy plays his 30-second review character Freddy played this character of him being a rock God on the plastic guitar and he did a video of him on a bike um playing uh while he was riding his bike perating uh through \"Through the Fire and Flames\" and then there's a bunch of VFX effects on top of it and that went even more viral and that kind of like launched his whole thing on just know you're huge when South Park parodied yeah like and that's what what happened with Guitar Hero and oh man like those Guitar Hero games were such a huge part of my growing up in high school like just playing with friends and just trying to be good and be like man I'm way",
            "start": 1283.8
        },
        {
            "text": "what happened with Guitar Hero and oh man like those Guitar Hero was such a huge part of my growing up in high school like just playing with friends and just trying to be good and be like man I'm way better at an actual guitar than this **** but yeah **** arcade games at home were a thing that I never had the luxury of having like DDR the **** the only thing I ever got close to was the Nintendo Olympics **** oh the track having an actual arcade cabinet at home no no no like like just anything gimmicky like anything anything yeah anything peripheral based uh the track and field thing was like the closest thing that I ever experienced in a home and it wasn't my home yeah yeah you don't think had anything like that either I always thanks for watching this episode of The GameOverGreggy Show click here to subscribe click here to support us on Patreon click here to see other episodes click here to go into a portal to take you to Kinda Funny Games I'm Greg kinda I kinda made",
            "start": 1321.2
        },
        {
            "text": "Show click here to subscribe click here to support us on Patreon click here to see other episodes click here to go into a portal to take you to Kinda Funny Games I'm Greg Kinda I kind of made all this happen but I mean not in like conceited way I'm just saying if I didn't want to do the GameOverGreggy show ever then it would have never happened I hope Kevin isn't mad at me are you mad at me Kevin",
            "start": 1368.6
        }
    ]
}