{
    "id": 1257,
    "video_id": "mL5iq-XpQ_c",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Haircuts - The GameOverGreggy Show Ep. 96 (Pt. 4)",
    "description": "Tim Gettys doesn't like getting haircuts, but loves haircuts.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1444287601,
    "duration": 1495,
    "transcript_chunks": [
        {
            "text": "Today's sponsor is Loot Crate. For less than $20 a month, Loot Crate gives the geek in you a special treat every month. Loot Crate is a subscription box service with more than $40 worth of gamer, geek, and pop culture gear, collectibles, apparel, comics, etc. delivered to your mailbox every month. This month's theme is time. And quite appropriately, we're celebrating the 30th anniversary of Back to the Future in the month and year Marty McFly travels to in Back to the Future 2, along with the timeless appeal of Bill and Ted's excellent adventure and the timey wimy charm of Doctor Who. You have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate. And when the cutoff happens, that's it. It's over. So go to loot crate.com/kindfunny and enter the code kind of funny to save $3 on your new subscription today. [Music] Tim, these are Tim levels. Are they good levels? No. You have like a whole There's like a whole second head growing out the back of your turn turn",
            "start": 0.08
        },
        {
            "text": "to save $3 on your new subscription today. [Music] Tim, these are Tim levels. Are they good levels? No. You have like a whole There's like a whole second head growing out the back of your turn turn profile. There it is. Look at that. What do you What is growing out the back there? Oh, I like that. It's like when you It's like bun. I look like a man blew it brains out. No, what it looks What it looks like is when we're on We're on to the new topic, by the way, Kevin. We're on the topic right now. It looks All right, hold on. That's the end of this topic because I'm gonna continue the conversation in the next one. So, come to the next topic. Okay, great. It looks like when you pick up a potato that looks fine and then you turn the potato around and it's grown the roots and it's all gross on the back. I hate those potatoes. You know what I'm saying? Yeah. So, my topic today is haircuts and hairstyles. Timely. Yeah. Oh, man. How good was that? I really good. That's why I did the I did the",
            "start": 36.32
        },
        {
            "text": "the back. I hate those potatoes. You know what I'm saying? Yeah. So, my topic today is haircuts and hairstyles. Timely. Yeah. Oh, man. How good was that? I really good. That's why I did the I did the audible and Kevin over there. That's I want to know what Colin's been looking up for the last 45 minutes. Oh god, what's going on? It's either food or a woman. Was it I know I'm wrong about Putin not being a part of the Soviet Union. You don't have to correct me on that. No, I wasn't. I wasn't. The wall came down. Well, we'll say Well, this will show when this will show when this was actually recorded, but I uh I just got a message. Curb your enthusiasm. Season 9 and a movie apparently both. A damn. Shut up. All right. I can deal with that. Well, you should curb your enthusiasm for that during this this show. I just I just wanted to make the joke. Haircuts. Haircuts. I hate them. Me, too. Maybe we have talked about this. Have we talked about this topic before? We've talked about how",
            "start": 88.48
        },
        {
            "text": "during this this show. I just I just wanted to make the joke. Haircuts. Haircuts. I hate them. Me, too. Maybe we have talked about this. Have we talked about this topic before? We've talked about how you've talked about haircuts any like anyone. He doesn't like haircuts, massages. Really? He doesn't like anything that doesn't involve uh sitting on a couch and playing Metal Gear. Okay, I mean that's fair enough. Why don't you don't like hair? I thought you liked hair. Oh, you don't like Why don't you I don't like the process. I like the getting I like the after I like looking like I got a haircut. I don't like getting it though. Why? Oh, it's just too What's wrong with it? It's just I don't know. It takes time and it's just like That's why I hate them. Yeah, it takes time. You have to go places. You have to do things. You have to make you have to wait in line for it. You have to make sure that uh they're open at a time that you're going and all that stuff. It's just Yeah, it's a bunch",
            "start": 131.28
        },
        {
            "text": "You have to do things. You have to make you have to wait in line for it. You have to make sure that uh they're open at a time that you're going and all that stuff. It's just Yeah, it's a bunch of stuff you don't want to do. And um you guys have such good hair. If I had your hair, your collective hair. Everyone's got great hair. No, but we could all Kevin, I'm a man of I'm I'm really grounded. I'm a grounded individual. I don't have an ego. I don't think of myself as one of the most amazing people on the internet. Your ego. But I do know this. Out of all out of the six of us sitting in this room, I am the person who has the least amount when it's going to the hair. You've got a great hairline, you got a great hairline, you got a good hairline, you got a great hairline, you got this, you get the punk cut, the punk cut, which means that when you go to like South America, girls are like, \"Oh, where's he from?\" You say American like, \"Oh, you must be a surfer.\" And then they have sex with",
            "start": 166.32
        },
        {
            "text": "the punk cut, the punk cut, which means that when you go to like South America, girls are like, \"Oh, where's he from?\" You say American like, \"Oh, you must be a surfer.\" And then they have sex with you. Yeah. Right. Doesn't happen to me. That's science. That doesn't happen there. But I like So if I had Tim's hair, for instance, this amazing Not right now bun thing. No, I mean it does look like Put the hat back on. I feel like I'm like you got touching myself with my left hand. It just doesn't feel bad. Put the Pikachu condom back on your head, please. Thank you very much. Um I would love it because you could go in and get all like any cool hairstyle you want and you just show him a picture of Malcolm and go, I want his current hairstyle. I want this. No, I usually do JT though. That's a real story. So, when I first started getting my haircut where it was uh you know, like I have it now because for a long time I just shaved it style the Don Draper and um so when I was going to do this,",
            "start": 205.28
        },
        {
            "text": "story. So, when I first started getting my haircut where it was uh you know, like I have it now because for a long time I just shaved it style the Don Draper and um so when I was going to do this, I went into the the place and I grew it out for a while and for a while it was just a mishmash of of nothingness. You know, let's take a step back. We're going back to back to the roots here, right? Grew up I didn't even mean to do that. Uh got them all cut. Anyway, so when I was younger, I had like the Beatles cut, just like the the bowl. Kind of like a bowl. Yeah. But it was like all the way down. I had long hair. I had like very long hair and it would like down so it would cover my my beautiful eyes. No, you can't do that. There was a big difference between the the ladies uh pre and post long hair. So I had the long hair. I didn't think to do the man bun thing back when I was in sixth grade. Nobody thought it because it's terrible. Yeah. Stop doing it, Darren Brazil. It's dumb. Then then",
            "start": 242.08
        },
        {
            "text": "hair. So I had the long hair. I didn't think to do the man bun thing back when I was in sixth grade. Nobody thought it because it's terrible. Yeah. Stop doing it, Darren Brazil. It's dumb. Then then eventually all of my friends were Chinese and they all had spiky hair cuz that was just what they all they all did and that was a thing. And so I was like I'm going to do that too. So I spiked my hair like they did and I had spike hair spiky hair for a while but it didn't look like theirs because I am not Chinese. So their hair worked that way. My hair just kind of got really weird and curly in some points. So in some places it would curl and like some places it would spike. It was just all over the place. Yeah. It didn't look bad. It just wasn't like it wasn't great. Then eventually I I moved past that a bit and I was like I'm I'm going to start shaving my head. And also that was definitely a thing of I don't like getting haircuts. Like I'm tired of going to this I'm just going to cut my",
            "start": 283.84
        },
        {
            "text": "past that a bit and I was like I'm I'm going to start shaving my head. And also that was definitely a thing of I don't like getting haircuts. Like I'm tired of going to this I'm just going to cut my own hair. Sounds like someone brother do it. Yeah, it's I mean it's good though. It's it makes sense. You can just shave that Then you have your your mom or your brother or Kevin come in with the the razors. Hey, can you get my back? And he's like got your back. Got your back, bro. And I look in the mirror like why the you go that high? And it's just like oh you know all about that. These things happen, man. I almost killed a man the other week. So, yeah. So, so that goes down, right? But then eventually I grew out of that and I was like, I want to get some hair. So, I grew out some hair. There was a weird transition period as there often is. Then I went in I I realized I had enough hair. I'm like, I can do this. Go to the barber and I'm like I pull up picture of Justin Timberlake show.",
            "start": 326.24
        },
        {
            "text": "was a weird transition period as there often is. Then I went in I I realized I had enough hair. I'm like, I can do this. Go to the barber and I'm like I pull up picture of Justin Timberlake show. I'm like, I want that. And he goes, okay, okay. Then it starts doing stuff. I'm not one for talking at the uh I hate talking. I hate the small places. See, this is why I think Nick likes it. Nick just likes to He likes to smoo. It doesn't matter. I like to be one of the girls. I mean, that totally makes sense. I mean, I like to be one of the girls, too, but like not with these girls, right? That's probably the best thing that's happened since moving to San Francisco and getting your haircut at all these weird random places is that is often their English is not their first language. So, they don't want to talk to you either. So, I just chill out, get a haircut, get out. Cuz like back in, you know, the suburbs of Chicago, we went to Wayne and Wayne ran this barber shop forever. And Wayne's a",
            "start": 357.84
        },
        {
            "text": "want to talk to you either. So, I just chill out, get a haircut, get out. Cuz like back in, you know, the suburbs of Chicago, we went to Wayne and Wayne ran this barber shop forever. And Wayne's a nice man and my dad loved talking. But then I'm sitting there and either if it's Wayne or his partner who eventually was his son or whatever cutting my hair. We're just struggling for small talk here. What do you think of the Cubs this season? I don't know. I don't know why. Oh, you're a Socks fan. No. I just don't care. Just don't see. It's even weirder nowadays though when there is the the random times where they start talking because they always go for Oh, so what do you do? Oh jeez. Uh oh. Uh say Uber driver garbage man. I talk on the internet about stuff. There's like literally no way to describe to someone cutting my hair what I do. Um, but then eventually I reached a point where I had enough experience with the haircuts that I kind of knew what I wanted. Then I had pictures of myself.",
            "start": 395.52
        },
        {
            "text": "to someone cutting my hair what I do. Um, but then eventually I reached a point where I had enough experience with the haircuts that I kind of knew what I wanted. Then I had pictures of myself. So now I just show a picture of myself. Oh wow. Brilliant. I want that. And then that's still they never they never get it perfect cuz they always like they they're like let's try this. It's like let's not. Uh but they always do. Things get weird. But now I know the secret. The secret to the Tim Getty's haircut is one on the sides. And they're always going to go are you sure one? That's really short. And I go I know. Yes. Yes. but long on the top. And they're going to go, \"Dude, I mean, I I want like, no, no, no. I want it long on the top.\" And then they they always trim. They always make it clean. Yeah. But they leave it long. And that's what gives you that nice little Yeah. You got the You got the body. You got the You got the volume. Yeah. Hair is power. The fact that I go I go to the same",
            "start": 432.48
        },
        {
            "text": "Yeah. But they leave it long. And that's what gives you that nice little Yeah. You got the You got the body. You got the You got the volume. Yeah. Hair is power. The fact that I go I go to the same place every time, but I get a different person every time now. So, every time I walk in, I just go, \"Yeah, somewhere between short and medium on the sides and enough to part. I like having my part. That's what I want.\" And they go in there and do Yours look good. You get good haircuts. Thank you. Well, that's just cuz I have I have the I have the starter haircut style of it. You know what I mean? It's just like it's parted. It's easy. Don't do whatever you want. Sometimes if you go too short on size, whatever. It'll grow back in and be fine. See, what's what's funny is you could do the cut. You could do the cut that's very much popular right now, which is the barberh shop cut. They call it the barber cut, which is the Don Draper. It's popularized. Isn't that what I have? Kind of. It is. But",
            "start": 472.48
        },
        {
            "text": "could do the cut that's very much popular right now, which is the barberh shop cut. They call it the barber cut, which is the Don Draper. It's popularized. Isn't that what I have? Kind of. It is. But you don't go You could go way shorter on the sides, like similar to what me and Tim are doing, and fade it up into that barber cut cuz you have the hairline for it. And you did it. Someone they did it to you almost by accident. I think two or three haircuts ago. Yeah. And you came in, it was super short. I thought, \"Oh, great.\" It's slightly more hipster than I think you're you're you're used to. I think it's out of your comfort zone though, a little bit. I mean, it's really like my favorite though. There was a Comic-Con where I needed a haircut really badly and this is actually where I started using Comic- Con. So, this where I started using product in it again cuz I you I used product in high school or whatever and then in college just fell out of it and just wake up and push to the",
            "start": 504.96
        },
        {
            "text": "using Comic- Con. So, this where I started using product in it again cuz I you I used product in high school or whatever and then in college just fell out of it and just wake up and push to the side and go out and I did that for a long time. And then there was a Comic-Con where I walked into a like a fancy salon right in the gas lamp. The guy sat down and the girl was like, \"All right, what do you want?\" I'm like, \"Whatever you want.\" And she was like, \"What? What? What do you mean?\" I'm like, \"Do whatever you think would look good. I don't know. I don't do anything with it ever. Just show me what I should do with it.\" She's like, \"Are are you serious?\" And I was like, \"Yeah, do whatever you want. I'm not going to be mad anyway.\" She's like, \"Okay.\" And then I I was all I was all like, \"Maybe I'll get the same haircut I always get.\" She was like, she wasn't about to do anything crazy. I got a potato head. One thing happens all the time. be hilarious if she was like mohawk and just you",
            "start": 537.12
        },
        {
            "text": "I'll get the same haircut I always get.\" She was like, she wasn't about to do anything crazy. I got a potato head. One thing happens all the time. be hilarious if she was like mohawk and just you just had a mohawk. You're like what? She's like you. She gives you a reverse mohawk so it's like long just nothing. Oh my god. I remember when did you did you did I know you when you rocked a mohawk call? Yeah, I think you did. Dude, that looked dope. Thanks. My mohawk was awesome. It was mohawk was really awesome cuz you could do that too. You could go super short on the sides up to like almost like what you're doing right here, which is almost the the sort of I don't know. What do they call it? I don't It's just like the the hairline, I guess. I don't know. I don't know. I don't know the technical term. It's like it's that it's that cool cut now that like Makammore had. Mhm. Now he's got the year cut. Like he's got the Justin T cut like he did at least in the last video. I haven't seen him",
            "start": 567.68
        },
        {
            "text": "term. It's like it's that it's that cool cut now that like Makammore had. Mhm. Now he's got the year cut. Like he's got the Justin T cut like he did at least in the last video. I haven't seen him recently, but he has always been a little bit different because his is like skin bald. No, but not not recently. Like recently he's doing the part. Before it used to do shaved on the sides and then sllicked back like the Brad Pitt from Fury, which is also awesome. He's always had that, but it's always been a little bit it's been not sllicked directly back like Brad Pitt. It's always been kind of a bit more decide. Yeah. Yeah. Yeah. It's good. Get a good look, Kevin. See, what I like about the haircuts, we've talked about this a little bit before, but what you got to get into is you got to find someone that you're comfortable around for one and someone who will work with you and and do what you got to do what Tim does. By the way, you're not the only person that does it. My wife does it all",
            "start": 605.28
        },
        {
            "text": "someone that you're comfortable around for one and someone who will work with you and and do what you got to do what Tim does. By the way, you're not the only person that does it. My wife does it all the time. When she wanted to cut her hair, what's called the blunt cut, which is like just blunt, short, like I think it's a lob, a long bob, I guess what they call it. She brought in five or six pictures of celebrities that had it and was like, I want I want it to look exactly like this. Yeah. And then like cross reference and was like, I cut a little bit here. Sometimes I cut it too high in the back and all It was a whole ring. She had to go back was a thing. So that's not bad to have a reference point. What I like about it is I go in there and I'm like I kind of get the same haircut every time because there's not much you can do with my hair. So I keep it short. Keep it short and kind of look. You've been changing it up though a little bit. I'm trying to keep trying to go short on the",
            "start": 640.56
        },
        {
            "text": "time because there's not much you can do with my hair. So I keep it short. Keep it short and kind of look. You've been changing it up though a little bit. I'm trying to keep trying to go short on the sides. You get more of a fade going on. Trying to do a little more of a fade. Um just cuz I think the the more it starts to go the more I'm just like let's crop it in and then about 10 years from now it'll just be shave it. Like you leave it a little little long on top in the shave and just like skin and then beard just beard to the point where I can just you know when you're on the plane you your head starts to go down you're like no I can't do that. I want to be able to rest my head on my beard. Okay permanent neck brace then there. Yeah be amazing. Jacob, tell me about your haircut. I because we don't know you pre this haircut. Yeah. How long have you had this? Just today. No that's why I made it my topic. Well it I got one in advance because I wanted it to like grow out to a little",
            "start": 671.84
        },
        {
            "text": "we don't know you pre this haircut. Yeah. How long have you had this? Just today. No that's why I made it my topic. Well it I got one in advance because I wanted it to like grow out to a little bit. I was like, \"God, cuz I don't like it when it's like freshly cut and it didn't grow out properly.\" I was like, \"Ah, I'm going to have to do something about this.\" This is I'm going to be in a video seen by dozens of people because last time when you made the video for us, you were wearing like a really cool ass be. That's a really funny That's a funny story. Uh that I made that when I got back from India and when I was in in India, I had like I had my hair grown out, but then I like I was checked into a hostel and like the guy that ran it, he's like, \"Hey, do you want to be in a Bollywood movie?\" I was like, \"Yeah, yeah. I want to be in a Bollywood movie.\" And so he like hooked me up with his agent friend and I showed up. He like I hopped in this tuk tuk and he just kind of drove me down",
            "start": 703.36
        },
        {
            "text": "I was like, \"Yeah, yeah. I want to be in a Bollywood movie.\" And so he like hooked me up with his agent friend and I showed up. He like I hopped in this tuk tuk and he just kind of drove me down to like this little studio in in Mumbai and I get out and they're like okay so we're not making a movie. We're doing a men's hair loss commercial so we're going to have to shave your head. It's like oh okay well I don't know how to get back to where I was so I guess this is happening. So and they're like don't don't worry we'll give you a great stylish haircut. It turned out like they like just would kind of like slowly shaved away my hair to like just like like it was like pat my my hair looked like a dog that had been run over by like a lawn mower. It was terrible. But eventually they just got so gruffy. I don't think it looked like that. It was bad. It was No, I have pictures. I'll show it to you. It's bad. But yeah, like eventually eventually they're just like, \"Well, here's we're going to",
            "start": 739.36
        },
        {
            "text": "gruffy. I don't think it looked like that. It was bad. It was No, I have pictures. I'll show it to you. It's bad. But yeah, like eventually eventually they're just like, \"Well, here's we're going to give you the stylish haircut now.\" They just took like a beard trimmer and just like shaved my head with it. I was like, \"Thanks, guys.\" Yeah, that's good. But yeah, I made 50 bucks to be in a men's hair loss commercial in India. Have you seen I haven't, but I'm sure more people have seen that than they'll see this. So uh so basically you got you got paid 50 bucks to shape her head. Yeah, that's not bad. Well, it was the worst production. He survived for like weeks on that. So, like I showed up from like it was like from 1 p.m. to 1:00 a.m. and it was just like the longest process you would have it was. Yeah. Seeing how uh I've never been part of a production process, but I'm sure it's not nearly this bad is like surprised. 12 hour day is not uncommon if you're shooting a commercial, but",
            "start": 773.12
        },
        {
            "text": "it was. Yeah. Seeing how uh I've never been part of a production process, but I'm sure it's not nearly this bad is like surprised. 12 hour day is not uncommon if you're shooting a commercial, but they usually don't start at 100 p.m. Yeah. and go to 1:00 a.m. You usually want to start a little early in the morning. Anytime, man. Yeah, guess so. It's crazy. But yeah, that was funny. But yeah, that's why I had to have to dance. Yeah. I wanted to dance. That would have been funny. Yeah. Like one of these crazy little music numbers. Like, hey, Bollywood Bollywood films are so crazy. They're crazy. Nick once directed a Bollywood. I directed a Bollywood spoof. Yeah. At We did the April Fool's uh Bollywood uh Halo Bollywood. Halo Bollywood. The fact that you directed that makes it so much better than it is. You can see it now, can't you? You can see I Oh, yeah. You're like, \"This all makes sense.\" And there's a behind the scenes video, too. You should definitely watch it. It's Nick talking",
            "start": 809.04
        },
        {
            "text": "than it is. You can see it now, can't you? You can see I Oh, yeah. You're like, \"This all makes sense.\" And there's a behind the scenes video, too. You should definitely watch it. It's Nick talking about making it. Hey, I didn't want to do that video so badly. I didn't want to do that. friends did it too. Yeah, I know. You can see who wanted to make the video happened. Um, no, it made sense. We should have done something like that, but it was a poor man. It was It was a bad roll out of how all that stuff should have. That was our like attempt at having a sort of plan. Yeah. It didn't work out. It was pretend guys. I got it. It was pre-tim. Although, to be fair, the video went on to do Oh, it did great. Millions of views. Yeah. Good job. Largely because we got bungeeed on top of it. But, uh, what I'm what I think you guys are missing with the haircut is the best part. Okay. Right. You go to a stylist that's good-looking. She leans you back in the chair and she spends like 5 10 minutes",
            "start": 847.2
        },
        {
            "text": "what I'm what I think you guys are missing with the haircut is the best part. Okay. Right. You go to a stylist that's good-looking. She leans you back in the chair and she spends like 5 10 minutes just massaging your head. Right. Right. Right. Right. And I'm not saying this is a sexual thing. It can be if you want it to be if that's what you're into. Mhm. But it's a relaxing thing. Right. They don't talk to you during it. It's just warm just warm waters on your head and you're just cozy and it's like being swaddled up in a mansized baby blanket. None of this sounds good, man. The head massage sounds awesome. Cuz here's my problem. Like a big issue I have with haircuts is I don't know when to close my eyes. I don't know when to open it because they say I'll close your eyes but they don't say open your eyes, you know? I feel like I've almost nodded off in so many haircuts. You guys need more direction and stuff and like the idea of the closing my eyes massaging me. It's just like I feel",
            "start": 882.4
        },
        {
            "text": "open your eyes, you know? I feel like I've almost nodded off in so many haircuts. You guys need more direction and stuff and like the idea of the closing my eyes massaging me. It's just like I feel like I might just eventually just never wake up again. There was that one time I went and got a haircut and it was when we were still at IGN. It was down at the original Palace Barber Shop down there and uh had a nice little uh woman doing my hair who didn't speak English well at all. And so she's just cut doing her thing, cutting up my hair, and at the end she's like, \"All right.\" And I'm like, \"Yeah, it looks great. Thank you.\" And she goes, \"Do you want a massage?\" And I was like, but she said like, \"Do you want?\" And I was like, \"What?\" And she's like, \"Do you want a massage?\" And I was like, \"Oh.\" And she did this. And I was like, \"Oh, sure.\" She, if you're listening, she shook her hands back and forth like, \"Okay, sure.\" And I was all stressed out because of work and this and probably",
            "start": 920.8
        },
        {
            "text": "\"Oh.\" And she did this. And I was like, \"Oh, sure.\" She, if you're listening, she shook her hands back and forth like, \"Okay, sure.\" And I was all stressed out because of work and this and probably kind of funny at the time, even though it wasn't kind of funny. And I'm like all like I'm in my You're lost in your head when you don't have to talk to anybody, which is great, but you're thinking of all the millions of things you have to do. And D. And she brought out this basically a belt sander and because I thought she's gonna rub because I've had like the stylist before who rubs your, you know, I'm like and she brought out a belt sander and I was like, \"Okay.\" And like I leaned down in the chair a bit and she just put this thing on and it was I saw God. I I I almost cried cuz it was it felt so good. And it was like after stressing out for so long in this thing, this motherfucker's on here and it was like it hit the spot, you know, like my legs kicking and I was like, \"Yes, this I I can",
            "start": 953.76
        },
        {
            "text": "so good. And it was like after stressing out for so long in this thing, this motherfucker's on here and it was like it hit the spot, you know, like my legs kicking and I was like, \"Yes, this I I can I buy this belt sander off of you and have Christine do this to me every day cuz it was heavenly. It was awesome. And I've never gotten it again. No, I've never seen that woman again.\" I'm not even sure if she was really a barber. Yeah, she just Next time you go into anal like a Chinese restaurant, maybe don't ask for a haircut. Uh that's that's but that's what I'm talking about. It's that it's that it's that feeling of someone doing something for you that's not and it's different like you say you know you were going to bring that thing home for Christina to use but it wouldn't be the same feeling. Right. Cuz then you're you're putting out your significant other to come do this nice thing for me. Right. Right. Right. I'm not paying her. Right. Whereas you go and that it's that person's job",
            "start": 988.64
        },
        {
            "text": "Right. Cuz then you're you're putting out your significant other to come do this nice thing for me. Right. Right. Right. I'm not paying her. Right. Whereas you go and that it's that person's job and if you go to the right person, they have such respect for their craft that they're going to do that extra little cool thing for you that you're like, \"Oh man, this feels good. I'm being pampered. Someone is treating me well and it's not I'm not coercing my wife to give me a back rub for 5 seconds.\" And she does this thing. You give really good back rubs. I give great back rubs, which is like quit proquo D. What up? My wife has never listened to one episode of this podcast. She will not. Next time everybody sees her, one of the kind of funny things they'll let her know. No, but that's the thing about Yeah. with the haircuts is like I I I would love to find a stylist that I enjoy who does the rigomearroll of washing my hair and massaging my head, but in reality, I know that I have a",
            "start": 1033.84
        },
        {
            "text": "thing about Yeah. with the haircuts is like I I I would love to find a stylist that I enjoy who does the rigomearroll of washing my hair and massaging my head, but in reality, I know that I have a 10-minute gap between the next video and there's a haircut place right there and I get to go in, walk in, they don't talk to me, and I walk out. You know what I mean? Yeah. I mean, even the massage on the way to the It's on the way to the PO box, which I like. Yeah, that's true. That is good. But that 5 to 10 minute massage, it's another 5 to 10 minutes that Kevin needs to wait for me to finish my haircut so we can go get Chipotle. You know, Kevin, I don't do anything without Kevin. Absolutely. No, no, no, no. Kevin doesn't do anything without you. No. He's the little puppy dog following you around going, \"You want you What do you want to eat tonight? Can we go?\" Cuz you're always like, \"I can't tonight.\" And he's I always end up doing it though, like no matter what happens. I'm sure it's",
            "start": 1069.52
        },
        {
            "text": "going, \"You want you What do you want to eat tonight? Can we go?\" Cuz you're always like, \"I can't tonight.\" And he's I always end up doing it though, like no matter what happens. I'm sure it's much better now that your girlfriend's long distance again. Yeah, exactly. So, it's one of those things where with Kevin, I don't do anything without him. So, it's like I can't do anything without him. I think that's the biggest difference. He wants to do things with me, but I can't do things without him. For those of you listening at home, Greg is currently slow jerking. And I'm not going slow enough, but I don't feel I don't feel there's a way to do the slow jerk motion to let people know you're doing the slow jerk motion. I think you're nailing it, Greg. I'm looking now. Now that I'm saying slow jerk and I've derailed the conversation, of course. Well, so to bring it back, so Kevin's haircut experience that I'll speak on because I I've been a part of it for for way way too long is the fact",
            "start": 1105.92
        },
        {
            "text": "jerk and I've derailed the conversation, of course. Well, so to bring it back, so Kevin's haircut experience that I'll speak on because I I've been a part of it for for way way too long is the fact that Kevin's haircut stylist, I don't know. I don't know what you would call her. Haircut lady. Tina. Tina. Her name is Tina. Lovely woman. She She is a lovely woman. And she's been cutting Kevin's hair since he was like nine. And Kevin will not get his haircut unless Tina cuts his damn hair. Yeah. And she's going to retire soon. And Kevin's never going to get his haircut again. and he gets so he's like emotionally attached to this woman. It's like his second mother and I like her so much better. It's just crazy. I remember I remember as a kid when there was a big it was it was it was guilt when I wanted to go to my mom's stylist to get my haircut over Wayne. You know what I mean? Because then and like dad has to explain to Wayne I'm sure nobody cared obviously but Seinfeld episode.",
            "start": 1139.76
        },
        {
            "text": "when I wanted to go to my mom's stylist to get my haircut over Wayne. You know what I mean? Because then and like dad has to explain to Wayne I'm sure nobody cared obviously but Seinfeld episode. Exactly. At the time it feels like a giant betrayal and now that I have no allegiance to anyone. Yeah. I'm a haircut without borders out here. I can just go do whatever I want. I'll remind you that when I I've told this story before that when I from 5 to 18 I went to a I get my haircut on the island by a man named S this Italian man who thought my name was Tommy and like around eight or nine years old we stopped correcting because my my brother especially thought it was the funniest thing ever. So like I was like 16 years old just walking in there and to this man I was Tommy and it was like my dad was in on it. Everyone was in on it. Like yeah all right fine. He's Tommy good. cut his hair. That's so funny. I'm writing that down. Yeah. As potentially an animator. The worst thing for me is that",
            "start": 1179.68
        },
        {
            "text": "was in on it. Everyone was in on it. Like yeah all right fine. He's Tommy good. cut his hair. That's so funny. I'm writing that down. Yeah. As potentially an animator. The worst thing for me is that I I don't have any person I go to. I have a place I go to now cuz I found somewhere that I like. And there's this Yeah. It's a specific Supercuts, though, cuz Super Cuts is not It's not like Starbucks. It's not like you're getting the same thing wherever you go. Yeah. Um, so there's a group of people. I'd say there's like four people that like it cycles through. Three, three or four people that it cycles through. And it's like I don't know if they know who I am. And I'm like I show them a picture every time. So, I'm pretty sure I'm pretty sure Yeah, I know, right? I'm like, cuz there's one picture. I look good. And I'm just like, I don't know if they know me. And it's that same thing where I remember in middle school when you'd have like the lunch card passes that they'd given you. If you",
            "start": 1222.56
        },
        {
            "text": "I look good. And I'm just like, I don't know if they know me. And it's that same thing where I remember in middle school when you'd have like the lunch card passes that they'd given you. If you use you show the card, you get a free lunch or whatever. And I would do it. I'd be like, can I go back and get another lunch? Like, do you think they'll recognize me if I try to use my card again? And I would do it. And sometimes they'd let me go. But I'm like, are they just letting me go or do they recognize me? And it's not until later in life that I'm like, there's only like 60 kids. They know who the I am. They they saw me get my double chocolate milk cuz they know what I'm doing. But I wonder if she knows me. But now the reason that I think she probably does. She doesn't. I don't know. Maybe she does. I hope. I don't know. I'm breaking myself right now. Let's go right before closing too. So they probably I'm definitely at the new place. I don't have a rhythm yet because I've been lucky",
            "start": 1258.64
        },
        {
            "text": "she does. I hope. I don't know. I'm breaking myself right now. Let's go right before closing too. So they probably I'm definitely at the new place. I don't have a rhythm yet because I've been lucky enough a couple times to get this woman who's got to be 46 for and but she the reason I bring up her age is the fact that she dresses like she's 21. Like she's like got this like neon hat and really short skirt. I know who you're talking about. You walk You see her when you pass by. You see her when you pass by and she's cool. I like her, but I I definitely don't have like a a cadence with her. Nor do I know her name. Or should I book ahead? What did you get her? I just walk in. It's just luck of the draw. What am I going to get? I want I want to come with you on your next haircut and I want to describe to them what I want them to give you. I want to do What do you want to do? I want to do I want to do the the barber cut. The same cut that I get cuz I think it'll look cool in your hair. I",
            "start": 1291.12
        },
        {
            "text": "describe to them what I want them to give you. I want to do What do you want to do? I want to do I want to do the the barber cut. The same cut that I get cuz I think it'll look cool in your hair. I want to do like a like a really short on this. So, like a one maybe. Maybe. Yeah, we'll go down one. I have a mole back here. So, we'll go we'll go two. Maybe we'll go a little bit longer than than what I've got. And we'll do really short. And we'll do You had to say the word fade. Fade it up to the top. See, I don't do the fade. You You do have the fade. I have the fade on one side of it. And it's because they like insist on it on the fade. You have the fade on all around. No, I don't think so. Yeah, you do. They just It's very tight. It's a tight fade, but you have the fade. I'm pretty sure I only have it on the side of the part. Take it off. Uh oh. It hurts. It just hurts to look at. cuz it looks the hair thing in the back looks also I don't have a fresh hair the potato thing in the back",
            "start": 1329.6
        },
        {
            "text": "only have it on the side of the part. Take it off. Uh oh. It hurts. It just hurts to look at. cuz it looks the hair thing in the back looks also I don't have a fresh hair the potato thing in the back looks I can see I can see what you're talking about next time he's right it looks like your hair is getting it's brain's blown out it's literally a stop it's like a freeze frame next time you go and don't do the f don't do the part have him just do what he's got which is just short here short here and then the lop over I try to do that they just they just don't do it they think they think you're not going to like it that's see that's when you have to stop doing the super cuts and go to like a stylist and be like I want this really and you have to say you have to use the word dramatic otherwise they'll be like no you're not going to I mean I've already really pushed to get the one because they're always like the one's really short so they might not know me. I'm having this weird crisis",
            "start": 1365.28
        },
        {
            "text": "they'll be like no you're not going to I mean I've already really pushed to get the one because they're always like the one's really short so they might not know me. I'm having this weird crisis right now of whether or not they recognize me cuz like I thought I thought that they didn't but and they complimented me and I was like now I'm realizing they probably do know who I am and it wasn't a compliment because at one point I showed my pictures like oh you look like Justin Timberlake which then now I'm just realizing this might have been the same woman that I showed Justin Timberlake. She's just trying to be nice. Next time you should have a dickpick in there and just show you that one. That's not what I meant. Um, it's very impressive, but it's not what I meant. That's very impressive. Ladies and gentlemen, this has been the Game Over Greggy Show. Each and every week, four, sometimes five best friends gather around this table, each bring a random topic discussion for your amusement.",
            "start": 1402.4
        },
        {
            "text": "and gentlemen, this has been the Game Over Greggy Show. Each and every week, four, sometimes five best friends gather around this table, each bring a random topic discussion for your amusement. If you like that, head over to patreon.com/kindfunny. Toss us a few bucks and you get every episode early. If you have no bucks to toss, no big deal. Head over to youtube.com/kindfunny where we break it up topic by topic. day by day until we post the entire thing on Friday as an MP3 and giant video. Jacob Spellelman, Greg Miller, thank you so much for coming by. Did you have fun? I had fun. Was this worth it? Yeah. Thanks for giving me the opportunity to be here. No problem. Yeah, it's been fun. We've been pimping your Twitter. Is there anything else you need to be pimping? No. But oh, if uh if you do have any questions about travel, though, please feel free to to tweet at me. I mean, it's something I'd like more people to do. So, how many ounces of food can I bring on an airplane? I don't",
            "start": 1438.8
        },
        {
            "text": "you do have any questions about travel, though, please feel free to to tweet at me. I mean, it's something I'd like more people to do. So, how many ounces of food can I bring on an airplane? I don't know. It's three. Yeah, three. You don't know about travel. I I do I do the long the first three words of the Virgin America flight. I don't fly Virgin. Ladies and gentlemen, until next time, it's been our pleasure to serve you. [Music]",
            "start": 1470.72
        }
    ]
}