{
    "id": 1286,
    "video_id": "wakLuq8w_HM",
    "show_name": "Gameplay",
    "hosts": [
        "Colin Moriarty"
    ],
    "title": "Let's Play Tales of Zestiria  - Kinda Funny Plays",
    "description": "Resident Tales fiend Colin jumped into the all-new Tales of Zestiria to give you a taste of PS4's newest JRPG.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1445472248,
    "duration": 2686,
    "transcript_chunks": [
        {
            "text": "Greetings and salutations! Welcome back to Kinda Funny Games. My name is Colin Moriarty. Today, as promised, I'm going to do a nice little long let's play for you of Tales of Zestiria on PlayStation 4. Also available on PlayStation 3. I'm a huge Tales fan. I love this series. It's maybe my favorite continuous Japanese role-playing game series of all time. And Zestiria just came out. And it's available for you to download or go by right now. And I've sat down with the game for just a couple of hours. And, uh, you know, played it a little bit last night. So I'm basically starting off, as you can see here, from a cutscene. After some pretty important stuff happens. And I won't go too far into what has happened. I don't know what is going to be spoiled for me from here on out. But rest assured, I won't spoil the very beginning of the game and how it all starts out for you. But you're kind of progressing with me on your own. Um, uh, on your own accord, I should say. So let's get through the",
            "start": 0.0
        },
        {
            "text": "I won't spoil the very beginning of the game and how it all starts out for you. But you're kind of progressing with me on your own. Um, uh, on your own accord, I should say. So let's get through the cutscene and we'll see what happens next. Alright, so I'm going to gain control here. I've got some stuff here. So, you know, looks like a normal Tales game, as you can see. Character models, pretty much the same as they've been in, like, let's say Tales of Exilia. I actually feel like... I can't say for sure. I felt like earlier in the game, not that I'm showing you, I saw a character model that definitely came from Tales of Exilia. Um, but you can see it's pretty much, you know, as you might expect it. Let's run around and see what we can do here. I'll go back. I like to explore a little bit when I'm playing these games. See if there's anything in here for me to find. Doesn't look like it. Always keeping an eye out for that button prompt to indicate if anything's going on, but this seems",
            "start": 42.0
        },
        {
            "text": "when I'm playing these games. See if there's anything in here for me to find. Doesn't look like it. Always keeping an eye out for that button prompt to indicate if anything's going on, but this seems like this room's pretty empty. So I don't know where the game's going to bring me from here, so let's just, uh, let's go and play. If I hold down R1, it'll tell me what I need to do next. So it says, take a little walk around town, and if I press the, uh, I guess it won't let me because I'm in the middle of a conversation, actually. So this is an interesting new addition, is that when they're talking to each other, you can advance under certain conversations because someone in the room is talking to me. Which is interesting. It's a nice idea. It's a little annoying, too, when I just want to get back to it. You see the little thing keep coming up above me. Alright, we're good now. So let's head out in town. See what happens. Loading, loading, loading. I feel like I'm using one of our 20th",
            "start": 82.0
        },
        {
            "text": "back to it. You see the little thing keep coming up above me. Alright, we're good now. So let's head out in town. See what happens. Loading, loading, loading. I feel like I'm using one of our 20th anniversary PS4s, um, to play here in our studio, and I just don't feel like I remember the load times being this long on my PS4, but that might be made up. So dramatic, Sarai. Mmm, okay. So much malevolence. An incredible, almost absurd amount of malevolence, Sarai. So I guess we have to follow her. Good control. This is, uh, one of the cities that we're in. Still can't look at the map. She's annoying me now. We'll slowly follow her. That was a sharp turn. What if I run ahead of you? Are you mad at me if I do that? No, you're going to see me care. Take your time. Seems like she's going this way, so see if we can do that. Nope. I don't like that somebody has to accompany people and they're so fucking slow, like, hurry up! Why are you walking so slow? Hurry up! So there she is. You'll notice",
            "start": 116.0
        },
        {
            "text": "so see if we can do that. Nope. I don't like that somebody has to accompany people and they're so fucking slow, like, hurry up! Why are you walking so slow? Hurry up! So there she is. You'll notice here, I was here before I opened this treasure chest here. Uh, and talked to this person. Although, there's some different things to say. I still can't open this treasure chest. I don't know what I need to open it. We'll find out later. Oh, man. I'm so sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. Oh, man. What a gorgeous lake. Why do you act like you haven't seen it before? I brought you here earlier. It truly is. But, amidst the spectacular scenery, the town of Lady Lake is being corrupted by malevolence. Yeah, now that I can sense it, I can feel the corruption everywhere. We can't let this go on. It isn't just happening here in Lady Lake, either. It's eating away at the entire world. Mm. Mm-hmm. I've never seen it, but you can feel that this place lacks the",
            "start": 214.0
        },
        {
            "text": "We can't let this go on. It isn't just happening here in Lady Lake, either. It's eating away at the entire world. Mm. Mm-hmm. I've never seen it, but you can feel that this place lacks the blessing of the Seraphim, can you not? The Seraphim in this game are like spiritual kind of creatures. She's a Seraphim, I believe, and the guy to his left, or our right, in the blue tunic, the light blue tunic that's speaking now, is also Seraphim. As opposed to human. Yes, I touched on it before, but now I must clarify to you. The true purpose of the Shepherd. Oh, cutscene. The Shepherds can quell the Hellions, beings who bring chaos to humans and Seraphim alike, with the power of purification. That is the power of the Shepherd. However, that in and of itself is not the Shepherd's duty. What the Shepherd must quell is the source of all malevolence, the being who gives rise to the Hellions. The Lord of Calamity. The Lord of Calamity. Hmm. Hmm. Fair enough. I'm going to start hitting the X button",
            "start": 278.0
        },
        {
            "text": "must quell is the source of all malevolence, the being who gives rise to the Hellions. The Lord of Calamity. The Lord of Calamity. Hmm. Hmm. Fair enough. I'm going to start hitting the X button and kind of get through these after I read it. Weird camera pans again to me. Like everyone will... Ooh, ignore that. I'm doing a Dragon Quest Heroes Let's Play as well, so I was just downloading it on this machine. I will, I will discover all sorts of things. Okay. We're traveling. Alright, let's roll. This thing here I already examined when I was running around earlier, but this thing is a pillar. And when you read them, you can discover things about combat in the game. Once you read it for the first time as well, you will get an AP that can be used, an action point that can be used in combat. This thing over here, glowing, is just an herb. I pick it. This is chamomile. So chamomile boosts focus by two, which affects SC recovery speed. Also restores HP and SC. So you can see some of that as",
            "start": 338.0
        },
        {
            "text": "thing over here, glowing, is just an herb. I pick it. This is chamomile. So chamomile boosts focus by two, which affects SC recovery speed. Also restores HP and SC. So you can see some of that as well in these things. You'll know, like, I can't pick this one because it's not glowing, but maybe next time I come it will be. I don't really know. So let's press the R1 button, return to the inn for dinner. So we just came from the inn. We'll run back and see if we can advance the story so maybe we can explore the rest of this town and get out to the map and show you the combat and maybe progress the story just a little bit more after that. I'll also show you the menus and we'll get into the ins and outs of things as well. Forgive me for skipping over. You can press the X button to get through the text. So it's just easier and quicker for me to read it than it is for it to kind of let it go generally through the voice acting and it will just get us to the combat quicker. So I think that's",
            "start": 476.0
        },
        {
            "text": "the text. So it's just easier and quicker for me to read it than it is for it to kind of let it go generally through the voice acting and it will just get us to the combat quicker. So I think that's probably what you want out there since you know that this Tales game along with other Tales games are very story heavy and will be sitting here forever. So she doesn't want to answer my questions right now but I'm going to go ahead and get started. So let's go ahead and get started. Maybe I'll get answers out of her later. The inn's up here. You can talk to these guys and see if anyone has anything interesting to say. It does look wonderful, doesn't it? Very wonderful indeed. So you can't talk to just anyone, the people with the smiley faces above them as you know if you play Tales games are the ones that actually have something to say to you. And it seems like in my experience playing the game just for a couple of hours and being in another location that it seems to reset what they're",
            "start": 510.0
        },
        {
            "text": "the ones that actually have something to say to you. And it seems like in my experience playing the game just for a couple of hours and being in another location that it seems to reset what they're saying pretty often. So you might want to be thorough if you really care about the story. You definitely get some hints about your surroundings and other things that maybe the story proper hasn't touched on yet. The star above this guy's head means he's the guy that has the next thing to say and if you press the touchpad you can see the map and the star shown there as well. Glad to hear it. What does that mean? My letter. My sword. Bags and... clothes? Ah, perfect timing. Go get changed. You kinda smell. Alright then. Oh my! Not bad. How about it? It looks fantastic. Oh man! The only thing I can think of to tell you is a sincere heartfelt thank you. Though I do think that my true feelings do not come across well. I know that, as the Shepherd, you are the ones you are awake. I would like you",
            "start": 586.0
        },
        {
            "text": "think of to tell you is a sincere heartfelt thank you. Though I do think that my true feelings do not come across well. I know that, as the Shepherd, you are the ones you are awake. I would like you to come and visit me at my home. Sorry if this is a little boring for you right now. Most of the JRPG fans out there I'm sure that are watching this video understand how it goes but you know I'm just jumping into the part of the game that was next so we're just gonna have to stick with the story for now until we can get out there and fight. My, what a kind hearted... Yeah, seriously. I should... Why not do it in person? Good idea. Come back and see us again, kind Shepherd. I'll do that sir. Thank you. You bet I will. Alright, come on. The button thing is a little annoying. So let's see. Let's look at the map. Well actually, give Alisha your thanks is the next thing we have to do and we can do that by going... Look around here. It's totally unclear where we would go from here. Quite so.",
            "start": 718.0
        },
        {
            "text": "look at the map. Well actually, give Alisha your thanks is the next thing we have to do and we can do that by going... Look around here. It's totally unclear where we would go from here. Quite so. Perfect for the journey... I kinda wonder if I can get back out to the field. So I can show you some combat at least. But I doubt it's gonna let me. Oh, I did. Alright, so we're back out in the field. Now the cool thing about Tales of Zestiria compared to, you know, say Tales of Exilia and really a lot of Tales games before that is that it's more wide open and more seamless. So you can see the map here is bigger, but not that much bigger. The thing that you're gonna find out here is that it's just a little more seamless. There are locations I haven't found yet. You can see the question marks here. I came from this far so I've been there already. The S icons mean save point. And of course you can kind of use the right stick to go up and down in terms of elevation. But there's a seamlessness",
            "start": 761.0
        },
        {
            "text": "I came from this far so I've been there already. The S icons mean save point. And of course you can kind of use the right stick to go up and down in terms of elevation. But there's a seamlessness in the map in terms of combat as well. And I don't know if I'm gonna be able to run into any enemies out here. We can try for a minute and see if we can run into any enemies if they'll let me fight. So I can show you exactly what I'm talking about with the combat. If not... Oh, looks like there's an enemy here. Perfect. So you run into enemies just like you would in Tales. This guy sees us so we're gonna get in the fight. And you see that it opens up and immediately into an arena so it doesn't bring you to a static screen like in the old Exilia games. And then again, you're gonna be using a combination of strikes, standard strikes and arts. Arts of course are spells in Tales games. It's a little more complicated than that though. And I'll try to explain it to you as best I can. I'm not too",
            "start": 823.0
        },
        {
            "text": "of strikes, standard strikes and arts. Arts of course are spells in Tales games. It's a little more complicated than that though. And I'll try to explain it to you as best I can. I'm not too savvy with the combat yet either. But the combat definitely has a different feel in Zestiria than it does in Exilia. Which I guess is the closest kind of parallel we have to this game since that was really the last core game in the series. So here as usual you can see your experience, you get your gaul, which is the currency, the time and the grade. And then you can go into the details and see why you got the scores as well. So I went without a KO so that gave me .33 grade. Reduced elemental and species specific damages for .3 and then one without using items which is .06. So a grade of .69 is actually not that good. And here we're getting some new information. So it says Seraphic Arts, characters use Seraphic Arts with the X button, use attacks with greater power and reach then martial or hidden",
            "start": 859.0
        },
        {
            "text": "not that good. And here we're getting some new information. So it says Seraphic Arts, characters use Seraphic Arts with the X button, use attacks with greater power and reach then martial or hidden arts which would be used with the circle button at the cost of longer casting times. By continually holding down the X beyond the necessary casting time you can keep it charged while you use L to switch targets before launching it. So there is a lot, the combat is definitely more complicated than it used to be in other Tales games. And I'm not sure if I like it more or not. I don't know that I do. But I also don't know it well enough yet. Simply giving you some very preliminary impressions and see what these guys have to say. Looks like they're not going to let me pass. And they're dealing with wild animals so they don't want to let me through. We might have to head back into town for now but I wanted to show you kind of what the world looks like. I'm thinking that kind of an overcast sort",
            "start": 907.0
        },
        {
            "text": "wild animals so they don't want to let me through. We might have to head back into town for now but I wanted to show you kind of what the world looks like. I'm thinking that kind of an overcast sort of day. It's a little bit dark around here. But the surroundings are pretty, I'm not blown away by the graphical fidelity of the game. You have to remember that this is really a PS3 game that was just brought to PS4. So I don't know what it looks like on PS3 but I imagine it looks a great deal the way it looks right now on PS4. And I am playing it indeed on PS4. It's just a port that I think is more convenient, especially for Western gamers that have largely moved on. As opposed to the Japanese community that hasn't moved on nearly as much yet from PS3. Let's go in the other direction and see if we can find anything before we go back to town and try to talk to Princess. Up here I can see a snake in the distance. We can try to fight him. I also see a treasure chest that I haven't opened so",
            "start": 951.0
        },
        {
            "text": "if we can find anything before we go back to town and try to talk to Princess. Up here I can see a snake in the distance. We can try to fight him. I also see a treasure chest that I haven't opened so we can go grab that as well. Let's see if we can fight him first. Let's see if we can flank him. Oh no, he sees us. Alright, let's get into it. You can't see which buttons I'm pressing but I'm definitely noticing that the X attacks while strong do take longer to cast. It does appear that your magic is replenished in full at the end of every battle. So you're basically trying to use it just within the battle. You don't have to worry about managing it from battle to battle. I think we'll find out in the next battle we get into. You're also seeing that... Oh, well this is new information so let's get into this first. So, Ray's battle talent. So, Ray is an orthodox sword-wielding fighter. His circle arts are quick so the key to success lies in the stat boosting effects. His X arts are slower",
            "start": 995.0
        },
        {
            "text": "get into this first. So, Ray's battle talent. So, Ray is an orthodox sword-wielding fighter. His circle arts are quick so the key to success lies in the stat boosting effects. His X arts are slower but enemy martial arts won't stagger him when he uses them so full frontal attacks are possible. Our fine shepherd, who can soar it, wields a wide variety of elements so it's handy to confirm the enemy's weakness by holding down the R1 button before charging it and exploiting it mercilessly. And you'll see here at the bottom of the screen when I get rid of this, my proficiency was also increased with a piece of equipment. And I'll explain that to you guys in a minute. Over here, let me grab this treasure chest. And I was right about that. You can see that our health here and our SC, which is the magic points, have been replenished. A soft serve of ice cream and a treasure chest. I'll take it. Alright, well let's go back to town and continue the story. Oh, here. Did I wonder if I got this",
            "start": 1047.0
        },
        {
            "text": "the magic points, have been replenished. A soft serve of ice cream and a treasure chest. I'll take it. Alright, well let's go back to town and continue the story. Oh, here. Did I wonder if I got this one yet? I think I did. Is that a monolith? I don't think I've used this one yet. Changing the control mode to manual on this monolith gives you flexibility to attack from the distance you choose, etc. and so on. And then look, I got an AP point for checking it out. Very cool. So let's head back into town and continue the story. And I'll show you the menus and the equipment screens and the upgrade screens and all that in a moment as well. I guess it couldn't hurt to use the save point here as well. Alright, so let's head back in and see if we can find Alisha, as you can see here. Give Alisha your thanks. Alright, so I don't, it's not clear where I need to go, but my assumption is, outside the aqueduct, I assume I'm going to the Nobles district, so let's head over there. The cool thing",
            "start": 1082.0
        },
        {
            "text": "your thanks. Alright, so I don't, it's not clear where I need to go, but my assumption is, outside the aqueduct, I assume I'm going to the Nobles district, so let's head over there. The cool thing here, you can see popping up the little white bubbles, are people just talking about things as you go, so you don't even have to stop to talk to a lot of people to get some information about what's going on, which I think is pretty neat. You're just overhearing them, not really eavesdropping, but just running by them as you go about your business. I think I'm going in the right way. I think this is, I assume this is where I need to be, but we'll find out. Yep, a star appeared on my HUD, so she's up here. I assume, yep, right over here. Have you need of Lord Alisha? Thanks, I'll see if I can... Seray, you came. Alisha, the shepherd's garb looks wonderful on you. Thank you. Thanks. Some fine lipstick on that pig. Yes, Mikleo, we all know your opinion. What? Pigs are nice. So she, as a normal",
            "start": 1136.0
        },
        {
            "text": "Seray, you came. Alisha, the shepherd's garb looks wonderful on you. Thank you. Thanks. Some fine lipstick on that pig. Yes, Mikleo, we all know your opinion. What? Pigs are nice. So she, as a normal human, cannot see the Seraphim that are around. Right here is a Seraph. His name is Mikleo. Please, find it in your grace to forgive my rudeness up until now, Seraph Mikleo. Rudeness? You've never struck me as rude. He says you've never done anything to offend him. And this here is Lyla. She's the one everyone calls the Lady of the Lake. I truly believe in my heart that you were meant to become the shepherd. Whereas I, I mean all of us here then still not know. That's not quite true. She can't hear you. Seray, try taking Alisha's hand in your own. Huh? Oh, sure. Alisha, give me your hand. Like this? Testing, testing. Check one, check two. Can you hear me? Hello? Doesn't look like it. Hmm. Okay then. Seray. Testing, testing. It's still no good. This time, close your eyes and I'll...",
            "start": 1236.0
        },
        {
            "text": "Like this? Testing, testing. Check one, check two. Can you hear me? Hello? Doesn't look like it. Hmm. Okay then. Seray. Testing, testing. It's still no good. This time, close your eyes and I'll... Alisha? I can hear it. Another woman's voice. Really? Alisha, we Seraphim are able to see right into the very hearts of humans. Remember to show gratitude to all things. No matter the circumstances, never neglect the Seraphim, or your heart shall turn to malevolence and this in turn shall... Fear not Alisha, we have indeed seen your gratitude for ourselves. Seray, one more time. I'm afraid this is the only method we have for now. Interesting method, okay. Hold hands, close eyes, hold breath. I have amassed more experience as both a vessel and a shepherd. I believe such a strict sensory block will not be required. So, does that mean once I do grow stronger as a shepherd, everyone will be able to hear the Seraphim? As for Alisha, she already possessed a natural resonance from birth, but",
            "start": 1351.0
        },
        {
            "text": "will not be required. So, does that mean once I do grow stronger as a shepherd, everyone will be able to hear the Seraphim? As for Alisha, she already possessed a natural resonance from birth, but nowhere near as much as he... I see. Looks like it's not that simple. Regardless, I was able to have a conversation with her. And that alone... Gets you excited? Yes. The legends are no mere fairy tales. That book he took out is basically his holy book, his religion book. Let me know if you need anything. Take care. I will. You too. I'm Seray. Looks like our explorer is all fired up. Relax, those ruins aren't going anywhere. What? How did you know what I was thinking about, Mikleo? Didn't I tell you I wasn't going to let you go off by yourself? Let's have another look around town. There's got to be a clue around here somewhere. So we can explore town now. See what's there to find. Before we do that, I guess I'll show you guys a little bit of the menus. I know that's important to a lot of RPG",
            "start": 1442.0
        },
        {
            "text": "be a clue around here somewhere. So we can explore town now. See what's there to find. Before we do that, I guess I'll show you guys a little bit of the menus. I know that's important to a lot of RPG gamers. So, you press triangle on the controller and you see a pretty standard looking tales menu. You can see each of the characters. I only have three right now. I have Seray, Lyla and Mikleo. And you can see their parameters between art, defense, focus and attack. The three statistics. So as you can see here, Seray for instance is much more a physical attacker as opposed to Lyla who is definitely predisposed more to arts or magic. And Mikleo is more disposed to arts as well as art defense so he has a strong defense to magical attacks. You can see the items in the game. I don't have that many right now. You can see a mango sorbet so this affects, the effect one is heal everyone for 400 hit points. And the effect two is restore everyone's initial SC by 10 and in the next battle you get",
            "start": 1513.0
        },
        {
            "text": "right now. You can see a mango sorbet so this affects, the effect one is heal everyone for 400 hit points. And the effect two is restore everyone's initial SC by 10 and in the next battle you get 8% added defense. So this is where things get a little more complicated in Tales of Zestiria compared to say Tales of Exilia if that's your most recent touchstone. Is that there is just a lot of effects that every item or weapon has. So it's not as straight forward as saying oh this does only this. A lot of things do more than that. So if we go to standard items however, you'll find that your standard apple gel and life bottle do the same things. 30% HP healing, life bottle obviously will cure a KO'd character. You'll find that the herbs are way more common than they used to be in other games. You'll remember that these were quite, these were so uncommon in some Tales games that I was almost afraid to use them. You'd find like a few verbena, a few rosemary, a few saffron and these had",
            "start": 1564.0
        },
        {
            "text": "You'll remember that these were quite, these were so uncommon in some Tales games that I was almost afraid to use them. You'd find like a few verbena, a few rosemary, a few saffron and these had permanent statistical boost for your characters. But you didn't know quite when to use them and I was always a little nervous about using them. However only in 2 and 2.5 hours it seems like I found what 8 of them already. Which might have taken you like 10 hours in a previous Tales game so it's a little bit different the balance there. The stuff we were looking at before was food that has multiple effects for you. And then the weapons. Now this is where things get a little complicated with the weapons as well. So right now, I'm sorry I have the Ancient Sword equipped. And the Ancient Sword gives him plus 45 to attack which is standard but also gives him the gain attack which is recovery upon defeating, HP recovery upon defeating an enemy. But it gets even more complicated than that because",
            "start": 1612.0
        },
        {
            "text": "him plus 45 to attack which is standard but also gives him the gain attack which is recovery upon defeating, HP recovery upon defeating an enemy. But it gets even more complicated than that because here I'm using the Ancient Staff which has HP recovery while defending plus 10. But then the Amber Staff which is not equipped on anyone yet but which I will probably have to equip soon has an attack of plus 30 but an art attack of plus 24. And then two different statistical details that are added to it which is the art attack plus 4% for Mind and Rest duration of stat reductions minus 8%. And what you'll find about some of these items if I can give you an example. If I go to equipment and I go to Sorey. Is I have two sets of Ancient Earrings. And on the first set of Ancient Earrings that were originally equipped on me. You can see that it wasn't even ranked at all because I wasn't really equipped to it. You can see the 5 stars up there is your equipment leveling up. You'll find that it has",
            "start": 1648.0
        },
        {
            "text": "equipped on me. You can see that it wasn't even ranked at all because I wasn't really equipped to it. You can see the 5 stars up there is your equipment leveling up. You'll find that it has an art attack of plus 45 and then the effect of paralysis is reduced when you have the Earrings equipped by 50%. But these Ancient Earrings have the same art attack and same paralysis reduction but also has a thing called Gillium on it which reduces stun time by 20%. So what you find is that even if you're finding new equipment that is the same as your old equipment. It might have additional effects or reduced effects that make it more or less preferable to equip which I find quite interesting. Otherwise you have the same kind of familiar equipment. So you have your sword, you have your armor and your ring or accessory, accessory rather your boots. And you also have your titles. So here I have different titles and you gain proficiency as you can see here in this yellow meter. So proficiency 3 in",
            "start": 1693.0
        },
        {
            "text": "ring or accessory, accessory rather your boots. And you also have your titles. So here I have different titles and you gain proficiency as you can see here in this yellow meter. So proficiency 3 in Sword Harrier by keeping it equipped for a long period of time which would then alter or add to what that particular title can do for you. So attack plus 4% sounds good to me. Defense plus 4% sounds pretty good too but I'm going to leave that alone for now and see what these other guys have equipped. So he has attack plus 4% and attack plus 4%. So otherwise you can see arts. I'm going to go to the arts list and here I don't have much equipped right now but I can equip Heavenly Torrent. A hidden art comprised of an upward slash and a style reminiscent of one challenging a waterfalls torrent. So if we equip that there up in this particular thing it's X plus up on the L will equip that or rather execute that attack. You can see Lyla being controlled by the computer has plenty of things to use",
            "start": 1735.0
        },
        {
            "text": "if we equip that there up in this particular thing it's X plus up on the L will equip that or rather execute that attack. You can see Lyla being controlled by the computer has plenty of things to use as does Mikleo. And you can see that they're you know based on their usage you can see that they've gained different amounts of experience points down here in the lower right corner of the screen. You can also see support talents that everyone has so I have some support talents here point of interest detection so when I'm close to something like one of those runes that we read before or a treasure chest or anything like that it might let me know. Snack preparation makes snacks to recover HP while on the move each character has their own technique and specialties. So I can equip that as well if I want but that's going to then take that in there and I'd rather have point of interest. You can see the health maintenance and snack preparation are also available to Mikleo and Lyla. Battle",
            "start": 1783.0
        },
        {
            "text": "if I want but that's going to then take that in there and I'd rather have point of interest. You can see the health maintenance and snack preparation are also available to Mikleo and Lyla. Battle actions can be set up so this is where I can really get into auto guarding auto back stepping for different characters I want to use those kinds of things. And this this battle action thing has been used in other other tales games as well so we can you can see that I have AP of 20 I'm gaining AP by leveling up I'm also gaining AP by doing things in a world like reading those runes. So I can start to just kind of you know equip probably all these right now if I want to. And then see anything else fashion I can change the appearance of my characters if I want but I don't have anything to equip right now. And then strategy which is pretty familiar to you guys so you might want to have a mage and a dedicated mage a dedicated healer or whatever you can kind of mess around with this to your liking.",
            "start": 1824.0
        },
        {
            "text": "now. And then strategy which is pretty familiar to you guys so you might want to have a mage and a dedicated mage a dedicated healer or whatever you can kind of mess around with this to your liking. And then a library which will of course show you your discovery points so I found like some goats over here the water wheelie looked at earlier as one of those places and when you discover these particular discovery points usually a conversation happens you might get an item or something like that so they're worth kind of seeking out. You can see the skills that I have here by going through this list enemies that you've encountered so I haven't encountered too many enemies yet but like this is the spider the first spider enemy basically the first enemy in the game that I fought. And you can kind of see their same little field over these five different statistics. This guy is a little bit creepy to me I don't know if I can get a better look at him we fought him a few times but not in this",
            "start": 1863.0
        },
        {
            "text": "of see their same little field over these five different statistics. This guy is a little bit creepy to me I don't know if I can get a better look at him we fought him a few times but not in this let's play and you can see the snakes and the wolves and the ooze and etc that we fought here. And then the synopsis if you need kind of help on the story you can read these things as well and records which is kind of telling you how long he played so it's played for two and a half hours so far etc and so on. And also of course as always you can see that where the trophies are attached to them so there are trophies attached to these guys. Alright with all that said the next thing on our on our docket here is to just explore Lady Lake which is the town we're in so let's do that. I wonder what's this way this this is telling me that there's something here looks like those guards are not going to let me through though so let's head back in this direction. And the star appears in my hut again so",
            "start": 1912.0
        },
        {
            "text": "way this this is telling me that there's something here looks like those guards are not going to let me through though so let's head back in this direction. And the star appears in my hut again so I'm going to just go up here and I'll run into where I need to be to advance the story. These are some merchants that I ran into earlier in the game before the let's play recording. So they're offering me a job to require to retrieve a pretty nice knife that I sold them earlier for some gold. Alright so I'm going to go off to the inn that we were staying at earlier and ask about the food menu with the proprietor presumably. Alright so let's talk so this is the guy I think we need to talk to here. Do you have any food I'd like to add to the menu? Well sure before these times the culinary treats we'd serve up our patrons would have drilling over at the table but these days it's hard to find the ingredients still our old menu is in that box if you'd like to take a look. Why would you keep it in",
            "start": 1958.0
        },
        {
            "text": "serve up our patrons would have drilling over at the table but these days it's hard to find the ingredients still our old menu is in that box if you'd like to take a look. Why would you keep it in a box? Salmon rice ball, doria, pot of pho, cabbage roll, miso, stew. Salmon rice ball I don't know if I have to remember this or not so I'm just trying to see if I can remember it I probably won't. Alright so let's go back and tell them and see if we can remember any of that. I already forgot all of it I think. Seems like a pretty easy job for a thousand gold huh? There's some inflation going on in this kingdom. Alright let's talk to them. I did so they're serving salmon rice balls, doria, pot of pho, miso, stew and cabbage roll. Nice nailed it. Alright so I got my royal knife. I'll explore Lady Lake once again. Anywhere else to go? Where should I go from here? I guess I'll head out up to the sanctuary since I'm nearby so there's anything going on over here. There's one thing super",
            "start": 2067.0
        },
        {
            "text": "Lady Lake once again. Anywhere else to go? Where should I go from here? I guess I'll head out up to the sanctuary since I'm nearby so there's anything going on over here. There's one thing super interesting going on here. We can head out and then we'll go back to the menu and see if we can so that's the sanctuary, Lady Lake sanctuary both of those. So let's head outside the aqueduct this time and see what happens. So where am I going down this way? So I'm going to go up here and where these wagons are. I'm going to head left and see if there's anything interesting over here. If there's nothing interesting over here I'll head back out to the field and maybe do a little fighting. See if we can find a dungeon and just get to it at least and then we'll wrap up the let's play. I just wanted to give you guys a little taste of the game so you can at least expect to have some. Oh here's a cutscene. You have some expectations of what to expect if you go in and buy yourself. Dude looks like a",
            "start": 2160.0
        },
        {
            "text": "give you guys a little taste of the game so you can at least expect to have some. Oh here's a cutscene. You have some expectations of what to expect if you go in and buy yourself. Dude looks like a broke ass Pokemon. Pikachu. I don't really understand how this voice connects to this particular character. It's a little weird. We're all in the settling. Well lucky for you guys we. Well thank you. Of course the big heartedness of the turtles is proportional to the size of our shells. And what were you doing here? I'm making maps for our purposes. Oh maps. Come to think of it we don't have any decent maps. The one in the celestial record is quite old. You guys sure are reckless. Say's. Can I sell you some of my maps? They're chock full of useful inflex. Alright. Let's grab his map. Thank you's. I'm darn pleased that you bought. Adventure from the map of adventure from the turtles. These maps will add more geographical information to your world map since they're written from a turtle's",
            "start": 2226.0
        },
        {
            "text": "I'm darn pleased that you bought. Adventure from the map of adventure from the turtles. These maps will add more geographical information to your world map since they're written from a turtle's point of view. They may be some discrepancies but you should be able to roughly locate new places you haven't visited yet. You're ever lost track down the turtles in the nearest town and try purchasing their map. Okay. And then I guess we'll stalk through this guy since he has a star over his head. Where is there an underground waterway? I hope there's another guy over here. Oh this is the waterway I guess. Maybe it's the dungeon we can explore. Explore. Oh it's rock. This is perfect. Let's see if we can work our way through this. Definitely strong malevolence coming from the center of town. I must say you're a build. It looks like you're acclimating to your power already. I am? The day when you will come into the tree. What kind of power? Oh sorry about that. Well we'll find out soon enough.",
            "start": 2294.0
        },
        {
            "text": "say you're a build. It looks like you're acclimating to your power already. I am? The day when you will come into the tree. What kind of power? Oh sorry about that. Well we'll find out soon enough. Yep. Alright. Save point. Let's save just to be safe. Let's see if we can... To cap off this let's play let's see if we can explore this dungeon a little bit for you. Too many cut scenes. This is a little ridiculous at this point. I want to play the game. Oh dear. Oh my goodness. All good. Blob is just eating this man. Something about it. Not doing much damage here. Little bit of damage here. Let's see. Use an item. Use an apple gel. Close to whittling him down. Oh god. Oh he's humping me. God help me. Cool. So I got a pretty good grade. 3.12. You can see why I got that grade here. Also got a blessing orb. Got a copper key and my equipment proficiency increased as a result of that battle. I don't recall a whole... That was completely different. I doubt it. He said he's going back. Let him",
            "start": 2378.0
        },
        {
            "text": "blessing orb. Got a copper key and my equipment proficiency increased as a result of that battle. I don't recall a whole... That was completely different. I doubt it. He said he's going back. Let him have his way. That would be grand. Alright so. Let's see. I got a copper key, bronze, treasure chest and certain special orders. Okay cool. So that answers that question of why I couldn't open that chest earlier. Have I shown you enough? Probably. I've probably shown you enough. This is let's play. It's been pretty long. I'm sorry that wasn't a little bit more of a glamorous look at the game. Let's fight these guys and spin them off real quick. But I do think it's a somewhat accurate little taste of some of the systems, some of the battling, some of the story heavy stuff that happens in many Tales games. So I hope you enjoyed the let's play. Remember if you want to buy Tales of Zestiria you're more than welcome to do that. It's on Playstation 3 and Playstation 4. I am playing it on PS4.",
            "start": 2504.0
        },
        {
            "text": "Tales games. So I hope you enjoyed the let's play. Remember if you want to buy Tales of Zestiria you're more than welcome to do that. It's on Playstation 3 and Playstation 4. I am playing it on PS4. Remember we'll be doing more let's plays most weekdays on Kinda Funny Games so tune in for more of that here on youtube.com slash kind of funny games. I'll see you next time. Bye bye.",
            "start": 2651.0
        }
    ]
}