{
    "id": 737,
    "video_id": "l_RZTgo2jTc",
    "show_name": "Gameplay",
    "hosts": [
        "Nick Scarpino",
        "Colin Moriarty"
    ],
    "title": "Let's Play Ori and the Blind Forest - Kinda Funny Plays",
    "description": "Nick and Colin try out Ori and the Blind Forest\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1428001200,
    "duration": 1525,
    "transcript_chunks": [
        {
            "text": "Welcome back to Kinda Funny Games. My name is Colin Moriarty, this is Nick Scarpino, and we've been listening to you, our precious Kinda Funny fans, who've been asking us to play Ori and the Blind Forest, an Xbox exclusive game. Um, and uh, so we're going to do just that for you, uh, Ori and the Blind Forest came out on Xbox One earlier this year, I think it's coming to PC or it might already be on PC at some point this year, and I think it's coming to Xbox 360 actually later this year too. But right now, for sure, you can play it on Xbox One, and that's where we are playing it. Thanks to our friends at Microsoft. So, Nick, you and I um, we saw this at the Microsoft showcase that they did about two months ago. Yep, and they gave us three different saves at that point to get into like kind of the beginning area of the game, kind of the middle of the game, and then towards the end of the game to try out some new mechanics. We're going to",
            "start": 0.16
        },
        {
            "text": "different saves at that point to get into like kind of the beginning area of the game, kind of the middle of the game, and then towards the end of the game to try out some new mechanics. We're going to start from the break, we're going to start from the beginning and just see what happens. It would be cool, I mean everyone's already seen that level but I like the level where the gravity starts to become sort of a puzzle element so that's hopefully we can get to that stage at some point. I guess we can skip around, we can skip well we have to get to that point but we can't we have no save here. But I intend to play this game all the way through. People unfamiliar with it, Moon Studios made this game for Microsoft with the help of Microsoft Studios. This is I think their first game as a studio, as far as I know. I've never heard of them before this game but I don't know everything so maybe I'm wrong. They are located in Europe and the game is a Metroidvania-style game.",
            "start": 37.2
        },
        {
            "text": "a studio um as far as I know I've never heard of them before this game um but I don't know everything so maybe I'm wrong uh they are located in Europe uh and the game is a Metroidvania Style game a nonlinear 2D kind of side-scrolling exploration game with a lot of different kind of quirky mechanics um that you get involved in and so we're going to watch the intro here and just see what happens for the next 15 20 25 minutes I don't know we'll go as long as it we'll stop when it doesn't feel right anymore Nick that's I there's only two times to stop Colin when it doesn't feel right anymore or when someone's telling you to stop right that's it yeah that's basically it that's basically it so I'm moving now myself here that's you for now it is look at his gut it looks like my gut oh he's beautiful look at this beautiful creature jumping jump the animations are great look at the backgrounds yeah this this game so you know right off the bat the first thing I noticed when we start when when they",
            "start": 64.92
        },
        {
            "text": "Look at this beautiful creature jumping jump the animations are amazing look at the backgrounds yeah this this game so you know right off the bat the first thing I noticed when we start playing through this for us was how stunning the art style is and I mean look at the grass for Christ's sake yeah I like when games take the time to have art in the foreground it's beautiful oh yeah that forest element is amazing I didn't notice that but it gives it that cinematic uh feel to it right where we've got our our first-person perspective in the middle ground we got the backgrounds faded out and we got the far background which is you get that nice parallax scroll but this takes it to a second level so my big creature found this little creature he's his friend and look how cute he is he's just resting oh he's awake oh no oh dear hello oh dear I'm a little creature hey and he moves he's much more spry as you can see my name's Ori is this Ori I think this is Naru I thought isn't it",
            "start": 105.0
        },
        {
            "text": "Just resting, oh he's awake, oh no, oh dear. Hello, oh dear. I'm a little creature, hey. And he moves; he's much more spry as you can see. My name's Ori - is this Orie? I think this is Naru. I thought isn't it? Oh, this is Naru. I could be wrong. Look at this. Look how beautiful this is. Look at the grass. Look at As you move over it. Look how the grass... yeah, it animates. Animates - that's so awesome. Hello, friend! If I saw that guy, he'd be like, \"Don't touch me, you psycho!\" 'Cause he looks like a serial killer. Oh, we got you, little Little Apple for Naru. He exits out, so they know there's no more food there. I guess oh no, that sucks, dude! Hey, hey, brother. Each tree only has one thing of fruit for you - that's maybe why everything gets a little crazy around here 'cause it's resource-scarce. Wow, look at this. Look at the... look at the reflections. It's awesome. Yeah, it's beautiful. The game they made over here at Moon Studios, and the style is very, very, very cartoony. Um, I don't know - it's hard; it's",
            "start": 148.56
        },
        {
            "text": "reflections it's awesome yeah it's beautiful the light really really beautiful game they made over here at Moon Studios and the style is very very very very cartoony um I don't know it's hard it's hard to put this style in a box you know I mean like me you can't put it in a box I can't put you in a box and you can't put the game style in a box either no I can't either uh it's just really oh there's something there's something classic about it there's some like there's almost a a a beautiful I don't want to say an anime style cuz it's not quite that but it it it has that monoke I was going to say it reminds me of Princess Mononoke um or you know how's moving Fortress that that kind of thing it's it's cool so but I mean something's going to happen there cuz right now these these two are living just too good of a life the life good there's no there's no conflict we got to put him his arms are full uh oh this is the Knight this is the bridge they built together Tim who's the guy",
            "start": 194.8
        },
        {
            "text": "just too good of a life, the life is good, there's no conflict, we've gotta put him; his arms are full uh oh, this is the Knight, this is the bridge they built together Tim, who's the guy, who's the person that does Princess Mononoke? what do you mean Studio Ghibli, Studio J, no this looks like some sort of Rift in time and space, these poor sons of bitches, they're about to get wrecked, I mean you're talking genocide oh no look at his face, oh dear, oh he's happier now, oh it's fine, they have a lot of food, oh no, oh no well now the food is scarce, oh no this is sad, this is really sad, I didn't think this was going to be this depressing got real, this is like Lord, this is like the first 10 minutes of Up, remember that, I never saw Up but I know what happens in the beginning, really sad, I played the game, oh there's one left take it for yourself be selfish be selfish he doesn't even want it at all it's like I gotta go find some man look at this world is in Ruins so something happened we have this",
            "start": 236.44
        },
        {
            "text": "oh there's one left take it for yourself be selfish be selfish he doesn't even want it at all it's like I got to go find some man look at this world is in Ruins so something happened we have this beautiful Forest now it's not beautiful anymore now did they do what the cavemen did to their their land like where they just hunted all the trees to extinction and all that kind of stuff is he in other words is he responsible for this somehow did they take too much fruit did this guy get too greedy Nick well I mean he was basically farming every tree to death as we saw the very very first thing he does where he puts an X on it IE this thing is dead it cannot bear any more fruit oh bummer wow this is **** this is one of the biggest depress most depressing intros to a game I've ever seen in my life I'm invested in it though I like that it's got a heart don't eat it give it to your little friend keep it for yourself he doesn't need it what you do the big one s just eating the smaller",
            "start": 304.88
        },
        {
            "text": "I'm invested in it, though. I like that it's got a heart. Don't eat it; give it to your little friend. Keep it for yourself; he doesn't need it. What you do, the big one's just eating the smaller one—that's why he wants it, that's why he's getting it up now. Fat up just a little bit; get those thighs a little fatter. Let me get a chicken wing in there. The long game—wow! The intro to this is quite... it's quite bold to have an intro this long. I would say typically time to play is really important, but when you tell a story this good and this riveting, and something this sad that makes you want to see more, right? You could—you can get away with doing a 10-15-20 minute intro. Um, but the usual so-called \"time to fire\" and all that kind of stuff is pretty important in the game. We still have not played it into it, though. I mean, mostly you're playing, and I'm watching anyway, so I kind of had a backseat feel to this whole let's play to begin with. Oh, is he dead? Oh, this is... I'm going to cry; this is.",
            "start": 352.84
        },
        {
            "text": "it though I mean mostly CU you're playing and I'm watching anyway so I kind of had a backseat feel to this whole let's play to begin with oh is he dead oh this is I'm going to cry this is depressing this kind of not cool what that what the hell is that there that's freaky it's a nice touch a lot of nice touches here but see this is what got you into this trouble in the first place should have been more scarce you don't need you don't need to be that heavy I really don't think that that's what happened I don't think he single-handedly just destroyed the entire like de the entire ecosystem himself okay oh no is he dead I hope not hey friend I found some more for us I mean these guys I sympathize with the two of them but let's be honest you got to evolve or die like what the hell are they still doing there who's someone's at the door Tim can you get the door it's probably Kevin we didn't tell him much key to use can you go out and just make sure it's s the mail man or something",
            "start": 407.2
        },
        {
            "text": "they're still doing there, who's someone's at the door? Tim can you get the door, it's probably Kevin; we didn't tell him much about how to use it. Can you go out and just make sure it's the mailman or something? Oh, he died. Jesus, the **** what is this? I don't want to play this anymore. World, let's go back to Metal Slug. If you die, you just become a walking zombie. Look at him; he's moping around now. He's clearly questioning his own will to live. Is it you controlling this or is he doing it? Yeah, I'm controlling it. Get up, come on! What's his name, Nabo? I don't know, I don't know who's who anymore. I thought the big guy was Naru; maybe in this game or was he? I don't know, it's not important. Gee, I mean, this is just like, bro, sit down and let the cold take you. You know what I mean? Just close your eyes and go. It's okay. He's trying to survive. I could do without the ominous voice in the sky speaking some sort of mystery language, speaking in tongues. I'm like, \"I got it, bro.\" It's dire. Okay, holy Christ, this guy...",
            "start": 466.0
        },
        {
            "text": "he's trying to survive I could do without the ominous voice in the sky speaking some sort of mystery language, speaking in tongues. I'm like, \"I got it, bro. It's dire.\" Okay, holy Christ. This G is literally crawling by my fingertips to the edge of nothing. When we saw them play this game, they left out that you're going to want to... you're going to feel like you don't want to live yourself by the time you actually... yeah, you're going to eat a bullet by the time... like the intro scene, Jesus Christ. They aren't kidding around with this. Huh, they're not screwing around. Oh dear, is it living again? These flowers did he die too or something? I think he died. Yeah, his life force went into the ground into this tree. This is like very Studio Ghibli. Yes, oh my God. I don't even know if I want to play this now. My light revived. A new age had dawned. All right, so the tree is what's been talking to you. The forest has been talking to you. Now you're Ori... so that is Ory. Okay, so now he's spry. He's a spry",
            "start": 584.6
        },
        {
            "text": "now my light revived War new age had dawned all right so the tree is what's been talking to you, the Forest has been talking to you now you're Ori so that is Ori okay so now he's spry, he's a spry little what happens when you feed them apples similar to what happens when you feed Bears apples they can jump to Great Heights I think you got to go the Orb where is that over here I think so you got to get up there okay there's yeah jump down it's telling to go down here first I think cuz you can't get past those until you can attack how's it control so far it's awesome it feels great you're I'm moving I'm using the d-pad you can use the left analog stick but this is a game that's made for the d-pad I think and thankfully Xbox One's controller has a good d-pad on it which was not the case with obviously the Xbox 360 correct energy you now can collect and use more Energy remember you can use Energy to create Soul and can save your game that was the one cool thing is",
            "start": 654.92
        },
        {
            "text": "not the case with obviously the Xbox 360 correct energy you now can collect and use more energy remember you can use energy to create soul and can save your game that was the one cool thing is that you can save your game using like like it's almost like an autosave kind of thing very interesting you can just save whenever you want as long as you have that energy which I think I just went right through that which I think is somewhat interesting all right don't mind if I do I'll take some life Shard also I'll take some health Shard I like Swiss chard you know my dad really likes Swiss chard as well big fan is this you can't yeah you can't get through that but I'm why is it like doesn't it look like it has a healthy glow to it I want to go back to that again that's clearly look at that I to that's healthy yeah but what is the difference that's steaming off like red vile uh uh particles the other one is steaming off life juice man it's good really that looks the same to me I think that under",
            "start": 723.08
        },
        {
            "text": "healthy yeah but what is the difference that's steaming off like red vile uh uh particles the other one is steaming off life juice man it's good really that looks the same to me I think that under those spikes is the same though it is I think if you destroy those you get both but how do I get back up yeah oh dear I don't know like you can't get through that no that's what you need to get right there but I think you need the weapon let's continue to explore let's go back this way it's got to be something that way is it under the water maybe no nope well you're dead it's a dragon you've got to keep going this way is there more this way am I missing oh yeah there he goes he's who you've got to let him break through the rock you've got to stand right by the rock and let him break through it there you go stupid dumb here's what we need is this what we're looking for no still not yet you still have to meet uh your friend right isn't your friend the one that allows you to attack",
            "start": 765.36
        },
        {
            "text": "you go stupid **** dumb **** here's what we need is this what we're looking for no still not yet you still got to meet uh the your friend right isn't your friend the one that allows you to attack let's see wow this is such a beautiful game look at it it's stunning I like the uh the text the way the text appears and stuff too very cool oh my God yeah so now you can just attack with which is cool cuz you're not actually aiming you're just kind of hitting it and taking it out for you I think the game I think the game does a really cool job of um it is it really does emphasize platforming over attacking which is even though you would do both um you found a small Spirit Light container so I can level up now create a soul and can tap b to near it to access the ability tree maybe just f focus a little bit more on attacking right now just just to kind of get your feet underneath yeah understood UND get your toes wet this is a freaky game now like you're out in this weird Forest",
            "start": 814.88
        },
        {
            "text": "f focus a little bit more on attacking right now just just to kind of get your feet underneath, yeah understood. Get your toes wet. This is a freaky game now, like you're out in this weird Forest - it's spooky, it's covered with mist of all different colors and just random voices are talking to you. Has it occurred to Ori that this might all be in its head? I know he might be in an insane asylum from massively killing his best friend. There's a nice little map here; move around with the left analog - see that's cool, and we're trying to get up there so we can shoot this very Castle Vania-like, and we're collecting these. I think they're used to create... it's saying if I hold B down and I can... yeah, so there's an ability tree. Oh, that's cool. So let's see, but you haven't leveled up yet. I had one, I think. Oh, maybe you do have one? Maybe not though. Let's see what do I mean? I was going to... yeah, there it is. You got to go Quick Flame - that's pretty cool, that's fun. I like leveling systems very much. It doesn't look",
            "start": 897.44
        },
        {
            "text": "you do have one maybe not though let's see what do I mean I was going to yeah there it is you got to go Quick Flame that's pretty cool that's fun I like leveling systems very much it doesn't look like that's too crazy of a leveling system either it looks like it's kind of organically built in what is this thing mushro I like how everything interacts with everything in the environment yeah it's fun it's pretty cool now how do I get back up here he just got to jump harder there we go there you go all right you were right it did have both in there it's telling you man you got good eyes jump on that thing again oh this son of a b**** trying follows you there man trying to be cute you know what I mean you could have just minded your own business and scavenged the land for scraps but no you had to be cool and go collect the light orb you found an energy Shard energy shards report restore power to Ori's energy cells I'll take your word for it yeah see there's a there",
            "start": 951.76
        },
        {
            "text": "for scraps but no you had to be cool and go collect the light orb you found an energy Shard, energy shards report restore power to Ori's energy cells I'll take your word for it yeah see there's a there is a thing in there yeah it was a bouncy thing oh it's a bouncy thing I knew it I **** knew it never listen to you again no you don't need to I told you never listen to I said I right about do not listen to what I'm saying go into that cool jacuzzi Spirit Trees are ancient structures connected by the roots of the spirit tree use their light to replenish your strength whenever you are weary Al like a little save point it's like when Naberu goes into his coffin yeah in uh Ori and the Blind Forest okay there we go I feel the need to collect I want to play this all the way through oh so I got another thing here look at that but I don't have I don't want to create another one yet you don't want another cuz I don't I don't think you can make them at will so I might need it no that's just an ability upgrade",
            "start": 1002.32
        },
        {
            "text": "look at that but I don't have I don't want to create another one yet you don't want another cuz I don't I don't think you can make them at will so I might need it no that's just an ability upgrade no but when I I think when I use I me I'll try it but I think when I use the yeah see I lose my blue thing oh no I don't mean that I mean like you have you got another one of those right Spirit Magnet most pickups now float to or rekindle using Soulinks and shorten the cool down timer you need that Spirit Magnet bro no I do I'm going have like a a a really strong attack now oh that's pretty dope the problem with the spirit I mean the Spirit Tree she just wasting a lot of time going back and forth collecting all those orbs that's all I'm saying time management bro no that's true so we have to do this right I'm never really good at doing this I remember playing this actually this part at the event being like this is a little wonky cuz you want it to swing a little bit more yeah like see are you",
            "start": 1056.44
        },
        {
            "text": "Right, I'm never really good at doing this. I remember playing this actually, this part at the event being like this is a little wonky because you want it to swing a little bit more. Yeah, like see are you doing it right? It's moving; you got kind of a swing thing going on. What's that? What's that flame happening down there? That was the thing I made with you know, with the B button. Jack that guy out! Yeah, Jack that guy. You want me to Jack him up? New Jack City, bro. There It Is, Well Done. Oh, you found another switch Shard. You found a keystone. Keystones are used to open spear gates. Remember that each spear gate will require a different number of keystones. Well, of course, of course, that's the case. And here's the gate we use. There's the gate you can use on perfect. Look at that good. The spear gates block us; they were built for protection before the days of decay. The required keystone must be nearby. I have the required keystone. Certainly don't I? Oh, I need another one. That was kind of uh unpleasant so.",
            "start": 1099.04
        },
        {
            "text": "they were built for protection before the days of decay the required Keystone must be nearby i have the required Keystone certainly don't i X oh i need another one that was kind of uh unpleasant so i think i got to go back at the other one that how mo oh i can grab right trigger hold right trigger to grab and move OB i see i see and then i can use it to jump up here but there's certainly got to be something get past that bro you got to get you got to pull keep pulling there you go what's underneath this mossy tree there it is there's the other Swiss Shard got it did it done it Tim Gettys your hair don't look the animations are awesome it's beautiful there we go like the way he jumps can you go through yep there it is it must be fun being able to like design something that is amazing looking yeah these guys would be very proud i'm sure they are i'm sure they are i hope so oh a little uh little road sign for you see the map says reminds me a lot of that scene in the Last Crusade",
            "start": 1155.84
        },
        {
            "text": "looking yeah these guys would be very proud I'm sure they are I'm sure they are I hope so oh a little uh little road sign for you see the map says reminds me a lot of that scene in The Last Crusade when it's like Poland Berlin I don't know if those are the two no I'm pretty sure Berlin was one of them yeah Poland not a city but maybe not a city Frankfurt maybe I don't know where was it I don't think that's uh I think that's just a waste of effort right there but that life is a waste of effort that's what Ori's trying to teach you life is not a waste of effort yeah I mean Ori's like look bro I tried to sit down and die you wouldn't let me oh lifestyle I have more life now permanently I like that you're just getting a constant barrage of cool stuff this game definitely is going to treat you to lots of upgrades lots of things to find which is cool that's good and people that play these kinds of games like that kind of stuff I certainly do I need it as an incentive otherwise I just feel",
            "start": 1215.76
        },
        {
            "text": "to lots of upgrades, lots of things to find, which is cool, that's good. And people who play these kinds of games like that kind of stuff. I certainly do. I need it as an incentive; otherwise, I just feel like I'm not doing anything with my life. So there's another one of these gates. This will need two of them as well. We'll probably slow down, maybe stop playing. Maybe we'll do another one in the future. You want to do another level? Should we keep playing? We keep playing for a while; see what happens. I don't know. Yeah, I mean... how big do you think this level is? I don't know. Who the hell knows? Seems pretty vast. I'm already in a new place. Did you go to Berlin or Frankfurt? Uh, Frankfurt, I believe. Obviously, this game gets a hell of a lot harder. The game apparently gets very hard if you're not familiar with it. You should watch our... uh, you know. You can watch any Let's Plays online. But I'm sure we'll do another one of one of the later levels where gravity starts playing into some of the puzzle solving.",
            "start": 1266.76
        },
        {
            "text": "with it you should watch our uh you know you can watch any Let's Plays online but I'm sure we'll do another one of one of the later levels where gravity starts playing into some of the puzzle solving aspects um which would be cool it'd be cool to show that now I don't know it's up to you you're you're you're you're piloting the game I mean we can't go we can't oh we don't have the say we have to keep playing sorry I forgot this is our first play through maybe we'll have to do another one of these later at some point so I'm inserting insert it you need another Keystone this is a different thing I need a map fragment now this might be getting a little too crazy now with like the the amount stones and all that stuff well that's okay though I mean it's it that's what the game's for you're basically just collecting things it's what the game calls them that I guess is doesn't the only really changes they're all keys it doesn't matter it's just a different way of calling to thing you're Soul",
            "start": 1307.72
        },
        {
            "text": "just collecting things it's what the game calls them, that I guess is doesn't the only really changes they're all keys it doesn't matter it's just a different way of calling to thing you're Soul wor you buddy fantastic it also seems like you level like you get new abilities fairly quickly I'm sure that maybe slows down as the game progresses as you can get some of those more important abilities but you're already almost on your third which is amazing yeah it's awesome yeah there's a nice little Loop here yeah there it is what the hell was that I have no idea you gained another skill ability, skill ability let's go I'll make another one of these save point and then we'll hit B and go back in what's the next one up here oh requires charge flame spark flame I have that right no I don't have the charge flame so Spirit magnet rekindle what's the charge flame I think we have to go in order yeah no oh yeah you shouldn't you can't pick that one you can't just keep going with that that no I",
            "start": 1348.76
        },
        {
            "text": "the charge flame so Spirit magnet rekindle what's the charge flame I think we have to go in order yeah no oh yeah you shouldn't you can't pick that one you can't just keep going with that that no I don't have something oh maybe you don't what the **** yeah I need this before I can get this oh I see that keeps you from leveling up evenly which I appreciate that makes it easy for me to understand where I'm supposed to go you know me a level they're it's paralyzing it's too much responsibility like choosing how I level it is a lot of Dying Light we experienced that In Dying Light can't do it sorry oh dear I don't know how much more of this I can take and by that I mean the **** sheer depression of this game is making me feel Jesus wow this really does have a monoke feel to me maybe someone disagree no I don't think anyone would disagree even kind of the story you know is like very mon okay just like super power I just love how this game is Like A Feast for the eyes really wall jump",
            "start": 1399.16
        },
        {
            "text": "Disagree, no, I don't think anyone would disagree even kind of the story you know is like very mon okay just like super powerful. I just love how this game is Like A Feast for the Eyes really wall jump nice do it do it right now look it gives you the wall that's fun can I jump up and up and up yeah energy though sweet those stupid ass **** I guess let's wrap it up here cool I mean we've been playing for a while I don't want to spoil too much of the game for people but people have been requesting and we are hearing this Nick, this is Ori and the Blind Forest. It's on Xbox One; it will come to Xbox 360 later this year. It's by Moon Studios with the help of Microsoft Studios, and this code that we are using was furnished To Us by Microsoft so we appreciate that very much uh we hope you enjoyed the playthrough and try out the game for yourself it's a lot of fun it's very emotional as you can see I'm I'm certainly going to keep playing um later on so uh thank you for joining us, you can find more on.",
            "start": 1449.28
        },
        {
            "text": "and try out the game for yourself it's a lot of fun it's very emotional as you can see I'm I'm certainly going to keep playing um later on so uh thank you for joining us you can find more on Kinda Funny Games as always and find us on Twitter at Kinda Funny Vids until next time we'll see you later",
            "start": 1509.76
        }
    ]
}