{
    "id": 797,
    "video_id": "ZxE92AWI2LI",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Anti-Americanism - The GameOverGreggy Show Ep. 73 (Pt. 2)",
    "description": "Colin Moriarty went to Iceland and some one talked shit. Did they get shot?\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get you PC here www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1430204401,
    "duration": 1925,
    "transcript_chunks": [
        {
            "text": "Colin yes what's your topic uh so I went to Iceland the other day and I've been overseas I guess this is like my fourth time overseas my third time no no fifth time my fifth time overseas um and I offended you at yourself I had no no I had my first and I'm not in Canada and all that I had my first bout of real anti-americanism in Iceland like real to my face anti-americanism I was I wanted to share the story with you guys and and kind of talk about why it is that we are much maligned um Obama yeah um so here's the story first of all I want to preface it by saying that people in Iceland for the most part like with the exception of a few people were awesome like really nice people a lot of them were very self uh deprecating like why are you even here kind of thing like why would you ever come to this place you know like um we want to go to us I don't understand why you want to come here very nice people very helpful people um English is fluently spoken there um it's mandatory to learn",
            "start": 2.8
        },
        {
            "text": "come to this place you know like um we want to go to US I don't understand why you want to come here very nice people very helpful people um English is fluently spoken there um it's mandatory to learn it um there's only 320,000 people in the entire country which is unbelievable that's uh half the population of San Francisco um and uh it's about a state the size of Kentucky so you can you imagine like when you're in Reykjavik it's it's a it's a thriving City about half the population lives there and then the rest of the country is just sparse just very sparse yeah beautiful place though very desolate very dark um very snowy so I went to a bar we were just like going from bar to bar like just going from random places we and we um it's me and Cheryl and then two of our friends from um really Cheryl's friends from our high school and then their boyfriends um well actually one husband and one boyfriend um so three four of us went to high school together and then another the a fifth guy is",
            "start": 79.68
        },
        {
            "text": "Cheryl's friends from our high school, and then their boyfriends - um, well actually one husband and one boyfriend - um, so three or four of us went to high school together, and then another the fifth guy is from Long Island, and then uh six guys from Utah, and we go into this bar and we're just drinking or whatever. This is the weird dichotomy of the stories: these really nice older women are sitting around this table, and we're kind of encroaching a little bit on their space but they're slowly getting up. I sit down in someone's seat, and I'm like \"oh, I'm sorry, I didn't mean to\" - she's like \"oh, don't worry about it,\" we're leaving, and she puts her hand on my very warmly puts her hand on my arm, and it's like \"I you know, like please sit you know.\" We're getting out of here, and I was like \"oh, like really nice, what a nice old lady.\" Uh, so they that that crew of ladies leaves, and we sit down around this table, and there's this older blonde woman, maybe in her 50s, very well-dressed, hot.",
            "start": 125.56
        },
        {
            "text": "oh, like really nice what a nice old lady and uh so they that that crew of ladies leaves and we sit down around this table and there's this older blonde woman maybe in her 50s very well-dressed hot she's pretty I had a Golden Girls bar there all the Little Women were around drinking it was just after work I think one every just like kind of hanging out and um that was the one thing I noticed in Iceland is that because the city's so small and rickety whatever like there's just people of all ages in a lot of just same areas like because that's where they hang out um there's only so many bars so many restaurants and stuff um and we sit down and we're just kind of chatting around and I go to the bathroom and then I come back and this blonde woman's talking to my group or whatever and she's asking them like who invited you to sit here like kind of like rudely or whatever and she's like you were not invited to sit here or whatever and that's how we do it here and I'm like we were invited to sit here and we",
            "start": 159.68
        },
        {
            "text": "who invited you to sit here like kind of like rudely or whatever and she's like you were not invited to sit here or whatever and that's how we do it here and I'm like we were invited to be here and we had this kind of exchange and this the conversation goes where like the woman's like giving us an attitude and she's like she's like where are you from or whatever and we're like where and one of my friends is like where do you think we're from and she's like she rolls her eyes she's like the United States or whatever like that and uh and I'm like yeah where specifically do you think we're from and she goes like this she's like in the South like as an insult oh yeah and this is this is my first thing where I'm like I'm so sick of the anti-Americanism in this country I really am the South has a really messed up history so does the entire country M um it's time to kind of move on I know a lot of very warm and very nice people from the South very smart people from the South I am",
            "start": 201.72
        },
        {
            "text": "South has a really **** up history so does the entire country. Um, it's time to kind of move on. I know a lot of very warm and very nice people from the South, very smart people from the South. I am sick of all the anti-South rhetoric - that's just an aside but she was saying that to us to insult us. Uh oh, and then you know what happens to people that talk **** guys? And the funny thing is that my like the five of them are kind of just engaging with her and and trying to be nice, and I'm being like really **** rude to her. And what I realized was that like she was being the nicest to me because I was challenging her or whatever. But she would do things like she went and shook Cheryl's hand instead of hers - like wasn't firm enough, whatever. And like, was she wasted or no? God damn, this is very intrusive. And then and then she was saying how she's like one of the last Viking families, and like just a weird, totally weird **** obviously Iceland has a long Viking history.",
            "start": 238.16
        },
        {
            "text": "this is very intrusive and then she was saying how she's like one of the last Viking families and like just a weird totally weird obviously Iceland has a long Viking history but like a thousand years but um she's not the last Viking I mean look around um so uh it then gets to the point where she's talking about how she lived in Boston for while or whatever and so on and then she's like making fun of like the way we're dressing and why we're here and like we don't belong like basically don't belong there and like why would anyone come here and and like you're basically not invited you're not welcome in Iceland kind of or whatever like just straight up like anti-americanism like to my face like I've never experienced that before I've been to Germany I've been to England I've been to Japan like never had a problem really with anyone based on just who I am and uh I get like really combative with her and actually Cheryl's friends thought it was",
            "start": 279.52
        },
        {
            "text": "to England, I've been to Japan, like never had a problem really with anyone based on just who I am. And uh, I get like really combated with her, and actually like Cheryl's friends thought it was like the best because like they don't really know me like that. You guys know me well enough to know that like I'm going to say something to you, someone's getting shot. So she was like, \"Why, like why would you pick iel?\" I'm like, cuz it's really cheap to get here, and she like kind of just looked at me saying like oh it's a beautiful country. I'm like, it's just really cheap, we got here for like nothing, yeah. And um, and she was like, and I was saying something to her like um I'm like you really should be nicer to tourists, your economy depends on us. And uh, she's like oh that's not true, that's not true, you should learn your history. In my mind, I'm like what does that have to do with history? And I'm like I have a degree in history from a very good school, I know my history. Um, your economy collapsed four years ago and",
            "start": 317.16
        },
        {
            "text": "your history in my mind I'm like what does that have to do with history and I'm like I have a degree in history from a very good school I know my history um your economy collapsed four years ago and your economy is entirely dependent on foreign uh you know foreign money and the economy is based on you know tourism so maybe you should be like everyone else has been nice to us why are you busting our balls or whatever and then she was like making F like she said some something so weird where like she we were all wearing beanies and this was the weirdest comment she was like she's like no people would beat the **** out of you if they saw you wearing these beanies around here or whatever and you notice that in Iceland a lot of people like pretend like it's not **** 10 degrees outside like it's really actually quite fascinating the way they just walk around but people are wearing beanies all over the **** place so I'm like what and we actually walked out the next day and like saw",
            "start": 354.56
        },
        {
            "text": "It's really actually quite fascinating the way they just walk around but people are wearing beanies all over the place so I'm like what and we actually walked out the next day and like saw a bunch of kids playing in the snow like with beanies on them you should have kicked their ass you should drag their bloody bodies you want it was just a weird thing and then she was she was making fun of our fashion or whatever and someone's like but you follow our fashion like American and Western European fashion is like the fashion of the world Bally and she's like no no she's like we are way ahead of you or like stuff like that and this is the best part I'm I'm leaving out parts cuz I don't want I don't want to blab the story but my my favorite part of it was that she got up and she had blue jeans on and I'm like those blue jeans are American and and like I'm I keep confronting her and she keeps complimenting me she's like I really like your glasses that was the last thing she said to me",
            "start": 392.36
        },
        {
            "text": "\"Jeans on, and I'm like those blue jeans are American, and and like I keep confronting her, and she keeps complimenting me. She's like, 'I really like your glasses.' That was the last thing she said to me, and then she like walked away. It almost sounds like this was just a ham yeah, she was hammered, but nonetheless I wanted to just bring up this thing just to tell the story. Also, you know, the five people that I were with or four because Cheryl doesn't really watch the show will probably be watching this and I want to you know give them a shout out because we had a great time. But um also just kind of recount this story. I don't think I'm leaving out anything too too important because the reason I wanted to tell the story was to ask like if you've ever had encounter encounters like this overseas, and why we're looked at is like such a bad group of people to like some people I think most people know Americans are just like you and and in in England or in India in Japan like it doesn't matter.\"",
            "start": 429.88
        },
        {
            "text": "and why we're looked at as such a bad group of people to like some people, I think most people know Americans are just like you and me, and in England or in India or Japan, like it doesn't matter. But there's like a real anti-American sentiment that is real, and I didn't really think it was real until I experienced it for myself. It was very uncomfortable, you know, it was a very uncomfortable and very real experience where I'm like this woman is being super rude to us because of where we're from, yeah, you know what I mean? Um, which could you imagine if that were the case here, where if every country we had a problem with we were just rude to the people from that country, our country would be chaos, it would be chaos. Um, I've never had anti-Americanism, I've never had anyone sort of have prejudice against me being American, but I can understand like I still hold that this country is the best country on the planet largely because of the citizens that are in it who help run it",
            "start": 466.32
        },
        {
            "text": "have prejudice against me being American but I can understand like I I still hold that this country is the best country on the planet largely because of the citizens that are in it that help run it but our political structure is screwed up our foreign policy is laughable I mean we every day we criticize Russia and any of our enemies in the Middle East or Europe for doing these crazy things and we kind of do similar things I'm not saying like I'm not saying we're going out there and funding terrorism but you look at our history over the past 30 years and it's crazy that the United States government has funded and so there's no wonder that their people don't like us because we have a history of putting our nose in places where it doesn't belong for let's be perfectly honest profit for gain and for the gain of mostly our politicians that are involved in this stuff right um I'm not saying that we deserve any of",
            "start": 505.76
        },
        {
            "text": "places where it doesn't belong for let's be perfectly honest profit for gain and for the gain of mostly our politicians that are involved in this stuff right um I'm not saying that we deserve any of the sort of ire that we we get across the world but I don't think that our media I don't think we're doing a lot to sort of dispel those things and I think that you know the country as a whole could be better let's just put it that way I mean you've said so yourself like our foreign policy is just especially Obama's foreign policy is just completely ridiculous and I don't like any of the candidates that are coming up I mean our political system is screwed we don't have any it's either a Republican or a Democrat and they're all jokes they're all jokes so the 2016 election is hilarious right there's there's nothing that can interrupt this system and there's no end in sight I why people don't like us though I think I think exactly why people don't like us because because there's no candidates",
            "start": 547.08
        },
        {
            "text": "there's nothing that can interrupt this system and there's no end in sight I why people don't like us though I think I think exactly why people don't like us because because there's no candidates coming up or because what's happening on the ground with the political system no because our political party enables us to go start wars in random places without really that much push back you know like we can just go invade another country whenever we want and then Russia does it we're like what are you doing I that's also just who we are though as a people that does it's The Stereotype right you said you know imagine if people came here and we hated them or were mean to them and people have done that people probably have stories there stories you know I mean this isn't about this is what happens when you paint with a broad brush right but the broad brush of a type of American is someone similar to me but maybe not as nice who's big loud obnoxious comes over there doesn't know where New",
            "start": 591.12
        },
        {
            "text": "when you paint with a broad brush, right, but the broad brush of a type of American is someone similar to me, but maybe not as nice, who's big, loud, obnoxious comes over there doesn't know where New Zealand is doesn't give a flying **** that he doesn't because he's from the greatest country on Earth and he will tell you about it and he will say that over and over again and that puts a chip on people's shoulder not to mention the fact that like in a lot of ways America is leading the charge there is that too so there is an Envy on certain things obviously not education but you know what I'm saying like there is a thing that like you know it's back to that Newsroom thing from The Newsroom that first scene you ever saw right like Jeff Daniels unloads on that lady of like why America isn't the greatest country but we never talk about that we just say we are and we believe it that's all you got to do you just **** say you are something everyone else believes it internet Superstars yeah",
            "start": 625.72
        },
        {
            "text": "greatest country, but we never talk about that. We just say we are and we believe it - that's all you got to do; you just **say** you're something everyone else believes it. Internet Superstars, yeah, that's how things happen. I've never experienced it because I've never been out of the country, so I haven't experienced that. But I have experienced just being here when I meet people from other places - cuz I am also like Greg, a perfect example of what people don't like about America. And um, I don't know **about** a lot of things and uh they are very quick to point that out. I'm like, well you're kind of an **ass** for that then. But that doesn't hold up with them. But like I have a lot of friends from like uh just the UK who I'll see randomly and they just there's I feel like I'm constantly being judged - everything always with this very specific people. Some people have been very nice, but like there's this one guy who's every move I make, every order at a restaurant is always like \"of course you\"",
            "start": 661.52
        },
        {
            "text": "judged everything always with this very specific people some people have been very nice but like there's this one guy who's every move I make every order at a restaurant is always like of course you ordered that it's like what the **** does that mean yeah why you got to be like that what you what you get in the party platter cheeseburger but it's just like of course you get a cheeseburger you're such an American it's like well I don't know what to godamn right it I mean I feel like we get a lot I don't want to you're right I don't want to speak in broad jokes I'm going talk about myself here a little bit I feel like I am uneducated when it comes to politics largely especially global politics I feel like uh because our country is so big it's hard enough just keeping up what's on in the United States let alone the rest of the world because you have to also remember like you said like most of these countries can fit inside the United States actually what is it like half of Europe fits inside",
            "start": 700.24
        },
        {
            "text": "the United States let alone the rest of the world because you have to also remember like you said like most of these countries can fit in the United States actually what is it like half Europe fits in the United States I forget how big the continents are I may have made that up completely oh I think I think all Mainland Europe could fit with the exception of Russia in the United States yeah so I mean think about that like we have our own sort there's I mean our own world that we have to worry about that's got its own flaws and then of course yeah we go to these other countries and we're completely you know I'm completely ignorant of their politics their uh traditions and any of any of the sort of collisions is this guy not knowing and not understanding our customs and not trying to understand our customs cuz there is that too like my wife when she goes to travel she'll make an honest effort to understand the culture and that's you know it's still not 100% but at least it's 2 or 3% more",
            "start": 741.6
        },
        {
            "text": "our customs cuz there is that too like my wife when she goes to travel she'll make an honest effort to understand the culture and that's you know it's still not 100% but at least it's 2 or 3% more than I'm putting in you know whenever I go anywhere when I go to Germany I'm just like oh cool Germany I make some probably off-color remarks about German sausages and leave it at that that's as far as I go MH yeah I think that you know we have to separate um the kind of cartoon image of the American like that's kind of like not beloved but like lovable where it's like oh you're fat and you like cheeseburger whatever it is or whatever and from like like the real harshness of what I experienced because I've experienced like the comical like oh you're an American kind of thing and I'm like I am I'm proud of it but like this this particular encounter in Iceland was like quite hostile and um to me it was like I get it I do get it I don't think sometimes people put themselves into our shoes and I",
            "start": 781.28
        },
        {
            "text": "proud of it but like this this particular encounter in Iceland was like quite hostile and um to me it was like I get it I do get it I don't think sometimes people put themselves into our shoes and I think you kind of brought it up Nick where it's like we are a self-contained world kind of in the United States and I don't think it's really it's not the nature of our own bravado or our own arrogance it's the nature of being a really big country you know with 320 million people in this country we're not like India or but but India and China might very well be the same where that's their world now now like you know we one thing I realized in Iceland when I was there because they import everything they have nothing there like naturally except for like you know some minerals and stuff like that is like their supermarkets are like sparse like they don't like they don't like I went into a few like just I like going to supermarkets in other countries",
            "start": 822.4
        },
        {
            "text": "know some minerals and stuff like that is like their supermarkets are like sparse like they don't like they don't like I went into a few like just I like going to supermarkets in other countries like that's like one of my favorite things to do it's just like what like what are they eating what are they a little bit of produce a little bit of like super expensive meat and stuff like that I'm like we take a lot of things for granted here that I can go into the supermarket that's MASSIVE and buy whatever the **** I want you know what I mean whatever I want and they're like every two blocks you know it's like some some parts of being overseas have made me thankful for being American because we are we are really A Land of Plenty um because we're so domestically kind of um uh we have like a domestic charge where we're basically able to kind of like feed ourselves and stuff at least with food not so much with manufacturing items um but I think people don't put our themselves in our",
            "start": 871.12
        },
        {
            "text": "a domestic charge where we're basically able to kind of like feed ourselves and stuff at least with food not so much with manufacturing items um but I think people don't put themselves in our shoes sometimes where it's like we are ignorant as a people of the rest of the world because we don't really have the necessity of needing to know or go to these other places and that's not that's not an arrogant thing that's just because there's so many of us here it's not like we're from the Netherlands whatever where it's like a small country and you have to try not to leave you know what I mean yeah know this is this is what I've always taken up too of like just the fact of being in Italy or France and like when you say we're going to another country for us that's a huge plane ride and it's it's a **** train ride you know what I mean it's so easy to be in France you told the story or wherever you were in Germany or France or wherever or London and you were trying to get to this one place",
            "start": 901.0
        },
        {
            "text": "It's a **** train ride, you know what I mean? It's so easy to be in France. You T, I think you told the story or wherever you were in Germany or France or wherever or London, and you were trying Gar wanted to go somewhere. Oh yeah, we were in Germany, and Gar was like, \"Let's just go to France.\" Yeah, it's like that's a real thing that could happen, whereas here it's like so much production to go anywhere that yeah, like I... It's the same way when I expl exp to somebody when I am overseas or talk to somebody who's from overseas and I'm trying to explain something about I went to Missou and then I have to then I start having to you know break it out like okay well you do you know Missouri, the states? Do you know this? You... you know I go like that to get bigger and bigger and bigger to try to show you what I'm talking about right. And that's just the thing when it's like we're saying how small some countries are compared to what the United States is yeah it doesn't make them better or worse it's just like",
            "start": 939.72
        },
        {
            "text": "talking about right and that's just the thing when it's like we're saying how small some countries are compared to what the United States is yeah it doesn't make them better or worse it's just like that's just the nature of growing up American yeah and and I feel like some people kind of turn on us as not being cultured and that's fine if that's the way people feel and I I agree I think is a people we're not cultured but I think there's a flip side to the coin is that we are Global culture and I think that that's something that a lot of people don't want to admit to you know what I mean is that I like I one thing I couldn't believe in in Iceland and I and and Raekor is not like a it's it's there's tourists there but it's not it's it is what it is that place is super American you know what I mean like it's not it's not westernized like dude like I went to the nicest restaurant in Ísafjörður I don't remember the name of it we went there was super expensive it was awesome it was all",
            "start": 975.32
        },
        {
            "text": "I mean, like, it's not Westernized, like dude. Like I went to the nicest restaurant in Iceland, I don't remember the name of it. We went there; it was super expensive, it was awesome. It was all like Americana - they had these great chicken wings and these kebabs and steaks, and all that. It was awesome. And then you go to their burger places everywhere, and you know it's not to say... what I'm saying is that we've given so much to the world, and I think people kind of take that for granted too. A lot of the music a lot of people listen to overseas or movies or TV shows they listen to are American - just Kanye, it's like... you know, the way a lot of people dress, and the way the actors that people might imitate, or the movies that they might be into, it's not to say that Europe's not creating great things or Asia's not creating great things or Northern Africa or Africa. What it is, is that we really are the epicenter of culture in a broader sense - we don't have an old culture.",
            "start": 1009.96
        },
        {
            "text": "not creating great things or Asia's not creating great things or Northern Africa or Africa what it's that we really are the epicenter of culture in a broader sense we don't have an old culture we don't have a refined culture we have a pop culture we have pop culture it's really weird it's really weird when you see like K-pop music videos and then they're all wearing like these weird mixes of like things that were in '90s hip-hop videos you're like or there's a breakdown of an English ver where they start talking talking in English all that stuff too yeah but uh it's it's just so weird that they'll be wearing like basketball jerseys and holding up WWE Championships and you're like huh like what is happening here yeah turns out that rap was all about 1997 W no it's us SummerSlam um not well I mean that with fashion you know fashion is one of those interesting things that like could be a topic call to its own because generally a lot of the fashion trends start in Europe and then they",
            "start": 1051.24
        },
        {
            "text": "I mean that with fashion you know fashion is one of those interesting things that like could be a topic call to its own because generally a lot of the fashion trends start in Europe and then they trickle out here and then we kind of bounce back to the rest of the world, that's my sort of layman's understanding of how that all works but yeah when they have Fashion Week when they have Fashion Week in Milan um all of the big designers will get together and talk about what the next year is going to basically be and that's that's essentially what we see those trickle to New York first and then you know to New York in LA first and then I don't know how they get to send to the rest of the world, European and Asian fashion has always been sort of like they kind of find it and put their own twist on it um but and I agree with Colin it's it's unfortunate that our pop culture is the culture that we sort of export to the rest of the world it's kind of it didn't used to be that way I",
            "start": 1094.08
        },
        {
            "text": "\"Twist on it, um, but and I agree with Colin it's it's unfortunate that our pop culture is the culture that we sort of export to the rest of the world. It's kind of it didn't used to be that way. I feel like we used to be a lot more uh conscious of the world, especially when we were fighting wars like Vietnam or we were in the Cold War. Like I think it's because often we didn't have the internet and so there wasn't sort of that sort of uh thing that pulled all of our attention away right. We just had newspapers and potentially someone was going to drop a nuclear bomb on us at any any given time, so that was kind of like hey pay attention to what's going on in the world because Russia might by way of Cuba launch some nukes at us. Um I'm so happy that's just not how it is now. I mean just BuzzFeed lists still are but we just we're too busy with BuzzFeed lists going just to care about it, like like I was talking to Colin earlier is like a lot of people are saying that we're in the\"",
            "start": 1128.6
        },
        {
            "text": "BuzzFeed list it still is but we just were too busy with BuzzFeed List's going just to care about it like, like I was talking to Colin earlier is like a lot of people are saying that we're in the middle of a second cold war with Russia which I think is almost a self-fulfilling prophecy when you start saying that then then it becomes true stop saying it then you're the problem but I will say this I'm disappointed with myself that I'm not a Problem Solver I I'm disappointed with myself that I don't know um a lot about like I think the average American should at least know have a have sort of a cursory knowledge of what's happening in countries where where we're fighting Wars where we're sending American Americans to go and die in um and it's disappointing to myself every time I learn about what's happening in you know Afghanistan or what's happening in Iraq or what's happening in Syria or what's happening you know uh between you know Palestine and whoever Palestine's pissed off at which I'm",
            "start": 1165.72
        },
        {
            "text": "happening in you know Afghanistan or what's happening in Iraq or what's happening in Syria or what's happening you know uh between you know Palestine and Israel which I'm assuming is always at odds with each other um tail us to oldest times see even there I'm just hesitant to say Palestine and Israel because I don't want to get that wrong because I'm not quite sure exactly what that history is but it is disappointing that we're sending countless Americans over there to defend something that I'm not even sure why they're going over there what the Kur fuffle is all about we should know that like we're spending trillions of dollars in defense money to go all around the world and do these things and I don't have a **** clue why we're doing most of that except the only thing that that I hear over and over again is because someone has an oil interest there and so we're allying there to have sort of strategic stronghold for oil",
            "start": 1206.84
        },
        {
            "text": "except the only thing that I hear over and over again is because someone has an oil interest there and so we're allying there to have sort of strategic stronghold for oil, that's probably the reason why we're in a lot of places. But yeah, it's like the point I'm trying to get to, I think, is that when I go to other countries, I've been really fast, I read a voracious amount about other places, especially when I'm going there and I like to learn about them and I like to learn about what they do. And I know that like I'm the doofy American in a lot of these places, especially Japan where it's like you know I don't speak Japanese and I'm sorry, like you know, like I try to at least be humble about it. Um, and I couldn't imagine speaking to a tourist in the United States the way I was spoken to in Iceland by that woman, you know? I mean, I can't believe she spoke to you like out of all the situations, out of all the tourists, it was Colin Moriarty who got talked to so funny, yeah, and I was very...",
            "start": 1244.4
        },
        {
            "text": "to Iceland by that woman, you know, I mean I can't believe she spoke to you like out of all the situations out of all the tourists it was Colin Moriarty got this talk so funny yeah and I was very and I was very and I was super annoyed with her and I I definitely you know hurled some insults at her and I'm not sorry about it but like the um and it definitely amused Cheryl's friends but the because they again never saw that like they don't know me well enough to know that that's like pretty much everyday for me but what like I I I try to go with an appreciation of other places and learn about them one of the things I think about is like I hate the TSA right like whenever they go through my stuff I give them like just I I've traveled with you yeah but when I went to Germany they went through my bags I didn't say anything I'm like I'm in your country now you know like you're letting me in and this is the way it's going to go I guess and and I quote as Colin what goes through every single",
            "start": 1281.32
        },
        {
            "text": "my bags I didn't say anything I'm like I'm in your country now you know like you're letting me in and this is the way it's going to go I guess and and I quote as Colin what goes through every single time have fun violating my civil rights have fun what is it you say you're like this is not this was not in the Declaration an illegal seizure it's a fourth amendment hilarious um but I I just you know I I understand that some Americans go around the world or just talk on Twitter whatever and beat their chest and like we're the best we're the best and I do agree with Nick I do think we we are like the best in a lot of ways but that's just me being like a home fan like a home team fan and like it's just I wish that people would put the shoe on the other foot and kind of realize like okay you feel this way about us but why do you think that we're like this and why do you think that like we're maybe you have a kind of a comic book image of us but maybe we're just like you you know but I mean",
            "start": 1319.16
        },
        {
            "text": "this way about us but why do you think that we're like this and why do you think that like we're maybe you have a kind of a comic book image of us but maybe we're just like you you know but I mean like you're just talking about being racist or bigoted in any way I mean think look at how people how people have talked and thought about French people forever oh they smell and this and we bra and **** like it's the same thing that exists everywhere oi horrible Australian Impressions we had one man he was a godsend named Steve Irwin and we based our impression on him Paul Hogan somehow too no I mean it's just it's everywhere it's every country it's every culture you're right it's just unfortunate because I like I see American culture so much in other people you know when they're on their like i' I've said it before on Twitter is that people on their iPhones on Twitter or Facebook you know listening to Kanye and watching the Kardashians on TV and I'm like dude That's All American now",
            "start": 1357.2
        },
        {
            "text": "I've said it before on Twitter, is that people on their iPhones on Twitter or Facebook, you know, listening to Kanye and watching the Kardashians on TV, and I'm like, \"Dude, That's All American.\" Now, you can hate us all you want as you're on your MacBook, you know, on your Chrome browser Googling something. But like, think about the irony of that. You know what I mean? Like, we give a lot to the world, and that's the one thing that...like, I want people to just, we're all it doesn't make us better; it just means that when I when I have encounters like this, I'm just confused by them because don't like yeah we've done bad things but we've done great things. And I wish that we could just kind of focus more on the great things. There's so much divisiveness and it was startling for me to experience it firsthand. I was like, \"I almost thought that like people really didn't feel that way about us,\" you know? But then I experienced it. I think people...you know, I'm not saying everyone feels that way.",
            "start": 1397.76
        },
        {
            "text": "it firsthand I was like I I almost thought that like people really didn't feel that way about us you know but then I experienced it I think people you know I'm not saying everyone feels that way again most people in Iceland were very nice yeah and I I mean I've encountered a ton of people that love America want to visit America like like what we stand for like the culture and like what we export um but I do think that I mean My overall feeling is that I think more people would be able to tell you more facts about the Kardashians than the war on Iraq that would be my my general feeling is like if I asked if I asked 10 Americans give me 10 facts about Iraq they would probably not they would probably be able to name all the Kardashian sisters what the shows are that they're in who they were married to and what their kids are named before they could tell me 10 facts about Iraq that's an endemic Western problem though I think because I think that if you went England was involved in the",
            "start": 1441.64
        },
        {
            "text": "married to and what their kids are named before they could tell me 10 facts about Iraq that's an endemic Western problem though I think because I think that if you went England was involved in the Iraq War for a long time and they would have the same problem I don't I don't believe for a second that the English are more politically active than we are we're all apathetic at this point and it's sad but the one thing that we can you know I want people to come to the United States I want them to enjoy it here I want them to have good experiences it it Horrors you know what Greg said is true and what you guys were insinuating was true I'm sure that there are foreigners that came to the United States that will never come back here because of an experience they had here because there are idiots all over the place when you have 320 million people millions of them are going to be idiots millions of them so like imagine being anywhere from the Middle East anywhere",
            "start": 1480.4
        },
        {
            "text": "There are **** all over the place when you have 320 million people, millions of them are going to be ****, millions of them. So, like, imagine being anywhere from the Middle East, anywhere from the Middle East, looking any sort of Middle Eastern and coming here. The like with the eight-month span after 9/11, just think about that, think about what you may have encountered coming into JFK. You know I like how you limited it to eight months, I mean you know what I mean, like no one well they didn't they limited travel for what like I think that I would say just any time in the last 14 years that's probably true that's probably true. I imagine coming in and out of security now even if you're a citizen of the United States, in your middle eastern, it's it's we have a lot of stereotypes suck and this I mean that's the long short of it and like having to pay for past mistakes sucks and like the fact that I mean what you think of a German right like there's still World War II what I",
            "start": 1512.64
        },
        {
            "text": "suck and this I mean that's the long short of it and like having to pay for past mistakes sucks and like the fact that I mean what you think of a German right like there's still World War II what I was trying to think of this for this reference remember during 50 Shades of Grey there were two trailers that were back-to-back where I was like man if you're a German in here you just got punched twice oh yeah cuz they were both like man Germany sucks and it's like **** you know what I mean just because they're still harping on everything that happened over there Generations ago and that's just how this goes and how stereotypes are that's a great example like German guilt is a real thing it's a real there's a a German word for it I don't know what it is but like that's a real thing but like we often have to let go of the sins of the past and the sins of the father and that's kind of the same way for us in terms of History we can talk about the positive we things we did with history we",
            "start": 1547.56
        },
        {
            "text": "we often have to let go of the sins of the past and the sins of the father and that's kind of the same way for us in terms of History we can talk about the positive things we did with history we revived republic like small r republican democracy that spread all over the world we did that you know what I mean like and so there are things in our history also that we can be proud of but but the thing that I walked away from this being is that like I have to be more worldly I have to I have to judge people as individuals which I judged this woman by and not by the Icelandic people for instance which were really extraordinarily nice to us except for that one instance and kind of have some sort of like we're we're we're all the same like I want people to come here and enjoy the fruits of America and I want to go over there and enjoy the fruits of England or enjoy the fruits of France or whatever or China or Japan there's way too much divisiveness and anti-Americanism is",
            "start": 1581.04
        },
        {
            "text": "the fruits of America and I want to go over there and enjoy the fruits of England or enjoy the fruits of France or whatever or China or Japan there's way too much divisiveness and anti-Americanism is real but maybe to Greg's point it's not any faker or more real than anti-French sentiment you know or um anti-Korean sentiment or whatever you might have so I mean that's a good point and I feel like it is though I feel like we get man we do so much more in the world than the French do and so there's so much more left open for people to criticize US based on like how many places is the United States military right now as opposed to the French military as opposed to the Italian military or even England like we're everywhere man we've got bases everywhere and we won't shut any of them down for strategic advantage it's weird to me you have to say it though cuz we pay for this like what was that statistic you",
            "start": 1622.8
        },
        {
            "text": "got bases everywhere and we won't shut any of them down for strategic advantage. We think it's weird, though, cuz we pay for this. Like, what was that statistic you said? 50% of the budget goes toward the military. Think about that. How much is the national budget - 3.2 trillion or something like that? That's a lot of cash we're putting out there to keep our 18-year-olds in foreign countries with guns asking them to fight people they don't know. That's the general budget, not the military budget. The military budget would be half of that, then 50%... um, the defense budget, yeah. I-I-I don't know. I just want to bring this topic up; I thought it was an interesting topic. We have a lot of European listeners and just over you know Australian listeners and Asian listeners and people from all over the world - Israel. And I'm curious in the comments too how they feel and like what their encounters were. I wanted to kind of solicit that as well.",
            "start": 1672.68
        },
        {
            "text": "listeners and Asian listeners and people from all over the world Israel and I'm curious in the comments too how they feel and like what their encounters were I wanted to kind of solicit that as well because we maybe they've had the bad experiences we were alluding to where maybe they come to the states and are treated but I couldn't the one thing I told my group when I was there and we all agreed was that I couldn't imagine talking to anyone like that not only a traveler or a foreigner or whatever in the United States someone who's just here you know anyone and I think that that tells that that's the difference between now if you come at me my friends I'll **** knock you out you know what I mean that's that's like a different you know that's a different kind of situation you talk **** to Greg or anyone like that but I'm not going to instigate things with you but do you feel like it was do you feel like it was bigger than this or do you feel like it was on the level of my team's",
            "start": 1709.6
        },
        {
            "text": "to Greg or anyone like that, but I'm not going to instigate things with you. But do you feel like it was bigger than this? Or do you feel like it was on the level of my team's playing your team and we're just going to start throwing random facts at each other to piss each other off? No, I think that it was it was in the moment pretty real and in hindsight pretty real. And I don't think I...I don't know if I did justice about how **** up it was you know like I've also thought about it so much that you like lose sight of like what specifically happened. And I was so amped up, yeah I can imagine. Um it's like a perfect situation where yeah I know like you waited your whole life for that moment to fight for America. I'll never be able to fight. I do some in some **** bar in Iceland awesome uh but nevertheless I wanted to you know I wanted to just bring that up there like people as far as I'm concerned people are welcome to this culture people are welcome American culture",
            "start": 1747.44
        },
        {
            "text": "awesome uh but nevertheless I wanted to you know I wanted to just bring that up there like people as far as I'm concerned people are welcome to this culture people are welcome American culture is a M is truly a Melting Pot we don't have a deep Thousand-Year history like the Icelandic people do for instance but we have a a history of melding different races and different cultures and different ethnicities and religions together and it made something uniquely American no one can deny the success of this country you know and no one can deny the success of this country's pop culture which is everywhere maybe for maybe for the worst but we all enjoy it and enjoy the fruits of of of America anywhere in the world yeah and so I wanted to throw that there solicit other people's opinions on what on their experiences what their opinions are on this you can let us know in the comments or you can tweet of course I'm always happy to talk about it but but I do want to say again as I prefaced it my",
            "start": 1788.32
        },
        {
            "text": "their experiences what their opinions are on this you can let us know in the comments or you can tweet of course I'm always happy to talk about it but but I do want to say again as I prefaced it my experiences otherwise overseas in the countries I've been in have been nothing but positive and people have been really nice to me and I know I'm the doofy American in Germany walking around being saying the first thing I say is I don't speak German and they're probably like hello you know I speak English because I live on a continent where we know three or four languages you know yeah well as a general note the first thing you should always learn when you go to another country is how to say please and thank you oh I mean I know how to say those things but when you're having like a conversation at a like I'm not going to I'm not going like we were I was reading we were reading Icelandic terms one of the guys there was trying to learn things and I'm like I'm not even going to",
            "start": 1825.16
        },
        {
            "text": "a conversation at a like I'm not going to I'm not going like we were I was reading we were reading Icelandic terms one of the guys there was trying to learn things and I'm like I'm not even going to bother because like I'm going to butcher and insult these people I'm gonna say something totally wrong and get us killed or something like that so dude I went to Thailand and it took me like four days to figure out how to say thank you which was it's different depending on the the uh whether it's masculine or feminine like you're talking to yeah gender um I can't remember how to do it but it's it's like that and same with Japan Japan is like you can't not be a caricature of American in Japan cuz it's such a culture shock where you're like what the **** is happening all the time and people are looking at you cuz you're the one white dude in the sea of Japanese guys and you're just like you what a **** idiot this guy is look at him look at him he's smoking there he can't smoke there",
            "start": 1855.96
        },
        {
            "text": "looking at you cuz you're the one white dude in the sea of Japanese guys and you're just like you what an idiot this guy is look at him look at him he's smoking there he can't smoke there you feel you feel like a fish out of water but in a good way and I think all of us Tim should get out there and travel it's important to feel stuff makes me sound like I'm just going to stay here and not insult people no I mean I think I feel like it's to go to other countries and be in those and have those experiences where you're like wow I'm an American in a foreign country it's it's a very good experience to have",
            "start": 1893.96
        }
    ]
}