{
    "id": 2395,
    "video_id": "rnbcabO1uX8",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Stories From Australia - The GameOverGreggy Show Ep. 167 (Pt. 1)",
    "description": "Tim and Greg tell their stories from Australia.\n\nThanks to MVMT Watches for sponsoring this episode. Go to http://www.MVMTwatches.com/greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1486972807,
    "duration": 2914,
    "transcript_chunks": [
        {
            "text": "This episode of the Game Over Greg Show is brought to you by Movement Watches. Movement Watches was founded on the belief that style shouldn't break the bank. The watchmaker's goal is to change the way consumers think about fashion by offering highquality minimalist products at revolutionary prices. With more than 500,000 watches sold to customers all around the world, Movement Watches has solidified itself as the world's fastest growing watch company. Movement Watches started just $95, but at department stores, you're looking at 400 to 500 bucks. movement figured out that by cutting out the middleman and going online, they can get rid of all that retailer markup and just get you the watch you want. Get 15% off today with free shipping and free returns by going to movementwatches.com/gregy. That's mvmtwatches.com/gregy. What time is it? It's time to step up your watch game. Now, they said it was time to step up your watch game. I added the what time what time is it thing in the front",
            "start": 0.08
        },
        {
            "text": "That's mvmtwatches.com/gregy. What time is it? It's time to step up your watch game. Now, they said it was time to step up your watch game. I added the what time what time is it thing in the front because I thought that was funny. movewatches.com/gregy. [Music] What's up everybody? Welcome to the Game Over Greggy Show. I'm one of your hosts, Greg Miller, alongside the producer/seducer, Nick Scarpino. What's this shirt? Uh, this is a Death Eater shirt. Got this in London when I went and saw the Harry Potter. How am I just seeing it now? Uh, you've seen it once before, I think. Really? Yeah. Really? It's a dope ass shirt. Yeah. They redesigned the Death Theater logo for that show and this is it. And it's Why did they do that? That seems like it goes along with the whole the uh art direction for the whole show. They did all the logos and the house logos and all that stuff in this more like angular style. It's really cool. Oh, sure. Okay. They want a Halo emblem. It does. It does remind",
            "start": 38.52
        },
        {
            "text": "for the whole show. They did all the logos and the house logos and all that stuff in this more like angular style. It's really cool. Oh, sure. Okay. They want a Halo emblem. It does. It does remind that. Yeah. Over there, the pure one Tim Gettys. Alfredo's old team was team Kitty Cowboys, which I appreciated. It was a kitty with a cowboy hat. Don't need to be too complicated. Are you sure? Mhm. Okay. What do you mean am I sure? It could be complicated. You seem like a man who likes a little bit something complicated. Oh, yeah. But it's like this this like minimalist just kind of like just shapes, you know, kitty shape of a face and a kitty. Now I I had the opportunity to get one of the house shirts while while we're here while we're talking about this because you seem very interested in this. But I decided not to because this was this is really strong. Is the real answer because do you want to let you buy that many nerdy things? No, actually the really answer was because they were",
            "start": 89.84
        },
        {
            "text": "this. But I decided not to because this was this is really strong. Is the real answer because do you want to let you buy that many nerdy things? No, actually the really answer was because they were like they were an odd Heather Gray and I was like, \"Oh, I do like Heather Gray, but then I think they have like the pocket on it and I'm not really down. Can't I can't mess with that.\" Well, also they did they run out of sell out of your your house. Ravenclaw. Um, how dare you? A and B. Uh, yes. No, I think they have plenty of Ravenclaw. They always have plenty of Ravenclaws. They always sell out of Gryffindor and Slytherin. So, we just flew to Australia. So, I was on a really long flight and on that flight I was uh working doing a lot of organization of my notes that I've taken over the the year. And one of those uh notes was do a short called That's So Ravenclaw with Nick. That's pretty good as far as that idea went. No, that's great. We'll write that right now. And over here, the last",
            "start": 126.4
        },
        {
            "text": "year. And one of those uh notes was do a short called That's So Ravenclaw with Nick. That's pretty good as far as that idea went. No, that's great. We'll write that right now. And over here, the last Long Island boy. Call Morardi. That was awful. This is all the other ones. I mean, hey, I perfected it and then people say it was getting boring. Now they get bad stuff. That's what they get. I really like that. Thank you. What's going on with the Islanders? Are they moving away? Are they not? What's happening? I I was in Australia. I see. So, you put out a tweet or something. and they're moving away. The governor of Connecticut wrote a letter to the ownership saying that they can move there if they want to Hartford, the Wales to the Whaler to the Whalers uh hometown. Uh I don't think that's going to happen. Basically, the the the Barclay Center where they play in Brooklyn, released their financials for the next few years, their financial synopsis for the next few years and after the",
            "start": 159.76
        },
        {
            "text": "going to happen. Basically, the the the Barclay Center where they play in Brooklyn, released their financials for the next few years, their financial synopsis for the next few years and after the Islanders have an out clause after a few years, whatever, in 2018, 2019. And after that, there the Islanders aren't even on the docket anymore. So assuming that there's some backend deal where they're going to leave. There's all sorts of things in play right now and I don't know what's going to happen. What happens if they go and become the Whalers again? They're not going to become if they go they're not but the last name twice in a lifetime. It's a weird kind of thing because if they move to Quebec or to Kansas City or something, I'm done with the NHL and I'm done with the Islanders. Uh but if they they move back to Long Island, which is a pos huge possibility, that would be great. They move to Queens, that would be fine. Uh the Mets owners are trying to get them to move there. But uh if",
            "start": 201.04
        },
        {
            "text": "they they move back to Long Island, which is a pos huge possibility, that would be great. They move to Queens, that would be fine. Uh the Mets owners are trying to get them to move there. But uh if they move to Hartford, there is something alluring about that to me because the Hartford Whalers moved obviously in the mid '90s they became the Carolina Hurricanes and the Whalers uh are gone. But they have a they have a great tradition in that town for hockey and they're a miserable fan base too. So, it'd be funny to like move the Islanders there, have them become the Connecticut or the Hartford Islanders or something like that because, you know, Hartford's not that far from the water. And then, uh, we can combine the two miserable fan bases in the one. And we would get the brass bonanza, which is still the best goal song and we're going to hockey. So, you're going to need to rap, please. What is the brass bonanza? Do I anyone have their they used to play they used to play that like after",
            "start": 232.96
        },
        {
            "text": "is still the best goal song and we're going to hockey. So, you're going to need to rap, please. What is the brass bonanza? Do I anyone have their they used to play they used to play that like after the Whalers would score a goal in like the 80s and the early 90s and fantastic. Yeah. And it's like I need more of that and that place where they go crazy at the Civic Center the Harford Civic Center or whatever. It'd be funny to get like they don't have any tradition there except for that song. So we could just take that song put a little Hartford patch on on the Islanders jerseys and then I remember when I busted that out one day and you're like wow how do you know that song? I don't know. I was just from NHL94,9394, but it was just I don't remember being only attached to them in that game. I think every the organist just everywhere played it. It's like whatever. Here's a [ __ ] Yeah, it was it was a big deal in NHL94 because obviously there's very limited space like they they did little",
            "start": 271.28
        },
        {
            "text": "think every the organist just everywhere played it. It's like whatever. Here's a [ __ ] Yeah, it was it was a big deal in NHL94 because obviously there's very limited space like they they did little Easter eggs for some of the teams like at San Jose. They do the they do this and they actually animated that like them doing that and then they put Brass Bonanza only when you played in Hartford and scored a goal there. I can't believe I played in Hartford that much to memorize that song. You know what I mean? Colin, do you think there's any chance of them looking at like a heat map of the United States and being like, \"Where are the Islanders fans and then seeing the one little blip in San Francisco? We're coming to San Francisco.\" Well, they're getting further and further suffers. How would that sit with you? What would What would happen if they came to California? If you came to California, they weren't They're not going to come here. But I mean, if the the Would you still be a fan? No.",
            "start": 308.8
        },
        {
            "text": "sit with you? What would What would happen if they came to California? If you came to California, they weren't They're not going to come here. But I mean, if the the Would you still be a fan? No. If they move if they leave if they leave New York and if they don't go to Hartford, I'm I am done. But what if they came to you like they came here? They just part of being Labu and all the friends are just living in your apartment. Lu, we've talked about this. We've talked about this in the past. We've talu is one one of the great all-time NHL players, French Canadian players, Juju Leu, great goal scorer, really soft hands. The uh the thing about sports fandom that we've talked about in the past is that sports phantom is supposed to be in my mind and in the minds of many an association to where you are from. You know, I always got mystified when someone's like, \"I'm from Cleveland and I'm a big Blue Jays fan.\" Like, how the [ __ ] is that possible? You in California I grew up was a Yankees",
            "start": 341.84
        },
        {
            "text": "you are from. You know, I always got mystified when someone's like, \"I'm from Cleveland and I'm a big Blue Jays fan.\" Like, how the [ __ ] is that possible? You in California I grew up was a Yankees fan. That wasn't cool. That doesn't make I mean that doesn't make sense unless you have parents or something that came from that place. Like if I have kids, they'll obviously be Jets fans and Islanders fans and that wouldn't make any sense cuz we probably won't live there. But generally, so like it would be weird for me to like I don't I I associate with the teams that are from where I'm from. I have no interest in any other teams. Everyone's always like, \"Oh, who are you rooting for tonight?\" I'm like, \"If the Jets aren't playing, I don't give a [ __ ] who wins.\" You know, I root against certain teams, of course. So if they moved that's got to be though just the fact that you were raised with good East Coast values. You were brought up in the world of sports. I feel like if you get a late",
            "start": 381.44
        },
        {
            "text": "teams, of course. So if they moved that's got to be though just the fact that you were raised with good East Coast values. You were brought up in the world of sports. I feel like if you get a late start on sports, you don't learn it from your family or who you're around. Think of it that way. Like if I was in Chicago and I mean that was the thing, you know, like my parents didn't care about sports, so I got a late start for sure. But let's say I they never I never got into the Bears on my own, right, for NFL, but somebody from San Francisco had moved out there, started coming to my school. They liked it. We hit it off for video games and then I started watching the 49ers with them. Weird stuff like that. I guess I just I don't get me wrong, I'm with you. You should support where you're from here. When I see like as a viewer of our I think I was busting his balls as a viewer of ours, one of the shows I I remember where it was and when it was it must have been a year or so ago had a",
            "start": 409.76
        },
        {
            "text": "from here. When I see like as a viewer of our I think I was busting his balls as a viewer of ours, one of the shows I I remember where it was and when it was it must have been a year or so ago had a Packers hat. I'm like, \"Oh, you're from Wisconsin.\" He's like, \"No, I'm from, you know, Texas,\" whatever. And I'm like, \"You knocked him.\" [ __ ] super convenient that you're a fan of the Green Bay Packers who are like this notoriously awesome team with an amazing fan base and all that kind of stuff. You just got to choose them. You don't get to choose. See, that's what I'm saying. You don't get to choose. It's true. They choose you based on where you're from. And I got chosen by just an abomination of teams. Just an absolute [ __ ] holocaust of [ __ ] sports team. You understand what I'm saying? One day they'll be good. Yeah. No, they always say you can pick your nose, you can pick your seat, but you can't pick an A. So, you know what I'm saying, Nick? What's up, everybody? If you didn't",
            "start": 441.92
        },
        {
            "text": "One day they'll be good. Yeah. No, they always say you can pick your nose, you can pick your seat, but you can't pick an A. So, you know what I'm saying, Nick? What's up, everybody? If you didn't know, this is the game over Guggy show. Each and every week, sometimes five best friends gather on this table. What you I mean, you technically can pick an [ __ ] if you wanted to. You can pick out it. You can pick in it. You can do a little hook motion with your finger. Try to get it to like if they someone had corn. Just dig in there. See? See what's in there. Are you getting around the rim? Just getting in there. Bringing a random topic of conversation for your amusement. If you like that, you can head over to patreon.com/kindfunny and get each and every episode early along with a bunch of exclusive perks and goodies. If you have no bucks to toss our way, no big deal. Head over to youtube.comkindfunn where I put the entire show up topic by topic daybyday until it goes up as one big video",
            "start": 478.24
        },
        {
            "text": "perks and goodies. If you have no bucks to toss our way, no big deal. Head over to youtube.comkindfunn where I put the entire show up topic by topic daybyday until it goes up as one big video and MP3. The following Friday, Tim, yeah, we just got back from Australia. We did my first ever international trip. I am now a world traveler. People all around the world. Congratulations. Not only that, but instead of going to like Mexico or Canada, we decided to go to the most far away place possible. Down under. Yeah, it was real far. I want to hear all about this. This is exciting for me. Uh, Exactly. You lied and said you got a lot of work done. You were never working on this trip. Very briefly, were you ever working in on your airplane seats and doing all this stuff? You were sleeping for like 8 hours on the flight when I was on the I used my laptop until the battery died. But is okay. Yeah. To be fair, the laptop battery dies in like 55 minutes. No, the new laptop that I bought just for my",
            "start": 514.96
        },
        {
            "text": "hours on the flight when I was on the I used my laptop until the battery died. But is okay. Yeah. To be fair, the laptop battery dies in like 55 minutes. No, the new laptop that I bought just for my flight. That baller ass back laptop. Yeah. No, I don't believe that for a second. I believe the woman next door us, the woman who was in between us, the large woman in between us. No, no, no. Couldn't work that. You were sitting in a fat chick was sitting in between you guys. We got We got No fat chicks. He was on the side of the plane. It was It was bad. It was his hair says don't Patrick's on the side. It was It was bad. Um but just because I had this whole plan where me and Greg were like, \"All right, Gia was going to come with us and sit in between us and that wouldn't have mattered at all cuz Gia is tiny.\" Yeah, it would have been fine. Uh but then uh at the last minute someone got the seat in between us. That was sad. But the way she was wearing like a pleather coat, too. Oh, just",
            "start": 557.92
        },
        {
            "text": "cuz Gia is tiny.\" Yeah, it would have been fine. Uh but then uh at the last minute someone got the seat in between us. That was sad. But the way she was wearing like a pleather coat, too. Oh, just had too much perfume on She kept offering me candy. Was she American or Australian? I want to say she was what they call a kiwi. She was going she was ending up in New Zealand. She had the accent and I did not understand why she was connecting from Australia to then get back up to Europe, but that's what she was doing. She kept giving me candy might be and I didn't want it. She's like like five times throughout the flight. I'm like I'm good. She That's always super awkward. Colin, as you know cuz you're documenting me. I can sleep on a plane like nobody's business. I'm very lucky in this thing. But usually when you sleep, I sleep on a plane because they're domestic flights, six hours, whatever. I'll get a few hours there. But then you wake up with that crink in your neck. You know what I",
            "start": 595.36
        },
        {
            "text": "But usually when you sleep, I sleep on a plane because they're domestic flights, six hours, whatever. I'll get a few hours there. But then you wake up with that crink in your neck. You know what I mean? You jerk awake, then you're awake, you play some video games, you watch some TV. This one, I decided to treat myself, kick my heels up, enjoy the fruits of our success, some would say. And I bought one of them [ __ ] pillow things for your neck, right? And so I get on here and I'm out like I I stayed awake for a few hours to try to Those pillows work. Yeah. Well, for me, it was it's the missing piece. They don't work for me for some reason. It was the missing piece for me cuz I'm always able to sleep but just not for, you know, it's a 14- hour flight or whatever. I was like, I want to at least get I want to try here. And I Yeah, I was awake at maybe the first hour and a half, 2 hours of the flight, then out for majority of it. Eight, six, six or eight hours or something. Grand total. I",
            "start": 638.32
        },
        {
            "text": "get I want to try here. And I Yeah, I was awake at maybe the first hour and a half, 2 hours of the flight, then out for majority of it. Eight, six, six or eight hours or something. Grand total. I was awake 5 hours on this plane. Crazy. Uh, but every like the people would come by for beverages and she would like do this and like I'm like, \"What?\" She's like, \"You want?\" I'm like, \"No, I'm sleeping. What are you doing?\" And then the kicker was when the the the dinner service had come, breakfast in the morning, but they came by with a turkey sandwich snack, like these wrapped up turkey sandwiches, and she like shook me awake and gave and then gave it to me. Didn't even hold on to it herself. I'm like, I don't [ __ ] care about this. Go away, woman. Usually, usually they are on the other side, which is that they won't even if it looks like you're half asleep. I think this is a This is the woman in the corner. Clearly, I see. So, not to fight, but the fat chick was taking the things from",
            "start": 670.64
        },
        {
            "text": "which is that they won't even if it looks like you're half asleep. I think this is a This is the woman in the corner. Clearly, I see. So, not to fight, but the fat chick was taking the things from She wasn't fat. A morbidly obese woman sitting in the middle of you guys took the things and then were given. Yeah. Yeah. And but no, to your point, she very much was one of those people that sat down on the plane and then you could see it in her eyes. Brought she first off brought nothing to do. She had nothing to [ __ ] do on this plane. I got I have iPad and VA and books and Yeah, exactly. I'm just going to stand there. But we have the entertainment system built in. Nothing just sitting there and you can see her eyes. So, I immediately had the headphones on and I was gone. But then on the final thing with breakfast, I popped it off, got my little breakfast tray, and then she started in on it and I was like, \"Yeah, yeah, I put it back on. I'm not going to deal with you. You don't deal with",
            "start": 706.8
        },
        {
            "text": "thing with breakfast, I popped it off, got my little breakfast tray, and then she started in on it and I was like, \"Yeah, yeah, I put it back on. I'm not going to deal with you. You don't deal with you don't talk to fat chicks.\" Now, the the question the question I have about this particular flight was what were the accuchants? Yeah. How did you You didn't have an outlet. It sounds like you had an outlet. There was an outlet. So, but you said your laptop died. So, you just were that was the timing in which you were at that point. I'm like, I' i've done it enough. I did a lot. It offends me that you said I didn't do work. I did so much because here's what happened. You had Wi-Fi. Yeah. Well, if you pay for it, which is fine. But that's awesome because that you have to understand that that that was rare in international flights, not only even a few years ago. So, we have we have that you have all the stuff you brought. You have the entertainment system with the free your own individual.",
            "start": 747.12
        },
        {
            "text": "was rare in international flights, not only even a few years ago. So, we have we have that you have all the stuff you brought. You have the entertainment system with the free your own individual. I'm trying to just get a picture of it. I hear you. Free internet sort of these [ __ ] international flights. Free movies, free television, not live, but like on demand television. Your It's a very nice plane. You had little power. You had your power. This is a newer This is a newer plane. It had the USB. United is usually fine international. United is fine internationally. It had the USB on the screen so you could charge your devices or do whatever. But this is the problem is I think we have unlimited options. So I when I nod off I noticed this woman's just been sitting there apparently offering Tim Candy. I she wasn't I had the headphones on. She's just standing there just staring at her screen with the map and I'm like man this woman's weird. Whatever. She's watching the big pixel by pixel",
            "start": 781.2
        },
        {
            "text": "Tim Candy. I she wasn't I had the headphones on. She's just standing there just staring at her screen with the map and I'm like man this woman's weird. Whatever. She's watching the big pixel by pixel movie. I go to sleep and I wake up. Kevin, I'm going to need I'm going to need this the shot of me. I wake up and this is I look over at Tim and this is what I see. Oh god. And Tim had gotten possessed by this woman and was now sitting there not using any of his devices, any of the things he brought staring at the map. Just st there was TV. I don't know. There were movies and you were just staring at the map and I she got up and I'm like I can feel the misery radiating off you. You're like this is the worst flight. I haven't been able to sleep. But I don't understand where the breakdown happened where you're like I don't even want to watch moving pictures anymore cuz I I hit a point. I mean, I don't deal well with flights. Like, I'm not scared of them. It's nothing like that. I just wish",
            "start": 816.64
        },
        {
            "text": "where you're like I don't even want to watch moving pictures anymore cuz I I hit a point. I mean, I don't deal well with flights. Like, I'm not scared of them. It's nothing like that. I just wish I could sleep and I can't sleep. So, I'm really uncomfortable and I just don't like it at all. There's no position that feels good. I'm just like, this [ __ ] sucks. And these are tiny little seats, too. So, when you're sharing with people and there's like the whole rule of like who gets the armrest and who doesn't. And this woman was way over it. My thing is I understand if you're in the middle, I give you the right. You get both armrests. I totally get it. But you don't get to cross them. Like, that's what I don't understand about people. And it's like it's not like Colin, she was not large enough to need fat, but she wasn't that fat. That's what you're saying. But like she really didn't need to. All I want to say is she wasn't able to slam dunk basketball. I mean, that's true. What does",
            "start": 853.84
        },
        {
            "text": "to need fat, but she wasn't that fat. That's what you're saying. But like she really didn't need to. All I want to say is she wasn't able to slam dunk basketball. I mean, that's true. What does that mean? I can't dunk basketball. And that's why we know she kept even with her legs and stuff. I'm like looking down. I'm like, well, clearly you're on my side of this thing. Like I also important for this notice. when she got on, first thing she did was take off her shoes. Yeah. Yeah. First thing. First thing. Which is like I'm okay with that when you're around friends, when you're around company that you're like, I don't care. Like if it was you guys, I would do it. Whatever. But like you don't know us. You're really close to us. And I get I will give her the benefit of the doubt that it's like do whatever you can to be comfortable on this hell of a flight. Like fine. Yeah. So yeah, I I exhausted my options. I did so much [ __ ] I listened to Hamilton. That shit's [ __ ] good. Yep. It is.",
            "start": 889.52
        },
        {
            "text": "do whatever you can to be comfortable on this hell of a flight. Like fine. Yeah. So yeah, I I exhausted my options. I did so much [ __ ] I listened to Hamilton. That shit's [ __ ] good. Yep. It is. I listen a little bit of it. Holy damn. Yeah. A lot of people have been trying to get I I was like I went into it thinking I'm not going to like this at all. Like this is like some mainstream [ __ ] and like it just doesn't sound like a good thing. Started listening to it. 2 minutes in I'm like this is really high quality. 10 minutes in I'm like how is this quality still going? Two and a half hours later I'm like the quality never stopped. Yeah. Yeah. It's really good. A lot of people like Hamilton. I I I have to be fair. I have not given Hamilton a fair shake. I heard it I heard one song in my brother's car for five minutes and he was talking over it the entire time trying to explain to me how good the song was. You know my brother how he's like here watch and then he starts like singing",
            "start": 932.56
        },
        {
            "text": "brother's car for five minutes and he was talking over it the entire time trying to explain to me how good the song was. You know my brother how he's like here watch and then he starts like singing along with it and I'm like this is not the optimal listening experience for this. Um so I give Hamilton a lot of [ __ ] Also sometimes it's fun and Colin maybe you'll understand this just to hate on something for the sake of just hating on something that everyone else loves. I don't know anything about that. It's it's just kind of fun sometimes to be the Kogan. Yeah. But uh with that, I don't think that there's any like one song I'd be like, \"Listen to this.\" It's really just the experience of the whole story. Uh but I liked it so much that for the flight back, I ended up buying the Hamilton mixtape, which is like a remix thing, and they added to the original with a bunch of like is that like when they famous artists and stuff when like the girl will sing the song in Moana, but then like",
            "start": 972.56
        },
        {
            "text": "mixtape, which is like a remix thing, and they added to the original with a bunch of like is that like when they famous artists and stuff when like the girl will sing the song in Moana, but then like they'll hire the real pop star to sing the song, and it's autotuned kind of. Uh, but it was a bunch of underground people and like and uh and Common and Bust of Rhymes and like good good [ __ ] Alicia Keys, John Legend, like they did a really good job with it. Um, anyways, I enjoyed that [ __ ] Listened to that. I listened to a whole bunch of podcasts. Um, watched a whole bunch. I watched Moana. Oh yeah. Also, what' you think of that? [ __ ] dope. Yeah, really good. Um, anyway, I did I did a whole bunch of I played a [ __ ] ton of Mario Maker. Played a [ __ ] ton of Yoshi's. See, this is why holy world. I think you guys for 4 hours staring at each other. Best thing is I hit a point I listen to so much music. I hit a point where I'm like I I don't want to do this [ __ ] anymore. It's this",
            "start": 1006.64
        },
        {
            "text": "holy world. I think you guys for 4 hours staring at each other. Best thing is I hit a point I listen to so much music. I hit a point where I'm like I I don't want to do this [ __ ] anymore. It's this is you guys just aren't embracing. Now 16 hours is a lot. That's a lot. I had a great time both flights. I love Well, you mean you sleep like a kitten because you're you're like a criminal. What was that old saying? Criminal already been caught. Sleeps like a baby in jail cuz he knows he's been on your c. Some usual suspects doesn't matter. Totally slaughtered that quote. Um you sound like a dirty limick for he sleeps like a baby cuz he's been on your [ __ ] I'm like what? Oh, wa wa. I like the long flight, though, because it gives you an excuse to only do those silly things that you normally like wouldn't do, right? You It's guiltfree. I'm like, I'm just going to read this stupid book about Andreas Clay for like 6 hours straight because I can do it cuz I'm quote unquote incapacitated. I",
            "start": 1043.6
        },
        {
            "text": "like wouldn't do, right? You It's guiltfree. I'm like, I'm just going to read this stupid book about Andreas Clay for like 6 hours straight because I can do it cuz I'm quote unquote incapacitated. I can't really do anything else. I love that. And I love the fact that you're like, well, I've only got X amount of movies I can watch, so I guess I'll watch this random episode of [ __ ] Community that's halfway through season 6 that they just got on this plane, which is crazy. Well, I bought all my own [ __ ] So, I ended up watching the first half of Teenage Mut Ninja Turtles 2: Out of the Shadows. What do you think of that? I don't understand how people don't like that. It's got [ __ ] movie. But, I mean, it's like, what do you expect? Save that. My topic is going to dial in. Yeah, whatever. It's Ninja. That was as good as ever been. In talks of our Australian trip, we should have spent the first seven minutes on the plane ride. That's part of the fun. Yeah, [ __ ] talk to me like that.",
            "start": 1077.52
        },
        {
            "text": "It's Ninja. That was as good as ever been. In talks of our Australian trip, we should have spent the first seven minutes on the plane ride. That's part of the fun. Yeah, [ __ ] talk to me like that. It [ __ ] sucked, man. And I couldn't sleep at all. So, that that was not not fun. One of these days I'm going in hard. But uh but yeah, I did I did end up watching a whole bunch of random stuff and I don't I don't know why we're talking about this now, but we landed. Okay, so now you're in Australia. Yeah, now we are finally in Australia. And immediately we're in over our heads cuz the first thing we do, we meet our guardian, one of the guardians, lead guardian who's going to take us to the hotel. We got to wait for all the other RT clowns to show up. It was not Aaron Porter from Austin, Texas. Our guardian. Although there was a bunch of Austin guardians there. I only met one. I thought there was like three of them. Bernie brought his own. I didn't realize you could do that. Next year we",
            "start": 1113.04
        },
        {
            "text": "Our guardian. Although there was a bunch of Austin guardians there. I only met one. I thought there was like three of them. Bernie brought his own. I didn't realize you could do that. Next year we have to demand they fly air. Um but no then we went to get coffee cuz we're going to kill time while we wait for the other RT kids and we went up there and like they didn't understand what a black coffee is cuz they don't that doesn't exist there. Well, so what happened was I walk up to the little cafe and I was just like, \"Hey, can I can I get a a large iced coffee?\" She looks at me, looks at Greg and she goes, \"Do you want the slushie coffee?\" And I was like, \"Like the ice coffee?\" She goes, \"Like with ice cubes?\" And I was like, \"Yes.\" And she goes, \"Like with ice cubes.\" And I was like, \"The fact that you had to ask that twice.\" Twice. Yeah. Just let me get a coffee. Can I just No, that's what happened because you said you said yes again. And then you looked at the slushie and you're",
            "start": 1149.28
        },
        {
            "text": "fact that you had to ask that twice.\" Twice. Yeah. Just let me get a coffee. Can I just No, that's what happened because you said you said yes again. And then you looked at the slushie and you're like, \"You know what? Maybe you know what? No, just give me a black coffee. Just give me just give me.\" And that was the problem where I had already ordered and I was like, \"Can I get a black coffee?\" And they just stared at me and I was like, and they're like, \"Do you mean an American?\" And I'm like, \"I guess.\" And they handed me that. So it was hard and you know, we're dumb and ignorant all that [ __ ] So we are. But we're bringing freedom in America. Knowing what ice coffee and black coffee means doesn't make you dumb and ignorant. Just to throw that out there. It's a very weird thing because I've been all over all over the world now in parts of Europe, Asia. Nobody does drip coffee. It's the strangest [ __ ] thing. You ask for a coffee and they they're like, I need more uh I need more",
            "start": 1187.6
        },
        {
            "text": "I've been all over all over the world now in parts of Europe, Asia. Nobody does drip coffee. It's the strangest [ __ ] thing. You ask for a coffee and they they're like, I need more uh I need more adjectives than that. Like I need more descriptors than that. What kind of coffee? It's very strange. It is. I mean, I've I come to learn that they don't have coffee there. Like coffee as we know it is not a thing there. Like the closest you can get is their espresso with a bunch of hot water. I know what an Americano is. I don't want that. They're actually It's probably better tasting. It's just different. It's like it's a lot more steps than necessary. Well, like the true Americans we are, we want quantity over quality. And that was the big problem I had is that on Yeah. Friday, we went I had to go I did went and did rehearsals with Kajjima and then was buming around the thing and hanging out with Guardians and whatever. But we had had drank a bunch of coffee in the morning chilling out.",
            "start": 1216.8
        },
        {
            "text": "to go I did went and did rehearsals with Kajjima and then was buming around the thing and hanging out with Guardians and whatever. But we had had drank a bunch of coffee in the morning chilling out. And when I say coffee, I mean a bunch of long a bunch of long blacks. Long blacks. I was sucking down long blacks like nobody's business. Please tell me you can actually go to a barista and be like, \"I'd like one uh very long, very hot, very hard, throbbing black throbbing black to put in my mouth.\" You say that? Sure. No. So close. There was a lot of Oh my god. I I had a I at one point had a a minute and a half conversation with some guy. There was like 15 mates in it. I was like, I don't know how you do. But I drank so many of them. I had a splitting headache by the end of it. I had to go home. I I was overcaffeinated because I was drinking them like normal coffee and they aren't they aren't normal coffee. Yeah. No normal coffee. No. So that that was like our first experience. Then we",
            "start": 1256.16
        },
        {
            "text": "home. I I was overcaffeinated because I was drinking them like normal coffee and they aren't they aren't normal coffee. Yeah. No normal coffee. No. So that that was like our first experience. Then we saw McDonald's which they lovingly refer to as Mackas there. Um they have a whole bunch of different [ __ ] uh than we have. They have loaded fries which are just like them. This I know you're getting to this, but is this where you ate the kangaroo? No. Okay. No. No. I want this story back. So at the kangaroo um it was just a little bit like there at one of the mixer we were at. Uh, we got to play a Nintendo Switch, hang out with Cojima, and eat some kangaroo. Was it like a skewer of kangaroo or did they actually give you It was a spoon of like ground beef kangaroo. Nobody knew what they were eating and then it turned out it was kangaroo. Is now is kangaroo I'm asking you guys this like your cultural [ __ ] [ __ ] Is kangaroo like is that meat like a delicacy or is it just a staple of",
            "start": 1295.28
        },
        {
            "text": "eating and then it turned out it was kangaroo. Is now is kangaroo I'm asking you guys this like your cultural [ __ ] [ __ ] Is kangaroo like is that meat like a delicacy or is it just a staple of their diet? It's like bison and [ __ ] like that. So people eat it but it's not necessarily you're not going to walk into a store and find a ton of candy. Yeah. Yeah. I was hanging out with Katie, Jack's wife, uh Jack Patello from Achievement Hunter. Okay. and she's she's legit Australian. So, like she was kind of like running us through the whole thing and she was like, \"Oh, no.\" Like, because he came up to me and asked me if I want to try some kangaroo. And I had a moment where I'm looking around. I'm like, \"Is this a trick?\" Like, \"Are you trying to get me to eat this nation's fine mash? I'm not sure what it's called.\" I was like, \"I ain't trying to like, you know, disrespect no one.\" Katie's like, \"No, you got to try it.\" I'm like, \"All right.\" And I did. And I was like, \"Whatever. It's I",
            "start": 1332.88
        },
        {
            "text": "sure what it's called.\" I was like, \"I ain't trying to like, you know, disrespect no one.\" Katie's like, \"No, you got to try it.\" I'm like, \"All right.\" And I did. And I was like, \"Whatever. It's I don't really like I like I like, you know, cow. I'm stick to the cow.\" But I did get to eat the kangaroo. Didn't need to fight one. I had a lot of beef with kangaroos going into this trip. So, I'm happy that it ended with me victorious eating that son of a [ __ ] I'm glad I'm very glad you didn't choose to fight a kangaroo. Largely because Kevin wasn't there and you don't fight for yourself. So, I think that would have been a kind of mistake on your part. It would have been bad, but luckily I didn't need to actually fight. I just needed to eat. Good. Um the just if you if haven't if you haven't been to Australia before, there is just as many koalas and kangaroos and boomerangs as you'd think. Every store we walked by had one on it. I was just like, \"God damn, you guys are going so far into",
            "start": 1365.44
        },
        {
            "text": "been to Australia before, there is just as many koalas and kangaroos and boomerangs as you'd think. Every store we walked by had one on it. I was just like, \"God damn, you guys are going so far into this.\" They know what they're in. They know what they like. And I appreciated it, you know. And there was a lot of kangaroos and koalas hanging out with eagles. And I'm like, \"Wow.\" Now, to be clear, he's talking about stuffed animals. They were We weren't seeing real kangaroos. Every store is like koala store, kangaroo store. I mean, pretty much it was that and then Uggs. There was so many Uggs. Oh my god. Did you know Uggs are from Australia? I think I did. Cuz once you go to Australia, they will shove that [ __ ] down your throat and let you know every [ __ ] store. Every Ugg store has a Ugg in front of it with a kangaroo in it. And I'm like, \"These guys, man, it was fun.\" Like they they were really like crazy and [ __ ] Uh there was a lot of weird [ __ ] in Australia that I like it was",
            "start": 1402.08
        },
        {
            "text": "in front of it with a kangaroo in it. And I'm like, \"These guys, man, it was fun.\" Like they they were really like crazy and [ __ ] Uh there was a lot of weird [ __ ] in Australia that I like it was very similar to here. Like we like this is Seattle. Like this is exactly like Seattle with minor differences that only stood out so much because they were the only things different. Uh they drive on the other side of the road which is really offputting and scary. Very scary when you're crossing the street. Exactly. cuz I'm like it always feels like the cars are coming at you. It was more odd cuz when we were walking on the sidewalk, walking on the sidewalk, Tim and I kept walking as you should as an American on the right and then people kept walking. I like all right, we're in the wrong country. Cuz I was getting mad. You're violating the social contract. And then I realized, no, it's different here. We're the [ __ ] Sorry, mates. We were big [ __ ] Like I I'll just put that out there.",
            "start": 1438.8
        },
        {
            "text": "Cuz I was getting mad. You're violating the social contract. And then I realized, no, it's different here. We're the [ __ ] Sorry, mates. We were big [ __ ] Like I I'll just put that out there. Were we? I think I feel like we were. No. Here's the thing that was the best about Australia, and it took me embarrassingly long to figure this out, but on Saturday after RTX, Sydney, the kind of funny community had a kind of funny meetup where they had organized on their own. Nick got them all together. Not this Nick. Nick down there. And he had Nick's Oh, no, no, there's another Nick in that group's a son of a [ __ ] Okay, we'll get to that in a second, I guess. Pepsi and Wow. Okay. Well, they had done their own thing off the Facebook group and all that jazz to meet up at the Hard Rock uh cafe and they had booked reservations and then more people kept getting at it. So, they met at the bar and like it was like 70 or 80 kids at the bar and then it got boiled down to like I think 50 was it or",
            "start": 1477.84
        },
        {
            "text": "they had booked reservations and then more people kept getting at it. So, they met at the bar and like it was like 70 or 80 kids at the bar and then it got boiled down to like I think 50 was it or something like that to eat dinner. Yeah. And so, when we went in, they all went [ __ ] crazy. And so, the entire Hard Rock stopped to look what was happening cuz we surprised them. They didn't know we were coming except for Nick and a couple other folks. And so, we walk in and the place go just erupts and every every all the normals start looking over like what the [ __ ] going on. we go over and celebrate with them. Blah, blah, blah. And then it was time to move over there. So, I think it was Nick's like, \"Move to the table.\" And like screaming at the top of his lungs. And I'm like, \"Oh, fuck.\" We've done this before. We've had meet and greets. We get in trouble with people all the time. It happens here in America. When I go to Canada, I get told I'm too loud all the time. They don't",
            "start": 1514.8
        },
        {
            "text": "fuck.\" We've done this before. We've had meet and greets. We get in trouble with people all the time. It happens here in America. When I go to Canada, I get told I'm too loud all the time. They don't they're not allowed people. And so, America's loud country. And then I'm like here, I'm like, I don't know how this is going to go. We went there. We sat at the tables. Nick started screaming again for everybody to sit down if they had a thing. I'm like, \"Oh [ __ ] here.\" And sure enough, servers came over. Then they started yelling, not in an angry fashion. He was like, \"What do you want? What soda do I like?\" And I was like, \"Oh my god, this is a country that screams all the time like me and nobody. It's just normal and you're totally fine.\" I think we blended in more than most here. Well, in those terms, I think you're right. So, where were we [ __ ] I don't know. Just in general. I don't know. I felt like one, but that's just I feel like you always feel that way when you're traveling",
            "start": 1545.28
        },
        {
            "text": "in those terms, I think you're right. So, where were we [ __ ] I don't know. Just in general. I don't know. I felt like one, but that's just I feel like you always feel that way when you're traveling in a foreign country, though, cuz you're just not used to the way things are working. And you always have that like that moment where you realize you've either overstepped a bound or you need to ask a question that normal people don't need to ask. like the coffee thing where you're like explain to me how your coffee works. Exactly. So there was a lot of lot of moments like that. So the the no tipping thing was weird to me only in situ well it always it felt weird every time but it felt really weird when there was clearly a tipping option right and I'm like don't if you don't want the tip don't give me the option of do you want to tip cuz then you and so the other thing about Australia is there's there's some law or rule where you they can't take your card away so they need to bring a",
            "start": 1575.92
        },
        {
            "text": "don't give me the option of do you want to tip cuz then you and so the other thing about Australia is there's there's some law or rule where you they can't take your card away so they need to bring a little machine to you and and do it there. So, like there was one time I got like really confused. Like she she handed me the the machine, put my card in, and she goes, \"What account's it under?\" And I'm like, \"That's not a question that makes sense to me.\" Yeah, I don't understand that. I was like, \"Uh, Tim Getty's.\" And she was just like like, \"No, no, no. Like, what accounts it under?\" I'm like, \"Can what accounts it under?\" She just kept asking me. I'm like, \"I don't know what you mean.\" I was just She's like, \"Debit or credit?\" I'm like, \"Oh, oh, credit.\" That's a weird way to ask that question, but you know, whatever. Credit. Start with debit or credit. There's only two options. Super weird. Anyway, I say that and then and she starts running it and then it says, \"Uh, do you want a",
            "start": 1613.12
        },
        {
            "text": "question, but you know, whatever. Credit. Start with debit or credit. There's only two options. Super weird. Anyway, I say that and then and she starts running it and then it says, \"Uh, do you want a tip?\" And then it was the like normal like 10, 15, 20 thing. And I'm standing there. I kind of look at her. She's standing behind me and I wanted to ask the people I'm with like, \"Should I like am I supposed to here and not in other places?\" And they're all having a conversation. I'm like, \"Oh, fuck.\" So, I just hit no. And I felt really bad. But I assume that's what was supposed to happen. I I I I wanted to just jump in and say I think that these things are designed to not prey on Americans or people that do tip, but it's like in Japan it's considered it's it's it's dishonorable to offer a tip or to leave a tip, but I think in Australia they don't do that, but they hope you do. Here you have to. So I think that those are like the strata in my opinion. But that that was it. If she was",
            "start": 1654.16
        },
        {
            "text": "a tip or to leave a tip, but I think in Australia they don't do that, but they hope you do. Here you have to. So I think that those are like the strata in my opinion. But that that was it. If she was watching me, I would get complicated situation for sure. Um what was great for me is I kept getting credit cards declined. Oh yeah. Because like the auto fraud [ __ ] would be going off. I'm like, I got this guys and hand over the car and like in front of friends or fans like yeah this is it's declined. Yeah, the city bank's really protective of that. I get that every time I travel. Every time I travel cars are really weird there. There's no Priuses PI and when they when they travel in a pack they're Yeah. Yeah. There's none. I didn't see any which blew my mind. Um there was this really interesting car that I feel like Kevin would really like that I kept seeing that is like the h first front of it looks like a car but then the back's a pickup truck. I'm like, \"What the hell is that?\" Not",
            "start": 1687.36
        },
        {
            "text": "car that I feel like Kevin would really like that I kept seeing that is like the h first front of it looks like a car but then the back's a pickup truck. I'm like, \"What the hell is that?\" Not now. Not Not a Cam. Not a Camaro. Yeah. Yeah. El Camino. Yeah. El Camino. Sure. Sorry. Yeah. It was It was very Camaro either. It's not a Camaro for sure. El Camino though. It's not either cuz it was like a It was like It had the body of a pickup truck. It could be a pickup truck, but it had a car front, which is more importantly, we kept getting in taxis and Uber vans or whatever that had the vans facing each other, the seats facing each other. That's always fun. But it was like they weren't far enough away, so your knees would always be touching. It was like that's that's poor design and seat belts also go the wrong way. Ah drive on the wrong side of the car. Yeah. It's like there's a lot of like things are backwards and crazy and the wheels are on top of the car. Oh my god. It runs on blood.",
            "start": 1725.2
        },
        {
            "text": "also go the wrong way. Ah drive on the wrong side of the car. Yeah. It's like there's a lot of like things are backwards and crazy and the wheels are on top of the car. Oh my god. It runs on blood. Um the this has been well documented now, but the toilet's there. It's a [ __ ] lie. It's a [ __ ] myth. The [ __ ] does not go the other way. The water just pours from all angles, man. But isn't this just because the kind of toilet we were using? used 23 different toilets in my journey there. 23. I counted. There was a bunch of places I I tried the toilet. Didn't even need to pee. I just went in just to flush just to see what's up. Every single one flushing from all sides. Now, every single toilet totally different. America, we got that bowl with the water in it. Here we got this freaking or not there. There it's like a very shallow bowl and then like there's this hole of despair where you just there were things go down there and then the water just [ __ ] Yeah. They have do they have Did",
            "start": 1764.48
        },
        {
            "text": "there. There it's like a very shallow bowl and then like there's this hole of despair where you just there were things go down there and then the water just [ __ ] Yeah. They have do they have Did you encounter the two different types of fleshes? Oh yeah. That's the most annoying thing for number What do you mean saving water? No water. It's great. It's very economical, very environment. We have plenty of water. That's what I'm saying. I think flush the What I don't like What I don't like is when I go to number two and I I have to see the remnants of that traced down the entire bowl because there's no [ __ ] water in the thing. But then you also kind of feel accomplished. I always do. I don't know about anyone else, but I always take a look just to make sure everything's on point. I like to think of the maid coming in there and be like, \"Oh my god, what did this guy do to this?\" I'm sure it's not the only time they've seen that, but every time they see you, they're probably just",
            "start": 1807.52
        },
        {
            "text": "like to think of the maid coming in there and be like, \"Oh my god, what did this guy do to this?\" I'm sure it's not the only time they've seen that, but every time they see you, they're probably just aruck. Uh, here's the thing you're bringing up. The the toilets don't go whatever. The main disturbing thing was that how hung up bars and restaurants and hotels and everybody else are on the trough still for the urinal and not a trough like I I kept talking to fans about it. Not a trough that I'm used to cuz here in America usually like a a stadium, you go to a stadium, you're going to have the trough there which is raised. This was just the wall to the ground thing and then this weird grate. It was a It was a step up and then a grate. And so when I was at the Hard Rock and found that I was peeing from behind the step like angling it in. And then other people came in and got up on the grate and I was like, \"Oh, that's how you do it.\" There are fans. I started joking about it. I climbed",
            "start": 1841.44
        },
        {
            "text": "peeing from behind the step like angling it in. And then other people came in and got up on the grate and I was like, \"Oh, that's how you do it.\" There are fans. I started joking about it. I climbed up there and pisses splashing back off the wall on your feet. And I'm also this is disgusting. Why are we standing close to it? More than once I found that the troughs had like a reflective wall and I'm like look at your dick. I could see other it's Willie if I was looking, you Well, I mean they're they're just a more cultured people about that. I was talking to people while I was peeing about the way. I mean, who doesn't take a look at another man's dick every once in a while? No, but I mean like they made it too easy. You need the fun in it or else it's not worth it. Like this was just Oh, you need to do the side glance thing. Yeah, the side glance is cool, but like not not like this. Not like this. All right. What else? Um the the trees on sidewalks. You normally we have the little like",
            "start": 1875.28
        },
        {
            "text": "need to do the side glance thing. Yeah, the side glance is cool, but like not not like this. Not like this. All right. What else? Um the the trees on sidewalks. You normally we have the little like either like ground rubble or whatever, but like uh or like just dirt. They have it's just like it's solid. It's like a bunch of pebbles that are put together and it's like [ __ ] were like skateboarding over and [ __ ] and I was like that's that's weird and I just found it that was one of my observations that I made. I like the different things. That was really different. Um everyone says legend. They call people legends. It's like it's more common than mate. He's a legend, mate. I could understand most like oh you're a legend. Yeah. It's like when you're talking like Okay. Yeah. Um menus were were all right and I could understand them until we went to the fancy restaurant and it was just like everything's in use words. Yeah. Like we're trying to g the [ __ ] happening. Is this Is it coming",
            "start": 1906.8
        },
        {
            "text": "all right and I could understand them until we went to the fancy restaurant and it was just like everything's in use words. Yeah. Like we're trying to g the [ __ ] happening. Is this Is it coming in a dime bag? What's going on? A lot of words that I'm like I don't get. Why would they use ounces? Why wouldn't they? Yeah, cuz only us. Only we America. We're free. We use the imperial measurement system. Sorry, by the way. That's what I I've said before, but I in the United States how we just absolutely refuse to do anything the rest of the world does in terms of measurement. It is the [ __ ] funniest thing ever. I love it. It's so great. What the [ __ ] a mile? We crashed the Mars lander because we [ __ ] converted. Yeah, it's good stuff. It's fun. It's fun times. Collided that millions and millions of dollars right into the red planet at 25,000 miles an hour. Hey, got there. Everyone was talking about the spiders and how we had to be careful of the spiders and stuff. Luckily didn't see",
            "start": 1949.6
        },
        {
            "text": "millions of dollars right into the red planet at 25,000 miles an hour. Hey, got there. Everyone was talking about the spiders and how we had to be careful of the spiders and stuff. Luckily didn't see a single spider in my time in Australia. You didn't see one. I know. In your bag and it came at a couple. But I I did hear about a lot of them. And apparently they have like the the most famous spider over there is the huntsman spider. And I'm like don't don't call a spider a huntsman spider. That's a [ __ ] bad name. Buy me a huntsman spider, Kevin. Thank you. Yeah, that shit's [ __ ] trouble. Um audio Google my little list. I guess that's it. That's all. Oh no, the chlamydia. Okay, the is this the koala? Yes, the koalas have chlamydia. I've never heard the word chlamydia more than the last week in Australia. Like, oh, [ __ ] that. No, [ __ ] that thing. No, no. Now, what I hear is they're quite gentle. Yeah, [ __ ] that [ __ ] man. Kevin, can you bring it back up on the big screen so we",
            "start": 1991.6
        },
        {
            "text": "in Australia. Like, oh, [ __ ] that. No, [ __ ] that thing. No, no. Now, what I hear is they're quite gentle. Yeah, [ __ ] that [ __ ] man. Kevin, can you bring it back up on the big screen so we can see that? Is it biting? We can't see us. I don't like this. I don't like this at all. Oh yeah, he's biting on it. He's pinching. [ __ ] that. These things are unnatural, dude. I really don't like that. I'm getting out of here. Yeah, I'm sorry. Anyway, all the koalas have chlamydia, so you can't touch them at the zoo. Like, there's only certain koalas that you can be friends with, and the other ones are like [ __ ] and we'll just straight up give you chlamydia. Now, do you have to [ __ ] him to get the chlamyia? No, there was a lot of talking about [ __ ] koalas. See, this was the thing, though. And this was people were saying that originally and why, and I was like, you can't get chlamydia from a koala if you're not [ __ ] it. And they were like, no, scratches and stuff. And I was like,",
            "start": 2039.52
        },
        {
            "text": "And this was people were saying that originally and why, and I was like, you can't get chlamydia from a koala if you're not [ __ ] it. And they were like, no, scratches and stuff. And I was like, \"That doesn't sound right.\" But that's what people were saying after they went to the zoo. And it doesn't have schools and [ __ ] And they just make musk was like, \"No, that's you can't you can't get qualified. You can't get quality.\" Um, wait guys, real quick question. How are these uh koala bears getting chlamydia? Did anyone talk about it? They [ __ ] a lot. At some point, a human [ __ ] a koala probably back when it was a penal colony. That's why they call it penal diseases. I did meet a koala at the airport. Um, we don't have a picture to show you yet, but uh, it will come at some point. It was in the koala suit. The thing about it is Tim, it was it was a a person in the koala suit, Colin, and had kids surrounding it. And then Tim was like, \"I'm going to take a photo and you take a photo",
            "start": 2081.12
        },
        {
            "text": "in the koala suit. The thing about it is Tim, it was it was a a person in the koala suit, Colin, and had kids surrounding it. And then Tim was like, \"I'm going to take a photo and you take a photo of me, Greg, and I'll point at it, and we'll put some distance behind it, and I'll put, you know, a as close as I could.\" The caption be like, \"This is close I get cuz they all have chlamydia.\" And the koala is constantly turning. So, it really just looks like Tim can't get close to children or is really excited to be this close to a bunch of children cuz there's a bunch of small kids gathered around. Tim's like, \"Oh, kids.\" You know what else? There's a lot of roosters. It's the rooster, which is a Chinese thing. And godamn Australia loves them damn roosters. They were everywhere. Australia is super Asian. Didn't expect that. Super Asian. Like just like San Francisco Asian. Like that's a lot of Asian. Probably why we felt so at home. Yeah, exactly. It was like It was crazy though. Like I I",
            "start": 2117.76
        },
        {
            "text": "super Asian. Didn't expect that. Super Asian. Like just like San Francisco Asian. Like that's a lot of Asian. Probably why we felt so at home. Yeah, exactly. It was like It was crazy though. Like I I think we saw more roosters than kangaroos. Yeah, probably. And that's impressive cuz there was a lot of kangaroos. Sure. Sure. That's true. Not real kangaroo. I didn't see any real kangaroo. Real kangaroos which is really upsetting. And then what was the other little dude? The quaka. I don't know that the thing that everybody gave me Joey Noel is to bring home. I'll tell you what I'm used It used to be bring stuff to Colin and then it became bring stuff to Kevin and now it's bring stuff to Joey Noel. No, I'm [ __ ] bringing home goddamn quackas or whatever the hell they are stuffed in my bag. Yeah, Joey Noel better pick up all these [ __ ] things. Australia was awesome though. Honestly, I think I I kept saying this, it was the best convention I think I've ever been to. Uh, and just the",
            "start": 2156.56
        },
        {
            "text": "Yeah, Joey Noel better pick up all these [ __ ] things. Australia was awesome though. Honestly, I think I I kept saying this, it was the best convention I think I've ever been to. Uh, and just the everyone there was super nice. I think a lot of it was really wellrun. Yeah. Everything about it was great. The Yeah, quite the holy Jesus. Cute [ __ ] That's adorable. It's like a psychopath. Are you kidding me? They're so happy. That thing was crazy. They don't have chlamydia. That's why they're stoked. They're like, \"Oh, we're good. They [ __ ] without repercussion.\" Yeah, they do. But, uh, no, the show was great. Uh, panel was awesome. Yeah, cuz it wasn't even a panel. It was a stand up. It was It was somewhere between a panel and kind of funny live, which was awesome. Exactly. So, uh, by the time this video goes up, it should be live. I'm planning to put it up this Friday. So, you will be able to see the panel. Go check it out on youtube.com/kindfunn. Kev, can you pull up some of the",
            "start": 2191.28
        },
        {
            "text": "the time this video goes up, it should be live. I'm planning to put it up this Friday. So, you will be able to see the panel. Go check it out on youtube.com/kindfunn. Kev, can you pull up some of the pictures so we can just go through them real quick down there? He's got all them quackas. Give me a second. Give me a second. While that happens, have you I have you told either of them your story from the bridge? Oh, them? No. No, I didn't. I think you should tell them. I mean, I know it's part of the panel. It's part of the panel. But long story short, um I don't have phone service. Don't worry, Kev. You keep doing your thing and don't uh I didn't have phone service in Australia at all unless I had Wi-Fi. So, the first night, Greg was really tired for whatever reason. I had a headache from all my coffee. Colin, I'll tell you what, I put so many long blacks inside me on Friday. I just had to go home and rest. I had a headache. I was just I was dehydrated. You took a lot of long blacks to",
            "start": 2230.08
        },
        {
            "text": "my coffee. Colin, I'll tell you what, I put so many long blacks inside me on Friday. I just had to go home and rest. I had a headache. I was just I was dehydrated. You took a lot of long blacks to the head. Yeah. Oh, yeah. What you did? Well, mainly to the mouth. Yeah. To the mouth, honestly. But by virtue of that, by proxy of that, right to the forehead. Oh, sure. Okay. When you're when they were when you were finished with long black, it basically finished right right to the forehead. The long blacks did finish in my forehead. That's crazy. Forehead. Is that a thing? That's just cuz we're they're making like a penis and ejaculation. No, I get it. But who aims for the forehead? Oh, who doesn't? Well, I think you aim for the mouth and it goes You aim You aim and and and so it goes. You aim and pray. Spray and pray. Spray and it's not a Scud missile. Anyways, I uh had to get home by myself because Greg left me and I ended up staying at the mixture for way too long. So, by the time I",
            "start": 2270.24
        },
        {
            "text": "aim and pray. Spray and pray. Spray and it's not a Scud missile. Anyways, I uh had to get home by myself because Greg left me and I ended up staying at the mixture for way too long. So, by the time I was leaving, I didn't know anybody and I like so all the roo people were gone and I couldn't use my phone to Google map or whatever. So, I was like, \"Fuck, I need to just talk to people and find my way home.\" So, I I leave and I start asking people like where the hotel is. Everyone's super nice giving me directions, but it was like a weird ass way to get there. There's this long ass bridge and I start walking across it and I'm like, \"All right, I need to ask somebody for directions, but like I don't want to ask like uh any like young woman because I don't want to like have her think I'm like coming on her or whatever.\" There was all these like rules in my head. I'm like, I I got to be careful on this. I saw a couple and I'm like, \"Oh, I'm going to ask you.\" First off, I saw a couple that",
            "start": 2306.56
        },
        {
            "text": "coming on her or whatever.\" There was all these like rules in my head. I'm like, I I got to be careful on this. I saw a couple and I'm like, \"Oh, I'm going to ask you.\" First off, I saw a couple that was uh kind of funny best friends. They were awesome. They got me the right way. But as I kept going, I got lost again. So, I saw another couple and I went up to them and started and I asked them. I was like, \"Hey, excuse me. do you know where the Swiss hotel is or whatever? And like, oh yeah, just just go this way. And like, oh, we're walking that way. Do you want to walk with us? I'm like, yeah, sure. We all start walking and they're just telling me all these stories and stuff. And I'm like, they're funny ass people. I'm like, oh, cool. This is great. And we end up talking for like 30 minutes or so. We're in the middle of a story. We get to the other end of the bridge and then uh they're they're not done telling some whatever story she was saying. I don't even remember what it was. Uh",
            "start": 2343.36
        },
        {
            "text": "or so. We're in the middle of a story. We get to the other end of the bridge and then uh they're they're not done telling some whatever story she was saying. I don't even remember what it was. Uh and she was like, \"Oh, do you guys want do you want to go grab a drink real quick and then we can like direct you the right way?\" I'm like, \"Oh, yeah, sure.\" We head over to some bar and we we we're just chilling, just me and these this couple. And uh I I get a drink, everything's cool. And then like they finish the story and then out of nowhere, it was like a [ __ ] switch just going on. She goes, \"Hey, he thinks your accent's cute.\" And I was like, \"Thank you.\" It was really weird. And then she goes, \"I also think your accent's cute.\" Yes. I was like, \"Thank you.\" Yes. And she was like, \"No, no, no.\" Like, like, \"Are you interested in this?\" And I was like, \"Oh, no, thank you. Can you please just Were they like what level of good-looking are we tied?\" They were good-looking, not greatl",
            "start": 2376.0
        },
        {
            "text": "no, no.\" Like, like, \"Are you interested in this?\" And I was like, \"Oh, no, thank you. Can you please just Were they like what level of good-looking are we tied?\" They were good-looking, not greatl looking. Good looking enough so that if Gia wasn't in the picture, he'd be like, \"I'm going to [ __ ] this guy in front of his girlfriend.\" Like, how how good-looking are we talking? I'm going to [ __ ] this guy in front of his girlfriend. No, not worth it. But I mean, I was like, it was a it was a weird situation cuz like I've never been like came on to by a guy before, you know? Is that the right phrasing for that? Yeah, absolutely. But uh anyways, yeah, it was like a I I felt awkward. Like I was like kind of embarrassed, which is weird. It's very flattering though. That's good. But yeah, but then then they just directed me home and I just went home. You're like, \"Cool.\" They're like, \"Oh, by the way, the hotel's right there.\" Yeah. Essentially, what was Gia's reaction to all this? That's",
            "start": 2422.32
        },
        {
            "text": "then then they just directed me home and I just went home. You're like, \"Cool.\" They're like, \"Oh, by the way, the hotel's right there.\" Yeah. Essentially, what was Gia's reaction to all this? That's the one thing I haven't heard. I mean, it's just Gia. She was just like, \"Why?\" No, Gia strikes me as a type of be like, \"Oh, that's very How lovely of them.\" Well, I mean, she was interested in it, but like I mean, it's so normal. Everything's so normalized with that girl where it's just like whatever. She seen too much, but I mean, yeah, it definitely caught me off guard. I didn't see it coming. I was a little drunk like leaving the the place. So, it was like, but I still didn't see it coming. I was Let's look at photos then. Where you want to start? Yeah. So, are they prep cuff? Uh, I mean, you want them in order. No, it doesn't matter. Doesn't matter. I just want to talk about it. So, this is the panel. This is when Greg did his super awesome uh salmon entrance, right? improving on",
            "start": 2462.88
        },
        {
            "text": "you want them in order. No, it doesn't matter. Doesn't matter. I just want to talk about it. So, this is the panel. This is when Greg did his super awesome uh salmon entrance, right? improving on what I did at PAX West. Yeah. After a lot of trial and error at this panel. Yeah. Unfortunately, this is not in the panel cuz this had to happen after the stream, but we will be uploading this video separately at a later date. It's going to take a little more time cuz I need to get footage. If you were at the panel and have footage, please email me it or send it get it to me somehow. I'm sure you'll figure it out. Um that's that's me and you taking couple's picture in front of the Sydney Bridge, right? We're outside the Sydney Opera House. That this is Panama took us there on uh Monday. This was the we talked about it. Uh I kept saying it's a how people how you like Australia. I kept saying it's America with accents. It's great. You know what I mean? I blend right in. It feels like Seattle.",
            "start": 2493.6
        },
        {
            "text": "the we talked about it. Uh I kept saying it's a how people how you like Australia. I kept saying it's America with accents. It's great. You know what I mean? I blend right in. It feels like Seattle. Great. This was the first time for me where I was walking. I'm like, \"Oh, this feels like a different country. This is cool.\" The water, the bridge, people walking over the bridge. The Sydney Opera House you've seen a million times. Yeah, it was pretty. Yeah. Uh next up, Kev. There we go. Sydney Opera House doing the tourist thing. I liked it. Go for it. What's better? Having a display down there or about up there? Bigger is better. I can't really see what's going on down there. Bigger is definitely better. You can see there. This is good. This is good. It's out of focus, but it doesn't matter. It's fine. That's better. Um, that was the community dinner that we did that where they they they planned it all. We just showed up here. Yeah. Fantastic people. Great group of kids. This is uh the",
            "start": 2531.36
        },
        {
            "text": "It's fine. That's better. Um, that was the community dinner that we did that where they they they planned it all. We just showed up here. Yeah. Fantastic people. Great group of kids. This is uh the signing line that we did. Very healthy signing line. Autograph line one. Yeah. Mhm. These were just people that didn't make it into the signing, so they were just standing on the outside. I appreciate that. Quite the crowd. Good. There's our boy Pat. You might know him from being at this table back in the day. He came through back the old the old studio. I did the exact same thing where he came up and started talking to me and getting an autograph and I just totally it just did not register who he was cuz he's he looks different. His hair is different and he had a [ __ ] up leg. So like he was talking with the can. I'm like what the hell? He was getting his uh fore honor on. Um, so now this here, you can't really tell, but this kid comes up to us and he goes, \"Do you do you know what I'm",
            "start": 2566.4
        },
        {
            "text": "talking with the can. I'm like what the hell? He was getting his uh fore honor on. Um, so now this here, you can't really tell, but this kid comes up to us and he goes, \"Do you do you know what I'm cosplaying as?\" And we're like, \"I'm sorry, no, not the slightest clue.\" He's like, \"I'm in the P PE outfit from kind of funny the animated series.\" And he was wearing the little the shorts. There's a full body shot somewhere. Yeah. Yeah. Pulled up. Yeah. Yeah. But anyway, yeah. Like it [ __ ] happened. That is amazing. It happens. People cosplayed as just keep doing it long enough. You know what I mean? That's all that really matters. Oh yeah, this guy right here in a Sean Finnegan likes hiking shirt. One of four sold. We got to bring that shirt back. Nobody bought back. Go forward. A freaking Q and five fan that I found out in Australia. Was a big big fan of that. This is more pictures of Greg coming down looking like a looking like a legend. This is definitely one of the ones from John",
            "start": 2610.32
        },
        {
            "text": "Q and five fan that I found out in Australia. Was a big big fan of that. This is more pictures of Greg coming down looking like a looking like a legend. This is definitely one of the ones from John John, our photographer. Uh we're going to have all those up. He took more than I think it was 1,200 shots. We're putting up 430 or something like that. By the time you see this, we'll have tweeted it out a bunch of times. It's just running good. Is that it, Kev? Uh, no. Spitting out thing. Yeah, that's that's the end shot of our panel of everybody that was there. Amazing theater. Amazing crowd. Filled to the brim. Yeah, it was really cool. Any more pics? That was me me and Greg playing the Nintendo Switch. There's a game where you have to eat a sandwich and it got real intense. Yeah, it looks like you're eating [ __ ] Yeah, it does. It does. You uploaded a video on your Instagram of me eating it. Yeah. And I ate it. Well, that's Greg after he beat me in some samurai. Now, what's important",
            "start": 2655.92
        },
        {
            "text": "like you're eating [ __ ] Yeah, it does. It does. You uploaded a video on your Instagram of me eating it. Yeah. And I ate it. Well, that's Greg after he beat me in some samurai. Now, what's important here? No, because this is what this is. This was basically this was one of the interstitials we did for the Rooster Teeth stream where they put us over at the Nintendo booth and we filled like five or six minutes or something. We played a bunch of different Switch games. The first one was one, two, Switch, the Samurai game. Wait, are you standing inside of a black guy's head? Correct. What the [ __ ] is going on with this? I'm going to get to it. So, the first was the Samurai game in which after we got the hang of it, you challenged me for the kind of funny Nintendo World Championship. You beat me for it, which you've never done. You beat me to win the Nintendo World Championship. Then we went next door to the sandwich eating thing and I beat the [ __ ] out of there and I took I took the",
            "start": 2696.24
        },
        {
            "text": "me for it, which you've never done. You beat me to win the Nintendo World Championship. Then we went next door to the sandwich eating thing and I beat the [ __ ] out of there and I took I took the championship back. So that's me standing on top of one Nintendo speakers in there celebrating with the fans that had gathered watches outside. That was quite the experience. Now we're back to that. But okay, so the last thing I want to show uh for some for for you guys to see this is my favorite moment of the panel that wasn't Greg's intro. So Greg brought up some one of the kids and was just like, \"You think you know who Panda Musk is?\" And he started explaining who he thought Pandam Musk like he was like, \"I Panda Musk is from Australia. I've deduced this whatever. Figured it all out.\" And Greg's like, \"Do you think you could find Pandam Musk in the crowd?\" Now for those of you at home that don't know this, Pandamus, the guy that does all all of our art, the game over Greggy show intro.",
            "start": 2730.16
        },
        {
            "text": "like, \"Do you think you could find Pandam Musk in the crowd?\" Now for those of you at home that don't know this, Pandamus, the guy that does all all of our art, the game over Greggy show intro. Yeah. Yeah. The painting and all that stuff. There it is. All that. But his identity is a secret. So he doesn't want to be known or whatever. So what we did is we wanted to see if Pan Musk would reveal himself in the crowd. Mhm. And this is what happened. Hold on. Okay. Before you play it. Uhhuh. For the audio so these guys can hear. I'm going to play on this as well. 40. I'm Panda Musk. I'm Panda Musk. It's like to tell the truth. Yeah. All right. No. Wait. Hold on. Hold on. Let me just center this a little bit. Ready? Yeah. Three, two, go for it. I am Panda Musk. I am Panda M. I am Panda Musk. I am I am Panda M. No, I am Panda M. Awesome. That is amazing. I'm Greg Miller. This is kind It was an awesome moment. It was freaking great. That's great. So yeah, RTX Sydney was great. Australia was",
            "start": 2771.28
        },
        {
            "text": "am I am Panda M. No, I am Panda M. Awesome. That is amazing. I'm Greg Miller. This is kind It was an awesome moment. It was freaking great. That's great. So yeah, RTX Sydney was great. Australia was great. Yeah, you did. You blew it. Well, I guessed it because you guys aren't original. That's true. Beyond. We used to call that. Oh, hi. I didn't see you come in. I was just subscribing on iTunes to the Kind of funny morning show. You can do the same on podcast services around the globe. I just have an iPhone. Or you can go to soundcloud.com/kindfunny morning show. That's right, ladies and gentlemen. The formerly known Colin and Greg Live. Now, Kind of funny Morning Show is a podcast. We listen to you. 2017 is all about communication. So, we put it up as YouTube videos. as I'm sure you've seen. Subscribe youtube.com/kindfunny or get the kind of funny morning show as a podcast on soundcloud.com/kindfunn show your i device if you're a dork like Kevin your Android thing. How do you even get",
            "start": 2827.12
        },
        {
            "text": "Subscribe youtube.com/kindfunny or get the kind of funny morning show as a podcast on soundcloud.com/kindfunn show your i device if you're a dork like Kevin your Android thing. How do you even get podcast on your thing? You say to the watch I need a podcast. What happens? You don't you just shrug. You don't listen to podcasts. I go to Soundcloud and download. Oh, okay. You're one of those guys. What do you mean one of those guys? I mean like what? You can't just You can't There's no subs. There's nothing. Ladies and gentlemen, it's a podcast. It would mean a lot if you went and subscribed to it. You might say, \"I watch it live on Twitch.\" And to which I just say, \"Just subscribe. Who cares?\" And it's just a number. Subscribe. Hi, it's Greg. Good morning show.",
            "start": 2874.64
        }
    ]
}