{
    "id": 2380,
    "video_id": "wyBPUeWTSGg",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Kevin Coello",
        "Ashley Ringrose"
    ],
    "title": "Death Squared Tears the Boys Apart - Kinda Funny Plays",
    "description": "A new co-op puzzle game comes to the office to turn everyone against each other.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1486573206,
    "duration": 2024,
    "transcript_chunks": [
        {
            "text": "What's up everybody welcome to another Let's Play here on YouTube.com slash kind of funny games I'm one of your hosts Greg Miller alongside Nick, Tim, Kevin, and then Ashley from SMG games hello G'day mate Oh you're one of these? Oh my god now how you doing? I can probably keep this up for about two more sentences Look out Tim and Tams in the wing mower Ok whatever You've come all the way from sunny Australia to show us Death Squared. What is Death Square? Death Squared is a co-op puzzle game. Ok. Where you gotta work together instead of against each other to solve the levels. Not our strong suit. That's basically all we like to say is like just work together. That's all you need to know. I'm noticing that the squares are different colors. There's also a different amount of little eyes on them. Yeah. Nick god damn it. Did I die already? Yes. I'm red. Get out of here. I'm moving. I gotta go out of the way. Don't. Work together not against each other. Go onto your block. You call it a",
            "start": 0.0
        },
        {
            "text": "them. Yeah. Nick god damn it. Did I die already? Yes. I'm red. Get out of here. I'm moving. I gotta go out of the way. Don't. Work together not against each other. Go onto your block. You call it a block. Alright cool. Here we're solving this puzzle. Not so hard so far Ashley. That's a tutorial level. Ok. Don't. Can you not make us feel deflated already? I like this one. Look at that. One death already. They're popping. They're popping up. It's not a death. You're testing the confines of the world. I'll be right back. I want to make sure the audio in the game is high enough. Ok. Well Kevin of course is doing this. What is this doing here? Wait. I don't. Hold on. Ok. Ok. See when that. Oh god. Oh I gotta wait. Oh what the fuck was that? Sorry I hit the red thing. The red thing. When the red thing got hit. I feel like this is gonna slow down. Green guy. Hold on. Nobody move except green. Who's green? Who's green? But if I get. Who's green? Me. I'm moving. Ok so when we go on our things.",
            "start": 37.98
        },
        {
            "text": "thing got hit. I feel like this is gonna slow down. Green guy. Hold on. Nobody move except green. Who's green? Who's green? But if I get. Who's green? Me. I'm moving. Ok so when we go on our things. You don't need to move yellow. Yeah what. Oh god. What do you mean? What do you mean I don't need to move? Cause your little thing goes over to you when green moves. Yeah but then I gotta get on it. It moves Nick. It moves underneath you. If I touch the green thing. Green spikes go up on the other side. Right. And if I touch my red thing. Red spikes go up there. So we often get one square away from our square. Oh shit. Look green. You move my thing. That's what I just said. Nick nobody moves with you. Kevin go back to your original block. And when green gets to his. Yours will just slide underneath you. Alright keep going green. Keep going. Alright I'm gonna move here. Ok I'm going back. Now everybody get one square away from where you need to. Who's. I feel like these are gonna knock",
            "start": 79.98
        },
        {
            "text": "you. Alright keep going green. Keep going. Alright I'm gonna move here. Ok I'm going back. Now everybody get one square away from where you need to. Who's. I feel like these are gonna knock anyone off. Well yeah that's why. Ok so hold on. Blue. There you go blue. There you go blue. Good job blue. Good job blue. Now who's yellow? I'm yellow. Move your. There you go. You need to move it a little bit. Oh green. Green you gotta get off. Blue. Ooh that's me. I did that. I'm sorry. Yellow can you come up. Kevin can you come up towards the red one. There you go. There you go. Then move over. There you go. Keep moving. I'm not moving. Ok good. And then green move off of your thing. There you go. Now blue you go to your thing. Alright everybody get one away from their thing. Green. No yellow's still a problem. This is intense. This is green. Well this is kinda funny trying to problem solve. Ok now green move over there. Wait is green. Is green gonna kill the. Green's gotta go. Oh. Ok ok. I",
            "start": 118.98
        },
        {
            "text": "still a problem. This is intense. This is green. Well this is kinda funny trying to problem solve. Ok now green move over there. Wait is green. Is green gonna kill the. Green's gotta go. Oh. Ok ok. I respect that. Well no blue just has to be one underneath. Blue not next to it. I'll go first. Ok. This game's a good relationship. No no no no hold on. Wait. Perfect. Just stay right there. There we go. Great. Good job. Blue's awesome. What happens when blue gets. So hold on I'm gonna touch the green which means spikes are gonna come up. But only on that row. Yeah that's fine. I'm clear. Now yellow go back on your thing. Red. There you go. Cool. Yellow who's yellow? There we go. We got it. It was easy. Oh god ok. Dream work dream work. It's a good party game. It's a good relationship game. It also determined who is the natural leader of this group. Who's the alpha bot. Sure. I'm just gonna see what this does. I can't do anything. Oh doctor. I'm just stuck here. Ok hold on. Hold on. No no.",
            "start": 161.98
        },
        {
            "text": "also determined who is the natural leader of this group. Who's the alpha bot. Sure. I'm just gonna see what this does. I can't do anything. Oh doctor. I'm just stuck here. Ok hold on. Hold on. No no. Ok do that again green. Ok. I'm dropping off. And I'm gonna go here. And I'm gonna go to red. Alright I'm on red. Hold on so yellow moved. Yeah. If yellow. What happens. How the hell is green gonna go there. I'm back I'm back. I'm gonna just. I'm gonna catapult on mine. Oh god I died. How did you do that. I died. He wasn't. Alright. All we need to do is get red where he needs to go right. So. We all need to. Yeah but I mean that's. So now we focus on other people. Yes now let's move over to the blue dude. How do we get the blue dude where he needs to go. I still think. I still hold that I can jump over that. Go to your right. There you go. Is there a way to rotate the puzzle or is this the view we have. Ok ok. No jump but I can move my eyes. So I can move back and then things fall. I",
            "start": 205.98
        },
        {
            "text": "can jump over that. Go to your right. There you go. Is there a way to rotate the puzzle or is this the view we have. Ok ok. No jump but I can move my eyes. So I can move back and then things fall. I think I can do this. So. Can do what. Nope. No. That's exactly how you die. It's a game about teamwork and you guys are all working individually right now. That's the kind of clue I'll give you for this level. I'm at level 1 level 3 because I want to see other levels you guys might be. Sure sure. Ok well you don't have to go that. You have to call like you see it. So. Blue. Blue. Ok there we go. What is what. So I do nothing when I go over here though. Right. Nothing's happening when I hit my. I feel like here's what you need to do. Greg you need to come over to me. And I'm gonna stand on your head. Actually you're right. No you're right. That's 100 percent correct. Good job Nick. Smart Nick. Look at the brain on Nick everybody. That's fucking brilliant. There you go. Wait but wait it was",
            "start": 253.98
        },
        {
            "text": "head. Actually you're right. No you're right. That's 100 percent correct. Good job Nick. Smart Nick. Look at the brain on Nick everybody. That's fucking brilliant. There you go. Wait but wait it was Nick the highest one. No I think that's a good point. Ok so I need to. Now give me yellow. No no no go back. Yellow then me. Me then yellow. Get back on him. Get back on him Nick. You get right on top of his ass. Pull but then bring it on. Come to yellow come to yellow. And now go to green. And then let's get. Alright sorry. My perception was off on that one. That was on me. Not a problem. Not a problem. It's because you have to wear glasses. God I wish I fucking was getting trophies on the retail unit. When's this game really come out? Alright Nick go pick up green. Go pick up green. Is this going live? No this isn't going live. No we're not live. Alright so the date will be in March. Ok. So we have. Oh yeah. We're gonna jump on top. We're gonna be in March. We're gonna end on top of that",
            "start": 285.98
        },
        {
            "text": "live? No this isn't going live. No we're not live. Alright so the date will be in March. Ok. So we have. Oh yeah. We're gonna jump on top. We're gonna be in March. We're gonna end on top of that one. Yeah we don't have. We better bring him over. Ok. I'm gonna reveal the. Slowly but surely. Oh my god. It's Xbox one. It's PC. It's PS4. Yeah alright. Oh god. Simultaneous worldwide release. Tell me when. Oh god. Oh god. Oh god. Oh god. Oh god. Oh god. Oh god. Oh god. Oh god. Oh god. Oh god. Oh god. Oh god. Ok. Now everybody. Now even blue you slide over all the way. There you go. Orient. Orient. There you go. There you go. Let's bring yellow back then. Shit I'm going home. Yellow back. You guys. Oh god. We're bringing yellow back. We're bringing yellow back. Yeah. Oh the colors don't know how to act. This is like. This is like Luba pool right now. Yeah. Yeah Luba pool sucks. I've had only good adventures on Luba pool. I've had bad ones every time. Only good. Why am I on my side? It",
            "start": 326.98
        },
        {
            "text": "how to act. This is like. This is like Luba pool right now. Yeah. Yeah Luba pool sucks. I've had only good adventures on Luba pool. I've had bad ones every time. Only good. Why am I on my side? It doesn't matter. Doesn't matter. Let's just get out of here. There we go. Doesn't bother anyone else? Nope. I'm the only one that cares about my size. It's so typical of you. Tim we're doing it. Alright so we're playing party mode right now. Yeah. What are the. You were talking about two player mode has like a story and voice acting. Yeah this one's just. There's 40 levels for four player. Oh god. There's two player or single player mode has 80 levels. Oh ok. There's a story arc. There's you know there's love interests and stuff. I'm just saying that the great style though. There's a really nice fork with kind of a four wall kind of comedy. Such dicks. Ok. Can I kill myself. Why you knew that. I just want to see what happened. And Pat who developed this like the idea. He wanted to create as",
            "start": 356.98
        },
        {
            "text": "fork with kind of a four wall kind of comedy. Such dicks. Ok. Can I kill myself. Why you knew that. I just want to see what happened. And Pat who developed this like the idea. He wanted to create as many. You can't kill yourself as he can with the limited amount of resources. Rather having like 50 different mechanics. We've got six or seven. Ok. We play with those. We interact. Yeah. Creates the kind of the puzzles that. You know. What I want yellow to do is I want yellow to go to the dot. No no no. Does that turn off. Blue has to go where red is. Blue is going to get blocked by its own laser. That's fine. Blue is going to go where red goes. Where red has to get out of the way. I'll hide right here. No. Cause the laser kills everyone else. Let's see what happens. There we go. It gets blocked. Ok. Great. Great. Great game. We're good to go. Wait wait wait. Red where are you going red. I'm right here. Is green on red square. I mean see now I can move. So now hold on. Don't. Nobody do",
            "start": 386.98
        },
        {
            "text": "Ok. Great. Great. Great game. We're good to go. Wait wait wait. Red where are you going red. I'm right here. Is green on red square. I mean see now I can move. So now hold on. Don't. Nobody do anything crazy yet. No one do anything crazy yet. Stay hidden. I don't know where the red thing is. I think green is on it. Green are you on the red thing. There we go. Nailed it. We're doing it. Ok. Green go to your thing. Ah no go too far. There we go. Excellent. Crushed it. Crushed your enemies. Crushed them. See them driven from there. Ok. We hit a limitation. Alright. So there's a lot of levels like this where. Oh we all got to move together. So I'm going to test them. No. We should not have tested that. We should not have tested that. Go right. Right. There you go. I'm also going to go right. I think all of us should probably go right. I'm going to go right as well. Wait what happens if yellow goes over green. Nothing. Do we all die. No nothing happens. Ok. But we have to do it in order.",
            "start": 446.98
        },
        {
            "text": "I think all of us should probably go right. I'm going to go right as well. Wait what happens if yellow goes over green. Nothing. Do we all die. No nothing happens. Ok. But we have to do it in order. So I have to be in front. I have to go first there. Ok. Red red go go go go go go. Blue don't go on it yet. I want to see what happens. Blue. It's going to kill everyone. Blue don't do it. Hold on. Get on the square. There has to be the order of operations here. Green get in there. Get in there. Alright then we go on three right. Yeah. One two three. Damn it. It was so close. Yellow went too far. Yeah. Which one of us is yellow. Yeah. Fucker. I didn't do it on purpose Nick. No I think you did. I'm not accusing you of doing anything on purpose. But I think that just there's some part of your soul that is evil. I'm going on my square. Alright hold on. Ok I'm going on mine. Oh my god. Y'all ready. Yeah. Where we did it. Oh. Green. Ok ready on three. Oh it's done. Alright cool. Alright no big",
            "start": 506.98
        },
        {
            "text": "that is evil. I'm going on my square. Alright hold on. Ok I'm going on mine. Oh my god. Y'all ready. Yeah. Where we did it. Oh. Green. Ok ready on three. Oh it's done. Alright cool. Alright no big deal. Great. Nice. Alright alright. Alright here we go. No more lasers. This game's fun. This game's real fun. Ok. So we can go through our own and we can push this little thing. Hold on I'm going to push this over here. So I blocked it. Yep. And then push it the other way blue. Wait why did you push it sideways so I can get on my square. Oh ok. The other way. I think it's sideways. I don't know if I can push it. There you go. You got it. Ok. Don't push it off. Get on your square. Can I grab it. I'm in. Fuck you guys. Y'all you got to push it back to me. Oh. Push that bad boy back to me. Oh I'm so scared right now. I can't push. I can't push it too much Nick cause it kills me. Got it. I'll try it too. Rest well. So it's interesting if you hit X your little lights turn on. I know I like it I",
            "start": 536.98
        },
        {
            "text": "so scared right now. I can't push. I can't push it too much Nick cause it kills me. Got it. I'll try it too. Rest well. So it's interesting if you hit X your little lights turn on. I know I like it I blinky. If you use the D-pad you can kind of like just. Oh we're rocking. For no reason other than lights. We rocking and rolling. Cool can we wiggle stuff. Hello hello. No. No. I'm doing some stuff. Alright somebody help me get in my thing. I don't. There you go. You got the dance. Yeah I saw that. We're learning. It's got a platinum trophy. I have to check. I think it's just like finish the game. You think that's the platinum trophy. I got a feeling. Alright. Ok. Don't push. Yeah you got to push it someplace. Who's green. I'm green. Ok great. Green you can. Get behind it. Go get on your square. Should I go on my thing. Yeah try it see what happens. I'm just good. Ok. But red. I got to block this for blue. Blue go. No he's going to. He's good. Oh wait but we're going to need blue. Yeah",
            "start": 566.98
        },
        {
            "text": "Should I go on my thing. Yeah try it see what happens. I'm just good. Ok. But red. I got to block this for blue. Blue go. No he's going to. He's good. Oh wait but we're going to need blue. Yeah but we know we need this now. Which one are you using it for. Yellow. Push it all the way in the corner and block the yellow. And there you go. Oh no it doesn't block the right yellow. So that needs to be the last thing. Hold on hold on. I'll be the last one because I'll just stand here. No. God damn it. You're right I apologize. Nick I could have just stood in front of the yellow. Alright I'm going to go block blue. Everyone block the yellow. No. Just block the yellow. Hold on. Let's put this guy back to where it was. Yeah you're the last one. Just put it back there. You're the last samurai or the last dragon. I mean I don't think any of us have to be the last one. I am the last dragon. Remember that guy. Do you know how to block the green. I'm going to need a yellow block at some point. There",
            "start": 626.98
        },
        {
            "text": "last dragon. I mean I don't think any of us have to be the last one. I am the last dragon. Remember that guy. Do you know how to block the green. I'm going to need a yellow block at some point. There you go. Green is blocked. Oh. Yellow just committed to the right. Alright one more time. One more time. What's more worth feeling. We also made sure that the game doesn't have like any levels where you need high reaction. It's all about you versus the level versus you versus like oh I couldn't press the buttons fast enough. Sure sure sure. That's a conscious decision. Now blue you need to come down. Ok. Yeah ok so you and I need to switch. Greg you go over to yours. I'm just going to sit here because we're going to get blasted by it and die. There you go. Awesome. Winner winner chicken dinner. Are we the best people you've ever seen play this game? I think full player definitely. Yeah. You can tell you guys what to get to before. Are we the only people there? We've had this at all the",
            "start": 656.98
        },
        {
            "text": "Are we the best people you've ever seen play this game? I think full player definitely. Yeah. You can tell you guys what to get to before. Are we the only people there? We've had this at all the PAX's over the last year and a half. Oh lord. Oh this is getting complicated. Oh lord the truck broke down. What happens if the laser hits one of these squares. Nothing it blocks it. Jesus Christ. What was that. Nick move. What did I do. I didn't move. Who's green. Me. Oh Tim. Wait why did it like. Cause I think you went off the beaten path. I'm on my square. Ok red. I need. I need. We're going to move green. Hold on. We got to block with those things. Careful yellow. Ok Tim you are blocked. Hold on hold on actually. Yeah you should be blocked and free to go to your square. I'm going to my square. Alright great. I think we have to align those squares. Blue should go next right. Yeah blue gets locked in and then I go and I won't block. Yeah. You might blast my face off. Look at the blinking.",
            "start": 716.98
        },
        {
            "text": "Alright great. I think we have to align those squares. Blue should go next right. Yeah blue gets locked in and then I go and I won't block. Yeah. You might blast my face off. Look at the blinking. It's so cute. Thank you. Show me your stream. I don't want my things to be blocked. Wait what. Use your dpad while the lights on. Oh we can fucking play with it. Awesome. Well this looks complicated. It's also a game. Oh shit. No. Red. You know there's always one moment every let's play. Sorry because I'm wearing the headphones I can hear them. You are so clearly. I'm saying like it's just how the game is playing. What happened. Did you kill me again. Stop killing me. Alright fine. Sorry serious. Serious times. I didn't kill him that time. That was me I wanted to go out on my own terms. Because the games. If you know how to go up down left right on the analog stick. You can play this game. And that was a conscious decision as well to make it accessible. So you can bring in your girlfriend or",
            "start": 746.98
        },
        {
            "text": "games. If you know how to go up down left right on the analog stick. You can play this game. And that was a conscious decision as well to make it accessible. So you can bring in your girlfriend or your partner that normally doesn't play games and just say let's just solve these puzzles together. We've had some kids play. Kids and parents are really good. Yellow come through. It's a good dynamic versus a lot of games where it's just if you don't know how to. You know shoot mechanics or you know. You know fast react. Oh no. Oh my God. I'm sorry. Sorry. All right. I'm going to go. I'm going to go all the way down and clear mine out. There we go. Cool. I'm letting you in. Yeah. Go. OK go. Go. No not that. Why. Why. Tim he's clearly talking to me. What do you mean. Let me let me yellow just handle this. Yeah. Yeah. OK. Yeah. Keep going. I can't. I can't go further. Yeah. Wait there. That's your spot to let me know. No one's going to touch me. All right. Red. Yeah. We can't. What happens in",
            "start": 806.98
        },
        {
            "text": "this. Yeah. Yeah. OK. Yeah. Keep going. I can't. I can't go further. Yeah. Wait there. That's your spot to let me know. No one's going to touch me. All right. Red. Yeah. We can't. What happens in your spot. It's like some some people. Well actually you're going to have to move. I can pass. Yeah that's a good point. So go ahead and move. Who's not going to move. Right. No I moved. I meant the other way. So I can do any information. Yeah. Give me a pass here. I saw you had eyes. Yeah. Give me a pass. I still don't know what this does. Exactly. Oh God. OK. No. I do it right. No. Now red move over to your right. Red stop being a dick. We've had we've had military guys play it and they're actually really good at coordinating. Sure I'm sure they're calling us there at that time. I'm going to do it. Can you do it. I think. Yeah. Fine. Fine. All right. Green. It calls out like. Yeah. Move over. Go to my thing. Yeah. It's going to pop up. For where. On the left side. OK. We're good. OK.",
            "start": 836.98
        },
        {
            "text": "to do it. Can you do it. I think. Yeah. Fine. Fine. All right. Green. It calls out like. Yeah. Move over. Go to my thing. Yeah. It's going to pop up. For where. On the left side. OK. We're good. OK. Awesome. Now let me see. Oh. Nick. Yeah. Green's going to have to do something to get that. No you get in there Nick. Nick come right up to me. No. Oh God. Yeah do that. You sure. Yeah. OK. I agree. It feels nice. Yeah. Move. You got to do something. Just fuck off. Go down. Go down. Thanks man. Yeah. It goes over. I'll get to the square. Oh my God. Oh. So you're saying we're better than Navy Seals is what you're saying. Yeah. Yeah. Cool. We are the new Navy. Navy Seals. We are. We are. We are. We spilled the same blood in the same blood brother. I think you. Blood in the mud not blood in the blood. I said that. It's kill. It's with the same blood in the same blood. I wasn't listening. All right. Whoa. I fucking hate you. You said blood in the same mud. Yes you. I know that's what I said.",
            "start": 896.98
        },
        {
            "text": "blood. I said that. It's kill. It's with the same blood in the same blood. I wasn't listening. All right. Whoa. I fucking hate you. You said blood in the same mud. Yes you. I know that's what I said. You said mud in blood. That doesn't make any sense. Who spilled. Unless I'm fighting Clayface I'm not spilling mud. Have you seen the rock? Like you jacked. I'm not liking the little arrows on the side. The fucking clear spike thing. All right. This is cool. I'm not going to lie. This seems like it's broken. I'm going to hit this red thing. Oh no. We got to do it. You got to tap. We got to be like. We're tapping. We're like T-Rex. We're tapping. Yeah. We're tapping the glass. All right. Get it. Red. It was raptors that tapped it. Get on the yellow. No. T-Rex just smashes through. Blue. I'm sorry. Blue. This is where it all starts to break down. Blue. When there's no more water. Blue. Oh. Oh shit. What happened? That was an accident. What happened? The fuck happened? Well now I'm on this",
            "start": 926.98
        },
        {
            "text": "Blue. This is where it all starts to break down. Blue. When there's no more water. Blue. Oh. Oh shit. What happened? That was an accident. What happened? The fuck happened? Well now I'm on this thing. That's cool. How did I get over this? Am I the only one controlling this? Like we've allowed a lot of like physics things to happen just because it's kind of funny to have that happen. I don't know if that's actually. That wasn't helpful. That was a death sentence. I'm not going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over",
            "start": 986.98
        },
        {
            "text": "this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm going to get over this. I'm actually seeing this. This is one of the newer levels we put in. So I don't know the solution for this. Has anyone noticed? Greg, blue. Blue, get on the yellow. I can't. You can't. Blue. Right? Oh! You can't stand on it? If the red moves, then we're fine, right? Oh, yeah. Move the red first. Oh, yeah. Red. Move a key move. Well, you're going to get knocked over. Is that what you want? Go ahead. There you go. Yeah, now you go. All right, great. Oh my God. I banked off red. I was going too fast, guys. I'm sorry. It happens sometimes.",
            "start": 1016.98
        },
        {
            "text": "going to get knocked over. Is that what you want? Go ahead. There you go. Yeah, now you go. All right, great. Oh my God. I banked off red. I was going too fast, guys. I'm sorry. It happens sometimes. Slow down. So you want me to do this? Yeah. And then what happens? How's that going to help? Because it's going to scootch me over. You'll see in a second. Oh! I'm sorry. I thought it was coming over like mine. Heads up. Before blue does anything, I'm pretty sure blue probably moves the blue spikes. The three of them? It's possible. I'm not going to get on there. All right, see, look at this. Oh my God. No, no, no. What? What? It seems emotional already. We're making incremental progress. Okay. Red, get out of the way. No, that's going to kill you. Red, get out of the way. It's like a science test. Test the hypothesis. Exactly. Exactly. Cool. We're in positions now. Yellow, move. Yellow, move me over. All right. Come to Big Neck. There you go. Okay, before it happens. Oh, look, we have to",
            "start": 1090.98
        },
        {
            "text": "test. Test the hypothesis. Exactly. Exactly. Cool. We're in positions now. Yellow, move. Yellow, move me over. All right. Come to Big Neck. There you go. Okay, before it happens. Oh, look, we have to drop in that hole. No, do we? Yeah, see, if we all drop down there onto our colors. Yeah, get out of your colors. Then blue can shoot off that thing. Hold on, hold on. Let me see what, okay, go ahead and play. Blue can just let her rip. Just let her rip. There you go. Do it, blue. There you go. Nice. And we can play this dream forever. Standing tall forever. You see my life? Let's go! Oh, shit. We got Ghostbusters happening. Okay, red next. Then blue. Oh, shit. There's a gap there. Too far. There's a gap there, everyone. There's no gap there. There's a gap there. No, you like ran into green light. No, I didn't. Look, there's a gap. There's a gap there. Oh, it ends, you mean? That's not a gap. That's where it ends. Have you been on a British subway? Stop. Okay, you got to mind the fucking",
            "start": 1126.98
        },
        {
            "text": "No, I didn't. Look, there's a gap. There's a gap there. Oh, it ends, you mean? That's not a gap. That's where it ends. Have you been on a British subway? Stop. Okay, you got to mind the fucking gap. Mind the gap. He's making it. God damn it. Everybody go at once. Let's see what happens. No, I have to be the first to go. I know, Kevin. Thank you. Kevin is being funny because that's what we do here on Kind of Funny. Subscribe. Kind of Funny. Wait, wait, wait, wait. Yellow next. No, green, keep going and go to that top square. No. All the way to the top square. He's working on it. Green understands. Red, yellow, yellow is going. Yeah, there's yellow next. Don't. Yellow, don't be a dick. It's so hard. Okay. Yeah. You look good on your little... I'm going to hit my button. What happened when you hit the button? I'm going to hit my button. Don't go on the button. No, yeah, do not go on the button. We're waiting. Go on the yellow square. This is interesting. No. You got to send everybody",
            "start": 1171.98
        },
        {
            "text": "you hit the button? I'm going to hit my button. Don't go on the button. No, yeah, do not go on the button. We're waiting. Go on the yellow square. This is interesting. No. You got to send everybody over. Blue. Yeah. Wait, what are you doing? Okay. Why did red go? You said red get on the yellow square. I moved the yellow square. Oh, sorry. I didn't mean that. Blue, go on your... Wait, hold on. So if red were to go onto the green... Oh, wait, no, that doesn't work. Yellow needs to come over to me and I'll put him on my little thingy. Or red could go on green. No, hold on. He's safe to go on that. There's an order. There's an order. Yellow, come down to blue first. Red's fine. So red can go on green so that when I go, I can send him across. So who am I going to send yellow over? How am I going to send yellow over? Doesn't matter. Yellow's fucking dead now. So the fucking cannonball himself into the abyss. All right, all right. Everybody, remain calm. This is a great game. No. Thank you.",
            "start": 1214.98
        },
        {
            "text": "to send yellow over? Doesn't matter. Yellow's fucking dead now. So the fucking cannonball himself into the abyss. All right, all right. Everybody, remain calm. This is a great game. No. Thank you. And part of the reason for not... We have a lot of voiceover in the two player one, just in between for the story, but for four player because there's so much... Yeah, this. Shout out between the players. Yeah, yeah, yeah. That makes a lot of sense. We just didn't want to get in that way. Local co-op only, I'm assuming, right? Sorry? Yeah, local co-op. Yeah. PS4 has share play, so you can play... Don't go yet, don't go. That works great. Good job. So it's like a PS4 exclusive that you can play. Sure. Share play. And you can play four... Not blue! Why? You can play single player with one controller controlling all four, but it requires you to hold down... Jesus God. Requires you to hold down the trigger buttons at certain times. Yeah, yeah, yeah. And I think only Pat who built the game can do",
            "start": 1248.98
        },
        {
            "text": "controlling all four, but it requires you to hold down... Jesus God. Requires you to hold down the trigger buttons at certain times. Yeah, yeah, yeah. And I think only Pat who built the game can do that. Can't actually do that well. It's hardcore. He said like, after five minutes, you really get used to it. And I was like, no, we're not putting that in any press release. Okay. That's kind of cool. Red, what does it do when you step on your red? Sends the red square over. One of these must not work, right? Well, go to... All right. Oh yeah, good point. Blue, step on blue. Blue sends red over. Blue sends... Okay. All right, whatever. Blue, step on yellow. Well, that's not gonna do anything. Just step right here. Oh, right here. Got it. Yeah, all right, great. All right. I'm gonna just hit this and see what happens. Nope. That's the last step. Red, move me over. You said that really dramatically. Green, move over red. Hit the green square. Great, great, great, great, great. There you go,",
            "start": 1289.98
        },
        {
            "text": "and see what happens. Nope. That's the last step. Red, move me over. You said that really dramatically. Green, move over red. Hit the green square. Great, great, great, great, great. There you go, buddy. And what we're gonna do... Ah, look, I can... I see, I see, I see. If green gets on blue, I can move over. That's it, get on blue. Not the right person gets on blue. No, no, no, no. Just get on it. It's fine. You can move blue? No, it has to move green. He has to move green. He has to do it. We're good here. Just scootch out of the way. Because we don't have enough space to move around, do we? I just get out of his way. I'm bad. Yes, we do. We do. Oh my God. Oh, God, I'm sorry. That was my bad, hold on. Just saying it would be more efficient my way, but... It doesn't matter. It's more efficient. It doesn't matter. Just scoot up. Yeah. He's right. Kevin was right about it being more efficient. It doesn't matter, though. Efficiency doesn't matter. Look at him dancing. Jesus, God. Blue",
            "start": 1332.98
        },
        {
            "text": "It doesn't matter. Just scoot up. Yeah. He's right. Kevin was right about it being more efficient. It doesn't matter, though. Efficiency doesn't matter. Look at him dancing. Jesus, God. Blue meeting expectations. We gained solid friendship. Okay, I'm at expectations, dog. I'm not trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to",
            "start": 1378.62
        },
        {
            "text": "overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to",
            "start": 1390.62
        },
        {
            "text": "overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm trying to overshoot. I'm moving green and Tim is moving yellow. So Nick is the first one that has to move. I gotta go first. He's gotta block the blue. Nicholas? I can't get over there to block the blue. Why? No one else move. There you go. Look what happens here. But red is not yellow. Now I can't get around that. Who's controlling red? I am controlling red. See? If you're controlling red then you can. But no, here's the thing. Hold up two seconds. If I walk into it I walk into it. Just give me two",
            "start": 1443.62
        },
        {
            "text": "that. Who's controlling red? I am controlling red. See? If you're controlling red then you can. But no, here's the thing. Hold up two seconds. If I walk into it I walk into it. Just give me two seconds to talk. Tim moves with me. Human shield the green that I'm controlling. Then, if we just diagonal it a bit, he can block the yellow enough for me to get around the yellow. No, because the blue shoots me. No, red has to come over to me so I can go block blue. I can't block blue. Yellow stays where it's at. Now YouTube. Wait, who's controlling blue? I am. Okay, so again, like the statement I just said that left you completely out of it, don't fucking move. Sit there like the goddamn potato you are. Alright, so Greg, I'm gonna move over here and then you have to come around and block me. I know. Thank you. Yes. Now Tim, I need you to fucking bodyguard up though, alright? There you go, there we go, there we go. Now, you're moving yellow, right? Yeah. So then just don't move. Don't move.",
            "start": 1478.62
        },
        {
            "text": "know. Thank you. Yes. Now Tim, I need you to fucking bodyguard up though, alright? There you go, there we go, there we go. Now, you're moving yellow, right? Yeah. So then just don't move. Don't move. There you go. Good, good, good. Oh god, is that gonna nuke me? No, you're good, you're good. What happens when you go in the room? Oh shit. Oh, see, I need to bodyguard you now. Okay, okay. Alright. I see, yeah, yeah, okay, cool. Got it, got it, got it, got it. So I just don't move? Yeah, for right now. Oh fuck. I almost went right into the laser. Alright, you ready Tim? Bodyguard, bodyguard, bodyguard, bodyguard, bodyguard, bodyguard. Alright, hang on, alright, stay. Look at you, you're so free right now, you can do whatever you want. And then bodyguard. Ready? And hold on, hold on, hold on, hold on. Bodyguard, bodyguard, bodyguard, bodyguard, bodyguard, bodyguard. You have to stay with me. I know, this is gonna get tough. This is gonna get rough, cause I gotta go block blue now. I know,",
            "start": 1516.62
        },
        {
            "text": "hold on. Bodyguard, bodyguard, bodyguard, bodyguard, bodyguard, bodyguard. You have to stay with me. I know, this is gonna get tough. This is gonna get rough, cause I gotta go block blue now. I know, I know, I know. Come all over. Come all over what? Crazy. Come all over, okay. Come all over. So now, now yellow can move. I'm going, I'm going. Oh my god, what happened to the bodyguard, bodyguard, bodyguard movement? I got to the bodyguard part. I got to the bodyguard part. You gotta stay. Alright, alright, great, great, great, we're good. I'm standing on my square, I'm happy, no one blow me the fuck up. What happens when yellow moves? When green moves? Oh, we need a bodyguard. Oh shit. Oh no! I'm sorry, my bad. He went so fast for his eyes. Alright, here we go. Tim, prepare. And bodyguard, bodyguard, bodyguard, bodyguard. Alright, here we go. Look at red, man. What the fuck was that? Not the red one. Oh, I see. Oh, I see. Oh, I see. Oh, I see. Oh, I see. Oh, I see. Look at red, man.",
            "start": 1554.62
        },
        {
            "text": "bodyguard, bodyguard, bodyguard. Alright, here we go. Look at red, man. What the fuck was that? Not the red one. Oh, I see. Oh, I see. Oh, I see. Oh, I see. Oh, I see. Oh, I see. Look at red, man. What the fuck was that? Nah, don't worry. The dentist next door is pissed off. He's like, I had it enough. No more bodyguards. Bodyguard, bodyguard, bodyguard, bodyguard, bodyguard, bodyguard, bodyguard, bodyguard, bodyguard, bodyguard, bodyguard, bodyguard. You got it? Okay. Got it. Alright, now, oh god, Jesus. Nick, don't move. No, I have to move with you. Not yet. Well, no, we got to get Tim free. No, actually, you don't have to move. Just stay right there for a little while and then the laser. You're right, you're right. Tim, go. You're free. You're free. You're free. Go, god damn it. Why are we saying bodyguard right now? Double, double, double. Nick, don't move. I had you. The thing's moving. Double kill. Wait. What a way to go. My hands are sweating. Just pushing you guys. These weak",
            "start": 1594.62
        },
        {
            "text": "we saying bodyguard right now? Double, double, double. Nick, don't move. I had you. The thing's moving. Double kill. Wait. What a way to go. My hands are sweating. Just pushing you guys. These weak arms are hurting me. We almost got it. Okay, I got it. Okay, bodyguard, bodyguard, bodyguard, bodyguard, bodyguard. You know, Tim could just move. You have to move with it. Tim could just go block the thing, but it's way more fun when you say bodyguard. He can't, well, yeah, no, maybe he could. I don't know. We have a thing that works right now, Nick. You're not saying. Bodyguard, bodyguard, bodyguard, bodyguard, bodyguard, bodyguard, bodyguard. Ah, Jesus, god. Greg. One good thing, even though you guys are going to show the solutions to levels, playing them is completely different. Oh, shit. And even when you go back, it's almost like you forget how it works. No, no, no, no, no, no. Tim, why? Nick, why are you moving? Because the yellow will blast him as well, won't it? No, it's moving",
            "start": 1637.62
        },
        {
            "text": "And even when you go back, it's almost like you forget how it works. No, no, no, no, no, no. Tim, why? Nick, why are you moving? Because the yellow will blast him as well, won't it? No, it's moving with Tim. We're going to, all right, good, good, good, good. We got it. No, Blue is in the wrong way. That's okay, we'll just switch. No, Tim, why? You need to stay behind me. Oh. One, one day from retirement. So close. You guys are playing fast and loose now. Yeah, well, you know, we're feeling like we got it. Blue, get in there. Come on, Blue. We had confidence. Block that, block that laser. Bodyguard. Bodyguard. It's really clever. Thank you. Like, I got the job done, you know? I did get the job done. All right, so now, before, when we get to this point. Slow down. So hold on. Everyone stop. Why do you move? The goddamn thing moves, Kevin. One thing moves. And I can't block it 100%. I have to move with it. Really? Yes. It shoots through the corner. All right, everybody stop. Put it down,",
            "start": 1682.1
        },
        {
            "text": "Why do you move? The goddamn thing moves, Kevin. One thing moves. And I can't block it 100%. I have to move with it. Really? Yes. It shoots through the corner. All right, everybody stop. Put it down, take a breath. When you take a breath, make a stretch on it. This is our finale. Somebody open these goddamn temps. This is our finale. All right, this is our final one. We're gonna get it here. When we get to every squeeze, every squeeze of the stress ball, the death squared balls. How do you guys get to the point where it's blue, green, yellow, static? Let's just stop for two seconds and everyone observe how your other friend is living and then just figure out what their, their, their problems are. Cool. All right. You and me, man. Bodyguard. Bodyguard. Bodyguard. Bodyguard. All right. If these things ever get voices, I mean, I made a show of some sort. You have to use Greg for that. For the bodyguard strategy. We'll get you guys in for the. When this goes esports. Remember who came up",
            "start": 1733.62
        },
        {
            "text": "things ever get voices, I mean, I made a show of some sort. You have to use Greg for that. For the bodyguard strategy. We'll get you guys in for the. When this goes esports. Remember who came up with the bodyguard method. There we go. All right, cool. All right. Now I'll try to block this thing 100%. It just. The, okay, so what you're saying, so you're saying right here. Okay, we're good. Okay. So it was totally fine the whole time. It's fine. Everybody yellow. You're getting really dangerously close to falling in the hole. If you could just chill for two seconds on that. Come on. Okay. Right here. Now. Oh my God. You gotta stop when we're lined up so we can like, cause I have to move. Otherwise the yellow blasts me. That's the problem. All we gotta do is line up and I have to move with you guys. Otherwise the yellow hits me. I don't. Let's just get there. Let's just again, get there and have a conversation. Cause the yellow is hitting me the whole time. Nick go right by your",
            "start": 1774.62
        },
        {
            "text": "with you guys. Otherwise the yellow hits me. I don't. Let's just get there. Let's just again, get there and have a conversation. Cause the yellow is hitting me the whole time. Nick go right by your bodyguard. What the fuck? Bodyguard. This is the reason why we made the game. It's grid based, but you can move within the grid. If it was all grid base, it'd be too precise. And now these little bits of movement within. That's a great, great placement there. Blue. All right. Why are you not saying bodyguard, bodyguard, bodyguard? Wait, wait, wait, stop. Keep moving green. Hold on. Blue needs to just stay there. But no. And I stopped though for a second. Cause think it through the laser's not going to shoot out of that angle. I know. Now stop there for a second and think it through. Now blue needs to go right. If you guys come over, come over just a little inch. So the blue will, okay, that's perfect. Stop everybody. Now blue, Nick run and go. Cause what happened before was we got locked",
            "start": 1827.9
        },
        {
            "text": "needs to go right. If you guys come over, come over just a little inch. So the blue will, okay, that's perfect. Stop everybody. Now blue, Nick run and go. Cause what happened before was we got locked out cause we're at bad placement. So run to your run to your placement. Red red. I need it. I would have forgotten that. Good call. Okay. Now we're good. Now you guys keep on bodyguarding this shit up. You're not saying bodyguard, which is bad. You weren't bodyguarding. I was. You said bodyguard that means fucking move. I was moving but you need to move it like. When you say it in tandem, it means move. When one person says bodyguard, it means nothing. It's like get ready. It's like cue. I don't know how to, I can't, I don't think I can say that. You definitely can say go on three. You can at least think it. Bodyguard. You know what I mean? I'm trying to hear Kevin's doing real well except for this level. Yeah. But here, but here, but here, but here, but here, but here, but here, but",
            "start": 1875.1
        },
        {
            "text": "at least think it. Bodyguard. You know what I mean? I'm trying to hear Kevin's doing real well except for this level. Yeah. But here, but here, but here, but here, but here, but here, but here, but here, but here, but here. Okay. I've washed myself in here. Nice and tight. You're all right. Tim Tam. All right. Bodyguard. Slow it down. Oh, watch out. Watch out. Okay. All right. Stop. Stop. Stop. Now you're good. Stop. I'm making sure Nick can move. Okay. Greg, I need you. I know. I know. I know. All right. All right. Awesome. We're done. Tim. Slow bodyguard. Now, now hold on. Stop. Stop. Yeah. Let him just creep. Let me creep. Just let me creep. Let me creep. Let him creep. No creep. Move down a little bit. No, we're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good.",
            "start": 1917.14
        },
        {
            "text": "good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good. We're good.",
            "start": 1976.18
        }
    ]
}