{
    "id": 1629,
    "video_id": "hAX25EmrfHE",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Bad Batman - The GameOverGreggy Show Ep. 120 (Pt. 3)",
    "description": "Nick Scarpino ranks the Batmen.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1458716401,
    "duration": 1025,
    "transcript_chunks": [
        {
            "text": "Nick, yes, what's your topic all right, uh, my topic is Batman. Ah, Batman, I don't know if you guys are familiar with, you know, have you ever heard of Batman? Batman am I pronouncing that right? I believe so, yes, Batman. Um, there was a quote going around that Christian said last week, um, that I believe originated on Yahoo, I'm not quite sure, I'm on i9 right here, you can check it out on i9, but I think they link back to that Yahoo or he says, quote, uh, basically Christian Bale says he didn't quite nail Batman in The Dark Knight trilogy. Okay, are you guys familiar with this at all? Yes, I remember the Dark Knight trilogy. What is his argument against himself? That's like, what is Mr... please present your evidence against yourself. The article reads: while on out on publicity for the latest movie The Kite Runner, Christian Bale has expressed some second thoughts about his portrayal of Bruce Wayne/Batman for Chris Ran the Dark Knight trilogy when interviewed for Yahoo Movies, Bale noted that he",
            "start": 2.85
        },
        {
            "text": "Knights of Cups Christian Bale has expressed some second thoughts about his portrayal of Bruce Wayne/Batman for Chris Nolan's Dark Knight trilogy when interviewed for Yahoo Movies. Bale noted that he didn't quite capture the extent to which Bruce Wayne was messed up. This isn't the first time that Bale has said that he's slightly jealous of Ben Affleck's opportunity to play the character in this month's Batman v Superman: Dawn of Justice, uh quote \"Batman\" - he's this very, very dark, messed-up character. I found when I put on the suit, I feel like a bloody idiot if I didn't use it as a means of his true monstrous self, uh that he allows to come out in the moment. He went on to note that Heath Ledger completely upended all the plans when it came out to portray - when it came sorry excuse me - upended all of his plans when it came to portraying the character. That's not really all that much of a surprise given how much of a messed-up character The Joker is. Looking back, Bale noted that he",
            "start": 58.0
        },
        {
            "text": "me upended all of his plans when it came to portraying the character, that's not really all that much of a surprise given how much of a messed-up character The Joker is. Looking back, Bale noted that he didn't quite accomplish what he wanted to with the character but ruled out ever reprising the character again; enough's enough, we did our thing. \"Well, I'd say that Batman's always upset with how he did his Batman, so that makes him a good Batman because he's upset with how he did as Batman.\" Nailed it, Christian. Do you know what I mean? Like in comics, Batman's always like, \"You idiot, you could have done this,\" so being upset with how you did as Batman is very Batman. I don't know where I... I don't know where this pull quote came from, but he says Heath turned up and just kind of completely ruined all my plans because I'm like, \"He's so much more interesting than me.\" What am I doing? Yeah, and that's from the article; they just put it in a weird thing for so I",
            "start": 91.24
        },
        {
            "text": "my plans because I'm like he's so much more interesting than me what am I doing yeah and that's from the the article they just put it in a weird oh I see okay broke it out in a weird thing for so I guess that is the quote of of in question I mean it's uh definitely not a new argument I don't think right it's interesting to hear him say it he says you know he turned up and ruined everything I think most of the time when you talk about like the when people talk about the Dark Knight in particular right of like I think that's the best one of the trilogy right people who want to say it isn't sit there be like it's just BEC it's a Joker movie it's not a Batman movie right and even going forward it's like well yeah the interesting parts are usually the other characters well and that's also I was trying to go for a more realistic Batman the problem with going for a more realistic Batman is you can't have this like you can't have sort of you know if you like Zack Snyder or not Zack Snyder is",
            "start": 126.68
        },
        {
            "text": "trying to go for a more realistic Batman, the problem with going for a more realistic Batman is you can't have this like you can't have sort of you know if you like Zack Snyder or not Zack Snyder is going to do a more comic booky Batman if you're trying to be realistic you can't just be an **** and break people's ribs every scene cuz that's not what would happen in real life yeah um I think he did fine as Batman I didn't hate as Batman I didn't like the third Batman movie but that was whole okay are we friends on that is that an unpopular opinion I'm **** over here thinks it's the best one I don't think it's the best one godam for sure no Colin does Colin is the leader of the Dark Knight Rises I don't know you yes brother yeah yeah to be fair we don't know if Colin is just **** with Greg the entire time and Colin will never tell us so it doesn't really matter so it's not even worth speculating but I mean that's such an old argument but but the point being I don't think he was a bad",
            "start": 165.48
        },
        {
            "text": "Greg the entire time and Colin will never tell us so it doesn't really matter so it's not even worth speculating but I mean that's such an old argument, but but the point being I don't think he was a bad Batman no I don't think he's bad no no no like I think he did I mean I agree that Heath Ledger outshone him in that movie but at the same time he was so great as a Joker I think any Batman would have been you know second banana to that Joker do you feel like he's I mean obviously this is a fairly recent quote I I guess came from Sunday but do you feel like he he's looking now at the trailers of what you know Snyder and the team are accomplishing and seeing that Batman and seeing that character do you think maybe he's like maybe that would have been a better way to play it I don't think so I think he's seeing I think he's seeing a more fleshed out Batman like I think think about it that way what you're getting with Ben Affleck at least just from the trailers right is a Batman with motivation and",
            "start": 206.32
        },
        {
            "text": "he's seeing I think he's seeing a more fleshed out Batman, like I think, think about it that way, what you're getting with Ben Affleck at least just from the trailers right is a Batman with motivation and since he has this motivation he has this justification to brand people with his Bat right. And **** like you saw the fight scene you know from that one trailer, like the Batman from the comics, video games, you think about when you're Batman, whereas like when you think back to Begins was fun because it was like all new and what's happening he's dropping from but he's even like like the League of Shadows stuff they were doing right some of some you see so much of that now with Arrow or whatever and it's I'm not saying those fight scenes are better but they're different right, it's more it's not unique anymore. Batman Begins was unique CU remember this was the first time Batman could turn his **** head yes right and it's not just have the cowl like this or whatever he",
            "start": 245.28
        },
        {
            "text": "Not unique anymore Batman Begins With in at the time was unique CU remember this was the first time Batman could turn his **head** yes right and it's not just have the cow like this or whatever he was a he was fluid he was moving it wasn't it was all of a sudden this brand new fighting style I think there's also a lot to be said about professional humility where even if you think you did you're like oh I'm you know being polite to the next person in the role I'm not trying you know someone's like do you think you'd be you were a better Batman than he will be and you're like of course not even if you think it you're going to be professionally humble that's not necessarily the case but I also want to you know put out it's not like Christian B being like I **up** this is terrible it might just be like I believe this will be a good movie and uh I still want to have friendly relationships with all these people so go see the movie got to see the Academy Awards and whatnot uh that that",
            "start": 282.76
        },
        {
            "text": "just be like I believe this will be a good movie and uh I still want to have friendly relationships with all these people so go see the movie got to see the Academy Awards and whatnot uh that that probably makes more sense than you put it in that context and that light of him saying look there's always obviously more than one way play every role interesting is him saying that you know he wanted to do more of the dark stuff right and how messed up Bruce Wayne should be and Batman should be and that's the thought of where I think he says that you know Heath Ledger's Joker is so dark yeah that you can't go that way you can't I don't think you can get down into the mud and be the Batman we know from the comics who calls himself Batman you know what I mean he isn't Bruce Wayne he's Batman and that's what's happening in his head yeah I mean you have those scenes",
            "start": 314.2
        },
        {
            "text": "mud and be the Batman we know from the comics who calls himself Batman, you know what I mean, he isn't Bruce Wayne, he's Batman, and that's what's happening in his head. Yeah, I mean, you have those scenes where he has those intense moments where you know, you see Batman screaming at someone or interrogating someone or throwing people off a freaking roof, and things like that. And it just... you're right though, it doesn't have even half the intensity of like any Joker scene. Sure, anytime Joker's there, you're like the level of tension just rises to about 90%. So it must be interesting to go back and look at that. Because again, I'm with you, I think he did a great job when I think Batman Begins, when I think The Dark Knight, I'm like those are phenomenal movies. I can't imagine they would be any different. I can't imagine plugging anyone in there, and as much as I was for Ben Affleck's Batman, I'm less excited for you know Jared Leto's Joker, like I mean you have to",
            "start": 350.24
        },
        {
            "text": "they would be any different I can't imagine plugging anyone in there and as and as much as I'd be less excited for you know Jared Leto's Joker like I mean you have to compare yourself to Heath Ledger Joker is comparing yourself to the greatest movie super villain of all time you're never going to win like let's see how like how do you think Christian Bale's Batman would do against like Leto's Joker which looks terrible he just looks like an idiot like he doesn't look he looks like an he looks scary in the way like seeing a teenager in the middle of the night you're like I'm not a teenager anymore he might attack me as scary but like he doesn't look like a super villain do you know what I mean do you know what I mean no I don't we're like oh no it's a youth like and you're scared of that but I'm not **** scared of him on some global scale the way I'm he Ledger Joker right I mean for me the verdict still out on that one we have to we have to yeah we",
            "start": 385.92
        },
        {
            "text": "like and you're scared of that but I'm not **** scared of him on some global scale the way I'm Heath Ledger Joker right I mean for me the verdict still out on that one we have to we have to yeah we have to see Suicide Squad or you know whatever do you buy into the theory I forget what's your comic Acumen you big comic fan I like yeah are you do you buy into this theory that it might be Jason Todd um sure I mean I don't know it ALS I mean I don't love Zack Snyder I should say no that's fine so I mean I know that Suicide Squad is not his movie but I just don't know what hand he had in it and what he's going to paint it as sure um sure it could be but I I don't know yet that's I I my whole thing with the the Jared Leto being Jason Todd and that being him I I know there's like the Robin suit with like bullet holes in it or something whatever um it just it's an interesting way to dodge not being compared to Heath Ledger right that you're not the Joker Joker there was a Joker and he got",
            "start": 424.44
        },
        {
            "text": "with like bullet holes in it or something whatever um it just it's an interesting way to dodge not being compared to Heath Ledger right that you're not the Joker, Joker there was a Joker and he got killed but he had already tortured me and made I hope that's it man that sounds that sounds so great to me that will be like such a holy **** are you committed to this Cinematic Universe that you're you're just going to put into a movie The Jason Todd's Joker and we want you to figure that out jer's gone and dead yeah exactly not coming back that way Justice League can bring it back and he'll be like what he's not necessarily dead though he's the Legend you're like whoa the long long game on that one Jesus Christ they really kind of pulled that out of their pocket I just made a Heath Ledger death joke I apologize everyone is not your first one it won't be your last one I just don't understand his his line of thinking just in the sense that Batman to me has never been about Batman really I mean ever",
            "start": 463.68
        },
        {
            "text": "apologize everyone is not your first one it won't be your last one I just don't understand his his line of thinking just in the sense that Batman to me has never been about Batman really I mean ever since the '89 Batman like I just don't feel like I mean yeah Batman was a central character to Batman it's not a huge surprise there but it always seemed to me that it was about these ancillary characters these villains I mean excited for the villains yeah always I mean it was you know the Joker and 89 Batman Returns you know you have the Penguin like like and then you get into the shitty Robin ones and all that kind of stuff but the villains were still I think even more on those than the other ones were the draw because they were they fit like Freeze and Riddler and all these like kind of fit in this over-the-top campy ass Batman they did it but like his it does I I actually kind of agree with what what Drucker's assertion that this seems to be maybe a hum",
            "start": 501.76
        },
        {
            "text": "these like kind of fit in this over the top campy ass **** Batman they did it but like his it does I I actually kind of agree with what what Christian Bale's assertion that this seems to be maybe a hum like a humility kind of Nod in the sense that like there is no prayer that this movie is anywhere near the Nolan movies in terms of quality so like so like it's like that like not even a **** prayer that that's going to happen so like you know you're like you know you're fine and you're always going to be looked at as being the Supreme Batman from the Dark Knight Trilogy and that's not going to change so like I don't understand why AR see that's the thing is I don't I'm with you that yeah the no-animated movies are on another level because they were going for something different but think when you think back to the Nolan Batman films you're going to think back to The Dark Knight that's what I think yeah that's I don't think people look at him as the Supreme Batman he was definitely in",
            "start": 532.56
        },
        {
            "text": "when you think back to the Nolan Batman films you're going to think back to The Dark Knight Trilogy, that's what I think yeah that's I don't think people look at him as the Supreme Batman he was definitely in the top tier Batman films I think about Tom Hardy, Tom Hardy personally oh of course of course yeah but I also I did a bad job that's the plan all right that's your that's your choice okay all right I'm sorry T me no that's no I mean that that's that's my thing though one and and that maybe that's a good way to kind of frame this is when when you actually think about the like the the ranked order of Batman, what would be grammatically correct B-Man it would be Bat-man's, a proper noun in uh Kevin Conroy, Kevin Conroy is that the name of the voice actor for The Animated Series, you have to allow um giant leap down um uh I don't know after that it sort of I gotta by default I gotta go Keaton thing Man he's really good I guess he's a like that those movies",
            "start": 568.56
        },
        {
            "text": "um giant jump down um uh I don't know after that it sort of I gota by default I gotta go ke ke I'll never understand this Michael Keaton thing Man he's really good I guess he's a like that those movies are really cool really great that's not Batman that's I mean if that's Batman that's like uh it's the the cartoonish like not animated series like cartoony Batman it was and like that's fine cool but I don't know I when I think Batman I I I think Dark Knight Returns Batman or at least like darker Batman yeah but I mean there's just different eras of it like when you think when I think Batman in the 1989 I lump that in the whole series of movies like that includes Beetlejuice you know where you're like these are just really kind of creative most asinine ridiculous versions of these but there was an underlying creepiness to all of those films like you go back and watch be juice and you're like there's some dark **** in this this is not a kids movie and the 89 Batman came off like a",
            "start": 614.92
        },
        {
            "text": "underlying **** up creepiness to all of those films like you go back and watch be juice and you're like there's some dark **** in this this is not a kids movie and the 89 Batman came off like a kids movie but you've got the Joker doing some **** up **** in that and Jack Nicholson was pretty terrifying not on the level of Heath Ledger but he wasn't I don't think he was trying to play the character that way I don't think he was a bad Joker like a good Joker, Batman Returns is just full of sexual innuendo oh yeah Jesus Christ returns is **** awesome returns is yeah it's a beautiful movie but little rockets on them hell yeah that was weird but that that's what I'm saying is like that's straight out of a comic book right that straight out of the comics yeah exactly um did you think of a name for that villain yet no it's me the bear what what would your villain be let me work on it I'll get back to Gregman no I gregman Gregman Sonic Greg Sonic Greg son of Greg I don't know man figure it out",
            "start": 664.08
        },
        {
            "text": "villain yet no it's me the bear what what would your villain be? Let me work on it, I'll get back to Greg. No, I'm gregman, Greg Miller, not Gregson of Greg. I don't know, man, figure it out. I will. Um, yeah, I don't know. I would probably agree with that assessment. Conroy first, Conroy first, Conroy's got to be first. I would put Keaton and then you've got to give a nod to Bale. Bale after that, yeah, I say B's before Bale, then maybe Adam West. It's one of those like it's one of those - it's the normal Colin argument of what's the criteria? I guess you know what I mean, like that's the problem because I think Bale does so much right in terms of Batman in terms of movement in terms of this... you know what I mean, in terms of Bruce Wayne too. But that's my thing though. I would disagree but he's not cuz Michael Keaton was a weirdo, he was. But that's the whole point is like is like sorry you you you take this one. I mean like I don't understand like he like if Bruce",
            "start": 701.72
        },
        {
            "text": "I would disagree, but he's not cuz Michael Keaton was a weirdo. He was, but that's the whole point. It's like... sorry, you take this one. I mean, like I don't understand. Like, if Bruce Wayne summed up as that party when he walks in on him and they're like trying it's a knock and Vicki Vale like they're arguing about where this is from. He's like China, like how do you know that's where I bought it? You know what I mean? And he's like hi Bruce Wayne, like it's that's a good Bruce Wayne. Don't get me wrong, it's not Comic-Con. I'm going to go out and act drunk and go into the pool and buy the hotel... be like I guess that's my that's yeah. But that that never came off that came off as weird to me. Like that never came off like he was selling that that came off like, and part of it is because as the audience you're behind the curtain you see why he's doing it and you understand his motivations. But like to me I loved when Keaton would be... he played the bumbling sort of like he",
            "start": 740.72
        },
        {
            "text": "Is because as the audience, you're behind the curtain, you see why he's doing it and you understand his motivations. But to me, I loved when Keaton would be he played the bumbling sort of like he wasn't the Playboy, he was more of like I don't really know what's happening all the time, I'm kind of just stumbling through life here and there. But then when he'd have those one or two interactions with like Max Shrek, you're like oh **** wait a minute, these guys are both really sharp and they're both coming at this from their facade that that's like hitting right now but they're both kind of on different sides of the same **** up dark coin. I'm with you that like Bale's Bruce Wayne Batman is way more campy than Keaton's stuff where the **** the money's coming from for the Wayne, you know what I mean? Like there's never any Lucius Fox or anything like that right it's just like I have a really big house in this.",
            "start": 779.48
        },
        {
            "text": "where the **** the money coming from for the Wayne, you know what I mean, like there's never any way Tech or Lucius Fox or anything like that right, it's just like I have a really big house in this table I don't use he's a millionaire Enterprises Alfred's lived with me forever but he's got to wear this **** tuxedo every day he likes the tuxedo we've asked him to change he doesn't want to change he has a bunch of them it's not the same tux he owns more than one but it is the same one, it's the same one, the same same style for sure for sure yeah I don't know I don't know I do I I think back about that but I have such such conflicting thoughts The Dark Knight trilogy cuz so much of it is right and I think that's just what I always feel when when I start to Deep dive on Christopher Nolan is that there's so much of it that I love and that is right and there's just so much of it that you're like there is a little stuff that's off about it yeah but I mean that's comic book movies that's",
            "start": 815.28
        },
        {
            "text": "Is that there's so much of it that I love and that is right and there's just so much of it that you're like there is a little stuff that's off about it yeah but I mean that's comic book movies that's movies that's anything no just comic books no Fast and Furious is airtight Tim I can't even admit to that like that's yeah fast as and Furious is more like a submarine with a **** screen but what who see that's a joke I stole I don't even know where I got that from stole that joke is it yeah yeah back to know yet Battleship with the screen though I just I don't know like I I I'm becoming more and more intrigued by if this Batman like how this Batman versus Superman movie is gonna be I like I think this movie is going to be no better than good but like I think it's going to be good you know but but I don't know that Affleck's going to be the takeaway from it I think I think I think I think the takeaway is probably going to be that this might be the first Superman movie that's actually",
            "start": 849.72
        },
        {
            "text": "but but I don't know that Affleck's going to be the takeaway from it. I think I think I think I think the takeaway is probably going to be that this might be the first Superman movie that's actually worth anything since '78, no cuz even if it is good, no CUZ if the movie is good, it's going to be counted as good because of Batman yeah yeah that's the problem is then it's a lose-lose for DC and for Superman. I mean they put so much money into this too. I wonder how they're going to do financially with this. It's 250 million before marketing oh **** but somebody put it up the numbers recently of what it's projected to make and it was projected to kick some **** skull yeah it'll make I mean it, the writing is on the wall right and the fact that they've already greenlit the solo Batman film to follow and there's all these other movies that aren't Superman movies, it's Justice League, it's Wonder Woman. That's the problem with this movie is but they spent so much **** into this movie right like if",
            "start": 890.96
        },
        {
            "text": "and there's all these other movies that aren't Superman movies it's Justice League, it's Wonder Woman - that's the problem with this movie is but they stopped on so much **** into this movie right like if they hammer in too much of the Justice League it's going to be like okay **** their Cyborg yay like I think he'll just be in the background yeah hey welcome to Justice League like how do you incorporate like eight dudes with superpowers uh this I have a whole Theory I I we'll link you I'll watch the video don't give me the view all right all right I'll give you that view and I'll watch your ad thank you speaking of ads Greg, guys everybody knows good things come in sets of three what does that have to do with anything well get this March is the third month of the year and it also happens to be our friends over at Harry's Third Year Anniversary as a business and if you're new to Harry's I've got a special deal for you to try three of their expertly crafted five blade German",
            "start": 927.64
        },
        {
            "text": "Happens to be our friends over at Harry's Third Year Anniversary as a business and if you're new to Harry's I've got a special deal for you to try three of their expertly crafted five blade German razors, a handle and shave cream for just 10 bucks we're going to shave this off with it just the right side of my beard just the right side so be see you're okay with that yeah Greg go get me the Harry's no don't Harry doesn't like discounts because their prices are already so low but we've worked out a special offer for you guys and this is the all caps portion so guarders Harry's will give you $5 off your first order with promo code KindaFunny that's all one word stop overpaying for a great shave go to harry's.com right now that's h a r r y s .com enter code KindaFunny all in word at checkout",
            "start": 968.4
        }
    ]
}