{
    "id": 1592,
    "video_id": "VkLRjCq-E2w",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Casting The Metal Gear Solid Movie - The GameOverGreggy Show Ep. 117 (Pt. 4)",
    "description": "Get everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1456992001,
    "duration": 2205,
    "transcript_chunks": [
        {
            "text": "final topic goes to the one and only producer Nick Scarpino, what you got? Sor I was looking at Zac Efron, he's a nice-looking young man. I still think he could play Mark Grayson if we get the Invincible movie started already. I so I didn't even know there was a Baywatch reboot coming out. I don't know how you missed that. Yeah, I read about it. I don't care though. Do you not follow Dwayne \"The Rock\" Johnson on Instagram? Just right now I'm following him. I was messing up bad man, dude. You're missing great Instagrams he does. Little bits when he introduces characters, he curses; he's got a cute dog, the other one died. The Rock and Zac Efron in a Baywatch movie - that's going to be awesome. Yeah, he looks great. I'm excited. Um, my topic today I think comes from last week we were going to... we kind of broached it a little bit last week and and I said pump the brakes, Jack and Greg said we are going to pump the brakes so we pumped the brakes and now we're bringing it back so we can talk about it for at",
            "start": 2.85
        },
        {
            "text": "it a little bit last week and and I said pump the brakes Jack and Greg said we are going to pump the brakes so we pumped the brakes and now we're bringing it back so we can talk about it for at least 15 minutes we'll see let's cast The Metal Gear movie now that's the same I'm giving you a theme song oh is that no we can't use that one anymore one anymore that I got the movie rights I'm gonna do whatever I want um yeah you go back to that guy you pay him totally fine uh now I as a metal gear solid expert yes oh Jesus right you don't know anything I have my opinion on what era and cast this should be but I want to hear from you out there you beautiful folks who've actually played more than one Metal Gear Solid game or metal gear game I should say uh who what is the optimal like time period game and or cast for this we're telling Metal Gear Solid yes PS1 that's the story that's where we start okay so let me look up the cast of that or do you guys know the I know the cast you're welcome",
            "start": 52.88
        },
        {
            "text": "Metal Gear Solid yes PS1 that's the story that's where we start okay so let me look up the cast of that or do you guys know the I know the cast you're welcome to look it up go ahead don't worry about no okay let's let's go one by one then so so so who we're putting in the movie or who let's at least five people we going to put in the movie Snake for sure Ocelot Psych Mantis um Vulcan Raven you need Liquid we need to put Liquid in there I mean these are write these down Chief yeah Chief did you say Ninja yeah oh okay you writing all this down Kev you can put it down here too put it Vulcan Raven I already said Vulcan Raven Sniper Wolf I already said Sniper Wolf Kevin remembers Raven I'm G to put it down Kevin I got you all right all right all right I got you Kevin sake this is me Kevin this is me Snake Snake yeah we gotel Liquid Ocelot can't spell that how you spell Ocelot o c e l o t got it Merl yeah Merl is that us Merl it's good enough you're",
            "start": 97.64
        },
        {
            "text": "got you Kevin sake this is me Kevin this is me Snake, Snake yeah we got Liquid Ocelot can't spell that how you spell ocelot o c e l o t got it Merl yeah Merl is that us Merl it's good enough you're the only one who'll ever see it that's true how how Okay Sniper Wolf Sniper Wolf Vulcan Raven with an e no I **** want to murder you Vulcan Raven decoy octopus decoy oop octopus DARPA Chief you can't spell octopus I guess technically we don't need a decoy octopus you only see him when he is the DARPA Chief I know it's a it's a long time I don't know how we're going to do this but oh I actually do I'm sorry for the end credit scene Fat Man all right no nothing out of you you're not excited about that that was an Easter egg I was I was trying to think like why would Fatman be in this did for me the end the end credit scene I get what you're saying so the movie ends and we go through the credits and it comes back and it's like drinking a glass of wine you just what does he say uh eat grow",
            "start": 145.64
        },
        {
            "text": "me the end the end credit scene I get what you're saying so the movie ends and we go through the credits and it comes back and it's like drinking a glass of wine, you just want to... what does he say, uh, eat, grow fat, and be merry or whatever the hell he says, like whoa. The credit scene would make no sense at all, be a conversation about the Patriots, like what the heck is that? He snaps his roller blades together and skates off; random Irish music playing, this makes no sense at all. Alright, so you got everybody down there looking at shots of Meryl now are we start with Meryl let's start yeah let's start with Meryl cuz you don't want Julia Roberts, we're going to go we're gonna cast Julia Roberts unfortunately is just isn't now here's what I'm going to... I already know I already know looks like she's in her mid 20s early 30s no no she's she's supposed to be young in green she's in her",
            "start": 204.48
        },
        {
            "text": "Roberts unfortunately is just not here's what I'm going to I already know I already know looks like she's in her mid 20s early 30s no no she's supposed to be young in green she's in her early 20s I would say this you're looking at Meryl this is when she's got her **** together and she's about to get married spoilers from Metal Gear Solid 4 I know what everybody's going to shout out with they're going to shout out in the chat Emma Stone cuz she's a redhead she's young not putting Stone in this in this movie in this role Em Stone yeah Emma Stone too fun too cute about it too Meryl's not going to be a comedy character we're going to stay true to Hideo Kojima's Vision here all right so we need a young actress you want know who I think what who Brie Larson oh that's pretty good that's yeah I do like Brie Larson a lot okay okay okay she is range you dye her hair red her oh oh it's good that's much better who did you go with",
            "start": 245.48
        },
        {
            "text": "what who Brie Larson oh that's pretty good that's yeah I do like Brie Larsson a lot okay okay okay she is range you dye her hair red her oh oh o it's good that's much better who did you go with who did you say she said Hermione oh Emma Emma Watson yeah I mean yeah done she has the serious tone to it she has the serious tone to it I like that I like that a lot actually keep Brie Larson on the list for maybe Sniper Wolf I'd like to get her in this picture but I think SN wolf needs to be a little bit old too older too she has to be older for sure how old is no Julie Roberts I know Julie Roberts came out at the Taylor Swift concert and that made us Julie Roberts f but we don't need Julie Roberts there for that one okay so we got Merill casted we'll go with Emma Watson first uh we will if if Emma Watson is busy or otherwise declines the role we will go with uh Brie Larson and then if not we will go to she's GNA get the script and be first off she like whoa they want me in Metal Gear who's",
            "start": 285.88
        },
        {
            "text": "Emma Watson is busy or otherwise declines the role, we will go with uh Brie Larson and then if not, we will go to. She's gonna get the script and be first off, she likes whoa, they want me in Metal Gear; who's producing it? Kinda Funny; who wrote it? Hideo Kojima. She likes, I'm in; don't worry, she's too old, but I was thinking Bryce Dallas Howard for because yeah, she's got the serious tone to her; sure, sure, sure. She could again you could put on our list; you could put on a list for Sniper Wolf; yeah, we're going to do that; we're just going to workshopping names here if we're going like just pure Hollywood not trying to make this good Taylor Swift has the hair and the face of Meryl; the hairstyle, not color; sure, sure, sure. So I feel like that's easy color; we got to make artist hair makeup; they come in; we are not cashing in; we are making the first ever great video game movie; not that I don't think Taylor Swift could do a great theme song; she the theme song oh **** I can't",
            "start": 335.56
        },
        {
            "text": "hair makeup they come in we are not cashing in we are making the first ever great video game movie not that I don't think Taylor Swift could do a great theme song she the theme song oh **** I cant believe we left out this pit character we need to get a Meryl on this **** thing you kidding me right now of course yeah okay now are we going I'm looking at Meryl who are we going PlayStation version or we going GameCube version for the melee we're going PS1 version we're going everybody slow down slow your roll because then Silicon Knights and all this so I don't I don't we're we're casting we are casting an Asian woman as Meryl okay we are not making her speak in broken English that's kind of racist okay Co that's what you meant right okay okay you know what I'm talking about like how they change your voice did you ever play Metal Gear yes I did I cant I want to do my impersonation of the line my impression of the line but then don't even do it don't even do it I'm going to throw her out",
            "start": 377.12
        },
        {
            "text": "your voice did you ever play Metal Gear yes I did I cant I want to do my impersonation of the line my impression of the line but then dont even do it dont even do it Im going to throw her out there because she is unbelievably good-looking I dont know her now i like you again I want quality actresses I dont want just people who are pretty the girl from Ex Machina not oh the the the Japanese robot girl sure spoilers for Ex Machina but you should watch well you know shes a robot he this is my robot shes like hello Im a robot no he no thats not at all how shes introduced but no big deal doesnt matter if you havent seen it by now spoil never going to see a great movie it is a great movie and you should see it how oldo oh yeah shes looks yeah okay shes Im GNA go with her shes shes let me see no no no okay sure Ill give you that shes may probably early 20s late 20s mid 20s I cant believe Im being H by the famous Solid Snake but they are you know doesnt matter if I can play",
            "start": 416.12
        },
        {
            "text": "let me see no no no okay sure I'll give you that she may probably early 20s late 20s mid 20s I can't believe I'm being H by the famous Solid Snake but they are you know doesn't matter if I can play an Irishman well no we can just ch I mean we can change that part of the the continuity we can make it you know I mean like I want the character be the Nam M link because that's what we're expecting you know what I mean yeah I don't want it to pop up and it's May ma y you know n and she's just some I don't want her to Lang it's just like some like blonde girl exactly you're with me what up I mean if you guys don't if you you don't want to if you don't want to stir that Hornet's Nest like uh uh that movie every movie that ever casts a white person as like the Egyptian movie where all the Egyptian people are white people we can go down the rabbit hole we can we can we can research some some fine Chinese actresses if that's what you feel with this again I just think I think it should be a",
            "start": 459.08
        },
        {
            "text": "people are white people we can go down the rabbit hole we can we can we can research some some fine Chinese actresses if that's what you feel with this again I just think I think it should be a Chinese actor we will make it clear to Hideo Kojima in this treatment he's writing for us that it needs to reflect whatever the you know ethnicity of the actress we cast that's all I'm saying but it doesn't matter you want to you want to go find I want to go a Chinese actress right now I want to can we jump to I want to know who we want to play Gray Fox here's what I'm gonna do here's I'm going to toss out for Gray Fox and stick with me our friend Robbie Daymond did the voice of Gray Fox and I forget if it was in Solid Snake it might it must have been in the remake right yeah yeah what if we do a CGI deal for gray fox or not even CGI but he can do a David Hayter James R. Jones situation thank you exactly not I mean we're not have to help out with some CGI for the moves and stuff he's not like Raiden he's not like Colossus he's",
            "start": 503.56
        },
        {
            "text": "even CG, but he can do a David Proe (Proew) situation, thank you exactly not I mean we're not have to help out with some CG for the moves and stuff he's not like Ry (Raiden), he's not like Colossus, he's a dude there in a mask at the time Grey Wolf that's what you're saying, Gray Fox, Gray Fox, Gray Wolf Fox it's Cyborg Ninjja you probably have him on your list is that same character I'm I'm imagining if no that doesn't work out I mean yeah you could have someone like you need a someone he's maybe getting older now but someone like Ray Park playing him yeah that's think and then you get someone to do the V I agree you need someone like very acrobatic, Ray Park of course played Darth Maul and Snake Eyes I mean you could do it there's I mean at the one point when the mask opens you could use Rob's face even then because great yeah okay great for a second n got in my or Nick got in my head yeah Gray Fox has seen things he's operated on he's a Cyborg we got a couple other characters Naomi well I",
            "start": 541.92
        },
        {
            "text": "even then because great yeah okay great for a second n got in my or Nick got in my head yeah great Fox has seen things he's operated on he's a cyborg we got a couple other characters Naomi well I thought I know I I didn't I don't know are we trying to do the whole cast Miller I think Miller I want to Miller got liquid Miller's got to be liquid Owen Wilson I don't want liquid snake to be Owen Wilson s this guy sorry I'm so sorry but I can't do that liquid the only he has first off for this guy just judging off of this picture of this this yeah I'm gonna go with I want to go with the guy that was either the bad guy and The Watchmen who I love who was in a was Azie Miraftab yeah I like that guy or I like the other the bad guy in Pitch Black uh in uh Perfect Strangers we're going we can't all of these by the way can't be AAA actors this budget's going to go way we just put Rob Pattinson in it and Ray Park doing the motion capture and everything or the body work it's possible it's possible you're",
            "start": 582.04
        },
        {
            "text": "of these by the way can't be AAA actors this budget's going to go way we just put Rob Liefeld in it and Ray Park doing the motion capture and everything or the body work it's possible it's possible you're the one getting all hung up now trying to get these random people from Watchmen in it I like a lot of people from Watchmen by the way I like Alan Moore too I like Jackie Earle Haley who's directing this movie probably not Mick G damn if I could pick one person to direct this like I'm producing and I'm like I like doing this I'm going to go produce yeah I would think of course I might I might I would I would approach Christopher Nolan with it and be like is this something you want to do but the only issue there is he'd want to do it his way and that way may or may not be but do I don't know compliment each other pretty nicely you think so yeah I also feel like he's not great at he's good at suspense he's good at doesn't have that much action I mean Inception was solid one is pretty",
            "start": 635.12
        },
        {
            "text": "compliment each other pretty nicely you think so yeah I also feel like he's not great at he's good at suspense he's good at doesn't have that much action I mean Metal Gear Solid 2 was solid one is pretty pretty light it has moments but like I think no one could nail like the helicopter fight scene and like I'd like yeah he could do it he could do it but I would also like to give it to it would be interesting to see what like Hideo Kojima would do with that because I feel like he would be as true to form as he only possible and he Nails action yeah but I mean I I think he'd be better for the Metal Gear Solid 2 version compared to the PlayStation version cuz that one is a little bit more over the top give it to like maybe give it to like well you need someone that has like that darker sense to him like a Darren Aronofsky or someone like that might be too dark no but I mean like he you know he I think he could do it I think he could direct big action like that and tell a dark story like this I",
            "start": 682.04
        },
        {
            "text": "aronowski or someone like that might be too dark no but I mean like he you know he I think he could do it I think he could direct big action like that and tell a dark **** up story like this I that'd be really cool anyway continuing down the rabbit hole so we figured out who who do we have left ocelot no hold on I I want I found our psycho mantis I want to do Paul Dano you know this oh Paul Dan yeah Paul's perfect for that yeah he's he's he's lanky he's scary in his stuff when he wants to be scary I mean I'm looking at some period piece right now he's not scary at all but you understand what I'm saying there's Las super super freaky he's intense you know what I mean he is intense and I like I want to be psychomantis uh for for uh ocelot uh Kurt Russell that's perfect yeah I'm into that na that one you nailed that one knocked out of the park col good job good job he psycho I feel like he needs to like really work Psy thank you now here's the thing I need you to think of present day",
            "start": 726.92
        },
        {
            "text": "na, that one you nailed that one knocked out of the park Colin, good job, good job. He's psycho, I feel like he needs to like really work Psy. Thank you. Now here's the thing, I need you to think of present-day actor; I'm giving you not he's made bad movies before and everything else. Vulcan Raven, I think would be a good choice for Rock Roll it could also be a good Batista, Ro who did you say for? I think Batista, batia, batia. The Rock's too charismatic, Vulcan Raven doesn't have that. Sure you're right, I say Vin Diesel for for like for for Vulcan Raven. I like Vin Diesel better than Thea but I for Vulcan Raven is like hulking guy and he's got that giant Gatling gun. That's my only thing. Rock what about the Rock we already talked about him; he's too he's too much, no too is he has too is too charismatic. Diesel just hits the bill, yeah. That's why I think I think you make I think Batista is the better choice. Batista is good, trust me, I'm a casting agent all right you're the casting you're casting this film so we're going with",
            "start": 774.64
        },
        {
            "text": "yeah that's why I think I think you make I think Batista is the better choice Batista is good trust me I'm a casting agent all right you're the casting you're casting this film so we're going with the Vin VIN or Batista or Batista we'll go we'll go to Vin first because I'm sorry to say Vin is is the more bankable Star right now family but Batista's coming up that's not Tak anything away from Mr Batista he's got a great career he's coming up in the world he's going to do the the second Guardians of the Galaxy might catch fire after that we don't know so he'd be a good casting Choice Batista so now here okay is a problem we get into that we need to talk about right we T you talked about trying to cast Miller and I said well that's got to be liquid and then you're like Owen what does that mean for snake I have the perfect snake you're with me right right they're can you imagine right like they're they're twins yeah so are we casting one here's the thing they're twins but they're really",
            "start": 824.44
        },
        {
            "text": "for Snake I have the perfect Snake you're with me right right they're can you imagine right like they're they're twins yeah so are we casting one here's the thing they're twins but they're really not like you look at those faces and that's a plot point like that's not you're like no you want how old they were when they were supposed to do this when when around this time is he supposed to be like mid 20s late 30s what he be 30s early 30s right yeah cuz he metal the Metal Gear and Metal Gear 2 have already happened and then this is the thing come back and they brought him out of retirement up in Alaska and all that and who's the older one is Liquid older or no they're they're like the same right twins yeah they're twins yeah but they don't we can say for sure which one's older it's way older okay so no Kurt Russell's nailed Ocelot is perfect for okay we'll keep that there okay we need a Hal still who what about Cyborg Ninja did we figure that out uh voes Rob Paulsen maybe the FA is to Ray",
            "start": 864.6
        },
        {
            "text": "so no Kurt Russell's nailed Ocelot is perfect for okay we'll keep that there okay we need a Hal still who what about Cyborg Ninja did we figure that out uh Voight (Rob Paulsen) maybe the FA is to Ray Park's doing the body work got it or whatever the modern day Ray Park is I don't know yeah might be too old now maybe what's his name what's the guy's name the Golem Andy Serkis I thought about that too but that's more CG stuff so he can do it okay cool yeah he's he's fine he moves around fine um you know how we need how we need a good counterpart a little whiny **** who's a little whiny **** in Hollywood right now Chris Pratt and Chris Pratt was how now here's the thing I think Paul Dano could also play Hal if we don't like him there if we don't like him as Psycho for this guy I would go with I would go with the bad guy from um Quantum of Solace my only complaint is that you're looking again at like middle gear face four Images look at the little whiny",
            "start": 910.96
        },
        {
            "text": "be psyched for this guy, I would go with the bad guy from um Quantum of Solace. My only complaint is that you're looking again at like middle gear, four images look at the little whiny **** he was. I mean, like, you know he was like a dude in the sweatshirt... oh, Snake so no accent is what you're saying. I don't even... I've never seen this James Bond movie you're even referencing. I'm just letting you know that that guy's probably too cool for school. He might be too cool for school, Daniel Radcliffe with the glasses man he'd have to do an American accent. You're coming with some good **** what about The Flash? Grant Gust yeah ooh that is a fascinating pick. He could be a little bit of a **** some this could be his breakout movie star role we've seen what he could do in Glee and The Flash but here he is playing opposite Kurt Russell. God it's possible I do like I do like Grant Gustin in there, that's a good that's a strong pick and it's another affordable pick he isn't too big for his",
            "start": 958.52
        },
        {
            "text": "but here he is playing opposite Kurt Russell God it's possible I do like I do like Grant Gustin in there that's a good that's a strong pick and it's another affordable pick he isn't too big for his britches yet Grant Gustin a good guy cuz he's happy with everything he gets you know what I mean said it's Grant Gustin again got it oh Eric from True Blood is Liquid Snake Kevin if you're gonna do Eric from True Blood you've got then you go Ryan Gosling for for lead so the Gos here's what I here's what Gos think this is what really do you think this is what totally what it is casting it's go the go here's the problem is I think that most of the time and I have no nothing to back this up but I imagine most people when they're in like a studio thing and they're going no I don't even know how you **** pick a movie star I don't even know if you're what is the director who does it right there are they're casting I thought there were people that are like Experts of being like reading a script being",
            "start": 1003.96
        },
        {
            "text": "pick a movie star I don't even know if you're what is the director who does it right there are they're casting I thought there were people that are like Experts of being like reading a script being like this is the person but it depends on how it goes sometimes when they're developing a project someone will say hey I know someone so's agent let's get a meeting with them and see if they're interested and you pitch them on the project they read the script and say I like this and then you get the funding for that and then the casting agent what I'm dialing is I think I don't think people in these things are going oo like we are but I don't think they're fans of the IP as much as the go can we get the go I love the idea of Ryan Gosling with long hair oh you know what who did you just sayan Murphy yeah he did we can't afford him could be for how though he's too old to be how see my oh dude I mean I like it though I like it too but Grant Gustin's so much better can we give Grant this role",
            "start": 1055.52
        },
        {
            "text": "yeah he did we can't afford him could be for how though he's too old to be how see my oh dude I mean I like it though I like it too but Henry Cavill's so much better can we give Henry this role I'd like to work with Henry this is our chance guys we don't have any um did you see Edge of Tomorrow do I have to go get clips for I don't know we're not getting any clips right like that's too hard right we uh it's the name is down we got the Goss for Liquid Snake right now I see Solid Snake open Roy Campbell I want to be the general guy from the first Transformers movie because that he just Nails oh yeah uh what is that guy's name I don't I read something about him being Transformers General Nick Carter isn't he like always he's that guy oh yeah he is oh that guy the guy that Troy Baker does the voice this guy I say that's where was it was Troy Baker making fun of this guy wasn't it yeah I think so he's like it's this guy that guy yes I'm thinking either him or the guy that",
            "start": 1086.8
        },
        {
            "text": "That does the voice this guy I say that's where was it was Troy Baker making fun of this guy wasn't it yeah I think so he's like it's this guy that guy yes I'm thinking either him or the guy that was the bad guy in Hannibal who's always the general or William Hurt who was the General in The Avengers series oh uh the guy that was in Hulk yeah he's a bad guy in the yeah I like that guy a lot yeah he's awesome um **** what is his name he's awesome that guy's great that is a that would be a great hold on I I'll bring him up yeah that would be good I I'll float I'm not in love with it but I'm putting out there for this role as well Clancy Brown no idea is Shaquem Griffin the guard he's Luther's voice in Superman Scott Glenn Scott Glenn is a great choice for some of these guys too he's a bit old now why they burying where is he what the **** just go to Monk oh yeah sorry just go to Monk go to Monk one of the great shows one of the great shows Colin said",
            "start": 1136.16
        },
        {
            "text": "guys too he's a bit old now why they burying where is he what the **** just go to Monk oh yeah sorry just go to Monk go to Monk Monk one of the great shows one of the great shows Colin said Ted LaVine Ted LaVine yeah yeah I love oh yeah I love him and I love uh is either John William Herd I think it was it is who was uh he played the bad guy in the uh he played General Zod in the uh Edward Norton Hulk I the bad guy oh he's still the General in the Marvel Universe yeah yeah yeah yeah he's a badass yeah but just imagine him when you put a wig on him and then he does need a wig General is wearing a hat he's fine so where we think who's the General Colonel Campbell actually isn't it not Colonel General see picture of this guy we started talking about the General from the show and then they got confused I think General General Campbell is it right Colel I don't **** know whatever Colonel Campbell he's not no one's giving a Captain that much power Captain Campbell it's Colonel",
            "start": 1181.96
        },
        {
            "text": "then they got confused I think General General Campbell is it right Colel I don't **** know whatever Colonel Campbell it's not no one's giving a captain that much power Captain Campbell it's Colonel Campbell and this guy looks exactly like the bat like he we know who you really want for this who they probably modeled this guy off of was the uh colonel in Rambo remember that ah they probably modeled him literally off that guy cuz that's exactly what he looked like so we can we can try to get that actor too if he's still alive let's make a pick that guy right there see look it's is the same guy can we get that guy get that guy no oh you know what would be really good though is that a picture of him yeah that guy is literally 110 years old now is he so I don't know came out 30 years ago the bad the bad guy from um Terminator 2 uh liquid metal Rob Robert Patrick yeah he'd be with him too cuz he's aged now so he you're right he is more Haggard now yeah okay I just believe you",
            "start": 1238.2
        },
        {
            "text": "the bad guy from um Terminator 2 uh liquid metal Rob Robert Robert Patrick yeah he'd be with him too cuz he's aged now so he you're right he is more Haggard now yeah okay I just believe you you can put him in I'm just doing now okay see look at him oh come on that's him right there okay yeah R good call good call yeah and he's got range again this isn't just the is just the look you need to be able to nail you think he looks you think he wakes up in the morning looks in the mirror says I'm **** Robert Patrick yeah I would too I would wake up with just just a raging erection like yeah baby still going all right DARPA Chief should be Steve Harvey oh my God yes **** yes done holy that's the best C that we' had now that's the one where we might that might putting that out in a trailer feels like the one where people are like this is a bad video game movie but I like Steve Harve Ro is so like think contain it he can't smile the entire time he does it he can't smile we got to get that",
            "start": 1277.84
        },
        {
            "text": "like the one where people are like this is a bad video game movie but I like Steve Harvey, he can't smile the entire time he does it, he can't smile, we got to get that Steve Harve, we got get that Decoy octopus also Steve har, it's going okay, it's also going to be Steve Harvey, you never see decoy octopus when he's not Steve Harvey, so we're probably going to have to, we might have to no, we'll just pay per day, he so now we need to figure out snake obviously Jaden Smith but fat man for our end credit scene and we need Miller did we get Miller Miller's been yeah that's going to be the Gosling put in a wig Brian Gosling yeah with sunglasses on and he is the same as Liam correct right God this game I like that there's multiple characters that are the same as someone else you got to do what you got to do so we need a fat man so I'm going to throw we need a fat man do we I'm just I'm throwing this in there for you if you don't want the unedit Stinger a fat man skating",
            "start": 1332.28
        },
        {
            "text": "you've got to do what you've got to do so we need a fat man so i'm going to throw we need a fat man do we i'm just i'm throwing this in there for you if you don't want the unedited Stinger a fat man skating around i'm just afraid that we're being too bold okay okay you know what i mean like i feel like fat man should be the guy that played The Blob in uh in X-Men 3 you remember that guy that guy's a great actor i was thinking Mike for Mike and Molly oh he would work too how'd you come up with that one gr is he on Roll he's he's a fat man ask the question is he roll can't do it someone else has to do it he roller blades yeah i mean this could be anyone in a fat suit so it doesn't matter no i'm not we're not cheaping out here there's nobody in a fat suit there's a fat man in that suit all right got John Goodman that's where i went too holy **** can you imagine the theater comes unglued the **** skates come in and people are excited and then they like pan off excited it's John goodman with",
            "start": 1377.48
        },
        {
            "text": "John Goodman, that's where I went too. Holy **** can you imagine the theater comes unglued? The **** skates come in and people are excited, and then they like pan off excited. It's John Goodman with that stupid glass and the umbrella in it. Done all right now. Grow fat man, what a weird cast we have. And this cast also cost $300 million. This is a really well so far; we're okay. The probably the most expensive person on this cast I would say is uh Ryan Gosling is probably the most expensive person. Yeah, yeah, yeah, yeah. Everyone else is not too bad, but we're going to pay we're going to pay through the nose for Ryan Gosling and Kurt Russell probably. Demands a little something. Brie Larson's probably going to win an Academy Award; she's going to be expensive. Emma Watson's expensive. Julie Roberts $20 million picture. We're not putting Julie Roberts in this movie. Who's Sniper Wolf? Oh yeah, SN Sniper Wolf is Bryce Dallas Howard or is that confirmed or we just put that on there as like a I don't think that.",
            "start": 1417.96
        },
        {
            "text": "picture we're not putting Julie Roberts in this movie who's Sniper Wolf oh yeah SN Sniper Wolf is Bryce Dallas Howard or is that confirmed or we just put that on there as like a I don't think that was confirmed I don't think she's I don't think she doesn't she's not Sniper Wolf what about Gal Gadot I love Gal as much as the next guy Wonder Woman but that's I like Mila I'm sure she's milie is she Mila? She's not that I mean she's milfy yeah I would agree with Tim I think that's kind of how the MILF from American Pie that's exactly who I was thinking what but that doesn't work that's that I got to be honest just based on some of this art Bryce Dallas Howard is hitting it is hitting the mark right now she could rock that character yeah she probably could actually she's close she's the Hollywood milf you know she's not quite mil though I mean and just yes you want you want an actress probably mid-30s is what you're saying mid 30s late I'm saying like early 40s yeah I want to feel like I'm",
            "start": 1462.04
        },
        {
            "text": "\"Mill you know she's not quite mill though, I mean, and just yes, you want an actress probably mid-30s is what you're saying, mid 30s, late, I'm saying like early 40s. Yeah, I want to feel like I'm dangerous if I'm having sexual thoughts about her. Okay, Jaden Smith again, not a female. Oh, what's the what's who's the who's Will Smith's wife? Jada Pinkett Smith. Oh, I'm so sorry it was so... off. I mean, there's a big difference. You're going to tell me, tell me Will Smith doesn't come home sometimes and AC. I will say this, and this is not not that, this is bad or good. Jesus Christ. I will say this: it would be as far as the movie getting made and having broader appeal and getting big and finding we could do with widening the net as far as ethnicity is concerned on this, cuz we've got a lot of white people in it. We've got one guy; we got Steve Harvey, I think is the only person of any color and Batista, I believe broke that's it, CH broke. So I'm just saying we could use... we could use like a what about Melee.\"",
            "start": 1502.72
        },
        {
            "text": "in it we've got one guy we got Steve Harvey I think is the only person of any color and Batista I believe broke that's it CH broke so I'm just saying we could use we could use like a what about melee we have M too we do we Gotan Raven who might be F diesel he doesn't count though cuz he's kind of like the best the best segment we've ever done I'm just throwing it out we got we got Steve Harvey I'm just saying if we wanted to cast someone of of more of a of an ethnic person for for Sniper Wolf we could do that so Jay-Z would be awesome no because she needs to wait for the sequel for Fortune because she'd be a **** **** well Fortune Fortune's got to be young too but I guess I'm we're playing too well Carrie Washington I like car car Washington would be awesome oh **** yeah okay let's do her wait are you doing car Washington for next movie or this movie forun yeah okay so no we're not Sniper Wolf we still need what about does she have to be what about like",
            "start": 1554.12
        },
        {
            "text": "Yeah, okay, let's do her. Wait, are you doing Cara Washington for next movie or this movie? Forun, yeah, okay, so no, we're not SN Sniper Wolf. We still need what about does she have to be what about like a Uhr? Oh God, I'm dying. This is a hard one. She has to be able to do an accent. What kind of accent? Russian right was that Sniper Wolf was yeah, yeah, I like her. There's this one that keeps coming up in... Yeah, she works for me in porn for me. She'd be she'd be perfect. I don't know her name. Why not? It just this is again this is a real won't get funded. We won't get funded if we have a porn star in the cast. That's not true. It's 2016, it's not going to happen. Tell I'm telling you right now. I go out there and produce $200 million movies every day. Can't put a pornstar in the cast as a lead can't happen okay unless she softcore unless she softcore okay what about this I so what age bracket we're trying to hit mid-30s you said mid-30s probably realistically so that she can play I was going to float",
            "start": 1611.0
        },
        {
            "text": "okay unless she softcore unless she softcore okay what about this I so what age bracket we're trying to hit mid-30s you said mid-30s probably realistically so that she can play I was going to float from Daredevil and of course the Matrix movie Trinity but I think she's over that and I'm only basing this on I think she could work though she could work though right right MH she was still she was cuz she got to do an accent she can do an accent got to be a good actress she's a good actress devil right that's what I I said that's where I I let in with she was not in Dar dou she was in Jessica Jones that's right o **** Checkmate Checkmate Rosario Dawson yeah she could play her I'm saying if we want to go out there and and and be a little more you know equal no we've been doing we've been doing the very traditional they look like it it's like the old wizard magazine when they' be like ah well the Dawson I'm I'm I'm put all right that's it all right good now we can get to the the big",
            "start": 1678.68
        },
        {
            "text": "doing the very traditional they look like it it's like the old Wizard Magazine when they'd be like \"ah well\" the Da Vinci Code I'm I'm I'm put all right that's it all right good now we can get to the big question of Snake, Jaeden Smith. Now is that the girl or the guy? Will Smith is the is is is the girl for Christ's sake Jaeden is the guy you just brought a whole other say about this Willow Smith I'm going to say this we could we could we could throw it I'm saying we could throw it on its ear and cast a girl as a Snake right the twins don't necessarily have to be boys. Out I don't think Konami is gonna go for that you don't think so I'm going to throw a name out he's a he might be a bit too old right now but he would be my absolute like wish list get for Snake, Leonardo DiCaprio. I mean I like it just in general as a I do like Leo I don't he he looks similar to Ryan Gosling Ryan Gosling's probably gonna come off a little bit younger on screen than him because Leo's getting those nice age lines",
            "start": 1723.28
        },
        {
            "text": "in general I do like Leonardo DiCaprio, I don't think he looks similar to Ryan Gosling. Ryan Gosling is probably gonna come off a little bit younger on screen than him because Leo's getting those nice age lines right now, he's pushing 40. I mean Leo looks old now, he looks hot but he looks old. He's a bit old like I want to cast him as Sniper Wolf. Like Leonardo DiCaprio is what I'm talking about, hot age range yeah no no yeah no I hear you um I've already unfortunately reached out to Bryce Dallas Howard's people said yes soft yes which she's got another Jurassic World to do and Rosario Dawson said she's in so I don't know about what are we gonna how are we going to break the news to Bryce Dallas Howard they just gave us a soft yes well you know we'll see we'll see how that goes that that's where you let me the agent work my magic on this we'll get both of them and then we'll just shoot him, we'll shoot Leo isn't he's an interesting",
            "start": 1772.44
        },
        {
            "text": "See, we'll see how that goes. That's where you let me, the agent, work my magic on this. We'll get both of them as a role and then we'll just... we'll shoot him. We'll shoot Hideo Kojima isn't he? He's an interesting choice; he would get you talking. He'd get the papers. I mean, honestly, there - The Sniper Wolf scene is what would finally get him. As Oscar, I say we give it to him. You want to give it to Sniper Wolf? Talk about Sniper Wolf. Leo is there going to be a problem with the age discrepancy? No, I think it makes sense. Okay, how's the age discrepancy? Oh, you're talking for Sniper Wolf. Sniper Wolf. Okay, I'll put him on the list; I'll put him at the top of the list. He's going to be the most... we need only have like what, how many scenes do you think in this movie? The Sniper Wolf not too many. Okay, it's going to be a lot of money for him, but it's going to be worth it; he's going to win an Academy Award this season. Now back to the question that he was bringing up though about diversity - we're taking probably the strongest female role in",
            "start": 1814.56
        },
        {
            "text": "It's going to be worth. We're he's going to win an Academy Award this season. Now back to the question that he was bringing up though about diversity. We're taking probably the strongest female role in the picture and giving it to Leonardo. We gave Solid. We gave we gave Solid Snake like solid snake's gonna be a woman. No, it's gonna be oh we are doing that for I mean that's fine but I just I I worry about Hideo Kojima. He's not gonna go you're right Kim. Well he's just the writer in this Solid Snake. Oh that's not what I was saying. I was saying Kojima has probably has probably total control over the project. I'm going to throw Ai No yeah Kinda Funny bought the rights from Konami right for a lot of money yeah to make this film. Hideo Kojima since he loves me because I complimented his beard and that broke that video and that got totally broken out and sent to him um he got in contact with me we started talking he was like who do you want to play this person and I said I'm thinking a young Leonardo DiCaprio",
            "start": 1856.56
        },
        {
            "text": "Video and that got totally broken out and sent to him, um, he got in contact with me. We started talking; he was like, \"Who do you want to play this person?\" And I said, \"I'm thinking a young Leonardo DiCaprio for Snake or maybe a Tom Hardy might be in the age bracket, yes, brother.\" And he said, \"So let me get this straight: You want a young Leo to be Snake and you want current Leo to be Sniper Wolf?\" And he hung up the phone. He was like, \"Let's do this; let's do this. We need to get Snake.\" He said, \"Do you have any minorities?\" And we said, \"We have Steve Harvey.\" Why yes, we do. Glad you asked that, Mr. Kojima. I gotta move; I got to move if we're going to go with Ryan Gosling; he's got to be Snake. Be a great Snake, and we got to pick someone else like uh someone else in his set. Yeah, Alexander Skarsgård. You've seen his comedic range is amazing. We're gonna... I got, I gotta move over. Not funny; it's confused. I mean, I say... It's Hayden. Does the hater does.",
            "start": 1903.56
        },
        {
            "text": "Alexander Scarguard yes, he could have. You seen his comedic range is amazing. We're gonna move over, not funny, it's confused. I mean, I say **** it. Hayden does the hater does the voice, yeah definitely just the whole thing, yeah he is definitely a guard though he's a guard that's getting his neck broken or whatever. I want him to do the voice. Who's the main bad guy in this? Who's the main bad guy in this? Liquid liquid snake is the main bad guy all right the guy from XIII mean he probably pull it off good, good he could I agree I like him a lot big fan of him he was very nice to people at ComiCon which I respect. Let's wrap this up soon my knees kind of hurt this is it too yeah I thought Kevin was going to get you another chair but then he just sat there or I thought he was going to trade chairs with you and he just sat there no it's fine it's fine out no it's fine with the camera right there I don't you SL you slip past it every day I believe in I trust you with everything",
            "start": 1954.68
        },
        {
            "text": "to trade chairs with you and he just sat there no it's fine it's fine out no it's fine with the camera right there I don't you SL you slip past it every day I believe in I trust you with everything trust you with nothing we can fix but we're we've got our cast ladies and gentlemen run down the cast list for me of the Metal Gear Solid movie produced by Kinda Funny written by Hideo Kojima directed by Christopher Nolan headlining this top billing see I don't know I don't know right we need a bigger star I gotta be honest bigger star than Ryan Gosling no not Ryan Goslin we need a bigger star for for Liquid we need we need a second name a bigger name for Liquid movie star Liquid kind of like a Taylor Kitsch but but pardon me you could you could kind of swap in Ocelot as a compelling villain character in Kurt Russell in the trailers he's gonna be have some bad Ocelot at the end of the day once it becomes a franchise Kurt Russell is going to be the bad guy all right so we've got for the sake of Colin's",
            "start": 1998.04
        },
        {
            "text": "Russell in the trailers he's gonna be have some bad Ocelot at the end of the day once it becomes a franchise Kurt Russell is going to be the bad guy all right so we've got for the sake of Colin's niece Ryan Gosling a snake thank you Adam Scar's guard as both Liquid and Miller spoilers Ocelot Kurt Russell Psycho Mantis Paul Dano Merrill we've got either Emma Watson or Larson it's Emma Watson maybe Julia Roberts she says yes how Grant Guston Gustin for Sniper Wolf either Leonardo DiCaprio he'll probably turn it down we're going to go down to Rosario Dawson or Bryce Dallas Howard if we're not turning it on its head then I say Rosario Dawson yeah I'd say Rosario Dawson too sorry Leo but we'll keep Leo on the list if he says yes **** it we make the whole movie the problem with you you put Leo a Sniper Wolf his people are going to slowly turn it so it's a Sniper Wolf movie and that's not what this is about that's fine you keep cast guy that big in this role and he's going",
            "start": 2045.36
        },
        {
            "text": "you you put Leo a Sniper Wolf his people are going to slowly turn it so it's a Sniper Wolf movie and that's not what this is about that's fine you keep cast guy that big in this role and he's going to be like hey yo this is not enough for me this is not enough got get by Oel Russ there oh wait sorry um Aon I aon's how that's Grant Gustin okay I mean him and Leo could have the moment I agree just saying cyborg ninja is voiced by Rob Paulsen moves by Ray Parker Vulcan Raven uh we're going to go to Vin Diesel first if he declines we're going to go to Batista Colonel Campbell Robert Patrick first and only choice if he turns it down we don't to the film uh decoy octopus Steve Harvey and DARPA Chief Steve Harvey and a surprise credit role fat man is going to be played by the one and only John Goodman that's a picture I see that **** movie gentlem that's a that's a wrap on the party thank you so much ladies and gentlemen this has been the GameOverGreggy show before we go of course we want",
            "start": 2090.24
        },
        {
            "text": "That's a picture I see that \"Metal Gear Solid\" movie, Gentlemen. That's a wrap on the party, thank you so much, ladies and gentlemen. This has been The GameOverGreggy Show. Before we go, of course, we want to thank our Patreon producer John Deos, of course he supported us over on patreon.com/kindafunny and made all this insanity possible. Remember, you've been watching this show and what it is is that every week four sometimes five best friends gather on this table, each bring a random topic of discussion for your amusement. If you like that, head over to patreon.com/kindof funny we're going toss us a few bucks get every episode early and get a bunch of exclusive perks. If you have no bucks to toss, head over to kindafunny.com where you can watch the show broken up topic by topic day by day until we post the entire thing is one big video and MP3. This is one of my favorite shows in quite some time. We need to do more casting topics I think this is \"gold\" I've been saying for years we need a",
            "start": 2139.48
        },
        {
            "text": "post The Entire Thing Is One Big Video And Mp3 This Is One Of My Favorite Shows In Quite Some Time We Need To Do More Casting Topics I Think This Is **Gold** I've Been Saying For Years We Need A Casting Couch In This Place Yeah I'm Down Until Next Time It's Been Our Pleasure To Serve You Wait You Told Me Your Bed Was The Casting Shut Up Your Whole Mouth And Show Me Them Ice Cream Scoops",
            "start": 2179.24
        }
    ]
}