{
    "id": 83,
    "video_id": "qfQMmYcq9n8",
    "show_name": "A Conversation With Colin",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "Having Kids: A Conversation with Colin",
    "description": "Colin's excited to be a father but Greg has no desire to. Let's find out why.\n\nToday's topic was submitted by TheDanielBeyer. Leave your suggestions for future conversations in the comments below.\n\nSUBSCRIBE/LIKE/SHARE\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Tim for filming.",
    "published_at": 1371415168,
    "duration": 534,
    "transcript_chunks": [
        {
            "text": "You think we'll be doing conversations with Colin when you have a kid, I'll do whatever the **** I want when I have kids. How's that? What's up everybody. Welcome to A Conversation With Colin. I'm Greg, and this is my roommate Colin. Now sometimes Colin says crazy stuff. So every Tuesday and Thursday, I reach into my random topic pile, pull one out, toss it at them, we talk it out for your amusement if you like that. Like this video, share it with your friends, subscribe to us on YouTube. Colin, are you ready? Yes. Today's topic of conversation is: \"Colin, are you going to have kids?\" submitted by The Daniel Beyer. Oh God, yeah, probably. Why the hell would you do that? Kids suck. Yeah, they kind of do suck, don't they? Uh, I don't know. I feel like I got a... we have a legacy, the Moriartys have a legacy, and they must uh continue... uh legacy must continue. Worst argument for... oh no, I want kids. I think I think having the idea of having kids is fine; I'm just not financially there yet. Sure. Well that's...",
            "start": 0.04
        },
        {
            "text": "\"Uh, continue, uh, Greg must continue. Worst argument for oh no, I want, I want kids. I think, I think having the idea of having kids is fine. I'm just not financially there yet. Sure, well that's I found the lady I want to have kids with, you know. There's a situation in which this, you know, this could happen one day. Um, and uh, yeah. I don't I've never I don't understand the drive to have a kid. Well, I think a lot of it's biological, yeah, uh, but yeah, but also people, you know, you're going to lose all your money, all your free time, all your independence. You think we'll be doing conversations with Kojima when you have a kid? I'll do whatever the **** I want when I have kids. How's that? That doesn't make any sense. You're going to have to take him to swimming practice and track me out. Oh really? Yeah, oh I thought I would you know just kind of hang out and not do anything. You got to do stuff with them, that's the worst part. No, I mean I I see I look at it this way like my parents were very good to me and um you know I\"",
            "start": 42.44
        },
        {
            "text": "just kind of hang out and not do anything you got to do stuff with them that's that's the worst part no I mean I I see I look at it this way like my parents were very good to me and um you know I was the youngest of four and they were they were very good to me and facilitated me having a great life and being able to you know go to Great Schools and and play hockey and do all these kinds of things play the drums and um they were very you know they were I was very disciplined and they were you know they let me know what was right and wrong and stuff like that I like I kind of like the idea of having like some young uh stewards as it were that's uh is that what they call kids young stewards uh that I could teach you know and and bring into this world and kind of teach right and wrong and and put them into society one day and and you know let them do their thing or whatever I think that's kind of exciting you know it's it's a a financially daunting thing it's certainly easy to be selfish",
            "start": 79.28
        },
        {
            "text": "Put them into society one day and and you know let them do their thing or whatever I think that's kind of exciting, you know it's it's a a financially daunting thing, it's certainly easy to be selfish with your time, I think I'm very selfish with my time already, but yeah um but yeah I like done with that eventually, yeah I mean I think I think when you get a you know I think frankly we're both past a certain age where you start having kids, I mean I know a lot of people that have kids that I went to high school and college with and they seem like genuinely happy, I don't need to see all your stuff on Facebook all the time no I don't really give a flying F that's what Facebook is that's what see you know you know once in a while it's good you know once in a while I want to something yeah you know what I got pretty excited because my my oldest um nephew um my sister Dana has three boys, yeah and uh hey boys hi Dana and uh yeah her her oldest boy Dean is getting he's like G to be",
            "start": 116.44
        },
        {
            "text": "\"Yeah, you know what? I got pretty excited because my oldest nephew, my sister Dana has three boys, yeah, and uh, hey boys, hi Dana, and uh, yeah. Her oldest boy, Dean, is getting ready to be in second grade next year, and he's like G to be growing up, you know. And it's funny because he's like a little man now, you know? It's easy to look at these kids, um, you know, like her youngest is Dashel, and uh, he's like a little baby still, like you know, he's kind of just chillin' out, you know. And the middle one, Finley, is kind of like a little wild child, whatever, but he's becoming a man, he's taking music lessons, he plays baseball, you know, he does all these things, and it's like that's kinda cool, like I think when they get to that age, like, and then older, it's like... my friend from back home, Newton, has all these kids, and now they're at the age where I can just... whenever I come home, it's just all Superman\"",
            "start": 150.0
        },
        {
            "text": "you that that's cool like my you know Newton, my my friend from back home Newton has all these kids and now they're to the age where I can just I whenever I come home it's just all the Superman Justice League toys that are new that I haven't been back I just buy and give to them because I like being cool Uncle Greg I like being cool Greg you know what I mean but like the whole idea of like diapers and babies and homework again and school projects and no **** no not a chance in hell am I doing that I understand I understand that argument but I just feel like it kind of changes I I feel like people like my sister always says my my father said this to me too like you're never prepared to have a kid like there's no preparation like you it's not like now is the time like I'm financially ready and all these things you just it happens and I think you kind of like fall in love with these little kids that you have you know and like you just do whatever this I know like I know how much you",
            "start": 189.8
        },
        {
            "text": "and all these things you just it happens and I think you kind of like fall in love with these little kids that you have you know and like you just do whatever this I know like I love and care for like my nephews and my nieces and and um I like being the cool Uncle too I bought them PlayStation 3 for Christmas last year I was like the coolest thing ever you know like I brought I gave them all those Ratchet & Clank Sly Cooper games yeah that was awesome my sister was mad probably I'm think I'm going to buy him a Vita this year yeah uh so they'll be one of 10 people to own one of those uh and uh you know I I think there's something to be said about being the cool uncle and that's easy but totally but eventually like I'm going to have kids I think and and that's the only concerns I have like yeah maybe you know at like 50 I'll like oh man I **** this up and then when I'm old old and like no one's there to take care of me like that'll suck but like hopefully",
            "start": 225.64
        },
        {
            "text": "only concerns I have like yeah maybe you know at like 50 I'll like oh man I **** this up and then when I'm old old and like no one's there to take care of me like that'll suck but like hopefully like I say I'll die by then like that's what I want I don't want to get old wow so you want to die by so you're more than halfway done yeah Pro well no 60 is not bad it's like when you like said 50 no I say at 50 maybe I regret the decision so you want to die at 60 no I mean like is well his medical advancements continue to go who I want to die when I'm like all in before I'm all incontinent and I'm like shaky and I can't hold things and I'm barely able to walk when I can't hold on the controller that's the big problem um yeah no I I hear you man I I just I'm excited about the prospect of having kids one day it's like not something I want to do right now not looking to jump into it but I do understand I understand why it's cool and and I I think it's kind of neat to like have you know it's",
            "start": 261.28
        },
        {
            "text": "Having kids one day, it's like not something I want to do right now, not looking to jump into it, but I do understand. I understand why it's cool and and I I think it's kind of neat to like have you know it's it's I'm not one of those people that's like it's necessary for you know procreation is necessary for you know the continuation of our race whatever yeah like obviously but like it's like you know that's my little contribution to society apart from like my own contributions personally don't you think these contributions mean more your your changing minds, influencing lives on YouTube, it's so great. Um I I don't know, I think I think it's NE. I look forward to that day um in in some sense I definitely wasn't excited about it until a couple years ago probably and I also think you have to think about this very important fact like you know those people in your life that never had kids right like like the older people they're kind of weird right, I mean like they're kind of think about it like you.",
            "start": 302.32
        },
        {
            "text": "this very important fact like you know those people in your life that never had kids right like like the older people they're kind of weird right I mean like they're kind of think about it like you like my aunt and uncle just have no children spoiled the hell out of me and just like rebuilt their like beautiful Chicago mansion like no they're fine that is what I'm looking at yes I think I think it's like unusual not to kids oh I agree with that 100% I totally think it's unless there's like a medical reason or something like that I think it's like totally unusual to not to have kids and I don't I don't want to be one of those like those people either that like you know are like 50 or 60 just chilling it's like they never had kids they just they just go on vacation all the time that's when you see the world I don't know I feel like I feel like part of being with another person is raising a child like a combination of like you're you're you know the two of you like join into this Union",
            "start": 338.32
        },
        {
            "text": "You see the world, I don't know. I feel like part of being with another person is raising a child, like a combination of you two joining into this union, and then this is the product of the union - a new generation, in this case, more Moriarty children. Right? Yeah, then the world needs more Moriarty children. Wow, let's not get ahead of ourselves there, man. Imagine if your kid took over a conversation with Colin - that'd be awesome! I'm here at 60, though, still interviewing them. What do you think about sex robots or whatever they call it in the future? They got visors on, just tits in him, visor with tits in him. Yeah, that's how it would work, I think. Three-dimensional eye physics. Well, Daniel, there you go. Colin's gonna have a kid because he's a dope. Greg Miller is gonna have a million dollars and a Ferrari sports boat - why can't you have both? Though? Oh, what money and kids? Cuz they're going to suck it out of",
            "start": 373.08
        },
        {
            "text": "he's a dope Greg Miller is gonna have a million dollars in some Ferrari sports car, be why can't you have both though I don't want both oh what money and kids cuz they're going to suck it out of you they're going to like even like if you're like I'm not going to pay for your college make it on your own kind of thing that's still 18 years of meals and taking them places and doing things hey you want to go to Disneyland let's go let's go see this terrible animated film I don't want to see this I grew up I grew up you know my parents uh you know my dad was a firefighter and my mom uh was a stay-at-home mom and then she actually worked as a flight attendant and she went back to school and she works now now now at a university but um and this was a long time ago whatever but like we weren't I wasn't I didn't grow up like poor you know like we had like my family was fine you know but no but listen but listen that didn't mean that my parents gave me everything you know like they didn't",
            "start": 412.96
        },
        {
            "text": "\"Wasn't I didn't grow up like poor, you know, like we had like my family was fine, you know. But no, but listen, but listen, that didn't mean that my parents gave me everything, you know, like they didn't give me everything. Like I didn't just get it wasn't like I want to go to the movies, give me 10 bucks, go mow the lawn or something like that, right? Right? And like that's the way I grew up and it I got a job when I was 14 and like did all those things and my parents could have but did not pay for me to go to school or any of my siblings. So like I think that that's the kind of situation too you get it doesn't mean like that you have to spoil them, I wasn't I don't think I was spoiled, I think my sisters and my brother that are probably watching this are going to disagree, they think I'm the most spoiled out of all. You were the youngest right? Yeah, the last go around, it's all relative, you know what I mean, sure. Um, it's one of those things in 10 years.\"",
            "start": 449.24
        },
        {
            "text": "Going to disagree, they think I'm the most spoiled out of all. You were the youngest, right? Yeah, the last go-around, it's all relative. You know what I mean? Sure. Um, it's one of those things in 10 years, I still want to be able to play video games for 12 hours straight and not have to worry about anything, and I have to worry about walking this kid or feeding or whatever. Whatever you do with kids, I don't even know. I just assume they're like Patillo – I don't know, no, no. A little different. You don't walk the kid; what do you do with them? You uh talk to them, even worse. Yeah, shut the **** up! I'm playing Uncharted 4. I don't have time for this. It's a 10. Fair enough, Daniel. Thank you so much for your question, ladies and gentlemen at home. Thank you so much for your time. What do you want to see Colin talk about? Leave your suggestions in the comments below. Then make sure you like this video, share it with your friends, subscribe to our channel. Until then, have a conversational day. Grandma's Boy is like...",
            "start": 483.6
        },
        {
            "text": "Leave your suggestions in the comments below. Then, make sure you like this video, share it with your friends, subscribe to our channel. Until then, have a conversational day. Grandma's Boy is like the quintessential stupid **** movie, and it's so so good.",
            "start": 517.88
        }
    ]
}