{
    "id": 5490,
    "video_id": "Vxw7pUOXqrw",
    "show_name": "Gameplay",
    "hosts": [
        "Blessing Adeoye Jr."
    ],
    "title": "Blessing Attempts The Ghost of Tsushima: Legends Raid",
    "description": "It's time for The Tale of Iyo. Join Blessing and guests as they run through Ghost of Tsushima: Legend's grueling raid.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nBlessing - http://www.twitter.com/BlessingJr\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Blessing Adeoye Jr., and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1604255383,
    "duration": 5916,
    "transcript_chunks": [
        {
            "text": "Yo, what's up? Welcome to twitch.tv/countfunnames and I guess YouTube.com kind of funny games if you're watching this later. I'm of course blessing Addy Jr. and I have joined with me some warriors. I got Simon Cardi from IGN. How's it going, Simon? Hello. I'm well, thank you. It is 11 p.m. here and I'm ready. Are you ready? Are you ready to raid till 2 a.m.? Uh 2 a.m. Is that what we're doing? Maybe possibly. Depends. I mean what why depends on what you're feeling and I rage till I raid till the sun goes up and so you know let's do it. Also joining us we got Mike Man from IGN. How's it going Mike? A harrowing tale. Hey how's it going man? Glad to be here. Glad to have you. And we also have Andrew Garb formerly of IGN. How's it going Andrew? It's going great. It's great to talk to you. Bless you. It's great to talk to you too. Are you guys Are you guys excited? We're here. The raid is here. We get to do it. We get to do the thing. been waiting all week for this moment and arguably my",
            "start": 1.04
        },
        {
            "text": "you. It's great to talk to you too. Are you guys Are you guys excited? We're here. The raid is here. We get to do it. We get to do the thing. been waiting all week for this moment and arguably my whole life. So, here we are. All right. So, we got I'm a hunter. Simon is a is an assassin. Is that the assassin class? I am. Yeah. And then we got two Ronins and Andrew and Mike. Yeah. I'm all about healing. I I literally all I can do is heal. So, as long as I keep myself alive, I will try and keep the rest of you alive, too. We'll keep each other alive. deal. I bet you wrote We're just at the very least nothing. All right, I'm ready up. All right, let's do it. Here we go. People in chat are saying my audio is slightly out of sync. I do not know how to fix that. How bad is it? If it's really bad, I can try and fix it. If it's not that bad, I might leave it because I with OBS always suck with audio sync for some reason. She get unlimited continues. But if anyone dies, the ghosts arrive in",
            "start": 50.72
        },
        {
            "text": "bad, I can try and fix it. If it's not that bad, I might leave it because I with OBS always suck with audio sync for some reason. She get unlimited continues. But if anyone dies, the ghosts arrive in Eio's realm, a plane of anguish created by her son. Yeah, I guess if anybody dies, we restart. A place of rebirth. One that would bring death to Tsushima if the ghosts could not stop you. It was Tsushima who brought death to me. eruption. That sounds scary. I don't like this. That is not what you want to, you know, when you enter a new place. I assume this is like story mode but just nightmare difficulty. Probably. This map looks way bigger. This is my world. the gun. God, the one I was forced to create by those you protect. Damn, we got a platform. No, this is this is scary. Like a really pulls up. Nerve-wracking way to start. Cuz like if any of any of us [ __ ] up and fall, does that just kill us? That's it. We're done. End of the stream. So they conspired to destroy me. There we go.",
            "start": 103.44
        },
        {
            "text": "pulls up. Nerve-wracking way to start. Cuz like if any of any of us [ __ ] up and fall, does that just kill us? That's it. We're done. End of the stream. So they conspired to destroy me. There we go. I'm off. see it. Wait, did you fall? Yeah. Oh, no. Eio has started hunting for you. Do they see us? Oh [ __ ] It's also these weird red bulbous things. Oh, they see me. He see you. I'm fighting. Oh god. [Laughter] Oh, what was that? Oh, they their bodies explode when they die. Watch out. I think that's Oh, yeah. That's a What are these? These eggs. They're very intimidating. Um, I'm going to hit one. All right. Nothing happens. Oh, [ __ ] Oh, there's a bunch of dudes coming this way. Right over there. Oh god. Archers. Oh, there's a lot of them now. Oh my. There's a lot of archers. Wow, that's a lot. That escalated. See, there's a lot of noise out there. Switch the annoy. I'm trying to do the same. Going to try to take out these archers cuz Oh my god, you can't mess this up. Wait, wait a",
            "start": 175.44
        },
        {
            "text": "a lot. That escalated. See, there's a lot of noise out there. Switch the annoy. I'm trying to do the same. Going to try to take out these archers cuz Oh my god, you can't mess this up. Wait, wait a minute. These aren't like unlimited enemies, right? They're I hope not. They're dropping from this like I thought I saw them drop from this freaky sack tree thing. counter. Oh, they are. Are we just like fighting like a Yeah, maybe we should just nuke past them. Or is there a way to destroy the thing they're coming out of? I picked up this big crystal for 2 hours. And wait, what? There's a idle dropped. Wait. Oh. Oh, yeah. You can carry the crystal. Oh, Idol. Okay, so here we have 20 seconds. So, we All right. I picked it up and then immediately dropped it. Happy to help. Um, so there's a countdown that initiates every time you drop it. Yeah, I think we need to keep it in play, I guess. Um, those those um the red bloody ball things, that's where the crystal came from. Uh, Simon, do you want",
            "start": 253.52
        },
        {
            "text": "that initiates every time you drop it. Yeah, I think we need to keep it in play, I guess. Um, those those um the red bloody ball things, that's where the crystal came from. Uh, Simon, do you want to go invisible and pick it up? Also, we got a big on dude over here. I'm picking it up. Where am I taking it? I don't know. I guess running around with it. I guess it's up the stairs. Yeah. Yeah, we should probably figure that out first. I'll try to clear my mom. Oh, I'm down. I got you. I got you. Why take you try and make it go very badly? You know what? Maybe we should scout forward and Yeah. Let's run. Let's go up. Let's go up. I got it up one flight of stairs. So you know Yeah. Little by little. Jesus. All right. Second flight. I'll let you. Thank you. Oh my god. All right. I'm following you guys. Uh ghosts. Where you guys at? Oh, I see. Do we put it here? Oh, right here. There's three spots here. Yeah, we need to fill this up. Watch out. All right. So, guess we just got to escort",
            "start": 342.24
        },
        {
            "text": "you guys. Uh ghosts. Where you guys at? Oh, I see. Do we put it here? Oh, right here. There's three spots here. Yeah, we need to fill this up. Watch out. All right. So, guess we just got to escort whoever is carrying it. These guys will keep spawning. So, well, it looks like we need team more. Uh, I'm going run around and see if I can find one. Yeah. All right. Yeah. Where was it? It was uh from those red balls. Yeah, it was like it was like over there, I think. Oh, wait. There's one right here next to us, actually. How did you How do you open it, though? I have I hid it. No idea. That's a drone. Yeah, I just I just saw that was broken up and it was inside. Okay. Yeah, the other ones haven't cracked open. Oh, yeah. There's one just right way. Oh god, these tethered guys are scaring me. All right. I think it's good if we stay together. It's not coming down towards you guys. Although, I guess there is a difference between some of these. Uh oh, she uh Oh my god. Some of them have like",
            "start": 413.76
        },
        {
            "text": "All right. I think it's good if we stay together. It's not coming down towards you guys. Although, I guess there is a difference between some of these. Uh oh, she uh Oh my god. Some of them have like cracks on them. The eggs. Yeah, the eggs. We'll call that from now instead of balls. I mean, I'm down for Oh, yeah. I guess eggs does make more sense cuz they look like eggs. What else would they be? Yeah. All right. But I can't I can't target it. Oh, shoot. I'm going to drop a a heal real quick. Sure. Oh, yeah. So, yeah. So, I need to crack some. Yeah, some I don't know how to crack it open. Maybe we just got to take out more guys and unlock or something. Oh no, there's dogs now. Oh, great. Yeah, they're spawn. They Oh, one just broke up. Wait, one just broke right here. Yeah, but there's no crystal and this one took it. Yeah, this one just broke and five enemies came out of it, so I'm Oh god. Okay, IO is close to finding. So, is this all I guess this is all this whole thing is timed.",
            "start": 481.52
        },
        {
            "text": "no crystal and this one took it. Yeah, this one just broke and five enemies came out of it, so I'm Oh god. Okay, IO is close to finding. So, is this all I guess this is all this whole thing is timed. Okay, I'm going to say that maybe we won't do this first time. Yeah, I think that's a fair assumption. Uh, so this one has cracks in it. I guess I think it does. Yeah. Yes. Wait, something burst? No. [ __ ] Oh crap. I'm going to heal again. Nice. Thank you. No problem. Wait a minute. That one. Yeah, that one person does have a crystal in it. Where are we? Was so the crystal the one crystal we got, was it in anything? It was in the egg. Oh, it was in the egg. The the one that was Yeah, the the first I guess I mean first patty that we were at. Maybe it could be that you get them three different ways. So like one's in an egg and one is something else and one is another thing. Yeah. Blessing. You are so low. I am. I'm coming up to you. I'm done. I'm down. I can get you. Send them to their",
            "start": 553.28
        },
        {
            "text": "ways. So like one's in an egg and one is something else and one is another thing. Yeah. Blessing. You are so low. I am. I'm coming up to you. I'm done. I'm down. I can get you. Send them to their knees. I can't get you up. I'm invisible then. I'm here. I'm here. Okay. He's up. Um, what if we made a dog explode next to an egg? Oh. Oh. To see if it does anything. I don't know. Dude, the world blessing. That's a really good idea cuz the world mod is erupted. So, every enemy explodes. So, that actually makes a lot of sense. That Yeah, I like that. All right. So, we have to lure them to it. All right. Come over here. Which one? That's probably not close enough. Oh, there's a guy right here. There's a guy. Come here, dude. Oh my god. Why is he walking away? [ __ ] loring so much. Never miss. Oh, he's so close. I'm going to try to push him. Oh, nope. Oh, I'm going to die. I'm going to drop some bombs. Come on. Coming for you. Okay, here we go. All he's right next to it. Let's see how this",
            "start": 624.88
        },
        {
            "text": "Oh, he's so close. I'm going to try to push him. Oh, nope. Oh, I'm going to die. I'm going to drop some bombs. Come on. Coming for you. Okay, here we go. All he's right next to it. Let's see how this works. All right. Yeah, someone died right next to it. Oh, it's working. It's working. Oh, it totally does work. Yeah. Oh, yeah. There's a crystal in this one. Okay. Oh, and the dog the dogs come out. The ones that don't have the crystal here. I'm just going to drop bombs around you, Mike. Okay, cool. Thank you. Run, run, run. All right, cool. So, is that Yeah. All right, we got two in. Nice. All right, so guys, kill them as close to the eggs as possible. Uh, this does look good. What is this happening to everybody's screen? Oh, yeah, it is. It is. Yeah, I I think Oh, okay. All right. At least we know what to do now. With what? I think it's interesting. Oh, man. Okay, that's hard. Okay. Hopefully, it'll take us less time this time, though. Well, now we have a goal. Yeah, something to",
            "start": 700.08
        },
        {
            "text": "least we know what to do now. With what? I think it's interesting. Oh, man. Okay, that's hard. Okay. Hopefully, it'll take us less time this time, though. Well, now we have a goal. Yeah, something to strive towards. I was forced to create those. I've needed that. Just a goal. Yeah, just just keep me fighting for something. Uh, just go right into it. Simon, don't fall. Fall, Simon. No need to stealth here, right? destroyed. All right, come on. Come over here, big guy. Probably should have chose an easier target. That's true. Yeah, we took Wait, drop close enough. Uh, he might be too far from it. Let's see. If you get the enemy, the whole crystal will come out. Push this dude. Oh, it didn't work. Yeah, it's hard to lure them back. If I knew this was the thing, I would have had knock back on my arrows. [ __ ] Ooh, that pump did not help. I'm assassination is really smart. Yeah, you think he's close? Right there. Right there. That should be close. Oh yeah, he's right next to it. Here we",
            "start": 744.84
        },
        {
            "text": "my arrows. [ __ ] Ooh, that pump did not help. I'm assassination is really smart. Yeah, you think he's close? Right there. Right there. That should be close. Oh yeah, he's right next to it. Here we go. Nice. Who wants it? Simon Simon did a good job last time. You got the first one. All right. Drop the heals. Oh no. Oh, that's a lot, guys. Okay, wait a minute. Wait a minute. We got to clear this up a little bit. Oh my god. Yeah, there's a lot of guys. Holy cow. I've not seen this many enemies on screen before. It's okay. This is crazy. Oh, this is a lot. Oh, they're all exploding, too. Like, this looks like dinosaurs. Okay, I'm going to pick it up. All right, this picking up while invisible is hilarious because I legit saw that thing levitate. Yeah, run. Okay, I got your back. Simon's like an elite. Yeah, Simon's over here. We There we go. All right. No. 33% there. Did you run past it? Oh god. All right. All right. Got to do it all over again. It's probably right here. Uh yeah, we",
            "start": 811.12
        },
        {
            "text": "like an elite. Yeah, Simon's over here. We There we go. All right. No. 33% there. Did you run past it? Oh god. All right. All right. Got to do it all over again. It's probably right here. Uh yeah, we don't go far either. We probably don't want to leave that many guys right by the place where we're putting these things though. Like we might want to lure those guys away. Definitely want to take care of these archers. They're really annoying. One here. Then I can get a hit. Oh, they're going to explode. Yeah, that does real damage, too. Nice. That should be close. Oh, it's almost there's two oni over by the uh crystal houses. Nice. Be a dog in there. Oh, it's a crystal. Nice. I'm down. Where are you? Up top. I'm like right where you guys are. I'm I'm going to drop to heal. Thank you. I've got the second. Nice. Nice. That third. Do you think they randomize? Cuz that third one, if you want to just go back to that place we saw it first to see. I would assume that they are, but there's one",
            "start": 874.72
        },
        {
            "text": "the second. Nice. Nice. That third. Do you think they randomize? Cuz that third one, if you want to just go back to that place we saw it first to see. I would assume that they are, but there's one actually here. Right here. This one's closer, I think. All right, let's try it then. Yeah, that one's the third one was at the very bottom. Just making sure we definitely can't just blow it out. No, I I don't think I tried throwing bombs at it and hitting it. Nice. That guy's kind of close. Yeah. Oh, don't jump off the edge. Oh my god. O, I'm I'm throwing healing. God, I'm down in my healing. All right, I'm coming. Jeez, guys. I'm going to drop a heal right on top of this. Nice. God, there are too many enemies. I'm spamming more bombs just to try and clear them away, but like you want them to die close to it, so I don't want to clear them too much. Also got this two of these uh high health on right here. Oh, what the hell just hit me? I got to heal. There's a dog here, too. So, that didn't",
            "start": 956.88
        },
        {
            "text": "close to it, so I don't want to clear them too much. Also got this two of these uh high health on right here. Oh, what the hell just hit me? I got to heal. There's a dog here, too. So, that didn't happen. Yeah, I know. That was the wrong one. All right. So, it seems it must go. That makes a lot more sense. Well, was there one in that one before? Cuz I don't think we got that one. We haven't tried that one. Yeah, that was the first time trying one. Yeah. If you want a be Oh, I'm down a beine to the one we tried before. Oh my god, the one we got out before. I'm I'm down by Simon. This guy's pretty close. Are we down this one, too? [ __ ] I'm down. Where are you? Uh, I'm at the bottom of the stairs. Let me see if I can I almost got him. Now I got him. Get that gun. Egg. Call it an egg. I think it's an egg. It's an egg cuz like we've seen like hearts and stuff, right? Like I assume it's all Oh my god. I assume it's all symbolic of like humanity or whatever, right? Plus, I'm going to drop",
            "start": 1019.36
        },
        {
            "text": "it's an egg. It's an egg cuz like we've seen like hearts and stuff, right? Like I assume it's all Oh my god. I assume it's all symbolic of like humanity or whatever, right? Plus, I'm going to drop healing by you. Please do. Where are you? Wait. I'm like right next to All right. Uh I just dropped healing. Might be it. Wait. I don't see you healing. Oh, wait. But I'm getting heal though. So it it was my one. It was just a gourd. It wasn't the roll on you. Shoot. Um, all right. We can try. I mean, there are still a bunch more eggs, so we can just keep working our way. Yeah. Drop any hair. Nice. I feel really good about this egg. I think this is the one, dude. A little closer. Like, there's a that's what she said joke somewhere in there, but I have no idea like how to how to get there. Oh god. Some of these guys has to be close, right? Yeah, that guy's right next to it. Okay, right there. At least that one. Yeah. Uh, no. No crystal. Oh, man. Bad egg. Bad egg. It's going to be the furthest",
            "start": 1095.0
        },
        {
            "text": "Some of these guys has to be close, right? Yeah, that guy's right next to it. Okay, right there. At least that one. Yeah. Uh, no. No crystal. Oh, man. Bad egg. Bad egg. It's going to be the furthest away. Yeah, this is the one it was in. This is the one it was in before. And so if it's in this one, that means it's not random. Which one? The This one here. This one? Yeah. Well, I guess the the first one was in the one we got it from, right? So it might not be random. Yes. Uh we can try it then. Yeah. So this one right here. I'm coming to you. Simon, come to uh come to this one. This guy's kind of be too far from it. Where's he going? Yeah, that's a good call actually to keep the timer real quick. Nice. He's He's right next to it. Yeah, there we go. Uh, bad one. What? Bad egg. Bad egg. All right. Simon, you're exit. There you go. Got it. Sweet. Go for it. Eio is salivating right now. I can taste them. Uh, let us escort. Yeah, I'm with you. Closeing us. Oh, man. All right. right behind",
            "start": 1159.2
        },
        {
            "text": "right. Simon, you're exit. There you go. Got it. Sweet. Go for it. Eio is salivating right now. I can taste them. Uh, let us escort. Yeah, I'm with you. Closeing us. Oh, man. All right. right behind you. You got this. All right. My god, this is like football right now. Like a linebacker. Is it like football? I've never watched a football game. Nice. You got this. This is This is the right. Yo, Eio, you [ __ ] Yeah, that's it. I can't believe a little [ __ ] That was pretty and my child monsoons threaten to destroy a sacrifice that oh it would have been bridge photo mode enabled. Can we get back? I don't know if that's like a raid appropriate. Oh, what have you done? Oh, you activated the platforms. Okay. So, someone has to stay. I'll just stay here. Although, I don't know how I'm going to get B. There must be another one. Oh, yeah. I see it. I see it. It's um Yeah, right here, I think. Uh I think that's it up where where you are. Yeah. Okay. Oh, there's another set. Oh. Uh oh. Going",
            "start": 1223.12
        },
        {
            "text": "get B. There must be another one. Oh, yeah. I see it. I see it. It's um Yeah, right here, I think. Uh I think that's it up where where you are. Yeah. Okay. Oh, there's another set. Oh. Uh oh. Going to carry on. Wait, let let's stay at the same pace. All right. I'm across. You're good. Cool. I'm scallion. You can go invisible. were also impressed. I mean, wait, what's this? It looks like some kind of like It looks like if I touch it, it's going to hurt me. Those those look like they'll kill us. That does not look fun. Yeah. Okay. Um maybe we have to turn them off. Being invisible isn't going to help. So, we just got to platform like really quick. Um is there another way out here? I think. Yeah. I see a If you turn your uh focus on, there's a chest, too. Is that a chest? Is that treasure? We need chest. Oh, that is You want to do that? I mean, yeah, let's do it. Treasure. Do you want cool swag? This is going to kill us. I already know this is going to kill us. I'm like terrified to do",
            "start": 1302.32
        },
        {
            "text": "We need chest. Oh, that is You want to do that? I mean, yeah, let's do it. Treasure. Do you want cool swag? This is going to kill us. I already know this is going to kill us. I'm like terrified to do anything in this raid. This is probably a really bad idea. Like a trap. Yeah. I hope you enjoy doing those eggs. Does it need all defeat the treasure guardians? Okay. Oh, we got archers. Oh god. Oh, and they're tethered. There's tethered guys, dude. So weird. God. All right. I like how they have those big dudes, but they can't get us. All right. Well, we took care of that guy fast. Uh, okay. We should team up on the two and two on the tether guys, I guess. All right. So, we can Oh, I almost fell. All right. This guy's nearly dead. Is the other one close? Uh, [ __ ] Okay. All right. This guy's dead. We should run to here. I'm [ __ ] I just jumped off, guys. Oh, [ __ ] I thought there was a floor. Oh, wait. No, I respond though. probably just hurt me. Yeah, I'm just All right, this this guy",
            "start": 1360.16
        },
        {
            "text": "dead. We should run to here. I'm [ __ ] I just jumped off, guys. Oh, [ __ ] I thought there was a floor. Oh, wait. No, I respond though. probably just hurt me. Yeah, I'm just All right, this this guy responded. Uh I need to jump off of this. I'm going to die real fast. I'm running. Yeah, I'm down. Uh I'll come get you, son. Oh, it's okay. I'm here. Nice. Uh all right, we either need to exclusively focus on the tether guys or ignore the tether guys for a sec. Uh one is almost uh get to kill both at the same time. Well, yeah. Or like within a few seconds. Okay. All right. All right, I got two on Got two on this one. And then this this one's at full health. Yeah, I'm doing my best, but he's not going to Yeah, this guy's Yeah, he's he's regaining health. All right, I'm going to back off for a sec. Okay. Um who All right, blessing. We should try and tag team this one while they take the other one. Don't uh guys, don't kill him. Keep him at low health and then we'll we'll kill. All right.",
            "start": 1429.44
        },
        {
            "text": "a sec. Okay. Um who All right, blessing. We should try and tag team this one while they take the other one. Don't uh guys, don't kill him. Keep him at low health and then we'll we'll kill. All right. Okay. Okay. I got you. Blessings out. Okay. Wait, we got her, right? Yeah. Tether guys are dead. Did we get everyone? Yeah. Yeah, I think we did. What are you worried about? Yeah. Easy. Very smoothly. There wasn't any eggs, so that's true. You know what? I I think you guys a Thank you, Simon. That's just cuz he had that Swiss roll. He's in a good mood. I did, dude. I had half a choli burrito right before this and Oh my god, I am about to pass out. I am tired. It took all my energy to eat that thing. And it's 4:30 p.m. Who's Who's going to be the uh the test subject? I mean, I mean, I'm down to this. It looks like we just need a tiny bit. Yeah, we just got We just got to be good with our hops. Wait, I'm going. Hold on. Hold on. Let's take a second. No. Let's see if there's a way or",
            "start": 1479.12
        },
        {
            "text": "down to this. It looks like we just need a tiny bit. Yeah, we just got We just got to be good with our hops. Wait, I'm going. Hold on. Hold on. Let's take a second. No. Let's see if there's a way or something. Go hard or go home. That's how I play. I play games. I play I play every game like they're Hotline Miami. If I die, I die. I mean, let's do it. All right. All right. All right. Go this way. All right. Follow Mike. This is a bad idea. This is a horrible idea. I'm gonna As long as the Ronins don't die, we'll be okay. Yeah. As we stick together, two immediately die at the same time. Oh. Oh, that doesn't look Oh, this close one. Oh. Oh, my god. Oh [ __ ] Watch it. Oh, I jumped. There you go. I went for I went far too big a jumper. Okay, cool. I made it across. [ __ ] Oh, no. die. Oh, I can't move. Oh, it's damage time. That's what it is. Okay. Uh, well, I All right. Mike and I could revive you guys if it kills you from over here. So, you could That would be You want to get in first?",
            "start": 1550.64
        },
        {
            "text": "move. Oh, it's damage time. That's what it is. Okay. Uh, well, I All right. Mike and I could revive you guys if it kills you from over here. So, you could That would be You want to get in first? I don't have enough resolve. Do you have enough? Okay. So, you guys are up now. I should have timed that better. I think you're just going to get hit by um come to us. Come to the sound of my voice. All right. Thank you. here. Village of the disciples. Yeah. No, this is this is a great war squad. I bet I bet there'll be some disciples. Oh, you think there going to be some disciples? Oh. Oh god, there's still more of the bubbles, too. Oh, they see us now. Oh, that didn't kill him. That should have killed killed him. Oh god, dude. I'm like really afraid of Oh, wait. Right here. I think the bubble killed the enemy, too. It might have been my arrow cuz that was Yeah, it's probably that great aim. Are they still uh looting too? I think they are. I think so. Yeah. Watch out. Oh god. DC very scary.",
            "start": 1606.32
        },
        {
            "text": "the enemy, too. It might have been my arrow cuz that was Yeah, it's probably that great aim. Are they still uh looting too? I think they are. I think so. Yeah. Watch out. Oh god. DC very scary. Yeah. Oh snap. All right. Oh god. It's going to get me. Yeah. I Oh yeah. Oh, there's another I'm in the Yeah, I'm in the middle of it. Literally. I'm in it. I'm going to go down. I think if we die, do you think it starts up starts starts God, I can't talk starts us off from the very beginning or just this last second? Um, I don't know. I maybe I would imagine there's checkpoints, but yeah, I'm not sure. I'm going to put a healing thing in this house right here. The bubble can't get in the house. I think that's bubble's not going out. Munchin says, \"Who's in the squad?\" Uh, Andrew Garb, Mike Maman, and Simon Cardi. All IGN or IGN alum are joined by an IGN squad today. Dude, the music's so good. This is amazing. Wait, I don't even hear music. Well, you probably have everything muted, right? I",
            "start": 1655.6
        },
        {
            "text": "and Simon Cardi. All IGN or IGN alum are joined by an IGN squad today. Dude, the music's so good. This is amazing. Wait, I don't even hear music. Well, you probably have everything muted, right? I don't think I do. Oh god. Oh, [ __ ] Oh jeez. Do we just make our way through this place? Yeah, maybe. I'm not even sure where I'm supposed to go. I mean, I's not looking for us. Oh, backubble. It was worth it. It was worth that one guy. All right. I just run away. Nice. That's a lot of health for that thing to take. Oh my god. Oh god. It's going to get me. Jeez. Blessing. I'm trying to come to you, but I think we might get bubbles. It's all right. If you need to sacrifice, we go down. We go down together. Sweet. All right, I'm following Simon as usual. Right behind you. Run away. Where's it going? Turn. Oh, okay. I think we do have to go across here, though. I think across this bridge. Okay, I'm following you. You're the only one I trust. Wait, how's it feel? Never mind. I'm following Mike.",
            "start": 1712.24
        },
        {
            "text": "Turn. Oh, okay. I think we do have to go across here, though. I think across this bridge. Okay, I'm following you. You're the only one I trust. Wait, how's it feel? Never mind. I'm following Mike. Simon, you're digging me. Don't go that way. Don't go that way. There's a bubble. There's a drum. Yeah. Oh, it's coming. Oo, the the orb. Yeah, I think it just Oh, god. Something happened. Well, oh, wait. Is this is this okay? So we stand up the very end this like the then we just die. Yeah, it just maybe What if we exploded a bowl into Are all four of us in here? Hold on. Let me Oh, I think we were. Let me get back in there. Let me get some real quick. That too actually. Priorities. There's another drum down there if you guys are good. But I think everyone's good. Um, there's this big gate. There is a big gate. I found that. Um, maybe it's like there's also a swingy swing right there. Oh, actually, there's a button thing right here. Oh, button. Oh, that's that's probably You know what?",
            "start": 1784.56
        },
        {
            "text": "There is a big gate. I found that. Um, maybe it's like there's also a swingy swing right there. Oh, actually, there's a button thing right here. Oh, button. Oh, that's that's probably You know what? Probably look for a look for a button. Uh, platform popped over here. I don't know where that goes, though. Oh. Oh, god. Okay. Um, oh yeah, that's probably I guess we got village. We were just there though, right? Probably stuff we got like collect or something. Maybe a different touch pad somewhere, isn't it? Uh, I'm trying to figure out if this is doing anything when we're in it. Is the gate like lighting up or something when we step on it? I'm trying to see. Look like it. Does someone want to Should we have a look? There's probably another one of these paths around the town. Uh, see, there must be a reason it opens up. Yeah, it looks like the these uh swinging thingies are set up for us to go back and forth. So, maybe we got to do something in the the town. Yeah, but the bubbles are in",
            "start": 1856.08
        },
        {
            "text": "must be a reason it opens up. Yeah, it looks like the these uh swinging thingies are set up for us to go back and forth. So, maybe we got to do something in the the town. Yeah, but the bubbles are in the town. All the bubbles here. Yeah, we have to bring a bubble to the circle. Um, I mean, I think you're right, dude. I think we do probably have to like I I think the platform is a shortcut to avoid swinging it looks like cuz it goes in the same direction. Simon, what do you got? What's going on down there? I'm just running around. Simon, you're so brave. I love that. I like I like that Simon's a gogetter. I just cry and stand on the button. Why you guys all went down there? Oh god. Well, there's one more dude here. Maybe maybe we just didn't kill everybody. We just murder him. Yeah, that's a [ __ ] up solution. Oh god. Oh, yeah. Mike's answer is always murder. All right. I mean, video games happen. I mean, they got these like enemy spawn troopy thingies, so I assume there'll be more",
            "start": 1914.12
        },
        {
            "text": "a [ __ ] up solution. Oh god. Oh, yeah. Mike's answer is always murder. All right. I mean, video games happen. I mean, they got these like enemy spawn troopy thingies, so I assume there'll be more guys at some point. Uh, I'm still up here in case I have to trigger anything. I guess I should come down there. Yeah, I don't see anything in these houses. Not really. [Music] Oh god. Is that bubble going to come back? Oh, it is. Oh shoot. Oh no. Always got the sacrifice tactic. Al. Also, that way was a way quicker way than taking the bridge. Oh, coming up. Really? Maybe I'll do that. Yeah, around the house. Start from here. Oh, too short. Okay. Oh, there's like two more guys here. What the hell? What if like every time I step on the button spawning guys and just Oh, that' be hella funny. Uh, okay. Let me see. Oh god. Oh, freaking bubble. All right, let me see if I can take these guys out real quick. Oh, wait a minute. All right, wait. Hold on. Hold on. Uh, blessing, stay rear. Keep looking",
            "start": 1968.4
        },
        {
            "text": "Let me see. Oh god. Oh, freaking bubble. All right, let me see if I can take these guys out real quick. Oh, wait a minute. All right, wait. Hold on. Hold on. Uh, blessing, stay rear. Keep looking down. Does anything happen to the bubbles when I step inside it? What was that? Bless you. Thank you. I appreciate it. There we go. All right. So, gather at soul well. So, this must be the the soul well. Oh, so we were just here too early. All right. We thought it was like a Okay, we got to kill everybody in the town. All right. Well, that was just stupid of us then. Uh, pro gamers. Pro gamer hours. Can someone activate that jump so I can get off you? Oh, yeah. I got you. I got you. Okay, Simon, you missed your chance. down there forever. I think gathering at the soul well felt the ground calling out for souls. Miss guy, but who's prepare yourselves for is the scariest text I can possibly imagine. Yeah. No, I don't like that at all. Following that with the earth demands blood. Oh, maybe we",
            "start": 2043.84
        },
        {
            "text": "out for souls. Miss guy, but who's prepare yourselves for is the scariest text I can possibly imagine. Yeah. No, I don't like that at all. Following that with the earth demands blood. Oh, maybe we shouldn't be in this solo coming. Oh, this dude's coming. I see him right there. Feed the soul well. You killed him in the circle right next to me for a second. Okay. [ __ ] Eio is hunting us too. Oh, it's a flash. Oh shoot. Oh god. Okay. Wait, we don't have Do we have to kill them in the circle? Is that what they I think so. I think I think so. Yeah. Yeah. It is a sacrifice. Yes. Oh, they explode still. Watch out. Yeah. Eruption still active. Uh, there's a drum down below, too, if anyone needs it. So, wait, we we need to lure them to us again, then. I don't know if we do. I think we just kill it. Oh, there's a disciple. All right. Okay. I'm bomb. Thank you. Oh, damn. You know what? Wait, there's like there's like two more of those. See the the spires coming from the town? Yeah. Well, it's",
            "start": 2096.4
        },
        {
            "text": "it. Oh, there's a disciple. All right. Okay. I'm bomb. Thank you. Oh, damn. You know what? Wait, there's like there's like two more of those. See the the spires coming from the town? Yeah. Well, it's called the village of the disciples, so this makes sense. Uh, should we take out all three of them? All right. Someone has logic. Okay. I canate one. Uh, all right. Oh, I missed the jump. My god. I'll go for I'll go with Cardi to the this other one here. I'm going to jump down to blessing and we'll go to the other one. Yeah. Where's the other one? Can you mark them? Uh, oh my god. The one I marked in the distance. Yeah, it's like in that tower out there. Ora. Okay, that's one. Okay. Uh, the other ones. Oh my god, I'm very bad at marking. There we go. There's the other one. I've got the soul of the disciple and it potency. Oh, is it? Wait, say that again, Simon. I've got the soul of the disciple. It is now. Do I Oh, so you kill them and then you have to return to the circle. Got it.",
            "start": 2147.6
        },
        {
            "text": "soul of the disciple and it potency. Oh, is it? Wait, say that again, Simon. I've got the soul of the disciple. It is now. Do I Oh, so you kill them and then you have to return to the circle. Got it. Gotcha. Did we get the soul of that first disciple he killed? Uh, well, no, I guess not. He was on the house. Yeah, that was my bad. I threw bombs. I thought I was helping with my bombs. Useless bomb boy. Uh, let me Is this what we do? I don't know. Yeah. No, that sounds right. I don't know if the disciples will keep respawning. Oh, yeah, it did. Yeah, blessing. The other one's back. Okay. In the house now. The power of the soul well waines. All right. I think that's telling us we're going slow, I guess. Um, all right. So, I just acquired the soul. Well, so the one that Simon killed first, that guy was still dead, but we just got his soul. Okay. It's now. What's the potency thing you were saying? Oh, jeez. Like over time it was going down right now. Oh, yeah. Same here. Can someone get",
            "start": 2201.12
        },
        {
            "text": "that guy was still dead, but we just got his soul. Okay. It's now. What's the potency thing you were saying? Oh, jeez. Like over time it was going down right now. Oh, yeah. Same here. Can someone get the So, we got to we got to put them all in there at the same time. It seems like I got a guy. All right. Is there one? All right. I'm I'm killing one now. All right. I just killed one. I have a soul of a disciple. I'm going to try and come back up. The fastest way to get up. Soul house. Run. Try uh around the house. Around the back of the house. Oh, I see. Yep. I'm coming. So, how many how many souls do we have? Cuz I have one. Andrew has one. Where's the third one? I I delivered one. So, you got But does All right. I'm in. Oh, no. Wait. I'm in. What? How did I deliver? I'm standing in the circle. Yeah. I don't know if I delivering just Yeah, there's like that happens. It might be cuz I was getting hit while I was I might Yeah, I might have had mine too long. I have no idea. Me, too.",
            "start": 2250.72
        },
        {
            "text": "circle. Yeah. I don't know if I delivering just Yeah, there's like that happens. It might be cuz I was getting hit while I was I might Yeah, I might have had mine too long. I have no idea. Me, too. Yeah, while I had it, like the the countdown started going really really fast. Oh, okay. I got you. Uh I have a very bad feeling that we're doing this too slow. Yeah, that's what it seems like. So, they're all back now. I'm waiting for the house here. All right, I got a soul. I'm going to try to go. Can someone get the bridge by any chance? Yeah, I got you. Okay, cool. I'm stuck in an orb. All right. Try to hustle up there. No. Every time every time an enemy hits you, it knocks you out of that orb thing, which is Yeah. Nice. All right, Mike. Uh, all right. It's doing something. Yep. There's like these blood streams going towards the gate. Okay. Oh, so I think we have to not interrupt it. I think we have to let it reach the gate, it seems like. So, mine got interrupted. Can I Can I Can",
            "start": 2298.4
        },
        {
            "text": "like these blood streams going towards the gate. Okay. Oh, so I think we have to not interrupt it. I think we have to let it reach the gate, it seems like. So, mine got interrupted. Can I Can I Can somebody step on the button? Uh, I just went back down to the house to try and get the disciple. Um, okay. All right. I'm back in the house. I'm going to kill this disciple. I'm going to come back. I'm not going to get bubbled. I got real quick. I got bubbled. I'm going to go down. Okay. Take out this guy. Oh, get hit by him. That works, too. Yeah, I'm super bubbled by the house. Oh my god. All right. Wait. I got out of it. No, I'm back in it. Yeah, that bubble is it's it's an aggressive puzzle bubble, boys. Uh, do we get all the All right, I got the disciple. There are a million guys here that I'm trying to run away from without getting bubbled too bad. Do you want to help? Uh, no. I'm coming back up. If you want to maybe be waiting top to help me if these guys follow, but I think I'll be",
            "start": 2354.08
        },
        {
            "text": "I'm trying to run away from without getting bubbled too bad. Do you want to help? Uh, no. I'm coming back up. If you want to maybe be waiting top to help me if these guys follow, but I think I'll be good. Sure. Uh, all right. All right. I'm getting in the solo with [ __ ] it. All right. He like climbed up and it was like, nah. And then climbed back down. Okay, cool. So, it's gradually going higher. a little bit. Uh yo, this is ill. This is sick. This is really cool. All right, I'm going to try to go. This one uh right here. God, I am blind. I know, dude. Oh, god dang, those archers, man. Yeah, those flashbangs hit real hard. Can someone get the button for me? I'm trying to Okay. Oh god. Let me throw this. Screw it. Oh, thanks Son. That was a really well placed invisible. I'm on the button. [ __ ] that archer had band. Oh, I'm so sorry. I had a roll. Really? What? That caught perfectly on stream, too, because I got hit by an archer. I had a roll, and then as soon as I rolled off of it,",
            "start": 2404.32
        },
        {
            "text": "[ __ ] that archer had band. Oh, I'm so sorry. I had a roll. Really? What? That caught perfectly on stream, too, because I got hit by an archer. I had a roll, and then as soon as I rolled off of it, that's when he jumped. All right, there we go. Come here. Thing's okay. Yeah, there we go. There's two disciples. Yeah, there's two disciples on the other side. We should probably I keep This is crazy. I'm going to drop a heal. Yeah, there's like I think they're on the left side. Yeah. Yeah, they're both over there. Uh I can stay here for button and I'm waiting for one more to appear in the house. I can try and go for that far one. All right, for sure. I'm going to clear out some dudes here with you. Go for it. Okay, cool. And then maybe uh followed them up. I can't tell what's an orb or what's like a disciple thing, you know? Oh, no. Oh, there's two disciples in here. Can I get both of them? Both. I assume you can't. Uh yeah, I can hit the button. Uh let me roll off this guy. I won't kill",
            "start": 2462.16
        },
        {
            "text": "like a disciple thing, you know? Oh, no. Oh, there's two disciples in here. Can I get both of them? Both. I assume you can't. Uh yeah, I can hit the button. Uh let me roll off this guy. I won't kill you. I got the guy. There we go. [ __ ] I can't even tell which is the way. Oh, cool. All right. Cool. Let's uh let's try and keep everyone off Simon to make sure he doesn't get interrupted too. God, this orb is so aggressive. Oh god. I see you, man. Let me throw some bombs over there. You back him up. God, I need a All right. How do I do the thing? Uh you just stand there and don't get interrupted yet. Yeah, let's see the blood come like head towards get this big guy. Stay in there, bud. Um, can't be. Uh, oh, he was close to finding us. Oh, really? Oh, shoot. Oh, okay. I'm going to just head straight for the I'll tell you. He's been close for a while and so I I Yeah, I missed the Yeah. Oh, I just sw Yeah, that bubble. Uh, there's more. O, these flashbangs are rough. Yeah, they are. [ __ ]",
            "start": 2519.92
        },
        {
            "text": "for the I'll tell you. He's been close for a while and so I I Yeah, I missed the Yeah. Oh, I just sw Yeah, that bubble. Uh, there's more. O, these flashbangs are rough. Yeah, they are. [ __ ] Got two. I'm gonna try to head over. Oh, I need Oh, wait. I'm gonna get health. Yeah, I gave you a little health. Thank you. I can give you my big one, too. I just want to wait for a long way. No, you can give me your big one later. Don't take that out of context. Oh, I just went right in the bubble. [ __ ] it. Oh, no. All right. I sacrifice myself in the bubble. All right. All right. All right. Uh, this guy's down. I have two here with me. Can you carry two? Maybe the the potency went up when I got I couldn't I couldn't tell. Okay, that seemed like the case with me too when I got Maybe it's just like 10 points basically and if you two here, I'm going to drop in the bubble too if you guys need it. Actually, everyone's good except I'm going to get I keep getting hurt. Yeah, you going to house it.",
            "start": 2582.24
        },
        {
            "text": "10 points basically and if you two here, I'm going to drop in the bubble too if you guys need it. Actually, everyone's good except I'm going to get I keep getting hurt. Yeah, you going to house it. Yeah, he's found us. Oh, shoot. Yep. Damn. Yeah. So, how do we tell? How can we tell how close we are? Or can we? Is it the blood that's on the door? Cuz there's like some blood on the door. Yeah, I think the the blood I assume you needed all the way to the top or at least tired we were getting it. I think we're right below half kind of. Yeah, we were like a third. We know what we're doing now, though. Beautiful. Oh, we didn't do the first leg. All right, I think we should each build the gate up. I can take house. I'm going to take the house right here. I think someone should take middle and then two people should take left. Cuz there were two at a time appearing left. I'll take I can go left. All right. So Simon's left. I play. Mike, take middle and I'll try and step on button cuz I'm just",
            "start": 2642.24
        },
        {
            "text": "two people should take left. Cuz there were two at a time appearing left. I'll take I can go left. All right. So Simon's left. I play. Mike, take middle and I'll try and step on button cuz I'm just going to go back and forth to house. Okay, sounds good. Um, so now let's wait for left side. All right, so first left appeared. All right, here. Yeah, we can fight off these dudes, too. That's a good idea. Oh god. Oh god. Oh god. About like the big bubbles and all the house. Mike, I'm going to house really quick to get the No. Trying to go fast. Oh, she's up here, which is great, actually. [ __ ] All right, I'm coming back. Oh, house. I got the first one at house. Um, you said there was one on left. Uh, I mean the first the first thing appeared. Yeah. I've come Oh, okay. All right. I'm dropping off the first You want to guard me first? Real quick. Yeah, for sure. Yeah. Throw all my bombs. Okay. And then if you want to stay, I'll run back and get uh the second house one, I guess. This one",
            "start": 2687.44
        },
        {
            "text": "off the first You want to guard me first? Real quick. Yeah, for sure. Yeah. Throw all my bombs. Okay. And then if you want to stay, I'll run back and get uh the second house one, I guess. This one right here in the sec. Yeah, I can get the one in the middle house here. I'll run back. Okay. Oh, yeah. I see. I just have to avoid the bubble on this one. Oh, god. Bubbles very much here. All right. I'm going to hit this middle. Let's switch right here. All right. And I didn't make that jump. Okay. All right. I'm coming back. I got the house one. God, dude. There are a lot of enemies and a bubble. There's one on. Okay, cool. I'm right by you. Uh, yeah, I got it. Although I'm carrying a thing, but whatever. Here, I got you. All right. I got you covered, Simon. All right. Uh, Mike, we'll get in together cuz I have one, too. Yep. Sounds good. Let's do it. And then let's uh God, I wish I had bombs right now. I'm actually out. Yeah, I'm out, too. H I have nothing range. I have nothing range. I'm",
            "start": 2751.36
        },
        {
            "text": "cuz I have one, too. Yep. Sounds good. Let's do it. And then let's uh God, I wish I had bombs right now. I'm actually out. Yeah, I'm out, too. H I have nothing range. I have nothing range. I'm just waiting for them to take something. Never mind. This is just like egg game. All right, there's another one I'm going for. It's just like it. You're right. Game of Fall, guys. Actually, it's not far. Going faster already. I'll go middle again. I'll be back. All right. I'm going to go to house. [ __ ] There's a lot. Okay. So, they go down in one hit, though. So, wounded. Yeah. Exactly. All right. Someone got bridge. Uh, I just got one house. I'm coming back up and I'll get bridge. Just give me one sec. Thanks, Cy. Awesome. Oh, wow. Yeah. It would have been funny if I missed that again. Cardi just kills you. All right, I'm back with it. I think maybe All right. Is it even working? Okay, looks like it. Yeah, I think we're like halfway. Oh, yeah. We're definitely higher. I'm definitely higher",
            "start": 2800.88
        },
        {
            "text": "kills you. All right, I'm back with it. I think maybe All right. Is it even working? Okay, looks like it. Yeah, I think we're like halfway. Oh, yeah. We're definitely higher. I'm definitely higher than All right, sounds good. Uh heal one more on left. Yeah. Yeah, I'll I'll get the second one on left. Are you going for the far one or close one, Cardi? Uh, well, I think they're both literally one. Well, there Yeah, I'll get my Did you already get this ammo refill? Which one? I did. Does it refill? No, I I just hadn't gotten it yet. Uh, I have bombs now, though, so if they do start storming, I can grab. Yeah. Um, I'm just watching for a house. Yeah, I'm chilling on nine bombs right now. So, it should be okay. At least for this, guys. Yeah, we can uh we can fight these guys. Yeah, I have like 10. Oh, you trying to get through here? Just keep rocking. I was struggling. Like for real. Nice. Okay, I'm out of bombs again, but we're doing well. We're definitely way higher than we were last",
            "start": 2856.24
        },
        {
            "text": "10. Oh, you trying to get through here? Just keep rocking. I was struggling. Like for real. Nice. Okay, I'm out of bombs again, but we're doing well. We're definitely way higher than we were last time. Okay, it's wild how well we can do when we know what we're doing. Go middle. There's two two left and one middle. All right. Um um I can stay here for bridge and I just The ones on the left are on are in the same house it looks like. Oh, so you get two at once. Yeah. You might want to hit the drum real quick before you All right. Never mind. Yeah, I'm already here. I'm already gone. All right. Nothing to stop. [ __ ] drum. Oh, far. Yeah, I'm coming. I'm coming. I'm coming. Sorry. Sorry. No, it's okay. Just drone. Give me a second. You're up. You're up. Okay. Okay. I got if I could. All right. Flash. Are you able to do long distance healing by any chance? Oh, yeah. I'm not healing now. I got it. Thank you so much. All right. As soon as I got it, I was like, I made a grave mistake. Uh,",
            "start": 2910.4
        },
        {
            "text": "Flash. Are you able to do long distance healing by any chance? Oh, yeah. I'm not healing now. I got it. Thank you so much. All right. As soon as I got it, I was like, I made a grave mistake. Uh, there's one more in middle. I'm going for middle. Okay, cool. I'll get bridge when you come back. Unless house appears, I'm going to jump down. There's one left, too. We're getting pretty high, guys. We're We're like 75% like I'm going to house the bridge. Yeah, I got you. Yeah, I'm right here. I'm I'm grabbing house really quick. I'll be right back. Oh, Christ. Oh god, she's way further. Okay, coming back. Some dude's coming up. Oh. Oh my god. We're We're getting there. And Eio doesn't even know we exist. Oh, he did not. Wait, did I not get her? That guy tried to shoot us from hella far. Hold on. I'm waiting for this bubble. All right. All right. I'm going drop heals. Uh there's one. Okay. Yeah. I'm trying to get into house, but bubble is not doing me any favors. You want me go to for middle?",
            "start": 2971.84
        },
        {
            "text": "I'm waiting for this bubble. All right. All right. I'm going drop heals. Uh there's one. Okay. Yeah. I'm trying to get into house, but bubble is not doing me any favors. You want me go to for middle? I think I got her. I'm all right. I have so I'm coming up. Oh, I just jumped right into a bubble. Oh, that's great. That's great. Oh, no. Uh, is anyone at the circle? Got you. I'm I'm at the circle. Yeah. All right. I'm coming right now cuz I have Can you get the Oh, yeah. That happened. I'm on, buddy. All right. Uh, Mike, I got you. Okay. I revived you. Thank you. Uh, blessing. Can you help me fight these dudes? Yeah, I got you. All right, cool. Let's get bridge. Bridge, please. Hold on. As soon as I drain my soul. Dude, look at us. Look at us. Need those souls. No challenge. Let's do this. Can Can someone get the bridge? Oh, me and Andrew just excited. We're like, \"Oh, [ __ ] We did it. [ __ ] these guys. We're out of here. That's fine. We'll just chill here. We like this place.\" I",
            "start": 3031.04
        },
        {
            "text": "Can Can someone get the bridge? Oh, me and Andrew just excited. We're like, \"Oh, [ __ ] We did it. [ __ ] these guys. We're out of here. That's fine. We'll just chill here. We like this place.\" I needed to come to Oh, that's hilarious. But no came. Thank God for this ammo refill. Uh, anyone need heals? I'll just Oh, there we go. Oh, we're going to take a photo every time. Dude, I'm not take a photo. You want You want to do a squad photo the gate? Should we do like a pose? Like an emote? Yeah. At the gate. At the gate. At the gate. All right. Wait, did you get a pose or did I catch you like my bad? Yeah. Don't do it yet. Don't do it yet. I forget what my Okay. All right. Am I like mid raising my arms? Yeah, I feel like I feel like we didn't. Yeah, we you got to count down. All right, countdown to your pose. Three, two, one, pose. Photo mode. Oh, my hands are like awkward. I like it. That's what I'm doing. Yeah, I I actually I kind of like it. Very quick. This is great. What a crew.",
            "start": 3097.28
        },
        {
            "text": "to your pose. Three, two, one, pose. Photo mode. Oh, my hands are like awkward. I like it. That's what I'm doing. Yeah, I I actually I kind of like it. Very quick. This is great. What a crew. Yeah. Don't Don't exit yet. I'm trying to find the perfect uh filter. Dude, blessing. Simon and I have done this for like 45 minutes before. I Trust me, you're you're with the right guys. I uh I've posted about 20 on Twitter in the last Yeah. All right. This is great. The goal. Oh my god. If you guys go to the filter that is uh the gink go color grading where it just keeps the bold. Yeah. Yeah. It's great. The uh I have it on vivid cuz everyone's colors are so bright. Incredible. Guys are doing great. All right. Hold on. I got to do one where it's 90°. Oh, they're vertical. I love that. Vertical. Yeah. We have stamps for those now, too. Okay. I look so ridiculous compared to you guys. I think you look great. Look at that cool hat. Uh I'm just going to change the weather really quick and then you",
            "start": 3175.68
        },
        {
            "text": "We have stamps for those now, too. Okay. I look so ridiculous compared to you guys. I think you look great. Look at that cool hat. Uh I'm just going to change the weather really quick and then you can't change. You can't. Oh, you're right. Yeah. All right. I'm good. Oh, let me just take the screenshot then. Yeah, I'll be sorry. Andrew, if if you're uh if you happen to be talking to your to your uh workmates, you should uh have them add a button that just flips at 90 degrees in the rule. You know, just, you know, L1 plus R1 90 degrees. Just think about it. Good tip. Good tip. Uh I'm gonna exit whenever I just added Yep. Yeah, I'm good to exit. What's up, chat? By the way, sorry I've been ignoring ignoring you guys. I've been very focused. It's a very focus intensive game. We got we got all these things to solve. We got to work as as as teammates. Got to do all the things. You know how that is. Also, there how are there more viewers now than there have been for Dontober? Answer me that",
            "start": 3246.64
        },
        {
            "text": "these things to solve. We got to work as as as teammates. Got to do all the things. You know how that is. Also, there how are there more viewers now than there have been for Dontober? Answer me that chat. I mean, I've got a good good answer for you. We're at 400 something. Dontober usually averages out at 300. What are we doing? I love that we're taking all these photos and chilling and we're going to end up going through here and getting our asses kicked by something else. Before and after picture. I'm ready. All right. Should we exit? All right. Everybody in chat is like Donkey Kong isn't great. How dare you guys during the month of remember tomorrow's uh tomorrow's Donawen 12 noon Pacific time. Uh it's me Barrett the abyss. We're going to play through the the finale. O DK64 all that good stuff. Does Donkey Kong have a raid though? Fair point. Blessing. Does uh does Barrett use the barrel? I gave him I gave him a Donkey Kong barrel. Oh, did he does he like display it during stream?",
            "start": 3312.8
        },
        {
            "text": "stuff. Does Donkey Kong have a raid though? Fair point. Blessing. Does uh does Barrett use the barrel? I gave him I gave him a Donkey Kong barrel. Oh, did he does he like display it during stream? I'm going be honest. I I don't see Barrett's stream because of the way we have it set up or his screen and so he could be. I have no idea, dude. Yep. I hope he is. Did you just summon an or Oh, there's there's a bubble coming this way. Oh, wow. That Oh, [ __ ] Yeah. Oh, [ __ ] This platform is down there when you activate it. Came all the way. Oh, it's coming back. It's coming back. It's Oh, [ __ ] Yeah. No, I'm I'm surrendering to the bubble. I I'll get you. Okay, you're good. So that press on that again. He wants to jump on that platform. There's There's platforms down there. Yeah, I'm guessing there's a second. Do you need me to revive? How do you How do you get to that? And why jump from here? Well, oh yeah, I think I think Simon might be right. Although, I'm going to check on this side",
            "start": 3367.52
        },
        {
            "text": "there's a second. Do you need me to revive? How do you How do you get to that? And why jump from here? Well, oh yeah, I think I think Simon might be right. Although, I'm going to check on this side real quick. Yeah, I was just going to say see if there's another button. Oh, there's another one. Yeah. What does that do? Is it the same platforms? No, it's there are platforms over here. I don't know if you guys saw these. Oh, okay. So, it makes it makes a higher one. It looks like there might be one more. Yeah, there's the one around here. It may. So, I only see one from my side. Wait, where's the third one? Oh, so we need we need both. There we go. Don't jump yet. Bubble's coming. Bub's coming. So, we got to time this. All right. Yeah. So, we're going over here. Blessing and I will make the journey when you guys both have buttons gone. Uh, how far does that go out? Okay, it pretty it bounces back pretty quick. Okay. Uh, shoot. I feel like we should actually wait till it goes past me",
            "start": 3426.08
        },
        {
            "text": "the journey when you guys both have buttons gone. Uh, how far does that go out? Okay, it pretty it bounces back pretty quick. Okay. Uh, shoot. I feel like we should actually wait till it goes past me again so Yeah, absolutely. Yeah, we should let Simon dictate cuz um his his buttons harder. Is mine the closest one to you guys? Yeah. Yep. Okay. So, by the time Carter goes back on just make sure you guys are on that platform and then switch over to Cart. I think if you start moving now, you'll Yep. All right. All right, I made the first jump. Okay, then as soon as Carter gets on and you guys jump over, I'm going to come off. Okay, I'm coming off. Wait, I had to. That's really funny. Is there a bubble bubble by you two? Yeah, it's the same bubble going back and forth. Oh, it's the same bubble. Gotcha. Yeah. Yeah, I think so. Oh, yeah, it is. It is. It is. We got to figure that. Okay. Okay, you guys. Okay. Okay. So, yeah, we got to stay on that second one. Oh, wait. So, you guys won the",
            "start": 3469.76
        },
        {
            "text": "Gotcha. Yeah. Yeah, I think so. Oh, yeah, it is. It is. It is. We got to figure that. Okay. Okay, you guys. Okay. Okay. So, yeah, we got to stay on that second one. Oh, wait. So, you guys won the third one. Yeah. Yeah. Okay. Cuz you do one and three. Cardi does two and four. Yeah, that's right. Okay, cool. All right. So, I guess we're on the we're on the first one. Okay, we're on one and Cardi will tell us when to go. Yeah, I think. Yeah, I think. Yeah, we'll have to wait on each one. On two. All right. Can we go? Okay. Stay on two. Stay on two. Stay on two. Yeah, I'll come back on as soon as this bounces back. Cool. And then we'll wait for four. Yeah, that makes sense. I have no idea how we're going to get the rest of you across, but it'll be I bet there's a button down here. I bet we have to do the same exact thing. There's like one single button over there. I can see a Okay, I'm back on. All right, jump to three. All right, we're on three. Don't go to four yet. Yeah. Okay, cool.",
            "start": 3523.04
        },
        {
            "text": "have to do the same exact thing. There's like one single button over there. I can see a Okay, I'm back on. All right, jump to three. All right, we're on three. Don't go to four yet. Yeah. Okay, cool. And then you swing from there from the last one. Oh, yeah. Yeah, we'll swing from the last one for the bubble. Okay, that makes sense. Yeah. Yep. Cool. Uh yeah, we're just waiting for four. All right. All right. Jumping four. That's good. And rolling off. Ooh. Okay. Wait. Swing. Where'd it go? Oh, I think the swing is also a real a button. Oh, it is. It totally is. All right. I'll get you. I'm down. All right. Oh, yeah. We're dead on the platform, though. So, if he can summon back that swingy screen, give me a second. have enough time. Yeah. Go ahead. Go, go, go, go, go. We did it. Oh, that was close. Okay. Well, that's very generous that it respawn us. Yeah. I don't even know. I bet that's not on purpose. So, what do we do? Card. There's like a person over here that I don't know if we're",
            "start": 3564.08
        },
        {
            "text": "close. Okay. Well, that's very generous that it respawn us. Yeah. I don't even know. I bet that's not on purpose. So, what do we do? Card. There's like a person over here that I don't know if we're supposed to talk to or kill. Oh, we're killing. We're killing them. Talk to the They crossing. They look peaceful. They look so peaceful. All right. I'm on one button. They were like doing their thing. Do that again. Uh, all right. So, I'm on one button. Blessing. Is there another one? There probably is around here. Yeah. I need a better vantage point. I got to kill this person. Oh, [ __ ] There's There's a bubble. There's another bubble. Oh, I I see one. I see one. There's a platform right in front of me, but I think it's a little too far. Might be another button. There is definitely another button. Okay. Well, there's no bubble on this button, so I can just hang out. It seems like I think there there's a bubble on my button. Oh, there's a dude right next to you. Uh, okay. There's dudes",
            "start": 3619.68
        },
        {
            "text": "button. Okay. Well, there's no bubble on this button, so I can just hang out. It seems like I think there there's a bubble on my button. Oh, there's a dude right next to you. Uh, okay. There's dudes with flashbangs. I can't even see. Oh crap. I didn't see the bubble. Oh god. Oh [ __ ] There's a bushing. Flashing bushing. No, no, no, no, no, no. I got to go. Got to go. So Mike, we have to jump from over here. Oh, from there. Okay. Yeah, I just saw your name like fall down the clip for some reason. I thought you died for some reason. This must be This must be why they call it BS. Yeah, that that lines up. Oh, actually we should. All right, I'm about to get on my I'm about to get on my button. Okay. Okay. The bubble which I can view. All right, which can you just step off yours a second so I can see which one? Wait, so whose button are you? Who's on this button? Nobody. My bubble. My button. God damn it. My button is making a uh a swinging thing up here. And I'm trying to figure out",
            "start": 3669.52
        },
        {
            "text": "so I can see which one? Wait, so whose button are you? Who's on this button? Nobody. My bubble. My button. God damn it. My button is making a uh a swinging thing up here. And I'm trying to figure out There's another button. Whatever it is, I got to go. I got to go. I got to go. I got to go. I got to go. Almost there. All right. Can you guys get across to me now? Simon and Mike? No. I see you. There's a button here. There's another button here. It's made of It's made of pl Oh, wait. That's where I was. There's also a platform here on the left. All right. So, blessing, I think. Oh, man. I don't even know. Yeah. Oh, yeah. I guess we got to go this way. Yeah, cuz there's another Are we supposed to come to where they are, or are they supposed to come? I assume I'm supposed to get up there. I think we might be working in like in twos for a while, it seems like. Well, is that bubble coming toward us? Cuz their their platform just got me over here. Interesting. Do I even need to be in? All",
            "start": 3729.04
        },
        {
            "text": "think we might be working in like in twos for a while, it seems like. Well, is that bubble coming toward us? Cuz their their platform just got me over here. Interesting. Do I even need to be in? All right, I'm just going to come up there then cuz I don't think my button's doing anything right now anyway. Can you get to where they are? No. Oh, okay. I'm too I'm too low. Yeah, I'm actually not sure how we we get off this area. Well, so if I hit this button, that's when the grapple thing appears. So you can swing back across the button where I've marked you. Oh, right there. Can we That's a bit far. Oh, actually on this one if you go up here. Oh, wait. What? Blessing up there. What is Oh, okay. Yeah. Yeah. Yeah. The platform the button Simon's on I think is making this platform in between me and Blessing. Okay. So, do I come to blessing or does blessing come to me? I assume Hold on. If you turn around, Andrew, there's also the one that Simon marked over here. So, one of us has to go down",
            "start": 3775.2
        },
        {
            "text": "and Blessing. Okay. So, do I come to blessing or does blessing come to me? I assume Hold on. If you turn around, Andrew, there's also the one that Simon marked over here. So, one of us has to go down here, which you can probably do do this one down here since you're already down here. And I got to go up there and do something. Okay. Okay. So, Simon, uh, when the bubble's gone, I'll jump back across once again. It's the end. Come a long way since those eggs. Where do I go? I don't know where to go. Jump up there. Oh, yeah. Yeah, there you go. And then go across and you There should be a platform right there. I don't know what's over here. Why? Cool. I like this. That means really cool blessing. Yeah. Wait, so where do I go from here? There's There's a Yeah, there's a little Oh, wait. Should I just drop down? Oh, yeah. I see. I see. There you go. Okay. Now, where do I go? See what this does. Oh, there we go. Yeah, there's a Oh, [ __ ] There's an orb. Oh, [ __ ] No. Oh, come down. Oh,",
            "start": 3819.2
        },
        {
            "text": "I just drop down? Oh, yeah. I see. I see. There you go. Okay. Now, where do I go? See what this does. Oh, there we go. Yeah, there's a Oh, [ __ ] There's an orb. Oh, [ __ ] No. Oh, come down. Oh, and there's [ __ ] enemies. Actually, this might be a good thing. Yeah, that was probably not a good idea to go on the first try, huh? Uh, I might keep you alive in case this orb gets me again. Sure. Let me know when you can get back on that. I am back on it. There we go. Cool. Oh, I lied. Wait, no, I'm on it. [ __ ] I got to roll though, so keep going. There we go. Where do we go? Where do we go? Cool. Oh, this dude. Okay. How do I get up to where you guys go? Uh, actually, there's a bubble. Give me Give us a sec real quick. Where does this bubble go? Uh where the button is if you go. Yeah, if you if you're at where I am. All right, let me see if I can get this real quick and see if it does anything for gold part. Oh, there you go. Can you jump across? Uh yes, I can. All right, let me swing",
            "start": 3875.12
        },
        {
            "text": "if you're at where I am. All right, let me see if I can get this real quick and see if it does anything for gold part. Oh, there you go. Can you jump across? Uh yes, I can. All right, let me swing across. Might have to be quick. I'm going. I'm going. All right, I'm across. Uh bubbles coming back. Simon, I can revive you. Simon. Yeah, I I got him. Okay, cool. Uh all right, I'm going to climb up here. See where I'm going? Do you think Do you think there's a button where Ang's about to go? cuz I do. I assume there must be I hope so. The button that's going to take us across. I like I I really like this. This is cool. Staircase over here. Is there I'm on a big button. Oh, yeah. There's a swingy swing. What's this doing? It goes back and forth between those two buttons. Okay. Is this enough to take us all the way across? Yes, looks like it. Oh. Oh, almost overshot that. And then we'll get button that'll probably get Andrew. Uh yeah, Andrew over here. Yeah. All right. Stay there. And that",
            "start": 3928.8
        },
        {
            "text": "take us all the way across? Yes, looks like it. Oh. Oh, almost overshot that. And then we'll get button that'll probably get Andrew. Uh yeah, Andrew over here. Yeah. All right. Stay there. And that looks like I can swing press. Is there a bubble? No. This is incredible. Incredible teamwork. This is rad. I want I want a Mario game that is just this. Dude, it just it says continue onward and I thought it said continue coward. Was like fair. I think I get it. Oh, what's that button for? Uh, okay. That made a platinum here. Yeah. So now we can jump. I think the three of us can jump up. Okay, see you later. Bye, Simon. Bye, Simon. Pleasure playing with you. Uh, and I assume there's another button for Simon. Yeah, maybe. Oh, right here. Maybe never. Oh, yeah. All right. All right. There's enemies. There's enemies through the gate. So, let's wait till we're all back together. Reunited, guys. It's so nice to be all four of us again. So, yeah, we're definitely not doing all three chapters",
            "start": 3973.84
        },
        {
            "text": "There's enemies through the gate. So, let's wait till we're all back together. Reunited, guys. It's so nice to be all four of us again. So, yeah, we're definitely not doing all three chapters tonight is what I'm gathering from this. Nah, let's get through chapter one and see what time that is. But, uh, I I have no idea if there's like a lot left. I have no idea. I assume there is. I feel like three makes good sense. Like three of like the main challenges for a chapter. [ __ ] This is like a lot of content for like a pre-download, pre add-on. It's like hitting me health. Uh oh, there's a tunement sound. Oh god. What is this? Oh, it's this. I'm going to power emanating from the gate before. Is there more than There's probably There has to be more than two colors, right? Oh, we need we need a Yeah, there is. Yeah, this is the ones you break. Yeah. Oh, yeah. I think we need two orange, two blue. So, I'm going to grab this orange. Whoa. I'm going to be blue. I'm going to die to an archer",
            "start": 4030.64
        },
        {
            "text": "a Yeah, there is. Yeah, this is the ones you break. Yeah. Oh, yeah. I think we need two orange, two blue. So, I'm going to grab this orange. Whoa. I'm going to be blue. I'm going to die to an archer and then uh Can you tag the other Where's the blue one? There's a green one right by this dude. Oh, there's a green one. Yeah, there's a green one. Can somebody get me over there? Uh, yeah. I think I need a blue. I can I can Yeah, we can't wait. The orange is that sun. No, it's sun. Yeah, that'll Oh, you're right. Yeah. So, if you jump over it, you'll it'll solidify, I think. Yeah. There it is. There we go. All right. Yeah, there's another blue up here. It looks like uh green. All right. So, we got to This is green. So, yeah. And then sun again. Uh wait. Yeah. There we go. And it's time, too, so we got to be a little quick. Okay. And then there's another sun. Yeah, another sun. Sure. Yep. I don't Wait, so is the logo diff is the logo changing for you guys? Uh cuz like right now Yeah. Like",
            "start": 4080.4
        },
        {
            "text": "so we got to be a little quick. Okay. And then there's another sun. Yeah, another sun. Sure. Yep. I don't Wait, so is the logo diff is the logo changing for you guys? Uh cuz like right now Yeah. Like right now I'm looking at the platform and it is like it it looks weird. It looks like it looks like it's in three pieces as opposed to just the regular sun. Oh thing. Oh, I think mine is I think my game might be broken. Like the icons on mine are broken cuz all of them are the same on mine. Oh, I care. Like I can't tell what the next icon is here. Mike. Mike. Just call him out. Just call him out as you see him. Sun's right here first. All right. Let me That's me. Uh, everyone stand out. You only see the icon of your attunement. Never mind. Okay, then. Uh, electric. Well, or blessing. That's you. Okay, never mind. Yeah, mine is broken cuz I don't see that. Okay. And then, oh, actually, I should get on the platform. All right, go for it. You're next. Start again. I was too busy watching. Go",
            "start": 4138.48
        },
        {
            "text": "Okay, never mind. Yeah, mine is broken cuz I don't see that. Okay. And then, oh, actually, I should get on the platform. All right, go for it. You're next. Start again. I was too busy watching. Go ahead. Yeah. Next platform is a gold farm. There you go. And just jump right off. Okay. Mike, I like to keep you awake. I want to make sure you're doing okay. Break. Okay. So, yeah, you can break this one. Uh, blessing on the side. This artifact, whatever it is. Wait, chat. Did you break the Sorry. Go for it. Uh, first of all, there's a crystal here to pick up. Crystal? Yeah. Oh [ __ ] Second of all, did we break was there another thing to break earlier? And did we break it? Uh, a very good question. Yeah, the artifacts are back down there. Okay, so we got we got another we've got a blue here and then we got Oh, man. I hate that the bombs is confusing where I'm pointing at. Stay up there. And then blue and sun. Blue again. What do I do with this? What What do you think I do with this",
            "start": 4193.84
        },
        {
            "text": "here and then we got Oh, man. I hate that the bombs is confusing where I'm pointing at. Stay up there. And then blue and sun. Blue again. What do I do with this? What What do you think I do with this crystal? Uh, maybe we can bring it down. Yeah. I don't think there's anything up here that we can put it on. Yeah. Uh what is that actually? Does that look like it? Maybe. You see that? Does that look like a place where you got to put that crystal? Oh, I think that's our that's the atunement, right? Like that's the atunement. Yeah, that's where you get sun. Oh, gotcha. Okay. I think once we break it might open up for the So, where's where's the sun at? I have sun. Okay, cool. So, yeah, think we pretty much have everything we need. Uh, can I drop down holding this crystal? Let's find out. If not, I I'll revive you. Yeah. If I mean, if not, I can grab it from here. Okay, cool. Doing great. It's going good. Summer. It's not the summer. Uh, all right. Jumping down. Yeah, chat. I might be a",
            "start": 4248.64
        },
        {
            "text": "not, I I'll revive you. Yeah. If I mean, if not, I can grab it from here. Okay, cool. Doing great. It's going good. Summer. It's not the summer. Uh, all right. Jumping down. Yeah, chat. I might be a crazy person with these icons then because I don't know. I guess what Chad is telling me is that the first person who grabs you at sees the icons, but it seemed like everybody else sees the icons but me. So, I don't know. So, who knows? Oh, actually, right here. It goes here. The crystal. Oh, wait. Did someone steal the crystal from me? Dude, that was my crystal. What the hell, son? You've got You've got an achievement to do. All right. What does that do? Oh, there's platforms, sir. Oh, this open. The gates's open. Sweet. Continue onward. So, is this like an extra? Yeah. What's around here? Side area. Oh, is there another chest? Yeah, the crystal open up this area. Yeah, there are a lot of chest. Yeah. All right. Who's going to fall off? Gills is curse. Oh, it's an oni treasure. All right,",
            "start": 4298.0
        },
        {
            "text": "area. Oh, is there another chest? Yeah, the crystal open up this area. Yeah, there are a lot of chest. Yeah. All right. Who's going to fall off? Gills is curse. Oh, it's an oni treasure. All right, we got this. Oh, I'm scared. There's definitely a lot more space to fight here compared to the first one. What could possibly go wrong? Everyone equipped on their bombs and stuff. Uh, I have enough. Here, let me let me drop a heal real quick. I was going to say you guys should get back to full health. Okay, cool. I'm going to jump. So, is it like a one person treasure or is it still I think I think everyone Yeah. Oh. Oh. Oh, god. You're right here next to me. All right. This guy's nearly down. Are any of them tethered again? That was I think so. Yes. Yes. Yeah. Okay. Oh, yeah, they are. They're all coming on the right. Oh, the amount of action on screen right now. All right. This guy right here is about to power up or whatever they do when they don't die. Yeah, get the get the other guy.",
            "start": 4352.88
        },
        {
            "text": "all coming on the right. Oh, the amount of action on screen right now. All right. This guy right here is about to power up or whatever they do when they don't die. Yeah, get the get the other guy. The other guy revived. Oh, gotcha. Oh, they're going to explode. Oops. Oh, yeah. This game. Nice. We got it. We did it. Incredible. Okay, that was way easier than I expected. Oh, wait, wait, wait. Uh, okay. Never mind. That was interruption. Before we move on, what's up, Simon? Wait, wait. What's Simon asking? It just didn't say complete for me. Yeah, it did. Oh, there's there's like a on treasure collected thing that popped up. It was at the bottom. It wasn't at the top left. It was at the bottom of the screen. Now, before we move on, can I go to the bathroom real quick? I got to blow my nose. All right. What a professional streamer. Yeah, I don't want to blow my nose in front of the camera for these guys to the microphone. I was about to say you don't have to go all the way to the bathroom",
            "start": 4407.44
        },
        {
            "text": "right. What a professional streamer. Yeah, I don't want to blow my nose in front of the camera for these guys to the microphone. I was about to say you don't have to go all the way to the bathroom for that. Do a quick fight. Well, I'm just I'm going to go to the bathroom, too. It's It's bathroom time, man. All right. Wait, I'll be right back. How's it going? How's How's everyone? I'm not watching the stream. Not Not reading. Oh, yeah. That's fair. Nice to be here. It's now 12. How's the Swiss roll? Yeah. Swiss roll. Do you know that's keeping me going without that? That's how we got that puzzle earlier. Oh yeah. Yeah, I think really we did clear the lesson. So far it's not that bad, honestly. No, it's not too I think just having four people helps a lot. Yeah, at least compared to Nightmare. Oh, hey. Oh, Andrew, thanks so much for making this raid, man. I appreciate it. He's gone. Oh, he went to the be the perfect joke. Yeah, I was just telling Cardi that uh this is a lot easier than",
            "start": 4456.8
        },
        {
            "text": "Oh, hey. Oh, Andrew, thanks so much for making this raid, man. I appreciate it. He's gone. Oh, he went to the be the perfect joke. Yeah, I was just telling Cardi that uh this is a lot easier than Nightmare for sure. Is it really? Uh yeah, I've not tried nightmare. Survival is crazy. Story is not bad. I think this is really close to the story nightmare version. Okay, that lines up. I feel like story nightmare I could probably do because I feel like I have the story missions down. survival where I can get it's all about the modifications. Like Simon and I have done pretty well in uh Story Nightmare, but um you know, it just depends on the mods. Like it's also like you can be really smart about um you know, if you equip the there's a legendary charm that makes you immune to poison and like last week's modifier was uh uh poison clouds. So, it's like, you know, there are things you can do that make them a little easier. Yeah. I'd say the the first part of this raid is very similar to",
            "start": 4530.88
        },
        {
            "text": "last week's modifier was uh uh poison clouds. So, it's like, you know, there are things you can do that make them a little easier. Yeah. I'd say the the first part of this raid is very similar to nightmare survival. There's just a lot of people that you got to take care of. Plus arrows run down on you. Who knows what's still to come into this. That's true. Let's just see. I want to get confident. Buy enough more than I can. I'm ready. Cool. Wait, wait, wait. I got I got a photo I want to take. I got a cool angle. I love it. I can't wait to see it. Actually, yeah, I can take one, too. Hold on. I got to [ __ ] with the the the focal length. I got a good angle, too, guys. Could we have like a photo contest at the end? That'd be great. That'd be like a great idea to have like a at the end of a raid, everybody has to show their photos. Turn it turn in your homework. Yeah, I like it. Be more anxious in the raid. Uh that contrast setting, man. Killer. Wow. Love it. You love to see it. These",
            "start": 4585.44
        },
        {
            "text": "a raid, everybody has to show their photos. Turn it turn in your homework. Yeah, I like it. Be more anxious in the raid. Uh that contrast setting, man. Killer. Wow. Love it. You love to see it. These stamps. These stamps though. Oh, that's the one. That's the one. I'm liking mine, too. Wait, hold on. Let me just adjust at the field. Do you think anyone else rating has been? It'd be disappointing if they didn't. Chat, this would be like a great like I'll be back stream, right? Or no, not I'll be backstream. I'll be away screen is what I meant to say. Like I'll be back. This this be like a great standby screen. Just this right here. In fact, hold on, hold on, hold on. While we're here, I'm just going to record a little video. Just let that let that loop for a second. You need a 1 hour loop. So, let's all just take a break. All right. And then I can loop that what I just took. Turn that into a great away screen. All right. I'm Yeah. All right. Let's do it. Cool. Sounds good. Simon, you",
            "start": 4635.84
        },
        {
            "text": "So, let's all just take a break. All right. And then I can loop that what I just took. Turn that into a great away screen. All right. I'm Yeah. All right. Let's do it. Cool. Sounds good. Simon, you All right. Uh back up the platforms. I'm way more scared about going up than I was going down. Yeah. Me, too, actually. Okay. Are we stupid? Is there a faster way up? No, probably not. It'd be hilarious if there was a ladder. Yeah. With a sign. That's the village. That's the village. Is that where we were earlier? Oh, yeah. Village of the disciples. Oh, that's I think. Oh, you got it right. Yeah. Thank you. I was very nervous. I like that we're getting the chest and stuff. I'm feeling good about this. Going to get some good gear. I feel like the next one we're going to walk into is going to be the army of Oni or something along those lines. Yeah, I I feel like we've been easy. Oh god, there's ghost. Oh no. Even worse. Even worse. Oh god. Just Just clear. Keep moving. Ke moving. Keep moving.",
            "start": 4707.52
        },
        {
            "text": "army of Oni or something along those lines. Yeah, I I feel like we've been easy. Oh god, there's ghost. Oh no. Even worse. Even worse. Oh god. Just Just clear. Keep moving. Ke moving. Keep moving. This is really easy. Like come on. Nothing can be worse than harvesting the power. Oh, if we if we're about to do a spirit one, I'm just going to turn off my console. The crimson ridge. Love it. Statues over there. Okay. Oh. Oh, this music, dude. All right. Eio's hunting for us. [ __ ] yeah, we're fighting. Attempt ascension. Ascension. Wait a minute. The hell is that? I've attempted as Oh no. Any Oh, there's a lot of them actually. Ascension challenges complete. Oh my god. All right. I feel like [ __ ] just got real. Oh, now they're coming. Oh, there's a lot of people now. What did we do, Simon? So, you got a challenge. Yeah, I basically basically the curse you guys. Two Ronins coming in clutch as I die immediately. Oh my god. Um, all right. Andrew, why' you add this? Oh, there's that ghost",
            "start": 4766.8
        },
        {
            "text": "So, you got a challenge. Yeah, I basically basically the curse you guys. Two Ronins coming in clutch as I die immediately. Oh my god. Um, all right. Andrew, why' you add this? Oh, there's that ghost came from nowhere. All me. Why'd you add this? Oh, hey, there no bubbles. Let's be positive. There are bubbles. There there's bubbles everywhere. What you Oh my Yeah, they're definitely bubbles. Oh, is that this way? Oh. Oh my god. Whoa. Whoa. Ironically, the bubble got me saying that. Just keep coming. What the hell? All right, I got you. I got you. Thank you. Thank you. Thank you. I'm throwing healing down for too. Thank you. I wonder if these ghosts just keep spawning. Maybe we should They probably do. Oh, yeah. They just keep spawning. Probably got to focus on a thing. Uh, so concussion attempts. Oh, attempt. I see it. That's something we should just try to do real quick. Yeah. Kills required. Eight. No range, but quickfire weapons. Okay. You have to get eight kills. Is it just you",
            "start": 4827.04
        },
        {
            "text": "attempts. Oh, attempt. I see it. That's something we should just try to do real quick. Yeah. Kills required. Eight. No range, but quickfire weapons. Okay. You have to get eight kills. Is it just you though? Cuz I don't see that on my screen. Yeah, I assume it's just whoever does it. Oh, only one of us can do it at a time. All right. Do we each do an ascension challenge? Cuz that's cool. Yeah. Okay. Uh are there guys? Uh do we kill them? They might just be invisible. All right. So, I have to kill guys with none of my tools. I'm not the right person to have taken this, but we'll see how this goes. I can't use my ghost tools or my bombs, so it's just assassinations and sword play. And I I only have two stances, so we'll see how this goes. Oh, it's coming back. Bubble coming back. Oh, there's dude's over there. Okay, cool. All right, Mike. Mike, keep me alive. I'm just going to try and kill eight dudes. One down. Wait, Andrew, I'm cheering you on from the other side of the bridge. Oh, you",
            "start": 4890.12
        },
        {
            "text": "dude's over there. Okay, cool. All right, Mike. Mike, keep me alive. I'm just going to try and kill eight dudes. One down. Wait, Andrew, I'm cheering you on from the other side of the bridge. Oh, you fell. Oh, man. All right. All right. Okay. I'm I'm going for the normal guys and not the big guys cuz I'm a coward. I'm going to jump a top. All right. Good job, Andrew. You're killing him. Thanks, man. I love I love having a hype, man. Uh, all right. 60. How much more do you need? I need six. Six. Okay. Uh, maybe on the other side. Maybe there's more ghosts here. Eio's searching for you. Oh, okay. Oh, there's dude's here. I think they're ghost. I don't see him, but they see me. Yeah, they see me, too. Uh oh, this guy's back there again. What the hell? All right. I'm way back in the corner again. Are you You said you're attempting ascension. All right. Yeah. One of the other ones. Uh Mike, can you Andrew, did you complete yours? No, I have six to go. Oh, gotcha. Okay. If you guys want to",
            "start": 4938.72
        },
        {
            "text": "Are you You said you're attempting ascension. All right. Yeah. One of the other ones. Uh Mike, can you Andrew, did you complete yours? No, I have six to go. Oh, gotcha. Okay. If you guys want to do Let me just tell him again. That would be fine by me. Yeah, I'll throw some fig. I failed the ascension when I died. If you're dead, I was wondering cuz like I Yeah, I think so. All right. Simon is going to be way better than I was. He's a He's a strong boy. He had a Swiss roll. I I respect it. Oh, shoot. Let me take out this ghost. I can't use abilities. Can we use abilities around here? Yeah. Uh yeah. So, let's bomb everyone around. Uh I got There we go. It's not a lot, but Oh, I drop I can drop the heal. I can drop my gourd. Simon, you run you run so much. It's hard to heal you. You're like a little rabbit dodging. Oh jeez. God, these ghosts just come out of nowhere. Oh my god. I'm down. I got you. Can I not use my fire system? Oh jeez. Oh man, this guy got a combo on me. Okay. All",
            "start": 4998.16
        },
        {
            "text": "like a little rabbit dodging. Oh jeez. God, these ghosts just come out of nowhere. Oh my god. I'm down. I got you. Can I not use my fire system? Oh jeez. Oh man, this guy got a combo on me. Okay. All right, you're good. Uh Mike, I'm throwing down healing. I just healing. Roll to me. Roll to me. Oh, you used your thing. That works. Yeah. Sorry. I freaked out. No, you're good. You're good. Okay. Uh, did you do it? I need two. You got this, dude. The guy down here is nothing. You killed two enemies. Perfect. Over here. This guy. You take this guy so much. Never mind. He pissed me off. All right. I couldn't let him live. It's all right. There's a bunch of dudes over here. See if I can weaken them. Oh no, I just killed them. Let's see if I can weaken them everybody. Simon, you're Hey, we've got to do all four. So, we've got to do Yeah. All right. Okay. Gotcha. You have to do one each though. What can I really hope it's one each? Cuz that sounds cool. Yeah, it is one each. I've already Oh,",
            "start": 5059.04
        },
        {
            "text": "to do all four. So, we've got to do Yeah. All right. Okay. Gotcha. You have to do one each though. What can I really hope it's one each? Cuz that sounds cool. Yeah, it is one each. I've already Oh, that's [ __ ] awesome. I've got All right. So, same thing. Just eight kills. They're all the same. Maybe there's more guys over here or on that side. Oh, and more guys on our side, too. Weaken everyone. Let's weaken them and then Okay, sounds good. Don't kill anyone. Just I'm going for body shots. I've already got four. I still got a guy here for you. Really? You still can't for the rest of this bit now. I can't eat. Okay. Uh, well then I'll go three more kills over here. There's a couple weak guys. All right, I'm coming. Yo, I was cool as [ __ ] What just happened? All right, I need two more. All right, let me just venture out to the Oh, right here. Never mind. Wait, what happened? Yeah, there's a couple of them right here. Yeah, I'm going to drop a hill right here. Why thank you. No",
            "start": 5116.72
        },
        {
            "text": "All right, let me just venture out to the Oh, right here. Never mind. Wait, what happened? Yeah, there's a couple of them right here. Yeah, I'm going to drop a hill right here. Why thank you. No problem, man. All right, one more. Okay. All right. Unless the fire Oh, the fire killed him cuz I got up here. You got it. Okay. Yeah, Simon's right. We keep our burden after we ascend. So, I found Yeah, go for it. Cuz that way I can heal you guys still. So, blessing, you have to find Yeah, you have to. Yeah, s marked it. Wait, where' you mark it? Oh, I see. Oh, the back right. Damn. What's that? Take that archer out. This archer is shooting right into a rock. Oh, [ __ ] Eas close. Yeah. At least we know what to do. Oh [ __ ] there's an or Yep. At least for the reset, we can have Blessing and Simon do both at the same time. And then let's switch off the healers. Yeah, I think that's smart. Wait, can we do them at the same time? Uh I assume so at the same time blessing is it just eight kills",
            "start": 5173.12
        },
        {
            "text": "do both at the same time. And then let's switch off the healers. Yeah, I think that's smart. Wait, can we do them at the same time? Uh I assume so at the same time blessing is it just eight kills again? Uh yeah, eight kills. No no melee attacks. Oh god. Oh god. Oh god. No melee. It's probably based on class. Oh interesting. I think that's just four different blessing. Blessing is the best one to get. No melee though cuz he has all the Yeah, I'm a hunter. Yeah, I threw healing. Dude, it is rough not being able to use my gourd. Oh, I forgot their bodies explode. Oh god, don't kill this guy. All right, I got him. Uh, how many arrows do I got? Enough. There's a archer over the way out here. That was badass. How many arrows do I have? Enough. Oh, don't move, you bastard. It's the fact that they keep hopping up and down. Oh, don't touch that guy. Yeah, I'm not doing anything. I'm just I'm literally just running in circles. I saw it was an EP. It was an NPC running towards another NPC. The",
            "start": 5239.52
        },
        {
            "text": "keep hopping up and down. Oh, don't touch that guy. Yeah, I'm not doing anything. I'm just I'm literally just running in circles. I saw it was an EP. It was an NPC running towards another NPC. The one that's marked on absolutely nothing. Yeah, I'll weaken this dude. How many do you have left? There you go. That guy. I should tell you I'll mark low health on I don't see anything. Oh, I lost it. How did I lose it? You lost it. You get down. You would not get the Wait, I don't know. Oh, maybe it's cuz I hit somebody. Oh, wait. No, I think Oh, I see. Cuz I did I did use melee. Yeah. Oh, that's dumb. All right. All right. We got this now. We know what to do now. As long as it gives me the same challenge, man. You was really taking a sweet time to look at us, you know. Oh, there. All right. Cool. Damn. And I was cleaning up kills, too. I was cleaning up range kills. I want you guys to know. Each statue does have its own. I picked up. Gotcha. Different statue. So, should we keep to the Yeah,",
            "start": 5296.56
        },
        {
            "text": "Damn. And I was cleaning up kills, too. I was cleaning up range kills. I want you guys to know. Each statue does have its own. I picked up. Gotcha. Different statue. So, should we keep to the Yeah, I want that same statue. Yeah, let's get the same ones and hope they're the same because um Yeah, I I think the strategy of helping each other weaken them is smart. It just gets hard like uh here. I'll go first. Mine's right here. Can't just can't be bloodthirsty. Okay. Actually, wait. Uh go for it. Let's wait for Let's let the others go first and we can heal them. Okay, cool. That's right. Yeah, cuz we lose our abilities, don't we? Uh depending on the challenge. Yeah, that's true. Okay, so Simon and Blessing, are you guys just going to go first? Yeah. Yeah. Should I try to get mine at the same time? Yeah, if it lets you, we should definitely save time. Yeah. Here, I'm going to run to you guys so I can Yeah, that's a good call, Mike. Yeah, just cuz uh if any of us goes down, we don't want",
            "start": 5349.28
        },
        {
            "text": "time? Yeah, if it lets you, we should definitely save time. Yeah. Here, I'm going to run to you guys so I can Yeah, that's a good call, Mike. Yeah, just cuz uh if any of us goes down, we don't want to be limited. Yeah. No, very good. Uh Simon, are you going for the same one? Yeah, we already got it. I'm just going to focus on weakening these ghosts, man. [ __ ] I mean, ghost was taken out of the down already. I'm Yeah, I'm down. All right. Sorry. I want to use the spirit enemies. They come out of nowhere and just shake me. Oh yeah. You know, I hate those guys, too. And it's like for some reason they got big old biceps. The way they're swinging their swords. Got you. Okay, let me heal you real quick. He immediately got me down. Yeah, the same happened to me. Yeah, there's there's two guys on the stairs. Yeah. Yeah. All right. Give me a sec. On the way. On the way. Do you have your me too? I have to get my resolve up real quick. All right. Give me a sec. I got throw some bombs to do",
            "start": 5392.96
        },
        {
            "text": "on the stairs. Yeah. Yeah. All right. Give me a sec. On the way. On the way. Do you have your me too? I have to get my resolve up real quick. All right. Give me a sec. I got throw some bombs to do that. You got 27 seconds. I got you guys. It's all on you. Yay. Dude, that's a that's a feat. I think I think you get like uh something cool for doing that. For getting the whole team. Oh, for getting all the Oh, for all three. I think so. I could be wrong. Oh, shoot. No, I think you're right. I just forgot what it was. All blessing. I'm just going to bomb the [ __ ] out of this dude so it gets away from you. Sorry that I killed him. All right, that guy's almost dead. Feel free to take him out. Oh my god. I didn't realize there's another one. Oh my god. It's the spirit enemies. [ __ ] Oh, on the way. Give me a sec. Maybe I can just revive, you know. Oh no, there's dudes up here. Whoa. What the [ __ ] Yeah. Yeah, the spirit guys up here are There's a lot of them. Aggressive. Yeah, I'm I'm",
            "start": 5441.44
        },
        {
            "text": "the way. Give me a sec. Maybe I can just revive, you know. Oh no, there's dudes up here. Whoa. What the [ __ ] Yeah. Yeah, the spirit guys up here are There's a lot of them. Aggressive. Yeah, I'm I'm going to drop a heal up here. Nice. All right. Yeah, I'm hopping out of here. All right. So, if I can Oh, wait. Actually, no, I can't. I need two more. One more. Meanwhile, Simon's just like killing it. We're all dying on the stairwell. Let me weaken this guy real quick. Uh, I'm going to go for mine then. Woo. Okay, sounds good. Oh god. Uh, am I I went the wrong way. There we go. Oh god. Bubble. Which way are we going? Across this way. I'm I'm waiting for the bubble to go back up the bridge. Oh, okay. Actually, yeah. Let's go the way we know. Yeah. Yeah. I don't trust that hallway for a second. Oh [ __ ] Bubble. Oh, I'm getting my statue. Wait, don't kill that guy. What's up? Don't kill that guy. Oh, yeah. No, cuz we we him. Okay. Oh [ __ ] I'm out of arrows. Uh, where's the closest ammo?",
            "start": 5484.0
        },
        {
            "text": "Oh [ __ ] Bubble. Oh, I'm getting my statue. Wait, don't kill that guy. What's up? Don't kill that guy. Oh, yeah. No, cuz we we him. Okay. Oh [ __ ] I'm out of arrows. Uh, where's the closest ammo? Supply. Uh. Oh god, there's one right there. All right, seven to go. I see. Oh, I'm down. I failed. I'll go back and get it. Oh god. Ah, I got one kill left. Oh, this dangerous. All right, I'm just going to I'm just going to revive you through uh ultimate. All right, I'm going to get I got I got mine. Nice. All right, two down. Two to go. Yeah, and I can't use melee attacks. as well, guys. All right. Uh, trying to get mine. Oh my god, dude. I am real fragile, these spirit guys. All right, got three. Okay, cool. If you want to just weaken as many enemies as possible over here. I Yeah, there's a few over here that you can probably take out. All right, try to weaken them a little bit more. Oh, I told you. Rift. Oh, god. Can I even block? All right, one. Oh, I can't block. Holy [ __ ] Faster we",
            "start": 5537.68
        },
        {
            "text": "over here that you can probably take out. All right, try to weaken them a little bit more. Oh, I told you. Rift. Oh, god. Can I even block? All right, one. Oh, I can't block. Holy [ __ ] Faster we do, the faster we can block. We got this, guys. That's some There's a few guys right here. I need to stay away from the brutes. Brutes are one shoting me. Big boy. All right, there you go. Back. Uh, I have to go get the thing again. Oh, really? Oh, when you go down every time. When you go down, you fail. Yeah. Oh, okay. Gotcha. Okay. All right. Come back. Yeah, we're not going to get this thing, I think. Oh god. Bubble. Seven to go. This guy's really low. Go for Let me heal you. All of these around here are really low. There we go. Yeah, there's a lot of weak guys around here, so I think I get this fast. Got this archer here. I'm just avoiding this brute. God damn it. I think I'm going to go. I'm going to wake him up a little more. Oh, I go, dude. I'm like Floyd Mayweather out here. just",
            "start": 5613.04
        },
        {
            "text": "this fast. Got this archer here. I'm just avoiding this brute. God damn it. I think I'm going to go. I'm going to wake him up a little more. Oh, I go, dude. I'm like Floyd Mayweather out here. just like not able to block. Just doing side steps all over the place. There's a few few right here. I need four behind you. Oh, did you mark? Yeah, there's some right there. They're pretty weak. All right, three to go. I should just stick with you and heal you. Yeah, that actually I'm about to mark about weaken these guys over here. All right, don't kill him. Don't kill him. All right, there's one right next one right there over here. All right, I got it. All right, cool. I'm going to head. Was that back left? Is that where you need to go? Yeah. All you guys go down. I have a rev. I don't have a heal, but I have a revive. So, if you guys go down, I can help you. You don't use that how that works. I can still use the ult and the down like skill ability, but I don't have any of my quickfire. I",
            "start": 5663.92
        },
        {
            "text": "heal, but I have a revive. So, if you guys go down, I can help you. You don't use that how that works. I can still use the ult and the down like skill ability, but I don't have any of my quickfire. I don't have range. Simon's going to get me up, though. Okay. All right. I'm going to pick this up real quick. All right. Someone should stay with Mike after we revive. Let's all right. I'm telling you. I got to No dodge. Oh my god. It is hard to get me up than I anticipated. I got you. I got you. All right. Bless. I just got to kill me. Get on Mike. I can use my my tools, which is kind of handy. Yeah, you can use bomb to spam them, dude. I can drop um my AOE heal on you. Oh, I can't dodge. I can't I forgot I can't dodge. Oh god. [ __ ] It's stressful. I'm weakening. Uh [ __ ] I killed him. Uh, I'll come get you, son. Yeah, I can't use my Oh, no. And no, dodging sucks. A spirit guy somewhere. That's weak. All right, Simon, I got you. Coming back to you, Mike. Let me know if you need",
            "start": 5718.56
        },
        {
            "text": "Uh, I'll come get you, son. Yeah, I can't use my Oh, no. And no, dodging sucks. A spirit guy somewhere. That's weak. All right, Simon, I got you. Coming back to you, Mike. Let me know if you need killing. You look pretty good, though. Watch bubble. Watch bubble. Definitely need to like be a little careful with dodging. Some kill. Oh, there's I need one more. One more. There we go. Nice. We did it. best ghost onward. All right. Uh, now what? To the center somewhere. I think that might be the end. That sounds like the ending. Weaken some. Yeah, somewhere. They don't deserve these stairs. Can you pass the purified bell for aid? Oh my god, I missed my bomb so it's up there. It's up there. I miss being able to block so much. I know, dude. Yeah, the dodge roll a huge loss. All right, following you guys though. All of out of all the things for me to lose, those are the right two cuz like I feel like I'd rather dodge than block. It totally knew our play styles like Oh, yeah. I rely on ranged",
            "start": 5766.72
        },
        {
            "text": "you guys though. All of out of all the things for me to lose, those are the right two cuz like I feel like I'd rather dodge than block. It totally knew our play styles like Oh, yeah. I rely on ranged weapons and quickfire more than anything else. So that was like such a hard thing for me to do. Cool. That's the purified bell. that you know that is a purified belt you've ever seen. I agree, dude. You love to see it. Absolutely love to see it. On pure bells. Oh. Oh, wow. It's the game. Is this it? This might be the end of the chapter, maybe. Oh, yeah. I think it is. That only took an hour and three quarts. An hour and 27 minutes. Look at that. Oh, wow. And look at all this gear. Oh, I got 110. I got my one. There we go. Oh, we missed the only treasure somewhere. Yeah, we missed an only treasure. Darn. Wow. Nice though. All right, ladies and gentlemen, that was chapter one of the Ghost of Shimmer raid, the tale of Io. Uh, will there be more? Of course there will be. Will you see it?",
            "start": 5829.76
        },
        {
            "text": "treasure. Darn. Wow. Nice though. All right, ladies and gentlemen, that was chapter one of the Ghost of Shimmer raid, the tale of Io. Uh, will there be more? Of course there will be. Will you see it? Probably not, because I'm ending the video right here. Of course, I've been blessing. Shout out to Andrew Gopar. uh Simon Cardi and Mike Man for joining me.",
            "start": 5886.32
        }
    ]
}