{
    "id": 1002,
    "video_id": "3jaLPYvptd4",
    "show_name": "Gamescast",
    "hosts": [
        "Alan Costa",
        "Colin Moriarty",
        "Kazutaka Kodaka"
    ],
    "title": "Danganronpa Kinda Funny Gamescast with Series Creator Kodaka-San",
    "description": "Colin Moriarty, the Internet's biggest Danganronpa fan, sits down with the man behind the franchise to find out what makes it so special. \n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1436457601,
    "duration": 2474,
    "transcript_chunks": [
        {
            "text": "greetings and salutations welcome to Kinda Funny we're going to do another very exciting kind of one-off interview uh you guys might remember uh a couple months ago right before Bloodstained was revealed Kazuhisa's game we had him over um one of my favorite Japanese Developers for an hour and a half conversation about Castlevania and Konami and just the future of game development and Japanese game development well I'm super super excited to do this again with another one of my favorite Japanese game developers creating one of the great Japanese uh series of all time uh this is Kazutaka who's writer and kind of visionary the concept originator of Danganronpa uh which is one of my favorite series of the last few years so thank you so much for taking the time to be here thank you thank you very much um so I kind of just want to take this free flowing because I I feel like we can learn a lot from you just by speaking with No Agenda ums good so can you tell us a little bit about",
            "start": 0.12
        },
        {
            "text": "You very much, um. So I kind of just want to take this free-flowing because I feel like we can learn a lot from you just by speaking with No Taxation, ums good. So can you tell us a little bit about yourself first and and you know obviously you work for Spike Chunsoft but what is your experience with games? What is your experience kind of working in the industry and all this all so originally I dreamed of being working in film and I wanted to deal with that, that was my dream. So actually uh the Japanese film industry is an even worse place than the Japanese game industry and um my goal my dream was to work and create something original and I could see very early on that I wasn't going to be able to do that in the Japanese film industry therefore I uh I switched over to games so you know originally obviously it was an there was a idea that maybe I could go to Sony or Capcom or Konami but the truth of the matter is in a company that big I wouldn't be able to do what I wanted to do, I wouldn't.",
            "start": 41.4
        },
        {
            "text": "obviously it was an there was an idea that maybe I could go to Sony or Capcom or Konami but the truth of the matter is in a company that big I wouldn't be able to do what I wanted to do I wouldn't have the opportunities so I decided that you know what let's go for something a little bit you know smaller maybe mid-tier well he says let's be honest you know very small like tiny soft so I I entered that company uh I made Danganronpa and um miraculously it sold and now here I am so let's get into Danganronpa then because that really was your introduction to the gaming industry this is kind of what you started out doing where did this zany idea originate from so obviously for my first game it couldn't be some big budget thing so I decided to go with a visual novel so you know as a PSP game and I was told that the the max sales I could expect from a PS P game that was visual would be maybe 50,000 that said it didn't necessarily mean that even though I had this idea that my superiors would allow me",
            "start": 131.04
        },
        {
            "text": "that the max sales I could expect from a PS game that was visual would be maybe 50,000; that said, it didn't necessarily mean that even though I had this idea that my superiors would allow me to do this and so in order to change their mind about visual novels about the potential of a visual novel, I looked to my uh inspirations like Battle Royale and things like that and I decided you know to go to him to my superiors and to approach them and to get the opportunity to make this game; what was the kind of the embryonic idea in your head about what Danganronpa would be, I mean obviously it turns into a game about kids in a school and a murderous teddy bear so first and foremost I wanted to make a mystery game so you know there's lots of different kinds of visual novels and for example there something like you know Steins;Gate which I'm not really a big fan of uh and to me a visual novel is a mystery game so I thought how can I make a good mystery game it would be",
            "start": 206.68
        },
        {
            "text": "and for example there's something like Steins;Gate, which I'm not really a big fan of, uh and to me a visual novel is a mystery game so I thought how can I make a good mystery game it would be an interesting mystery game and again one of my inspirations was Battle Royale and so I thought to myself what if I combine these together that would be a really cool mystery game and so that's what you know I ended up creating, so why specifically I'm kind of curious about this because I think a lot of people are curious about this and I often notice it in my own experiences with Japanese games which is extensive what is it about kind of the teenage story or the story of children as opposed to adults that is so appealing um as a storyteller you see that with Persona, you see it with a game like Catherine, you see it you see it in every like everything in anime well before well actually before I uh you know when I was making Danganronpa I never really watched anime before it really wasn't my thing",
            "start": 278.08
        },
        {
            "text": "like Catherine you see it you see it in every like everything in anime well before well actually before I uh you know when I was making Danganronpa I never really watched anime before it really wasn't my thing so I'm really not entirely sure however um meaning what do you meant to follow up a little bit earlier meaning I I don't know why Japanese people seem to always want to put you know uh the setting for children and things like that but for me I wanted to show growth when I made Danganronpa therefore in order to show this feeling of growth it couldn't be an adult someone who is you could say complete it needed to be a child that or a young person that could that could show growth and so also when I was just you know thinking about the idea and playing around with the idea finding uh the corpse of an old lady or an old guy or the execution scenes for you know an old lady and old guy didn't it didn't really strike me as really you know something that interesting and and to talk more to that um the idea",
            "start": 335.6
        },
        {
            "text": "or an old guy or the execution scenes for you know an old lady and old guy didn't it didn't really strike me as really you know something that interesting and and to talk more to that um the idea that you know as an adult you know they they might have lived a certain portion of their life but as a child or a young person they have a lot more of their life ahead of them and having that life taken away from them would be more you know despair filled more sad more impactful to the viewer and so that that's what I really wanted to go for with this I saw you know this had only broken a few months ago and I had seen it on the internet about Monokuma's original design which was not as a teddy bear where did the inspiration for this particular character come from and how did you settle on this bizarre teddy bear that's half normal and half kind of evil to be perfectly honest with you this whole process of thinking about things in Monokuma like that it was actually about an hour so the",
            "start": 406.76
        },
        {
            "text": "Bizarre teddy bear that's half normal and half kind of evil to be perfectly honest with you. This whole process of thinking about things in terms of mon, on things like that, it was actually about an hour. So the idea of you know how to make things dramatic and how to do things there's a little bit of I guess you could say stealing or plagiarism or forgery involved in this. So first of all, the idea to make Monokuma was the idea of guilty and not guilty, which in Japanese is Shiro white, not guilty, and Kuro black, guilty. So we were thinking about it, and um, obviously the setting is a school with young people and things like that, but the more we thought about the idea, more we realized that it wasn't interesting; it ended up being too grotesque or something weird. And so we thought, well, what's cute? What's interesting? Um, and we thought, well, bears are cute, right? Let's let's go with the bear, and so a bear design was drawn. We looked at it and said, perfect; let's go with it.",
            "start": 456.72
        },
        {
            "text": "well what's what's cute what's interesting um and we thought well bears are cute right let's let's go with the bear and so a bear design was drawn we looked at and said perfect let's go with that so like you said originally it was supposed to be like a a humanoid figure but um eventually it turned into to a bear and so like like I said before we didn't really like the idea of you know it was kind of gross to have like a humanoid figure for this for this bear so we went with something like you know Venom from Spider-Man and something like that so that's kind of the image that we we came up with so we talked a little bit about um using children or young people and how that's kind of resonant with the story and obviously it would make sense then that um you know Trigger Happy Havoc would take place at a school where did you come up with these these different characters these different these different ultimates as they're called in the series so you know I really like Mysteries",
            "start": 550.4
        },
        {
            "text": "would take place at a school where did you come up with these these different characters these different these different ultimates as they're called in the series so you know I really like Mysteries and looking at mysteries a lot of times the person who dies in a mystery is someone really unimportant or uninteresting and that was something that never that I never really you know cared for reading this mystery stuff therefore once we had decided we're going to use you know young people for the main characters I wanted to create characters that each one of them was individual unique and interesting enough that they could potentially be the main in their own game so along with this process there was I challenged myself with the idea that if I'm going to create this character a new character I want to think to myself I could write an entire you know short story about this character and so from that jumping point I decided to um that that or rather that naturally led to the idea of the",
            "start": 597.88
        },
        {
            "text": "I want to think to myself, I could write an entire short story about this character, and so from that jumping point, I decided to um, that that or rather, that naturally led to the idea of the ultimate something or other uh, in order to create this you know feeling of individuality, of interesting uniqueness for each character uh, this is the idea that I came to, and this is why all these characters have this incredibly you know, the Ultimate so on and so forth. Is there an Ultimate in Trigger Happy Havoc that resonates with you most? Um, are there characters that you really either enjoy looking back at or some characters that you wish were maybe a little different or that you scrapped or didn't include at all? Well actually I think the one that I like the most maybe you could say would be Monokuma, that's because I can write his lines very easily and you know this is a question I actually get a lot but truthfully speaking I like all of them and again that's because when I was",
            "start": 684.76
        },
        {
            "text": "would be Monokuma, that's because I can write his lines very easily and you know this is a question I actually get a lot but truthfully speaking I like all of them and again that's because when I was creating these characters my whole point was to make characters that were likable by everybody that were that were really good in and of their own right and you know each character within Danganronpa has their own set of fans and I really think the reason for that is for what I just mentioned that each character is unique and that I spend time and and you know care and thought into each of them so are there people at Spike Chunsoft obviously you're kind of the Visionary behind the series but who are you relying on to kind of help you um flesh out this vision whether it's artists or or other writers or programmers do you have like an intimate inner circle of people that you trust yeah I mean the the Danganronpa anything related to Danganronpa is essentially created by one really core team so for example",
            "start": 750.0
        },
        {
            "text": "or programmers do you have like an intimate inner circle of people that you trust yeah I mean the the Danganronpa anything related to Danganronpa is essentially created by one really core team so for example the character designer Mr. Kaji um he and I work very closely together and um you know sometimes it takes many revisions for him to create a character that I really a design rather that I really like and feel that I I relate with so he's you know kind of you know someone very important to the process and actually there's times when due to something that he's put into the design I've changed something in the scenario and vice versa due to you know something that I've changed in the scenario I've put in the scenario he's changed aspects of the character's design can you talk a little bit about the Jos between the dark themes of the game the game is all about murdering other people and getting away with it in order to get away from a teddy bear who wants to murder you uh but can you speak to",
            "start": 808.48
        },
        {
            "text": "Jos, between the dark themes of the game, the game is all about murdering other people and getting away with it in order to get away from a teddy bear who wants to murder you. Uh, but can you speak to how do I put this? Can you speak to kind of the the murderous scenes and the murder investigations and the darkness of the trials just opposed to free time when the music changes and you're walking around and you're just trying to date girls or meet people or learn more about them? That must be an intentional that must be an intentional design decision. So, the main point or my main idea on making this is to create a situation where I can control the player's emotions in a broad way. That's and those two I guess you could say um ending points of this swinging pendulum would be Despair and Hope. So, that you know, you have your scenes of you know like happiness and you're walking in the city and everything's fine and then suddenly you get killed and that kind of idea and that kind of setting.",
            "start": 888.44
        },
        {
            "text": "so that you know you have your scenes of you know like happiness and you're walking in the city and everything's fine and then suddenly you get killed and that kind of idea and that kind of setting allows me to create this you know this effect and so the main character, his whole idea was that uh what he wanted to create was uh this sense of unpredictability the player wouldn't be able to figure out what's going to happen next they wouldn't know when it was going to end or how it was going to end and that's what he was aiming for when he created this. I was going to say one of the I think brilliant pieces of Danganronpa is not knowing when your free time is going to end, not knowing if you're wasting time with a certain person that is going to die and you're not going to see their storyline through etc and so on. Was did you take some pleasure in writing these characters in the sense that you might you know when everyone's going to be executed uh but did you take pleasure in",
            "start": 966.64
        },
        {
            "text": "Line through Etc and so on was was did you take some pleasure in writing these characters in the sense that you might you you know when everyone's going to be executed uh but did you take pleasure in kind of being able to write in such a way as to maybe trick some people into spending time with the wrong people to watch them die Etc and so on. Interestingly enough um I guess kind of related to your question I get the question a lot um don't you feel a sense of guilt for having killed some characters but no I don't feel any whatsoever because I believe that even if a character might die within the midst of the scenario they're not dead in the hearts of the player therefore what I'm really aiming for with with the free time scenes and everything isn't so much you know how how I can you know fiddle with people's expectations their emotions but more the idea you know to make a standout character that remains in the hearts and the minds and the player so that no matter what happens they",
            "start": 1023.16
        },
        {
            "text": "fiddle with people's expectations, their emotions, but more the idea you know to make a standout character that remains in the hearts and the minds and the player so that no matter what happens they're there and that's that's what the goal of all of that is. And so actually even though I'm the one writing it when I play it myself sometimes I feel because I'm so invested in these characters myself you know like when they die, oh my God, why did they die? I suppose my next question would be kind of in this same vein what games did you take inspiration from to make it uh more than just a visual novel obviously it's a very dark game with interesting characters that you want to get involved in and with and know. Inspiration but I see a lot of Adventure game or like you know I see pieces of Phoenix Wright for instance um in Danganronpa what did you pull from any inspiration because I I feel one of the great strengths of Danganronpa is how it radically changes over",
            "start": 1106.08
        },
        {
            "text": "I see pieces of Phoenix Wright for instance um in in Danganronpa what did you pull from any inspiration because I I I feel one of the great strengths of Danganronpa is how it radically changes over and over again from a more free play to an investigation to a trial how did you kind of just what did you draw from to kind of come to that because it's a pretty brilliant mixture so I definitely obviously have played um Ace Attorney and that was an interesting game for me but more than anything else I was thinking because I had to make as I mentioned earlier a visual novel how to make the most interesting visual novel but I that that said just as a on a side note I mean even though uh Ace Attorney is a visual novel it took a lot of money to make that game um but specifically speaking of Danganronpa one game that I received a lot of inspiration from was a game called Eliza no Raihin (also known as Ill Breed) and another game ah uh Rare's Conker's Bad Fur Day, so I guess you call them dark humor or black humor I really like",
            "start": 1167.44
        },
        {
            "text": "One game that I received a lot of inspiration from was a game called Ill-Beast and a game, ah, uh, Danganronpa: Trigger Happy Havoc. So, I guess you call them dark humor or black humor. I really like that. So, for example, to put it into movies, David Lynch, the Coen Brothers, um, Tarantino - that kind of stuff. So, I would say those are probably my big inspirations. So, when you had to deliver, um, or you didn't have to, I'm sure you wanted to deliver a second game, and I know that these were released in different sequences in Japan and they were kind of combined on PSP, but did you think when you were making Danganronpa at least the original story in the school that you were able to then go on to be able to replicate it for a second game that was somewhat similar but also radically different in an entirely new environment? No, I mean honestly, I really thought that you know when I was making one, One was it that was the only game I was going to be able to make, and even with like our",
            "start": 1235.6
        },
        {
            "text": "entirely new environment no I mean honestly I really thought that you know when I was making Danganronpa: Trigger Happy Havoc, I mean one was it that was the only game I was going to be able to make and even with within like our team when we were making the game number one we said to ourselves you know this might not sell at all but this is going to be a game that 10 years from now like is going to be a cult hit but as soon as that game you know Danganronpa started to sell well in Japan suddenly my superiors told me hey how about Danganronpa 2 so um you know once once I was told that I started to work on I thought yeah I can do this I can make another one of these and I started making Danganronpa 2 um I know it's not come out in America but actually in Japan um after Danganronpa there's a novel that came out called Danganronpa Zero so what Danganronpa Zero allowed me to do is to kind of look at the scenario one more time look at things overall um put it all together in a way that you know made sense to me and then that allowed",
            "start": 1296.36
        },
        {
            "text": "So what Danganronpa allowed me to do is kind of look at the scenario one more time, look at things overall, um, put it all together in a way that you know made sense to me and then that allowed me to create a jumping point for Danganronpa too. One of the things that stood out to me most in DRPA 2, other than the fact I was just so glad to be playing more of this, was its radically different setting - it's like a tropical archipelago as opposed to a school, so it's instantly wide open as opposed to enclosed in this building. But also the introduction of uh Monokuma's sister for about Mony um where did the inspiration for both the setting and this new character come from? So actually when I uh was given the directive to make Danganronpa I was told you know what you can make one, two, and three all in the same style and this is a direct reaction against that command so for example and in order to do this you know completely opposite thing I thought I'm going to change the characters completely.",
            "start": 1386.2
        },
        {
            "text": "in the same style and this is a direct reaction against that command so for example and in order to do this you know completely opposite thing I thought I'm going to change the characters completely I'm going to change the setting completely um I'm going to make it you know more open or free as opposed to confined as the first game was and so all of this you know openness within the characters within the setting is it's a reaction really against that and that's that was my goal for this so what I was also going for was you know this idea that even though you know it's a game and everything and things you know it feels open but it actually is confined you know so this kind of I guess you could say contrast and things like that um the idea that getting the player to think that there's more space there's more everything but in reality you know it is it is more confined once you really look at things closely what was it like to then move on to a game like Danganronpa 2: Goodbye Despair",
            "start": 1465.32
        },
        {
            "text": "Danganronpa Kinda Funny Gamescast with Series Creator Kodaka-San\nspace there's more everything but in reality you know it is it is more confined once you really look at things closely what was it like to then move on to a game like Ultra Despair Girls that is totally radically different from what you had already created was this kind of refreshing for the team I know you hear a lot from a lot of development teams that they don't want to do the same thing over and over again was this kind of a reset for your team to be like we don't have to make we will maybe make this game we'll get to that in a minute the game that people really are waiting for but in the meantime we need to refresher ourselves actually it was more the idea that you know obviously people thought maybe even still think um Danganronpa is a visual novel it's an adventure game and I I wanted to play with those fans expectations and those fans ideas of what Danganronpa was honestly I I don't like giving the users exactly what they want and so I don't really like",
            "start": 1546.68
        },
        {
            "text": "to play with those fans' expectations and those fans' ideas of what Danganronpa was, honestly I I don't like giving the users exactly what they want, and so I don't really like you know I don't like necessarily doing spin-offs the way that you know Senran Kagura did.  I maybe I shouldn't have used his name directly, but so for example um you know in the case of that particular series you know the fan base was like you know more of it and he's like okay here's more, so what I'm going for actually is that to say okay this is what I'm making and players say you know it's not really what I want, to be honest with you, and then for them to actually take that game to play it and to you know have their their field of view expand, you could say or you know their experiences expand because of that, that's what I'm trying to do, so um speaking specifically to Danganronpa on another episode, um you know there's this image in Japan that third person shooters and first person shooters are",
            "start": 1609.76
        },
        {
            "text": "because of that, that's what I'm trying to do so, um, speaking specifically to Kodaka-san on another episode, um, you know there's this image in Japan that third-person shooters and first-person shooters are only played by hardcore gamers, so there's because there's this feeling that this is for the hardcore, um, you know I wanted to create a game you could call maybe you know an entry-level game to a third-person shooter something that would allow them to get their foot in the door to a genre maybe they've never even touched before to kind of break down that barrier of feeling like oh this genre isn't for me because it's for X Y or Z person, I, I honestly believe that, um, unless the player's life has changed in some way, I can't really call what I'm doing creativity that's deep, I appreciate your candor by the way, um, Danganronpa like many other products that come out of Japan seem somewhat inaccessible to a western audience yet Danganronpa has a pretty hardcore audience here in the United",
            "start": 1675.48
        },
        {
            "text": "Danganronpa by the way, like many other products that come out of Japan seem somewhat inaccessible to a Western audience yet Danganronpa has a pretty hardcore audience here in the United States um and in the West in Europe um does that surprise you because I know that it took a while for the game to come here um like three or four years um for at least the first one is it surprising to you that this game is extremely popular in a niche um audience here in the United States, the fact that we were at MomoCon in Atlanta which is a Japanese uh anime convention that people have their Danganronpa gear on there they're they're excited about it Greg bought me a toy down there for Monokuma um are you surprised and happy that this game has found life outside of Japan? I'm actually so before I came um this year to GDC in March I didn't really realize that you know Danganronpa was doing so well over here um and so I had a lot of interviews with you know media over here at GDC.",
            "start": 1745.88
        },
        {
            "text": "so before I came to GDC in March, I didn't really realize that Danganronpa was doing so well over here. Um, and so I had a lot of interviews with media over here at GDC, and a lot of them said Danganronpa has been so successful here, so successful here. And at first, actually, I thought they were speaking sarcastically to me because I only knew that over here the Vita was not doing well whatsoever. So um, I asked Alan how it was doing, and he told me, and um, I was really surprised. So like I said previously, Quentin Tarantino, the director, is a really big inspiration for me, and um, you know those kinds of references, those jokes that he does obviously, and the things that he does, um, I tried to replicate within Danganronpa, and you know in a very real way, Danganronpa is somewhat like a Tarantino creation. And the fact that this creation, uh, which even could be called maybe like a Quentin Tarantino",
            "start": 1831.72
        },
        {
            "text": "Danganronpa and you know in a very real way, you know Danganronpa is is somewhat like a Tarantino creation, and the fact that this creation uh which even could be called you know maybe like a a Tarantino knockoff or whatever is successful over here is something that's incredibly gratifying to me and I'm really happy about. Do you think that and we were talking a little bit about Japanese you know before this about Japanese gaming in the Japanese gaming industry and the western gaming industry and how there's kind of a pingpong effect between the two in terms of influences. Does this give you hope that there might not be as many differences between Japanese Gamers and American Gamers as some people read into, because I personally do not believe that there's many fundamental differences between we both all want good games. Well, on the one hand, I uh I do see what you're saying but the truth the truth really is for for our team we're a very very small team and we can't even really make",
            "start": 1920.52
        },
        {
            "text": "all want good games well H on the one hand I uh I do see what you're saying but the truth the truth really is for for our team we're a very very small team and we can't even really make you know something as appealing you could say as a team comprised of many hundreds of people so I don't really think about things in touch of of gamers what I do think though is that you know thinking about the the price of a game so you know users to users it doesn't matter how big a budget is alth they want is something that you know resonates with them and you know there's lot of talk nowadays about open world and about you know these games of this really Grand scale um but to me what I think would be what is an effective game or a good game for the user something to get us out there to hit those users is to really create something that does resonate with them and really speak deeply to them why I mean maybe it speaks to the again we were talking about price point we're also talking about",
            "start": 1961.32
        },
        {
            "text": "users is to really create something that resonates with them and speaks deeply to them. I mean, maybe it speaks to the price point we're also talking about the scale of your games in their small nature, your team. Why does Danganronpa work well on something like PSP or Vita? And is there a future for Danganronpa on consoles, or do you feel like this is something that really needs to be relegated to a handheld experience? And if so, why does it work so well as a handheld? That's actually to be perfectly frank with you, that's more a matter of the amount of budget I'm given from the company. Honestly, as a creator, I want to make something for PS4, but looking at the sales numbers of Danganronpa one and two in Japan, um, that kind of determined Ultra Despair Girls would be on Vita. But that said, you know since another episode's come out in Japan and you know the success of the series over here, uh, that might change",
            "start": 2076.0
        },
        {
            "text": "you know Ultra Despair Girls would be on Vita, but that said, you know since another episode's come out in Japan and you know the success of the series over here uh that might change in the future, that said um regardless of what platform Dangan comes out on our our goal and our vision does not change and that's not photo realism or something you know amazing like that, that's to make a game that is only like Danganronpa I've buried the lead for a lot of people out there that really want to know about Danganronpa 3 um obviously uh Ultra Despair Girls is I guess the third Danganronpa game but uh people are curious what the future holds for the traditional I use traditional quotes, I mean there's nothing traditional really about Tanga but uh about the um kind of the main stay visual novel um Adventure game type D Raa is this game in development and can you tell us anything about it yeah Gun 3 is in development and I've I've been saying this for a while now but honestly I think it's",
            "start": 2156.56
        },
        {
            "text": "Danganronpa is in development, and can you tell us anything about it? Yeah Gun 3 is in development, and I've been saying this for a while now, but honestly, I think it's going to eventually come out in a form that no one is going to expect. And you know, I have a lot of friends and acquaintances that'll come to me and say, \"You're going to make something like this,\" huh? It's going to turn out like this, and to be honest with you, all of their projections have been completely wrong. Um, I might actually make new hardware just to put the game on, but uh, that was a joke obviously. But um, I really feel that when we when it comes time to announce the game and to give more particulars, people are going to be really surprised about what they see. So you know Danganronpa is a title that I can kind of do this with and play around with, and so I'm kind of looking forward to you know fiddling around with people's emotions and expectations when it",
            "start": 2220.76
        },
        {
            "text": "see so you know Danganronpa is a title that I can kind of do this with and play around with and so I'm kind of looking forward to you know fiddling around with people's emotions and expectations when it comes time to announce the game I need like a fan I'm so excited about all this Danganronpa talk well I I want to kind of conclude just to you know thank you for your time for being here and of course Alan thank you so much for your your time as well it's always good to see you um many many congratulations to you and your team on the success of Danganronpa um thank you very much and uh we're super excited to see what's next from you and the team and and you teasing it like this is uh is just making the the wait harder but hopefully we'll we'll hear more in the meantime uh thank you for delivering really some of the most unique experiences that many of us have played um here in the West in uh quite some time well honestly I feel like it's not going to be too long before I can actually",
            "start": 2306.44
        },
        {
            "text": "really some of the most unique experiences that many of us have played um here in the West in uh quite some time well honestly I feel like it's not going to be too long before I can actually announce something so cool well feel free to do it exclusively on Kinda Funny if you want said I'll do it secretly thank you um all right so for all of you out there remember uh Danganronpa uh Trigger Happy Havoc available on Vita digitally and retail, Danganronpa 2: Goodbye Despair available digitally and retail, Ultra Despair Girls which is the new kind of third person shooter like a stranger if that can be any stranger than real Danganronpa uh Game comes out September 1st um in North America digital and and just September 3rd in Europe I believe so uh digital and Retail so keep an eye out for all those and of course an exciting announcement hopefully soon for Danganronpa 3 which is apparently something we're not going to expect which is exactly the way I want it uh Kazutaka Kodaka thank",
            "start": 2362.84
        },
        {
            "text": "all those and of course an exciting announcement hopefully soon for Danganronpa 3 which is apparently something we're not going to expect which is exactly the way I want it uh Kazutaka Kodaka thank you so much thank you uh Alan Costa of course always good to see you my friend you too thank you uh thank you all out there for continuing to support us here Kinda Funny I hope you enjoyed this interview like you enjoyed the last one and we'll do more of them as well but it was a great honor to have Kazutaka on here with us to talk a little bit about what's going on with Danganronpa a series that's near and dear to my heart as many of you guys know so enjoy those Danganronpa games buy them support NIS America and Spike Chunsoft and hopefully we'll get more of those in the near future till next time goodbye",
            "start": 2426.16
        }
    ]
}