{
    "id": 1051,
    "video_id": "Fr7qV8jDRyk",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "2015 Games That Will Get Delayed - Kinda Funny Gamescast Ep. 28 (Pt. 4)",
    "description": "What 2015 games do we think will get delayed into 2016?\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1437656401,
    "duration": 878,
    "transcript_chunks": [
        {
            "text": "all right guys final topic of the day as always us your questions go over to kindoffunny.com for's go into the kind of funny gamescast topic or um thread thre no it's not thread it's the it's form it's a sub form the board the board yeah the board okay then there is a thread there is a thread about uh the kind of funny games cast topics submit some there just like all these people did and we read them on the show starting with Jack 81x which fall 2015 games are most likely to be delayed until 2016 Tomb Raider yeah that's the one I was thinking too oh and you think do you think that because of Fallout yeah I think it'll be ready I just think it I think it's a huge blunder to release that game at the same time now some people say well different audiences I'm like I don't think so you know everyone on your Xbox One playlist that day is G be playing Fallout 4 uh I I it's November 10 I think I don't I don't I don't see why the only reason that they would release it then is because",
            "start": 0.31
        },
        {
            "text": "know everyone on your Xbox One playlist that day is going to be playing Fallout 4 uh I I it's November 10 I think I don't I don't I don't see why the only reason that they would release it then is because Uncharted isn't coming out so they can at least do that adventure action-adventure kind of thing yeah but I I think that game it doesn't it might be ready and I'm sure it will probably be ready but I don't think it makes sense they should just sit on it you know of course my pick is Persona 5 because there's not a chance in hell that coming out in North America 2015 take it to the bank I don't care what the website says and although I think it's it's somewhat suicidal to guess this now because it seems obvious with No Man's Sky thing that they're going to announce the date at the end of it but I I still don't understand how it's coming out this year mhm like I don't get it yeah I don't get anything about that game though I mean that's not so much of",
            "start": 51.08
        },
        {
            "text": "announce the date at the end of it but I still don't understand how it's coming out this year, mhm, like I don't get it, yeah, I don't get anything about that game though, I mean, that's not so much of a delay, did they announce that it's coming this year? Yeah, they've been saying that a lot, a lot of people have been saying that about that game too, and then I saw, yeah, I think it's them that's saying it. M I hope it does come out this year, I want to play it but I don't understand how the game can possibly be that done but we'll see, yeah, Persona 5 is a good guess too, Kaz Hirai, Atlus, where is a GTA V story DLC and when do you think it'll come? It's a great question, did they promise that ever? No, I don't know if they did, but I think I think they might have, but there's assumptions that they would do it and I think that they will, I think what they were seeing was that they can extract as much money from a stone as they want with GTA Online and it makes most sense for",
            "start": 92.2
        },
        {
            "text": "that they would do it and I think that they will, I think what they were seeing was that they can extract as much blood from a stone as they want with Grand Theft Auto Online and it makes most sense for them to focus on that. Um, my other assumption because we talk about how they treat their IP with care and they do is I'm wondering if they're just going to make Grand Theft Auto 6 or something like that, or not six but like a Vice City or something like that, on the PS4 which would be the exact opposite of what they've been doing because they realize that they can make a **** **** ton of money by doing that, they'll sell another 30 million copies you know. Well I mean what do you think is more likely for us to get uh Vice City or for us to get a Lost and the Damned, I think it's more likely we get a Lost and the Damned, I'm just wondering if the delay on One of the Ballads of Gay Tony like I'm wondering but by this point in the life cycle those had they come out already you know yeah I think they're on to the next one",
            "start": 128.84
        },
        {
            "text": "I'm just wondering if the delay on Grand Theft Auto V is like I'm wondering, but by this point in the life cycle, those had they come out already, you know? Yeah, I think they're onto the next one. I think they're onto GTA VI. I don't think they're worrying about DLC for this guy other than online, which sucks. I'd love more story DLC. I loved Lost and Damned. Yeah, Lost and Damned was good. I thought Ballad of Gay Tony was even better. Um, so yeah, it's weird. I just think that they're looking at it. Yeah, I think there are business decisions that have to be made for them. I hope that I would rather them do story DLC and really take their time again on GTA VI, but they were looking at this, they made a **** asinine amount of money, they made hundreds and hundreds of millions of dollars in profit, so it's like why not? They're like even if we sold half as many copies of the next game, the engine's done, so we can just still make hundreds of millions of dollars in profit even selling 20 million instead of 40 or whatever.",
            "start": 165.64
        },
        {
            "text": "even if we sold half as many copies of the next game the engine's done so we can just still make hundreds of millions of dollars in profit even selling 20 million instead of 40 or whatever it's it's but they'll sell you know yeah they can annualize that series I'm surprised they don't but I'm glad they don't do you think it' be a better idea for them to come out with the story DLC or for them to just focus on six and get that out earlier in the life cycle of the next console I'd like to think that Take-Two and Rockstar are readily cognizant that they could make more money and do more with Grand Theft Auto but choose not to and I think it gives them a mystique and and I respect them for it so I would I don't want to say I'd lose respect for them because I don't I love I I think those guys are great but I like the idea that in in a world of annualization a world of shoving **** down your throat over and over again that they choose not to with the IP that could be annualized",
            "start": 201.88
        },
        {
            "text": "guys are great but I like the idea that in a world of annualization, a world of shoving crap down your throat over and over again, that they choose not to with the IP that could be annualized the easiest, and there's something to be said about the way the House[s] and all those like them just... I appreciate that. I think it's so different, it's so un-Activision, it's so un-Ubisoft, and I like that. I like the idea that we won't see Grand Theft Auto until 2020 but I just don't think that that's true, you know? But I think that in the long run, treating the IP in the long run is something sacred, like that is going to pay dividends for them as opposed to running it into the ground, um, which is possible. They're not immune to it, you know? They haven't done it yet because they've treated it with care but they if they kept releasing the games at the clip that they were with the PS2 games and the Liberty City Stories and stuff like that, like it was starting to get to that",
            "start": 239.04
        },
        {
            "text": "it with car but they if they kept releasing the games at the clip that they were with the PS2 games and the Liberty City Stories and stuff like that like it was starting to get to that point where I'm like ah when I play those games on PSP I'm like these kind of suck yeah you know like like what's and that's when I you know so they already started going down that road and I and so I don't know I I I um it's like six of one a half dozen the other needs to well good GTA all right so trying to be funny are you yeah funny guy over there car chill what game genres do you guys tend to stay away from MOBAs MMOs driving games fighting games most sports games I mean we have an exception here or there but we're not like usually stoked MH fighting games for sure I just don't like fighting games yeah besides Smash I like I mean I enjoy fighting games but yeah I'm not going to like buy one I don't enjoy them it sounds",
            "start": 277.36
        },
        {
            "text": "usually stoked about MH fighting games for sure, I just don't like fighting games, yeah, besides Smash Bros. I like, I mean I enjoy fighting games but, yeah, I'm not going to buy one, I don't enjoy them. It sounds like I'm isolating a lot of genres, but when you really think about the genres I do play, I play first person shooters, third person shooters, action games, adventure games, role playing games, you know, puzzle games, visual novels, like so there's a lot of stuff that I mess with, but it's easy to mark off the things like I don't give a **** about, you know, driving games, you're talking about VR, like the obvious VR win for Sony is Gran Turismo, but it's which I think is certainly going to be a Morpheus game, but I, uh, don't care, you know, I would even though I'm in the VR, I'm still not going to play Gran Turismo, yeah, I think for me like Western RPGs it's never clicked with me, wow really, yeah, like I mean like Mass Effect and you know fallouts and all that stuff that's unbelievable cuz that's",
            "start": 317.32
        },
        {
            "text": "play Grand Turismo yeah I think for me like Western RPGs it's never clicked with me wow really yeah like I mean like Mass Effect and you know Fallout and all that stuff that's unbelievable cuz that's such an everyone loves them so much genre and there's so many great games that people love so much but I just it doesn't click with me it always just feels too big and it doesn't feel as tight as I want it to it's always a little too open and there's too many mechanics um but I I'm open to changing that and I I hope that someday something happens where Mass Effect I think is a great place to start but the first Mass Effect is very hard Mass Effect 2 is a way to start yeah start yeah I mean I love the first one but they're they're radically different games they really like stripped by Mass Effect 2 they really stripped everything out of it and by mass three they really good they I think but I think Mass 2 is definitely better than Mass Effect but I I like Mass Effect one a lot and uh by Mass",
            "start": 357.32
        },
        {
            "text": "2 They really stripped everything out of it, and by Mass Effect 3, they really good. They think but I think Mass Effect 2 is definitely better than Mass Effect, but I like Mass Effect one a lot, and uh by Mass Effect 3 it's like basically a shooter yeah yeah no that's true so Oscar on the couch asks would you like to see a Ghostbusters game like The Rock study Batman game games or any other movie or TV show franchise like the Ghostbusters are going around beating up 12 ghosts at once hopping around and reversing yeah no I don't want to see that all no so I mean a long time ago there was rumors and they I think they were just entirely unfounded but that No Man's Sky was going to make a game that would have been perfect and to me oh my God that was the most excited I've ever been for a game that ended up not being real yeah it looked like it was real there was so many rumors about it everybody thought that was really going to be the thing yeah and I mean that just sounds so perfect just sense you",
            "start": 398.68
        },
        {
            "text": "not being real yeah it looked like it was real there were so many rumors about it everybody thought that was really going to be the thing yeah and I mean that just sounds so perfect just makes sense you know like it makes sense for the characters it makes sense for the enemies it makes sense for just the game and the way that the fighting especially the way that you see what they're doing with Batman: Arkham Knight with that whole dual team up stuff jumping around between them using special moves to switch off having tons of foot soldiers to beat the **** out of yeah that'd be rad and then we saw that uh Teenage Mutant Ninja Turtles game last gen the DLC or downloadable one that was Out of the Shadows or whatever remember this and uh it was just a very thinly veiled attempt at making a game without Rocksteady yeah you know and it just it didn't work as well it wasn't a bad game but it definitely wasn't what we wanted exactly in that weird face style yeah I don't know why they had such weird faces the Turtles are",
            "start": 442.0
        },
        {
            "text": "you know and it just it didn't work as well it wasn't a bad game but it definitely wasn't what we wanted exactly in that weird faces yeah I don't know why they had such weird faces Craig Turtles are hard to make faces for they just have beat Turtles don't have faces yeah exactly all right Superhero Showdown 26 do we think Tony Hawk's Pro Skater is dead for good if this game tanks honestly it it's such a dead is such an unquantifiable thing in this where it's like this game's going to be fine it's gonna I mean it's going to do fine like I don't think that they said about Tony Hawk rad well I but I don't think that the quality of this game is going to affect its sales like I think that you really don't no I think the people that are buying it are going to buy it and no one else was going to anyways like I don't think this is going to be like a super huge success it's just like we're just making it will we see another Tony Hawk game like in this style probably not after this and that upsets me",
            "start": 479.08
        },
        {
            "text": "like I don't think this is going to be like a super huge success, it's just like we're just making it. Will we see another Tony Hawk game like in this style? Probably not after this and that upsets me because that it def that is a quality thing had the quality been better, I think it would you know someone would be like Let's do let's try it again. Yeah now will Tony Hawk live probably it's going to be more not ride but like stuff like that where it's like mobile games and like just oh if you count mobile games then yeah it' be F yeah Ian it's going to be I think this could be the last gasp for Tony Hawk on a console for Tony Hawk Pro Skater that series it might be the last one and it's like man that sucks that sucks so much ass. Like did you guys see the trailer yesterday that came out for it is it bad man man it's really bad guys like it sucks I believe it like I mean like the studio that made those games doesn't exist anymore you know oh yeah but but that's the thing though like having",
            "start": 521.48
        },
        {
            "text": "is it bad man, man, it's really bad; guys, like it sucks. I believe it, like I mean, like the studio that made those games doesn't exist anymore, you know? Oh yeah, but but that's the thing though, like having said that, like the Tony Hawk Pro Skater HD that is being made by the same people that made this - that came out on PS3 and um Xbox 360 - definitely did not nail Tony Hawk; it definitely wasn't perfect at all, but it was fun. I still enjoyed it; I still liked it, and it didn't look horrible. Yeah, this is a PS4 game, and it like to say it looks like a PS2 game a lot of people insult things by like throwing around insults like that when you look at this, you're like, \"This is a widescreen PS2 game.\" Holy crap, everything is so bare and so empty; there's just shapes everywhere. It's like what's happening? Like why are the animations so bad? Like why is all this stuff... now the thing is I haven't played it yet. Yeah, so that's my going to be my one thing because I don't give a crap how it looks; it's Tony Hawk.",
            "start": 562.36
        },
        {
            "text": "are the animations so bad like why is all this stuff now the thing is I haven't played it yet yeah so that's my going to be my one thing because I don't give a crap how it looks it's Tony Hawk Pro Skater like give me places to combo off of and whatever I'll be fine that still scares me that it looks that bad though and like seeing all the like I it's not even just a graphic thing what I'm talking about it looks bad like the animations of the moves look bad which makes it look less fun you know like that changes the experience get your your board lights on fire and it causes all those things to light on fire cool idea except no one really cares about that and when you look at it you're like why why is this happening it looks dumb and then there's Sparks being shot out God damn it guys why are you doing this yeah it's what's interesting to me is the relationship between the ubiquity of skateboarding in society and the downfall of Tony Hawk Pro Skater because as a skater not Tony Hawk the person because",
            "start": 613.56
        },
        {
            "text": "doing this, yeah, it's what's interesting to me is the relationship between the ubiquity of skateboarding in society and the downfall of Tony Hawk because as a skater, not Tony Hawk the person, because skating really entered the mainstream and I skated when I was a kid, my brother was really into it and still skates to this day, um, so I grew up around it and grew up around that culture like very much, and uh, it entered the mainstream in the early 90s, but it's ubiquitous now more than it's ever been, and yet the relevance of skateboarding games is like zero, meanwhile, in '99 or '98 when Tony Hawk Pro Skater came out, that was huge at a time when skating was still rebellious and different, um, and so I always thought that was weird; you would think that Tony Hawk would be huge today, yeah, but it's not, I mean, well, that's the thing though, is it's like I don't think it's so much the idea of skateboarding games as much as it's Tony Hawk kind of had its",
            "start": 656.76
        },
        {
            "text": "Hawk would be huge today, yeah, but it's not. I mean, well, that's the thing, though - is it? It's like I don't think it's so much the idea of skateboarding games as much as it's Tony Hawk kind of had its own genre of just the like arcadey sports title you know, and like we saw that genre come and go with the NBA Streets and the like all that stuff that was like \"we're going to take the idea of this sport but we're going to make it '90s-fresh\" - yeah, like NBA Jam, NBA Street, Blitz, all this different stuff you know. Tony Hawk was definitely more than a skateboarding game, yeah, because the skateboarding game, like Thrasher, uh, which came out a couple years after Tony Hawk, was like a simulation skateboarding game and it was awful, horrible. But then Skate came out and people loved Skate. I never got into it because I wasn't into it for the skateboarding and I was into it for the gameplay and for the like presentation of the game and the soundtrack and the culture of it you know, um, but it's just like that genre.",
            "start": 696.76
        },
        {
            "text": "into it for the skateboarding and I was into it for the gameplay and for the like the presentation of the game and the soundtrack and the culture of it you know um but it's just like that genre is dead which brings me to my next question from Adam Murphy who just wants to know about video game mascots that's just like is that still a thing he wants to know about him yeah that was his question video game not a thing at all anymore yeah it's like you know you got Mario and stuff but like I think Mario at this point has transcended being a mascot for Nintendo he's just a character that Nintendo yeah everyone knows it you know it's like Mickey isn't the mascot it's the face Mario is the face of Nintendo that's a better way to put it right Master Chief is the face of Xbox, Halo Drake or Sack Boy is the face of PlayStation does I mean it's weird to say this cuz it sounds stupid but I think PlayStation's the sacred symbols and the the PS logo that's the face of PlayStation you know",
            "start": 737.6
        },
        {
            "text": "the face of play Playstation does I mean it's weird to say this cuz it's this sounds stupid but I think PlayStation's the sacred symbols and the the PS logo that's the face of PlayStation you know it doesn't necessarily need to be a character when you people see that they know what it is sure when when they see the X of the Xbox I don't think they're like Xbox when they see the Nintendo logos that's a little too obvious obviously it's Nintendo but it's like PlayStation I think that's the thing that identifies it but yeah Crash Bandicoot Sonic like those days are gone when I don't think we'll ever see one game Define A system that that much you know absolutely I agree then final question comes from my boy Zack Edwards Z Edward shout out to Houston um why do games stray away from poop I could be mistaken but is the Sims the only game where a character can drop a deuce Tomi and Duke we we talking about Duke n you pick up a turd out of you poop out a turd and then pick it up and draw",
            "start": 781.92
        },
        {
            "text": "could be mistaken but is The Sims the only game where a character can drop a deuce Tomi and Duke we were talking about Duke Nukem and you pick up a turd out of your poop, then pick it up and draw with it yeah South Park you poop out and you can use that in battle and stuff like that Digimon World on PS1 if you uh didn't take care of your Digimon he would poop and if you pooped too many times he died oh my God just like real life yeah it's just like real life ladies and gentlemen that has been the first ever episode 28 of the Kinda Funny Gamescast as always I'm Tim Gettys coolest dudes in video games Colin Moriarty and Greg Miller please go to kinda funny.com for our live show, leave your topics for this show over on the Kinda Funny Gamescast forum until next time I love you I love your body I love all the things you do with it",
            "start": 826.92
        }
    ]
}