{
    "id": 638,
    "video_id": "orIbFO9lZHU",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "How Important Are Game Trailers? - Kinda Funny Gamescast Ep. 08 (Pt. 1)",
    "description": "We discuss the importance of marketing in video games.\n---\n\nWe quit our jobs, please support us here: http://www.patreon.com/kindafunnygames\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nThe boys discuss the newly announced details on the PlayStation \n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1424700000,
    "duration": 1509,
    "transcript_chunks": [
        {
            "text": "[Music] What's up, guys? Welcome to the first ever episode 8 of the kind of funny games. Stop that [ __ ] Oh, no. No. The only thing they're downloading the same thing. They're getting it on iTunes. Like, oh no. The podcast. They They stop when you say that. Like, I know they're past the first ever. Yeah. No, they don't they don't know anything. Don't do that. They're good kids. I'm Tim Gettys. Alongside me are the coolest dudes in video games, Colin Moyardi and Greg Miller. We're gonna talk about some video games today. It's gonna be stuff to talk about today. The the whole rigma roll that we got to go through right now is uh I like you say we got to like I'm putting a gun to your head or somebody Nick is demanding this happens. You don't know the rules of the internet. I don't. Oh, I do. This is one of the rules. You have to do this in the beginning of a podcast. You have to let people know where they can get it. Okay. Cuz you guys can get it at kind of funny.com. You can also get it",
            "start": 0.31
        },
        {
            "text": "This is one of the rules. You have to do this in the beginning of a podcast. You have to let people know where they can get it. Okay. Cuz you guys can get it at kind of funny.com. You can also get it at youtube.com/kindfunnygames. Monday through Thursday. Topics broken out, all that stuff. Then on Friday, get the full episode or you can go over to iTunes or your favorite podcast thing except for Zoom Marketplace because they're haters apparently. I don't know. I don't know if we can fix that. They're they're upset at us. But um yeah, you can get it wherever you want. Why would the Xbox related thing be upset at us? That doesn't make any sense. Um we need an Xbox fanboy cuz apparently I'm the Nintendo fanboy. You guys are the Sony fanboys. We need Nick can be the Xbox fanboy. Yeah, sure. Learn everything about Gears of War. Done. We got some fanboys. That'll make everybody happy. So, uh, we're going to get right into it. We got a Patreon topic because if you guys want this, uh, the",
            "start": 42.4
        },
        {
            "text": "Learn everything about Gears of War. Done. We got some fanboys. That'll make everybody happy. So, uh, we're going to get right into it. We got a Patreon topic because if you guys want this, uh, the show early, you can go to patreon.com/kindfunname and get this thing early. Or you can do a whole plethora of other things like suggest a topic for this show and we will do on Patreon. Yeah, they didn't even, this person even suggested they bought it. They're like, here's eight bucks. And then they suggested the topic. Yeah. So, you can get your topics essentially guaranteed on the show unless they're really racist. Whoa. Um, then we we draw the line. We might not do them. Um, all right. So, this is from Ben McConnell. He says, \"Hi, guys. My topic for the show is marketing in the gaming industry.\" I'm not going to read the the grammar issues with this. I'm just going to say it in a way that makes sense. No. All right. So, my topic for the show is marketing sound like an idiot. Yeah. No, no,",
            "start": 79.04
        },
        {
            "text": "I'm not going to read the the grammar issues with this. I'm just going to say it in a way that makes sense. No. All right. So, my topic for the show is marketing sound like an idiot. Yeah. No, no, no. My topic of the show is marketing in the gaming industry and uh who does the best marketing in the industry? Oh. Oh, dear. and um he's really nice. He's like, I'm gonna change my rewards here so someone else can have a shot at the topic for the show. So, shout out to you, man. You're a good dude. Um so, he's talking about trailers and he wants to know how much trailers can make or break a game. They can [ __ ] they can dominate. I mean, look at Dead Island. Dead Island, remember, it's hard now that there's been so many Dead Islands or up to Dead Island 2, which sounds like there hasn't been that many, but then you realize there was a bunch of [ __ ] spin-offs and other PC things and another episodic deal. Uh remember when Dead Island debuted? That trailer was unlike any zombie trailer",
            "start": 124.96
        },
        {
            "text": "that many, but then you realize there was a bunch of [ __ ] spin-offs and other PC things and another episodic deal. Uh remember when Dead Island debuted? That trailer was unlike any zombie trailer we'd seen in the video game industry. This the backwards the backwards one slow motion uh the piano playing over in cut with the child being chased and everything else. Like when that came out that was an IG exclusive. Ryan Gettis had gotten that from Deep Silver and it like it exploded like and I remember when they showed us the rough cut of it. They're like, \"Oh, we're negotiating this exclusive. Here's what we have so far.\" And we all watched like holy [ __ ] if this comes together. I mean, it's already fantastic and there's drawings for parts of it. Like, if this comes together the way they're working on it, it's going to be amazing. And then we got it, it was it would blew up, right? And that put Dead Island on the map. Now, that said, Dead when we finally played Dead Island,",
            "start": 162.08
        },
        {
            "text": "way they're working on it, it's going to be amazing. And then we got it, it was it would blew up, right? And that put Dead Island on the map. Now, that said, Dead when we finally played Dead Island, everybody's like, \"This is not that we're you're I'm using a buzz saw that's electrified shooting bees at people, you know what I mean? Like, this is not the serious game.\" But by that point, nobody cared. That thing jumparted the franchise and made people aware of it. You know what I mean? Where it spread out. And this always goes I always go back to this with the review discussion of Eric at from EDR at the time when he did it at GDC and said it's just about people knowing your game exists in reading a review. It doesn't matter if it was good or bad. People need to know there needs to be that cache. This is the same thing, right? Like if you put your trailer out there and you make an impact, you're great. Yeah. Especially for something that isn't an established franchise. Like that",
            "start": 200.56
        },
        {
            "text": "that cache. This is the same thing, right? Like if you put your trailer out there and you make an impact, you're great. Yeah. Especially for something that isn't an established franchise. Like that trailer came out and like that to this day is one of the most popular IGN videos of all time because of like we got the exclusive on they got the exclusive on that. Um, but so many people watched it and that's the type trailers are important because they don't need gameplay. Like it it can just kind of give you an idea of what the game is supposed to be like and uh I feel like a lot of people even non-gamers can kind of relate to that and latch on to it and share with their friends and all that stuff and build that buzz about this game. So yeah, Dead Island was a thing before it was a game. Right. Right. Right. Right. That's very very very important. Same thing when like you know I yelled out, you know, we need an Xbox fanboy. I yelled out about Gears of War. You remember the Mad World",
            "start": 234.72
        },
        {
            "text": "Right. Right. Right. Right. That's very very very important. Same thing when like you know I yelled out, you know, we need an Xbox fanboy. I yelled out about Gears of War. You remember the Mad World trailer? like that played in movie theaters. Even if you didn't weren't a gamer, all of a sudden you had, oh, the Gears of War, that's some kind of Xbox game. Interesting. Same thing with Halo. Like, and I think that's the the movie trailer experience. When you get a game playing footage before a movie, that's the general populace that is seeing this thing. And those those theater trailers always feel different. They always feel way more cinematic and way more like you're you're appealing to a different audience, right? Like, you know, like Colin and I always joke around when we about our favorite PlayStation trailers that come out of Japan, right? and they're like, \"Now with PlayStation Platinum trophy support and like all the [ __ ] Colin and I nerd out about, but nobody in a movie",
            "start": 271.2
        },
        {
            "text": "favorite PlayStation trailers that come out of Japan, right? and they're like, \"Now with PlayStation Platinum trophy support and like all the [ __ ] Colin and I nerd out about, but nobody in a movie theater, like he's got a platinum. What the [ __ ] does that mean, you know?\" Yeah, I remember there was a um Metroid Other M trailer that played before um I tried to say movies and stuff and it was like live action. It was Samus Walking. It was a [ __ ] badass trailer. It's like great. That game was not that. But yeah, man, I remember that being super awesome. Halo 2, the the first trailers for that were just insane. Halo 3. Holy [ __ ] The Halo 3 trailer was insane with Master Chief just walking like super long and Cortana just giving the speech. Yeah, man. Like that that trailer alone must have sold copies of that game even though obviously Taylor so it's going to sell anyways. But uh what about you Colin? I mean Gears was the one I was thinking about. I mean that's my favorite trailer",
            "start": 305.76
        },
        {
            "text": "have sold copies of that game even though obviously Taylor so it's going to sell anyways. But uh what about you Colin? I mean Gears was the one I was thinking about. I mean that's my favorite trailer of all time. I think that that Gears of War trailer of Mad World is was effective and was awesome and it was important because um we have to remember that the the context of Gears of War coming out very early in Xbox 360's life cycle. And Xbox 360 was fine, but Xbox was a failure compared to to PS2. And it was important for them to come out and shake things up a little bit, be a little more adult, aim at a different kind of audience. And I think they captured with Gears of War. That trailer was, I think, not only my favorite trailer, you know, in my opinion, but but maybe one of the most, if not the most important trailer, um, that I've ever seen for a game. So, it just in terms of its artistic value, uh, the revival, the the with the combined with Donnie Darko, the complete revival of",
            "start": 341.36
        },
        {
            "text": "not the most important trailer, um, that I've ever seen for a game. So, it just in terms of its artistic value, uh, the revival, the the with the combined with Donnie Darko, the complete revival of Tears for Fears Phantom, which was funny as hell. It was funny as hell to watch it because I was I've always been into Tears for Fears and watching people just suddenly love Tears for Fears again was like so weird. And it was because of Donnie Darko in that [ __ ] trailer. Um, and uh, I think it was important because that really gears along Halo was already out and people enjoyed Halo, Halo 1 and 2 on Xbox, but Gears was that first nextG exclusive for them. And so, um, that was an important trailer, but what I'm what I'm what I'm more into is like I don't watch many trailers, even for games I'm interested in, unless I'm like really really interested in the game. I don't actually ever watch footage of the game cuz I kind of don't want to. I I consume things with more of the written word and",
            "start": 379.44
        },
        {
            "text": "interested in, unless I'm like really really interested in the game. I don't actually ever watch footage of the game cuz I kind of don't want to. I I consume things with more of the written word and screenshots and stuff like that or art and then not try to spoil it too too much for myself. What's funny about that is that that's the way we always did it before. Like it's so funny like we're getting old. We are like like even in the PS2 and Gamecube and Xbox eras. We really weren't getting this hodgepodge of [ __ ] trailers. It really didn't start until Xbox 360. Um and so I still kind of consume things in the old way. Um but you know some trailer I I really like the Resistance 3 trailer. I never forget that Resistance 3 trailer. The first one when they're on the train it was all live action whatever the horns were playing and stuff like that. like the air air sirens, they get you excited. But I think trailers are in typically um deceptive. And so like it's not worth getting excited",
            "start": 414.72
        },
        {
            "text": "whatever the horns were playing and stuff like that. like the air air sirens, they get you excited. But I think trailers are in typically um deceptive. And so like it's not worth getting excited over anything a trailer is showing you ever. You know what I mean? And that's like something I try to keep in mind. Dead Island is a great example. That was a that was a a seminal trailer, expertly done trailer, and that game was not the trailer, you know? And that's like and that's why you you know you got to be a little over I mean like and this is for the I think maybe the first time for the first time on Games Cast ever where I've brought up DC Universe in a serious sense and not just a joke like the blur trailer they did for DC Universe online remember blur get the [ __ ] out how [ __ ] incredible that was and that all of a sudden everyone wanted to know about DC Universe online and then they went and saw it and they were like I'm good like that's you know what I mean like I loved it and",
            "start": 449.68
        },
        {
            "text": "that was and that all of a sudden everyone wanted to know about DC Universe online and then they went and saw it and they were like I'm good like that's you know what I mean like I loved it and there was MMO kids who loved it and DC kids who loved it but like that trailer got it again got it into everybody's head that it's going to be this crazy alternate experience where the heroes can die and da da and like that got people so stoked for that right and like this is interesting to do this topic uh we just you know pull back the curtain just filmed our the order 1886 uh review discussion which you can go get on youtube.com/confunname and in that we were talking about on colony live earlier in the day talking about how the hype train goes and how why right now why in when we're filming this before the embargo is lifted for the order review. Why everyone's talking about this 5 hours of gameplay YouTube clip that got uploaded, right? And the reason being is because that's all there is to",
            "start": 489.44
        },
        {
            "text": "before the embargo is lifted for the order review. Why everyone's talking about this 5 hours of gameplay YouTube clip that got uploaded, right? And the reason being is because that's all there is to talk about right now because we can't talk about it because of the embargo, but people have been looking forward to this game since the debut trailer. And I was I told the story of like, you know, my mainstream friend who doesn't play games and has a life and has a job that isn't connected to this industry texted me when he saw the original order trailer. He's like, \"That's that's the one, man. That's what I'm excited for.\" And he's like, \"That's awesome, but like we don't know anything based on that.\" So that's why like when Colin initially wrote like, \"Hey, I saw this for the first time and it didn't look good.\" People ripped them apart, right? Because for 6, nine months, they've been sitting there going, \"This is it. AAA PlayStation 4 experience can't [ __ ] wait.\" And somebody's like,",
            "start": 530.72
        },
        {
            "text": "it didn't look good.\" People ripped them apart, right? Because for 6, nine months, they've been sitting there going, \"This is it. AAA PlayStation 4 experience can't [ __ ] wait.\" And somebody's like, \"It's not that great.\" Like, \"What? [ __ ] you.\" You know what I mean? Like, and that's why now it is. Nobody understands exactly what's happening. You know what I mean? In ter I'm talking about like right now, like at the very very moment we're recording this is people are so hung up on this one thing cuz that's all you can talk about. And that is so devastating to hear a game you've been waiting years for is going to take you half a day. Well, and and the funny thing about that, we're talking about that first trailer, that E3 2013 trailer of The Order, which is an awesome trailer. Spoiler. I'm going to give you a chance to turn it off. It's not really a spoiler. It's not really a spoiler at all, but I'm going to just mute a chance. Just mute it for a few seconds. Okay, that scene isn't",
            "start": 566.8
        },
        {
            "text": "I'm going to give you a chance to turn it off. It's not really a spoiler. It's not really a spoiler at all, but I'm going to just mute a chance. Just mute it for a few seconds. Okay, that scene isn't anywhere in the game. I don't know if you noticed that. Like what they showed what they showed in that trailer, nowhere in the game. Yeah. So, like what I'm as far as I can tell, I don't remember ever seeing them in a carriage, getting out of the carriage with their guns out with all the like that never happens. So, that just goes to show you again why you cannot trust trailers. But see, I I'm on a completely opposite side of you when it comes to trailers. Like, I love watching trailers and I think that it's such an important part of the whole experience of the game. And I prefer it when things like that happen, when it's like it doesn't ruin the game. It doesn't ruin the game. Here's here's something that feels like the game. Like I remember the Prince of Persia, the the second and third",
            "start": 599.92
        },
        {
            "text": "like that happen, when it's like it doesn't ruin the game. It doesn't ruin the game. Here's here's something that feels like the game. Like I remember the Prince of Persia, the the second and third one, their trailers, that [ __ ] a lot of the stuff was not in the game. A lot of the story elements that they showed, that's not how the story went. And I I enjoyed that cuz it's like, oh, this trailer looks cool and it intrigues me, but then I'm getting a completely different experience. It's like when you watch a movie and it's like great, unless it's a Fast and Furious movie. This trailer just ruined everything cuz nothing can ruin Fast and Furious movie. Um, but yeah, with the games, like I enjoy that. Like that to me that sounds great that that is not in the game. To me, it's disappointing because I was actually waiting for that same like that was an awesome scene. like where where when when are they and there's a scene when they're in a carriage and I'm like oh it's going to happen",
            "start": 633.76
        },
        {
            "text": "because I was actually waiting for that same like that was an awesome scene. like where where when when are they and there's a scene when they're in a carriage and I'm like oh it's going to happen here or whatever and like it's going to get shit's going to go off and it just never happened. To me it's I always find that weird because we're getting excited about a world but not getting excited about what we're going to get. And I think that sometimes in movies you see like deleted clips that don't end up in the movie, but they're made and made to be in the movie. They don't No one's making movie trailers or very often making movie trailers where nothing is in the [ __ ] movie. You know what I mean? It's like that's just weird. That's a weird precedent I think to set just for games where it's like well it's not in the game. Um, and that's good. I'm like I don't know. I mean, I got I got excited seeing the order because I was like, \"Oh, this looks dark as hell.\" And I actually don't",
            "start": 664.72
        },
        {
            "text": "it's like well it's not in the game. Um, and that's good. I'm like I don't know. I mean, I got I got excited seeing the order because I was like, \"Oh, this looks dark as hell.\" And I actually don't remember as many scenes as dark as that trailer in the entire game, you know? So, like I think it's a I don't want to say it's deceptive in that sense, but cuz maybe that was in the game. Maybe they cut it, but it's just I want that's why I don't get too hyped about trailers. I get hyped about gameplay and I watch gameplay and that's why it was cool when we saw Uncharted 4 at PSX. It's like, okay, this is the game and now you know that this is in the game and this is at least the way the game is going to look. Yeah. And I think that that is much more valuable than the the marketing hype that is that is the trailer that is just designing. Like you have to be confident enough to show your game. Sure. You know, that's always I feel like there's an art to marketing. And again, this is me very",
            "start": 695.12
        },
        {
            "text": "that is the trailer that is just designing. Like you have to be confident enough to show your game. Sure. You know, that's always I feel like there's an art to marketing. And again, this is me very like YouTube minded and always thinking about this stuff, but like I love the when when someone's good at marketing and like good at selling their thing. I [ __ ] love that. creating a video. Like, I love the idea of creating a video with the intent of it going viral and intent of people enjoying the video. And that's why a lot of times with gameplay stuff, I almost don't want gameplay. Like, if it's a gameplay trailer, sure, I want that. But like, I like the I love launch trailers. They're [ __ ] so awesome to watch just because they're trying to tweet it like a movie trailer, which just this is supposed to be an entertaining piece of content. Like there's game trailers that I'll go back to forever every once in a while just to look at and just be like, man, like I remember being there",
            "start": 729.6
        },
        {
            "text": "is supposed to be an entertaining piece of content. Like there's game trailers that I'll go back to forever every once in a while just to look at and just be like, man, like I remember being there when this first happened and all this stuff and it's awesome. Like the Zelda Twilight Princess trailer, holy [ __ ] that was awesome. GTA, any GTA, the Vice City trailer, the San Andreas trailer with freaking Welcome to the Jungle Stars playing. It's just like that just brings back so much good memories to me. The GTA 5 trailer even like that his part of his question was who does it best? And I I totally lobby that Rockstar. Rockstar. I don't even think there's a question. I mean, like, and granted, it's easy, right? I mean, if they if somebody walked in was like, \"Hey, you guys need to market GTA 6. We could probably get people to watch it, but just the way they do it and make events out of like, tomorrow at 10 a.m., we're debuting our trailer.\" You know what I mean? They have it and then",
            "start": 766.8
        },
        {
            "text": "GTA 6. We could probably get people to watch it, but just the way they do it and make events out of like, tomorrow at 10 a.m., we're debuting our trailer.\" You know what I mean? They have it and then they they and the way the trailers are cut, you know what I mean? Like the way those that debut GTA trailer was cut with a VO and this from Michael and everything. I was like, \"Yes.\" I mean, G with Rockstar specifically, it goes further because it's not just the trailers. Like, they got marking down period. Like, every bus has a freaking GTA thing on it. Like, there's posters everywhere, all that stuff. And it's like, yeah, you know, money goes a long way when it comes to that stuff, and GTA has money, but it's like, why does GTA have money? It's like a circle thing where it's just like they market their games well, which gets them more money, which allows them to market even better, which gets them even more money. Um, but what you're saying is so right where it's like, despite all that,",
            "start": 801.6
        },
        {
            "text": "their games well, which gets them more money, which allows them to market even better, which gets them even more money. Um, but what you're saying is so right where it's like, despite all that, like no matter how much money you have, like that doesn't make a good trailer, right? And they have the money and make a good trailer. So, it's like and have a great game. So, they they have just the perfect perfect balance of everything when it comes to just pushing that product. And you saw when those trailers came out that uh Stevie Wonder superstition spiked on iTunes and then Merl Haggard's or is it no not Merl Haggard uh Whan whatever the Hank Gang Done this way song spiked too. Yeah. And they got power. Yeah. You know that's that's just that is insane. Like I remember going back to the trailers for a second like the first trailer I ever saw. You were saying that like the it was really with the 360 generation that you know trailers became a thing. That's because internet video didn't",
            "start": 834.8
        },
        {
            "text": "for a second like the first trailer I ever saw. You were saying that like the it was really with the 360 generation that you know trailers became a thing. That's because internet video didn't exist back then. I remember the first trailer ever I saw was a Final Fantasy 10 2 and it took me four days to download and it was a thumbnail sized little thing and it got me hyped for the game. Um, but like that was crazy to me that like that was the turning point because it went from I can only read about these things and see images which is a whole different type of marketing to now oh [ __ ] I get a video and from then on it was like every single time something happened I needed to see the video of it. I mean, that was I there's distinct memories for me with marketing and video game journalism, everything else, however you want to describe it, of like I remember when I was we me and my friends loved Grand Theft Auto on PlayStation 1, top down, you come back, you know, from backyard wrestling,",
            "start": 872.64
        },
        {
            "text": "else, however you want to describe it, of like I remember when I was we me and my friends loved Grand Theft Auto on PlayStation 1, top down, you come back, you know, from backyard wrestling, sit down and just play GTA 2 and run around and blow people up and oh, Elvis and D, how long can you survive? Pass the controller around. And when the EGM arrived that was like, here's here's your first look at GTA 3. And it was this screenshot ground level of the protagonist in his coat and the world. I was like, no [ __ ] way. Like I remember like flipping out that like you're reading this going to be this sandbox world. You can do anything, go anywhere, and you're on it's three it's third person. I was like, \"What the [ __ ] are you doing?\" And this is a screenshot I'm geeking out over. And then you jump ahead to I remember in high school um well not jumping that far ahead actually, but just in high school I remember uh when I clicked through to look at their rundown of no WWF Wrestlemania 2000",
            "start": 911.36
        },
        {
            "text": "jump ahead to I remember in high school um well not jumping that far ahead actually, but just in high school I remember uh when I clicked through to look at their rundown of no WWF Wrestlemania 2000 and they had they had wrestling videos, the entrances of the characters and being able to click and watch Chris Jericho's entrance and he had just been announced he had just joined the WWE in August or whatever or it was like brand new, you know what I mean? They flipped his model from having him from the WCW games and it was just like I can't [ __ ] believe I'm watching the screenshots's coming to life right now. You know what I mean? That was the turning point for me. What was the first trailer you ever saw? I don't even remember. Um, it must have been a PS2 or a GameCube game kind of similar. Get off a Kazah or something. But like the, you know, to me like you guys are talking about how Rockstar kind of wins that prize in marketing. They're great at marketing. The beauty of the the",
            "start": 944.88
        },
        {
            "text": "Get off a Kazah or something. But like the, you know, to me like you guys are talking about how Rockstar kind of wins that prize in marketing. They're great at marketing. The beauty of the the Rockstar marketing, Take Two Marketing is that they don't really have many games to worry about. So, Sure. like like you know Red Dead and LA Noir and Max Pan. I mean it's like it's there's not a lot of it. I actually think the undisputed marketing master last years is Sony and I think that like you know the fact that they managed to re like just totally flip the script on Xbox, you know, and sell PlayStation 4 just to the consumer. Yeah. Well, I mean just like everything's marketing. It's not just a trailer. It's just the end result of the marketing. It's like the way they positioned PlayStation 4, the way they revealed PlayStation 4, the way they talked about it, the way, you know, that uh they just demolished Microsoft, you know, and I I think that they actually don't get enough credit for",
            "start": 986.96
        },
        {
            "text": "4, the way they revealed PlayStation 4, the way they talked about it, the way, you know, that uh they just demolished Microsoft, you know, and I I think that they actually don't get enough credit for that. I think that like people, it's kind of self-evident to people that, oh, the PS4 sells, it's a good console, it's a great console, and of course it sells because of that. But it really sold because of the precedent that they set. There was a lot of thought put into everything they did, you know, and like and that that was we didn't expect it. We kept waiting for them to [ __ ] it up and they never did. They never [ __ ] it up and they still haven't. And that's like the most extraordinary extraordinary thing which is why PS4 is around 20 million units sold. You know, more than twice as many PS4s have been sold in Wii U with a year less on the market. PS4 is only 4 million units behind GameCube. You know what I mean? It's only been on the market for 14 months. Yeah. The It's",
            "start": 1023.92
        },
        {
            "text": "as many PS4s have been sold in Wii U with a year less on the market. PS4 is only 4 million units behind GameCube. You know what I mean? It's only been on the market for 14 months. Yeah. The It's incredible. The context there is the fact that you and I covered them during the PlayStation 3 era when they [ __ ] up everything and they put out too many exclusives and they didn't market them. They do anything. They didn't put up commercials. Do you know what I mean? And so yeah, they had they weren't speaking to their audience. And then when they went to PlayStation 4 and they said, \"Okay, we're about the gamers for the gamers. Developers bring your thing.\" Da da da. That was a huge turning point them in terms of that. But then still now for as far as front-facing, consumerf facing, mainstream facing, that's where they still struggle. I think I I I disagree with that too cuz I think that they've been smart enough to not promote their exclusives cuz they don't want to and they don't have",
            "start": 1058.24
        },
        {
            "text": "facing, that's where they still struggle. I think I I I disagree with that too cuz I think that they've been smart enough to not promote their exclusives cuz they don't want to and they don't have to. I think that hook it to Destiny. Yeah. Destiny and NBA 2K. They're like more prone to advertise another studio's games just to get PlayStation out there. I think that they're do I think it's brilliant because the old Sony would have had the order 1886 ads all over the goddamn place, but they don't. And they have like a commercial, you know? Meanwhile, like they'll they'll they have entire minute spots that they'll play during football games that are two NBA 2K and Destiny, which are games you can buy in anything. That's a good point. You know what I mean? And so, I think that like I actually think that they've kind of identified like we don't let's save our money for Uncharted. We don't really need to do that right now for the order of Bloodborne. I don't think advertising and demic",
            "start": 1095.12
        },
        {
            "text": "think that they've kind of identified like we don't let's save our money for Uncharted. We don't really need to do that right now for the order of Bloodborne. I don't think advertising and demic advertising is going to help those games sell. Bloodborne is going to sell by itself. Bloodborne and the and the order is going to do what it does. I saw Michael Pack there talking about how he thinks it'll sell 5 million copies. I think that that's crazy. I think that's insane. But I I don't I don't Maybe it does. I mean, that would be insane. That would be that would be 1/4 of the PlayStation 4, but they're hungry, you know. But nonetheless, I think that Sony is the undisputed master of marketing right now because they're playing the long game. It's not about like the final trailer. It's not about the launch trailer. It's not about that one day thing. It's been two years of consistency after a like just an abysmal, you know, showing for for years until the PS3 Slim really came out from like",
            "start": 1128.56
        },
        {
            "text": "the launch trailer. It's not about that one day thing. It's been two years of consistency after a like just an abysmal, you know, showing for for years until the PS3 Slim really came out from like the from like PS3 relaunch to but even though the damage was done, you couldn't like turn it around as far as public. So, I think that they're doing a great job. That's true. That's very true. I feel like I've always been a Sony guy. Like I'm a Nintendo guy obviously, but besides that, like when it comes to the real consoles, um I've always I've always been a Sony dude. And like I've, you know, PS1, PS2, and PS3 because of Metal Gear and a couple of the like Final Fantasy games I cared about, which Final Fantasy eventually came to Xbox. It was, you know what I mean? Anyways, so the PS4 was the first time that there was the question of which one am I going with, PS4, Xbox One? It wasn't really a question. It's like, I want to play Uncharted, so I'm going to get a [ __ ] PS4. Um, one of my",
            "start": 1161.36
        },
        {
            "text": "first time that there was the question of which one am I going with, PS4, Xbox One? It wasn't really a question. It's like, I want to play Uncharted, so I'm going to get a [ __ ] PS4. Um, one of my best friends, Alfredo, is a Xbox guy. He's an exbot, we call him completely. And, uh, he he loves it, you know, and he's very happy with his Xbox One and all that stuff. But for me, there was a question of I was like, I still don't want any. Like, I'm not I like Halo, but like I'm not going to buy it. Halo. And um, it it was the PS4 reveal event that completely won me over. And now there's a PSX and there's all this stuff. The fact that Sony like takes its marketing that way is so important to me. Like just because like they obviously give a [ __ ] And going back to the trailers and stuff, like I was saying, like I get really emotionally invested in trailers. And uh when they the opening video of the PS4 launch event where it like everything goes dark and then just starts off and like Yeah.",
            "start": 1203.2
        },
        {
            "text": "I was saying, like I get really emotionally invested in trailers. And uh when they the opening video of the PS4 launch event where it like everything goes dark and then just starts off and like Yeah. the PS goes black. That trailer, oh my god, I downloaded it. I watched that [ __ ] all the [ __ ] time. It just gets me so hyped. It was like together we ran, we played, we jumped. I'm like, \"Oh my god.\" I mean, it was it's that's what I talk about all the time with PlayStation 4 and covering it from PS3 to PS4 that especially that Switch, right? Is that they took the advice they never took Conai's advice for the longest time and I was on, you know, in USA Today and stuff talking about what they should do and like not that I'm saying they they they did what I thought they should do, which they never ever do, which was instead of trying to get bigger, turn around and focus on who you have. And you have hardcore [ __ ] gamers who love this [ __ ] you know? Well, to me that was the moment",
            "start": 1244.64
        },
        {
            "text": "never ever do, which was instead of trying to get bigger, turn around and focus on who you have. And you have hardcore [ __ ] gamers who love this [ __ ] you know? Well, to me that was the moment that they they did what Nintendo always had, which was, hey, we have a legacy. Like, we have people that have grown up with PlayStation. Now, this is they're no longer just the new console. They like they are PlayStation is a brand that people get goosebumps over that people, you know, you can like get these nostalgic feelings out of people in the same way you could for Nintendo. And like that event to me was like, okay, sold. I bought the PS4 as soon as it came out and I need this. And then they re, you know, they put out the 20th ed anniversary edition. They put out merch. They put up this, they have the PlayStation fingers. Yeah, they get it. They get it now. It's It's amazing how they've turned it around. Although, we have to give it up. We have to give it to Microsoft for letting them do",
            "start": 1284.56
        },
        {
            "text": "have the PlayStation fingers. Yeah, they get it. They get it now. It's It's amazing how they've turned it around. Although, we have to give it up. We have to give it to Microsoft for letting them do that because it Microsoft it was Microsoft's race to lose and they just totally [ __ ] it up. Like I I I had never seen anything like it. Like no matter how Sony how well Sony did, Microsoft just needed to do well. Yeah. And they just just killed themselves. They just killed themselves. I'll never forget that. You know, now they're trying. They're back on track. No, they are, but it's because of different leadership and stuff like that. I mean obviously Don Matrick was just not the right man for that job and and like the you know and now he's over at Zinga and Zingga's you know tanking too but the you know the whole like I'll never I one of my favorite YouTube videos of all time not that I have a deep understanding of the YouTube ecosystem or anything like that but one of my favorite",
            "start": 1321.92
        },
        {
            "text": "but the you know the whole like I'll never I one of my favorite YouTube videos of all time not that I have a deep understanding of the YouTube ecosystem or anything like that but one of my favorite YouTube videos the video gamer uh video gamer does these awesome like spoof spoofs of um of press conferences and they did a really good one with Sony member drive club when they obsessing over the leather in the car and [ __ ] like that and they did one where it was just like they just got all the mentions it was TV sports and Call of Duty and just put it into one like reel and it's just so funny. It's all they [ __ ] talked about. Sports TV TV sports sports TV connect TV. It's like and everyone I remember I remember I remember watching that live and being like what are you doing? You know what I mean? Like oh my god. And then at E3 they kind of screwed it up again. And it wasn't until this last year that they kind of regained it with, you know, with new leadership and they get it more",
            "start": 1354.88
        },
        {
            "text": "what I mean? Like oh my god. And then at E3 they kind of screwed it up again. And it wasn't until this last year that they kind of regained it with, you know, with new leadership and they get it more now. But man, they for as well as Sony did, you have to give you have to give it to Microsoft. They totally dropped the ball. like they totally got picked off, you know? And I will give it to Microsoft though that their TV commercials are on point. Like they're they're marketing to the general consumer. They know what the [ __ ] they're doing. And it's like you can't watch a TV show without seeing some type of Xbox commercial coming on. And like so they're definitely they they're doing a great job of making every all the normal people that aren't like going IGN every day and doing all this stuff understanding Xbox. Like if I was just to ask somebody who's winning Xbox or PS4, I think the general person would think Xbox if they're not a gamer. Yeah. They're in the I mean, Xbox is still in",
            "start": 1389.36
        },
        {
            "text": "understanding Xbox. Like if I was just to ask somebody who's winning Xbox or PS4, I think the general person would think Xbox if they're not a gamer. Yeah. They're in the I mean, Xbox is still in the consciousness and they're still doing great. I mean, perspective and context is always important. We always talk about that. If you take PS4 and Xbox One, combine them in their numbers. They're doing 60% better than PS3 and Xbox 360 did in their respective first years on the market. So, that that's an incredible number. That means that just generally console gaming is healthy and both console manufacturers are doing well, you know, but PS4 is still hardly beating Xbox One, but Xbox One is selling better than Xbox 360 did at this point in it life cycle. And that's all they and that's all they could hope for. Just I wrote a story about that on IGN a while ago, you know, about like kind of pump your brakes a little bit. Like PS4 is doing great. It's an historic success, but Xbox One is",
            "start": 1428.8
        },
        {
            "text": "they could hope for. Just I wrote a story about that on IGN a while ago, you know, about like kind of pump your brakes a little bit. Like PS4 is doing great. It's an historic success, but Xbox One is actually the third fastest selling console of all time. It's just that PS4 is the first bestselling console of all time at that point. I think I think they actually fell behind Wow. So like context is important. They're both doing great. And if they both do great, competition is good for the end consumer. Um, and frankly, Xbox has way more exclusives coming out and which is weird and um and more promising exclusives that are announced, but Sony hasn't announced anything yet. So, we'll see. We'll see how that all goes. Well, there you go.",
            "start": 1462.88
        }
    ]
}