{
    "id": 606,
    "video_id": "TCgtVQHlJrw",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Metal Gear Solid Open World Remake - Kinda Funny Gamescast Ep. 06 (Pt. 3)",
    "description": "Kojima wants to remake Metal Gear Solid as an open world game.\n---\nWe quit our jobs, please support us here: http://www.patreon.com/kindafunnygames\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1423663201,
    "duration": 610,
    "transcript_chunks": [
        {
            "text": "[MUSIC] All right guys, next topic. Kojima wants to make a open world remake. Make of Metal Gear Solid 1. But, he says he's too busy. And he says that no other studio has\nstepped up yet. >> Sorry.\nIf you just heard scratching that was because Collin was scratching his\ncrotch. >> Sorry.\n>> He's got something on there. >> I have a little ketchup from my, my, my\nlunch. I have eggs and rice for lunch so >> It's happily placed right on top of\nyour penis. >> That's a good place. That's one of my favorite places, in the\nentire world. >> I forgot we're not doing the gog show. >> Oh, it doesn't matter. >> Okay.\n>> It's fun. >> Okay. >> Anyway, yeah, so he wants to do that. [INAUDIBLE]\n>> Yeah, well is it news? >> Well, exactly. >> Well, so far, he attached open, now\ndon't get me wrong, you know that I love Kajema, I'm not, you know, I love",
            "start": 0.0
        },
        {
            "text": ">> Yeah, well is it news? >> Well, exactly. >> Well, so far, he attached open, now\ndon't get me wrong, you know that I love Kajema, I'm not, you know, I love\nIlgersad, so I want this to happen. But in 2013 he made this announcement. He'd love another studio to work on it. In 2014 he talked about it again. Now, in 2015 here he is and all he's done\nis added Open World to it. >> Well, I think that's a, to me that's the biggest issue with this\nbecause I want him to do this. >> What's the big, what's the biggest\nissue? >> I, I definitely want a remake of\n[INAUDIBLE] one. >> Yeah.\n>> We already got it with Twin Snakes. His idea.\n>> And it was amazing. >> I really liked Twin Snakes. >> I loved Twin Snakes. >> A lot of [CROSSTALK]\n>> That's why I bought my game. [INAUDIBLE]\n>> So the first person broke it. >> Yeah. >> The grey fox ninja battle you just\nstood on one side of the office and shot. Some mother fucker by the way I said that,\non twitch, that it broke the grey fox battle you mean",
            "start": 40.51
        },
        {
            "text": "stood on one side of the office and shot. Some mother fucker by the way I said that,\non twitch, that it broke the grey fox battle you mean\nrevolver rasa, and I'm like no, granted same argument but\ngrey fox was really hard. The revolver was never hard, just running\naround the pillars with them. >> Yeah.\nBut now, they made it really easy. >> Exactly.\nYeah, you just stood in one spot and then, like, picked them up. But, the grey fox, I remember me and Pho\nplaying through the ninja battle forever. It was like sweat, like the giant beads of\nsweat. >> Yeah.\n>> As you're playing trying not to, and then like, in this one, yeah, I just run,\nlike, back into a locker, pop, pop, pop >> Yeah, exactly. But, and also, there's all the V O changes\nin the. And stuff, which I never had that big of\na, a deal with. And all the ninja acrobats and stuff. People, you need to calm the fuck down. >> Rob Paulson [INAUDIBLE] way. >> What?\n>> Rob Paulson was a ninja in that game. >> Really?",
            "start": 75.72
        },
        {
            "text": "a, a deal with. And all the ninja acrobats and stuff. People, you need to calm the fuck down. >> Rob Paulson [INAUDIBLE] way. >> What?\n>> Rob Paulson was a ninja in that game. >> Really?\n>> Gray Fox, I didn't know that either. So I, somebody tweeted at me about it. >> Huh.\n>> And I believe him. >> That's pretty awesome. >> Yeah.\n>> Anyways, I would love a remake on the, the new gen systems and stuff. >> Jesus, yes.\n>> [INAUDIBLE] Be a great play through for a lot of people that haven't played Metal\nGear One. Somehow. But.\n>> You're all monster. >> This open world idea. >> That's me. >> What the hell? That's what doesn't make sense to me. So, all right, MGS 5 is open world, cool. That's gonna be a new experience and\nstuff. You can't make Metal Gear Solid 1 open\nworld. Like, Metal Gear Solid 1 it's like\nResident Evil or it's like Metroid and all this stuff where\nit's like Shadow Moses was a thing. >> Yeah.\n>> Like you are in a building. [CROSSTALK]",
            "start": 109.21
        },
        {
            "text": "world. Like, Metal Gear Solid 1 it's like\nResident Evil or it's like Metroid and all this stuff where\nit's like Shadow Moses was a thing. >> Yeah.\n>> Like you are in a building. [CROSSTALK]\n>> Yeah, but are you remaking that? Like.\n>> That's what he's saying. >> It's a complete remake? Th, th, that doesn't exist, but yeah. >> Well, that's [CROSSTALK]\n>> We saying he'd love the remake to be made, but also be Open World. >> That would be awesome. >> And you're on Chatter Mose's Island. >> Yeah.\n>> It doesn't really make any sense though. >> I mean, you could have the facility and\nthen just be able to explore out into the island and have new\nbuildings and facilities. >> But that's [CROSSTALK].\nFor it to be Open World. >> I hear ya. I hear ya. I hear ya. >> That would, that would require. To be Metal Gear side one, plus all this\nother shit, and that just, it, it just makes no sense. >> But if you be like ground zeroes, where",
            "start": 141.64
        },
        {
            "text": "other shit, and that just, it, it just makes no sense. >> But if you be like ground zeroes, where\nyou're playing through one story, that's the story but then there's all\nthese little side missions to go do or whatever to go off on the side. And I'm not saying, don't, I'm not saying. >> Well.\n>> It's an easy sell, I'm with you. >> Yeah.\n>> That Metal Gear should be remade, probably just still be Metal Gear, but. >> Yeah I think, I,I think that, yeah. I mean, I, I agree with Tim. I, it doesn't make any sense. Unless, unless the game's totally\nrewritten. Because the idea, it's great that you\nbrought up Resident Evil. Very astute, I think, because it,\n[UNKNOWN] does remind me of the mansion in Resident Evil or the sh, or Ishimura in\nDead Space. Like, it's a place you exist in and go\nback and forth in, but it's not really an open world. Just a non-linear space like, like the\ncastle in Castlevania or something. It's, it's the, in Symphony of the Night",
            "start": 172.75
        },
        {
            "text": "back and forth in, but it's not really an open world. Just a non-linear space like, like the\ncastle in Castlevania or something. It's, it's the, in Symphony of the Night\nor something. It's the same thing you're back tracking\nall over the place. >> Yeah, it's like you go through the same\nthing multiple times. You're familiar with the area and it's\nlike oh, now you have this key so you can go\nthrough this door. Like you all these different things. >> I wonder if something was lost in\ntranslation with that. Like. You know, with him. >> Well, no.\nHe's he's, he's making an Open World Metal Gear now,\nright? >> He is, but, but, yeah, he is, but, but, he knows them just well enough to know\nthat that's not an Open World game so I'm, I'm wondering, like, what, you know, what,\nwhat the intent is, what he's saying. If he means- >> He's trying to entice people on it. No one's buying this pro, no one's buying",
            "start": 208.75
        },
        {
            "text": "what the intent is, what he's saying. If he means- >> He's trying to entice people on it. No one's buying this pro, no one's buying\nthis pitch he's selling. >> Well, look what happened to the last, look what happened to the last company\nthat, that made a, a Metal Gear game. >> Yeah.\nThey made one good game and then they kept screwing up. Nobody's biting on this, so now he's\ntrying to spruce up the deal. It's the like when you're trying to sell\nyour- >> [CROSSTALK] >> It's like when you're trying to sell\nyour friend Tim a vacuum. >> Uh-huh.\n>> And the conversations gone really cold after the first offer of\nbuying the vacuum. >> [LAUGH]\n>> And now you're like, you know what? I'll throw in an HDMI con, controller. >> Open world, open world vacuum. Wi-fi\n>> Yeah, I think, I think it is a matter of, of, pacing,\nright? Like the beauty of [INAUDIBLE] wich I\nthink is a better game, is the pacing of the game. >> Sure.\n>> How you run in, like, I can see in my head as clear as day",
            "start": 236.95
        },
        {
            "text": "right? Like the beauty of [INAUDIBLE] wich I\nthink is a better game, is the pacing of the game. >> Sure.\n>> How you run in, like, I can see in my head as clear as day\nhow you go through that game. And how you encounter the enemies in the\norder, when you encounter vulcan raven or something like that. Like, where it happens. And where it [UNKNOWN] >> Your first introduction to sniper,\nsniper wolf. >> Sniper wolf.\n>> [UNKNOWN] just talking. [SOUND]\n>> Or, when you see, when you see the most beloved of all Metal\nGear enemies, decoy octopus. let, let, let's not forget. >> I've heard of him, her- >> You know, like there's something\nspecial about him moving through that game in a certain way. You're able to back track somewhat, but\nnot always and, you know, it's about. It's, it's not like Mega Man where it's\nlike you go in any order you want. And that's the thing that disturbs me when\nit's. When it's, they're talking about an open",
            "start": 266.76
        },
        {
            "text": "like you go in any order you want. And that's the thing that disturbs me when\nit's. When it's, they're talking about an open\nworld Metal Gear game is that no, it's, it's Revolver Ocelot first, then it's\nVulcan Raven. You know, like you don't. >> Yeah, but couldn't they still do that? >> You don't do them in the other. No, because I feel like you're getting\nmore weapons and new weapons and different things. Like, the game works with a certain rhythm\nthat I don't think works. I actually think big shell would be\n[CROSSTALK] an easier place to do an open, like an open worldish game if you had\nmultiple. Shells. But even then, it would rewrite the game\nitself. Like, Metal Gear games ar not open world\nuntil four, or until five. >> Potentially, but I mean, aren't you. Open world is such a misleading term, because you are working your way through a\nlinear story. Like, most open world games have a linear\nstory. It's their main plot that you have to work",
            "start": 309.33
        },
        {
            "text": "linear story. Like, most open world games have a linear\nstory. It's their main plot that you have to work\nyour way through. Grand Theft Auto had, Fallout had it,\neverything has it. You're supposed to, you are achieving\nobje- Objectives one at a time and they are\ncoming one after each other. I still think you can base a game like\nMetal Gear off of that. But then you're right, you just have a\nbunch of crazy side quests that you probably don't need to do or you can\ngo do and they're just totally crazy and people are gonna spend millions of hours\nof doing them and having fun with it. >> Well, see but that's ground zero. Like that.\n>> Yeah. >> That is that. And that is the story that ground zero\nhas, that is very just kinda. Okay.\nThere's a very thing happening. >> Sure.\n>> And you gotta rescue this person. And that's it.\n>> Mm-hm. >> But with metal gear, it's like the only reason you're in this",
            "start": 344.45
        },
        {
            "text": "There's a very thing happening. >> Sure.\n>> And you gotta rescue this person. And that's it.\n>> Mm-hm. >> But with metal gear, it's like the only reason you're in this\nplace is to do this thing. And like outside of it. If there was weird. Like it'd be weird having side mission. In the story of Metal Gear Solid 1. >> We're trying to stop nuclear war. >> It's like.\n>> But, hey. >> But, hey, can you please find my\nmonkey? >> Yeah.\n>> He got away with my [UNKNOWN] >> You know what I mean? [LAUGH]\n>> Yeah. Yeah.\n>> And drummin's just chilling on the last\n[INAUDIBLE] >> You know they'll do something stupid. >> [LAUGH] But it, yeah, it just doesn't\nmake sense. It's hard but what do you make of Metal\nGear Solid one and [UNKNOWN] stuff. Pardon the ignorance. Does, does Arkham Asylum count as an open",
            "start": 375.42
        },
        {
            "text": "make sense. It's hard but what do you make of Metal\nGear Solid one and [UNKNOWN] stuff. Pardon the ignorance. Does, does Arkham Asylum count as an open\nworld? No, right? That's kind of a linear. >> Hm. >> Kind of more enclosed. >> That's like the mansion. >> Yeah. >> Arkham City. >> Open world. >> Arkham City is an open world game. >> But Arkham Asylum is. >> Is metra gaming. >> Is what my brain goes and that thinks,\nwishes you have sandbox. It's a little bit of a sandbox play\nenvironment, per each little moment and stage but your still kinda following\nthrough a linear path. You can go backwards, if you need to go\nget, new, cheap, like go get, bigger goals. You, you know level up and go back and get\nthat weapon you needed in the past. But it's not a true open world experience, maybe that's kinda what he wants to do\nwith it. >> [CROSSTALK]. no.\nI, I, I, I understand. >> How about if I throw in a cup of\ncoffee? >> I understand, I understand what you're",
            "start": 398.58
        },
        {
            "text": "with it. >> [CROSSTALK]. no.\nI, I, I, I understand. >> How about if I throw in a cup of\ncoffee? >> I understand, I understand what you're\nsaying. I, I think my bigger hang up is that I just don't think that Metal Gear Solid\nneeds to be touched again. Like, Metal Gear Solid's already been\nremade. So, move on. You know? Like, >> It really doesn't need\nto be. And, like, even if we just got, like. Recently we saw Resident Evil. Remastered. >> Yeah, that's what it's called. >> Mm-hm\n>> Yeah >> The remake, remastered. >> Yeah. >> If we just got Twin Snakes remastered, that'd be cool.\n>> Yeah, I, I would be absolutely fine with that as well.\nThe, the bigger hang-up with that is that Nintendo published that game.\n>> Mm, yeah. >> So. >> Bastards. So that's not gonna happen. >> [CROSSTALK]\n>> So this is, this might be. This actually might, this, we actually\nmight be getting to the core of the issue. Which might be that [UNKNOWN] wants a new",
            "start": 433.39
        },
        {
            "text": ">> So this is, this might be. This actually might, this, we actually\nmight be getting to the core of the issue. Which might be that [UNKNOWN] wants a new\nremake because he doesn't own the other remake. You know, so like he can't do anything\nwith it. I think Silicon Nights was funded by\nNintendo to do that game. >> Yeah.\n>> [UNKNOWN] produced it. >> He definitely loves putting out\nfreaking collections of metal gear. >> [CROSSTALK] >> And he loves, and he has like a random\nobsession with. With, with.\nI mean, he has a random obsession with a lot of\nthing, obviously. But, but he likes going back randomly to\nold games. I mean, they just patched trophies into\nfour last year, which is weird. >> Yeah.\n>> You know what I mean? So like, he, it might just be on his mind. Like, the original Metal Gear Solid just\nmight be on his mind as he makes this new game. But I would rather see. I really, I think Metal Gear solid two is\nthe best Metal Gear game. With that said, I never beat three and",
            "start": 467.41
        },
        {
            "text": "might be on his mind as he makes this new game. But I would rather see. I really, I think Metal Gear solid two is\nthe best Metal Gear game. With that said, I never beat three and\nfour, I got most of the way through, and I was like I can't stand this game. >> Oh, my.\nPeace Walker son. >> Three I didn't like, because it got too in to the weave, we've\ntalked about this many times. The games like way to in the weave. Like when I saw that my rations were\ngetting eaten, I was like what the fuck. Like I just want to, I just want to chill. Like, I don't want to be like, just leave\nme alone, let me do my thing. The camo and all this shit. Metal Gear Solid three rubbed me the wrong\nway, I always meant to go back. Can play though again. But two oh, two is so good. >> Game play wise. >> Oh, my god.\nThat game is so good. And I like to see them re-imagine that\ngame, remake that game. >> I, I would be shocked if that ever\nhappened. >> Yeah, exactly. It's the same thing I want, I want them to",
            "start": 501.25
        },
        {
            "text": "That game is so good. And I like to see them re-imagine that\ngame, remake that game. >> I, I would be shocked if that ever\nhappened. >> Yeah, exactly. It's the same thing I want, I want them to\njust bring Peace Walker to Vita, with trophies. And you know, that, that's not gonna\nhappen. >> I mean yeah, that, that should have\nhappened. >> It should have.\n>> I, I- >> The collection came out but it was just the PSP version- >> I can't believe that, and that's so\nupsetting to me. >> And on, and then on PS3, there is the\nversion with trophies. I said guys.\n>> Yeah, and I said, why didn't you just do this? >> Yeah.\n>> And he's like, oh, cuz you can download the PSP version. [CROSSTALK] It's like, well, that's not\nHD. That's not my [CROSSTALK]\n>> Yeah. My suspicion is that with Konami's limited\nresources that they saw, and Metal Gar's collection probably did not do\nvery well and beat them and so they were like there is\nno reason to do this [INAUDIBLE] again. >> Well, that's the thing is that",
            "start": 533.87
        },
        {
            "text": "very well and beat them and so they were like there is\nno reason to do this [INAUDIBLE] again. >> Well, that's the thing is that\ncollection should have had it. Cuz it didn't.\n>> At the get go, yeah. >> [INAUDIBLE]\n>> It should have had won too. Well exactly, and that's the other\nproblem. So far all the collections, they have all\nthe discs and all the stuff, except for one, and that's a download code of just\nthe original. Which is fine, but when all of the rest of\nthem look similar, or at least 2 and 3. So, I guess it's not all of the them. But, at least,they, they're all HD, you\nknow, they're all [UNKNOWN] but. Except for one, so a remake would be\ntantalizing. >> Tantalizing.\n>> Yeah. [BLANK_AUDIO]",
            "start": 567.6
        }
    ]
}