{
    "id": 13324,
    "video_id": "7nCqj65Ikz4",
    "show_name": "Highlights",
    "hosts": [
        "Cameron Kennedy"
    ],
    "title": "Kinda Funny 10 Year Anniversary Retrospective",
    "description": "Produced and edited by the amazing Cameron Kennedy http://www.twitter.com/CameronKen\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny: http://www.youtube.com/kindafunny?sub_confirmation=1\nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nGamescast Background Art by https://twitter.com/Orioto\nIn Review Intro Videos by: https://twitter.com/CameronKen\nIn Review Intro Music by: https://twitter.com/CarterHarrell\n\nListen To Our Podcasts On Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1735927500,
    "duration": 954,
    "transcript_chunks": [
        {
            "text": "Welcome to the GameOverGreggy show, live on Kinda Funny. Everything's happened way quicker than it was supposed to in the",
            "start": 1.98
        },
        {
            "text": "Welcome to the GameOverGreggy show, live on Kinda Funny. Everything's happened way quicker than it was supposed to this summer. We were sitting around outside IGN being like, \"When can we quit? Maybe a year or a year and a half,\" and then we quit six months later after that conversation. Then we're like, \"Well, maybe we'll be able to hire someone one day.\" Nine months later, we hired Kevin two weeks ago. There it is; that's Kevin. Everybody as much **** as you guys give me, I lived a **** dream. I've known Tim my entire life; I've never seen him quite this happy in this particular way, and it makes me so happy. This is Gia; this is Mom. Now that you're introduced, this is my girlfriend. So last week we did this crazy thing called Kinda Funny Live. Oh, I remember this, and it was a goddamn good time. It was fun. We knew going in it was going to be more than what people were expecting it to be, and now I'm like, \"I really do wonder what we\"",
            "start": 56.52
        },
        {
            "text": "funny live oh I remember this and it was a goddamn good time it was fun we knew going in it was going to be more than what people were expecting it to be and now I'm like I really do wonder what we could do next dude I'm calling it right now we're going to do it again next year oh this is going to be an annual thing and again I'm not confirming this I'm just saying like if everything I want to do goes to plan Kinda Funny Life 2 is happening where do you guys see yourselves in like 1 2 5 years for me at least the next goal post right as a studio I mean the hope would be we keep evolving as I'm sure when we start to grow the way we want to grow like I imagine the next Kinda Funny employee is in this room so if you don't know me my name is Joey Noelle and I'm the community manager here 2017 is all about Community first and foremost we've hired Kinda Funny's best friend Joey Noell to be our community manager our next announcement is Major we're hiring a full-time editor why",
            "start": 108.24
        },
        {
            "text": "here 2017 is all about Community first and foremost we've hired Kinda Funny's best friend Joey Noelle to be our community manager our next announcement is Major we're hiring a full-time editor why don't you have a v I have a 3DS it's your first GameOverGreggy sure is uh to be clear you're not going to be the fourth chair you weren't hired as an on-camera personality I do not want that we've had a lot of really cool announcements so far but none are as big as this one in my heart this community has just changed my life I'm not going to let you down straight up Kinda Funny folk I'm not going to let you guys down my family I'm not going to let you down my squad I'm not going to let you guys down most importantly Sasha Banks I ain't going to let you down either 10 years ago I was lucky enough to be a founding member of podcast one once we left and started Kinda Funny and immediately copied the podcast called it PS I love you XOXO but of course we wanted to go a bit bigger and so what",
            "start": 158.44
        },
        {
            "text": "to be a founding member of podcast on once we left and started Kinda Funny and immediately copied the podcast called it PS I Love You XOXO but of course we wanted to go a bit bigger and so what we're doing is now Kinda Funny Games Daily ladies and gentlemen for the first time ever please welcome all of Kinda Funny to the stage we're Kinda Funny and we've had a hell of a four years we quit our jobs made a bunch of shows in a spare bedroom won an award used your support to move into a state-of-the-art studio hired actual employees with health benefits won another award and brought on a whole bunch of co-hosts weren't we planning on announcing one more thing don't we have a new employee joining us because of all the best friends out there over the last couple years believe in what we do our ideal lineup looks most similar to what we're about to debut next week than it has to anything else we've ever done welcome to ScreenCast Kinda Funny's only entertainment",
            "start": 204.84
        },
        {
            "text": "in what we do our ideal lineup looks most similar to what we're about to debut next week than it has to anything else we've ever done welcome to screencast kind of Funny's only entertainment based podcast welcome back everyone I'm Nick I'm Andy and you're watching KF or I guess we could just call it the 48k CL I mean we're 48k baby you know what I'm saying we are Stratosphere I got Justa partner okay 3 two 1 so you got this guy Captain America and let me tell you this white boy can run right it's just a shot if I'm lying I'm dying do I not look like Spider-Man right now yeah you do kind of do the pie chart is always evolving nobody cares number one is Kevin this is kind of funny 4.0 our 4 year anniversary of doing this we have been paying our own paychecks it's for four years and and not just ours kind of funny is amazing it's every dream We've Ever Wanted come true we love it we're so happy to come to work every day we have Joey and we have Andy and we have Barrett and Greg",
            "start": 246.0
        },
        {
            "text": "and not just ours Kinda Funny is amazing it's every dream we've ever wanted come true we love it we're so happy to come to work every day we have Joey and we have Andy and we have Barrett and guess what one day I would love to have SnowBike Mike and I would love to have Roger Pokorny and I would love to have Blessing Adeoye where do you want to work I mean like you'll take anything but like a dream job I mean I would love to work for Kinda Funny if you came here what would your dream show be what would you want to do what would you want to make PS I Love You XOXO probably you want to do you want to bring back PS I Love You yeah what's up everybody Welcome to PS I Love You XOXO Volume 2 I'm one of your hosts GameOverGreggy alongside the okay Beast Blessing Jr best piece of advice I can pass off because it helps me whenever I'm standing somewhere where I'm like **** this is where I am right now good or bad you can find strength and resolve just knowing that this is what you want",
            "start": 304.04
        },
        {
            "text": "Off because it helps me whenever I'm standing somewhere where I'm like... this is where I am, right now, good or bad. You can find strength and resolve just knowing that this is what you want, everything that happens from this moment forward, you want it. 3, 2, 1. What's up everybody? What's up everybody? I'm Greg Miller, the CEO of Kinda Funny. If you haven't noticed, there's this uh pandemic happening, and so with that in mind, Kinda Funny is happy to announce that next week we're starting a work from home program, meaning that all the shows you're used to will be done at home. What's up everybody? Welcome to Kinda Funny Games Daily for Monday, March 16th, 2020; Friday, May 29th; Thursday, July 23rd; Wednesday, November 4th, 2020; Thursday, January 21st, 2021; and May 5th, 2022. Where am I in the grid right now? I'm over here... I'm over here. You got to look at you're talking to me right because you're looking at me right? Yeah, I'm looking at you right now. You're looking at me. Why is Soig",
            "start": 348.96
        },
        {
            "text": "Am I in the grid right now? I'm over here, I'm over here. You got to look; you're talking to me right, cuz you're looking at me right. Yeah, I'm looking at you right now. You're looking at me. Why is Soig everyone can turn on their cameras and everything will just adjust. There we go, it's adjusting. It's going there's Joey. I want to see same with the Mohawk. Yeah, but that's not funny. You know what I mean? Like that's just like oh look, that's one more look he can do with his beautiful hair. You know what you're right, Kevin [unintelligible]. Him go right down the C Gia. Oh, those look nice. Oh, they smell really good. They smell really good. Kevin, Blessing, it's well turn your camera off, Blessing. We're in the middle of unboxing cookies so as you guys can see we have our safety string here and we know that if it starts to slack we're getting too close to each other. What's up everybody? Welcome to the Kinda Funny podcast. It is our sixth anniversary. This is the end of our 12-hour stream. Big news, if anybody didn't watch.",
            "start": 412.72
        },
        {
            "text": "We're getting too close to each other, what's up everybody Welcome to the Kinda Funny podcast. It is our sixth anniversary. This is the end of our 12-hour stream. Big news if anybody didn't watch our streams: we hired two new full-time employees. We did the uh Skype Hangouts for the first time. We call up this guy, little-known man named Mike Howard - okay, goes by SnowBikeMike, don't know what that is, don't care. Pops on the screen doesn't even miss a beat. What's going on Kinda Funny best friends? It's your boy SnowBikeMike broadcasting to you live from beautiful Lake Tahoe. From that point on when Kevin says yeah Snowback Mike's happening I go this is going to be a good day no matter what happens today, the end of the today going to be a good day. Welcome back to another episode of the Kinda Funny Xcast - your home for all things Xbox here at Kinda Funny, of course. I'm one of your hosts SnowBikeMike and today I am joined by both of my gaming dads Roger Pokorny this kid he made a video",
            "start": 453.4
        },
        {
            "text": "of funny xcast your home for all things Xbox here at con of funny of course I'm one of your hosts SnowBike Mike and today I am joined by both of my gaming dads Roger Pokorny this kid he made a video about us leaving IGN turned it on and you're watching it and it's like holy **** this guy's awesome we should hire him actually that's a good point I'll hire him one day we are celebrating the sixth anniversary of Austin Creed's up up down down left right left right B A start Tim you couldn't be more wrong that was the lie I told all of you to get your cameras on I'm here to tell you that Jen's pregnant and I'm going to be a father what dude that's awesome I figured I wanted it on camera and I wanted you all here because of course you're my family we haven't been doing the show in person in 2 and a half years and you know I came here got to do this show for two and a half months and then I went home and it was really tough to like have my dream come true and get to do the show in person with you guys and have that taken",
            "start": 495.2
        },
        {
            "text": "came here got to do this show for two and a half months and then I went home and it was really tough to like have my dream come true and get to do the show in person with you guys and have that taken away by pandemic and being here feels right man and we're back this has been the culmination of three years of very hard work I'm very very excited to finally launch this thing and share this with the audience and let them see what we've been working on so until next time let's see the spare bedroom welcome to Kinda Funny Games Daily for Tuesday, October 18th, 2022 number seven on the rer report here we go today I'll be your narrator of The Fast and Furious World playing Adventure mecky looks at you and says that's okay I don't mind death you're not dying man back when I was a kid I used to cut off the pinky toe of my socks cuz I didn't like all the fluff that was there someone to like the bad water can you bring on Mike",
            "start": 547.6
        },
        {
            "text": "mind death you're not dying man back when I was a kid I used to cut off the pinky toe of my socks cuz I didn't like all the fluff that was there someone to like the bad water can you bring on Mike to talk about how we met Phil Spencer it's me and Paris we got flown down to Vegas we got to make a moment a memory some would say no it's it's good I mean the important thing is I'm not bothered by it yo what's up welcome to Game Showdown are you you baited me for the answer now you're screwing me over nobody typing in soap Mavish what are we doing let's walk it let's you know what it was I completely forgot about Mike's gift how do I explain SnowBike Mike oh oh you're you're smelling them you're not even drinking them ruining the **** P hey I'm not too pleased about it Roger I am willing to put my taste buds on the line for episode one of Kinda Munchies oh my God I'm looking at the camera going I look like this out the house looking like this exactly I'm going to investigate it what the",
            "start": 607.48
        },
        {
            "text": "my taste buds on the line for episode one of Kinda Munchies oh my God I'm looking at the camera going I look like this out the house looking like this exactly I'm going to investigate it what the **** just happened so she's looking at me I'm looking at her and I'm like get closer to me I might and now we're the let's talk about today's stories which include is E3 officially dead Microsoft completes its Activision acquisition day of the devs is now nonprofit We Are work from home for the next few days why well of course the one the only the engaged one at Tim Gettys is getting married on Saturday at the Kinda Funny studio Kev how are we looking uh good but actually now that I have everyone there I wanted to bring something up up really oh God are we doing an employee meeting right now we discussed for a while what to call our viewers we did it was right in front of us the entire time tell them what they are to us so the four of us yeah and all of you right you're our friends but",
            "start": 667.32
        },
        {
            "text": "we discussed for a while what to call our viewers, we did it was right in front of us the entire time, tell them what they are to us so the four of us yeah and all of you right you're our friends but you're not just our friends you're our best friends Almost 3 years ago I started this YouTube channel right was it that long ago and the idea was that I wanted a creative outlet and I wanted to make goofy videos with Colin I thought this would be cool to talk to him there it'd be fun to make this Oreo video I'd learn how to edit video and we'd all have I'd have I'd have fun and uh that happened but then along the way we all started getting more and more into the YouTube channel I love the job at IGN, I love the people at IGN, I don't think I'll ever not consider that place at home away from home but I don't know you we kind of hit a breaking point where we're like well let's just see what we can do let's just go take the step take the leap see if the audience with best friends out there will",
            "start": 729.16
        },
        {
            "text": "but I don't know, you we kind of hit a breaking point where we're like well let's just see what we can do, let's just go take the step, take the leap, see if the audience with best friends out there will actually help support us and will be there for us when we fall or I guess when we fly. Like we have a group of people out there that want to be a part of something from its inception and watch it grow. When you look here at everyone standing behind this table, what do you see? Yourself. Everyone came from the community cuz we are building this with you for the longest time. People have asked me like what what do I want to do like what's the goal what's the point of what I'm doing and I'm always just like I just want to be myself. I hope that one day my job can be being me. I know we talk a lot about about dreams and about how you guys help us make this has happened and I feel like after 3 years it it could get old and I know some people it has but not to you guys from the bottom of my heart",
            "start": 766.08
        },
        {
            "text": "about dreams and about how you guys help us make this has happened and I feel like after 3 years it it could get old and I know some people it has but not to you guys from the bottom of my heart thank you for letting Tim Gettys host and knowing that that's not about hosting Game Over Greggy or hosting The Daily Fix or hosting whatever it's just about allowing me to live my dream and to support whatever comes out of here we just talk about video games and try to get you to buy Vita you guys turn it into a community that supports each other through everything we'll never be able to repay you for listening to the message and believing in the message and spread the message we've all done so many amazing things and I think at the core of everything Kinda Funny's ever done is love and passion whether it's video games or movies or actual love with people seeing the energy and seeing the people that really care about what we do and have found best friends in the community the girlfriends boyfriends",
            "start": 804.48
        },
        {
            "text": "it's video games or movies or actual love with people seeing the energy and seeing the people that really care about what we do and have found best friends in the community, the girlfriends boyfriends fiances whatever found these connections in the community it's like oh **** what we're doing is working we need to keep doing it this is important right that's what Kinda Funny is this is what Kinda Funny is I don't mean the people in this room I mean the people who adapt to our message Kinda Funny is amazing Kinda Funny is best friends what that means is we are there for each other what that means is that you can go to any Kinda Funny live event you can go to an RTX you can go to a PAX and if you see someone in one of our shirts you can go up and talk to them you can go to dinner with them this is special Kinda Funny is this Kinda Funny is all the energy in this room Kinda Funny as four sometimes five best friends around this table thank you for",
            "start": 845.32
        },
        {
            "text": "can go to dinner with them that this is special Kinda Funny is this kind of funny is all the energy in this room kind of funny as four sometimes five best friends around this table thank you for continuing each and every day to prove over and over and over again that good people exist and they will share their love with other people that's why we get the opportunities we get is because people understand you they see what you do through us and that means everything that is what it's all about this is what we're talking about January 5th 2015 man I said we weren't building this for you we were building this with you you guys Inspire us tremendously in a way we can't even tell you",
            "start": 886.32
        }
    ]
}