{
    "id": 13458,
    "video_id": "8MwhJbWZbho",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Parris Lilly"
    ],
    "title": "Avowed Hypecast - Kinda Funny Gamescast",
    "description": "This episode is sponsored by BetterHelp — go to http://betterhelp.com/kindafunny to get 10% off your first month.\n\nGo to http://joinbilt.com/kindafunny to start earning points on your rent payments today.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1738182012,
    "duration": 3031,
    "transcript_chunks": [
        {
            "text": "What's up everybody Welcome to the Kinda Funny Gamescast for Wednesday, January 29th, 2025. I'm one of your hosts, Greg Miller, alongside the best voice in the business, Parris Lilly. Hello Paris, hello Greg, how you doing? I'm excellent, how are you? I'm I'm doing okay, I'm getting over being sick and I blame me being in the studio for getting sick. I've been sick since...and I want him getting a sinus infection. I appreciate that you blame the studio and not my sick son, the three-year-old that I had you around for dinner all night long 'cause that's why I'm sick, that's why my wife's sick, that's why my son is still sick. We have just that toddler; he just doesn't go away. Yeah, see over here, J best in the chat says or JT Besta. Greg has been six since 2023 and it feels like that at the house right now. It definitely feels like that. How are you? Are you okay? You okay? No, I'm okay, like I said, it turns out I got a sinus infection 'cause my wife has been mocking me for about a week going what is wrong with",
            "start": 15.62
        },
        {
            "text": "It definitely feels like that. How are you? Are you okay, you okay? No, I'm okay. Like I said, it turns out I got a sinus infection cuz my wife has been mocking me for about a week going what is wrong with your eye because one of my eyes is like swollen, it's been all red and just a freaking mess. So got a bunch of antibiotics, I'll be all right. See that's interesting cuz this is the whole thing we talked about on the show throughout the last week - there was a whole does Ben have pink eye or does he not? And it was like I was like \"he clearly does not have pink eye\" and then other people were like \"no, he does\" and this would make more sense cuz it's it never developed into pink eye but sinuses would make sense cuz he still has the boogies just like everybody you know how it is. But that's a three-year-old for you - you thought you were out when does it stop? Paris, you have adult children - it never stops, damn it'll never stop, you will go to your grave and it will continue, it never stops well that's not",
            "start": 68.56
        },
        {
            "text": "for you, you thought you were out when does it stop Paris? You have adult children; it never stops. Damn, it'll never stop. You will go to your grave, and it will continue. It never stops. Well, that's not what I'm buckled up for, and I'm going to have a good time. And it's more expensive than being sick. Everything you'll see, you'll see everything. Everything is more expensive. I don't like that one bit; I don't appreciate that one bit. But what I do like, Paris, is video games. That's why each and every weekday on the Kinda Funny Gamescast we talk to you about the biggest topics in gaming – whether they be previews, reviews, or hypecasts where we just want to gush about the things we're excited for. Uh, if you're excited to be a part of that, we love you, and thank you so much for it. You can watch live on Twitch.tv/KindaFunnyGames and YouTube.com/KindaFunnyGames. Listen on podcast services around the globe. If you're watching live, you have a special job; be part of the shenanigans by going to",
            "start": 107.0
        },
        {
            "text": "on twitch.tv/kindafunnygames and youtube.com/kindafunnygames listen on podcast services around the globe if you're watching live you have a special job be part of the shenanigans by going to youtube.com/kindafunnygames and super chatting uh right now of course we're going to be talking about Avowed I want to know if you're looking forward to Avowed why you are why you're not what's got you stoked who you're going to roll all that jazz while we talk about Obsidian's upcoming RPG, Avowed, while we're talking about us being all about you I want to give a shout out to all UPS all UPS in the twitch chat right before we went live was saying they just got a dog congratulations on getting a dog that's a lovely wonderful part of uh life I'm glad that worked out for you uh of course if you like us uh why not pick up a Kinda Funny membership over on youtube.com/kindafunnygames patreon.com/KindaFunny uh Apple or Spotify you can pick up the Kinda Funny membership to get all 20 of the",
            "start": 152.08
        },
        {
            "text": "us uh why not pick up a Kinda Funny membership over on youtube.com/kindafunnygames patreon.com/kindafunny uh apple or Spotify you can pick up the Kinda Funny membership to get all 20 of the shows we do each and every week that's nearly $80 a month you get them all ad-free you can get ability to watch The Afternoon Podcast live as you record them like today's Aliens in Review and I assure you you don't want to miss what Nick and I have planned and of course you'd also get your daily dose of me Greg Miller in a series we call GameOverGreggy uh some housekeeping for you of course we are an 11 person small business all about live talk shows you've already gotten Kinda Funny Games Daily today talking about the BioWare and PlayStation shakeups after this episode of The Gamescast you're going to get more Kingdom Hearts II with Mike on the stream of course you can catch those later on youtube.com/kindafunnygames podcast services around the globe if you're a Kinda Funny member you can",
            "start": 190.96
        },
        {
            "text": "to get more Kingdom Hearts II with Mike on the stream, of course you can catch those later on YouTube.com/KindaFunnyGames podcast services around the globe. If you're a Kinda Funny member, you can get today's Greg show about when it was time for me to leave the newspaper business and like I said, Aliens in Review this afternoon, which of course will be up with ads tomorrow on YouTube.com/KindaFunnyGames and podcast Services. Thank you to our Patreon producers Delany Twining and Carl Jacobs. Today we're brought to you by BetterHelp and Built, but we'll tell you about that later. For now, let's begin the show with what is and forever will be the topic of the show. This is your Avowed Hypecast, Paris. We've done hypecasts in the past, but we haven't done one in a very, very long time, so I think there's probably a few people here are like \"what the hell is this\" and this is basically a support group because Paris, I'm sick of checking my email looking for the review code for Avowed.",
            "start": 234.68
        },
        {
            "text": "think there's probably a few people here are like what the hell is this and this is basically a support group because Parris I'm sick of checking my email looking for the review code for Avowed, Avowed I cannot believe the hold it has on me we previewed it last year before what either I think November maybe it was December yeah it was November yeah previewed it there and it was that thing where I played it and I'm like oh man I like a lot of the stuff's going that's going on here I'll be interested to see if it pays off and since then it has never left my thought process every game I play when I sit down I turn on a system I turn on my PlayStation I turn on my steam deck I'm like whatever I'm about to play I'm like that'll be great but **** I really want to play Avowed because it just seems like such a nerdy ass RPG and of course we are so close now to the February 18th release date that I said you know what we've been talking about doing hype cast we haven't done one in 2025 it's time to",
            "start": 279.88
        },
        {
            "text": "such a nerdy ass RPG and of course we are so close now to the February 18th release date that I said you know what we've been talking about doing hype cast we haven't done one in 2025 it's time to do it for Avowed and just talk to my boy Parris Lilly about this Parris how excited for Avowed are you I'm man I'm very excited for it on on multiple levels um i' I've said for years that I wanted to see what Obsidian could do now that they're a part of Xbox and fully funded and they can do whatever creatively they want want and that's this is a vow this is the first opportunity to see what that's going to look like not to mention to what you just said it's going to be a nerdy ass RPG and going to Obsidian being able to sit down with the team and see how excited they are so jealous for a yeah I mean they're excited for us to be able to play this and I went we all went many years wondering what the hell was about going to be turns out it's a part of this Pillars universe and I have no idea about",
            "start": 327.4
        },
        {
            "text": "they're excited for us to be able to play this and I went we all went many years wondering what the hell was about going to be turns out it's a part of this Pillars of Eternity universe and I have no idea about anything pillars so this is my introduction into this universe so I really want to soak up all the lore that's going to come out of this and understand what this world looks like I'm very excited about the the various combat combinations of swords and guns and spells and all these crazy things that you're going to be able to do I want to check out these other regions in this world that we haven't seen yet that again talking to the people at Obsidian they're very excited for us to see what we have not seen already because they have so much in store for that the artwork that we've already seen such such a pretty colorful game not to mention you know when we first saw it it looked a little underwhelming right at that one showcase but then getting this preview and now it's on Unreal Engine 5 all of a",
            "start": 375.92
        },
        {
            "text": "such a pretty colorful game not to mention you know when we first saw it it looked a little underwhelming right at that one showcase but then getting this preview and now it's on unreal 5 all of a sudden you see that visual upgrade to it and it really pops on the screen as well so yeah I'm I'm absolutely hyped for this man I I cannot wait to to dive into this and you know we'll talk about it again for a review in a few weeks yeah I can't wait for that but I thought again I think so many times these games get with us and then we come out at review and talk about them there and our excitement for it I kind of like using this hype cast idea as a way is a a prep for everybody to get on the same page about what makes this game I mean honestly for me this is weird I'm using Andy's Contender but I would say literally a contender for what I think I I think this will be on my game of the year list by the end of the year based on the snippet we played and based on everything we've seen",
            "start": 421.68
        },
        {
            "text": "but I would say literally a contender for what I think I think this will be on my game of the year list by the end of the year based on the snippet we played and based on everything we've seen and I feel like it's interesting to dive into that cuz we do you know I want watched the developer direct from a while back I want to read some of the stuff here I want to watch some of the gameplay videos Obsidian on their YouTube channel has been putting up uh these little uh snippets of like introducing you to the world to the lore to the races all this stuff like there's so much content out there that you could totally blow by or have forgotten about or not know about that I thought it'd be interesting to try this out and see if the audience cares about it if it connects with us and or them the way it connects with us and so yeah absolutely yeah let's do it where I want to start for why I'm so stoked uh is PC Gamer over there Ted Litchfield had an article that's titled Avowed Newly",
            "start": 466.32
        },
        {
            "text": "The way it connects with us and so yeah absolutely, yeah let's do it. Where I want to start is why I'm so stoked uh is PC Gamer over there Ted Litchfield had an article that's titled \"Avowed\" newly revealed character creation backgrounds uh tripped my RPG sicko radar this is the headline offering funky fantasies like noble cion uh Court augur and Vanguard Scout uh first spotted by the gamer in a recent thread on X, the everything app uh Obsidian showed off the character creator for its upcoming first-person RPG Avowed which of course could be played in third person which we'll talk about in second Paris if you are uh in addition to demonstrating the gamut of appearance options like rainbow hair or mushroom frills, Obsidian also revealed all five potential character backgrounds coming to the game they go Arcane Scholar Court Augur Noble Scion Vanguard Scout and War Hero in the shared screenshots we can see the full description for one of these backgrounds, the noble Scion.",
            "start": 502.68
        },
        {
            "text": "they go Arcane Scholar, Court Augur, Noble Scion, Vanguard Scout, and War Hero in the shared screenshots. We can also see the full description for one of these backgrounds: The Noble Scion \"You were born to a Noble House of great influence, middling wealth, and questionable morals. When scandals and succession disputes saw your family cast down, you threw yourself on the Emperor's mercy, and he shielded you. Can'ty yet refined, you have become a formidable force at court and an invaluable ally to the Emperor.\" Avowed has a classless RPG system, meaning any character can invest into any combination of its Ranger, Fighter, and Wizard skill trees. But I dig the way these character backgrounds are sort of playing double duty to suggest a starting point for your characters' mechanical fantasy in addition to shaping them from the story and role-playing perspective, sort of like how Divinity: Original Sin gave you a starting point, like Shadow Blade or",
            "start": 546.68
        },
        {
            "text": "addition to shaping them from the story and the role-playing perspective, sort of like how Divinity: Original Sin gave you a starting point, like Shadow Blade or Wayfair for similarly skill-agnostic systems, going from top to bottom on a vow's list; the backgrounds are giving Mage, Cleric, Bard, Ranger, and Fighter respectively. Paris, for me, this was among the first things that made me go \"oh ****\" when we did the preview CU. For me, I've talked so much about this - where I love Starfield, I enjoy Dragon Age: Inquisition, of the Veil Guard; love Dragon Age: Inquisition, but I felt like The Veil Guard is such a great job with the backgrounds. Okay, cool, I can do this kind of thing. Starfield, I took so long to find who I was to then roleplay that game - the idea of getting in here and immediately having it; I have a screenshot from my preview where I can tell you the Arcane Scholar background right, 'cause they call this... if you don't understand why you'd be picking this.",
            "start": 594.08
        },
        {
            "text": "in here and immediately have it I have a screenshot from my preview where I can tell you the Arcane scholar background right cuz they call this this if you don't understand why you'd be picking this the game itself tells you this your background provides unique dialogue options and determines your starting weapon all equipment and abilities are available to you regardless of your background Arcane Scholars description which is what I picked on my preview goes like this after graduating with honors from Bragan's Academy uh you published a it's a literally a screenshot off my computer so hold on or TV uh you published a treaty eyes on Soul lineages uh that threatened the legitimacy and drew the eye of a local Lord when he had you arrested the emperor intervened and recruited you into the archives of your Imperial Court of the Imperial Court your mind is a bottomless well of occult knowledge legal precedent historic observation and poetry you've forgotten more than most people have ever",
            "start": 645.48
        },
        {
            "text": "of Your Imperial Court, the Imperial Court, your mind is a bottomless well of occult knowledge, legal precedent, historic observation, and poetry. You've forgotten more than most people have ever learned, like Paris Lilly these backgrounds jumping in; it's like what worked for me so much in terms of I'm going to be this character, whether it be my character Becky from Starfield, whether it was Rook and Veilguard. It really is wanting to have a narrative to then make the choices based on, and this being here so good, Paris Lilly, so good. Yeah, and that's kind of the thing: you can see the level of detail that they're going into these character backgrounds, and then the exciting part of that will be what you're saying if this goes into your decisions as you go through this game. How is that going to affect your interactions with certain characters? Who's going to be friendly with you? Who will disregard you? Enemies you might make just because of who you are and where you came from. I remember, pretty sure I was a",
            "start": 685.44
        },
        {
            "text": "with certain characters who's going to be friendly with you, who will disregard your enemies just because of who you are and where you came from. I remember, pretty sure I chose being a war hero as my background, but again, who knows what I'll do when we actually jump into the final build? That's exciting about having all these different options to use and what direction you want to go, because I think we'll see a lot of different water cooler conversations as a result, which is exciting too. This is a conversation me and Andy have had - we had it yesterday talking about The Veil (Guard) right? Excuse me, that we both started with these characters that we were so happy with, that the conversations played so naturally with, but when Andy went and replayed The Veil Guard, that's where he ran into... I made a different character, I gave him a different background, and so then this conversation didn't make sense or that choice didn't work because of why this worked so",
            "start": 730.48
        },
        {
            "text": "that's where he ran into oh i i made a different character i gave him a different background and so then this conversation didn't make sense or that choice didn't work back to why this worked so well for me in the preview it was making these choices and then getting to that first real dialogue conversation right there is a woman i believe it was in a cell you know trying to negotiate her out and it was hey i have like seven different dialogue options and they're bracketed of like oh this is because of your intelligence oh this is because of your race this and i was like oh man like this is what i want i want to get into the weeds cuz what i i was so the SpongeBob uh meme looking out at everybody having fun right of when uh uh uh Baldur's Gate hit and there was all these permutations and all these things and i just didn't like the gameplay first person you know basically first person RPGs in the vein of a Fallout or Skyrim or whatever like that is so my bread and butter that is what I",
            "start": 775.0
        },
        {
            "text": "all these things and I just didn't like the gameplay first person you know basically first person RPGs in the vein of a Fall Out at Skyrim or whatever like that is so my bread and butter that is what I love to play and to get that kind of thing here I'm so excited for it Parris yeah absolutely same and you know you touched on a little there will be a third person mode there for people that want to take advantage of that too I I dabbled around with it in the preview a little bit but I'm pretty sure I'm just going to go first person I think that's my preference yeah because that seems to be that fits my my gameplay style the most I think it also fits how they developed the game right when we were in preview and we're jumping in and out of it and somebody gave me a **** for looking at Greg doesn't use the share button this was preview code on a PC I didn't have my key bindings all right I'm sorry I couldn't get my share button to work right away uh is that idea of when I did jump to third",
            "start": 819.56
        },
        {
            "text": "use the share button this was preview code on a PC I didn't have my key bindings all right I'm sorry I couldn't get my share button to work right away uh is that idea of when I did jump to third person in the the demo we had which of course unfinished it didn't feel nearly as on point like maybe the final version would be different but like if Barrett if you want to throw up the first uh not the first link but my first link of the day what I would say the latest uh gameplay footage turned Heads This got posted to Reddit uh and it got a lot of love out there for what it is and I think it does such a great job of showing what the combat looks like in here right where it is here's third person which doesn't look bad whatsoever but when you're in first person and you have the bone air you have the sword and shield you have your magic wand you have dual magic wands you're doing all this different stuff like I think this is going to be such a fun game and even right there they talked so much in",
            "start": 860.92
        },
        {
            "text": "sword and shield you have your magic wand you have dual magic wands you're doing all this different stuff like I think this is going to be such a fun game and even right there they talked so much in what they've uh talked about in their previous things of being able to switch your loadouts on the fly like I'm stoked for this game and what these permutations are going to be Parris oh yeah same and and again going back to comments that Obsidian devs had made at Gamescom and then again during that preview period when we visited the studio they talked a lot about from a combat standpoint that you're going to see there's going to be some unique creations of things that they haven't even thought of yet internally at the studio like the one person made the what was it the Blood Mage or something like that that they just created on the fly when they were at Gamescom and that was just something fun to do but the fact that we're going to have all these",
            "start": 902.0
        },
        {
            "text": "now but it was the Blood Mage or something like that that they just created on the fly when they're at Gamescom and that was just something fun to do but the fact that we're going to have all these different combinations of weapons and magic spells and things that you're going to be able to use as a player I I love it because you're going to be able to experiment with that stuff you're not going to be locked into a certain class of this is who I am for this entire game if you realize halfway through it well I want to shift my play style over to this I want to start using swords I want to start using guns or I just want to be a full-on wizard Mage where I'm just you know zapping people with all these crazy spells you can do that in Avowed so I'm I'm very excited to be able to Tinker and play around with that stuff I want to go and watch the Deep dive with you of course this is the Xbox developer direct that had happened not the last one but the one before then it's a seven minute",
            "start": 943.04
        },
        {
            "text": "play around with that stuff I want to go and watch the Deep Dive with you of course this is the Xbox Developer Direct that had happened not the last one but the one before then it's a seven minute presentation I think it's a good refresher and a good jumping off point but before then I want to get some Super Chats in remember like I said be part of the show right in with why you're excited about Avowed what you think of it why you're not if it's not working for you what doesn't work for you uh Anakin JMT super chatting said been an Obsidian fan since KotOR 2 and I'm stoked plus it comes out on my birthday shout out to 2022 when I got Horizon Forbidden West and Uncharted movie on my birthday you're the first person ever heard thank someone for the Uncharted movie but I'm glad it was I'm glad it worked for you Anakin I'm glad that was there for you uh dolphin Corin says I love uh Path of Exile one and two so I'm or Poe yeah that's right PoE uh one and two so I'm excited for Avowed",
            "start": 984.2
        },
        {
            "text": "it worked for you Anakin I'm glad that was there for you uh Cory  says I love uh Path of Exile one and two so I'm or Poe yeah that's right POV uh one and two so I'm excited for Avowed and then Trevor says uh I'm not the type to cave on a special edition to get Early Access but yesterday with Game Pass I got the 20-ish dollar deluxe edition to get five days early I cannot wait oh and then while we're going uh Docs the fox writes in and says I have faith in Obsidian at least in the narrative I think they will crush it also shot it to the upgrade system Game Pass offers deluxe edition acquired so there you go Pillars of Eternity thank you Path of Exile on the brain you understand I'm a Diablo guy thank you very much for setting me straight everybody uh yeah let's uh I mean obviously there and I do want to talk about Obsidian's history obviously with Pentiment Grounded Outer Wilds whatever but like worlds uh but for now Barett run the Deep dive and let's watch and we can commentate we",
            "start": 1021.68
        },
        {
            "text": "and I do want to talk about Obsidian's history obviously with Pentium, Grounded, Outer Wilds, whatever but like worlds uh but for now Barrett Courtney run the Deep dive and let's watch and we can commentate we can stop we can do whatever we want welcome to Obsidian Entertainment I'm so proud to share with you our upcoming fantasy action RPG Avowed. Avowed is an adventure Into the Heart of the living lands a frontier at the edge of the known world where you must put a stop to a mysterious spiritual plague and discover a secret at the heart of the living lands at obsidian we love creating worlds with deep themes Dynamic gameplay and thoughtful reactivity and Avowed is no different we set out to blend the believable and Fantastical to give players a world and experience like no other it's colorful it's vibrant it's strange it's one of the most incredible settings in the world of Avow there's going to be a lot of great secrets to discover one of which has a really personal connection to you as the player",
            "start": 1060.96
        },
        {
            "text": "It's strange, it's one of the most incredible settings in the world of Avowed. There's going to be a lot of great secrets to discover, one of which has a really personal connection to you as the player character, and you're going to have a great time getting to know those secrets and leaving your mark on the world. And when it comes to encounters, our combat brings the best of the moment-to-moment fun that comes with action-oriented gameplay, and the depth and breadth of choice that you get with an RPG. Here to talk more about Avowed's combat is Gabriel Parra, gameplay director here at Obsidian. Our team's overarching goal is to empower you with choice, so we'll have a flexible combat system. That's what I want to hear. Empower you with choice. I again like this is what I want out of these kinds of RPGs. He's about to go into talking about combat and switching up the loadouts, which I think is so cool. But for me, Paris, it's the choices in the narrative, the decisions of who I'm leaving behind, who I'm taking with me.",
            "start": 1122.12
        },
        {
            "text": "go into talking about combat and switching up the loadouts which I think is so cool but for me Parris it's the choices in the narrative the decisions of who I'm leaving behind who I'm taking with me that's what I'm honestly feel like in the RPGs I've been playing lately I'm so thirsty for yeah go ahead peris the best like we keep talking about these nerdy RPGs the best RPGs give you that flexibility so that you're creating these branching Paths of not everybody when you go and play a game play an RPG game is just doing the same exact thing it's the fact that oh man I made this Choice oh crap that happened to you well oh man I made this choice and all this Happ happened to me that's the exciting thing that I think a about's going to be able to bring to the table I think that's the comparison to make right for me and everybody knows how much I loved Starfield and how much I enjoy Starfield and still love it to this day but it was that you know disappointment of starting Starfield",
            "start": 1171.28
        },
        {
            "text": "to make right for me and everybody knows how much I loved Starfield and how much I enjoy Starfield and still love it to this day but it was that you know disappointment of starting Starfield that first time and going into Constellation HQ and starting to shoot people there and then being like ah stop whatever and they wouldn't die like ah that sucks and I understand that's a Bethesda RPG that's the narrative they're telling they're doing something very specific there uh but even to jump to Shattered Space right where you get to the ending of Shattered Space and you make a choice there right of who you go with who you put in charge y y and I've heard no one talk about that decision I can tell you in the big decision what I did but in terms of who I turned the land over to or whatever I don't remember like that wasn't impactful because those people didn't matter to me I'm hoping what we get here is a narrative and backbone and an Avowed that makes me feel like it and we're going back to the",
            "start": 1214.4
        },
        {
            "text": "remember like that wasn't impactful because those people didn't matter to me I'm hoping what we get here is a narrative and backbone and an Avowed that makes me feel like it and we're going back to the dev direct I swear but something that was so cool I thought in the preview was how fast they gave you the stakes and dropped you into the game where it is the Emperor is sending you out there you have to go out there into uh the living lands and deal with this Dreamscourge figure out go do it right and of course I already know my relationship to the emperor because in character creator I chose the backstories I just read through and every one of them involves the Emperor why you're there so to get you there get you off and get you off in the adventure I'm very excited sorry even even before you continue so one thing that Carrie just talked about at the very beginning and you just said was the living lands itself and again I don't I don't know the Pillars universe so this is all new to me",
            "start": 1253.0
        },
        {
            "text": "continue so one thing that Carrie just talked about at the very beginning and you just said was the living lands itself and again I don't I don't know the Pillars universe so this is all new to me so that's again as a part of the excitement is discovering these new biomes and areas and worlds that I I know there's fans of it that they're going to be very familiar with them but as a new player coming in yeah I I love this I love discovering something brand new and not knowing what to expect you know when you go into these worlds so and we saw a brief glimpse of that just just in that initial Deep dive um there's going to be a lot of biome diversity there as well so very exciting to see all right sorry bear back to it you're killing a bear good job that allows you to quickly swap from spellcasting and sharp shooting to melee combat we want to give you the freedom to mix and match your Loadout to fit the way you want to play from moment to moment uninterrupted for all battles you can",
            "start": 1295.08
        },
        {
            "text": "and sharp shooting to melee combat we want to give you the freedom to mix and match your loadout to fit the way you want to play from moment to moment uninterrupted for all battles you can combine a variety of weapons attacks and abilities for tactical advantages against a wide range of enemy types it's not just hacking and slashing you're making real-time decisions about when to use your abilities powerful melee attacks blocks parries and special attacks if you choose to approach combat with a one-handed wand it feels quick and snappy when dealing damage to enemies at mid-range using the tangle foot ability you can stop enemies in their tracks giving you the opportunity to focus on weaker or tougher combatants in an intentional and controlled manner it's important to pay attention to the types of enemies you're dealing with some units are extremely defensive some are brutishly difficult and others you must make sure you prioritize or their healing capabilities in a tough spot to help",
            "start": 1337.12
        },
        {
            "text": "types of enemies you're dealing with some units are extremely defensive, some are brutishly difficult, and others you must make sure you prioritize or their healing capabilities in a tough spot to help with the different encounters you will face. We provide customizable loadouts that can be quickly switched during combat, which means you can play however you want: equip a sword and shield and charge into battle, dual-wield pistols and control the encounter mid-range, or even dual-wield wands to feel like a gun-slinging mage. You could use your enchanted wand to freeze enemies and then use your off-hand weapon's power attack to shatter them. We've worked hard to keep you constantly engaged as battles unfold by creating a balance between pressure and manageability during combat. Players will have ample choices for how to build and progress their Envoy in the world of the living lands as they get to know the game and the story and explore the many diverse regions. Can you pause on that real quick, who do",
            "start": 1386.28
        },
        {
            "text": "for how to build and progress their Envoy in the world of the Living Lands as they get to know the game and the story and explore the many diverse regions can you pause on that real quick who do yeah just going back to the combat stuff I heard you mention in there I gave a look I did encounter a dude at one point with that had the big shield and yeah it was a pain in the ass trying to beat that dude you had to actually you could like like he like he's saying you couldn't just hack and slash your way through it you actually had to be be a little more thoughtful about your approach to that enemy to get a shield down get your blows in and then just they talked kind of about just about um the ease of use of mixing and matching in the combat I don't know about you when you were in the preview but it felt intuitive enough that it it took me a second to get used to it but once I did and it clicked very easy to to to go in there and manipulate do I want to be one-handed or two-handed",
            "start": 1432.96
        },
        {
            "text": "but it felt intuitive enough that it took me a second to get used to it, but once I did, and it clicked, very easy to go in there and manipulate - do I want to be one-handed? Do I want to be two-handed, dude? Um, I'm forgetting... pull out the spell book. Am I doing the one-and-like all of that made sense to me from a combat perspective in first person. So again, I think the combat is going to be a lot of fun; I think people are going to come up with some unique combinations out of that. And yeah, I can't wait, man. 'Cause yeah, some those some of those enemies are not easy... like I even remember when I played it at Gamescom one dude I ran into he was almost like a mini-boss, I guess right? Oh yeah, I was dying left and right because I didn't know what the hell I was doing but that was the point; it wasn't just easy. So the two things to piggyback off of that for my number one... my preview was way too boring and I didn't... I it was I didn't tinker enough, enough. I want I spent so much time on",
            "start": 1474.6
        },
        {
            "text": "it wasn't just easy and so the two things to piggyback off of that for my number one my preview I was way too boring and I didn't I it was I didn't Tinker enough enough I want I spent so much time on Character Creator and all that jazz and then getting in there I kept it really sword and shield and I think at the very end was using a spell book and so I didn't I did not mix and match the way I want to that in the final game or when we actually get going on it right so I'm looking forward to really getting deep into that experimenting with that the pistols look great and I never even touched those or did anything with that uh the flip of it though when they show uh the tangle spell and catching the dude there to work on an ad or work on a heavier thing the main thing I would like out of my entire Avowed experience is for it the combat never to become too easy isn't right brain dead I guess and what I mean by that is as much as I love Starfield and continue to play it when they drop new",
            "start": 1518.12
        },
        {
            "text": "entire devout experience is for it the combat never to become too easy isn't right brain dead I guess and what I mean by that is as much as I love Starfield and continue to play it when they drop new DLC I'm I'm I'm a God like nobody can stop me every gun I have like no matter what you give me a 99 level guy to fight he's down there's never a threat of death like I hope this is going to to continue to challenge me as we go and not get to that point where I feel like okay cool I'm just blitzing through everything one of the things uh in the chat here uh the public chat uh yelling I believe it was over on YouTube said from what you guys play uh what you guys played did you enjoy the combat more than the combat in The Outer Worlds uh I've gone back and started I did start a new playthrough of The Outer Worlds of course I I reviewed it back when it launched started a new playthroughs I've been sitting here jonesing for Avowed or whatever and I I stopped very early I I did like two or",
            "start": 1560.48
        },
        {
            "text": "of The Outer Worlds, of course. I reviewed it back when it launched; started a new playthrough. I've been sitting here jonesing for Avowed, whatever, and I stopped very early – I did like two or three nights with it, or whatever. I enjoyed it; no shade to it, but my problem was that oh this just feels like Fallout, which also just feels like Starfield, so I'm just doing the same thing. Yeah, you're with me on that, Parris? Yeah, 100% yep. And so yeah, I'm craving this – this combat is new, obviously; it's first-person hacking slash and magic not, and there's nothing new under the sun but again in the way you're changing loadouts which I didn't get to really experiment with that's new to me. And again, I know I use this all the time – not in the actual feel of it but in terms of the freedom of it; it reminds me so much of Kingdoms of Amalur, which I loved so much using my glaive or using my sword or whatever, so to get in here and",
            "start": 1609.0
        },
        {
            "text": "in the actual feel of it but in terms of the freedom of it it reminds me so much of Kingdoms of Amalur which I loved so much in using my glaive or using my sword or whatever so to get in here and really pick a character and then be like well what would this character with this background use what would they be like I'm very excited for yeah same completely agree sorry back to the video Barrett will have you make decisions with profound consequences like this side quest you'll explore the third region of the living lands as you're exploring you come across the bodies of these fallen soldiers and as you explore the remains of the battle it's up to you to determine who if anyone is at fault just the four of us Manu, Kiri, Nai, and me training under Captain Rui trying to keep Thirdborn safe in other words you're a gang of Vigilantes not that I'm one to judge here take my badge take everyone's our families deserve to know we fought and died for them",
            "start": 1652.6
        },
        {
            "text": "Rui trying to keep Third Born safe, in other words, you're a gang of vigilantes. Not that I'm one to judge here; take my badge, take everyone's. Our families deserve to know we fought and died for them. Making the right choice isn't always what it seems. We Embrace moral nuance and gray areas, trusting players to make tough decisions in complicated situations. Yes, my squad and I rested in the cave by the water last night, and as we were sleeping, we were ambushed by those miserable Zorbs. I was so surprised, and it was so dark; I just got separated from everyone else. Look, I... I... can't face those monsters alone, but I have to know if anyone else made it out. Of course he did. Sergeant Asui never has a thought he won't say out loud. So what did he tell you? That Captain Rui was sick; that I was paranoid; that I was a dumb baby, dumb baby. I heard it all often and loudly. Wait, if you found Sergeant Asui, why is he not here with you? What happened at the end of the quest? You have a choice when you confront.",
            "start": 1702.6
        },
        {
            "text": "that I was a dumb baby, I heard it all often and loudly. Wait, if you found Sergeant Issei, why is he not here with you? What happened at the end of the quest? You have a choice when you confront Private Noi: if you believe the story he's told you, you can hand over the badges and let him go back home. You're right; real battle isn't something you can prepare for, is it? It's not my fault; no, they should have never camped in the cave. I'll take the badges; I'm going back to Thirdborn. But if you confront him, if you believe that he fled the side of the battle as an act of cowardice, then he might challenge you to a fight to reclaim his honor. Either way, when you return to town, you'll see the consequences of your actions and the choices you made during this quest. Creating an immersive experience like Avowed is anchored in the world we build; Art Director Matt Hansen and the team have worked to create a unique, colorful, and dynamic visual style from the outset. We knew that we wanted",
            "start": 1759.68
        },
        {
            "text": "experience like a vow is anchored in the world we build Art Director Matt Hansen and the team have worked to create a unique, colorful, and dynamic visual style from the outset. We knew that we wanted an Avowed setting to feel rich, weird, and wonderful. We found inspiration in a wide swath of real-world cultures helping us create a unique RPG experience by contrasting the vibrant with the dull or verdant spaces with sickly ones. We can better deliver complex emotional experiences for our players. The Living Lands is a continent of untamed valleys with widely varied biomes from luxuriant forests to volcanic wastes, and each of those regions itself is a conflux of storied landscapes. All of the regions have a lot of special things associated with them, but I have a deep place in my heart for Shattered Scar. As you're wandering the wastes of Shattered Scar, you might notice off in the distance a vibrant jewel of color by transitioning from destitute, muted tones of a wasteland of sand and marching in towards",
            "start": 1808.96
        },
        {
            "text": "you're wandering the wastes of Shattered Scars you might notice off in the distance a vibrant Jewel of color by transitioning from destitute muted tones of a wasteland of sand and marching in towards a beautiful Oasis there's the opportunity there for life for adventure and even a little danger we hope you've enjoyed this look at Avowed we're thrilled to share more about the game in the coming months enough that we're rewatching and making more content about it you can cut it there thank you so much I'll let wait till it finishes sure what do you got from Paris no but I I would just say when even when Matt was just talking right now because I got to speak to him and couple other people from the art team when I was there and it's just the excitement on his face for that basically we haven't seen **** yet when it comes to the world of of of Avowed all all the stuff that we're going to see and just the love and care that they put into the art design and the level design um of this the",
            "start": 1866.36
        },
        {
            "text": "seen **** yet when it comes to the world of of of Obsidian's out of all all the stuff that we're going to see and just the love and care that they put into the art design and the level design um of this the living lands I guess it's what it's called right so that again like I said before it gets me excited to see that people that making the game are excited for us to do it like there was no worry or oh I hope you really like it they're like Oh no you're going to love this when you get it so yeah I can't wait man I can't either and like my hope is you know that I there's I want to talk about the length of it cuz that's been a big topic of conversation right that is Outer Worlds length so that could be like 13 hours for main quest 2630 or whatever with everything blah blah My Hope Is that I enjoy it so much that when I roll credits I immediately go and start a new character and do it different you know what I mean make all the choices I didn't do because I feel like so many of the RPGs we play",
            "start": 1918.0
        },
        {
            "text": "so much that when I roll credits I immediately go and start a new character and do it differently, you know what I mean? Make all the choices I didn't do because I feel like so many of the RPGs we play these days - for me personally, not casting this on anybody else - is that I go through, I have my canon playthrough, and then I'm like, \"I don't have another 60 hours to go run this again.\" I'm happy with what it is. And I will talk to Andy, I will talk to Parris, I will find out what would have happened if I went A or C rather than D, like I did. So we'll see. But yeah, we'll see. And I guess what I heard comments seem to be about - you could probably do this in about a 25 to 30 hours if you really wanted to. But you're encouraged to go off the beaten path and discover side quests and do things which you know increase the length of it. But there's also replayability, exactly what you're talking about, create another character, try something else, make a different decision, see where it takes you that",
            "start": 1962.2
        },
        {
            "text": "the length of it but there's also replayability there to exactly what you're talking about create another character try something else do make a different decision see where it takes you that type of thing so I'm looking forward to it and again I don't need a 100 hour RPG to be satisfied if it winds up being 30 30 40 hours I'm good you know and you know the preview we did again going off the beaten path going you know you want me to go right I'll go left it was oh there is a treasure chest there is an enemy encounter there is something going on here you know Destin's uh preview talked about running into a spider boss and all these different things in there there's tons of things to do and I want that as well but absolutely what I also want is you to support us remember we're an 11 person small business all about live talk shows about video games you already got Games Daily today you're listening to Gamescast now you're going to get a stream after this if you want to be a member you",
            "start": 2004.36
        },
        {
            "text": "small business all about live talk shows about video games you already got Games Daily today you're listening to Gamescast now you're going to get a stream after this if you want to be a member you could watch Aliens in Review after that of course that's what we're all about the membership here at Kinda Funny if you go to patreon.com/KindaFunny youtube.com/KindaFunnyGames apple or Spotify you can pick up a Kinda Funny membership and you can get all of our shows ad-free get good karma for supporting recording a small business watch The Afternoon Podcast live as we record them and of course get your daily dose of me Greg Miller and a series I call \"Greg Way\" but right now you're not using your benefits so here's a word from our sponsor this episode's brought to you by Built if you're a renter I'd start taking advantage of Built if I were you here's the thing we earn points on groceries travel and practically everything else we buy but we should also be earning points on rent one of",
            "start": 2043.96
        },
        {
            "text": "Renter, I'd start taking advantage of Built if I were you. Here's the thing: we earn points on groceries, travel, and practically everything else we buy. But we should also be earning points on rent, one of our biggest monthly expenses. Built changed the game by letting renters earn high-value points on rent and around their neighborhood. There's no cost to join Built, and as a member, you'll earn valuable points on rent and your everyday spending. Built points can be transferred to your favorite hotels and airlines, and even the ones you haven't heard of – there are over 500 airlines and 700,000 hotels and properties around the world. You can redeem your Built points toward points, or also redeem them toward a future rent payment and unique experiences that only Built members can access. So if you're not earning points on rent, my question is: why not start earning points on rent? You're already paying it by going to join.built.com/kindafunny – make sure to use our URL so.",
            "start": 2080.16
        },
        {
            "text": "earning points on rent my question is Why not start earning points on rent you're already paying by going to joinbilt.com kindafunny that's joinbilt.com/kindafunny make sure to use our URL so they know that we sent you there joinbilt.com/kindafunny to start earning points on your rent payments today this episode's brought to you by BetterHelp what do you want your 2025 story to be every January brings you 365 blank pages waiting to be filled in in 2025 maybe you're ready for a plot twist or maybe there's part of your story you've been wanting to revise life isn't about resolutions that fade by February it's about picking up the pen and becoming the author of your own life think of therapy as your editorial partner helping you write new chapters and create the meaningful story you deserve to live some of my best friends use BetterHelp and they love how helpful it can be for learning positive coping skills and how to set boundaries it empowers you to be the best version of",
            "start": 2124.04
        },
        {
            "text": "you deserve to live some of my best friends use BetterHelp and they love how helpful it can be for learning positive coping skills and how to set boundaries it empowers you to be the best version of yourself it isn't just for those who've experienced major trauma if you're thinking of starting therapy give BetterHelp a try it's entirely online designed to be convenient flexible and suited to your schedule and it serves over 5 million people worldwide Write Your Story with BetterHelp visit betterhelp.com kindafunny to get 10% off your first month that's betterhelp.com/kindafunny BetterHelp.com KindaFunny with all this downtime Paris between the preview and the review and I've had so much time to sit there and go goddamn I wish I had this game one of the things I've been trying to psych myself up for that I just don't think I can do is the Godlike features uh we talked about this in the preview uh it's it's obviously hinted at in the cover art of it um your character is",
            "start": 2172.76
        },
        {
            "text": "psych myself up for that I just don't think I can do is the Godlike features uh we talked about this in the preview uh it's it's obviously hinted at in the cover art of it um your character is Godlike you've been touched by a God here and what that means is that you are I would say what quote unquote I think they call it disfigured in the game where you have like The Last of Us mushroom growing on your head uh it is a thing you when you're in character creator you have a million different options for it and you can turn it off where you won't see it your character won't have it but people will still comment as if you do and I was shocked during that preview how off-putting I put it after so much Last of Us content and clickers and everything else I just couldn't deal with it and I had to click it off and I had to just ride with a normal look a quote unquote normal looking person uh or character whatever class I even was uh and then just have them about it I've been trying",
            "start": 2221.48
        },
        {
            "text": "I had to click it off and I had to just ride with a normal-looking person, uh, or character, whatever class I even was, uh, and then just have them about it. I've been trying to psych myself up to actually have it in this but I I don't know if I'm going to be able to do it, Parris are you doing it? What are you doing with the God of War? I'm I'm doing it 'cause I did it uh when we did the preview and just embrace it, man. You know I I I thought I looked pretty good so I'm I'm going to go for it. Put all the mushrooms and flowers you can on me. I I I'll make it work. I'll try. I don't know. I'll see what I can do but I don't know. It's it's... I not only do I I'll see what I can do, but no matter what I really love that narrative decision and that commitment of like this is what separates you in this world, this is why you have special abilities other people don't have, and for so many people this is not a good thing. They don't look at you and go, \"Oh wow, you're a superhero.\" They go",
            "start": 2267.52
        },
        {
            "text": "you in this world this is why you have special abilities other people don't have and for so many people this is not a good thing they don't look at you and go oh wow you're a superhero they go oh my God like you're a freak get away from me I love that storytelling feature of it again this is what I'm saying I'm I'm ignorant to the Pillars Universe so I'm excited to see how all that lore plays out and why being Godlike you know is is a good or a bad thing you know to certain people in the world uh Greg splits on super chats I want to get some of these going because we have so many thank you so much and says do you care about the lack of romance Parris are you upset you won't be getting married in this game I mean it's not Mass Effect I'm not Commander Shepard trying to hook up with everybody in the universe so it's fine it's fine I mean if it was there cool I would probably embrace it but it's not like a deal breaker for me that I'm not Romancing characters which by the way if I could",
            "start": 2311.08
        },
        {
            "text": "in the universe so it's fine, it's fine. i mean if it was there cool, i would probably embrace it but it's not like a deal breaker for me that i'm not romancing characters which by the way if i could pause real quick we'd talk about during the deep dive is the ability of the Companions and utilizing them in combat as well so i'm going to love to see the different combinations depending on the companions that i have with me at any given moment how you utilize them in combat so again just another layer to what they're going to be able to bring to the table with it yeah uh you know for me what's interesting is i i agree with Imran Khan on a hot take Gamescast a while back had made the point that his hot take was romance in video games is is always bad like it's not good and even as somebody who is in a loving committed relationship with Andre Jen Starfield I could run through everybody else i've partnered up with in other games i kind of tend to agree with that that i think",
            "start": 2352.96
        },
        {
            "text": "as somebody who is in a loving committed relationship with Andre Jen Starfield I could run through everybody else I've partnered up with in other games I kind of tend to agree with that that I think romances are often forced in video games and are often very unnatural as you choose a dialogue option that leads to this but then this is that I mean like there's so many aspects that you have to like write for depending on how you play it that like it doesn't really feel like anyone one thing you choose or any one person that you choose in a relationship system is going to be very like satisfying or I don't know rewarding in any sort of way right 100% right where it's like I understand doing it for the story options and the comedy but I think camaraderie is so much more natural if that makes sense versus a romance right where I think even for Starfield Barrett is such a great companion in that just like he is in real life Barrett uh so funny so clever whatever and it's like I'm",
            "start": 2398.2
        },
        {
            "text": "where versus a romance right where I think even for Starfield like Barrett is such a great companion in that just like he is in real life Barrett uh so funny so clever whatever and it's like I'm not romantically interested in him but I do want to have a beer with him and ride you know throughout the Galaxy shooting stuff up and I feel like with them doing so much stuff here in terms of your companions who you're going to have you know having the Gondor's Condor has the Sophie's Choice question Paris pick one Avowed or South of Midnight that's not fair I can't I'm that no that's my answer no no you got to do it we all love both",
            "start": 2444.16
        },
        {
            "text": "what's see uh Condor has the Sophie's Choice question Paris pick one Avowed or South of Midnight that's not fair I can't I'm that no that's my answer no no you got to do it we all we love both these games I'll do it I mean yeah I haven't seen I've only seen well well then here's what I'll say here's what I'll say because I'm being a bit biased on this South of Midnight because they're representing the Deep American South and that is where I'm from so I'm excited to see all the lore and the legends that will come out of South of Midnight and ToT to Tom and that pig there you go fair enough that's why I'm picking Avowed of course because they got Godlike features just like me no uh I am picking Avowed I I South of Midnight looks great and I can't wait and that's definitely a Greg game I can't wait to see it play it uh but AOW I've just been frothing at the mouth for so long to get into a nerdy **** RPG world where my choices will matter and yet I mean I mean being serious for a",
            "start": 2486.88
        },
        {
            "text": "I've been frothing at the mouth for so long to get into a nerdy, deep RPG world where my choices will matter. And yet, I mean, being serious for a second is legitimately just both – I want to play both of these games; I'm very excited to play both of these games, which you know in the grand scheme of things, good on your Xbox, you're finally hitting like the dominoes are falling. I mean, like, one thing we haven't talked about is what if we're wrong? What if A (Avowed) isn't great? Like, what if the trust I don't feel is misplaced from what we've played, and then of course the track record – I'm just going with more imminent releases right now. From Obsidian, got an 86 on Metacritic, Grounded had an 83, Outer Worlds 85; we can go back to KotOR 2, of course, we can go back to Fallout New Vegas, we can go back to South Park – like Obsidian is a great developer, and I'm expecting great things here, but I really hope I'm not wrong.",
            "start": 2533.76
        },
        {
            "text": "back to cotor 2 of course we can go back to Fallout: New Vegas we can go back to South Park like Obsidian is a great developer and I'm expecting great things here but I really hope I'm not **** wrong yeah obviously I hope I'm not wrong either and and again we're obviously going by by reputation again what we've already played and what we've already seen it just it it made me even more excited about it because you know like when I talked to Carrie I told her straight up I was like I didn't know what the hell this game was I was very skeptical of this until I actually played it and I'm like now I get it now it makes sense to me what do you think uh Metacritic is gonna be on this one I could see 85 yeah man I'll be so be so happy I mean potentially could hit 90 I mean we we'll see damn Paris damn look look you're asking you and I we're we're the Indiana Jones guys so the hell do I know who knows what the **** this industry is going to say about video games anymore I I I would be I mean",
            "start": 2579.0
        },
        {
            "text": "\"Damn, look, look. You're asking me, and I'm like, we're the Indiana Jones guys, so the hell do I know? Who knows what this industry's going to say about video games anymore? I'd be thrilled but shocked if it hit a 90 CU. My thoughts are again my hang-up with it, and I'm using air quotes, 'was that when I started combat?' You're like, okay, I get it, and I didn't experiment; I didn't use the different things, and I didn't change my loadouts crazily. It was just like I'm fighting another mushroom dude or whatever. Like, I want to make sure there's varied enemies and varied enemy encounters, and it's not brain dead. Uh, Liz, that was the other thing: fighting so many goddamn lizards. Right? If they make every one of these encounters rewarding and fun to go through, they're going to be fine. But if it ever starts going into 'all right, just more guys to fight,' I think that's where the game goes down. Yeah, I would agree with that. I mean, as long as you're mixing it up and you're\"",
            "start": 2625.92
        },
        {
            "text": "but if it ever starts going into all right just more guys to fight I think that's where the medic goes down yeah I would agree with that I mean as long as they long as you're mixing it up and you're actually able to try out all the different combinations of things that combat's going to have story holds up decisions actually matter yeah I mean again it's going to be a nerdy ass RPG so I think it'll be fine Lov says in the chat on on YouTube who had a vow in the open critic league if you go to kindafunny.com/slfk League 2025 you can see our fantasy critic league and you can see that the one the only Andy Cortez and Nitro rifle games have Avowed and we will see if that is a good pick for him and pays off for him and he has Civ seven that's crazy and he cleaned up look at back to back he's ready to go by the way uh side note before you move off of this because I saw a Barrett uh post on Blue Sky about Roger and then I realized like man Roger trying to win this **** really he's going",
            "start": 2671.92
        },
        {
            "text": "\"Ready to go by the way, uh, side note before you move off of this because I saw a Barrett uh post on Bluesky about Roger and then I realized like man, Roger trying to win this thing really, he's going to get everything. See that's what it feels like right now. I, I also have the feeling that four of these games are going to get uh delayed out of this year and then he's only going to have $23 to gamble with. Yeah, yeah, because when I saw he grabbed Ninja Gaiden Four, I'm like crap, I didn't even think to get that right away. He drafted it for $56. Barrett, it's crazy. See if it pays off. Bold move, Cotton uh let's get some other chats in here. I like this one uh uh Cowand Fudco says big fan of the hype cast formula Greg, thank you very much, I appreciate that. Thanks for everybody who's watching right now uh music and AOW sounds great too. The Outer Worlds two theme still sits with me. That's for me. I've never been the audio guy, that's a Tim thing right uh but like I'm interested to see how it\"",
            "start": 2716.96
        },
        {
            "text": "now uh music and Avowed sounds great too the Outer Worlds' two theme still sits with me I that's for me I've never been the audio guy that's a Tim thing right uh but like I'm interested to see how it plays here and what goes on with it yeah did it stand out for you with all pairs yeah I thought I thought it was good I mean you know nothing nothing truly stood out but it it was it was solid solid solid soundtrack that was in there obviously the background music everything was going on it was very solid and then our final Super Chat for this episode of the Hypecast Gamescast uh George Corona II thiri says renewed three months of Game Pass for Avowed and south of midnight wasn't feeling Eternal Strands so I dove into Pillars of Eternity instead and as a fan of Baldur's Gate 3 I'm loving it can't wait to see the best the best value Best Value in gaming and and being being real for a second since since I wasn't on the show yesterday and I won't go into a big diet",
            "start": 2760.84
        },
        {
            "text": "Gate 3 I'm loving it can't wait decision the best the best value Best Value in gaming and and being being real for a second since since I wasn't on the show yesterday and I won't go into a big diet tribe about it but of course yesterday's show Snow Bike Mike's beef with Xbox and his lending that Xbox is no longer just one box for him it's everything and where does that leave him as an Xbox fan I I think everything Mike said was was valid and it is up to Phil and the team to deliver the vision that they're talking about they actually we got to see the results of it but from a Game Pass standpoint I think we're here now as far as when you talk about Best Value in gaming that now you can see the content actually consistently starting to come out for it that if you're subscribed you're not going to unsubscribe because there's always going to be something next to play so yeah I think I think they're doing a good job with it now We've joked for years about The Dominoes but it really does feel",
            "start": 2805.2
        },
        {
            "text": "to unsubscribe because there's always going to be something next to play so yeah I think I think they're doing a good job with it now We've joked for years about The Dominoes but it really does feel like Xbox has a great lineup this year if they don't if these all hit the way they should and hopefully like again one of the reasons for the hype cast is I think a lot of people are sleeping on Avowed and I understand until you play it and again I think even when we watch that I the the latest gameplay trailer turned heads thing I put out from Reddit right like you look at that and you compare it to when we first saw Avowed and it's like oh my God this looks so much better but that first impression right solidified for so many people so to get here hopefully have this game come out to low expectations so it can super exceed them and then hopefully that's Off to the Races for Xbox no completely agree they did make the right move to bring it to February versus putting it out in November when which",
            "start": 2853.8
        },
        {
            "text": "so it can super exceed them and then hopefully that's off to the races for Xbox no completely agree they did make the right move to bring it to February versus putting it out in November when which allegedly i guess they never officially said november but that i mean with cod around that time indie behind it and you know there was just there was a lot of different stuff that came out around that time this might have got lost in shuffle it feels like coming out february 18th i guess seems like it's going to have some room to breathe on its own and let people discover it like i was actually surprised when you're reading super chats before that people were taking advantage of the game pass stuff to get it five days early yeah because i i honestly didn't think there had been enough recent marketing and talk about avowed that it was top of mind for people to get excited about i would imagine they're about to start ramping that stuff up but but um yeah i mean hey i'm i'm really looking",
            "start": 2893.64
        },
        {
            "text": "marketing and talk about a Avowed that it was top of mind for people to get excited about I would imagine they're about to start ramping that stuff up but but um yeah I mean hey I'm I'm really looking forward to it yeah we will see I imagine yeah you know once we get to February and you got those two weeks counting down to early launch 5 days early what the 13th then I think you'll see it ratchet up quite a bit but we will wait and see of course when we can you will get an Avowed review from us Paris you going to be on that with me I forget I'm pretty sure am hell yeah that's what I want to hear uh of course ladies gentlemen and nb's uh Avowed comes out February 18th like I said 5 days earlier it would be the 13th unless I have my math wrong which is possible with crazy Xbox math um we'll be talking about it we'll be reviewing it because that's all we do here at Kinda Funny Games of course you can see us each and every day with live talk shows about video games youtube.com/KindaFunnyGames",
            "start": 2933.6
        },
        {
            "text": "about it we'll be reviewing it because that's all we do here at Kinda Funny Games of course you can see us each and every day with live talk shows about video games youtube.com/KindaFunnyGames twitch.tv/KindaFunnyGames Apple Spotify you name it we're there talking games you already got Game Daily you're about to get a stream from SnowBikeMike and of course if you like all this content we put out please pick up a Kinda Funny membership 10 bucks a month gets you all of our shows ad-free that's 80ish a month of course you also get your daily dose of me and a series we call GameOverGreggy and you could watch uh exclusive recordings of shows like In Review this afternoon when we do Aliens before anybody else gets them for now though it's time to say goodbye and watch that inbox and wait for Avowed until next time it's been our pleasure to serve you",
            "start": 2980.64
        }
    ]
}