{
    "id": 13356,
    "video_id": "Az7E50o4jlo",
    "show_name": "Gamescast",
    "hosts": [
        "Blessing Adeoye Jr.",
        "Mike Howard"
    ],
    "title": "Blessing & SnowBikeMike React to Rolling Stone's Top 50 Games of ALL TIME - Kinda Funny Gamescast",
    "description": "Go to http://rocketmoney.com/kindafunny to cancel your unwanted subscriptions with Rocket Money.\n\nTime Stamps:\n00:00:00 - Start\n00:01:52 - Mouthwashing\n00:06:00 - Housekeeping\n00:09:22 - Reacting to Rolling Stone’s Top 50 Games of All Time\n00:23:17 - 50\n00:38:56 - 40\n00:57:57 - 30\n01:16:11 - 20\n01:33:24 - 10\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny: http://www.youtube.com/kindafunny?sub_confirmation=1\nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nGamescast Background Art by https://twitter.com/Orioto\nIn Review Intro Videos by: https://twitter.com/CameronKen\nIn Review Intro Music by: https://twitter.com/CarterHarrell\n\nListen To Our Podcasts On Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\nPS I Love You XOXO – A PlayStation Podcast: https://bit.ly/3r3rjvB\nKinda Funny Xcast – An Xbox Podcast: https://bit.ly/36twqvD\nKinda Funny Screencast – TV & Movie Reviews Podcast: https://bit.ly/3e7yQ75\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1736457575,
    "duration": 6749,
    "transcript_chunks": [
        {
            "text": "Yo, what's up? Welcome to the Kinda Funny Gamescast for Thursday, January 9th, 2025. I'm one of your hosts, Blessing Adeoye Jr., joining me is the master of hype SnowBikeMike. Bless, what's up, big dog? Good to see you again. Welcome back. Uh, thanks for having me on another Gamescast with you. I always love doing these, of course. I mean, thanks for having me on another Gamescast with you, Mike. You know, you act like I'm in charge of this. You act like I'm the one that makes the Gamescast schedule. We're together now; we're going to have some fun. Uh, Bless, we're back at it again. It's Thursday, halfway through the first week of 2025. Yep, crazy to think about that. Feeling good? Yeah, yeah, I'm feeling pretty good. Start of the year, yeah. I mean, my you know, my ass is in Grind Mode so I'm trying my best not to be horizontal ever. You know, usually I'd come home, you know, you lay down for a minute started scrolling TikTok and the moment I get horizontal I had to F yesterday 'cause yesterday like I ate dinner and I",
            "start": 12.37
        },
        {
            "text": "horizontal ever you know usually I'd come home you know you lay down for a minute started scrolling TikTok and the moment I get horizontal I had to F yesterday cuz yesterday like I ate dinner and I knew I wanted to finish mouthwash cuz like yesterday was one of my free evenings where legitimately like I could have made plans but I was like you know what man it's rare that I just leave an evening for myself rather going to the gym I'm rather playing a sport I'm hanging out with a friend a busy man busy man um and yesterday was a free evening and I told myself this year I wanted to play more Indie Games I wanted to roll more credits yeah I heard you say that you want to be the taste maker I like that yeah I want to be like Roger Pokorny I Want to Be The Taste Maker uh and so I went back and I finished Mouth Wash nice very evocative game very like a lot happening an Artistic Touch do you recommend that to our audience because of course I played it as well you and I have both now completed",
            "start": 58.4
        },
        {
            "text": "I finished mouthwashing, nice very evocative game, very like a lot happening an Artistic Touch. Do you recommend that to our audience because of course I played it as well, you and I have both now completed in the same week, yeah? Where do you fall on that? I you use some special words there which I like. Here's the thing, I I look at it, I I finish that game and I acknowledge that like I think they did a lot of stuff where I'm like that's art right there, like y'all made something, y'all put your foot in this. I don't know if I loved it okay, like I finished that game and I was kind of like I don't like the feelings I felt which often times art does and I don't think that's inherently bad, I'm okay with art not making me feel good but I think my issues with it is I am not the biggest fan of when games get trippy and stays trippy for too long where it's like all right you guys are telling a story but like now it feels like you're just throwing like visuals and like sensations at me that I don't",
            "start": 93.44
        },
        {
            "text": "gets trippy and stays trippy for too long where it's like alright, you guys are telling a story but now it feels like you're just throwing visuals and sensations at me that I don't want to say the lack of substance because I understand where it's hard to talk about a game without getting but I understand what you're saying and the story you're telling me and why you're doing these things, but when I'm spending what feels like most of the game just going in circles and the world changes around me and shit's weird man, like you start to lose me a bit. Um, that plus, I don't know, there's something thematically I didn't tweet about this, but it feels like, man, could have gone to therapy but instead I made a video game; what it feels like is out - you got to get that emotion out is right, but would I recommend it? I think I still would recommend it. I think if you're two and a half hours, you could finish it in one sitting, you could break it up",
            "start": 138.6
        },
        {
            "text": "you gotta get that emotion out is right but would i recommend it i think i still would recommend it i think if you're two and a half hours you could finish it in one sitting you could break it up into two nights it's got something it's got something there if you want to feel something if you want to experience something definitely i would say check it out you might come out of it feeling yeah i left it feeling kind of grimy kind of gross kind of gross not happy you know what i mean especially cuz there were some things that like are an answered but kind of like not answered super clearly so you can lead to your own and it's like oh i don't like where that kind of went right there and i don't know where we were on that one you know so yeah i feel that bu the game feels like somebody needs to get something out of their system like whoever made that game whoever wrote it and developed it they're like i got some stuff that i'm working through and like i could go to therapy but ****",
            "start": 185.52
        },
        {
            "text": "to get something out of their system like whoever made that game, whoever wrote it and developed it, they're like \"I got some stuff that I'm working through\" and like \"I could go to therapy, but f*** therapy\", I'm making a video game this out. But you know what I would recommend? It though if you're if you're somebody who's willing to like experience some dark s***, yeah it is like it's a horror game, it is a game that I think has a lot to say and part of what it has to say I think is like good right, like it is. I don't I won't go into what it is thematically but it's touching on things where it's like \"oh this is some deep s***\" and like you're working through it so if you want to play like I'll say a kind of a therapy game somebody's working through some s*** in a video game, yeah. Mouthwash and I'll say give it give it a look okay good and then of course on top of that the started 2025 how you feeling uh I'm feeling good yeah yeah I mean there's not much to on is the nth but yeah not",
            "start": 220.8
        },
        {
            "text": "and I'll say give it, give it a look okay good and then of course on top of that the started 2025 how you feeling uh I'm feeling good yeah yeah I mean there's not much to on is the nth but yeah not bad chilling you know we got game of the year next week going to be exciting very exciting stuff very exciting stuff I have some I have some stuff for us to talk about for the tots of course you know for me to kick off the new year I had to maybe write a wrong or I had to at least do some investigative work MH because last time we did a **** list we really talked a lot of **** on Half-Life: Crowbar you talked a lot of **** I had to jump I lot **** and you know what bless you know what bless I give a little more respect to it but it's not a top eight weapon wow not so it's still **** on the list not you playing Half-Life last night I'm playing Half-Life right now been an ongoing thing have you been playing Half-Life for a while uh no this is part three of my playthrough so just",
            "start": 261.0
        },
        {
            "text": "on the list not you playing Half-Life last night I'm playing Half-Life right now been an ongoing thing have you been playing Half-Life for a while uh no this is part three of my playthrough so just really this week to start off the new year looking for things to play I'm kind of like Greg right now and I'm sure all of you out there it's like what's the new thing to play oh wait there's nothing new so what should I be playing right now what's going to grab me and I've always wanted to play Half-Life I know you and Andy have talked about doing it on stream but we've been waiting for Half-Life 2 Remix Mix Mix Mix with the Super Invidious stuff so it's like well I should probably play Half-Life one so I can get ahead of it and know a little bit about I respect that you're getting ready for Half-Life three this year Mike yeah and so I'm on I'm in well I still got to play Half Life e one what's the Half-Life Black Mesa mes is what I'm playing see that's what I want to play Yo bless you should play",
            "start": 305.2
        },
        {
            "text": "three this year Mike yeah and so I'm on I'm in well I still got to play Half-Life one what's the Half-Life: Black Mesa is what I'm playing see that's what I want to play Yo Blessing you should play this game I know I should this game rocks Blessing that game you know when we talk about tots here will it be on the list well let's get into it remember this this is Kinda Funny Gamescast each and every weekday we get together to talk about the biggest reviews previews and topics in Video Games Live on YouTube Twitch and on podcast services around the globe if you love what we do support us with the Kinda Funny membership on Patreon YouTube Spotify or Apple Podcast to get all of our shows ad-free watch us record them live and get a daily exclusive show and for chance be a part of the show some your thoughts and opinions as YouTube super chats as we go housekeeping for you thanks to the overwhelming generosity from the community we have a new batch of gifted Patreon memberships going up",
            "start": 341.64
        },
        {
            "text": "your thoughts and opinions as YouTube super chats as we go housekeeping for you thanks to the overwhelming generosity from the community we have a new batch of gifted Patreon memberships going up on Saturday at 9:00 a.m. Pacific Time on Kinda Funny's Patreon page you'll be able to see the post create a Patreon account and click the join for free button on patreon.com kindafunny if you would like to add to the list you can send gifted membership links to support.kindafunny.com to be included in Saturday's post remember we're an 11 person business all about live talk shows KFGD was about Assassin's Creed: Odyssey getting delayed again uh right now is the Gamescast after this is the stream and it's going to be some of that Marvel Rivals maybe more with me Mike Howard maybe more maybe more we just can't get enough just can't get enough Can't Get Enough new season starts uh technically tonight but really we'll just call it tomorrow for those listening out there four new characters three new",
            "start": 382.0
        },
        {
            "text": "can't get enough just can't get enough Can't Get Enough new season starts uh technically tonight but really we'll just call it tomorrow for those listening out there four new characters three new maps yep bless this team this team is getting after Overwatch they said we're coming for the throne they're they're for real coming for the for the throne yeah and like to the to the point where I'm not checked the concurrence I need to see but like what are what is the Vibe right now like are we giving the crown to Marvel Rivals right now already uh I think are they higher right now they might have taken the crown have they taken the crown yet I think it's that kind of vibe right now we'll keep an eye on Marvel Rivals it's that kind of vibe if you're a Kinda Funny member you can get today's Greg way where Greg has a three-way thank you to our Patreon producers delaying hey that's what it says I didn't write this Greg wrote this um oh these are the Steam charts so Marvel Rivals",
            "start": 426.92
        },
        {
            "text": "Greg Miller has a three-way thank you to our Patreon producers delaying hey that's what it says I didn't write this Greg wrote this um oh bar these are the Steam charts so Marvel Rivals what and the 24-hour Peak has had 40,445,000 players right now you have 309,000 that's solid the thing that sucks is that like you can't I don't think you can get accurate numbers for Overwatch really right cuz like the battle most people are playing on Battle.net and also like we're not accounting for console as well so like there's a lot you know what I mean but when we go to the 2025 SnowBike Mike and Blessing out of OA Jr keep an eye on it's Call of Duty: Black Ops 6 sales numbers it's Marvel Rivals where is the engagement three months and six months from now and Xbox third-party titles Game Pass those are our big three on our list right now all right fair enough also for me and Greg cuz I want I want to keep Greg honest about this I don't think people remember this Pizza Bed but I do was",
            "start": 460.92
        },
        {
            "text": "those are our big three on our list right now all right fair enough also for me and GameOverGreggy cuz I want I want to keep Greg honest about this I don't think people remember this Pizza Bed but I do was only like a month ago where GameOverGreggy said that every Xbox game is going to have an earlier version like a play like Play on Play earlier like pay more money to play earlier essentially oh okay special edition type VI special edition type Vibe right GameOverGreggy was saying that like every first-party Xbox game is going to have that I'm saying No this year every single one that's what he thinks yeah it I don't know if that was like an in the-moment thing cuz sometimes you say things in the moment where where later on you're like no I didn't mean that you did say it when things get hot and heavy keepest keep you say some wild things sometimes you draft Mario as a counter pick you know what I mean so dumb of you thank you to our it was thank you to our Patreon producers Delany Twining and Carl Jacobs today",
            "start": 504.76
        },
        {
            "text": "Say some wild things sometimes you draft Mario as a counter pick, you know what I mean? So dumb of you. Thank you to our Patreon producers Delaney Twining and Carl Jacobs today we're brought to you by Rocket Money, but we'll tell you about that later. For now, let's start with the topic of the show. Mike, the number one thing I've seen in my mentions this week has been Rolling Stone - they put up a list of the top 50 greatest video games of all time, top 50, top 50 greatest video games of all time. And everybody's in my mentions is like \"Blessing, bless your list, bless your list\" you and Mike, you got to react because I don't know if you realized this - me and you become the react guys, we love reacting to some lists, we become like the new list folks. We got to get Tim like rest in peace, Tim G should be here, he's working, he's so busy though, he's working, and we got to I feel like we haven't tested out yet the trio me you and Tim I",
            "start": 541.64
        },
        {
            "text": "got to get Tim like rest in peace Tim G, Tim should be here, he's working, he's he's so busy though, he's working and we got to I feel I feel like we haven't tested out yet the the trio me you and Tim I think he would balance us out because you and I we come from the same era we get the same Vibes so I think Tim's kind of that middle ground of like he might balance us out but then we can beat up on him me and you are we're from the same era, Tim Gettys, I'm pretty sure is between both of us in age, yeah he is, Tim's technically the exact same age but there's a Vibe there's a Vibe, Tim why do you look at Tim like he's 40 years old, Tim is like 3 years older than this is the reason cuz he's like an actual adult, yeah Tim's an adult my child man child that's hilarious that we're like a Tim different generation that man we don't talk about this enough, Tim yes practically my age, Tim is only a few years older than it's true but it feels like we're decades apart for some reason it feels like he's like",
            "start": 591.64
        },
        {
            "text": "that man we don't talk about this enough Tim yes practically my age Tim is only a few years older than it's true but it feels like we're decades apart for some reason it feels like he's like Nick's age but he's not it really does that's the that's the thing it's like you don't see behind the scenes It's really because he's just he's been around for a while you know it's cuz he's businessman come play on the stream come talk about Kevin wiping his ass with us you know what I mean he want talk about Kevin wiping his ass for reason exactly or not wiping his ass tune in to the content to find out oh bar you missed the stream yesterday oh God Kevin we we got to call it out habitual Lin stepper habitual line stepper this this man Kevin takes it there and then takes it one step B like he'll take whatever you say elevated to a point where it's like oh man I try to stop before he get there but Kevin will take it there that's why we that's why he we employ him that's why he put a microphone",
            "start": 640.88
        },
        {
            "text": "whatever you say elevated to a point where it's like oh man I try to stop before he gets there that's why we that's why he we employ him that's why he put a microphone in front of him so he can say these things let him cook up let him say some things let them cook all right we're doing a **** list if you don't know **** list I go online I find a top 10 list I bring it back to the crew and we re react for your enjoyment this time it is a top 50 list the top 50 greatest video games of all time from Rolling Stone of course the streets have been enjoying us reacting to the top 100 PlayStation list from IGN we did the um every game of the year ranked um list for **** list on the last week of content last year so we're back at it like a bad habit Mike before we get into this list when I say top 50 greatest video games of all time what comes to mind man you got to go deep into it right uh I think of a Grand Theft Auto but which one or how many I think of a",
            "start": 682.68
        },
        {
            "text": "get into this list when I say top 50 greatest video games of all time what comes to mind man you got to go deep into it right uh I think of a Grand Theft Auto V but which one or how many I think of a Final Fantasy's got to be up on this um I think of you know great games like a Half-Life or a Portal got to be on this list I think Halo needs to be here a Gears of War needs to be here a Red Dead probably has to be here you know you start throwing things out there and you get excited right cuz then you got to go into Nintendo's bag how many tricks do they got in the bag a lot of them you know it's gonna be a good time so you say GTA you give me a lot of um franchises but not necessarily all so like how many GTA three I think one I think at least one I think two I'm G say two I think you get two GTA I'm going to I'm also going to say two you get two cuz I think I think you get a a PlayStation 2 GTA you get a III or a San Andreas or V like I that's the thing is I think any of those",
            "start": 726.16
        },
        {
            "text": "Two GTA V, I'm going to say two, you get two because I think you get a PlayStation 2 GTA, you get a three or San Andreas or five. Like, that's the thing is, I think any of those three, yeah, I you get one of those three and then you also get five. Yeah, um, you said just Final Fantasy, I'm gonna say seven, seven is what I think, seven is the popular it's either seven or if they're nerdy about it, I get maybe six because I think six is also very beloved. Um, also I should note that I believe this is Rolling Stone staff when you check the page, it just says by Rolling Stone Staff. Okay, yeah, it just says by Rolling Stone. Keep going, what else? So you said Half-Life, you thinking Half-Life 2, I think Half-Life 2 will be on this. You said Portal, you think Portal one will be on this, Portal two. You said Halo, which Halo... Halo 3 will be on this. It's a smart no, you said Gears of War, I don't know if I VI Gears War is a top, I think Gears one will be on this. Wow, I'm put",
            "start": 772.92
        },
        {
            "text": "be on this portal two you said Halo which Halo, uh, Halo 3 will be on this it's a smart no you said Gears of War I don't know if I VI Gears of War is a top I think Gears one will be on this wow I'm putting Gears one on this I respect it uh you said Red Dead Two Red Dead Two yeah I think Red Dead I think it'll be Red Dead one, red dead one going either way then we got the audience of course coming in here you have games like a Mass Effect Mass 2 yeah you have a game like uh The Legend of Zelda: Breath of the Wild I was going say Let me let me come in with some of mine right cuz if I just think off the top of my head The Legend of Zelda: Breath of the Wild yeah and don't correct me because of how I say breath I'm sorry guys um The Legend of Zelda: Breath of the Wild I'm going to throw in there Elden Ring also should know this is a new list this list came out in the last couple weeks last couple weeks uh even including Elden Ring brings up questions of like other Souls games from Software's got everybody in a choke right now they they got",
            "start": 816.84
        },
        {
            "text": "out in the last couple weeks, even mentioning Elden Ring brings up questions of like other Souls games from Software got everyone in a chokehold right now; they've got them in a chokehold. See, I'll say Bloodborne. I was just thinking about the context of Rolling Stone, right? Like, are they getting super nerdy with it or are they getting super into the weeds and I'm not saying Bloodborne is like a super niche thing, right? But like, I do wonder if they think past From Software when they already put down Elden Ring. You know, I feel you; yeah, I feel you on that. Um, well Mario... you know what I mean? Mario Brothers either Super Mario World, okay, or Mario Brothers 3, okay, and or Mario 64 Galaxy. I think Galaxy had a chokehold on like 64. Well, that's the tough thing is when you talk about the Mario Brothers, pretty much any mainline entry outside of Sunshine is on the table going be",
            "start": 865.6
        },
        {
            "text": "I think Galaxy had a choke hold on like 64 well that's the tough thing is that when you talk about the Mario Brothers pretty much any Mainline entry outside of sunshine is on the table going be on the table yeah every Mario entry is on the you know I mean you got so many of them too I'm typing down Mario tell me down some more um and this is why I think where things start to get really more The Witcher 3 okay yeah some people have been saying The Witcher two The Witcher 3 I think is high up on my possible list here that's the fun stop it's like Baldur's Gate 3 bg3 I like that how about Skyrim they make the last Sky good Skyrim was was once on a refrigerator that's good I mean big deal true you know what I mean uh where where else do you get in here cuz there's a there's a lot I mean what Okay so we've we've visited Nintendo yeah God of War Bioshock 2018 I was going to say we I don't think we have a lot of PlayStation how about Crash no maybe but I hope not no **** crash Tetris people are",
            "start": 916.4
        },
        {
            "text": "we've we've visited Nintendo yeah God of War Bioshock 2018 I was going to say we I don't think we have a lot of PlayStation how about Crash no maybe but I hope not no **** crash Tetris people are saying oh yeah tetr there oh yeah we got Pac-Man Pac-Man Dig Dug no no D I love digdug though **** yeah Mike stre Exotica I is that a real one cruisen world Exotica I don't think we're supposed to talk we get arcade game get I don't I don't watch those kind of videos like cruising World Exotica no he was playing cruising world on a different uh website um **** I had another game now you just erased it from my brain what we said Tetris we said Pac-Man you said a fighting game I think oh Street Fighter 2 street fighter super like that I like that Mortal Kombat cuz now you start to get in like Stone's probably going to put one fighter on this list you would hope which one is that I think you three figh over Mortal Kombat yeah um I now I'm thinking classic right Pokemon you got to have a",
            "start": 967.08
        },
        {
            "text": "Stone's probably going to put one fighter on this list, you'd hope which one is that? I think you three fight over Mortal Kombat, yeah. Um, I now I'm thinking classic right, Pokémon. You got to have a Pokémon on here, Pokémon. Oh, you got to have a Pokémon. I also like this; I want to shout out. I also like this because we're doing our top 100 games for Kinda Funny sometime this year, that was one of the promises at the beginning of the year, so this almost feels like a precursor to that. Give you a highlight, cruising exotic Hood's on my list. Oh, it better not be. WoW, World of Warcraft. Fortnite, yeah, people are saying Fortnite; Fortnite's definitely be think is another solid one as well. Mike, it was very fun uh when we went to the Computer History Museum they had a whole section around World of Warcraft and they had the server of the original World of Warcraft server like physically there. It was like oh if Mike was here he would have been flipping out, been freaking now thinking through what's on my",
            "start": 1019.08
        },
        {
            "text": "had the server of the original World of Warcraft server like physically there it was like oh if Greg Miller was here he would have been flipping out been freaking now thinking through what's on my list yeah tell me m Sol three three yes three is my pick they could probably pick either one or I guess one or three I feel like would be the right but I'm going to say three I like that I could see some people choosing two yeah that's the thing it's depending on who who's on here right it could be two but we're just seeing some Metal Gear Solid on we got to see Metal Gear Solid on here did we say The Last of Us yet we haven't talked much Sony there's a lot of Sony from Uncharted to The Last of Us I don't God of War think we see an Uncharted that's the thing is when I when I think of recent first party Sony I'm going The Last of Us god of war and don't know how much deeper I'm going for a top 50 right I don't think I'm going Horizon Zero Dawn for a top 50 I'm not going Ghost of Tsushima yet for a top 50 maybe with",
            "start": 1061.88
        },
        {
            "text": "I'm going Last of Us, God of War, and don't know how much deeper I'm going for a top 50 right. I don't think I'm going Horizon for a top 50. I'm not going Ghost of Tsushima yet for a top 50. Maybe with Final Fantasy VII on this no no we're going way back right because like that's the tough part. We talk about top 50 all time, right there's recent then you got to go way back in the bag like you could get lost in this if we're going back like that's the thing is is if we're if we're treating every era like oh we got to get PS1 games in there we got to get yeah that's how I think we get M your solid one okay and Final Fantasy VII, like the original Final Fantasy VII. Okay okay um you get a GoldenEye like we going back for you do get a GoldenEye you know what I mean it shouldn't be on there but I respect it and we said I think we said The Legend of Zelda: Breath of the Wild earlier on and just moved on but like AAR I see I'm I'm of the mind of maybe it's like GTA where they only put two of them on here you know if you choose",
            "start": 1103.88
        },
        {
            "text": "said I think we said The Legend of Zelda: Breath of the Wild earlier on and just moved on but like AAR, I'm of the mind maybe it's like GTA where they only put two of them on here, you know if you choose two Zeldas, which two are you going to guess? I think it would be Breath of the Wild and Ocarina. I like that, see. Pardon me, I don't agree with it but that's just what again, guess if I'm in the room at Rolling Stone, yeah, which I don't know what Rolling Stone is capable of, we don't know that's that's the big X Factor in all this, the fun part are they on the gamer side of these lists like where are they going, like who's in that room at Rolling Stone putting together this list but if I'm in a room with a lot of cool people, movers and shakers, cuz here's the thing you're part of Rolling Stone, you're a mover and Shaker, you're a trend Setter. The problem is fascinating thing with lists like this is that I think you get into group think scenarios right where you're playing to the room and it's hard to",
            "start": 1148.92
        },
        {
            "text": "and Shaker you're a trend setter, the problem is fascinating. With lists like this, I think you get into groupthink scenarios where you're playing to the room and it's hard to try to get them hyped up after every single pick. It's more so that I think you get into conversations where arbitrary things become, \"oh we gotta do this right\" because if one person is making this list, I can see a Breath of the Wild and Nier: Automata because it's a group of people. I think the conversation will steer towards, \"we got to get a 3D and a 2D.\" Oh, I think they might go Breath or Tears cuz Tears could be on here maybe they're saying you get one. I don't see like I feel there's a sentiment around Tears that like you didn't fully have but you kind of had where it's like well I already had Breath of the Wild and that was such a special experience. I don't like when people are thinking about top 50, I don't see them thinking about Tears in the same way as uh they do",
            "start": 1191.6
        },
        {
            "text": "well I already had breath of the wild and that was such a special experience I don't like when people are thinking about top 50 I don't see them thinking about tears in the same way as uh they do breath of the wild but they should cuz tears is a better game that's the thing is like I think you get one of those and you get linked to the past we got a lot of good ones from the chat that I want to call out we have Castlevania's in here we have a Doom, a Wolfenstein someone wrote Guitar Hero right like I do think guitar heroes on this I think it should be on this list I don't I would especially with the Rolling Stone know you know they're they come from music I would be more likely I would expect more likely to see a uh Rock Band on here I like that I like that I'm going to say Shadow of the Colossus oh that one's deep bless I don't know about that one I like that you need some gamers in there Shadow of the Colossus cuz you say it's deep but I feel like when you're talking about when people start to get",
            "start": 1234.12
        },
        {
            "text": "oh, that one's deep Blessing. I don't know about that one. I like that you need some gamers in there Shadow of the Colossus, cuz you say it's deep, but I feel like when you're talking about when people start to get into the conversation of video games are art, I feel like Shadow of the Colossus is like the mainstream version of that, like it's like the number one thing you go to when you talk about video games as art is you go to The Wind Waker. Oh, I was going to go with no, well yes, but no, Shadow of the Colossus is definitely like the poster child for video games are art uh for gamers, but again when you talk about mainstream, I I feel like I I saw more conversation especially in like that 2008 to 2012 era where people are up in arms of like are video games are are they products what are they and like I feel like The Wind Waker was kind of a big conversation around that. Um, man there's so much we journey a fez an inside people say Indie Games you know what I mean but I think from Rolling Stone",
            "start": 1273.68
        },
        {
            "text": "and like I feel like The Wind Waker was kind of a big conversation around that um man there's so much we journey a few an inside people say Indie Games you know what I mean but I think from Rolling Stone we might have to go like the top level of of indie games which probably would be well one Minecraft yeah yeah I don't know if you said that Minecraft's got to be on there mcraft no any sports games like an NFL and SSX and NBA Streets a FIFA Tony Hawk a Tony Hawk like Tony Hawk I think Tony Hawk is the most there's got to be some sort of sports game in here right that changed everything H for sure here's here's what I'm going to tell you and you're going to be upset by this it being Rolling Stone I think another a sports game that you could probably get tech mobile I think you're going to get like that kind of oh we all remember playing this like type of game and tech mobile I think stands out in that way okay okay I like that maybe won't get mad at that but like I think",
            "start": 1322.4
        },
        {
            "text": "going to get like that kind of oh we all remember playing this like type of game and Techland I think stands out in that way okay okay I like that maybe won't get mad at that but like I think that has a high chance as a sports game all right should we hop into it I think we hop in i i i well we didn't call out a Call of Duty either though oh yeah probably a Call of Duty in this yeah it's probably either the goat Modern Warfare or an early Black Ops Black Ops one yeah all right this is exciting this is exciting we were cooking here we could keep the the wild thing is is that we can like keep cooking and if I'm going to count if I highlight everything and and order it it'll tell me how many we have here cuz we're pretty close we've written down 32 yeah we could EAS I don't I'm not pushing to get to 50 but like we could easily get to 50 and then some right like that's going to be the fascinating thing about this is we could just keep going and they're going to have to like pair this",
            "start": 1370.68
        },
        {
            "text": "to get to 50, but like we could easily get to 50 and then some right, like that's going to be the fascinating thing about this is we could just keep going and they're going to have to like pair this **** down to 50 as Rolling Stone. Let's see how let's see let's I'm excited League of Legends is in Dota, yeah let's run this. We got that's thing is we're going to learn the vibe so hopping into it we're reacting to Rolling Stone's The Top 50 Greatest Games of All Time. Greatest video games of all time are we ready man this is exciting I'm ready are you y'all ready? Yeah before you actually get there I'm going to read their blurb okay all right shut up. There was a time when a great video game just needed to be fun and the days before 4K screens and season passes it was all that mattered, it didn't matter if the design was janky if you could finish the whole thing in one sitting and frankly it feels way too hard but things evolved over time games became more layered they could tell a",
            "start": 1413.76
        },
        {
            "text": "it didn't matter if the design was janky if you could finish the whole thing in one sitting and frankly it feels way too hard but things evolved over time games became more layered they could tell a story the length of a novel or with the strength of a film they could challenge the mind either with puzzles or a test of reflexes most importantly they could bring people together in an online Lobby arcade or just on the couch gaming is really the story of the people who play them but to pick the best games ever made there's a lot of considerations gaming is a medium where sequels thrive they can always look and play better and while certain gaming dynasties run dozens of entries deep there needs to be representation across the board today everyone's a gamer but they're not all playing the same thing for this list we looked at both how influential each game was at arrival as well as whether it still holds up a good game may have played well but a great one still does damn they're citing",
            "start": 1458.52
        },
        {
            "text": "thing for this list we looked at both how influential each game was at its arrival as well as whether it still holds up a good game may have played well but a great one still does damn SP they're citing on this I like this I like this Vibe these are games that made up the culture sorry these are games that made the culture what it is today and we'll chart where it's going tomorrow let me just say it's the Rolling Stone right now up right now what I think y'all got the vibe right okay I know you got the vi this what I'm going to say we didn't say any mobile games we're going to see some mobile games on here The way they talk about Pokémon Go Candy Crush Pokémon go yeah maybe Candy Crush Crush I mean hey they were cooking on that what about FarmVille I don't know about Fville Farmville damn these that was good you know what you set us up you set us up now don't knock me down okay build me up let's build it up right now let's see it oh they also have an editor's note here okay the platform's",
            "start": 1502.52
        },
        {
            "text": "that was good you know what you set us up you set us up now don't knock me down okay build me up let's build it up right now let's see it oh they also have an editor's note here okay the platform's listed for each game are the platforms for which they are available now and may have changed since they were first released okay that that's fine that's fine all right let's hop into it at number 50 number 50 we got Animal Crossing: New Horizons okay I thumbs up for me you know what I'm not mad at that at all it took over the world when that one came out to the Switch especially with the pandemic I think it put a lot of new people like myself on Animal Crossing that was not aware of what that game really was and then quickly learned how much fun that can be uh yeah that's a top 50 that's a top 50 I think a lot of them on this list are going to be going for impact from starting off with Animal Crossing: New Horizons and coming off of that blurb I think more likely than not I think",
            "start": 1546.68
        },
        {
            "text": "a Top 50 I think a lot of them on this list are going to be going for impact from starting off with Animal Crossing: New Horizons and coming off of that blurb I think more likely than not I think you're going to see Call of Duty: Modern Warfare more than Call of Duty: Black Ops because of that I think you're going for things that change the culture and shifted things yeah at 49 we got Hades **** they're cooking right now here's your cool Indie title that like everybody knows about that's hot that's hot that's a hot one right there so far r a thumbs up I think I mean first two are very strong here's the issue Coming Out Swinging so that means when we get down to 30 they better be better than Hades uh just I see chat reacting as well do you feel like it's too low Blessing Hades yeah no because this is top 50 we got to like we're talking about the top 50 video games of all time thousands of games get released every year yeah like so many games come out 49 for Hades like no that's I",
            "start": 1586.88
        },
        {
            "text": "because this is top 50 we got to like we're talking about the top 50 video games of all time thousands of games get released every year yeah like so many games come out 49 for Hades like no that's I think to be on the top 50 is a big deal yeah if I'm making my own personal we didn't even think of Hades to be honest with about but yeah that's making a top 100 like I think Hades would probably land somewhere somewhere in this spot honestly very strong though very strong start great job at number 48 we got Castlevania Symphony of the Night we go this would be in a lot of people's top fives one of the OGs one of the OGs of course led to the Metroidvania craze which again we're talking a lot about impact iconic status so far the first three games that we've read here iconic you can't be mad at this even if you think they're too low too high wherever their placement is just starting off the the list with this and being on the list big deal now but here's the thing and this is something",
            "start": 1629.04
        },
        {
            "text": "this even if you think they're too low, too high, wherever their placement is, just starting off the list with this and being on the list - big deal. now but here's the thing, and this is something that would always trip us up in the old lists of right, is like okay we have some really good games, but do we take some left turns? we're like all right how is this game ahead of Castlevania or exactly, that's what I started with - bear on Hades. right it's like I think we're going to start seeing a couple of those in the mid 30s to 20s here, we might go, I I might be having too much faith, okay I might be having too much faith, you read that blur now you're riding the high cuz riding, I'm riding the high right now and I think when we get into those conversations so far with how it's starting off on a good foot, I think the conversations will be about okay maybe this game isn't better than Hades but it's going to be more impactful, okay right, I think when we get to I'm trying to think of",
            "start": 1673.12
        },
        {
            "text": "off on a good foot, I think the conversations will be about okay maybe this game isn't better than Hades but it's going to be more impactful okay right, I think when we get to I'm trying to think of an example, maybe Call of Duty: Modern Warfare, which obviously might not be a good example, but like you know I would argue I had more fun with Hades than Call of Duty: Modern Warfare, but I can't say Hades is more impactful yeah right, I think that might end up being the conversation we're having towards the middle of it, it's like hasn't had a commercial with every celebrity known demand for a Call of Duty commercial like they did Hades didn't fundamentally well I don't say actually I would say Hades popularized the roguelike genre more so than a lot of other games and I'm saying popularized in like a mainstream sense, but here's what I'll say is that Call of Duty: Modern Warfare I think redefined oh yeah I'm not saying it's on the same exact level but like I do think it did like something",
            "start": 1714.44
        },
        {
            "text": "like a mainstream sense i but here's what i'll say is that Call of Duty Modern Warfare I think redefined oh yeah i'm not saying it's on the same exact level but like i do think it did like something i i i definitely agree with that yeah can we can i take a really quick take a moment for someone who hasn't played a Castlevania game can i play this in a modern setting what would be the recommendation as you see i'm going back in time and i'm willing to play new games so if i haven't played one of these where would i go the PlayStation Vita can't help cuz literally that's the last place I remember playing Castlevania: Symphony of the Night hold on hold on it's it must be on PS4 yeah people in chat are saying PS4 it's on uh phones as well is it all is this the is this the Castlevania to play Symphony yes if you're picking yeah symphony of the night is like the people will say it's one of the greatest games of all time and i play it on my I play it on whatever okay yeah that sounds great",
            "start": 1751.84
        },
        {
            "text": "play Symphony yes if you're picking yeah symphony of the night is like the people will say it's one of the greatest games of all time and I play it on my I play it on whatever okay yeah that sounds great I'm on all right number 47 we have The Legend of Zelda: A Link to the Past way too low that's low dude A Link to the Past okay I got to see the rest of the cuz so far every single time I'm like all right what's going to be above this they find a way to step it up and I know like I'm by it but like A Link to the Past made the formula that everybody thinks about when they think about Zelda uh and so many other games have like looked to it like this is this is like one of the most impactful games I would say this at 47 feels hella low I'm not mad at it yet I got to see some more I'm happy it's it's on the list you know what I mean because I think there's going to be another Zelda way higher that's my thing is yeah the issue is they're going to put a Zelda way higher 1,000% there's a Zelda way higher",
            "start": 1794.72
        },
        {
            "text": "list you know what I mean because I think there's going to be another Zelda way higher that's my thing is yeah the issue is they're going to put a Zelda way higher 1,000% there's a Zelda way higher so I think one they probably try to spread it out a little bit but also I think yeah it's tough because every Zelda we talked about this a lot leading up to Tears of the Kingdom most Zelda games are like highly impactful for different reasons right like when you talk about even the original Legend of Zelda for NES right the way like the way that I think that opened up um action adventure as a genre then yeah we talk about what Bar was talking about with Link to the Past you then get to Ocarina and what that did for 3D action adventure games you then hop to Breath of the Wild and what that's done like it's tough when when you're talking about Zeldas and how to place them and like you know again what you want to put higher I think we're going to get either Breath of the Wild or Tears of the Kingdom",
            "start": 1843.68
        },
        {
            "text": "like it's tough when you're talking about zeldas and how to place them and like you know again what you want to put higher I think we're going to get either Breath of the Wild or Tears of the Kingdom got good game so far got good game so far at number 46 you got League of Legends dude of course makes sense you have to it is a dominant force it is a great game point blank period there's nothing better than stepping up with your squad of five against another Squad of five in the arena and playing right like it is the most simple game anyone can understand it there's deep you know lore and Heroes to learn and try to master the abilities this game has to be on the list it's on ahead of Link to the Past though come on what we doing I mean I'm already I'm not mad at it I am like I think it makes sense it's I I have no like I think it should be on this list yeah I would rather play link to the past but like I for what League of Legends has become like yeah league is the goat it's",
            "start": 1881.48
        },
        {
            "text": "it makes sense it's i i have no like i think it should be on this list yeah i would rather play link to the past but like i for what League of Legends has become like yeah league is the goat it's one of the most popular games of all time it's one of the most popular games still ever since it's launch yeah League is on there this is what i'll say cuz so far we'll see if there's a left turn so far this is going to get a thumbs up for me it's still got big thumbs up i'm going to give this the chance to get two thumbs up for me who we'll see if you can get there you know if Alistair has ever gotten that i don't think Alistair has ever gotten that but like and here's what'll do it if you if you can get Hitman: World of Assassination on this list **** you'll get two thumbs up for me okay i like that i like that all right number 45 we got fortnite okay wow i i love that it's this low yeah i i cuz i think it deserves to be on this list but i think you put it in the top 10 it starts to get a little",
            "start": 1927.72
        },
        {
            "text": "I like that all right number 45 we got Fortnite okay wow I I love that it's this low yeah I I cuz I think it deserves to be on this list but I think you put it in the top 10 it starts to get a little bit off of like all right like I get what Fortnite is but like cultural impact and significance what it's done to the marketplace you can make all those justifications for it to be higher is what I'm getting at for it to be higher yeah for sure but like to be on the list yeah we knew it was going to be on the list there's no way you can't walk around a city street block without asking somebody and they would know what it needs to be on the list but I don't I don't look at Fortnite as like a Gamers game I think that's the reason why I'm like yeah keep it to the 40s like put it on the list but keep it keep it a little bit lower because I think you want to get to the top 10 and for the people who are in the no to be like yes like that game should be there right like Fortnite huge one of the most",
            "start": 1968.64
        },
        {
            "text": "it keeps it a little bit lower because I think you want to get to the top 10 and for the people who are in the no to be like yes, like that game should be there right, like Fortnite - huge one of the most culturally impactful games of all time, but I think we're also talking about like the gameplay and the how engaging it is and all that stuff right. Don't get me wrong, Fortnite great gameplay, engaging game on all and all that stuff, but you want to have like The Heavy Hitters when you're talking about like the actual design of it uh be saved for the top 10 in my opinion. I'm really I'm I'm interested to see cuz yeah I I'm one of those that I think they should be way higher but let's see let's see let's see let's see those top 10 at number 44 you got Elden Ring, I like he it's funny cuz only child was like what would you consider a Gamers game this it like Elden Ring is the one I'll say it's there okay we have a lot of recent big titles that we all know and love on the list but they are on the",
            "start": 2008.2
        },
        {
            "text": "like what would you consider a Game of the Year game this it like Elden Ring is the one I'll say it's there okay we have a lot of recent big titles that we all know and love on the list but they are on the lower end so let's see what's on the front end you know what I mean let's see what's on that top end but it has to be on the list it's stats back this is G me like similar feels as what Barrett felt with Link to the Past where I'm like now know now you understand now I'm like okay let's see how you top this one let's see what's above this you know at at number 43 we got s yo okay first of all again in my opinion should be higher but also hey it's on the list I was not expecting Celeste whatsoever and also if you put that right above Elden Ring I'm not mad above Elden Ring League of Legends and Fortnite hey okay it's Celeste have you ever played Celeste Mike I have played I like Celeste a lot um you know I I'm not mad I'm happy it's on the list I think the chat called out Celeste earlier",
            "start": 2048.16
        },
        {
            "text": "Fortnite hey okay it's Celeste have you ever played Celeste Mike I have played I like Celeste a lot um you know I I'm not mad I'm happy it's on the list I think the chat called out Celeste earlier on the list yeah and I like seeing that the chat I think it's going to be happy but like H uh I'm pleased with so far there's two different settings for Mike right now there is the it's made the list that's great I'm very happy then there's a whole different discussion of where would we actually place these games that's a different discussion I'm not ready quite yet to have and and that's the thing is again until until we hit an where I'm like what the **** are we doing I'm happy I again eldering the immediate feeling was how are you going to top this yeah so far I'm not mad okay Celeste yeah I don't like the amount of Celeste hate in our chat I'm going to be you guys should play Game even I like that game it's a good game even I like that even I like that game you know me you know how I",
            "start": 2093.0
        },
        {
            "text": "I don't like the amount of Celeste hate in our chat. I'm going to be you guys should play games even, I like that game, it's a good game, even I like that, even I like that game, you know me, you know how I get no man, Soulsborne is an all-time, all right number 42 Batman: Arkham City. I was, I I meant to shout out a Batman game, ear, ear, I imagined there's only going to be one on here, I thought it was going to be Asylum, honestly, cuz I I think more uh people in the industry and right about video games have more love for Asylum but I I **** with Arkham City being on this list, that was a huge game, that's still, I would say again we've never actually had this official debate on a Gamescast. I I think the Batman games are better than the Spider-Man games and I think Batman: Arkham City is still like top tier and untouched. I mean Batman: Arkham City was the blueprint for every superhero game that will get now into Infinity, right, like that it is it laid the blueprint it showed like hey we can make a really really",
            "start": 2138.28
        },
        {
            "text": "I mean Batman: Arkham City was the blueprint for every superhero game that will get now into Infinity right, like that it is it laid the blueprint, it showed like hey we can make a really really great superhero game and we're going to love that and that was City to me. I don't know man, that sounds like Spider-Man 2 on the PS2 to me. Oh hey hey we could get a Spider-Man, and I think we might see a Spider-Man; I wouldn't be surprised if it yeah we probably would. Spider-Man's very good, I think Spider-Man's on this list. I got nothing, I I got nothing to say are you. I love Arkham City okay but like it's an eight out of 10 game for me so like are you mad that it's a superhero game making or you just mad that like it's not Spider-Man? No cuz I I view them in this in the same tier right, like whether it's Batman: Arkham City think like those both those games shouldn't be on the top 50. L no I don't even think it's that they shouldn't be on the top 50 list; I'm I'm I'm looking at this and I'm like you put",
            "start": 2183.56
        },
        {
            "text": "Batman: Arkham City, think like those both those games shouldn't be on the top 50. I no, I don't even think it's that they shouldn't be on the top 50 list. I'm I'm I'm looking at this and I'm like you put this right above Elden Ring and Celeste, that's more so where I'm coming from. Okay okay yeah and I think even though like I have my bias, I think that's fair. I think it's fair. I think it's crazy to put this above Link to the Past. Yeah which is funny because the design around this game is definitely heavily influenced by Link to the Past. Um yeah yeah see now you're going into bucket number two of alignment right because I could say League of Legends and Fortnite should be miles ahead of Batman: Arkham City. I think we all can make certain you know uh certain arguments for each game but like for Batman to be on the list, I think it's a thumbs up. Right Batman: Arkham City and that Arkham uh Asylum, like bear brought up that changed the superhero game genre there and it really set the tone for what",
            "start": 2228.2
        },
        {
            "text": "to be on the list, i think it's a thumbs up, right? Batman: Arkham City and that Arkham uh Asylum, like bear brought up, that changed the superhero game genre there, and it really set the tone for what we'd see in the future. I like it, yeah, I'm not mad at it on the list, yeah, it's just you know we we're R we had like a strong ramp okay so right here at 42 this with Batman, you're like okay but it's okay though cuz like of course like it's not me making this list it's other people right and so like I'm this is okay to me okay okay but like let's see where we go from here with number 41 Metroid Prime. I like it as somebody who only played that game two years ago, going now this **** rocks, it's a good ass video game, right here, it's crazy that this game is so good that people now like we're waiting for the new Metroid and we're just people are feigning for this right they want this and so yeah I I think you got to give respect to some of the older Nintendo titles that have really paved the way and",
            "start": 2267.04
        },
        {
            "text": "for the new Metroid and we're just people are feeling for this right they want this and so yeah I I think you got to give respect to some of the older Nintendo titles that have really paved the way and have lasted the test of time and Metroids on that list all right and number 40 we got Chrono Trigger hey so so far in this like 50 to 40 range I think they cooked up a solid first 10 I should say to kick you off on the list and all titles that you can have arguments about you have your thoughts on but I don't think there's been a title yet where you're like that's not on a top 50 list I personally think it's too low but uh also at the same time I did think of Crono Trigger earlier when we were guessing what would be on the list and there's something in my head that I was like I doubt they put it on here uh so I'm just honestly happy it's on the list it's such a special game every game I'm looking at as I scroll through from this 40 to 50 yeah every game on here I think should be on a top 50",
            "start": 2313.48
        },
        {
            "text": "on here uh so I'm just honestly happy it's on the list it's such a special game every game I'm looking at as I scroll through from this 40 to 50 yeah every game on here I think should be on a 50 on a top 50 list if I making a top 50 list I'm being even objective outside my own taste if I'm just thinking like what would the industry put into top 50 all these games go on here except for I I would even include Batman: Arkham right like I think Batman: Arkham I look at as I look at as top 100 but again I'm not mad about it being in a top 50 you know what I mean I agree with you on that one I think we're having a good conversation I haven't seen anyone in the chat truly mad at any of these 10 right I think everyone is agreeing with all of us of like except for Celeste for some weird reason about that yeah I think and like I think I think the the only thing I really see is people being like oh man that should be higher and I'm not I'm not going to you know lay my flag down on that yet until we get",
            "start": 2359.44
        },
        {
            "text": "yeah I think and like I think I think the the only thing I really see is people being like oh man that should be higher and I'm not I'm not going to you know lay my flag down on that yet until we get higher yeah cuz so far again like I I stand by there are a lot of Incredible video games and I think the only reason why like some of these are like maybe this low is that we're forgetting how many **** 10 out of 10 video games there are right how many masterpieces there are so until we're like until we get to the top 30 and they're like oh Biomutant then got a problem then we got a problem I saw Greg Miller on TikTok playing Biomutant and I had flashbacks to when I played and I was like oh **** you got to turn that game off click bro hey if you like this list so far the first 10 put a one in the chat if you have issues with this list put a two in the chat if you're watching live on YouTube and on Twitch so engage your interest on The Vibes right now one for you like it two you don't",
            "start": 2403.92
        },
        {
            "text": "in the chat if you have issues with this list put a 2 in the chat if you're watching live on YouTube and on Twitch so engage your interest on The Vibes right now one for you like it two you don't like it and we'll uh just take a quick little super fast look at it right now yeah and I also um want to shout out super chats right uh my thing as we go through if you see a game and you're like that should be higher that should be lower Super Chat in and let us know why yeah we want to hear from you I love that if you look if you're looking at Chrono Trigger and you're like oh that should be top 10 write in let us know and we'll read it um I will read the super chats that we have already though uh Gator mashed potato writes in it says Gator glad you had a chance to finish Mouthwash it definitely may not be everyone's cup of tea but it does some pretty awesome things I'm happy I played it at the end of the day you know we talk about me stepping out of my box trying different games I'm",
            "start": 2440.16
        },
        {
            "text": "may not be everyone's cup of tea but it does some pretty awesome things i'm happy i played it at the end of the day you know we talk about me stepping out of my box trying different games i'm happy i at least played it i'm happy the time length was only two and a half hours anything past that probably would have stopped to be honest with you but like it was a good game to at least try and step out i agree and i'm i'm glad i played it also for the fact that even though it wasn't all the way my cup of tea it is the kind of game i was looking for i was looking for something that was going to like move me in a way or something that would that wanted to tell a unique story something that seemed interesting and like you know different from a lot of other games i played and so yeah mouth watching definitely filled like that thing i was looking for in the moment yeah uh ain writes in and says best fun duel they'll always give me a good laugh and smile thank you much for watching give me one",
            "start": 2478.52
        },
        {
            "text": "definitely filled like that thing I was looking for in the moment yeah uh Ain writes in and says best fun duel they'll always give me a good laugh and smile thank you much for watching give me one of those give one of come on now uh Zeke says real quick Barrett thank you for pushing Citizen: Sleeper yesterday started playing this morning and oh God I'm hooked fellow TTR RPG nerds is literally the game version of BL of Blades in the Dark I do like Blades in the Dark oh did I play Citizen: Sleeper yesterday apparently apparent according I might I've never played it Andy is the one who constantly Roger were definitely hyping it up and then yeah I think Greg mentioned it but yeah there was a conversation about it I I mean I think I was talking about a little bit too but um I I checked cuz I could have sworn I had started Citizen: Sleeper okay but then I checked my Steam library and I didn't own it and then I checked my PlayStation didn't own it and I'm like where did I play Citizen: Sleeper okay",
            "start": 2513.32
        },
        {
            "text": "sworn I had started The Witcher 3: Wild Hunt's Gwent mode, okay but then I checked my Steam library and I didn't own it and then I checked my PlayStation didn't own it and I'm like where did I play it? The Witcher 3: Wild Hunt's Gwent mode, okay I don't think I have it on Switch was it on Xbox Game Pass at some point chat oh maybe cuz I definitely started it and now I I really want to go back to play it so let me know um Sheffield Boulevard just writes it and says Gwent um Gwent yeah I love that Smoking Joe 420 wrote in and said uh I bet Elden Ring isn't on the list well you're wrong you're wrong about that um myin 5820 says the thing with video games in general is they are so subjective and with this list so far I am so pleasantly surprised how much variety it has been so far no complaints so far there we go I like that um and then George Huffman says Hades needs to be also love you guys we should save that for the three of us and maybe the audience at the end we can pick one or two games that we think should be included and have a quick",
            "start": 2557.08
        },
        {
            "text": "Huffman says Hades needs to be also love you guys we should save that the three of us and maybe the audience at the end we can pick one or two games that we think should be higher and have a quick conversation. I like that, I like limiting ourselves to two games, one or two, and just say hey this is up here, this should be down here. I agree with that, you know what I mean. I like that we can have that. All right, let's move on from number 40, let's hit number 39. We got God of War (2018) being listed right. It's interesting because when you start talking about these games and start talking about how recent games have been and the popularity of them, you think something like a God of War would somehow creep into the top 10 right? So I am interested in like, man they're putting some really great games from Elden Ring to this that are like taking over the world recently. What's the top 10 that this isn't in there? I like this, I like this, this is a respectable spot for a top 50. I agree also with God of War.",
            "start": 2603.96
        },
        {
            "text": "Elden Ring to this that are like taking over the world recently what's the top 10 that this isn't in there I like this I like this this is a respectable spot for a top 50 I agree also with God of War the thing that surprises me though is that it's the first God of War or it's God of War 2018 and not Ragnarok but I think it's a similar thing to The Last of Us where people have more fond feelings about the first one and like maybe the second one is technically better but like there's there's more love for the first entry you like Ragnarok more than God of War 2018 yeah good to know good to know uh at number 38 we got Shadow of the Colossus wow I doubt you straight up called it bro hey this like when we get to the end this might be one of the ones where I'm like they should be top 10 like Shadow Colossus all time okay um but again I'm not mad at it on the list of period right like I feel like to your guys' point I think it's one that you could",
            "start": 2648.48
        },
        {
            "text": "where I'm like they should be top 10 like Shadow of the Colossus all time okay um but again I'm not mad at it on the list of period right like I feel like to your guys' point I think it's one that you could easily forget think so um when you're thinking about like you know the popular stuff the big stuff the Fortnite, Fornite Nights the League of Legends all that stuff like Shadow of the Colossus belongs on this list oh that's great one at number 37 we got Pokémon Gold and Silver oh nice I would almost I'm almost kind of surprised by how low this is low yeah okay like I kind of would have thought this would like a Pokémon if this is the one Pokémon game which I right now I'm assuming it is I would think top 25 but I'm not again I'm not mad you think surise let's say this really quick do we think we see another Pokémon no I don't think so yeah okay cuz I don't know if there's one that I would say is better than gold and silver what like red and blue the OG original original if they're if they're going for",
            "start": 2693.88
        },
        {
            "text": "Pokémon no, I don't think so, yeah, okay, cuz I don't know if there's one that I would say is better than Gold and Silver. What like Red and Blue, the OG original, original? If they're going for impact, yes, I could see it, yeah, being higher. I think it's weird cuz like Gold and Silver is better, I overall even though like I prefer Red and Red and Blue cuz like childhood Nostalgia of course, Gold and Silver, I think is the one you pick when you're making a best of list, yes. Well we're going to that's cuz we're going to play HeartGold and SoulSilver for Nick's nuzlock number two. This will be my first time ever seeing that cuz I am just an OG 151 are not ready it's so like I I I don't even know what this is I'm very excited to see and number 36 we got Super Smash Man they're cooking, we didn't call that Smash Ultimate CH or smash ultimate FR oh ultimate yeah ultimate's the right one yeah I I mean I think it's the right one like they could have an argument for Melee but I do think",
            "start": 2736.4
        },
        {
            "text": "we didn't call that Super Smash Bros. Ultimate CH or Super Smash Bros. Ultimate FR oh ultimate yeah ultimate's the right one yeah I I mean I think it's the right one like they could have an argument for Melee but I do think ultimate is the choice to go with I love that it's on this list I love that I mean fantastic we didn't even think of that one on ours because there's just so many games to try to put out in five minutes of guessing games but like yeah smash is on there for uh again I can't believe Sora is in it they might I think they're going for like the two thumbs up for me man like I've never given a two thumbs up on the show before but like they're tracking well halfway through it though bless they're tracking so well now y'all you're right eating your words they got Super Smash Bros. Ultimate on here like they know what they're talking about they know what they're doing they got some Gamers over there that you know what Rolling Stone known for being taste makers they are Rolling Stone Rolling Stone we respect",
            "start": 2780.2
        },
        {
            "text": "what they're talking about they know what they're doing they got some Gamers over there that you know what Rolling Stone known for being tastemakers they are Rolling Stone Rolling Stone we respect you so far let's see if that respect continues after the ad break of course you can go to kindafunny.com patreon or patreon.com is kindofunny or you can go to youtube.com/kindafunnygames and Spotify and apple podcast you get the kindafunny membership which allows you to get shows ad-free and speaking of ads let us tell you about our sponsors this episode is brought to you by Rocket Money you sign up for something forget about it after the trial period ends and then you're charged month after month after month the subscriptions are there but you're not using them in fact 85% of people have at least one paid subscription going unused each month thanks to Rocket Money you can see all of your subscriptions in one place and cancel the ones you're not using anymore and save more money rocket",
            "start": 2820.4
        },
        {
            "text": "least one paid subscription going unused each month thanks to Rocket Money you can see all of your subscriptions in one place and cancel the ones you're not using anymore and save more money Rocket Money has helped multiple members of Kinda Funny learned they were still paying for things that they totally didn't even realize Rocket Money is a personal finance app that helps find and cancel your unwanted subscriptions it monitors your spending and helps lower your bills so you can grow your savings Rocket Money has over 5 million users and has saved a total of $500 million in canceled subscriptions saving members up to $740 a year when using all the app's premium features cancel your unwanted subscriptions and reach your financial goals faster with Rocket Money go to rocketmoney.com/kindafunny today that's rocketmoney.com/kindafunny Rocket Money.com SL kind of funny and we're back RZ Jones writes in with a super chat and says in my opinion Batman: Arkham City should be higher it's what",
            "start": 2864.56
        },
        {
            "text": "\"funny today that's rocketmoney.com kindafunny rocketmoney.com SL Kinda Funny and we're back. RZ Jones writes in with a super chat and says, 'In my opinion, Arkham City should be higher; it's what set the standard for superhero games.' I believe that's what Barrett said or Mike. I had that, yeah, the blueprint, yeah, me and Barrett I think me and Barrett both agree on that one. I think it's a very good game. I think for a top 50, I think it's in the right spot, and I only say that like if it had a bigger impact on a **** ton of more superhero games after it; yes, maybe higher but like how many realistically how many big superhero games have we seen since then that have like really... I don't know been super successful. And then Yang fan writes in and says, 'Bless, I love that you'll always champion Shadow Colossus.' Oh, you know, Blessing's your guy for that; you know he'll talk one day, I'll play it and I'll understand or not. It's the thing where you know what actually... I'm telling people to play\"",
            "start": 2907.92
        },
        {
            "text": "Colossus, oh you know it, Blessing's your guy for that, you know he'll talk one day, I'll play it and I'll understand or not. It's the thing where you know what actually I'm telling people to play Shadow of the Colossus cuz it is a weird game to play in 2025 right like the controls even with the remaster yeah cuz they didn't change like how the game plays, and nor would I want them to like that game in 2004 whenever it came out right like was such a mind-blowing thing but it is also a hey this is designed a particular way because we want you to feel a feeling of struggle and frustration at times of trying to climb a thing that feels that's like trying to shake you off, and all this **** and so like I've I've recommended enough to people on on shows and stuff where like I get tweets back and they're like I didn't like it and I'm like well I can't do anything about that old game is a little old but I still I still do think it holds up in terms of the Artistry of it, it's a beautiful game all right.",
            "start": 2953.24
        },
        {
            "text": "like I didn't like it and I'm like well I can't do anything about that old game is a little old but I still I still do think it holds up in terms of the Artistry of it it's a beautiful game all right we're moving on to number 35 which is Sonic the Hedgehog 2 they cooked man wow they cooked wow didn't think of Sonic I just saw be walk out which he's not mad I'm sure he's going to fix something yeah yeah but the way he just walked out the door as as said Sonic 2 um surprised they went Sonic 2 instead of Mania Sonic Mania I would say is like the best one that's the bundle of them all right well it's like it's a new game but it is like kind of like the best of like they have returning levels and all that **** but when you're talking about Classic Sonic Sonic the Hedgehog 2 is my favorite it has all the levels that you want right it has sounds The Sounds the looks they have Chemical Plant Zone They introduce Tales it's a it's such a good I think this is an insane pick and that's why I",
            "start": 2995.96
        },
        {
            "text": "it has all the levels that you want right it has sounds The Sounds the looks they have chemical plant zone They introduce Tales it's a it's such a good I think this is an insane pick and that's why I did walk out and not because my lunch got delivered okay because we all know the only good Sonic game is Sonic Mania you know Sonic the Hedgehog 2 is so good it's a classic I love this it was pushing Sega at the time right like you got to talk about impact right if you cons if you rewind time this was what you saw on the front of every box this was the game that was getting plugged into that cartridge all the time or into that console all the time that's the game I love this Y and number 34 you got Hollow Knight I gotta play this game there such a variety on this list I listen to Rolling Stone right now is batting better than like video game websites on this list like I love The Gamer but The Gamer ain't having a list like this they don't got",
            "start": 3037.68
        },
        {
            "text": "St your staff had sewers on it Rolling Stone is currently doing better than video game websites on this list, I love The Gamer but The Gamer ain't having a list like this, they don't have a list like this, this is crazy so far, this one's cooking, this one's cooking, I like that at number 33 we got hold up, really quick let's just roll back to that it's that good, I haven't played Hollow Knight okay I just know how much people love playing it yet almost everybody who's played Hollow Knight says it's that good though really yes okay good to know I'll put it on my list I bought if you wrote this sequel is like one of the it's an indie it's a sequel to an indie game and it's one of the most anticipated games of all time in the last eight years, that's my issue is like as someone who hasn't played this I have apprehension on this pick really for top 50 think it's just like I'm getting in the me I'm getting in the social media bias of like everybody's screaming Silent Song This got to be the best",
            "start": 3083.84
        },
        {
            "text": "this I have apprehension on this pick really for top 50 think it's just like I'm getting in the me I'm getting in the social media bias of like everybody's screaming silk song This got to be the best game ever now I haven't played it maybe it is the best game ever so I mean judging from not the best game ever it's the 34 you know what I mean it's on the top 50 it's on the top yeah yeah I mean I this is me just going from word to mouth and like this is this is where I come back to those iconic picks the popular picks the impactful picks but then The Game Awards game picks this is definitely a Gamers game pick where it's like oh if you know Hollow Knight and if you played Hollow Knight like you know it's one of the ones and I say that somebody who hasn't played Hollow Night right but again I hear Andy I hear the internet talk about it I'm just letting you know I bought it I'll play it and I I'll let you know I also got to play this maybe this is one of the ones I go to kind like that we play it",
            "start": 3127.08
        },
        {
            "text": "I hear the internet talk about it, I'm just letting you know I bought it, I'll play it and I I'll let you know. I also got to play this maybe this is one of the ones I go to kind like that we play it together we talk about it. Play this and then play Nine Souls at number 33. We got NBA 2K11 - oh wow, 2K 11, this is the Michael Jordan one. Uh yes, this is the time so right now if you were to ask young Mike there was a time between 2006 to 10 when there was a a meteoric shift between NBA Live and NBA 2K it used to be all about NBA Live we loved the controls we loved the gameplay and somehow 2K took over whether you liked it or not. 2K became this juggernaut that is now to this day uh still the number one right, it's the only basketball game sim that you can find around they killed NBA Live Like It Is that big of a deal I I I don't know if I put it on my top 50 I did have the discussion of like what sports game makes the top 50 right and so like at this moment if you were to look back at it you",
            "start": 3164.72
        },
        {
            "text": "Is that big of a deal? I don't know if I put it on my top 50. I did have the discussion of, like, what sports game makes the top 50 right? And so, like, at this moment, if you were to look back at it, you brought it up during Game Showdown, right? This is when we started the Superstar Moments collection, right? Of like MJ had its own moments collection. Now every sports game has a \"Hey, here's highlighted moments from a superstar that changed the game\" that started with MJ right here in that collection. And that, like, influenced MLB and like other sports games. The fact that this is above every single one of the games that we've talked about so far, I think to me at least is insane. Um, they lost me on 2K is Big, that's that's I understand, but and that's my get it for impact. I remember like this game, like I remember playing it every week, like sometimes every day with friends back in college, and it being such a big thing, and like, like being obsessed with it. And so, like, I to some extent it's the tough thing of",
            "start": 3213.12
        },
        {
            "text": "playing it every week like sometimes every day with friends back in college and it being such a big thing and like like being obsessed with it and so like I to some extent it's the tough thing of when you are an annualized franchise and you have 2Ks coming out every single year that we become numb to it we forget how **** good 2K is as a basketball game and sometimes terrible uh don't get me wrong I understand that especially nowadays 2K has so many issues but like if 2K 11 came out and no other 2K came out after it we' be like oh that's like a top video game of all time right like those games are a **** moment I remember how good those looked on PS3 to the point where like I'd be playing it uh on like a friend's um uh TV during a party and like people would walk by and be like yo that looks like that looks real and we're playing on PlayStation 3 mind you people are looking looking at this game like this looks like a real life thing like that this game was the poster shot for NBA",
            "start": 3265.52
        },
        {
            "text": "that looks like that looks real and we're playing on PlayStation 3 mind you people are looking looking at this game like this looks like a real life thing like that this game was the poster child for this show this to somebody the sweat physics sweat physics we talked about it on a top 50 games list you probably have to have one sports title I I I would you have to have a sports title somewhere you think we're going to get another one we got 2K we're going to get FIFA on here yeah for sure I think this is your only Sports title um but I I understand Bears coming from as far as like oh he puts his in he put I don't know where you put that I think we could make an argument this should be towards the 50s It's the weird thing of with my assumption that there's more like if you put all the sports games you can't put all the sports games in 40 to 50 450 is going to be made up of Sports Games 33 does feel high um and it does get weird when you think about like ah you're putting this above",
            "start": 3312.84
        },
        {
            "text": "game you can't put all the sports games in 40 to 50, 450 is going to be made up of Sports Games. 33 feels high, um, and it does get weird when you think about like, ah, you're putting this above like Alundra and all these other Pokémon games, like NBA 2K11. No, it's not above Pokémon in no world, in no universe, in no timeline is it above Pokémon. Um, but this is one of those ones too where I think like you got to put it somewhere. I think it should be lower; it should be lower. You know what? I'm not right now. I thought you had to have a sports game; I'm not mad at it. This is probably not the sports game I would pick, but when we talk about NBA 2K and what that is, uh, it's it is one of the more quality picks for a sports game, especially a sim sports game. It's a very quality pick, one of the more quality picks you can go for. And number 32, we got Pac-Man, Miss Pac-Man specifically. What's up with Miss Pac-Man versus The Original Pac-Man? Is there a difference? I think a lot of people would prefer",
            "start": 3352.96
        },
        {
            "text": "you can go for and number 32 we got Pac-Man, Ms. Pac-Man specifically what's up with Ms. Pac-Man versus The Original Pac-Man is there a difference is there I think a lot of people would prefer Ms. Pac-Man how come like what what are the key points to that it's basically the sequel like I'm telling you this is somebody who was not live in 1982 but as far as I understand about Ms. Pac-Man it's like basically re like you know revamped I don't know if the mazes got different as they go or whatever is saying it's the better version it's faster um it's a bit harder and stuff like that game feel is better cool cool that's great okay yeah I think Pac-Man's on list qu remember when we played the Pac-Man Battle Royale last year we had Pac-Man in the building I do remember that that was awesome great time great I have a great photo of me and Pac-Man at number 31 you got Counter Strike yes I was going to say do we see a counter-strike or a valorant on this",
            "start": 3395.8
        },
        {
            "text": "Remember, that was awesome. Great time. Great. I have a great photo of me and Pac-Man at number 31. You got Counter-Strike yes. I was going to say do we see a Counter-Strike or a Valorant on this? You have to put one of the OG goats greatest of all time on there. Jabronis are still playing Counter-Strike, sure. We have Counter-Strike too, but they were still playing Counter-Strike one before that. Uh, this is one of the goats of the first-person shooter competitive tactical shooter genre. It has to be on here. Yeah, they're going for a lot of classics. Yeah, they're going for a lot of classic games on there and number 30 you got Wii Sports I knew it would be on there. Someone broke Wii Sports earlier and I forgot how special that was. We everybody was in their grandma's basement, their best friend's basement. We numchuck hooked up to their arm swinging for the fences. Yeah. God this was one that like wasn't in the same way that we're I'm talking about 2K1 and like like NBA 2K and how that was a shift and how",
            "start": 3441.52
        },
        {
            "text": "numchuck hooked up to their arm swinging for the fences yeah God this was one that like wasn't in the same way that we're I'm talking about 2K1 and like like NBA 2K and how that was a shift and how like that was still popular with Sports is like that on cocaine where like every household like if you're hanging out at somebody's house if they got a Wii oh we're playing baseball baby oh we're playing tennis oh we're boxing is right yeah we're bowling through the television scene videos are going viral on YouTube.com of people throwing their weight into their TV like this is a you want to talk about like games that moved the world and shifted the world like yeah Wii Sports is one of those the Wii and this changed the world for a couple of years there but that's it was We Mania for sure for sure before we go on let's get a quick check-in I need everybody if you're watching live on Twitch and on YouTube give me ones in the chat if you're liking the list thus far give me twos",
            "start": 3483.4
        },
        {
            "text": "\"Sure, sure, before we go on, let's get a quick check-in. I need everybody if you're watching live on Twitch and on YouTube give me ones in the chat if you're liking the list thus far, give me twos in the chat if you've now changed your minds and don't like the list thus far, and of course, super chat away with any of your questions, comments, concerns about some of these picks so far. But I'm seeing still a lot of ones, a lot of people still riding with this right now, there are some twos, but I'm seeing a lot more ones. I got myself on the one side, I would say like it's hard to argue against this at 30 above a lot of the other games that we've seen so far just because of how big of an impact it had. Yeah, although I don't think it's as good as a lot of the other games on this list, but yeah, this was in every household. AK writes in with the Super Chat and says 'Do we see Pong on this list?' I'm leaning yes, I also lean yes, I think they're going for so many classic picks.\"",
            "start": 3525.08
        },
        {
            "text": "but yeah this was in every household Alex writes in with the Super Chat and says do we see do we see Pong on this list I'm leaning yes I also lean yes I think they're going for so many classic PCs they're going for so many formative games and go with the OG of OG's yes you're gonna go with Pong I'm gonna go no okay I'm gonna go no too high to see Pong at this point yeah I just don't I I I don't see Pong fitting this list right now it just doesn't feel right but I agree with you like they they are definitely hitting the hey what has really left an impact and Pong would be up yeah I think it's the tough thing of maybe we don't see Pong because they do lean toward Tetris and like we're going to see more classic things but there are I mean in terms of greatness there are way better things than Pong right like Pong is I mean the video game when you want to talk about like the thing that got the ball rolling like that's Pong but yeah who knows and also at the beginning of in the original",
            "start": 3565.16
        },
        {
            "text": "Pong right like Pong is, I mean, the video game when you want to talk about like the thing that got the ball rolling like that's Pong but yeah who knows. And also at the beginning of the original Blur right they talked about things aging well as well of course you know of course I mean not to say Pong didn't age well cuz very simple game, you still play Pong, you still have fun. But I think there are other games you think of like oh I'm going to I want to play this still and that's Tetris. Tetris might be top two yeah I think Tetris is gonna be in your top five guaranteed yeah uh RZ Jones writes in and says should a Call of Duty be on this list, in which one we talked about that a little bit we talked about that at the beginning uh we were thinking the the Modern Warfare and the Call of Duty Black Ops they probably those original ones yeah Simon Cardin R in and says I think I think IGN's PlayStation list was better and written by Handsome funny people anyway if if Shadow of the Colossus is in",
            "start": 3611.64
        },
        {
            "text": "Black Ops they probably those original ones yeah Simon Carter in and says I think I think IGN's PlayStation list was better and written by Handsome funny people anyway if if Shadow of the Colossus is in top 10 we Riot listen I love the passion from Simon I love the passion Carter you might as well start the riot now because it wasn't top 10 it was not top 10 uh ban SN says Arkham is important for licensed games in general not just superhero games fall in order Indiana Jones Harry Potter Alien: Isolation Arkham did that that's fair you know what I'm not mad at it rings I'm not mad at it you're preaching I like that and people also shouted out the combat system which everybody did ape after Melo fellow writes in it says will we see Undertale on here bless Barrett we see no I want it on here I would I would be especially like the trajectory we see this list going and shouting out a lot of old school games I would more likely see Earthbound down here than Undertale I'm going to say yes I think",
            "start": 3648.2
        },
        {
            "text": "I would be especially like the trajectory we see this list going and shouting out a lot of old school games. I would more likely see Earthbound down here than Undertale. I'm going to say yes, I think the fact that we're getting picks like Hollow Knight on here, I think they got their ear to the ground as far as like all different kinds of video games. Like I think Hollow Knight is a good Indie pick and I think we saw maybe a couple other Indie picks. I think Undertale is in that conversation for sure. Like that um man we got a lot of super chats coming in, shout out to Y'all it's coming Kab says I would have picked Sonic 3 and Knuckles on the grounds that it has a save system and two does not yeah but my opinion too has more iconic levels man okay Chemical Plant Z you would you would know best. I like that it weird that neither of you pick Mania which is the only good one Bless brought up Mania, yeah no I mentioned that like I would I think I would have gone Mania over to but I also",
            "start": 3693.64
        },
        {
            "text": "best I like that it's weird that neither of you picked Mania, which is the only good one. Bless brought up Mania, yeah, no, I mentioned that, like I would. I think I would have gone with Mania over to but I also like the fact that they're going for a CL like Sonic 2 more. I think more people play it's more you know... I understand why more parents right, like more people in more generations probably played Sonic 2. Think about the like we talked about the box the Genesis at that time, that was it, that was it. Um Zeke writes in and says popularity doesn't always equal quality but many of these games are/were popular for a reason they were genuine trendsetters had revolutionary gameplay or represented the best of the genre, that's NBA 2K like you know I think that that can be made for NBA 2K in a lot of all these games but like when you think of odd ones that aren't quite fitting the mold, NBA 2K fits that to a tee for what it did um Stone",
            "start": 3735.72
        },
        {
            "text": "You know, I think that can be made for NBA 2K in a lot of all these games, but like when you think of odd ones that aren't quite fitting the mold, NBA 2K fits that to a T. For what it did, Rolling Stone says is we is Wii Sports the best system seller ever. It might depend on how you define \"best,\" but I'm going to say yeah, give me a better one, yeah, find me a couple better ones. A system seller like would we count Mario 64 as a system seller? I'm going to say yes, for Wii. Oh, oh, Tetris, Tetris was a system seller. You can't, yeah, it's Tetris, it's Tetris, okay, that's a good one, chat. Um, and then the last one for now, Samson L writes in, it says Minecraft top five, calling it now, Minecraft, GTA 5, Red Dead Redemption, Red Dead Redemption. I'm just trying to now, I'm having fun part of my mind like what's top five here? Tetris, Minecraft, GTA 5, Red Dead, see, I'm with you on the first three, I'm not with on red, like I'm just throwing like you know what I'm gonna say Portal, okay.",
            "start": 3779.56
        },
        {
            "text": "of my mind, what's top five here? Tetris, Minecraft, GTA 5, Red Dead. I'm with you on the first three, I'm not with you on Red Dead - I'm just throwing in what I think I'll say, Portal. Okay, portal, portal, I like portal on that. It's fun to be able to say it now. You start chewing chat, now you start thinking. Thinking, I'm like, what is... cuz you're seeing we've seen 20 so far. Let's get into the next one at number 29. We got Uncharted 2: Among Thieves. Holy **** they went with Uncharted! Wow, they did. I'm surprised that means Last of Us is definitely top five - that means Last of Us. I see top 10, Tomb Raider was never in my... no, yeah, that was never gonna happen. And the only reason why I said earlier that uh Uncharted wouldn't make the list just because there's so many games and I feel like if they already chose The Last of Us, which would obviously be on this list, they might be a little bit um more reserved about doing like a second Naughty Dog game but yeah not too surprising, yeah they",
            "start": 3830.8
        },
        {
            "text": "already chose the last of us which would obviously be on this list they might like be a little bit um more reserved about doing like a second Naughty Dog game but yeah not too surprising yeah they picked I mean I'm more of an Uncharted 4 person that said Uncharted 2 is I think the right decision it should be three it was a like it was I think it it took the franchise to another level Uncharted one came out it's like okay cool like Uncharted Uncharted 2 came out and like the way it opens up in that train scene I agree oh I mean Uncharted is the modern day Indiana Jones the globe trotting Adventure that everyone wants to go on and everyone wants to see it's a ton of fun it was a fantastic ser uh yeah I would I I would agree with Greg here I think a good amount a good handful of games it's above I don't necessarily agree with yeah but the influence it had in terms of more kind of like especially in like that PS3 era of like really pushing the limits of how like film feeling can be",
            "start": 3884.6
        },
        {
            "text": "above I don't necessarily agree with yeah but the influence it had in terms of more kind of like especially in like that PS3 era of like really pushing the limits of how like film feeling uh can be right yeah cinematic that was the word I was looking for uh film feeling also sounds good though um yeah alliteration we get Uncharted on the list and that's and to double down also to bring up a chat I saw come and go right somebody mentioned like it's arguably maybe the most influential like PlayStation game when you think about what PlayStation is nowadays you don't get like in the way that we talked about Last of Us being the turning point it's that weird chain effect of you don't get The Last of Us without getting Uncharted right and like Uncharted 2 to Bar's Point cemented what this is in terms of the cinematics of it in terms of like the large than life nature of it you don't get SOCOM without Uncharted 2 you don't get God of War like modern a lot of what links to The Last of Us I was going to ask you is",
            "start": 3932.64
        },
        {
            "text": "the cinematics of it in terms of like the large than life nature of it you don't get SOS without Uncharted 2 you don't get God of War like modern a lot of what links to \"The Last of Us\" I was going to ask you is Uncharted the turning point for PlayStation that goes into that narrative driven you know third person action adventure game that everyone loves and adores and wants all the time 1% is this the moment it was Uncharted yeah I agree with you I think it is even though like again the original Uncharted Trilogy I didn't vibe as much in terms of like gameplay and stuff right like I didn't really vibe as hard until Uncharted 4 and I was like yo this is **** fantastic I respect it like got respect okay that's a big one and number 28 we got Minecraft wow okay really thought this would be in the top five I like it here maybe it was the chat's influence but I also think like Minecraft is Mega big yeah like of course I'm still giving it a thumbs up it has to be on this list I I I mean top five",
            "start": 3978.48
        },
        {
            "text": "top five I like it here maybe it was the chat's influence but I also think like Minecraft is Mega big yeah like of course I'm still giving it a thumbs up it has to be on this list I I I mean top five feels like it would have been too high I guess in terms of like it's one of the most popular and iconic games yeah but is it one of the best a game that gives you the ultimate freedom to do anything uh it sounds like you're talking about GTA V the game that's going to be in the top five Minecraft a game that lets you do anything in everything what if we're not thinking big enough okay there's a game Mike that everybody's playing yeah that is the direct competitor to to Minecraft and it's called Roblox my mind went to that of like oh **** if Minecraft is 28 is Roblox on this list what if Roblox top five is Roblox on this list qu dreams in the top 10 at number 27 we got Resident Evil 4 we didn't even think about it we the chat brought up Resident Evil 4 I was going to ask you do we see a",
            "start": 4024.08
        },
        {
            "text": "top five is Roblox on this list, Quake Dreams in the top 10 at number 27, we got Resident Evil 4, we didn't even think about it, we the chat brought up Resident Evil 4, I was going to ask you do we see a Resident Evil in this and I think you have to have a Resident Evil in the top 50 for sure, where you put it depends on whatever but yeah four, I just got done playing it is incredible, you yeah you had to have Res Evil 4 on the list like again that's when you want to talk about a turning point game in the similar way is Uncharted right like without Resident Evil 4 a lot of those games that I mentioned you also don't get either right Resident Evil 4 I think is like one of the predecessors I would say as far as something like Last of Us was as well like as much as Uncharted um and so yeah Resident Evil for most to all people's minds yes not two four or two more people would a lot more people would lean forward we go four then two four then two yeah okay okay I like",
            "start": 4068.88
        },
        {
            "text": "for the Resident Evil yes in MO in most to all people's minds yes not two four or two more people would a lot more people would lean forward we go four then two four then two yeah okay okay I like that I'm I'm happy with this I liked four as someone who's now played two four five six seven and eight I've almost completed the series I know there's some more I'm missing like three and a couple earlier ones but like I I'm having a ton of fun with these earlier ones like four it was a great time number 26 we got Mass Effect 2 has to be on there has to be on there the Epic sci-fi Adventure Epic Skyrim is probably top five right sky Skyrim might be in this top 20 right here Skyrim might might be right here at number 25 we got Stardew Valley okay I have not played stardew valley I haven't sold my soul to the farm life yet um you know cultural impact people like it a lot of people love stardew valley a lot of people love stardew valley at number which we already got Animal Crossing we had Animal",
            "start": 4108.56
        },
        {
            "text": "soul to the farm life yet um you know cultural impact people like it a lot of people love Stardew Valley a lot of people love Stardew Valley at number which we already got Animal Crossing we had Animal Crossing at 50 50 yeah see Animal Crossing at 50 in Stardew Valley at 25 I for the Cozy people in the chat yeah does that seem right to you I think it sounds right above Minecraft it's in that same realm yeah the Minecraft Stardew Valley Animal Crossing realm even though that's like a weird um what do they call it V diagram but I would I would have thought Animal Crossing: New Horizons above Stardew Valley but also the way that Stardew Valley was able to uh especially it being an indie game break past like just the gamer sphere where it's like my mom who never plays video games and hasn't played video games since Tiger Woods PGA Tour 2005 like plays Stardew Valley like shitty like there are so many people who **** with that game and there's so many like quality of life things as a farming life",
            "start": 4160.84
        },
        {
            "text": "games since Tiger Woods PGA Tour 2005 like play Stardew Valley like shitty like there are so many people who **** with that game and there's so many like quality of life things as a farming life Sim thing that people love and still play to this game uh play to this day N9 years later right whereas like do people talk about the most recent Animal Crossing like that five years later a lot of people are **** with Stardew Valley over they are yeah with all yeah they're pretty much everybody in chat is like no Stardew Valley is the one yeah and like kind of and to the point right somebody mentioned like kinda redefined or maybe even like Define the Cozy genre like where cozy games a thing before Stardew Valley play it one day it's on my list of like one day I'd like to try it I just I don't know um at number 24 we got the Sims have to H you have to have the Sims on this is right it it this one changed the world this one was special man I still played in The Sims in this day I have the OG",
            "start": 4213.08
        },
        {
            "text": "um at number 24 we got the Sims have to H you have to have the Sims on this is right it it this one changed the world this one was special man I still played in The Sims in this day I have the OG Sims on my computer from 2000 I love this game more than anything it is so good Mike I'm be honest tell me I don't think I'm going to see Hitman: World of Assassination I don't know we'll see hit man you know what but you would be in that room talking and you would get them to think about it you would get consider Hitman: World of Assassination just think about it I think now that we've hit the Sims part of the list it's like yeah no hitman's not going to fit me we're going for the best of the best we now we're at the like we're at the cream of the crop right like if you weren't they weren't talk about this game on CNN you're not on list like we're going mainstream mainstream now shout out to The Sims for making the list Sims well deserved got to be on there and number 23 we got Tony Hawk's Pro Skater",
            "start": 4256.84
        },
        {
            "text": "this game on CNN you're not on list like we're going mainstream mainstream now shout out to The Sims for making the list Sims well deserved got to be on there and number 23 we got Tony Hawk's Pro Skater the first one there's our skater interesting that they went one instead of two or three two yeah it should definitely be either two or three one I think probably just burst onto the scene and showed people what could be what was from the soundtrack to the grinding to the tricks not being overly super real life simulation and more being the arcadey fun that people want I and two does all of that but just way better that's the one people still think about to this day over the first one I I wonder yeah we like we'd have to call Rolling Stone and say can you give us the reason why one over two I mean we have the uh blurb here right Tony Hawk Pro Skater remains one of the best examples of the intersection between games and culture as you take control of 10 real life pro skateboarders from",
            "start": 4298.36
        },
        {
            "text": "I mean we have the uh blurb here right Tony Hawk's Pro Skater remains one of the best examples of the intersection between games and culture as you take control of 10 real-life pro skateboarders from Chad Muska to Tony Hawk himself. The world of extreme sports becomes an open playground, rife with experimentation as your tasks involve chaining together some of the most ludicrous physical feats possible for a wholly satisfying score attack or you can face-plant hard into the ground, which has its own novelty. Um, yeah, they don't really go into like what Tony Hawk's Pro Skater is a way of experiencing the thrills of skateboarding, yeah, they don't go into like why this one. Um, I'm not mad at it though, like again, like Bobby B. Bob Burrows, at a certain point, it's like you know what it doesn't really matter but Tony Hawk's Pro Skater is cool, like again, great game, impactful game led to a franchise right, like I think that's an impact enough see Tony Hawk on this which I asked.",
            "start": 4344.56
        },
        {
            "text": "what it doesn't really matter but it Tony Hawk's Pro Skater cool like again great game impactful game led to a franchise right like I think that's an impact enough see Tony Hawk on this which I asked you guys sports game beyond there and Barrett and you both said yeah I think Tony Hawk it's on the list 23 too and I think that's good the top half I think Tony Tony Hawk game deserves to be in the top5 yep I like that and number 22 we got Call of Duty Modern Warfare have to it have to have it man this is when Call of Duty really put on this 2000 this like 2005 to 12 window here was like Call of Duty taking over the world and it became like oh we are going to be the one from this point forward and we're going to push this out every single year and we're never going to change and people are going to love this and yeah this is the moment right here yeah do we still see Halo uh yes I do still think you see Halo for the cultural relevance of it being that first first person shooter to come onto a",
            "start": 4384.0
        },
        {
            "text": "to love this and yeah this is the moment right here yeah do we still see Halo uh yes I do still think you see Halo for the cultural relevance of it being that first first-person shooter to come onto a console with the controller having the twin thumb sticks and that kind of how special that was I do think you see that yes and number 21 we got Fallout 3 I love it I you I love it it there was some Bethesda title that had to be here Skyrim is still I'm shocked that this is here you're shocked by Fallout really well I think because we've gotten this far not that it's on the top cuz like I think I would have expected it from 25 to 50 the fact that we're at 21 and they're saying Fallout 3 I think surprises me because I'm Al I'm almost like wow I'm surprised you didn't go with New Vegas because New Vegas is more the fan favorite pick right yeah but three three's the one that changed the game yeah when you think about impact which now that we're getting to this top half these feel",
            "start": 4433.4
        },
        {
            "text": "Vegas is more the fan favorite pick right, yeah, but three, three's the one that changed the game, yeah, when you think about impact. Which now that we're getting to this top half, these feel more of like what shifted the culture rather than what is the better installment, which I get, I don't fully agree with, I feel like you got to find a balance between the two, but yeah, yeah, I mean Fallout 3 is in my top 20 games of all time, absolutely love so I'm happy with this pick, I like seeing Fallout, I think uh we're riding a high of course off the TV show and how good it is, but like yeah when you go back to 2008 Fallout 3 was very very good right, you're talking about Oblivion, this is before Skyrim, they take you to a wild Wasteland, you know it was a fun time, it was really special having the VAT system, having the crazy story, it was this is a good time, good, GG, yeah, radio man Y and number 20 we got Mario Kart 64, yo, yeah, this is impact, this is not the better best iteration.",
            "start": 4478.36
        },
        {
            "text": "the vault system having the crazy story it was this is a good time good GG yeah radio man Y and number 20 we got Mario Kart 64 yo yeah this is impact this is this is not the better best iteration this is definitely impact but I'm fine with it because this hits me cuz here's the thing I and I know Barrett is definitely on the opposite side of this as far as I when I think of Mario Kart I immediately think of Mario 64 no I I think of 64 first as well but it's just eight Del like eight is the game you know you're right I I know like I can't argue against 64 like how huge that is is infinitely eight Deluxe is infinitely better than Mario Kart 64 but there's something about like but is the top 50 games is it I think it's greatest greatest I think it's on there Mario 64 like just means something man it just means something it was the OG cart racer it put us on it put us on the map it was special man man you had the battle mode in there too that you could play four player co-op on the screen",
            "start": 4522.72
        },
        {
            "text": "man it just means something it was the OG cart racer it put us on it put us on the map it was special man man you had the battle mode in there too that you could play four player co-op on the screen and everybody's together like if I will say if any if anybody walked into this room right now and was like Hey we're going to play Mario Kart which one do you want to play I 10 out of 10 times I'm saying 64 64 I I prefer to play 64 than even acknowledging 8 Deluxe is way better but um this means something to me man let's get a quick check in once again before we move on of course put a one in the chat if you're still rocking with the first 30 here on this list one if you like the list two if you don't like the list let us know in the live chats on YouTube and on Twitch uh we're seeing a little more twos then than normal but we're still seeing a lot of ones right now oh yeah the ones are coming in the Rolling Stone is still killing it right here Rolling Stone still",
            "start": 4576.76
        },
        {
            "text": "more twos than normal but we're still seeing a lot of ones right now oh yeah the ones are coming in the ones are coming in Rolling Stone is still killing it right here Rolling Stone still killing I like Mario Kart 64 I actually love this pick I love this I'm going to say love it love that pick played so many hours of this game might be one of the highest hour counts I have in a video game uh bringing in some super chats for you Jonathan Dosen writes in and says do we see an interactive drama on this list Heavy Rain The Walking Dead Or Telltale's The Walking Dead out of those three I think The Walking Dead has a chance heavy rain never had a chance anything on that I would say The Walking Dead I didn't know if Barrett was going to chime in on that one I was going to say The Walking Dead would be my pick out of that you get a maybe out of me a maybe um Margaret Peterson writes in it says Stardew Valley and Civ 5 we got Stardew Valley let's see if we get Civ five well we man you get real nerdy if you start",
            "start": 4621.16
        },
        {
            "text": "of that you get a maybe out of me, a maybe. Um, Margaret Peterson writes in, it says \"Stardew Valley\" and Civ 5. We got Stardew Valley, let's see if we get Civilization V well, we man, you get real nerdy if you start talking about Civ games like that's when you know... like these are we got game, we got some nerdy picks, we got some real but if they put out a top 20 I think we got maybe I think we got maybe three more like super nerdy picks left so she would be on there then cuz I I think we got I'm going to say three more Super nerdy picks, five more like big cultural impact style picks yeah maybe like gamer's game style picks and then I'll say five surprises where me and you are going to be like oh didn't think about that but good pick yeah I'm still here's my three that I'm looking for right now you ready for this I like the Civ so I'm going to add it on there cuz I think it's wild and interesting yeah Age of Empires 2 and Starcraft will we see those okay I like it just because of the impact what",
            "start": 4656.52
        },
        {
            "text": "ready for this I like the CV so I'm going to add it on there cuz I think it's wild and interesting yeah Age of Empires II and Starcraft will we see those okay I like it just because of the impact what it did you only have 19 games left I was doing I was trying so hard the numbers out try so hard yeah math is hard you know uh whatever W writes him says need some The Legend of Zelda: Wind Waker love a favorite game of all time well let's take a will we see another Zelda here yes yes Zelda unequivocally we might see two oh **** we might see Zelda is that kind of franchise we outside of Mario Kart we haven't seen a Mario yet like a main seen a Mario yeah they're say they're saving both of them for the top 20 it uh haven't seen World of Warcraft that's got to be on this list we not we haven't seen we haven't seen Wild's definitely on this that's got to be up here Zeke speak says Stardew Valley almost stole my girlfriend dangerous game it is a dangerous game if I ever get a girlfriend I'll show her stard",
            "start": 4706.44
        },
        {
            "text": "wild no Wild's definitely on this that's got to be up here Zeke speak says Star Valley almost stole my girlfriend dangerous game it is a dangerous game if I ever get a girlfriend I'll show her Star Valley what is that what you call it this guy's crazy and then George Huff says do we see The Last of Us in Part Two if so which is higher I mean at this point you're only going to see one of them I think yeah Last of Us Part II yeah number one it's number one I don't know I think it's the I think it's half and half like I think it's a 50% shot really I always feel like people talk about one over two all the time you know what I I'll say one maybe it's 60-40 like I feel like there's always a shot of last it being Last of Us Part II instead of one just for like I think just this high on the list it's way more likely we see part one than part two this is exciting chat here we very exciting let's go number 19 we got Baldur's Gate 3 had to be on there had to be",
            "start": 4757.28
        },
        {
            "text": "It's way more likely we see part one than part two, this is an exciting chat here, we're very excited. Let's go number 19, we got Baldur's Gate 3 had to be on there, had to be on there, had to be. Is it low like it? It shouldn't be top 10, we could have that conversation. Yeah, I mean, we'd have to see what's below it here, we'd have to see what's you know on this list but like Baldur's Gate 3 isn't it special that Baldur's Gate 3 was that good made? You talking to a guy that played with Kyle way back in the day, Baldur's Gate 2 on the PC and I don't think anybody even was playing that game or the amount was very low right then have to come out in 2023 and change the world like that. I never would have thought that. I think it's at the right spot for how recent it is. I think a lot of the rest of this list is going to be not games from the last three years, that's a good call. This might be the most recent like and I think they're trying to like maybe fight against the recency",
            "start": 4802.52
        },
        {
            "text": "of the rest of this list is going to be not games from the last three years, that's a good call, this might be the most recent like and I think they're trying to like maybe fight against the recency bias and be like okay, it's definitely up there but like how up there do we feel comfortable with right now being only not even two years removed from Full uh release you know, like that. And number 18, we got Madden NFL 2004 baby, wow holy wow, we're getting a FIFA on the list, we're getting a FIFA on the list, get a FIFA, yo, you think we're getting a you think we're getting a basketball and an American football game and not a **** soccer game, Rolling Stone is you know in us and we don't care about soccer over here, you know. I love it, I love it, I love it 2004 who's on the cover of man 2004 let's take a look was this the one that added the hit stick, this was the game sh on question, this is the one with Mike Vick on it, yeah, this is this is the one that changed the world, yeah, this is the one with",
            "start": 4855.6
        },
        {
            "text": "a look was this the one that added the hit stick this was the game show on question this is the one with Mike Howard on it yeah this is this is the one that changed the world yeah this is the one with Madden about this is the one yeah this is the one if we're talking about like representation on the list and you're going to pick sports games they're picking the right ones man they picking NBA 2K1 and Madden NFL 2014 like you are picking the right eras of these games that said like some of my favorite gaming memories are from this game that's why so much back in the day I want to be mad but then I do think about the memories Barrett yeah d I think about the soundtracks I think about like having friends over and playing like Madden NFL 2004 chat let me like I'm pretty sure this is one with like yeah Blink-182 I think was on this soundtrack like it was Alien Ant Farm on that oh my God I remember like one of my favorite gameplay moments is I think I was playing with my stepdad and the team he was",
            "start": 4904.56
        },
        {
            "text": "yeah Blink-182 I think was on this sound like it was Alien Ant Farm on that oh my God I remember like one of my favorite gameplay moments is I think I was playing with my stepdad and the team he was playing at like literally fumbled and at like the 5 yard line and I picked it up and ran all the way back 95 yards to get a touch and it was like **** like that where let me hit you a couple with them ready for this they have I'm feeling this by Blink-182 I'm feeling this love that and then they got Never Scared by Bone Crusher I ain't never scared what that **** was so good bro Pump It Up by P.O.D. pum Pump It Up holy **** Nappy Roots dude Come Out and Play is in here it's like I told GameOverGreggy this that's why I was so mad at NCAA football this year because I was telling him it's like when you go back to all these sports games in those 2000s era it was the soundtrack you turned it on to what were the top 12 songs that Madden would choose that FIFA would choose cuz that's what would rock with you",
            "start": 4951.84
        },
        {
            "text": "to all these sports games in those 2000s era it was the soundtrack you turned it on to what were the top 12 songs that Madden would choose that FIFA would choose cuz that's what would rock with you through the year and to come into NCAA football and just have drums all time it's like that felt like a slap in the face you know I mean we got we got to elevate that but man shout out you know what this was a choice like it this was a selection here you're going to have some of these and again like I mentioned we're going to have a few picks where we're like oh didn't think that but I'm not I'm not mad for some reason like I feel like I should be mad at this that I am but like I I think it's weird to have it specifically if for if this is the highest sports game we have and maybe it's not still at this point I think it's weird to have it above Tony Hawk one if that's the only Tony Hawk game on this list oh definitely that's my that's my only that's my only gri now quick little Vibe check",
            "start": 4998.2
        },
        {
            "text": "at this point I think it's weird to have it above Tony Hawk one if that's the only Tony Hawk game on this list oh definitely that's my that's my only that's my only gripe now quick little vibe check from the chat uh the live audience is there's they're kind of they're going back and forth on this there's definitely a little bit of like people's heads are popping up like I don't know about this one see here here's the thing right you're mad right now but wait until we get to number 17 and it's something that we all **** with you're going to be back you're going to be back you're going to be back we'll then we'll CL then we'll CL you asked them right now they're all going to say too give give me give us two minutes I'm I like Madden as a sports game generic jabroni as all of you know me as I've played Matt I've played all these sports games every single year so yeah Madden has to be on a top 50 list for sure and number 17 we got Diablo II oh they got M fantastic fantastic selection that's an incredible",
            "start": 5041.56
        },
        {
            "text": "played all these sports games every single year so yeah Madden has to be on a top 50 list for sure and number 17 we got Diablo II oh they got Final Fantasy XIV fantastic fantastic selection that's an incredible choice right there you know what we're so back everybody we're so back at number 16 we got Red Dead Redemption 2 the second Red Dead Redemption we're back we're right back all right now put your ones and twos in chat exactly everybody's cool with this one right now everybody's definitely and number 15 We Got The Witcher 3: Wild Hunt who I thought this was gonna be top 10 oh wow top we're about to get there in a second I mean yeah this top 20 is really you know it's it's tight these are all tight it's definitely warming up and number 14 we got Street Fighter II there you go like I mentioned there was your fighting surprise is so high but I'm happy shout out yeah yeah nice to see a fighting game on the list straight fighter as you always talked about the big impact of that you know before this I",
            "start": 5080.04
        },
        {
            "text": "your fighting surprise is so high but I'm happy shout out yeah yeah nice to see a fighting game on the list straight fighter as you always talked about the big impact of that you know before this I didn't mention Burnout 3 and like we're too late we're not going to see Burnout 3 okay but but could you imagine right at number 13 of being burnout be crazy that'd be crazy that' be sick fighter okay find out let's find out number 13 we got Doom here your doom here's your doom wolf you're getting your classic iconic picks things that defined the the medium I love this I like this selection I yeah I'm not mad at that and number 12 we got World of Warcraft there we go hey I'm not mad at that very yeah well I would probably put a top 10 yeah to be honest with you I think how important it is I think that's a top 10 game um but yeah like wow wow these are all everything so far I have not been mad at surprisingly I have not been mad at any of these and number 11 we got Halo Combat Evolved",
            "start": 5131.64
        },
        {
            "text": "I think that's a top 10 game um but yeah like wow wow these are all everything so far I have not been mad at surprisingly I have not been mad at any of these and number 11 we got Halo Combat Evolved, the first one, the first one what we talked about you know Halo being that first one yeah I we I think me and Barrett went with three on that one but number one is the correct choice on this so yeah I'm loving what we're seeing here first first console first-person shooter game to actually like really pull it off and make it feel good and lit it did fully change the ecosystem in terms of console games and Shooters uh before we get to the top 10 I want to bring in some super chats for you man you guys are just letting it roll in with let ride come on let's get crazy uh Gary the third writes in it says if this was if this were most influential games this list is good but for the 50 greatest video games it's a bad list Tony Hawk's Pro Skater 3 is better than Super Mario Kart 8 is better than Mario Kart 64",
            "start": 5174.16
        },
        {
            "text": "Says if this was if this were most influential games this list is good but for the 50 Greatest Video Games it's a bad list Tony Hawk's Pro Skater 3 is better than One Mario Kart 8 is better than MK64. Now here's my thing, right? Talk to me and I'm not making the case here, but greater versus better because I think better. I can understand what you're talking about, but when you're talking about greatness, greatness, I feel like you can define it how you want to, cuz I do. I do think you can put in like quality, you can put in how well it ages, but I think you can also put in like impact and icon status and cultural like impact right? Like I think that stuff might fit within the definition of great greatest okay I like that I like that uh SnowBikeMike says I think we still see a Monster Hunter game worlds maybe question mark not that would be crazy that Super Chat might have come in earlier it probably came in around the... I like that yeah I am surprised haven't seen a monster hunter very good game but",
            "start": 5222.4
        },
        {
            "text": "maybe question mark not that would be crazy that Super Chat might have come in earlier it probably came in around the I like that yeah I am surprised haven't seen a monster hunter very good game but yeah I'm not I I I could see it being a one of those being in a top 100 100 honorable mention maybe I like that Christopher Bennett says Mario Kart 64 is my favorite one uh fun story I get to play Mario Kart 64 against Valk Kilmer and Panic! At The Disco at my house back in 2004 good times what a combo with the Ice Man what was going on at your house was Ice Man bro that's sick man what parties were you throwing yeah they live in Madison Square Garden apparently um Electric Gregar says probably won't see it on the list but as far as sports games go NHL 94 was a huge impact for me personally man dude I you know we talk about this top 10 maybe probably not but maybe Zeke says bg3 is so insane we're literally living in an era where every single RPG will be compared to it for the foreseeable",
            "start": 5264.68
        },
        {
            "text": "dude I you know we talk about this top 10 maybe probably not but maybe Greg says bg3 is so insane we're literally living in an era where every single RPG will be compared to it for the foreseeable future 100% deserves it yeah a couple people were like Mike are you sure it's like it you know it changed the globe and it's like I feel like we're living in that presently I think 10 years from now you look at that comment I made and be like yeah we probably were right on that one of like yeah we this one has everyone in a headlock right now but you got to think about you know um Bethesda one of the biggest RPG makers ever right they're putting out games that take over the world and they put out a game right after balder's Gate 3 and what everybody had to say was uh this ain't hidden like balder's Gate like feels old this game balder's Gate 3 made this game feel really old they did that to Bethesda that's tough that's crazy well Bethesda did that to Bethesda Bethesda also did that to Bethesda",
            "start": 5311.36
        },
        {
            "text": "gate like feels old this game Baldur's Gate 3 made this game feel really old they did that to Bethesda that's tough that's crazy well Bethesda did that to itself back in 2015 and that was almost a decade ago before that you know yeah but yeah but like think about that though like we're talking about The Witcher 3 Baldur's Gate 3 right like these are generational um RPGs um Josh Sawyer says Mike Vic in this game is still the most broken player in Madden history maybe sports game history might be one of the greatest moments of all time is your friends selecting the Atlanta Falcons and running all over you y the coolest and he was left-handed so you could roll out to the left no one rolls out to the left cuz you always roll right cuz they're right-handed so now all of a sudden you're changing in the whole entire game God damn it's the coolest what a great game let's get some Madden let's turn let get back mad I'm down some Madden uh and",
            "start": 5353.88
        },
        {
            "text": "so now all of a sudden you're Chang in the whole entire game God damn it's the coolest what a **** great game let's get some Madden let's turn let get back mad I'm down some Madden uh and then Mr Hawk it says Madden 2004 got me into sports games rented it just so I could listen to action by Blink-182 on repeat ended up actually playing SL loving it yeah that was like that was like the demo title of that song now of course before we go on any further I want to do two things one of course I want to hear from the live audience so please put your ones in the chat if you're still rocking with it put your twos in the chat on YouTube and on Twitch if you're not rocking with this list before we get into the top 10 so we're in the top 10 and then before we roll in right I mean do you want to are you trying to guess I think I was just going to say let you and I tee up a couple of guesses here Portal okay I think a Portal game is going to be top 10 Final Fantasy VII portal has to be in there",
            "start": 5398.56
        },
        {
            "text": "are you trying to guess I think I was just going to say let you and I tee up a couple of guesses here Portal okay I think a Portal game is going to be top 10 Final Fantasy VII Portal has to be in there Final Fantasy VII Metal Gear Solid a Metal Gear Solid your solid game okay I like this has to be in there that's Tetris Tetris GTA GTA has to be on this a Mario game or two oh **** but let's say one cuz at this point getting one you're getting one um I think you get two Mario games I hope so man put some respect on his name oh I mean maybe I I could see Starcraft being on there Starcraft above World of Warcraft wow we got we uh oh that's a great question yeah would they put it above World of Warcraft at this point I don't know man it did RT it put RTS on the map even though a lot of people out there shout out to Warcraft III I see y'all out that I think you get another Zelda Zelda I think Ocarina let's give Ocarina right yeah okay The Legend of Zelda: Ocarina of Time and then uh maybe Bioshock like either Bioshock or Half-Life I would say Half-Life",
            "start": 5437.2
        },
        {
            "text": "think you get another Zelda, Zelda. I think Ocarina of Time, let's give it a shot. Oh wow, yeah, probably Ocarina of Time right? Yeah, okay, The Legend of Zelda: Ocarina of Time and then uh maybe Bioshock or Half-Life. I would say Half-Life more likely than Bioshock yes the way that Half-Life like basically all of the immersive Sim games that we **** love today would not exist without that game and like Bioshock wouldn't exist without that like if we're talking about impact of the like of the medium that definitely Half Life definitely had like game design impact but like culturally the way it hit culturally I feel like Bioshock hit culturally that's fair right like I remember going to school everybody was talking about Bioshock there's the weird in between as well of System Shock but I people don't talk about the CU at that point like we're talking about Deus Ex and I don't think how about this we haven't talked about it I saw someone just putting hell divers let's go back to the OG Left 4 Dead no no top 10 that's",
            "start": 5480.76
        },
        {
            "text": "at that point like we're talking about DSX and I don't think how about this we haven't talked about it I saw someone just putting Hellblade: Let's go back to the OG Left 4 Dead no no top 10 that's a top really okay okay uh oh have we not seen GoldenEye? We haven't seen I think Gold's on there that's like I think we named just eight we just eight named eight games that are going to be on there for sure to me Halo Combat Evolved kind of takes the place of like GoldenEye of console first person shooter I don't think so I haven't seen any mobile like true mobile is there anything at this point that that would make it what solitaire? I know that's not mobile but that's not a top 10 video game wait did we say last us already no we haven't seen The Last of Us that be we got part two though right no we haven't got any last we haven't got any last literally just got Uncharted then that's number nine yeah yeah or that's nine nine of them that's nine out of 10 I I think we legitimately got them Skyrim",
            "start": 5526.6
        },
        {
            "text": "haven't got any last we haven't got any last literally just got Uncharted then that's number nine yeah yeah or that's nine nine of them that's nine out of 10 I I think we legitimately got them Skyrim oh **** right yeah that has to be 10 that's The Elder Scrolls V: Skyrim that has to be 10 that's The Elder Scrolls V: Skyrim says mind sweeper mind sweeper RuneScape but I think we nailed it shout to that dumb as Guitar Hero guitar hero couldn't show up on this top 10 I would be all right with it and number 10 Let's see we got Super Metroid **** **** they we didn't even think about Super Metroid they got two of them they do have two of them yeah they do got two of them um you have to okay I see I'm not mad I'm kind of blown away but I'm not mad at it yeah this makes all the sense yeah let's keep going let's keep going let's keep going that conversation yeah at number nine we got The Elder Scrolls V: Skyrim have to yeah you have to that we knew that and number eight we got Final Fantasy VII love that this top five is to be insane dude",
            "start": 5570.76
        },
        {
            "text": "that conversation yeah at number nine we got Elder Scrolls V: Skyrim have to yeah you have to that we knew that and number eight we got Final Fantasy VII love that this top five is to be insane dude yeah this going to be crazy at number seven we got me solid yeah we're in this top five is where you make or break this entire fu is the top five it's very exciting it's very exciting you're naming all like these are the top five games that they're naming already the trend setters really quick let's just pause for a second we look at those first go we got Metal Gear Solid Final Fantasy VII Skyrim and Super Metroid okay we're we're cooking right now I I think Super Metroid one for me is a little shaky a little shaky on that I I'm not shaky but it not shaky yeah on that one it's just you had two of themos they're different enough got two Zeldas you're going to get a second Zelda okay you're yeah I'm Final Fantasy VII and Metal Gear Solid both being in the five through six",
            "start": 5621.36
        },
        {
            "text": "of themos they're different enough got two Zeldas you're going to get a second Zelda okay you're yeah I'm Final Fantasy VII and Metal Gear Solid both being in the bottom five or like in the five through six through 10 let's see let's see all right and number six we got Half-Life Two holy **** half life okay all right we're in the top five okay top five make or break Rolling Stone make or break at number five you got The Last of Us makes sense okay okay it's in the it was in our top 10 it makes sense makes sense I would put Metal Gear Solid above it but we can talk about the rankings differently but yes this is in the list yeah at number four we got Super Mario World now let's pause here pause what the **** is the top three how are we talking about Mario World and Metal Gear Solid your solid I think A Link to the Past is definitely in the top three yes oh **** Tetris Tetris Tetris and Super Mario 64 this is where you see your two Marios and they're both in the top 10 I mean that makes sense think those are we we haven't got GTA",
            "start": 5672.24
        },
        {
            "text": "in the top three yes oh **** Tetris Tetris Tetris and Mario 64 this is where you see your two Marios and they're both in the top 10 I mean that makes sense think those are we we haven't got GTA though oh **** if they don't have a GTA on this they have on yeah maybe maybe Link to the Past was the Zelda pick we're not getting Ocarina that's crazy no Breath of the Wild yeah no Tears of the Kingdom see those I'm less shocked by just because even though they're like universally praised there are like uh you know people who don't Vibe as much with those games I would be shocked to not see Ocarina at all on this list man it's going to be crazy it's going to be crazy all right give it to us all right number three we got Grand Theft Auto 5 have to got to have to put it on there I appreciate because I feel like GTA 5 over the years has like you know gotten a little bit of like hate just cuz it's like it's that it's almost in the Fortnite tier of like okay well body plays for because we",
            "start": 5724.84
        },
        {
            "text": "because I feel like Grand Theft Auto V over the years has like you know gotten a little bit of like hate just cuz it's like it's that it's almost in the Fortnite tier of like okay well people still play it because we haven't moved on from it we haven't had the time to appreciate how much we love and appreciate it cuz we we've been stuck in it for 10 years yeah we give love to Grand Theft Auto III for changing the globe but Vice City and San Andreas we love because we've had time away from them but I'm glad that like people are still putting it this high on the list because it deserves be it that game when it when it dropped in 2013 that **** was crazy that was a crazy video game tap no Portal on this list can you hey we're not finished yet can you believe that the Grand Theft Auto III special edition was a hat and a money bag lock box I don't remember that what a ridiculous one you couldn't come up with anything better than a dumb hat come on now and number two we have Tetris, tet that's crazy what the **** is",
            "start": 5776.04
        },
        {
            "text": "a moneybag lock box I don't remember that, what a ridiculous one, you couldn't come up with anything better than a dumb hat, come on now. And number two we have Tetris, Tet that's crazy, what the **** is number one at number one stop stop, I'm not ready, I'm not ready. We have okay, I'm ready. Zelda Breath of the Wild wait wait wait, what are we missing? Oh ****, I feel like a lot of things just got left off. Okay so Breath of the Wild is number one, Sh Ocarina of Time is not on this list, Mario 64 is not on this list, which is like no Portal no Portal is on this list crazy. I guess they gave the Portal to Half-Life no Bioshock is nuts man we took a hard left turn. I like it but I don't like it, I don't know, I don't know about the number one, I don't know about the number one again when we look back at their blurb, their blurb was uh you don't know about number one Mike what do you mean you don't know about number one. I mean I like number one, I don't know if that's number one Blessing it's number one",
            "start": 5812.12
        },
        {
            "text": "their blurb their blurb was uh you don't know about number one Mike what do you mean you don't know about number one I mean I like number one I don't know if that's number one Blessing it's number one I don't know if it's number one either Breath of the Wild I think we took a hard turn on that one we have not even the best Zelda game you know so the greatest game of all time um I I so when I think back to the blurb right again they did go out of their way to say like aging well like what games age well Gold and I doesn't age well okay but not on the list Mario 64 does Mario 64 on see them using that argument Mario Super Metroids on the list which I give him respect but like super metroid and Metroid Prime both AG there's not many games that got two and like that got two I mean you're right I'm if we're talking about aging like for the 2D Mario games I think it's crazy to not have three on there you know but I I think CU okay what are the games that we got two in one franchise because Metroid",
            "start": 5862.56
        },
        {
            "text": "we're talking about aging like for the 2D Mario games i think it's crazy to not have three on there you know but i i think cu okay what are the games that we got two in one franchise because metroid we did but i can see the argument of like metroid prime versus super metroid i think it was just metroid that got two different ones oh zelda got two yeah metroid that's like and that's 2d zelda versus 3d zelda and we thought we'd get two so like i'm not mad at that i think that's the ar but like that that's the case with mario odyssey but maybe they just don't **** with it right like maybe they're just like hey mario mario world we didn't put any cotour like to the old republic yeah it's just there's so many but again that's where you get your mass effect to of course of course yeah i agree with that bear you can start putting comparisons there we got halo right yeah we halo one at 11 or something yeah yeah okay we had wow we had wow we had a mainline mario",
            "start": 5905.48
        },
        {
            "text": "Course, yeah, I agree with that. You can start putting comparisons there. We had Halo right? Yeah, we had Halo one at number 11 or something. Yeah, okay. We had WoW. We had a Mainline Mario chat. Man, this is a tough one. I'm giving it two thumbs up. I'm going to give it one thumb up. One thumb they got a thumbs up. They got a thumbs up right? I think this list is thumb... I think this is a fantastic list overall when you look at the overall scope of things. I think all the picks, uh, were great. I think you know they were they had the confidence to put like a couple sports games on here but they picked the right ones in my opinion right? They're making a statement there. Hey, were you there for Madden in 2004? Were you there for NBA 2K1? Like these were moments. These are games that people hold near and dear and have great memories with. You got into like the nerdy picks, you get into the iconic picks. They kept for the games like Fortnite to the top. They kept it.",
            "start": 5949.48
        },
        {
            "text": "games that people hold near and dear and have great memories with you got you get into like the nerdy picks you get into the iconic picks they kept for the games like Fortnite to the top they kept it on the list but they kept them down to like the 40 on the list right because they deserve to be there but they know what people want I think this is an overall good list great list even I'm going to give this list a thumbs up this is a great list not a perfect list not a perfect list but like you know what but there never is when you look for uh if you want to show your friends a list and have some fun like we just did or you just want to say hey here's a good list to a great list they did it they out I definitely have some big disagreements okay like yeah I can't wait I talk a lot of **** about Mario 64 on content M mainly to get a rise out of Blessing but to ignore the impact of that game when so much of this list is about the impact of video games like that being the first major AAA",
            "start": 5997.2
        },
        {
            "text": "about Super Mario 64 on content mainly to get a rise out of Blessing but to ignore the impact of that game when so much of this list is about the impact of video games like that being the first major AAA console game to figure out 3D gaming yeah Super Mario 64 on this list and know Super Mario 64 is **** asinine let's be honest okay but Mario 64 had to be on the list Mario no Ocarina of Time is crazy no Ocarina of Time is yeah insane that's the I think that's the issue get into these conversations when you're in the room of like how many is too many of this game from this franchise right like and I I agree with you there's some some that deserve to have three or four on the list because they're that good right but I think you do get in the real conversations of the room of like we've already put them on two times four times three times you got to cut them off now I think that's how that goes I got Final Fantasy VII on here Final Fantasy VII which again deserved but like again I get to the weird thing of was this like an",
            "start": 6035.88
        },
        {
            "text": "three times you got to cut them off now i think that's how that goes i got Final Fantasy VII on here Final Fantasy VII which again deserved but like again i get to the weird thing of was this like an aging thing cu like Final Fantasy VII i'll put in the same realm as a Super Mario 64 in terms of you know how it's aged over time i guess it's an RPG so like maybe not as mechanical so maybe that's where where you would go with it where you got to jump around and do all that **** in super mario 64 in Final Fantasy you're just walking around but still i'll say it is aged oh yeah all right so let's go around the room uhhuh the three of us here and of course the chat we want to hear from you please Super Chat so we definitely can get you involved uh if you're if you're able to give us the ones that either should be higher on the list or should not be on the list what are what are your one or two that is like yo this was a mistake or hey this should be higher as a mistake like better in a better placement i mean",
            "start": 6083.56
        },
        {
            "text": "Higher on the list or should not be on the list what are what are your one or two that is like yo this was a mistake or hey this should be higher as a mistake like better in a better placement I mean Elden Ring is the immediate thing that comes to mind yeah I think you put it in the top 20 at least maybe top 15 right I think you were talking about um that as the representation of both From and how much From is impacted um action games action RPGs if you're taking it as an encapsulation that but then also how quality it is as a video game in 2022 2023 whenever Elden Ring came out 2022 um if you're looking at it as that if you're looking for the cultural impact like Elden Ring checks every single one of those boxes and the fact that you have Baldur's Gate 3 so high like I would put Elden Ring in the same exact conversation as Baldur's Gate 3 I think both of those should be top 20 when you're talking about like the modern juggernauts the modern greatest games of all time I think\n\nI corrected the following:\n\n- \"El Elder ring\" to \"Elden Ring\"\n- \"balers Gate 3\" to \"Baldur's Gate 3\"\n- Corrected capitalization for proper nouns and game titles.",
            "start": 6119.96
        },
        {
            "text": "Elden Ring in the same exact conversation as Baldur's Gate 3. I think both of those should be top 20 when you're talking about like the modern juggernauts, the modern greatest games of all time. I think Baldur's Gate 3 and Elden Ring should probably both be in the top 25 at least. I'll stand on business and I'll say it: stand on business. Mike, Fortnite should be higher on the list; Fortnite should be in the top 20 conversation for the cultural impact where we are today. I think it's hard sometimes to see it in present moment of you might have your bias, you hate Fortnite, you think it's for kids, you might love Fortnite, but I do think like it: Fortnite is changing fundamentally video games in the video game industry right now and we are living it up and it's going to change it for the next 5 to 10 years and beyond. I think 20 years from now we're going to look at it and be like that game is going to go down as one of the greatest if not the greatest game of all time for what it has done; you might not.",
            "start": 6170.2
        },
        {
            "text": "and Beyond I think 20 years from now we're going to look at it and be like that game is going to go down as one of the greatest if not the greatest game of all time for what it has done you might not like the Battle Royale mode, but like when you think of Fortnite right now in 2025, collaborations with different IPs, not being afraid to bring them in, being able to bring them in right now having a battle royale that has stood the test of time and is still playable and still happening how malleable it is as a video game right now having the ability to create within their world and having this Fortnite user-created content is crazy to think about right now adding Rocket League racing, a Forza type stuff like this game right now is changing the world I I think it's I think it's going to be up there and I think it should be up there I think maybe some of the negative impact uh that it has on the industry might be the",
            "start": 6211.72
        },
        {
            "text": "now is changing the world I think it's going to be up there and I think it should be up there I think maybe some of the negative impact uh that it has on the industry might be the thing that feels right okay cuz I can't deny how big it is but also how much of a cancer it is for all these other companies who are constantly trying to uh chase that and then well that's the issue success and yeah that's the conversation industry because of it is people now the big money grubbing CEOs are saying make this make this when they shouldn't be they should be encouraging people and fostering these development teams to make something great that they want to create right but we're chasing dollars and like are we really holding that against Fortnite because they're changing other people's minds I don't think hold against Fortnite and I and I'm not even holding it against it I think it is something to acknowledge is that it is the king of seeing a mechanic or seeing something else",
            "start": 6255.2
        },
        {
            "text": "minds I don't think hold against Fortnite and I, and I'm not even holding it against it. I think it is something to acknowledge is that it is the king of seeing a mechanic or seeing something else that like another smaller game is doing and being like \"oh we're going to take that, we'll take that for our own.\" Like, I made this, and like honestly it does that to games big and small in ways where I'm like \"all right, sure. You could take whatever thing from Apex Legends you could take the um, you know what, the respawn system from Realm Royale or do whatever right?\" But like at the end of the day it is competition. I think it only gets scummy when it is like \"oh we're going to make an Among Us mode and not even like talk to the Among Us people or do any of that.\" I think it has had its missteps in that regard, but overall when you're talking about impact, I still think Fortnite's impact supersedes all of that. Right, like you're decades from now we're still going to be",
            "start": 6300.0
        },
        {
            "text": "missteps in that regard but overall when you're talking about impact I still think do think that the Fortnite impact supersedes all of that right like you're decades from now we're still going to be talking about Fortnite in the way that it changed the industry and the things that it's Done Right battle passes what you talk about or like the malleability of it right like bringing Lego into it we might still be talking about Fortnite as a present thing decades from now yeah right you're it's going to be **** ESPN and Disney and all this **** um the audience has brought up crossplay forcing the hand of Sony into crossplay as well is a big deal yeah that's huge pushing these companies to work together I I I just if if I'm picking one that's my one I think we do have to have a real honest conversation about that one cuz that that is no doubt crazy in my mind um yeah we talked about Zack Reiser right like that should be on the list I would kick off like that's the",
            "start": 6337.6
        },
        {
            "text": "to have a real honest conversation about that one cuz that that is no doubt crazy in my mind um yeah we talked about zelda breath of the wild Ocarina of Time like that should be on the list I would kick off like that's the thing is I think you don't want to go more than two that's the problem with breath of the wild Ocarina of Time all I think being legitimate contenders in that conversation is that like then you get into three of three games of the same franchise and you got to pick two I not that you got to pick two but I think they wanted to pick two they didn't want to have three of those in there Barrett what do you got give me one or two let's talk about it I would put Red Dead Redemption 2 way lower I think is like one that stands out to me and I would put The Legend of Zelda: Link to the Past much higher that's really all I got right now yeah as I'm scrolling through though again like the top of this list is so strong right that 30 to 50 is so strong getting a Sonic the Hedgehog 2 at number 35 man that's so good you",
            "start": 6378.44
        },
        {
            "text": "right now yeah as I'm scrolling through though again like the top of this list is so strong right that 30 to 30 to 50 is so strong getting a Sonic the Hedgehog 2 at number 35 man that's so good you know what I mean I can make conversations for League of Legends as well I think could be higher on this list um man it's good Celeste is a big poll I like that I love that we highlighted Batman: Arkham City Valley good picks Tony Hawk Pro Skater great yeah they have such they have a lot of right Pokémon on this they have a lot of goodness on this list it all felt right Pokémon did feel low but yeah like it being on the list I think is is a is a perfect call my personal on Street Fighter 2 as much as I love fighting games number 14 seems a little high okay my person the only one would call out on the list that I could see being erased on the list to make new room these are my personal ones would be the two sports games and would be Tony Hawk you would take Tony Hawk off the list I could see myself",
            "start": 6425.96
        },
        {
            "text": "that I could see being erased on the list to make new room these are my personal ones would be the two sports games and would be Tony Hawk Pro Skater you would take Tony Hawk off the list I could see myself taking off Tony Hawk and one of two of the sports games that's that's where I would be I'd be like those would be the three take Tony Hawk off the list to put Tony Hawk Pro Skater 2 on the list if we rolling stone and we're having this conversation right now and Mike is like ah we don't need Tony Hawk on the list that's where I tackle Mike oh God Stella Stella come on in here why the **** are we not playing Marvel's Guardians of the Galaxy yet what the **** we got talk this you've been begging you've been begging you've been asking it's a top the the audience will are you done with them talking can we go play now I've been waiting the audience was to hear me and Mike talk about list they love this you know me and Mike don't get a hang out enough chat lists or Marvel Rivals lists or Clover and Dagger",
            "start": 6472.92
        },
        {
            "text": "now I've been waiting for the audience to hear me and Mike talk about lists they love this you know me and Mike don't get a hang out enough chat lists or Marvel Rivals lists or Clover and Dagger's but here's the thing Stella we talked about the top 50 games of all time Stella you know not on this list of top 50 games BRZRKR think about that okay it's new that's why okay also are we really going with Rolling Stone's list I have a great listen is it actually a good list you make a list and we'll react to it on the show and we'll see if it's better than Rolling Stone's list okay I made a list of people I like and you're not going to be on it so it's already great wow wow right change it from Mar Rivals me and Stella are boxy yeah we're boxy and I'm going to knock you the **** out SN I feel like this is I feel like Mike Tyson and uh the Paul brother right now were what is he doing in there it's all fun and games till she starts bullying you huh I know everybody celebrates her when she bullies",
            "start": 6516.12
        },
        {
            "text": "is I feel like Mike Tyson and uh the Paul brother right now were what is he doing in there it's all fun and games till she starts bullying you huh I know everybody celebrates her when she bullies me she starts bullying you guys oh it's a big deal until I can stop picking you up like a baby you got to listen to me baby get to the gym with her you got to get in the gym that's true I got to get to the gym all right let's wrap this up this up we'll see in just a moment me enough to where I'm like all right cool we're playing turn **** on right now it's right any final thoughts on this list this is a great list this made us laugh this made us think this made us question some but overall you gave us 50 great games and you did a good job Rolling Stones you really whoever was in that room you did a great job on this one there's some that didn't make the list that probably should have made the list but you know what all in all this is 50 good to great games needed more Mario needed Starcraft",
            "start": 6556.36
        },
        {
            "text": "a great job on this one there's some that didn't make the list that probably should have made the list but you know what all in all this is 50 good to great games needed more Mario needed Starcraft more Mario uh let me read off some of the last Super Chats we got here um CJ spon says Mass Effect question mark Pokemon Red and Blue question mark um M was in yeah Mass was in uh but I think they wanted their specific entries I they M get uh Roberto writes in it says third person action games like DMC 13 or even Metal Gear Rising not being on here is a crime listen I love Metal Gear Rising as much as the next guy it's not on here it's not gonna be remember that guy when he did the thing and he started talking through his butt like no and Metal Gear Rising started talking through his butt oh I'm thinking Vanquish no that's that's the game yeah yeah when the when the president was doing that and he did oh yeah oh like he looked through I pictured like like his butt was the mouth right like um Ry guy says",
            "start": 6602.36
        },
        {
            "text": "no that's that's the game yeah yeah when the when the president was doing that and he did oh yeah oh like he looked through I pictured like like his butt was the mouth right like um Ryan Gosling says no portal is insane a cake is a lie took over the world and GLaDOS made a cameo in Rock Band for God's sake I agree with that should have been there should have been Portal on the list um Poopy Pants writes sentence says breath of the wild started switch era which probably plays A Part um Yang fam says is there a top worst release Game tier list that that would take a lot of studying that no nobody has ever done okay like diving into the worst games ever on Steam oh that's tough tough one there's a lot there's a lot you lose your sanity um I'll bring in one more snugs writes in and says unrelated we need to see Stella and Bless play the Mind Stella would beat the **** out of me you **** up if we play the Mind by round two like Stella's **** like just pounding me you be in the headlock",
            "start": 6646.08
        },
        {
            "text": "need to see Stella and Blessing play the Mind; Stella would beat the **** out of me, you'd get destroyed if we played the Mind by round two - like Stella's just pounding me, you'd be in a headlock for sure. So yeah, let's make that happen. Uh, Mike, no Assassin's Creed games? Good, good, wow, yeah, no sass; that's a little surprising, I guess. Yeah, not one Assassin's Creed game - there's so much fun left to play. Leave some comments down below: what were the games that were missed? That's what we really want to know. Yeah, what were the games missing on this list? Let us know in the comments below. Until next time... did I ever throw to an ad? Yeah, no, I didn't. Thank God. Okay, it's been Blessing great; you did great. That's been Mike. That's been Barrett. Till next time, it's been our pleasure to serve you. See you.",
            "start": 6694.04
        }
    ]
}