{
    "id": 13421,
    "video_id": "DBT6xm1IDrc",
    "show_name": "Gamescast",
    "hosts": [
        "Tim Gettys",
        "Blessing Adeoye Jr."
    ],
    "title": "Tim Gettys' Switch 2 Predictions - Kinda Funny Gamescast",
    "description": "Go to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\n\nGo to http://rocketmoney.com/kindafunny to cancel your unwanted subscriptions with Rocket Money.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1737497230,
    "duration": 4721,
    "transcript_chunks": [
        {
            "text": "Welcome to Kinda Funny Gamescast for Tuesday, January 21st, 2025. I'm your host Blessing Adeoye Jr., joining me is Tim Gettys. I can't wait for this episode of Gamescast. Bless, I love like I can see how long the paragraphs are substantial, yeah, you have substantial notes which excites me cuz this is exactly what I wanted from you. I wanted you to get in your due diligence as far as we had a blast yesterday as you went through month by month 2025 even beyond you, you went June to June 26th from when you think the Switch launches all the way through uh 202 or halfway through 2026 and uh broke down what you thought Nintendo was going to do and we had a great time talking about it. If you haven't checked out that episode I highly recommend it cuz we got something going here, oh yeah, oh yeah can I tell you that I love seeing your notes especially because during the weekend when I was putting together my mind I really had to hold",
            "start": 0.23
        },
        {
            "text": "it cuz we got we got something going here oh yeah oh yeah can I tell you that I love seeing your notes especially because during the weekend when I was putting together my mind I really had to hold back I was like I can't I can't overdo this like let me not over detail this like let me let me keep it simple I love looking at you and and you just don't care yeah no no no as you go down you start getting a little bit just like just a couple that are just a couple words but yeah overall I got some thoughts hell yeah and let me tell you I don't think you guys are going to like a lot of them well let's get into those thoughts remember this is the Kinda Funny Gamescast each and every weekday we get together and talk about the biggest reviews previews and topics in Video Games Live on YouTube Twitch and on podcast services around the globe if you love what we do support us with the Kinda Funny membership on Patreon YouTube Spotify or Apple Podcast to get all of our shows ad-free",
            "start": 67.2
        },
        {
            "text": "Twitch and on podcast services around the globe if you love what we do support us with the Kinda Funny membership on Patreon, YouTube, Spotify or Apple Podcasts to get all of our shows ad-free. Watchers record them live and get a daily exclusive show for a chance to be a part of the show some of your thoughts and opinions as YouTube Super Chats as we go housekeeping for you. We're in an 11-person business all about live talk shows, Kinda Funny Daily right before this today was about what's happening to the Horizon MMO game right now is The Gamescast, and then after this is going to be the stream I'm going to be playing um the early hours the demo essentially of Eternal Strands. Oo yeah give me give me the top level of this cuz Eternal Strands for some reason totally over my head I don't remember seeing it anywhere I don't know anything about it I heard Andy getting really excited when Greg brought it up last week and then I saw some screenshots today yes so this was one of those ones that you know like",
            "start": 105.52
        },
        {
            "text": "I don't know anything about it, I heard Andy getting really excited when Greg brought it up last week, and then I saw some screenshots today. Yes, so this was one of those ones that you know like we've had the string of studios from like people who worked at big developers that left big developers to start up indie studios and like somewhat in that double-A to AAA space. This is one of those um it is from Mike Ladlaw who was one of the like um important people who worked on uh I believe uh Mass Effect, okay sounds right. The style of this game is essentially like Shadow of the Colossus meets like Zelda: Skyward Sword, Immortals: Phoenix Rising is right, like has a lot of those elements it seems like there's a lot of like environmental of like um like fire interacting with like ice interacting with like the elements type stuff um and like the art style kind of gives a bit I don't know if Fortnite is the right word but it has like kind of like an animated cartoon aesthetic yeah um and so it's one that I've",
            "start": 149.04
        },
        {
            "text": "type stuff um and like the art style kind of gives a bit I don't know if Fortnite is the right word but it has like kind of like an animated cartoon aesthetic yeah um and so it's one that I've been looking forward to just to try out right like I don't know if it's be good or not which is why I'm excited for this demo but check it out everybody after this yeah on paper very excited to to to check this one out and then after that Mike will be playing some Kingdom Hearts II if you're a Kinda Funny member you get you can get today's Greg way uh thank you to our Patreon producers Delan Twining and Carl Jacobs today brought to you by Shady Rays and Rocket Money but we'll tell you about that later for now let's start with topic of the show Tots is always a little weird it is know I mean it feels like subdued that's how me and me and Greg did it you know what I mean I guess Barrett was in the background also doing it and so topic of the show is going",
            "start": 194.16
        },
        {
            "text": "a little weird it is now I mean it feels like subdued that's how me and Greg did it you know what I mean I guess Barrett was in the background also doing it and so topic of the show is going to be Tim's month by month Nintendo Switch 2 predictions of course I did mine yesterday I went from June to June talking about a thing or a lot of things each month that was going to happen with the switch during its first year Tim I'm excited for you because if I remember correctly you're doing yours a little bit differently than I did mine I am and uh you know I was going back and forth and trying to figure out how I wanted to do this I was like you know what no matter what I want to start with February I want to start with next month because I think that's when the Switch conversation is going to like really start kicking up a little bit and I want to keep that going all the way through and I was going to keep going past next February but I'm like I if I'm being honest so much is",
            "start": 238.6
        },
        {
            "text": "I've studied Nintendo my entire life as a fan, as a critic, as all of the things right. And if there's one thing that I have learned about Nintendo it's that you can never follow a pattern. Yep, you can never try to base what they're going to do based on what they have done. Having said that, there are some things that never change; M and DS weird Nintendo decisions while they're rarely the same type of weird as the one previous, they are weird nonetheless. Yes, so anytime",
            "start": 280.28
        },
        {
            "text": "having said that there are some things that never change Nintendo's weird decisions while they're rarely the same type of weird as the one previously, they are weird nonetheless. Yes, so anytime you're predicting something, there has to be something weird about it. So I tried to come up with what the weird twist is. Anytime there's good news, there has to be something weird about it. The weird thing about this is... I like this a lot and as I started doing that, it started painting a path that I'm like, you know what? Oh, I'm so into this. Everybody, I'm so excited. And what's funny about this is obviously we're predicting based on very little information, like I said, it's hard to tell. This is more for fun than anything but like I tried to be realistic about this, like I tried not to be like crazy just saying... I love how similar me and you are cuz like again I did the same thing I was like how can I make this boring cuz like I think we all are under the impression that the reality of this",
            "start": 326.04
        },
        {
            "text": "saying **** I love how similar me and you are cuz like again I did the same thing I was like how can I make this boring cuz like I think we all are under the impression that the reality of this there are going to be exciting Parts about it but there're also going to be the boring parts and the weird Parts yes and weird is not necessarily bad yeah it's just weird correct you ready to get into this I'm I'm very ready to get into this let's start with February everybody God damn oh my God I got this part of your prediction I get so triggered by this song now **** I got to open up another tab hold on I think it's happening hold on I think it's happening for audio listeners GameOverGreggy has just entered the building with the stars and the Bank briefcase Greg is is it happening are you doing this what's up what are you do what are you doing here not today but it could be uh you know everybody I I couldn't think of the best way to bring to bring this up last I taught you",
            "start": 378.08
        },
        {
            "text": "what's up what are you doing here not today but it could be uh you know everybody I I couldn't think of the best way to bring this up last I taught you how to fix this remember just very recently the button control shift T thank you um so let's see before we get into that I need to to let you know that uh this weekend uh on Friday at 9:16 p.m. I get a text from uh GameOverGreggy uh remember he was out at a bachelorette party cool GameOverGreggy was in Mexico so I had I was alone in the house just me and the pups and at Friday 9:16 p.m. I get a text from GameOverGreggy not an emergency but are you busy sorry and so I just immediately call him because you know we're kind of funny and it is if if I'm getting a 916 text from GameOverGreggy that says not Emer are you busy it's like oh **** we need to talk I call him he responds sorry can't talk talk are you driving and I say no I'm at home and he goes great come outside and I said godamn it and he just sends me a picture of",
            "start": 427.76
        },
        {
            "text": "oh **** we need to talk I call him he responds sorry can't talk talk are you driving and I say no I'm at home and he goes great come outside and I said goddamn it and he just sends me a picture of the stars of the Bank briefcase Jesus Christ and in all just goes it's not happening but that's how it could happen so **** easy I'll get you in your star you are not safe with this sticker of GameOverGreggy in a bathrobe drinking Mar how does he have thatti it's really tiny I can't KindaFunnyKevin oh uh why does that sticker exist and and then I said I called you because I thought it was happening it's legit fear I'm in my underwear that's amazing I was ready to go outside though uh and I was like didn't expect to happen so fast but I was quote unquote ready and he goes got to keep you on your toes enjoy your weekend keep me posted on the public places you'll be and at what time the next day he does the same thing again oh that's amazing yeah that's amazing this is just my life now I can't tell you",
            "start": 494.0
        },
        {
            "text": "your weekend keep me posted on the public places you'll be and at what time the next day he does the same thing again oh that's amazing yeah that's amazing this is just my life now I can't tell you I was getting so ready to make up trivia on the spot cuz I still don't have my questions ready you got to get ready I really do got to find time this week room to steal wait say again I now have stars room to steal last week I didn't you do have a star a little so it can happen at any moment and I got to figure out these questions because I'm scared too all right let's get into this February February I got quite a bit here there will be a Nintendo Direct okay in February in okay in February Nintendo Direct a Nintendo Direct not a Pokémon Presents a Nintendo Direct there will also be a Pokémon Presents but there will be a Nintendo Direct in February to kind of flesh out a few Nintendo Switch games okay we're going to get before the switch too those games will be May and June but we'll talk",
            "start": 542.76
        },
        {
            "text": "presents but there will be a Nintendo Direct in February to kind of flesh out a few Nintendo Switch games okay we're going to get before the switch too those games will be May and June but we'll talk about those in May and June okay but we'll get a Nintendo Direct fairly general I don't think it'll be the most exciting thing but just kind of like hey talk about what we got coming up wrap things up couple new announcements bada bing bada boom on February 27th I'm sorry I didn't know my mic was on I I'm so sorry I'm so sorry cool g just came back from Mexico with a SV year for me and I was like oh let me figure it out is it a death whistle it's really cool I'm sorry Chad that's really my bad I thought I had it muted Chad I'm so sorry dude I'm so sorry you do a great show why was it directly to the mic the mic's right in front of me I thought I had my that's my bad I'm so oh **** my favorite thing is just mic chilling the fact that he just goes ah oh **** oh **** I thought",
            "start": 585.84
        },
        {
            "text": "directly to the mic the mic's right in front of me I thought I had my that's my bad I'm so oh **** my favorite thing is just mic chilling the fact that he just goes ah oh **** oh **** I thought Greg was coming back out me too chaos here all right Jesus on February 27th yeah AKA Pokémon Day 2025 uhhuh we will finally see Pokémon Legends: Arceus aka the final Switch one Pokémon game yep aka the first ever Nintendo Switch 2 Pokémon game no you stupid **** it will not be the final Switch one Pokémon game and guess what it won't be on Switch 2 wait say that say that say that again wait so you're saying Pokémon Legends: Arceus won't be on Switch 2 it will not be a Switch 2 game it'll be a Switch one game and you can play it on Switch 2 yes cuz it's backwards compatible you can play everything and it won't be the last Pokémon game on Switch one are you going to is that something you're going to get to later or should we talk about this now we'll get to it later okay we'll get to it",
            "start": 645.32
        },
        {
            "text": "and it won't be the last Pokémon game on Switch, one are you going to is that something you're going to get to later or should we talk about this now? We'll get to it later. Okay, we'll get to it later. Uh uh but surely it'll be enhanced on the Switch 2 correct, surely it'll play better on the Switch 2 right of course I don't want to get ahead of myself but also guess what maybe not you know what we'll get to that later you know what so far you got me yeah this is all very believable like especially Pokémon Legends: Z not having like a native Switch 2 version, very believable to me. So let's kind of get into this right yeah cuz I have one more prediction of this presents okay so Pokémon Presents on Switch one right y not going to talk about it Switch to enhancements yet at this point um in addition to this we will get at least a tease of another Pokémon game during this Pokémon Presents and it will be either a Gen 5 remake or another Gen 2 remake okay so either Johto or Unova yeah and it'll be",
            "start": 708.0
        },
        {
            "text": "to this we will get at least a tease of another Pokémon game during this Pokémon Presents, and it will be either a Gen 5 remake or another Gen 2 remake, okay, so either Johto or Unova, yeah, and it'll be a Switch one. Are you thinking cuz I had thoughts about this too, a little bit of like a Pokémon coming out either say if Legends: Z is in the first half of the year, right, I'll think another Pokémon game either comes out at the second half of this year or in the first half of next year, and it not being maybe a Mainline thing. I am thinking if you're talking about Johto, you might be on the same wavelength as far as a Let's Go Johto game. That's the thing I would be at this point utterly shocked if Let's Go is something they go back to. You think done uh I think that that was trying to ride the the tail end of the high of Pokémon Go and Pokémon Go just doesn't have the sauce like that anymore, okay, you know what I mean? I say that as somebody that like is addicted to playing every day but like",
            "start": 759.28
        },
        {
            "text": "tail end of the hype for Pokémon Go, and Pokémon Go just doesn't have the sauce like that anymore, okay, you know what I mean? I say that as somebody who's addicted to playing every day, but like, I just think if they were going to do a Pokémon Go 2, they would have done that years ago. Um, but at this point, I don't know what it could be. I mean, I don't know, I don't know. But just going back, we're overdue for a Gen 2, a Johto revisit. Which one would you prefer? A Let's Go Joto or a you know how they did Gen 4 but had like chibi? You think it's going to be that? Strap in... oh God no, it's not worth it. Just that's what I'm saying, that's what I'm saying. That did that do well, I mean it's Pokémon so yes, but compared to other Pokémon games no. Um, but I think this is an easy cash money grab here, let's just get it out and let's just move on. Brilliant Gold and Shining Silver, I mean who the hell knows? But yeah, honestly, it's like I feel like there's a chance there",
            "start": 811.36
        },
        {
            "text": "a easy cash money grab here let's just get it out and let's just move on Brilliant Gold and Shining Silver I mean who the hell knows but yeah honestly it's like I feel like there's a chance there but then there's also the Gen 5 side, CU I feel like we are due both of those uh in some way shape or form like I if I remember correctly we're at a point now that gen five which is Unova which is based in America is the furthest we've been from seeing that region again okay yeah we technically saw it a little bit in the DLC recently for um Scarlet and Violet cuz that the the weird ass like water base is technically in like the waters but it's like that doesn't count okay all right um but anyway that that's my do you think that getting that like I guess tease in the DLC do you think that's then like them try to hint or like lead into a Unova thing again going back to Nintendo being like weird Pokémon's weird too like back in the day it was like oh there's the two versions then",
            "start": 856.52
        },
        {
            "text": "that's then like them try to hint or like lead into a Unova thing again going back to Nintendo being like weird Pokémon's weird too like back in the day it was like oh there's the two versions then there'll be a third version and then eventually there'll be remakes They Don't Really there's no pattern if you look back now it's like sometimes they get sequels sometimes they get two enhanced versions with like Ultra Sun and Ultra Moon like there's so many different ways they can go with this **** um in fact let's go as this second remake of Pokémon Red and Blue so I don't know I don't want to get too into the details of it because I all I know is it'll be Gen 5 or Gen 2 and it'll be a Switch one game and Gen 5 Unova is that which Pokémon games Black and White gotcha yeah DS 3DS blind spot for me so any sort of remake I'm down for Black and White's great too because Black and White um I think at the time got uh a little bit of shade from people because they were just like oh like that",
            "start": 903.28
        },
        {
            "text": "for me so any sort of remake I'm down for Black and White's great too because Black and White um I think at the time got uh a little bit of shade from people because they were just like oh like that was when the the Pokémon designs really like there's a trash CL like you know what I mean like things like that that might not exact I think it was Gen 5 actually but um Gen 5 was the first one to really go all out and be like there's no old Pokémon like you're playing through this game and it's all going to be new **** that you're seeing like eventually you can get the the old ones but like there was 150 new ones um so it was kind of like a reboot in in a lot of ways and uh also it was great game great game right let's get to March so that that's February that's February Nintendo Direct about the Switch yes how much do they have left to say about the Switch you think I'll talk about that when we get into cuz I don't want to say everything up front I don't want to say the",
            "start": 943.24
        },
        {
            "text": "Direct about the Switch, yes, how much do they have left to say about the Switch? You think I'll talk about that when we get into it, cuz I don't want to say everything up front. I don't want to say the announcements and then the releases. I got a couple releases I'm like okay, March, March, uh definitely um one of my least juicy things to predict here. Um, I tried to stay away from theme park stuff and movie stuff for this um so really want to just stick on Switch and Switch to all right. Xenoblade Chronicles 2 Definitive Edition will receive a Metacritic score at least four points higher wow than the 8 for the Wii U versions at for no real reason other than more people will actually play it, and Mech are freaking cool. Can I can I tell you something about Xenoblade Chronicles X? I this isn't a promise M but I think this will be my Xenoblade Chronicles okay I think this I'm going to at least try to play this one we will get one code from Nintendo and I will put you on it, I'm down okay I'm down",
            "start": 984.12
        },
        {
            "text": "M, but I think this will be my Xenoblade Chronicles. Okay, I think this I'm going to at least try to play this one. We'll get one code from Nintendo and I will put you on it. I'm down, okay, I'm down at the very least we'll get a preview out of me. Cool, but Nickle Whis does it? It's so funny cuz like not many weeks ago I think it might have been last week I swore off playing large RPGs for the next year and like I saw Xenoblade Chronicles X and I was like I've always wanted to play Xenoblade Chronicles and it got mechs. I think I have to, I think I have to try it out at least. I love it, see I love it but yeah I think that it's going to review significantly better than the original did. The original 84 not bad looking at the scores of other um Xenoblade and their remakes or definitive editions or whatever it is I'm being a little lofty here but I'm feeling a little lofty okay there's something about Xenoblade Chronicles X that I think is going to again I think it's the mech factor, okay I mean.",
            "start": 1028.44
        },
        {
            "text": "is I'm being a little lofty here but I'm feeling a little lofty okay there's something about Xenoblade Chronicles X that I think is going to again I think it's the mech factor okay I mean mechs are huge mhm literally cool as hell cool as hell and also yeah like X was a Wii U game yes right so yeah to your point way more people playing it hopefully like that lights a spark and also I think Xenoblade now is different from Xenoblade then as far as the amount of people I've seen like talk about like how much they love two how much they love three right people ride for it now not saying they didn't ride for it before but I think Xenoblade Chronicles X is going to hit right now all right BL let me take you to April take me to April now remember April very big deal for Nintendo fans out there yep because on April 2nd 2025 we will get the Nintendo Switch too Nintendo Direct all of our questions will be answered or will they during the direct we will finally learn how Nintendo's going to",
            "start": 1076.88
        },
        {
            "text": "yep because on April 2nd 2025 we will get the Nintendo Switch too Nintendo Direct all of our questions will be answered or will they during the direct we will finally learn how Nintendo's going to handle switch 2 games being upgraded for the Nintendo Switch 2 and guess what that it's weird it's weird good news breath of the wild will get an upgrade patch at the Switch 2's launch nice bad news The Legend of Zelda: The Wind Waker HD won't at least not on any comprehensible release timeline Switch 2 upgrades will be a random ass drip feed and it will be a perk of Nintendo Switch Online oh not that last part I feel you until that I feel like that last part is I don't I know if they can get away with that I would not be surprised if breath of the wild is a freebie and going forward oh in a couple months Mario Odyssey is going to get an upgrade but if you have Nintendo Switch Online though CU that's just gross I feel like then you get into like territory of is this okay like can we let them do this",
            "start": 1119.16
        },
        {
            "text": "Mario Odyssey is going to get an upgrade, but if you have Nintendo Switch Online, though, C.U. that's just gross. I feel like then you get into like territory of is this okay, like can we let them do this? Like we got to revolt, we got to do something. We that's kind of diabolical. Premium options, you don't need it; the game will run. I think it's the most plausible outcome. I'm not saying I want it, but bless. I thought a lot about this, and if I had to put my money down on what I think they're going to do, I think this is the most likely option. I pray to God Almighty that you're wrong. Yeah, yeah, cuz I think it's plausible. I think you're right as far as it could happen. I would hope that Nintendo would resist the urge; I would hope that Nintendo wouldn't even need to be free. I think I even get into what would I prefer right cuz like could it be free? Sure, yeah, just everything, but then you then get into the cost of what it takes to do that and like are they willing to do that?",
            "start": 1178.52
        },
        {
            "text": "cuz now I get into what would I prefer right cuz like could it be free sure yeah just everything but then you then get into the cost of what it takes to do that and like are they willing to do that y y it's Nintendo then I get into well they could just sell us things piecemeal right you could buy Breath of the Wild Switch 2 Edition but then that even is more expensive than just buying the the membership at that point I actually again I'm a fan for the Nintendo Switch membership so I I don't actually think this is that big of a deal um I understand people being upset about it if it were to happen but cuz it's just not the ideal way for things to go but I think it's better than having it be a piecemeal like patch by patch download but here's the thing having said all of this I do think that playing Switch one games on Switch 2 inherently will have some type of boost I just don't think it's going to be this gamechanging thing I think that will have to be more of a tailored",
            "start": 1223.24
        },
        {
            "text": "do think that playing Switch One games on Switch 2 inherently will have some type of boost, I just don't think it's going to be this game-changing thing. I think that will have to be more of a tailored, handcrafted like we're making this experience better type thing, and that's what these are going to be. But at the end of the day, that's what we're going to want; we're not going to be super happy with just the basic stuff. It'll be like, \"Oh, it's running a couple frames faster\" or like things like that. But I do think that uh, we're going to be like, \"Okay, Breath of the Wild cool,\" but what about Tears? And it's like, gonna... We're not necessarily gonna have that answer for we won't know. Yeah, I like this because this is I think where I diverge from this is I I think the more um detailed like upgrades, like the patches that actually make big changes to like how much better this looks, I I think are going to be so few and far between. I think Breath of the Wild will get one of those and",
            "start": 1262.16
        },
        {
            "text": "upgrades like the patches that actually make big changes to how much better this looks, I think are going to be so few and far between. I think Breath of the Wild will get one of those, and that's based off of the conversations that happened a year or so ago at Gamescom 2023, where people were shown versions reportedly right, people saying like \"oh yeah, we saw a version of Breath of the Wild that looks so much better.\" I think those will happen but I do think those are going to be a very select few games. And I think most games - not even most, maybe just a lot more games are going to get like a basic, not that crazy of an upgrade, but yeah, like a little step up. Yeah, and I think that is going to be the expectation, and I think it is going to be the thing where people are just like \"all right, it is what it is,\" but I can get Breath of the Wild, maybe it might look a lot better, and maybe that could still be Switch.",
            "start": 1311.68
        },
        {
            "text": "think it's going to be the thing where people are just like, \"all right, it is what it is,\" but I can get Breath of the Wild; it might look a lot better, and maybe I guess maybe that could still be Switch Online thing. I think you're knocking on the door, you're tapping into something. Yeah, I just hope that it's not as crazy. Yeah, I know. I mean, honestly, the thing that that bugs me the most about it is the idea of a drip feed with no timeline. Yeah, which is the most Nintendo; that is a very Nintendo thing. I think we've gotten used to that by now. There's one last thing about the Nintendo Direct that I want to put out there. This is me getting a little bit wild, but I don't think too crazy. It's unlikely, but possible: Ocarina of Time remake exclusive for Switch to E3. I don't think it's a big old thing, but I see them kind of wanting to sell during this direct; hey, we got a future and you're going to want to be part of this. I don't think there is a uh let me not speak to... I think if you're Nintendo and",
            "start": 1352.08
        },
        {
            "text": "I see them kind of wanting to sell during this Direct, hey we got a future and you're going to want to be part of this. I don't think there is a uh let me not speak too quickly. I think if you're Nintendo and you're doing a Switch 2 presentation, you've got to put some kind of Zelda in it - like even if it's far out. Like Zelda, I think, is that unicorn game of all right people like we have a Mario coming out this year most likely, right? We have a Mario, we have a Mario Kart, but like Zelda needs to be that thing on the horizon that people are like \"I've got to get myself a Switch to play that Zelda eventually.\" And my bigger thing here - the reason I added this was my last edition here because I've been wavering. I'm like is it too crazy? I feel like it being in the launch Direct of the Switch, like the initial showing off the games, is a little weird and I'd be like you know what they're going to save that for their summer showcase.",
            "start": 1399.0
        },
        {
            "text": "feel like it being in the launch direct of the Switch, like the initial showing off the games, is a little weird. I'd be like, you know what, they're going to save that for their summer showcase, their second one, they don't have that this year because this is their summer showcase. You got to imagine right, like this being April, it's like they're not going to do one in May or June. Yeah, so I think we just get a tease. It could be something like the Wii U tech demo we saw of The Legend of Zelda: Ocarina Time remake that we ended up never even seeing, but like just some footage of it, just something that we're like \"I agree with that.\" Yeah, you know. Incredible stuff though. Imagine I can... I think the only part is funny because we talked about this so much. The Legend of Zelda: Ocarina Time remake, I'll believe it when I see it, like I hope so and I think it makes a lot of sense. I think that could be a good in-between of Tears of the Kingdom and whatever the next major Zelda is, especially if they decide to",
            "start": 1438.92
        },
        {
            "text": "I hope so and I think it makes a lot of sense. I think that could be a good, especially as like an in-between of The Legend of Zelda: Tears of the Kingdom and whatever the next major Zelda game is, especially if they decide to like move away from the high rule that we're in in Tears of the Kingdom, like an Ocarina remake would be such a great idea. Alright, now here's a Stalone something something different but something very exciting, like as exciting as a mainline thing before we get to whatever our next reimagined Zelda thing is. Um, but a Time remake just sounds too good to be true to me; it sounds and and yes you're right, it almost reminds me of how you talked about Sonic Adventure and why Sega wouldn't want to make a Sonic Adventure 2; it's so lofty of the difference with those there are many differences with those, but uh the difference in terms of like possibility to me uh I I've said this many times but for people just listening to this episode of the show, the amount that Nintendo is investing in Breath of",
            "start": 1485.52
        },
        {
            "text": "The difference in terms of like possibility to me, uh, I I've said this many times but for people just listening to this episode of the show, uh, the amount that Nintendo is investing in Breath of the Wild and Ocarina of Time styled things separately but together, I think is very telling when you look at all of the the theme park stuff we're hearing about when we look at the uh the Lego set that they put out that's the Great Deku Tree that is you can do both different styles. I think Nintendo is looking at those two styles as like things that they want to push as representing Zelda, mhm. Um, and Ocarina of Time, like you don't get bigger than that one, you know what I mean? Like that is the one, and it obviously has been more than long enough uh since the release of either the original or the 3DS remaster to introduce it to a whole new generation of gamers, more Zelda fans than we've ever had by far uh with the Switch generations. I like it, I like it a lot, I like it too, and that's all you have.",
            "start": 1526.28
        },
        {
            "text": "remaster to introduce it to a whole new generation of gamers more Zelda fans than we've ever had by far uh with the Switch generations I like it I like it a lot I like it too and that's all you have for the Switch 2 direct well I don't want to I don't I mean want to spoil yeah you know there's other stuff clearly they're going to talk about like other details and a lot of stuff but I'll get to that when we get to that fair enough maybe they'll talk about Metroid Prime 2 and three remastered will be released but there's going to be something weird about it maybe they're digital only or only available to buy every other Tuesday or just a limited run you can only buy them in a certain amount of time I I don't know but there's going to be something weird but those games will be coming out sometime before the Switch 2 interesting and that just seems right to me the only thing I have against it is is it too much Metroid if you're planning on putting out Metroid for let's say either at",
            "start": 1570.04
        },
        {
            "text": "before Switch to interesting and Ma just seems right to me the only thing I have against it is, is it too much Metroid? Right if you're planning on putting out Metroid Prime for let's say either at Switch launch or even like through the rest of the year, giving people two Metroids before it, two Metroid Primes before it, going to like fatigue people on Metroid. Yes okay fair enough, fair enough do it anyway I think that maybe that's the weird Nintendo decision of it all right of just like no I'm with you like I don't necessarily think this is a good idea um but I see it happening now there's another world where we kind of flip it and two and three just come out like months after four yeah you know I think that's what I see like if four comes out I could see two and three maybe being an early 2026 right CU I do think that you should remaster those and like put them out as a collection but I think the hunger is already there for Metroid Prime 4 that like you know put that up front and then",
            "start": 1618.4
        },
        {
            "text": "2026 right CU, I do think that you should remaster those and like put them out as a collection, but I think the hunger is already there for Metroid Prime 4, that like you know put that up front and then have that be the thing that Hypes people up for two and three as opposed to the other way around. Yeah, no, and again I think you're right, but we're not Nintendo, that's true, you know what I mean. I mean you're right. Um, and then June yeah, a first-party Nintendo Switch game that we don't currently know about will release on the Nintendo Switch one okay, and I'm saying something of a level of consequence. Oh, and it's not going to be a new Mario or a new Zelda or something like that, right? Yeah, not a new Animal Crossing, not a new Splatoon, but you're talking about like a new Donkey Kong, but it could no, but no, no, no, it it could just be another port or another thing, but it it's going to be like something on the level of a Donkey Kong Country remastered or a Mario vs. Donkey Kong or U I'm trying",
            "start": 1666.84
        },
        {
            "text": "but no no no it could just be another port or another thing but it it's going to be like something on the level of a Donkey Kong Country Remastered or a Mario & Donkey Kong or U I'm trying to think of Super Princess Peach Showtime okay something like that like that level of game gotcha um maybe a Kirby game that is the most plausible thing you ever said yes kby game coming out late switch one that we all ask like oh why are you putting this out right now all right cool I guess we'll play the Kirby game but this will be a game that that actually thank you Nathan the viewer that is exactly where my head was at Kid Icarus: Uprising I like that getting a port of that 3DS remaster I think that'd be amazing actually like they need to do that um that to me is the June game that we will hear about in the February direct let me throw another one at you Kirby Planet Robobot potentially yeah I think that's a a very like everyone loves that one and and also that was a rumor that we talked",
            "start": 1718.16
        },
        {
            "text": "about in the February Direct let me throw another one at you Kirby Planet Robobot potentially yeah I think that's a a very like everyone loves that one and and also that was a rumor that we talked about I think at some point yeah was it a rumor we talked about or was it one that like there was a rumor there was a Kirby game and then we like talked it back and forth they like well it's probably I think Nate the Hate specifically mean yeah I think that's a great pull then for that but I think yeah the February Direct that's where we'll start hearing about the Metroid games and whatever this ends up being this game that releases in June I like it a lot now Blessing I don't know if you noticed yeah I just did June you did I just did June with a a random new Switch game coming out and no Switch too no Switch too huh huh I'm very curious about where you're going to go with this but we'll get the answer in a few because I want to talk to you about patreon.com of funny and youtube.com/ of funny",
            "start": 1769.0
        },
        {
            "text": "no Switch too huh huh I'm very curious about where you're going to go with this but we'll get the answer in a few because I want to talk to you about patreon.com of Kinda Funny and youtube.com/KindaFunnyGames where you can get the Kinda Funny Membership which allows you to get shows ad-free and speaking of ads let us tell you about our sponsors this episode is brought to you by Shady Rays get ready for the season ahead with quality Shades built to last our friends over at Shady Rays have you covered with premium polarized Shades that won't break the bank Shady Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people they have hundreds of options to choose from so you're bound to find the perfect pair to match your style plus if your Shades ever go missing or take an unexpected hit don't sweat it they have the most insane protection in all of eyewear every pair is backed by lost or broken Replacements if you don't love your Shades",
            "start": 1812.96
        },
        {
            "text": "ever go missing or take an unexpected hit don't sweat it they have the most insane protection in all of eyewear every pair is backed by lost or broken Replacements if you don't love your Shades exchange them for a new pair or return WorryFree within 30 days y'all know I've been outside a lot in the sun playing Pokémon Go and it's such a great experience wearing my Shady Rays when I'm out and about looking dope exclusively for you Shady Rays is giving out their best deal head to ShadyRays.com and use code funny for 35% off polarized sunglasses try them for yourself the Shades rated five stars by over 300,000 people that's ShadyRays.com use the code funny this episode is brought to you by Rocket Money you sign up for something forget about it after the trial period ends then you're charged month after month after month the subscriptions are there but you're not using them in fact 85% of people have at least one paid subscription going unused each month thanks to Rocket Money you can see",
            "start": 1856.56
        },
        {
            "text": "after month after month the subscriptions are there but you're not using them in fact 85% of people have at least one paid subscription going unused each month thanks to Rocket Money you can see all your subscriptions in one place and cancel the ones that you're not using anymore and save more money Rocket Money has helped multiple members of Kinda Funny learn that they are still paying for things they totally didn't even realize Rocket Money is a personal finance app that helps find and cancel your unwanted subscriptions it monitors your spending and helps lower your bills so you can grow your savings Rocket Money has over 5 million users and has saved a total of $500 million in canceled subscriptions saving members up to $740 a year when using all the apps premium features cancel your unwanted subscriptions and match your financial goals faster with Rocket Money go to rocketmoney.com/kindafunny today that's rocketmoney.com/kindafunny rocketmoney.com/kindafunny and we're",
            "start": 1899.8
        },
        {
            "text": "unwanted subscriptions and match your financial goals faster with Rocket Money. Go to rocketmoney.com/kindafunny today, that's rocketmoney.com/kindafunny. Rocket Money can help you cancel unwanted subscriptions and match your financial goals faster. And we're back, Tim. You had a big reveal for us, but before we get to that big reveal, I want to get to some of your big Super Chats that you left for us, starting with Nathan Maloney, who writes in and says \"Hey Tim and Blessing, my Switch 2 predictions: Sonic Heroes remake as a launch game, Fire Emblem remake, S3 Houses Definitive Edition, Smash Ultimate with added fighters like Shadow and Edelgard from Three Houses.\" Oh man, Nathan, I love where your head's at. I think you're wrong about all those yeah, the Sonic Heroes remake...I thought about it, but then because I think you need a November Sonic game, October November Sonic game, but you already have the Sonic Racing game, Sonic Racing Team. I think that might be it. Yeah, Sonic Heroes remake, I think will happen, I just don't think the timing is right here; it won't make",
            "start": 1944.96
        },
        {
            "text": "Sonic game but you already have the Sonic Racing game, Sonic Racing Team, I think that might be it. Yeah, a Sonic Heroes remake I think will happen; I just don't think the timing is right here. It won't make Switch launch; switch to launch no and then a Fire Emblem remake we might talk about that later. Uh, Three Houses Definitive Edition, Smash Ultimate Port, uh, those are things that like we'll have to wait and see, like how they're handling the if the it goes back to like what is the strategy for Switch One games coming to Switch 2? Like will we even need a Switch Ultimate port or is Switch Ultimate just going to be it. But I will yeah sorry I keep saying Switch Ultimate uh Smash Ultimate um I can see them and I pray that they release a cartridge version of Smash that has all of the DLC characters just on it, just so we can have that preserve that forever and they can never take Cloud away from me yep amen Amen to that um but getting new Smash characters at its ultimate I think that dream is over.",
            "start": 1997.84
        },
        {
            "text": "on it just so we can have that preserve that forever and they can never take cloud away from me yep amen Amen to that um but getting new Smash characters at its ultimate I think that dream is over I agree but **** I still love the dream here's the thing it should be over CU you shouldn't add anybody else after Sora come on Sora needs to be the final stamp on this thing like that is the way to end it uh we have another one from Vall Verma who writes in it says Tim I just started Mario Odyssey after being uh away from Nintendo for years I can't believe how the same plumber keeps revolutionizing Platformers encourage me to dive back in thank you dude love that enjoy one of the best gaming experiences you'll ever have there are few games that I dream about as much as Mario Odyssey you know what I mean times I wake up and I'm like I got to play it's crazy that I I don't go back to playing Mario Odyssey as much and I don't know why when I think about like how much I go back to playing",
            "start": 2043.48
        },
        {
            "text": "what I mean times I wake up and I'm like I got to play it's crazy that I I don't go back to playing Mario Odyssey as much and I don't know why when I think about like how much I go back to playing Mario 64 but that said I think back to it so fondly I think it's a size and scope thing you know and I think Mario 64 is such a just like a I think the way me and Tim Gettys play it's very similar where we can just pop in and we're just like I know we're just going to run around even moving around feels good you know we're going to have some fun there but whereas Odyssey I feel like because there's so many moons everywhere there's so many things to do at all points it can kind of feel like you don't jumping you don't know where to start yeah uh we got another one from Chris Cosi writes and it says crazy Pokémon predictions no game but a Pokémon Center land inside Universal Studios Florida after the Epic Universe launch this may there have been rumors for years that it'll rep replace Simpsons Land I",
            "start": 2088.96
        },
        {
            "text": "Pokémon predictions no game but a Pokémon Center land inside Universal Studios Florida after the Epic Universe launch this may there have been rumors for years that it'll replace Simpsons Land I mean I'd love that I didn't know there was a Simpsons' Land I yeah it's very small but it's cool as hell actually you get to go to Moe's Tavern oh that's fun very sick that's cool well I for some reason reading Simpsons Lane maybe think of the part in The Simpsons movie where they're in the dome yeah and I'm like oh it's it's probably the Dome that's probably what Simpsons Land is the most iconic Simpsons thing the most iconic Simpsons thing the Dome remember um uh Spider-Pig mhm that was huge who could forget so we don't talk about Spider-Pig enough I think we talk about Spider-Pig the exact right amount we talked about it so much that year and then we moved on from Spider-Pig so hard that was like that was like the original meme you think about it I mean I don't think you're wrong SPID Pig",
            "start": 2129.04
        },
        {
            "text": "amount we talked about it so much that year and then we moved on from Spider-Man so hard that was like that was like the original meme you think about it I mean I don't think you're wrong SPIDER-Pig was one of the original memes we don't we don't give enough is it Spider-Ham is that his name or is it Spider-Pig Spider-Pig does whatever spider pig does yeah how could you forget spider pig but hams from spider yeah yeah there you go and otherwise there we go Spider-Pig right there did Spider-Ham come after spider oh came before yeah okay uh Jean sandal writes in his head Super Mario World remake Wonder Graphics or even uh LoZ: Links Awakening art style add Co-op I can hear Bowser's Castle theme in high quality Glory I mean I love where your heads at the idea of getting a remake of the 2D Mario games in some way is interesting I don't know that I'd want it in the the um Wonder style like I would want it to be something that's new and totally different but what I'd really want the most that",
            "start": 2173.24
        },
        {
            "text": "games in some way is interesting I don't know that I'd want it in the the um Wonder style like I would want it to be something that's new and totally different but what I'd really want the most that like I'm surprised they haven't went back and actually done is just like widescreen versions of the games cuz you can kind of do it in Mario Maker right yeah where like you're using the Mario World style but it's widescreen like it's weird there's no official way to play Mario World Mario 3 Mario 2 Mario 1 in widescreen what if what if we did the opposite and like scrunched it a little bit and put it on a handheld and call it Deluxe okay okay out a multiplayer mode there go a multiplayer mode for no reason oh man Super Mario Deluxe was the way I beat Super Mario uh Brothers one and like man that was an experience like that was like I hold that near and dear even though I later I learned that that was the worst way to play that game it's not the worst way but it's not the most ideal but",
            "start": 2222.52
        },
        {
            "text": "that was an experience like that was like I hold that near and dear even though I later I learned that that was the worst way to play that game it's not the worst way but it's not the most ideal but there's some additions to it that were really cool like there was an actual like world map world map was cool I mean that was the only way I would ever beat Mario 1 honestly is like by playing a game boy game that would save where I'm at in the world because otherwise God there's no way I was beating that as a kid um and then one more from Hooded Robin WR in says do you think they combine black and Black Two or stage it as two different games still also loving the Tommy Versetti fit today Tim Timmy Versetti man what they call me um I realized like like people Everyone oh Tim looks like you just came from Miami I'm like I think I just really like Miami style it's fair they got the style over there um do they combine them I mean no dude again and DS you get black one and you're going to",
            "start": 2267.04
        },
        {
            "text": "came from Miami I'm like I think I just really like Miami style it's fair they got the style over there um do they combine them I mean no dude again and DS you get black one and you're going to like it will we ever get black two probably not sorry just like uh we got Alpha Sapphire and Omega Ruby and it was like well why didn't you adapt the stuff from Emerald that like made it even better remake that no okay that's just not how they roll W and DS Tim tell me about what happens in July so July is where we start to cook everybody that's when things get really real because on July 11th, 2025, the Nintendo Switch 2 will be released who July 11th strap in for $400 oh I feel this price is a lock and in fact Blessing yes I think it's a good thing you just made a uh sound I think we'll be lucky if it's $400 I mean the more I think about it the more you're right even after yesterday CU yesterday said 350 which is crazy yeah which isra but like even this morning reading about like the um the some",
            "start": 2304.92
        },
        {
            "text": "$400, I mean the more I think about it the more you're right even after yesterday CU said 350 which is crazy yeah which israel but like even this morning reading about like the um some of the terror stuff that's happening right like I'm not I'm not even like that type of stuff I feel like I'm not equipped to predict and all that stuff yeah my $400 bet is if things were quote unquote normal yeah so who the **** knows what's going to happen but $400 as if it was being priced right now are how's the world going to react to $400 fine yeah be working like all right that is entirely reasonable for what this is going to be yeah in the state that we're in the year of 2025, $400 for Switch 2 I think that if it's too cheap it's actually works against Nintendo for what this console is supposed to be yeah um we have a console for people who want to pay $300 and under and it's called The Switch one exactly I mean especially with already how they're marketing this of like oh play",
            "start": 2363.44
        },
        {
            "text": "The Switch two will have a console for people who want to pay $300 and under, and it's called The Nintendo Switch. One exactly, I mean especially with already how they're marketing this of like oh play switch one games, it's a message, it's an ecosystem, everybody that's why Pokémon is still going to be on the Switch one okay yeah that's not it, that's not all I there of course not of course not we got to talk some launch games Metroid Prime 4: Beyond is a launch title of course cross-gen switch one and switch two, it will go on to be easily the best-selling Metroid game of all time we'll get a lot of third-party support at the launch Elden Ring we'll be there Final Fantasy VII Remake will be there wow Civilization 7 will be there mouse support of course yeah big thing there big thing there but Metroid Prime 4 will not be the only first-party game that comes out on this day mhm this is one of the predictions that I am less confident in but I think adds up in a world for me that I'm like oh it checks a lot",
            "start": 2411.08
        },
        {
            "text": "4 will not be the only first-party game that comes out on this day. Mhm, this is one of the predictions that I am less confident in, but I think it adds up for me. That I'm like, \"Oh, it checks a lot of boxes.\" Back in the day on the Super Nintendo, they released a game called Super Mario World 2: Yoshi's Island. Right? They did. Then eventually on the Game Boy Advance, they put out a game called... uh, I don't even remember exactly, but Super Mario Advance... four. Super Mario World 2: Yoshi's Island. A lot of... Mario Maker 3. Mario Paint 2. Jesus Christ, they're not actually going to call it that. They're not actually going to call it that. I'm just joking; I'm just joking. But what it is is Mario Maker 3, and the big thing is, what's it going to be different? Is it going to be Mario maker like we know, like we love, but there will be other game modes of things that you can make, and that will be Mario Paint-style stuff for those who don't know. Mario Paint was a Super Nintendo game that prominently featured a peripheral.",
            "start": 2461.64
        },
        {
            "text": "will be other game modes of things that you can make, and that will be Mario Paint-style stuff. For those who don't know, Mario Paint was a Super Nintendo game that prominently featured a peripheral – I just spit a lot with every P that I said the SNES Mouse. Yeah, many people played this game; many people loved this game. This game let you paint; it lets you make music; it lets you use Nintendo sound fonts to make Nintendo songs. A lot of there was a game called Nat Attack – it was awesome. A lot of the elements, both UI and sound effects, the saving robot, the loading robot, all that stuff were used in Mario Maker one and two. Mario Maker, in a lot of ways, is already a spiritual successor to Mario Paint. I think with mouse support adding more Mario Paint modes to a Mario Maker makes a lot of sense. And also, I think this is a good okay we got Metroid Prime for the hardcore big boys and girls out there; this is something to sell the parents on – oh but there's something educational there's something",
            "start": 2519.64
        },
        {
            "text": "I think that this is a good okay we got Metroid Prime for the hardcore big boys and girls out there this is something to sell the parents on oh but there's something educational there's something more family-friendly and also 2D Mario stuff of course there need to be new art styles or something so it's not just Mario Maker 2 again Mario Maker 2 being backwards compatible I understand there's a lot of things of like this doesn't add up W and DS everybody does it make sense for Mario Maker 3 to be a Switch 2 launch title the only does it have the only thing that gives me positive is it being a launch title Mario Maker 2 over 8 million copies sold many years ago that's nothing to shake a stick at that's true cuz we're talking about a launch of like oh is that enough juice for the launch **** did you listen to me just say Metroid Prime 4 Final Fantasy VII remake Elden Ring Civilization VI like that starts adding up to be a banger launch here's where I take fault with this is I think when",
            "start": 2577.68
        },
        {
            "text": "did you listen to me just say Metroid Prime 4 Final Fantasy VII Remake Elden Ring Civilization VI like that starts adding up to be a banger launch here's where I take fault with this is I think when we're talking about third party too much juice like how much is too much when we're talking about launch now like this could be the month right this could be a launch all this doesn't have to come out on day one obviously right like you can get week one be Elden Ring week two get FF7 you know three weeks into the month get Civ 7 but I still feel like it's a lot so I feel like two out of three or maybe one out of three of these I'm kind of casting a wide net here but I while I think you're right I also think we need to remember that launches are exciting launches are times that people are like oh I want to I want I'm buying this new fancy thing I want get stuff around it and I think that these games none of these are new mhm Civ 7 at that point will be 4 months old yeah so because February",
            "start": 2621.12
        },
        {
            "text": "I want to I want I'm buying this new fancy thing, I want to get stuff around it, and I think that these games - none of these are new. Mhm, Civilization 7 at that point will be four months old, yeah, so because February to July right, five months. So I think that like this is not too much because it's not like it's the brand new hotness that's competing with something. This is just from Software and Square and uh 2K double dipping, so they don't necessarily see it as like a man we need a big marketing beat for these. Like you're not going to get a bigger marketing beat than the Switch 2 launch as Nintendo is presenting it alongside everything as Target has it on its kiosks and all that stuff. Like I think that that kind of adds up, think about the PS4 launch, think about the PS5 launch, you know what I mean? You get a handful, a couple if even a handful - that's not right, you get one or two if even first-party titles, and then you just get a bunch of the heavy hitter third parties is Right for.",
            "start": 2664.44
        },
        {
            "text": "a couple if even handful that's not right you get one or two if even first party titles and then you just get a bunch of the heavy hitter third parties is Right for PS5 there's this game it's called The Pathless and that was a PS5 launch title and let me tell I also got another to talk about Sackboy: A Big Adventure but I'll get there in a second right The Pathless I played through absolutely loved played the **** out of that game one of my games of the year probably actually I don't think it was because I don't think it was in my top 10 but I played the **** out of The Pathless trust me yall uh and the reason I played the **** out of The Pathless was one because it it was a good game but also because it was a PS4 or no PS5 launch title same with Sackboy: A Big Adventure I feel like you can put out like some of your like mid tier to like lower high tier and have it be a launch thing and people will play it like it's the best thing ever",
            "start": 2708.96
        },
        {
            "text": "Sack Boy is a big adventure. I feel like you can put out like some of your mid-tier to lower high-tier games and have it be a launch thing, and people will play it like it's the best thing ever; people will devour it like it's a cracker when you're hungry. Right? Like I'm eating this up, and like I feel like you could do that, and then months later be like, \"All right, when it has space, let's yeah, let's do the big marketing beat for Elden Ring or let's do that for like Civilization coming to Switch because it is a big deal.\" Um, but I do feel what you're talking about. Right? Like I think I think one of these at least one of these comes to Switch at launch so um I don't know which one. But I think at least one of them. JG in the chat brings up something that I had not put together and is making me doubt this Civilization 7, 7 is coming to the Switch already? Oh, is it no way really? If they're right, they're saying that it's coming in February. Holy **** which does incredibly change this.",
            "start": 2751.32
        },
        {
            "text": "making me doubt this Civilization VII is coming to the Switch already oh is it no way really if they're right they're saying that it's coming in February holy **** which does incredibly change this and makes no no no they're not going to do a Switch 2 then uh during launch for that um but I don't think it's crazy for Final Fantasy VII Remake and Elden Ring to both be launch titles I think I've said this many times I think Elden Ring being there day one with the Switch 2 is a message that Nintendo wants to send mhm so I think that that's going to be a priority for them and then on top of that I think that um Final Fantasy VII Remake another one of the games that they talked about at Gamescom it was that and Breath of the Wild right that we're seeing uh run on the Switch 2 Hardware so I just think that that makes sense and also we're talking about remake we're not talking about rebirth see Chad is throwing out a game Baldur's Gate 3 that'd be **** sick that's where I'm at that'd be ****",
            "start": 2794.08
        },
        {
            "text": "that makes sense and also we're talking about remake we're not talking about rebirth see Greg Miller is throwing out Baldur's Gate 3 that'd be **** sick that's where I'm at that'd be **** sick with the mouse too see that one I could see that one I would almost put money on like if it's not launched in the first 12 months I think you're going to see Baldur's Gate 3 on Switch 2 that's got to happen um the one more thing I'll say on on Mario Maker 3 and I think the G the thing that gives me pause right not even that it doesn't have the juice cuz I think you're right as far as like 8 million sold like it'll push not that I guess you could argue that it'll push units but I think even more so like it is a title of consequence I do think that Mario Maker especially with like if if we are going to Mario Paint round if we're adding in these new features I think it's one that'll take quite a bit of like explanation from Nintendo as far as how you go about marketing it how you go about",
            "start": 2840.6
        },
        {
            "text": "going to Mario Paint round if we're adding in these new features I think it's one that'll take quite a bit of like explanation from Nintendo as far as how you go about marketing it how you go about talking about it right like I think you need to give that one maybe Space by itself as opposed to space by like the all the other launch games to thrive and then also I don't know if it fits the bill as far as like something that is uh uh Kitty if you're looking at if you're looking at it as like the opposition to uh Metroid Prime 4 which is going to be you know first person shooter violent **** we need something for the kids I think Mario maker I don't know if Mario maker is for the kids I feel like that's for us think about it as Mario Paint 2 which is very much for the kids okay and that that's to me the the kind of like how this fits and I also think that a big thing is uh I I think you predicted and I've heard a couple predictions that we're going to get like a everybody one two",
            "start": 2883.56
        },
        {
            "text": "that's to me the kind of like how this fits and I also think that a big thing is uh I I think you predicted and I've heard a couple predictions that we're going to get like an Everybody's Golf 2 Switch or an Everybody's Golf type game I don't think we do yeah I think that the focus during the February the April Direct that's going to talk about Switch 2 and the mouse support and all that stuff that is a Mario Maker time for them to to explain why this matters and I think that they don't need to explain much about Mario Maker because we know but I think going back to explaining the more educational slash educational is a weird word there but like more like this is a good use of your time learning how to play music learning like going real deep into some of the the Mario Paint stuff I think that is a a sell to parents for more kid focused things I can't explain to you the amount of fun I had with Mario Paint just coloring things in when I was a little kid things are different you know I",
            "start": 2922.6
        },
        {
            "text": "that is a sell to parents for more kid focused things I can't explain to you the amount of fun I had with Mario Paint just coloring things in when I was a little kid things are different you know I like gone are the days actually I don't know if this is true or not as a kid there was nothing more exciting than MS Paint oh yeah you know do kids still get excited about that or is that just such a basic it's everywhere so who cares I mean as a 30-year-old man I got I got to imagine no I that's I just don't know but I do think that if you're putting up Mario um pictures that you then get to color in that's a kid's dream dude yeah and I say that as a kid that loved doing that I wonder if there's a way to even feed in because when I think about what our kids are into nowadays my mind immediately goes to like TikTok and content creation which is like what Mario Maker is technically I wonder if there are ways to feed that in of like what if you could yeah color in Mario but like then",
            "start": 2964.84
        },
        {
            "text": "goes to like TikTok and content creation which is like what Mario Maker is technically I wonder if there are ways to feed that in of like what if you could yeah color in Mario but like then make him move or something and like make a record a fun video or like do stuff like that and share it around with your friends if you can figure out how to Loop that in with social features yeah I think you're cooking cuz you could do that in Mario Paint you could do basic animations where like yes you do multiple this is Mario play Mario Paint man dude Mario Paint was awesome because yeah you could literally you can go in you can draw pictures like multiple frames and then they would like switch between each other you can then go in and make music and put the music underneath the thing you can make videos in Mario Paint like oh that's cool and very very basic it was Super Nintendo but like what could they do now I think there's something here launch might be Lo lofty but there's something about all",
            "start": 3009.96
        },
        {
            "text": "in Mario Paint like oh that's cool and very very basic it was Super Nintendo but like what could they do now I think there's something here launch might be lofty but there's something about all of that that I think adds up all right so that's July is there anything else left for July that's July that's where I want to stop all right till we get to August let's get to August Mario Kart 9 will not be released in the first year of the Nintendo Switch 2 Tim in fact Mario Kart 9 will never be released on the Nintendo Switch 2 Mario Kart X will be released on the Nintendo Switch 2 in August 2025 one month after the Nintendo Switch 2 launch I love you that's good people might say x how are we going to jump there there's Ben an arcade Mario Kart but we don't count that cuz you can't own that Mario Kart Tour is a game that came out after Mario Kart 8 that you can own that Nintendo can see as Mario Kart 9 this allows them to jump straight to Mario Kart 10 AKA Mario Kart X the smart market",
            "start": 3049.88
        },
        {
            "text": "Mario Kart Tour is a game that came out after Mario Kart 8, which you can own, and Nintendo can see as Mario Kart 9. This allows them to jump straight to Mario Kart 10, also known as Mario Kart X. The smart market when you look at Mario Cart 8 and the eight in the logo, mhm, it kind of represents this like anti-grav infinite loopy type situation. Yep, that kind of defined the aesthetics of Mario Kart 8. What is X often used for? Hm, I like this guy's crossover means crossover interesting. Mario Kart X, it's the Super Smash Brothers of Mario Kart, baby. Everyone there, I, I, I like how you're thinking even though I when we get to X, what's so funny is like I got to when you said what does X make you think of right? For me, it is Crossroads, and like more so it's the idea of a shout out to Kevin for bringing up the everybody's here kind of thing. C here, I love Funky Kong be on the cart. Um, and I want you to explain more of your thing cuz I'm really interested but like I I think of like when",
            "start": 3103.08
        },
        {
            "text": "bringing up the everybody's here kind of thing for C here I love Funky Kong being on the cart um and I want you to explain more of your thing cuz I'm really interested but like I I think of like when you look through the the gameplay footage of the next Mario Kart in the Switch 2 thing right like it looks like maybe the track is shifting as you go like maybe you can make multiple tracks out of like the same like area type thing so my mind immediately goes to like roads crossing over and it being the thing or even being the thing of Burnout Paradise where we meet at the crossroads, start a race there type type thing I'm very fascinated by all right everybody's here it is a crossover Mario Kart X is bringing everybody in when you say everybody yeah who do you mean by everybody that's my thing that everybody's here I'm I'm semi joking because I I think it could get there but my I my idea is I think the X can represent multiple things cuz I do think that it could be a crossover of characters",
            "start": 3174.28
        },
        {
            "text": "everybody's here I'm I'm semi joking because I I think it could get there but my I my idea is I think the X can represent multiple things cuz I do think that it could be a crossover of characters but I think that the footage they showed is a little bit of a uh red herring that we've seen so far of this next Mario Kart the the road that we saw and like how open it was how big it was the 24 playable characters the characters they showed us I think this is all very um purposeful to like get us talking about certain things but there's so much they're not showing us with this I think it's too early to like jump into like you were bringing up the Wonder thing and it changing the roads and all that stuff I think it's a little too early for that I also think it's a little too early to even necessarily get into it's going to be a for to Horizon open World type thing I think there'll be elements of that I I don't think it's going to be full on that but I do think it'll be",
            "start": 3218.12
        },
        {
            "text": "early to even necessarily get into it's going to be a for to Horizon open world type thing I think there'll be elements of that I I don't think it's going to be full on that but I do think it'll be a Nintendo version of that to some extent almost like a a Bowser's Fury type open world as opposed to a Odyssey type open world you know um but the you're bringing up Sonic uh Team Sonic Racing or whatever it's called Nintendo doesn't give a **** no Nintendo's like oh cute Sonic expiration cars yeah we got Mario Kart I don't think that that necessarily matters I'm sure they're kind of like oh that sucks that the cross would be in both of them but they ain't looking at it that way yeah um but yeah in terms of the everyone's here I think it just yeah represents multiple uh Nintendo properties I think that we'll just have different characters in it um clearly we're still going to get new Mario Kart World levels like this Yoshi level that we're seeing here we've never seen it before it's not from",
            "start": 3261.96
        },
        {
            "text": "that we'll just have different characters in it um clearly we're still going to get new Mario Kart World levels like this Yoshi level that we're seeing here we've never seen it before it's not from any Mario game any Nintendo game or whatever we're going to get those but I also think that we will be visiting other worlds which we've done before I think we'll do it in a bit more of an official way cuz we've done in Mario Kart 8 Deluxe had like the Animal Crossing one there was an F-Zero pack I think I believe yeah uh there was like a Zelda one as well so it'd be dope to get way more of those right like if half of the tracks wait have we gotten Splatoon are you saying okay for sure we're going to get a we got Inklings in it though but we didn't get an Inklings level we already Mario Kart 8 Deluxe by the end of it like kind of is already really working towards this but again I just think leaning into the X for the marketing to explain what's different about about this game about",
            "start": 3306.56
        },
        {
            "text": "Mario Kart 8 Deluxe by the end of it, like kind of is already really working towards this, but again I just think leaning into the X for the marketing to explain what's different about this game from this one. Uh, I think that could be really exciting. I also am very interested in the direction they go with the soundtrack because Mario Kart 8 is like one of the best soundtracks ever; they went so hard into that big band jazz renditions of everything, so I wonder what they're going to do here but um rap rock let's go we can only hope Limp Bizkit rolling rolling for everything. Um, but yeah Mario Kart X everybody I like it. AUST I like it, and also I think you're spot on with like them skipping nine or not skipping nine technically cuz we're going to call it tour but yeah listen if Microsoft and the iPhone have taught me anything it's that companies don't like nine for some reason skip over the nine if you can all right hit me with the next month September The Legend of Zelda: Wind Waker.",
            "start": 3346.72
        },
        {
            "text": "and the iPhone have taught me anything it's that companies don't like nine for some reason skip over the nine if you can all right hit me with the next month September The Legend of Zelda: Wind Waker will be released on the Nintendo Switch one I mean you're right who cares but I'm boinging Nintendo yeah whatever it like it'll be fine it'll be fine yeah I guess I could play it on my switch too I guess I think yeah I think it anything that we want it'll be fine yeah not Twilight Princess Boo come on I don't know it'll come eventually maybe tweet tweet treat Twilight Princess with some respect God dang it yeah dungeons my my thoughts here our uh Wind Waker is uh it's been longer since we've got it cuz it was on the Wii was already released but uh we more recently got the uh The Legend of Zelda: Twilight Princess for Wii U right so I think that they're going to still stagger the releases of this and we're still going to be questioning when why but yeah I don't think it'll be a dual pack I think it'll be a single",
            "start": 3386.0
        },
        {
            "text": "Wii U right so I think that they're going to still stagger the releases of this and we're still going to be questioning when why but yeah I don't think it'll be a dual pack I think it'll be a single release and I don't think they even mentioned Twilight Princess when they talk about Wind Waker I can see it no matter how many years it's been since we've been predicting that these games are already done and just sitting there very plausible I like it October definitely one that's I don't have much to say but I don't think I need to say much Halo Master Chief Collection Allelujah everybody all signs are pointing to this happening right that that more Microsoft more Xbox games are going to make their way to PS5 and Nintendo Switch 2 Halo Master Chief collection's been thrown around I actually think it's a great pull I think that there will be crossplay and I think that there will be a moment in October that Halo's back baby that moment will not last long I was going to say like how well",
            "start": 3449.24
        },
        {
            "text": "think it's a great pull I think that there will be crossplay and I think that there will be a moment in October that Halo's back baby that moment will not last long I was going to say like how well is going to work I think it's going to work you think it's going to work I think it's going to work yeah and I think that there's going to be this like Renaissance weekend maybe two yeah of oh my God people on Playstation Nintendo and Xbox were all in Battle Creek and it's awesome and then that's going to fade but the game will come out and it'll be available on the Nintendo Switch love that November the next big 3D Mario will release in November 2025 November so far into the year and the reason for that is everything's just pushed back from our normal predictions because we've been working off of a switch two's coming in March maybe April but now they like oh we're not getting into the direct till April yeah everything's a couple months back so because of that I don't think that",
            "start": 3496.92
        },
        {
            "text": "working off of a Switch Two's coming in March maybe April, but now they're like \"oh we're not getting into the direct till April\" yeah everything's a couple months back so because of that I don't think that they're going to want to release all these big games that we're talking about like Mario Kart and Mario that close together give it just a couple months yeah, but then you get weird with the Game of the Year type stuff like does Mario miss out on that no it comes out too late it's Mario so I feel like the people are rock solid for Mario I think that's the type of thing of recent he buas if and not I'm thinking of like I'm even thinking of The Game Awards like eligibility I think he'll make it before that before the cut off which is normally November 16th like yeah, like Midway through November I can see the game releasing November 14th or something but people will have reviewed it like the week before that and you know I I'm pretty sure that everybody playing Mario the next one for review by that",
            "start": 3542.04
        },
        {
            "text": "the game releasing November 14th or something but people will have reviewed it like the week before that and you know I I'm pretty sure that everybody playing Mario the next one for review by that point you're thinking about game year you're thinking about and you'll know like is it hidden or is it not you know um it will will feature Donkey Kong okay and Peach and Luigi and possibly more all playable because it will be Odyssey style open millions of things to collect stars or moons or whatever the **** but Co-op multiplayer interesting of course you could play it by yourself but it's 3D Mario not just the isometric platforming challenge based get to the end of the level style of 3D World more like a Bowser's Fury that is a bit more open but way more open like Odyssey multiplayer Co-op how why what's the idea here there's can I go anywhere in the level like explain to me how this is going to work that's what it is I'm thinking think about the the rise recently in Mario Kart 8",
            "start": 3577.08
        },
        {
            "text": "how why what's the idea here there's can I go anywhere in the level like explain to me how this is going to work that's what it is I'm thinking think about the the rise recently in Mario Kart 64 now that it's been reported to PC of people adding multiplayer and they're just in levels together collecting different stars together mhm that's true think about that think about playing a Mario Odyssey level think about being in New Donk City with multiple of your friends and you're all collecting uh moons together you can race to see who gets the most moons you can work together for moons I just is there anything Nintendo loves more than a group of friends hanging out on a couch having fun with a plumber yeah I'm just trying to think of it from like a gameplay sense as far as like it what is the co-op giving you a side from sitting next to your friend I guess playing the same thing right because then I guess I'm thinking about would I want to play a game co-op with a friend where they're",
            "start": 3638.28
        },
        {
            "text": "the co-op giving you a side from sitting next to your friend I guess playing the same thing right because then I guess I'm thinking about would I want to play a game co-op with a friend where they're like collecting my stars for me it's like no man I'm playing this this whole **** by myself I feel like unless it is us going through the same like if it was a more linear Mario game of course like okay cool we're going through the same course together picking each other up throwing each other like having fun in that way I feel like in an open 3D explorable world what are the things that are bringing you together to like **** with each other or like pick each other up or help each other I think that's the Nintendo magic I think they'll figure that out they'll find the fun there and I I think also it wouldn't be too hard to come up with ways of like it you only get on your save file the stars that you get right there could be some like group oh we need to get this much together",
            "start": 3688.36
        },
        {
            "text": "and I think also it wouldn't be too hard to come up with ways of like, if you only get on your save file the stars that you get right there could be some like group goals - oh we need to get this much to get to the next level or like there could be some multiplayer specific Stars potentially. Are you thinking online multiplayer? Yeah, yeah. Or more for them just like local, we're together each on our own hand switch playing together, you know, local multiplayer, yeah, like ad hoc or whatever it's called. Yeah, okay, okay, yeah. It's interesting I was trying to get realistically spicy with uh not just saying oh it's Mario Donkey Kong cuz I've been saying that forever but like I think that with where Nintendo's at and with where 3D Mario is at and with where like the experience people want to have they just want to hang out with their friends and be in a world and there's no world cooler than the Mushroom Kingdom. I agree with that, you know. And yeah, like I see somebody frolicking in chat",
            "start": 3724.8
        },
        {
            "text": "they just want to hang out with their friends and be in a world and there's no world cooler than the Mushroom Kingdom I agree with that you know and yeah like I see somebody frolicious in chat says blessing used to watch uh in 64 Co-op mods the thing is I have right like I've I used to get well I used to I get them on TikTok I guess I used to get them on TikTok all the time right and my thing with those is that those often times whenever I see them are people speedrunning right it is all right how fast can we get 120 stars with two people playing at the same time and doing all this stuff I think for Nintendo to do this with a Mainline like Mario Odyssey for example right it those games in a sense aren't necessarily they are built for speedrunning but they're not that's not the way most people are playing those games so like how do you casualize like the co-op experience of playing Mario and I guess I could see it being a thing of hey like it is just hanging out it is",
            "start": 3772.92
        },
        {
            "text": "the way most people are playing those games so like how do you casualize the co-op experience of playing Mario and I guess I could see it being a thing of hey like it is just hanging out it is people hang out in Fortnite exactly and so that's the thing is like there's there's a difference between Mario 64 and Mario Odyssey with how this works 64 you get a star boots you back to the castle mhm there's six stars a level and that's it they're very mission-focused Mario ody see there's **** screw it 69 million moons per level like one of them you have to go through this Gauntlet of uh platforming challenge one of them you have to figure out a puzzle the other one you just need to jump on a guy with a hat it's like there's no Rhyme or Reason really the Rhyme or Reason is is it fun right and I think that just like allowing a group of friends to hang out and just live in that level together and just collect random things MH that's it writes itself I mean I got a weird Nintendo",
            "start": 3811.16
        },
        {
            "text": "right and I think that just like allowing a group of friends to hang out and just live in that level together and just collect random things, that's it. Writes itself. I mean, I got a weird Nintendo decision to layer on top of this you're going to hate, um, cuz I could see you being right, and in fact, I think if you are right the way it's going to work is it's going to be local and it's not going to be split screen. The way it's going to work is the same exact way it worked in GTA San Andreas where y'all couldn't go too far away from each other. Like I think they're going to use that as a way to keep people together so that it is always like this, like togetherness of playing you know what I mean. And also yeah, like I think it's going to be limited, like I think if they do that it's going to be very limited. I don't I think that if they do this I think it'll be because they figured it out how to make this actually a viable worthy thing. The bubble",
            "start": 3850.64
        },
        {
            "text": "that it's going to be very limited, I don't think that if they do this, I think it'll be because they figured it out like how to make this actually a viable, worthy thing. I think the bubble system in the new Super Mario Brothers games was a good example of them having figured out, hey there's a problem here, like what if this happens? It's like, oh we have a solution. I think there'll be something similar there, but I think that it'll function more where there's like some type of way to fast travel to each other, like if somebody's doing something and you need them then it can just be like, \"you know,\" and then you're together, and it's like that solves that. And just like again, it's all about keeping the fun going. Okay, I do like the idea of playing as all these different characters though we play Donkey Kong in a 3D Mario game, uh, we mean again, Mario 64 DS did something very similar to what I'm saying, yeah, give it to me December, I've already said this before but this",
            "start": 3894.76
        },
        {
            "text": "Tim Gettys' Switch 2 Predictions - Kinda Funny Gamescast\ncharacters though we play Donkey Kong a 3D Mario game uh we I mean again Mario 64 DS did something very similar to what I'm saying yeah give it to me December I've already said this before but this probably is actually my least likely to happen at least on this timeline M but there's something about December that screams three words to me I know what they are for Smash Brothers yeah Smash Brothers Melee baby oh yeah I mean I like it I like it it's year one though yeah year one mhm December yeah just a thing this we're we're not trying to get game awards we're just trying to sell **** oh yeah I mean keep people happy I like it yeah it's it's a weird one but like I I think inevitably we're going to get melee again I hope so so and a big X Factor to me on this is they're going to want to get Smash a new Smash on switch 2 within the first two years and so the big question is what do they do with ultimate like do we is there an upgraded Port are there new characters is there some there",
            "start": 3934.16
        },
        {
            "text": "get Smash a new Smash on Switch 2 within the first two years, and so the big question is what do they do with Ultimate? Like, do we have an upgraded port? Are there new characters? Is there some way to get Ultimate on Switch 1 so you can have it on Switch 2 when did Ultimate come out in 2018? Mhm, okay, so that was in... yeah, that was in the first two years. You're right about that. Yeah, I'm very curious. I think I wonder... yeah, I know. I don't know. It's tough. I think there is a chance there. I think for sure Melee, like bringing back Melee somehow or porting Melee, I think would be such a slam dunk decision. It's one that it's so slam dunk, slam dunk, that like, I worry if Nintendo would actually get there right because I think they have this thing that they're kind of anti-competitive, right? They're anti-competitive, like making their games for the competitive scene, right? They lean towards you get to brawl and they put in the banana slipping in there or not even banana slipping, just tripping.",
            "start": 3999.56
        },
        {
            "text": "like making their games for like the competitive scene right they lean towards you get to brawl and you they put in the banana slipping in there or not even banana slipping just tripping in there right to like throw people off and like try to keep it less competitive and so I wonder if Melee is a thing that they want to revive for how resistant they are to that often time that's why I think this is just a random December release I I don't think it's going to be like the most mind-blowing thing ever I do think it's like hey y'all been asking we're going to give it to you go here be happy cuz they don't have it new Smash yeah like I don't think we're like anywhere close to that it'll happen mhm but like I don't think that it's like imminent so I think they're just going to want a new Smash out there do you think this happens over them just doing um adding GameCube to Nintendo Switch online and having Smash or Melee be maybe like one of the first games for it something tells",
            "start": 4047.72
        },
        {
            "text": "skew out there do you think this happens over them just doing um adding GameCube to Nintendo switch online and having smash or smash melee be maybe like one of the first games for it something tells me that they're not stupid and they know that they could make a lot of money by just doing a Paper Mario Thousand-Year Door style remake of melee M just it's the same **** game but it just has some upgraded sell it for full price and it will sell I hope you're speaking to my heart I know you're making me dream Tim I don't want to dream too hard I don't want get disappointed but you're speaking to me I like it we're into January now one of my final ones here this your 12th month yes it is okay I have a bonus 13th oh okay my 12 month here Fire Emblem Genealogy of the Holy War, The Fire Emblem 4 Super Nintendo remake this game exists I'm pretty sure this game is done we've heard way too much about this game we've heard way too much about Wind Waker and Twilight Princess we've heard way too",
            "start": 4086.04
        },
        {
            "text": "4 Super Nintendo remake this game exists I'm pretty sure this game is done we've heard way too much about this game we've heard way too much about The Legend of Zelda: Wind Waker and Twilight Princess we've heard way too much about Metroid Prime 2 and three I think it's time to just get all those things out the way let's do it so I think it is time finally and it's out for a Switch one that's that's where I'm a little hazy but probably like it is it's funny going through this cuz I'm like all right a lot of the predictions I'm making are Switch one mhm but then I'm like sense but is that crazy I don't think it is and I also think that like in a year that I'm also predicting a 3D Mario and Mario Kart and Metroid Prime that is going to be available on the Switch to some extent like I don't think it needs that many more things you don't get much bigger than those things so again like I think to your point right like you think about the big games that came out for the Switch one launch year and it's not like they",
            "start": 4140.84
        },
        {
            "text": "things you don't get much bigger than those things so again like I think to your point right like you think about the big games that came out for the switch one launch year and it's not like they put out a billion things right like they they did actually put out I think a lot for a launch year but like they put out what uh uh The Legend of Zelda: Breath of the Wild Mario Kart 8 Deluxe Arms Splatoon 2 Super Mario Odyssey and then they filled in the rest with like Super Street Fighter II like there were like Nintendo backed games exactly Super Bomberman R like they had like they had Snipperclips like they had those games like so I'm expecting that balance of maybe like five depending on I guess we're getting it later in the year so it's hard to even quantify but let's say four four or five big games with like a bunch of Nintendo backed small to like mid tier like AA like games to back it up right like that's what I'm expecting and that's my thing too is going off of this of like if I'm right that it's",
            "start": 4183.08
        },
        {
            "text": "a bunch of Nintendo-backed small to like mid-tier, like AA-like games to back it up right, like that's what I'm expecting and that's my thing too is going off of this of like if I'm right that it's coming out in July we are just talking about six months of the year I don't think we're going to get five big Switch 2 games that's crazy so yeah just kind of be a little realistic and also like again to your point of the Switch one stuff how many millions of people have Switch on still like they got to keep feeding those people they're not just going to cut that off out of nowhere um and then also the the it being a F-A Fire Emblem remake we just got engaged not too long ago which was a new game so I just think we're back on the path of the the echo um if they still use that branding uh and then February this is just a a fun little bonus I wanted to throw in here the 13th month uh Kirby and the Forgotten Land will get announced in a Nintendo Direct it'll have a new subtitle Kirby and the",
            "start": 4232.44
        },
        {
            "text": "February this is just a fun little bonus I wanted to throw in here, the 13th month uh Kirby and the Forgotten Land will get announced in a Nintendo Direct, it'll have a new subtitle Kirby and the Something M but it'll be a follow-up and we're going to be very very excited. Kirby in the Chamber of Secrets maybe Kirby in the Prisoner of Azkaban probably not Kirby in the Deathly Hallows Part Two I'm in let's go I like it, I think you're right. Wait so what are the chances we get a Kirby game like a 3D Kirby game at in uh April during the the upcoming direct? I I think the announcement I think that that's a phase two game we don't need it that soon I don't think fair enough yeah is that your final prediction, that is my final prediction. Tim I love your predictions thank you I you got me so so excited now I'm like about you yesterday it's funny because that beginning of KD Greg was asking about my like my hype levels for the Switch too right and like you know I the mind coming off of the",
            "start": 4276.92
        },
        {
            "text": "excited now I'm like about you yesterday it's funny because that beginning of GameOverGreggy was asking about my like my hype levels for the Switch too right and like you know I the mind coming off of the hardware announcement right like I'm excited for it but I'm still the same amount of excited that I've always been I don't think the hardware announce necessarily like push me all over the edge of oh man I can't wait for it like I need this now like I'm waiting for the Nintendo Direct to tell me all the games that are going to come come to this thing to then really get me excited your predictions you just ran me through man you know you're pushing me like I might be over the edge now so with that for me uh I I said this earlier of just like trying to come up with this and like it's hard to look at patterns or whatever but like I rewatched a lot of the Nintendo presentation in 2017 that was the real blowout of the Switch and a lot of it made sense a lot of it were like was good news I think",
            "start": 4327.88
        },
        {
            "text": "at patterns or whatever, but like I rewatched a lot of the Nintendo presentation in 2017, that was the real blowout of the Switch, and a lot of it made sense; a lot of it was good news, I think in retrospect looking at it you're like, \"Oh wow, there were a lot of big games that they talked about there,\" but there was just a lot of timing things, a lot of things that were weird. Of the amount of people that I've seen be like, \"There's no way Mario Kart 9 isn't a launch title\" because they showed it as in the Switch 2 launch thing; I'm like, if you think there's no way, like you don't understand how this works again. I don't think that it's impossible; I actually think that there's a good chance it's a launch title, yeah, but I also think that there's a very good chance it's not, but it's close. Um, but yeah, Mario Kart and Mario Odyssey both in the initial commercial that they showed, but then even in the Switch presentation when they were going through it like I remember getting towards the end",
            "start": 4367.08
        },
        {
            "text": "but yeah Mario Kart and Mario Odyssey both in the initial commercial that they showed but then even in the Switch presentation when they were going through it like I remember getting towards the end of it when they were talking about Breath of the Wild and there was a question of like is this not going to make launch and then it did thank God but like we're in that point right now of there's a lot of pieces on the table just because there's a way that like oh obviously they're going to fall this way they might not whenever the word obviously is in the same sentence as Nintendo take out the word obviously get it out of there CU they're Nintendo man you never know you never know I want to bring in some super chats real quick to close out the show CJ splits and writes in and says Return of Battle Clash question mark I don't think I know what Battle Clash is Clash yeah I don't know what that is that sounds like either a mobile game that um makes a lot of money or a flash game that makes",
            "start": 4409.36
        },
        {
            "text": "Battle Clash? I don't think I know what Battle Clash is. Clash, yeah, I don't know what that is. That sounds like either a mobile game that um makes a lot of money or a flash game that makes zero money. Deer six writes in and says will cloud-based games like Control, Kingdom Hearts, Guardians of the Galaxy etc get natively running SKUs or updates on Switch 2? I think Kingdom Hearts will, I don't know, I don't expect the others to yeah I could see I I could see them getting SKUs but I don't think it's going to be a marketed thing of oh these cloud games are now natively playable. I think they'll just happen totally to get SKUs uh Bobby Joe writes in and says a Pokémon maker would slap, I don't know what that looks like, that would be wild was that like you're making dungeons maybe or something and oh that that' be cool actually you make the Dungeons and like you place trainers to then stop the character the player character and you like choose what Pokémon they have the move set and",
            "start": 4453.12
        },
        {
            "text": "and oh, that would be cool actually. You make the Dungeons & Dragons and like you place trainers to then stop the character, the player character, and you like choose what Pokémon they have in their move set... let me cook Nintendo, let me cook... um also just play poker Rogue uh Jean sandal says instead of Mario Maker it's Nintendo maker and it implements the Nintendo music library. I got really caught up uh earlier just cuz I wanted to make the Mario, mar, Mario Maker 3, Mario Paint 2 joke... uh I do think that my the Mario Paint stuff I feel really strongly about just because of the the kid-friendly focus and how Nintendo would want to think of it even thinking about Lao and like some of the the style of game that Nintendo likes to have but I wouldn't be surprised if maybe Mario Maker 2, the sequel does evolve... I just don't know a branding name that's like that enhances it more but that maybe this is where we get other types of games that you can make as well where it's not just Mario um I think Zelda",
            "start": 4492.84
        },
        {
            "text": "I just don't know a branding name that's like that enhances it more, but that maybe this is where we get other types of games that you can make as well, where it's not just Mario. Um, I think Zelda might be too ambitious of a thing for that, but like some different types of styles - it's more of an in Nintendo maker, a Nintendo game maker. Um, it's just tough to think about the other games that could get the maker treatment right. Maybe Kirby; it would be like 2D Platformers. I think yeah, right so Kirby maybe Yoshi and then you start to trail off a little bit - it gets kind of tough totally. Uh, Joey ratone writes in says great show thanks for it while I'm off sick today. Thank you for watching Joey, and then finally Samson L writes in and says Tim wait what about um what about Pokémon Z? We talked about Pokémon Z; we did though. I didn't so I think Pokémon Presents is next month - we'll see it and get a lot more information on it. I imagine we will get a date on it, um but I real talk like I",
            "start": 4538.68
        },
        {
            "text": "about Pokémon Z we did though I didn't so I think Pokémon Presents is in next month we'll see it and get a lot more information on it I imagine we will get a date on it um but I real talk like I I don't feel confident enough to give any type of prediction on where it will fall because it could be anywhere it really could be it could be coming out in April or June or July or November or November like I don't know so yeah I'm a little I'm pretty hazy on that and I feel like I I don't have any confidence in like locking that down um and yeah earlier I was saying like so I think it's a Switch one game will it get switched to enhanced day one or maybe that is the thing that I think is uh important to note about my prediction about the switch to enhancements of things like Tears of the Kingdom and Mario Odyssey that they're not necessarily going to have them we won't know when they're going to get them but just at some point they'll happen I think when the new Switch One games come out",
            "start": 4583.12
        },
        {
            "text": "and Mario Odyssey that they're not necessarily going to have them, we won't know when they're going to get them, but just at some point they'll happen. I think when the new Switch OLED games come out, things like Metroid Prime or Pokémon Legends: Arceus or uh forgot what other ones... I I Wind Waker, yeah, I think those will have them day one. Oh okay, I see what you're saying, yeah, all right, but they're probably behind NSO. God, I hope not. I just hope it's it's I don't know consumer friendly, you know, just be more consumer friendly, Nintendo. Nintendo, that does bring us to the end of this episode of Kinda Funny Gamescast. Uh Tim, thank you for bringing your predictions. Uh audience, thanks for hanging out and giving your super chats. And also me, thank you for hosting. So good, you know, so great, so great. Someone saying \"bander\" saying I didn't have anything for October Master Chief Collection, yeah, rewind BN. Uh remember this has been Kinda Funny Gamescast each and every weekday we get together and talk",
            "start": 4632.08
        },
        {
            "text": "saying Bandersnatch saying I didn't have anything for October Master Chief Collection yeah rewind BN uh remember this has been Kinda Funny Gamescast each and every weekday we get together and talk about the biggest reviews previews and topics in Video Games Live on YouTube Twitch on podcast services around the globe if you love what we do support us with the Kinda Funny Membership on Patreon or YouTube to get all of our shows ad-free watch us record them live and get a daily exclusive show catch today's KFGD on YouTube or podcast uh and know that until next time it's been our pleasure to serve you",
            "start": 4678.0
        }
    ]
}