{
    "id": 13470,
    "video_id": "djf9fK1lR0k",
    "show_name": "Highlights",
    "hosts": [
        "Greg Miller",
        "Shuhei Yoshida"
    ],
    "title": "Ex-PlayStation Exec Talks Vita's Failure",
    "description": "From this episode of Gamescast: https://www.youtube.com/watch?v=jMsGB2PItes \nThis episode is sponsored by BetterHelp — go to http://betterhelp.com/kindafunny to get 10% off your first month.\nGo to http://joinbilt.com/kindafunny to start earning points on your rent payments today.\n\n\nFOLLOW US ON EVERYWHERE!\n---------------------------------------------------  \nYouTube: Youtube.com/KindaFunnyGames\nTwitch: https://www.twitch.tv/kindafunnygames\nPatreon: https://www.patreon.com/kindafunny/\nTwitter: https://twitter.com/KindaFunnyVids\nInstagram: https://www.instagram.com/kindafunnyvids/\nTikTok:  https://www.tiktok.com/@kindafunnygames?lang=en",
    "published_at": 1737997255,
    "duration": 1743,
    "transcript_chunks": [
        {
            "text": "these first days of PlayStation you start on this new team it's exciting it's what you've been kind of wed into existence since 86 is there also a is there any fear is there a trepidation you're starting off and launching is is PlayStation ever going to see the light of day is PlayStation or is Sony going to cancel it or not want to do it do you worry about that at all so uh because I love video games and I really wanted to work in video game uh at Sony uh so the goal my personal goal uh as I joined uh Ken Kutaragi's team was to help you know somehow contribute to make PlayStation be successful so that I can keep working on this project working on video games yeah so that was the that was the most important goal I think for me uh so I was always thinking about the overall you know how PlayStation is doing and not just the thing I was uh directly responsible for but the I was always thinking what's lacking with PlayStation what needs to be done from you know game to platform to marketing to",
            "start": 0.2
        },
        {
            "text": "Is doing and not just the thing I was uh directly responsible for but the I was always thinking what's lacking with PlayStation what needs to be done from you know game to platform to marketing to you know whatever uh so uh that that's how I I was always thinking the most difficult time uh during uh PlayStation uh other than the launch of PS3 that was hard but the uh during PS1 days you know we launched you know in Japan in 1994 the next Christmas uh Christmas 2000 uh 1995 uh we didn't have a big title for the Christmas and at that time in the industry Christmas season was so important 100% uh but um we didn't have you we had Konami's Dating Game, you know, to make Memorial that was great game but that was the only game and at that time we were competing with Sega Saturn and Sega had V Fighter 2 it's amazing amazing game uh hugely popular in the arcade uh uh so the Christmas the second first Christmas was great you know we had Ridge Racer they had Virtua Fighter so we sold out you know",
            "start": 54.0
        },
        {
            "text": "2 It's amazing, an amazing game, uh, hugely popular in the arcade, uh, uh, so the second Christmas was great, you know we had Ridge Racer, they had Street Fighter, so we sold out, you know, Hardware, uh, so both our companies did great but the second Christmas, uh, second year was doing better, so that was the most difficult time that I felt as a uh part of PlayStation. When you say it's the most difficult time and what does that mean? Is it morale, is it pressure from the bosses' boss, what does that look like? Yeah, because I was one of the you know leaders in the third-party relations team, the responsibility is to bring great games, you know, from third-party companies, and uh we are not able to deliver that Christmas, so that was really you know tough. Of course, uh I want to talk about your ascension to being but you bring up the PS3, talk to me about that how hard of a launch that was like what again is that like? I I you know is this before Slack so you're in the office",
            "start": 122.92
        },
        {
            "text": "talk about your ascension to being but you bring up the PS3 talk to me about that how hard of a launch that was like what again is that like I I you know is this before slack so you're in the office you're talking about this you're looking at numbers like when something like that happens when the PlayStation 3 comes out and doesn't do like where when do you remember being like we're in trouble on this one yeah so before the launch of PS3 because uh we you know uh we got the prototype hardware right yeah to work on you know first-party and the team start working on and the months it took month multiple months to get the team to have something on screen to see it the PS3 CPU was such a advanced kind of um um architecture the Cell processor never forget yeah Cell processor has a multiple processors inside the processor and the uh U programmer has to divide the program into uh these uh different chunks to uh simultaneously use uh these pro processing power to draw the you know potential",
            "start": 188.56
        },
        {
            "text": "inside the processor and the uh programmer has to divide the program into uh these uh different chunks to uh simultaneously use uh these Pro processing power to draw the you know potential power of the hardware and uh you know great people makes it amazing performance you know the Peak Performance of Cell Processor was huge it was even banned from uh exporting to certain countries you know because it was considered supercomputing might be used for some military usage or something yeah however it was so hard to program that I learned from our you know Studio teams uh that was scary right and another thing was cost of goods that you know we never announced but U it was so um uh um because the company built a factory to uh manufacture you know Cell Processor and the development of Cell Processor uh was a huge project you know with IBM and Toshiba was it you know like multiple companies lots of people involved so the development cost was huge and Manufacturing",
            "start": 256.48
        },
        {
            "text": "of Cell processor uh was a huge project you know with IBM and Toshiba was it you know like multiple companies lots of people involved so the development cost was huge and Manufacturing uh investment was huge and uh what when I was talking with Ken and he explained the business model of sales processor was so here thinking Beyond video game right he had a huge Beyond um huge Vision that yeah well you know people said he he was competing with Intel at the time so he said that we're going to build the so PS3 would be huge and uh he said he's going to uh we going to build as big new business new business outside the video game based on processor so that was his uh business plan so when you hear that what would do you think oh okay we have to build a as big a new business out of this thing otherwise we won't be able to recruit the investment no big deal that was that was scary yeah and of course that Vision didn't happen unfortunately and then one of like the big parts of the PS4",
            "start": 328.04
        },
        {
            "text": "thing otherwise we won't be able to recruit the investment no big deal that was that was scary yeah and of course that vision didn't happen unfortunately and then one of like the big parts of the ps4 was like hey it's not a console, it's a pc, it'll work you're cool out there trying to tell every developer how to program yeah yeah yeah yeah that was nice yeah so so the launch year and the second year after launch the company made huge losses um yeah so I thought you know we we would be over we are over um but but luckily uh during these years Sony's TV division had a huge success with a flat screen big screen, not CRT, but called the Bravia Series yeah remember that was a success yeah yeah so the Sony uh parent company made lots of money to cover the loss from ps3 so so we survived was there ever a concern from you that you wouldn't that playstation wouldn't survive that oh yeah when I learned about the losses we were making I was like oh we are we are finished it's over then I you know ps3 I feel",
            "start": 401.4
        },
        {
            "text": "a concern from you that you wouldn't think PlayStation would survive, oh yeah, when I learned about the loss, we were making. I was like, \"oh, we're finished.\" It's so then, I feel like PS3 is really where that console becomes a thing where people really do think about what would become PlayStation Studios and we talk so much about first party and what people were making and all these different things, like was that because people now had to work so collaboratively because of the processor you're saying it's so hard to make stuff for it? Were people having to share more stuff and did it feel like it was us against the world? Um, so Worldwide Studios was formed in 2005, yeah, in you know, uh, that was Ken Kutaragi's creation, you know, Ken's vision. Because the games are becoming larger in scope and we were divided into three different companies within",
            "start": 465.52
        },
        {
            "text": "in 2005 yeah in you know um that was Ken Kutaragi's creation you know Ken's Vision uh because the games are becoming larger in scope and we are divided you know three different companies within the company under Sony Computer Entertainment Japan us and Europe had a totally different uh production teams and making games uh individually um in and and each of us are like a midsize like a publisher and uh he thought Ken thought that you know it's about time to you know combine all the resources together to create the global organization so that was what Studio Liverpool and um luckily uh because that happened and the PS3 was so challenging to work on um uh we uh leveraged the best of the best you know technical expertise within the World Studios For example like a um um uh engine program that Noti do and Masanori Maani created um uh we uh provided um made that available for all the teams you know in studios to uh make games on PS3 to extract the you know performance necessary to make uh games on PS3",
            "start": 518.72
        },
        {
            "text": "Mani created um uh we um uh provided um made that available for all the teams you know in studios to uh make games on PS3 to extract the you know performance necessary to make uh games on PS3 and eventually because uh uh third party companies Publishers uh also struggled uh we made you know these programs Avail made available uh through our development uh portal uh to third party companies as well so uh so Underworld Studio's Phil Harrison and I worked you know to make it so that the you know teams let's you know collaborate let's share the you know ideas and uh you know knowhow and even Technologies tools together uh to to learn from each other so that's how you know I started the twice a year Gathering of developers during GDC and the three time and Kutaragi succeeded Ken as the head of PlayStation and he wanted while Studio teams to join the hardware development so you know after Ken left uh there are two new projects PS Vita and PS4 so you know I helped you know had team to get Maru",
            "start": 583.24
        },
        {
            "text": "and he wanted while Studio teams to join the hardware development so you know after Ken left uh there are two new projects PS Vita and PS4 so you know I helped you know had team to get Maru (corrected from \"marani\") to on board to become the uh Chief Architect of these Hardware uh PSV and PS4 and uh you know uh I moved to Japan you know K asked me to move from us to Japan um because uh he wanted me to work closely with the hardware team so while managing studio uh part of time I spend uh participating in Hardware uh meetings like PSV or PS4 meetings and uh every time the hardware team had a question like uh there are lots of uh choices they can make you know what kind of device or technology they should uh choose to include in the future platform Hardware um um they want to make the hardware uh best for the games so they really appreciate I appreciated me to connect the hardware team with the studios like Santa Monica Studios na you know game media Mo (corrected from \"g games media Mo\") Whoever has a good idea uh on that particular technical",
            "start": 649.72
        },
        {
            "text": "\"So they really appreciate, I appreciated me to connect the hardware team with the studios like Santa Monica Studios, na you know G Games Media Mo. Whoever has a good idea uh on that particular technical topic, that harder team had in question so harder teams are created the prototype and provided to W Studio teams and Studio team created prototype games based on the pro-prototype hardware and sent back to the hardware team and we gather together and discussed and we I invited the hard team to join the you know Studio Gathering meeting during GDC and the3 so that they can have one you know one one you know face-to-face meeting to discuss these you know uh Hardware specification discussions and one great example uh fruit of that is uh for PS4, you remember D 4 had the share button right yeah I've heard of it once or last yeah so the PS4 was the very first hardware game hardware to that anyone can become a streamer right that idea came from Santa Monica Studios team they created this put\"",
            "start": 720.2
        },
        {
            "text": "I've heard of it once or last year, so the PS4 was the very first hardware to have a feature that anyone can become a streamer right? That idea came from Santa Monica Studio's team; they created this presentation with Gary, uh, who you know, uh, created Annapurna Interactive later and Annapurna Interactive last year. Yeah, so he put together a slide saying that now that YouTube and Twitch are becoming popular, how about adding a dedicated button on the controller so that anyone can just press the button and start streaming games from PS4? So that the team loved the idea, and that became the Share Button. This episode's brought to you by Built. If you're a renter, I'd start taking advantage of Built if I were you. Here's the thing: we earn points on groceries, travel, and practically everything else we buy, but we should also be earning points on rent. One of our biggest monthly expenses. Built changed the game by letting renters earn high-value points on rents and around their neighborhood there's",
            "start": 785.12
        },
        {
            "text": "we buy but we should also be earning points on rent one of our biggest monthly expenses billt changed the game by letting renters earn high value points on rents and around their neighborhood there's no cost to join built and as a member you'll earn valuable points on rent and your everyday spending built points can be transferred to your favorite hotels and Airlines and even the ones you haven't heard of there are over 500 Airlines and 700,000 hotels and properties around the world you can redeem your built points toward points can also be redeemed towards a future rent payment and unique experiences that only build members can access so if you're not earning points on rent my question is why not start earning points on rent you're already paying by going to joinbilt.com kindafunny that's JoiNBlt.com kindafunny make sure to use our URL so they know that we sent you there joinbilt.com kindafunny to start earning points on your rent payments today this episode's brought to",
            "start": 842.24
        },
        {
            "text": "\"Join our website at kindofunny.com, make sure to use our URL so they know that we sent you there. Join built.com/kindafunny to start earning points on your rent payments today. This episode's brought to you by BetterHelp. What do you want your 2025 story to be? Every January brings you 365 blank pages waiting to be filled in. In 2025, maybe you're ready for a plot twist or maybe there's part of your story you've been wanting to revise. Life isn't about resolutions that fade by February; it's about picking up the pen and becoming the author of your own life. Think of therapy as your editorial partner helping you write new chapters and create the meaningful story you deserve to live. Some of my best friends use BetterHelp, and they love how helpful it can be for learning positive coping skills and how to set boundaries. It empowers you to be the best version of yourself. It isn't just for those who've experienced major trauma; if you're thinking of starting therapy, give BetterHelp a try – it's entirely online.\"",
            "start": 888.8
        },
        {
            "text": "bounds it empowers you to be the best version of yourself. It isn't just for those who've experienced major trauma. If you're thinking of starting therapy, give BetterHelp a try. It's entirely online, designed to be convenient, flexible, and suited to your schedule, and it serves over 5 million people worldwide. Write Your Story with BetterHelp. Visit betterhelp.com/kindafunny to get 10% off your first month. That's BetterHelp dot com slash kindof funny. BetterHelp dot com slash kindof funny. And it was a brilliant idea, right? I think it was one of those things that was ahead of its time and now it's quaint because it's so easy to stream everything everywhere and everybody's doing it. But I remember like you think of uh what would go on to become Kinda Funny but me streaming on my personal YouTube. GameOverGreggy, and it was that idea of the hoops I had to jump through to make it work. But this was TurnKey - everybody could suddenly do it in try it and see if you liked it right like you could go live and",
            "start": 934.56
        },
        {
            "text": "Greggy and it was that idea of the hoops I had to jump through to make it work, but this was TurnKey - everybody could suddenly do it in try it and see if you liked it, right? Like you could go live and get the two viewers you might get, but you'd know if it works and you'd be able to see if you enjoy doing it. It was a brilliant maneuver, and I think that comes from the collaboration you're talking about, and I'm glad it works so well for PlayStation 4. But I need to ask, why didn't it work for Vita, Shu? Where did we go wrong with PlayStation Vita? You and I love the Vita, you know we love it. What happened? Oh yeah, well, yeah, there are you know multiple reasons right? Why be that didn't work? Um, well, you know it worked in a way that people loved playing games, especially you know indie games on PSV, there right? Yeah, yeah, yeah, so it was lovely hardware. You know I loved it, people loved it, we loved it, you know almost too much right? Yeah, of course to the show when PlayStation wanted to stop talking about",
            "start": 980.28
        },
        {
            "text": "Right, yeah, yeah, yeah, so it was lovely Hardware, you know I loved it, people loved it, they loved it, you know almost too much. Right, yeah, of course to the show when PlayStation wanted to stop talking about Vita, and you would not let them stop talking about VA, yeah, absolutely. I remember you and calling always doing trying to help V like a Vita Island right? You even tried to recycle people who stopped playing pV, you know, send us so that I can provide the Vita relocation program. Never forget, yeah. We tried to we tried to debut that during our PSX panel, we did a Beyond panel for PSX every year and we tried to debut that video maybe it was PS I Love You even at this point it might have been PS I Love You, it doesn't matter. We tried to debut the video at the relocation thing at PSX and PlayStation PR called me the night before and they're like \"we're not going to\" we're not going to no we're not showing this video where you're talking about the platform being dead and then people should send it",
            "start": 1027.52
        },
        {
            "text": "PR called me the night before and they're like, \"We're not going to show this video where you're talking about the platform being dead, and then people should send it into you to give it away.\" I digress. Where did we go wrong? Was it the back touch? The touchscreen? On a positive side, you know when PS Vita started, you know Mark Cerny got brought on, and our team started joining. And the original idea for the so-called core processor, yeah, was a different one, and that was going to be a failure from our team's standpoint. And Mark was able to convince the team to change the main processor, so that was a very first contribution. And you know we did a lot of conversations, discussions, making prototypes, and several technical choices as a company made, which didn't really work out well. One of which was the like a dedicated uh memory card, right? Yeah, proprietary to purchase.",
            "start": 1080.08
        },
        {
            "text": "Uh, choices, uh, we as a company made uh didn't really was good one, the you know uh one one of which was the like a um um um dedicated uh uh memory card right yeah proprietary to purchase yeah proprietary memory card uh that was a mistake you know people had to spend more money to get the uh uh memory card yeah and the um you know back touch was not necessary right it was uh you know sometimes the teams made amazing prototype that feels so good and that misled uh everyone uh involved uh that oh this would be great uh but the back touch was not uh it it added additional cost to the hardware um I think all it was okay it was such a beautiful screen it was such an amazing one, but but the cost was higher yeah uh so I'm talking about the cost and the one feature um the hardware team had it you know in the development uh Hardware like a dev kit for beta you know the same kind of unit but it had a video out so that you know developer can connect to screen like a you know Monitor and develop\n\nI corrected phonetic mistakes, spelling errors, and capitalized proper nouns. I also left filler text and incomplete sentences intact as per the instructions.",
            "start": 1129.76
        },
        {
            "text": "know in the development of hardware like a dev kit for beta, you know, the same kind of unit but it had a video out so that developers could connect to a screen, like a monitor, and develop games on. And somehow, other teams decided to take that feature out from the consumer version. I mean, who would want a handheld that you could also play on the TV? It just doesn't make sense; it's a really bad idea. Right? So, the team removed that feature just to save a few cents of cost from the hardware. But I think the biggest reason in my mind, not a popular kind of thought, but I think the biggest reason the Vita didn't do as well as we had hoped was that we had to split all our efforts and resources into two different platforms. Sony didn't have the resources, we didn't have that um resource pool so on PS3 and PS Vita or PS4 and PS Vita, you know, the studio had to decide which team to work on which, and we didn't have that big talent pool to be able to support",
            "start": 1210.16
        },
        {
            "text": "Uh, resource-wise, so in know PlayStation 3 and PlayStation Vita or PlayStation 4 and PlayStation Vita, you know Studio had to decide which team to work on which, and uh, we didn't have that big uh uh talent pool to be able to uh support two different platforms, and of course, you know, console is the biggest platform we have to support. PS3 and launch of PS4 really, we had to stop many projects from Vita because we didn't have a team to make PS4 games, so otherwise, so I I I think that's the biggest reason, and and I think you know it's this is another personal thinking uh one of the reasons for the big success of Nintendo Switch is they uh stopped you know making working on two different platforms. They always had you know console and handheld right, and uh, and it's like opposite of us. Nintendo did very well on handheld but not so well on the console uh so it was different from our side, but Nintendo Switch, all first-party just worked worked on just one hardware right, so that I think really helped oh 100% Nintendo Switch yeah I think so I I",
            "start": 1272.84
        },
        {
            "text": "the console uh so it was different from our side but Nintendo Switch all first party just worked worked on just one hard right so that I think really helped oh 100% Nintendo Switch yeah I think so I I think that's a biggest reason was there well and when you see the Switch and you understand what they're doing with this is obviously a debut I'm talking about had there ever been even an inkling of a conversation on PlayStation side of like what if we did that or was it I mean was it just oh well we make the Vita we make the console we make a handheld we make a console like you're was there ever even a conversation in a you know brainstorm of like what if we just did one um when I saw Nintendo Switch uh I thought oh this is a PSVita and it is and I the that's V of how great to play indie games on right yeah yeah it's an amazing system for indie games um but um in terms of if a company thought about making system like that I I don't think so because PlayStation we Legacy was to provide",
            "start": 1339.24
        },
        {
            "text": "on right yeah yeah it's an amazing system for indie games um but um in terms of if a company thought about making a system like that I I don't think so because PlayStation Legacy was to provide The Cutting Edge uh great Hardware performance and hardware at a very affordable you know price and make the never seen before amazing uh you know especially Graphics games uh on Console so that is the you know Legacy so moving from PS3 generation to PS4 generation uh actually the PS4 uh was designed alongside the PS Vita so yeah so PS4 is already in the making uh so after PS4 again you know the PS4 was so successful it's just uh uh natural to create a new hardware that's Backward Compatible sure with PS4 right that's the extension or in expansion of PS4 so that was PS5 so then before we move out of our handheld dreams here we talk of all this stuff talk to me about then and you're at this point obviously over in the Indie role but you're still at PlayStation were they shocked to find out we all",
            "start": 1395.2
        },
        {
            "text": "our handheld dreams here we talk of all this stuff talk to me about then and you're at this point obviously over in the indie role but you're still at PlayStation were they shocked to find out we all wanted a PlayStation Portal like when that drops I know there's been you know it outsold it did more than what people thought it was going to do were you like see this is what I'm talking about people want to hold their games um maybe maybe Nan would say that when I learned about the PS Portal I I was like who wants this hardware you know just doing remote play right yeah so so I remember saying to the other team the only way the PS Port will be successful will be if we sell this at $199 that's the only only way and they did it you not because I said that but probably they have the same kind of thinking uh at lunch you know the uh we you know how they didn't have that streaming capability even though it was like a technically possible but they are not able to have it uh ready for",
            "start": 1468.8
        },
        {
            "text": "of thinking uh at the lunch you know the uh we you know how they didn't have that streaming capability even though it was like a technically possible but they weren't able to have it uh ready for the launch so the only function that PS4 had was to play your games on your you know PS5 right yeah yeah so uh so it's just a peripheral so um we didn't I didn't think uh people would spend more than you know uh $200 for a device like that but you know luckily the company uh put that price and the people found out how nice it is to you know uh play games it's a huge 8-inch screen it's kind of light right because it doesn't have you know big CPU or anything and uh it has the real DualSense features in it so yeah yeah yeah so so we are all surprised how well it was received and uh how it's sold so now that you're out you have all this industry knowledge obviously this industry history you understand it now that you're out do you think we ever see PlayStation enter again the handheld market",
            "start": 1520.68
        },
        {
            "text": "so now that you're out you have all this industry knowledge obviously this industry history you understand it now that you're out do you think we ever see PlayStation enter again the handheld market like in terms of like the successive portal the learnings of Vita seeing Steam Deck seeing Switch hearing about Xbox in their uh rumored handheld yeah yeah so personally you know for the last three or four years the the uh Hardware Gadget category I've been mostly excited with I might have uh talked to you about this is the portable gaming PC category that's you know so I purchased like an MPD a GPD is a great company from China they make amazing portable gaming PC hardware GPD Win Max uh Wing Max to GPD Win 2 yeah the Crum shell version of GPD Win 2 is so good and also IO is another company who create uh beautiful hardware and the latest uh that I enjoy using is the iO Pocket S it's not a PC but it's a uh Android device with two yeah yeah yeah that's that's that's the GPD Win 2 you know if",
            "start": 1589.2
        },
        {
            "text": "who created beautiful hardware and the latest that I enjoy using, the Ion Pocket S - it's not PC, but it's a Android device with two analog sticks. Yeah, yeah, yeah, that's the GPD Win 2, you know. If you're an audio listener, this is a laptop there, a laptop that has dual sticks on top of a dad, yeah. And then the Ion Pocket S is an Android device with two analog sticks and all the gaming buttons, and it plays games beautifully. These recent mobile games, uh, some games are real action games, right? Yeah, and yeah. So this Android device you know plays games so well, so that's the category I buy one or two new hardware every year these days. So of course I'm so excited if a PlayStation in the future makes something like this. However, um personally, you know because I said company you know even now PlayStation is much bigger than you know PS3 days but I don't think it's it's a good idea to try to manage two different platforms like PS",
            "start": 1657.12
        }
    ]
}