{
    "id": 13415,
    "video_id": "EaL6W7H8r5k",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Greg Miller",
        "Barrett Courtney",
        "Blessing Adeoye Jr."
    ],
    "title": "We Played Assassin's Creed Shadows - Kinda Funny Games Daily 01.23.25",
    "description": "Go to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\n\nGo to http://rocketmoney.com/kindafunny to cancel your unwanted subscriptions with Rocket Money.\n\nWe’ve played Assassin’s Creed Shadows, Celeste dev’s next game has been cancelled, and Dragon Age: The Veilguard didn’t meet sales expectations.\n\n00:00:00 - Start\n00:08:35 - Housekeeping\nToday after, KFGD, you’ll get:\nOur Reaction to the Xbox Developer_Direct\nGAMESCAST - our post show breakdown\nThe STREAM is Kingdom Hearts 2 w/ Mike\nIf you’re a Kinda Funny Member:\nYou can get today’s Gregway\nAnd you can get Alien In Review this afternoon, and tomorrow on YouTube and Podcast services.\nThank you to our Patreon Producers: Delaney Twining & Karl Jacobs\nThe Roper Report   -\n00:09:55 - Assassin’s Creed Shadows Preview\n00:31:41 - Ad  \n00:33:50 - Earthblade has been cancelled - Blog Post from Extremely OK Games\n00:41:47 - Dragon Age: The Veilguard Had 1.5 Million Players in First Two Months, EA Expected 3 Million - Rebekah Valentine @ IGN\n00:44:30 - Palworld Developer Pocketpair Moves Into Publishing to Release Tales of Kenzera Dev's Next Game- Ryan Dinsdale @ IGN\n00:45:44 - Final Fantasy 7 Remake Part 3 won’t be a PS6 exclusive, producer promises - Chris Scullion @ VGC\n00:46:20 - Wee News!\n\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1737655284,
    "duration": 3153,
    "transcript_chunks": [
        {
            "text": "Well, that's not right today in the Nerdy News you need to know about we've played Assassin's Creed Shadows. The Celeste dev's next game has been cancelled and Dragon Age: The Veilguard didn't meet sales expectations. We'll have all this in more because this is Kinda Funny Games Daily. What's up everybody? Welcome to Kinda Funny Games Daily for Thursday, January 23rd, 2025. I'm one of your hosts Greg Miller alongside Forbes 30 Under 30 aka the Okay Beast AKA Magic: The Gathering pop culture enthusiast Blessing Adeoye Jr. My favorite thing is that I'm pretty sure Kevin was trying to catch you off guard with the cold open. Yeah, cuz he he hit the 3-2 like out of like oh man like I'm I'm trying to help you with your hair I was like does my hair look fine you're like yeah you got one thing he's like three two Let's do let's go so I think he was trying to prove a point, but then he got himself forgot to press the there no no it's like all automated and for some reason the",
            "start": 2.46
        },
        {
            "text": "three two Let's do let's go so I think he was trying to prove a point, but then he got himself forgot to press the button. There, no, it's like all automated and for some reason the system connects to the thing that controls the camera didn't want to work so I had to manually go and hit the button. It's working now, see, see. Yeah, uh, how are we doing, Blessing? Uh, I'm doing well, I'm excited for the Xbox Developer_Direct. I don't have any I guess predictions because I know we already know the bulk of stuff they're going to talk about but there is that question mark on there that people are saying could be some kind of like GPG franchise, okay, like a legendary GPG franchise, yeah, they said something there right, yeah, yeah. And like who could what could that be? Who knows, but I'm excited to see what... Okay, are you excited? How are you feeling? Yeah, of course, it's Xbox Direct. I was thinking about this in the car riding for so long when I started you had to wait for, of course, E3.",
            "start": 69.56
        },
        {
            "text": "We're excited about the Xbox Direct, I was thinking about this in the car riding for so long when I started you had to wait for E3, that was when you got the Christmas presents, that's when there was the big thing, that's when everybody revealed their new stuff blah blah, so it was this huge buildup to E3 and now we're so lucky even though we want to poo poo it all the time be angry about it that there are so many mini Christmases you know what I mean where it is like cool for some reason today Xbox wants to talk about three or four games and then also the secret game we don't oh yeah let's go that'll be fun this will be cool I'm super excited about that so it's good to get in here have that vibe have that energy to it there's always a different energy of course we're doing the show an hour early so we can react at right at 10 o'clock to the Xbox Direct so yeah there's a whole bunch of fun stuff happening on that regard",
            "start": 115.56
        },
        {
            "text": "always a different energy of course we're doing the show an hour early so we can react at right at 10 o'clock to the Xbox Developer Direct so yeah there's a whole bunch of fun stuff happening on that regard in that regard right as right here doing it so yeah I'm stoked about it I'm excited about it like I'm not excited about it like Hey we're going to have this amazing thing you know that you've never seen you never heard no it's not going to be that obviously it's going to be like all right cool we're going to hear about some cool games and it's going to be fun so it's like all right I'm not worried about that I think because of hype culture right because of like us being about the headlines being about the game announcements I think often times we underrate just developers talking about their video games and how enjoyable it can be to like hear people talk about the ins and outs of what makes their game work or what or like what they're excited to reveal what like features that they have in",
            "start": 154.92
        },
        {
            "text": "games and how enjoyable it can be to listen to people talk about the ins and outs of what makes their game work or what they're excited to reveal, such as features that they think will push it to the next level. I really like the Annapurna showcases for that - the ones we've gotten so far are still around, but they got a new team in there after the old team left and went to Private Division, who then laid off a bunch of people. It's weird. Got closed out, um, but I really like those showcases for when we fly over to Portland and talk to these developers and have them talk about their passions - oh man, I'm sure that's",
            "start": 189.72
        },
        {
            "text": "going to talk to these developers and like have them talk we might not even have a game we're just going to watch like hear them talk about what their passions are oh man I like Pi I'm sure that's going to like feed into this game that I'm making and I'm like you know what cool I'm I'm I like hearing you talk about like your creative process and all that **** so I think that's going to be a lot of what this is we're going to get some reviews reveals here and there but I think it is more about hearing about what developers have to say about their game which I'm down for do you think you get a south of midnight release date today um I'm saying take it to the bank you do oh you think so I do Paris was so adamant after going and playing it or I'm sorry I think he did a hands off of watching it in Montreal that he was like the game looks done it looks done blah blah the fact they're doing it another one another thing today of a double dip on it of like here's more from Compulsion Games",
            "start": 233.04
        },
        {
            "text": "We played Assassin's Creed Shadows, it in Montreal that he was like the game looks done, it looks done blah blah the fact they're doing it another one, another thing today of a double dip on it, of like here's more from Compulsion Games, the fact that uh uh they were so adamant on social media about this going to be big, we're excited I think that today you get a date for it and I say it's in the next three months oh that'd be awesome and I could see it I think as Xbox you got to have something in the first half of the year right like sure well I mean okay first off that's insulting to AOW, oh AOW is right around the corner I'm very excited I refresh my inbox all the time Q fair enough for I'll that and so like I think yeah if we're talking about V in February a South midnight could fit well in like maybe April maybe May right around that period uh because we also know that you got Doom: The Dark Ages, you have Outer Worlds 2 which is slated but we'll see if we is that really slated for 2025 or they just say 202",
            "start": 268.64
        },
        {
            "text": "May right around that period uh because we also know that you got Doom: The Dark Ages, you have Outer Worlds 2 which is slated but we'll see if we is that really slated for 2025 or they just say 2023 but if the stars align it does come out in 2025 it'll be very lit. 2025 right so I think you need things to hit in that like middle period of the year, so South Park: The Midnight Revolution I think would fit that very well yeah 100% yeah I think it'll get in there nicely and again this gets back to what Matt Booty had said wanting you know a tent pole or an Xbox exclusive, whatever month or every three months I can never remember chat don't even you're wrong me just say tell me what Booty said over there so yeah I'm excited for today again not like it is an E3 like in terms of like I'm going to expect the next unannounced FromSoftware game or whatever but I'm excited to see what and I'm putting you on the spot and I can look this up as I go what are the games that we know/ developers that we know are",
            "start": 308.24
        },
        {
            "text": "kojima game or whatever but I'm excited to see what what are the and I'm putting you on the spot and I can look this up as I go what are the games that we know/ developers that we know are going to be there uh South midnight for sure M uh is it Doom are they doing Doom too as well no is it no yes no I hope so that'd be down to see some um some Doom let's see here it is Doom okay oh I'm on an article that's already trying to this is Ian Harris from four minutes ago uh sandfall which I've never heard of I don't know oh that's a developer that's why I don't haven't heard of the game who's the other one oh Expedition 33 oh yeah people are very excited for so that we know Expedition 33 we know Doom we know uh compulsion and then we have the question mark I'm excited about that yeah yeah Expedition 33 especially where I think that one's got a lot to prove right we know it's got a good cast we've heard a little bit about it but it's like I don't I don't feel like as the guy who just couldn't",
            "start": 347.84
        },
        {
            "text": "33 especially where I think that one's got a lot to prove right we know it's got a good cast we've heard a little bit about it but it's like I don't I don't feel like as the guy who just couldn't remember that it's part of this thing nor can I remember other than it's an Assassin's Creed game what it's about like today's got to be a good day to be like all right here's what it is and why it matters and let's go it's one that I'm very excited for but I also have like you know I I'm nervous about in some regards of like the kind of game it wants to be and like we'll talk about it when we get there but I'm it looks very interesting but almost too interesting in a way where sometimes too interesting the dreaded too interesting yeah sometimes you see games where it's like oh this seems fresh and like different but also kind of inspired it is it is just a game it's trying to be an Assassin's Creed game SL persona but it has like Western development and like I think there's a lot of promise there but I'm also like",
            "start": 391.4
        },
        {
            "text": "We played Assassin's Creed Shadows, it is different but also kind of inspired. It is just a game, it's trying to be a GPG (Games as a Service) persona, but it has like Western development and like I think there's a lot of promise there, but I'm also like I've seen this before where games you know get really creative and then you get too creative and like oh man this doesn't fit together, this doesn't work the way I wanted it to work. But we'll get there when we get there, we will get there when we get there, and we have a lot of getting there to get there too, of course. We only have 1550 minutes with you before we start our pre-show for the Xbox direct. So let me remind you that this is Kinda Funny Games Daily, each and every weekday on a variety of platforms, we run you through the nerdy video game news you need to know about live on YouTube.com/KindaFunnyGames, Twitch.tv/KindaFunnyGames, and podcast services around the globe. If you like that, we'd like you to pick up the Kinda Funny membership, of course. The Kinda Funny membership costs.",
            "start": 425.24
        },
        {
            "text": "kinda funny games twitch.tv/ kindof funny games and podcast services around the globe if you like that we'd like you to pick up the kind of funny membership of course the kind of funny membership costs you $10 you support a small 11 person business you get all of our shows ad free you get the ability to watch our afternoon podcast live as we record them you like in today's alien in review you get your daily dose of me Gregway which I didn't do in the car today because I was on a zoom call listening to about announcements about an unannounced game that we'll tell you about eventually uh I will get to you though after Xbox of course if that wasn't enough for you you can support us with YouTube super chats you can write in on youtube.com/ kindof funny games when we're live telling us your thoughts your opinions and everything else Under The Day news so you can be part of the show just like Conor Smith who says first time Super Chat for my favorite pod youube heart thank you very much we",
            "start": 464.44
        },
        {
            "text": "your opinions and everything else under the day news so you can be part of the show just like Conor McGregor who says first time super chat for my favorite podcast youtube heart thank you very much we appreciate that of course uh there's some housekeeping to get through today after kinda funny games daily like I said you're getting our reaction to the Xbox developer direct after the Xbox developer direct we are doing a Gamescast that will be the post show of the direct breaking it all down and eating pizza mark from Square Pie Guys is here to make pizzas in our parking lot once again because uh Square Pie Guys has brought back the buffalo chicken pizza at their SF locations and of course if you buy the SF pizza from Square Pie Guys they make a contribution to our extra life campaign for like five years in a row cuz they're amazing here thought when Kevin does the smoke it looks like both of us are passing gas at the same time and all coming out SM no I'm not a child I'm not a child",
            "start": 504.0
        },
        {
            "text": "like five years in a row cuz they're amazing here thought when Kevin does the stream it looks like both of us are passing gas at the same time and all coming out SM no I'm not a child I'm not a child that visual is disgusting and then after that Mike is returning to Kingdom Hearts too if you're a Kinda Funny member you'll get today's Gregway from me later and you can watch us do Alien In Review this afternoon of course it'll be up tomorrow on YouTube and podcast services thank you to our Patreon producers Delaney Twining and Karl Jacobs today we're brought to you by Shady Rays and Rocket Money but we'll tell you about that later for now let's begin the show with what is and forever will be The Roper Report time for some news we got seven items on The Roper Report number one ladies gentlemen angle doesn't work from that angle uh we have played Assassin's Creed Shadows when I say we I mean myself Greg Miller number one Assassin's Creed Odyssey fan and the boss baby himself Barrett Courtney",
            "start": 545.88
        },
        {
            "text": "We played Assassin's Creed Shadows when I say we, I mean myself Greg Miller, number one Assassin's Creed Odyssey fan, and the boss baby himself Barrett Courtney, the holder of Assassin's Creed in review and ranked. Yes, hi, how are you? I'm doing well, Greg, how are you? Good, thanks for joining us, thanks for coming out, thanks for having me. I'm excited to be here on real content; it's weird to like stand here, I feel powerful, yeah, yeah, I like it, push Blessing around. Oh, don't, don't got too much power, uh, Barrett. We played hours upon hours of Assassin's Creed last week, yes, we did, uh, we got to do a uh remote demo of about 4 hours of Assassin's Creed Shadows and it really hit me during that time of like damn it has been 5 years since Valhalla, granted it's been a couple years since Mirage right, but like it's been 5 years since we've gotten like this huge open world Assassin's Creed type game and honestly at the end of it all we're going to talk about it uh maybe.",
            "start": 594.36
        },
        {
            "text": "years since Mirage right uh but like it's been 5 years since we've gotten like this huge open world Assassin's Creed type game and honestly at the end of it all we're going to talk about it uh maybe some of our ups and downs here but at the end I was like I'm ready to get back into this this world this universe uh you know do a kind of simple yet satisfying Ubisoft open world uh checklist kind of thing uh so yeah I I I had a really fun time with it it is interesting thinking about Assassin's Creed: Shadows today right um and that's more so within the context of where Ubisoft is as a company right now yes they need a hit they need a lot of things to go right they need a big hit it feels like they're playing uh you know they're they're putting all their chips in on this one being a massive success they I feel like they're hoping that they're bringing in new people like Blessing Adeoye Jr. like Andy Cortez I can't wait to think I can't wait to hear if you think it'll actually do it but yes",
            "start": 643.28
        },
        {
            "text": "We Played Assassin's Creed Shadows - Kinda Funny Games Daily 01.23.25, Greg Miller said success they I feel like they're hoping that they're bringing in new people like Blessing Adeoye Jr like Andy Cortez I can't wait to think I can't wait to hear if you think it'll actually do it but yes and my thing is like playing through it it was like yeah this is another Assassin's Creed game I think the setting is something that's been long overdue feudal Japan has been something the fans have been asking for a long time uh and that we're finally getting it which is very exciting but I think along with that in a post Ghost of Tsushima world people are expecting I think this like big kind of either Revolution or shakeup of what Assassin's Creed is and while there's definitely iterations in some of the gameplay I don't think it's this big changing of what Assassin's Creed is so I don't think it's going to grab people like a Blessing Adeoye Jr like an Andy Cortez I am winning that bet 100% that like y'all are going to play this for like 2 hours and be like yeah this is pretty cool",
            "start": 693.92
        },
        {
            "text": "think it's going to grab people like a Blessing Adeoye Jr. like an Andy Cortez I am winning that bet 100% that like y'all are going to play this for like 2 hours and be like yeah this is pick up and play more of that um but for myself someone who's a fan of Assassin's Creed right um I I'm really into it and uh and I think even though it definitely feels like too small little things uh that are being changed for this game um I'm excited I'm I'm going to have a fun time will I remember it by the end of the year who knows but uh at least at first glance uh I had a good time Blessing Greg I want you to have some say here okay so you get to call it do you want me to start positively or negatively I want you to start positively positively I thought the prologue we played no spoilers since it's narrative based right was so engaging and so well done where I was like you know the reason I think I love Odyssey so much is Cassandra is knowing her is seeing her journey unfold and where",
            "start": 741.92
        },
        {
            "text": "It's narrative based right was so engaging and so well done, where I was like you know the reason I think I love Odyssey so much is Cassandra is knowing her, is seeing her journey unfold and where it went and the way they told old her tale uh to see Yas and Na right and how we start the game and see who they are, how we meet them, how we see them evolve. I was like this is dope and it feels like one of the notes I put down, right, it feels like a samurai film which I think is one of those things obviously there's going to be no end to the comparisons but something Ghost of Tsushima got so right, I don't think they do it that well where visually and everything else it feels and looks like but this was like ooh you've got the backbone here of a really good Samurai film that like that I think is going to really Kickstart this game for me and let me build these characters. The opening was very strong, uh getting to kind of understand the context of where Yasuke and Na start in their Journeys I was",
            "start": 795.36
        },
        {
            "text": "to really Kickstart this game for me and let me build these characters the opening was very strong uh getting to kind of understand the context of where Yasuke and Na start in their Journeys I was really hooked uh by and some of the kind of themes that again I don't want to spoil but just Y's introduction uh especially I thought was very fascinating I'm excited to see how they come together how they team up because we got to play the prologue and then we skipped ahead x amount of hour I want to yeah I want to when I'm still in my very much my my my hard eyes of the prologue right I'm making all these notes even though I don't want to say anything because I don't but like all caps oh **** now he's here like you know what I mean when we switched over to her oh **** this is cool that was a cool way to do it right they did something really nice here the them playing around with the double protagonist thing I I think is really fun uh this is something that they've done before with like",
            "start": 838.48
        },
        {
            "text": "a cool way to do it right they did something really nice here the them playing around with the double protagonist thing I I think is really fun uh this is something that they've done before with like Assassin's Creed Syndicate uh granted like the Odyssey and Valhalla you got to pick one or the other but it wasn't really like a dual antagonist type of thing um but yeah I'm excited to see like how they play off of each other how they uh you know become homies and uh what their adventure like kind of goes from here and whether there's friction or not because they definitely are coming from uh different walks of life and so I'm I'm excited to see that um and yeah I do have a question but I also cuz I I don't know if this is going to like man they look at that all germ you know there's a norovirus no Novo virus no no virus sounds like some animation we know some people who got it gotta wash my hands um I haven't touched them I haven't",
            "start": 881.96
        },
        {
            "text": "butt going around in San Francisco right now no COVID virus no Novo virus no no virus sounds like some animation we know some people who got it gotta wash my hands um I haven't touched them I haven't touched those people okay good um and maybe this will feed into your negatives or whatever but like this I think comes back to what Barrett's talking about because I'm with you Barrett as far as I've tried multiple Assassin's Creed games and I just can't get into it I fall asleep early on and I'm like this ain't for me I don't like the the Ubisoft structure doesn't work as well on me unless there is like some magic thrown on top of it and I want to bring in Ghost of Tsushima right which is the obvious comparison but then also Rise of the Ronin which is a game that I thought I was going to fall in love with given the developer given the type of game that it was right like let me crack my knuckles in three games I got lost to say but like I you know you guys know I **** love Ghost of Tsushima it was one of",
            "start": 930.28
        },
        {
            "text": "the developer given the type of game that it was right like let me crack my knuckles in three games I got lost to say but like I you know you guys know I **** love Ghost of Tsushima it was one of my favorite games that year like absolutely fell in love with it Rise of the Ronin thought I was going to really like and then ended up being like oh man I do not care about this world I do not like this is doing it for me my question is oh let me jump in on where on this I guess this is a two-part question one and this is one for Barrett and one for Greg the one for Barrett is for as much as you know I love Ghost of Tsushima and for as much of Ghost of Tsushima is that open-world game why do you think Assassin's Creed Shadows isn't going to hit on that level but I guess hit for me and then to Greg we're on the spectrum of Rise of the Ronin to Ghost of Tsushima would you place an Assassin's Creed Shadows I think it's not going to hit with you because I think on that Spectrum it's more towards Rise",
            "start": 969.52
        },
        {
            "text": "me and then to Greg we're on the spectrum of Rise of the Ronin to Ghost of Tsushima would you place an Assassin's Creed? I think it's not going to hit with you because I think on that Spectrum it's more towards Rise of the Ronin. I think that's and this is where it's hard because of course we played four hours, yeah but it was the prologue where I was like oh this is really interesting and then this footage you see is where we got thrown ahead to level 25 so we're deep into the game at this point we're just doing stuff we're talking to people that I don't know any of them and so suddenly it like it was the wool ripped away and it's like oh this is Assassin's Creed, like I found it. This is my negative part of the preview right where find it very hard to go from what we played and tell you anything other than it's Assassin's Creed, it was going and doing this thing and it was doing this thing and it's like you know when you're playing as uh Yas there sure are a lot of doors they want you to run through",
            "start": 1009.52
        },
        {
            "text": "It's Assassin's Creed, it was going and doing this thing and it was doing this thing and it's like you know when you're playing as uh Ezio there sure are a lot of doors they want you to run through they they gave this guy the ability to run through doors so you see the door like you want me to run through that door I get it's like that kind of thing where it's like you see the machinations right of what they've built here machinations of what they've built here right and I think that was Rise of the Ronin's problem for you where it was like none of this matters I'm just flying around, killing guys doing that thing I think with that prologue if they keep that narrative by the time we get to level 25 we should knock on wood care a lot about these characters care about the investments like I think it was a weird mission to give us cuz the mission is like oh you got to this kid's been kidnapped blah blah and you get to the end and find out like there's like a double cross but it's like I",
            "start": 1053.72
        },
        {
            "text": "I think it was a weird mission to give us cuz the mission is like oh you got to this kid, been kidnapped blah blah and you get to the end and find out like there's like a double cross but it's like I don't **** know this guy like clearly you guys have done missions for him before like it should matter to you that I don't know and just in the writing when the kid is kidnapped I immediately called out who it was I was like okay this is this is where it's going so that's the thing where it's like with not having any of that goodwill built up you get here you're like yep it's Assassin's Creed you want me to go do this and go that and go there okay cool and like I forgot about the **** cool thing she had to like spin final fck Miss I was like I switched I'm like God damn it right I could have been doing this whole time so it's going to be fun but it's going to be fun if you want to do the mechanics and you want to crawl through this thing and you want to go get that chest and you want",
            "start": 1090.56
        },
        {
            "text": "We've been doing this whole time so it's going to be fun but it's going to be fun if you want to do the mechanics and you want to crawl through this thing and you want to go get that chest and you want to go check off that thing. And I also wonder how much they're going to balance what these character stories are truly are versus like how Assassin's Creed lore-heavy it gets. And I, I wonder once you start to get into that stuff of the Assassins and possibly the Templars, they have different names, I don't know what they're called in this era. Uh, I, I do see your eyes start to glaze over and stop like starting to lose the motivation to like really continue on in can I do a quick timeout Kevin if you could roll it back like 4 seconds as she comes up on that ladder just like as she walks up to the ladder. This was one of those parts where I was like, it's it's a a video game, it's Assassin's Creed, where you come out of this thing you'll see in a second like you have to go up",
            "start": 1122.68
        },
        {
            "text": "She walks up to the ladder. This was one of those parts where I was like, \"It's a video game, it's Assassin's Creed.\" Where you come out of this thing, you'll see in a second, like you have to go up this tower here and there's this ladder, and I think from two sections below they knew I was in the thing so I wasn't in stealth anymore. So there was just a guy standing at the top of the ladder which me when I would climb up the ladder he would knock me back down but not in a cool way very much like \"Oh, I've kind of glitched the game.\" So like the demo, like you know we're doing this via remote right so somebody's watching us the entire time and the guy, Chmiel, he's like, \"Yeah, I would use the kunai here or whatever.\" Like it took me a while to... I'm like, \"Okay, gra,\" and then I get up here and there's all these... I just ran past everybody and then killed them all. This thing I'm like, \"Yeah, this doesn't feel great. This doesn't feel like the narrative go uh yeah I I'm I'm still into it though in terms of",
            "start": 1163.08
        },
        {
            "text": "these I just ran past everybody and then killed them all this thing I'm like yeah this doesn't feel great this doesn't feel like the narrative go uh yeah I I'm I'm still into it though in terms of gameplay I think it's interesting the relationship between game and story obviously like I mentioned before the dual protagonist thing we've seen before with Assassin's Creed Syndicate and while they kind of pitch Jacob and Eivor being kind of different Jacob being a brawler Eivor being the stealth they pretty much still play the same maybe a couple of different abilities where here with Yasuke and Na it is very much Yasuke is the brawler Yasuke you want to be in in fights with Na you want to be stealthing and I do think it it rides a fine line that I don't know if it's going to fully succeed where there are moments where you get to choose like in big heavy story moments oh do you want to play as Yasuke or Na for this part and thematically I'm like well it makes sense for Nai to",
            "start": 1196.72
        },
        {
            "text": "succeed where there are moments where you get to choose, like in big heavy story moments. Oh, do you want to play as Yasuke or Na for this part? And thematically, I'm like, well, it makes sense for Nai to continue this story. But now I'm going to play in a section where I'm going to have to fight like six dudes all at once, and she shouldn't be doing this. Like, uh, Kevin if you want to bring up the boss fight footage that I have here, where it's like for this story that we got of this dude who um, we have to fight here, and uh, everything about his son felt like now I had more of a connection with what was going on here. But then we get into this boss fight that is full-on combat all of this stuff, and it was like I wanted to play as Na but I was like well Yas makes more uh like uh combat sense, combat sense. And it's like okay, and then you I I fight as Yas and at the end he's still not dead, and then now goes in for the kill, and it's like ah this this is like a weird balance that I don't know if I'm",
            "start": 1242.44
        },
        {
            "text": "We played Assassin's Creed Shadows, and it's like okay, and then you I fight as Ezio and at the end he's still not dead, and then now goes in for the kill, and it's like ah this is a weird balance that I don't know if I'm going to love through the entire time. Um, something I thought was interesting though right was uh I saw it called out there, I Villar Ericson, I see you asking about immersive mode, I want to talk about that they had Canon mode was something you could pick from the the cane and that's where what they choose the dialogue for you so the you get to choose a lot of dialog yeah oh wow I chose another well that's cuz you choose that yeah sorry I missed your own joke yeah canon mode and like picking of like oh this other narrative but then they still let you pick who you fought as yes oh interesting I thought they might force you into a character that way whatever so there's that in terms of like you have to make the choices for dialogue, this is what how it actually played out of you know through.",
            "start": 1288.68
        },
        {
            "text": "We played Assassin's Creed Shadows, and they might force you into a character that way, whatever so there's that in terms of like you have to make the choices for dialogue. This is what it actually played out through your DNA, and then for Villiers Ericson over there, I want to hear more about immersive mode. I didn't turn it on but it was an option, immersive mode this time around right where it's going to be all these native touches so when the people who speak Portuguese show up they're speaking Portuguese and then the rest would be in Japanese until somebody else speaks Spanish like they wouldn't dub anything it would be the people are speaking the way they should speak. Which I do think probably hits a bit more uh in certain situations again we won't say it but there's a moment with Yasuke early on where like hearing it all in English, it does get kind of like oh this is supposed to be a moment that I think like could have hit a bit more in uh actual like native languages and Japanese.",
            "start": 1328.72
        },
        {
            "text": "like hearing it all in English, it does get kind of like oh this is supposed to be a moment that I think like could have hit a bit more in uh uh actual like native uh languages and Japanese and all that stuff um I mean there's two Super Chat at the same time right like Colin Barry writes in and says more Assassin's Creed like one through three or origin Valla and then also jdub writes in and says does Na's movement feel faster for Assassin's Creed uh this is this is another open world Assassin's Creed game, this is The Mirage was their homage to the old school Assassin's Creed but you can see that the uh the want from the Assassin's Creed teams is to keep making these open world RPG uh like games so if you're hoping for more of a call back you're not getting that here um for the most part I would still say like a lot of like nowe gameplay stuff and even now a story stuff feels very Etso coded it feels like yeah to JB's question does it feel faster for AC no it feels like a as soon",
            "start": 1364.48
        },
        {
            "text": "I would still say like a lot of like now gameplay stuff and even now a story stuff feels very Early Access coded it feels like yeah to JB's question does it feel faster for AC no it feels like as soon as I got in as now I was like oh I'm at home I know what I'm doing in the bushes slinking around let's do that go prone all the way all the way down like Solid Snake or whatever yeah um yeah this is definitely an RPG which I think again is something that will speak to me more upon uh review where again like getting tossed in and like oh you've already filled out I don't have I didn't have a bunch of skill points to go through so it's like what it is and so then when I went back in there when I had time at the end of the demo and I was looking through like oh this would have been cool and oh I didn't even realize this was a movie could have done like building these characters piece by piece I think unlocking that repertoire might make it more enjoyable in a sense Kev if you want to bring up menu",
            "start": 1410.92
        },
        {
            "text": "even realize this was a movie could have done like building these characters piece by piece I think unlocking that repertoire might make it more enjoyable in a sense Greg if you want to bring up menu stuff uh just to talk about the RPG stuff because I know a big hang up a lot of people had was Valhalla how big Valhalla felt how big that skill tree uh uh felt as well and you have a bunch of separated uh skill trees this over there by left trigger right trigger right we're talking about the katana right now you can skip around other stuff yeah you have like your weapon skill trees and then more of like your skill uh skill trees like your assassin uh skill tree and and stuff like that and I think it doesn't feel it's definitely smaller than Valhalla skill tree but it still feels robust because you have these six uh skill trees for each character that's my alarm uh usual alarm to make sure you're getting the show ready but hour early today uh and so yeah I I I think because they segment it",
            "start": 1448.72
        },
        {
            "text": "you have these six uh skill trees for each character that's my alarm uh usual alarm to make sure you're getting the show ready but hour early today uh and so yeah I I I think because they segment it it's a bit more it feels like it's uh a bit more welcoming uh in terms of being a bigger RPG with a bunch of skill trees I definitely appreciate the way it's separated then like okay cool I want to commit to the katana I want to commit to the ball on a on a chain you know do that the whole thing uh and it it feels like the upgrades feel a bit more significant whereas Valhalla it was like plus five sword damage 5% sword damage or whatever some clown in the chat Paris goes but y'all poo pooed me drafting AC Shadows it ain't ain't going to get you at nine yeah no like this is the and this a solid Assassin's Creed it seems we'll see Val like I love valala Valhalla reviewed at like an 83 or 84 so it's like it's going to get get you a good good 10 points which again yeah good uh in terms of",
            "start": 1487.36
        },
        {
            "text": "Assassin's Creed it seems we'll see Val like I love Valhalla reviewed at like an 83 or 84 so it's like it's going to get you a good good 10 points which again yeah good uh in terms of combat uh and stealth uh and stealth is the thing that feels very iterative I remember when they revealed this game uh it was like oh you can like take out lights and like slink in the shadows and stuff and like that stuff is fun back sheet makes a big call out of like light really played and I'm like I'm playing the game like it feels like a I don't know just feels like every other stealth of Assassin's Creed uh I will say the seasons the seasons changed at one point in my preview I don't know if it did for you uh it was another thing they made a big deal of like they could do this and I like they might have I don't I didn't notice anything I definitely fell at one point it might have actually been in this Zone where I I uh sneak in as a na here where I think this was a season where um because there",
            "start": 1531.84
        },
        {
            "text": "I definitely fell at one point it might have actually been in this zone where I I uh sneak in as a ninja here where I think this was a season where um because there was like more wind and stuff like I I forget what it was but they they make a big deal about like foliage changing and all that stuff so a lot of like your hiding spots aren't going to be um as useful like maybe in trees and stuff like that and like you see like that tree is dying there and I felt uh in this base getting spotted a lot more even though I was high like up uh up above so I do think there is a little bit of uh them wanting you to put thought into when you're going into these bases in terms of daytime or night time in terms of uh season stuff about it right like cold weather NPCs will be closer to heat sources when it's raining they're going to be under the awnings like yeah again 10 hours into the game playing as it's meant to be played maybe",
            "start": 1571.8
        },
        {
            "text": "will be closer to heat will move closer to heat sources when it's raining they're going to be under the awnings like yeah again 10 hours into the game playing as that as it's meant to be played maybe that becomes more apparent whereas this was like climb in I kill this dude do that thing then there's some other boss guy I got to fight now and he's got a different thing and then he alerts all the guys and I got to fight all these guys I I I like the stealth it's more Assassin's Creed stealth uh I appreciate that you know assassinating a dude isn't like level locked it seems at least in this demo like it is just like hey if you can sneak up on this dude uh well enough you can just assassinate them and it's not like a a weird like oh they're five levels higher than you you can't assassinate them uh the combat feels fine um yeah it doesn't feel any different from I was surprised as somebody who loves as somebody who loves being the Assassin how much I liked being Yos yeah like I was like okay",
            "start": 1619.24
        },
        {
            "text": "The combat feels fine, um, yeah, it doesn't feel any different from what I was surprised as somebody who loves being the Assassin how much I liked being Ezio, yeah, like I was like okay this is cool and I do like how big and bulky he is and how strong he is to throwing people around, yeah, and it is like it's hard to tell again we played a remote demo so we're streaming we're streaming through like Ubisoft's like proprietary like PARSEC essentially and so it was hard to get a sense of like how satisfying that parry actually feels at the end of my demo I I did the uh all right thanks so much he's like yeah no problem like by the way like just so you know I've played a lot of Assassin's Creed like I know this probably looked like I've never played Assassin's Creed but there was just enough like uh lag where it's like I got to guess if it's going to be red or white so I'm taking blows I shouldn't be taking, yeah, uh and so I I I'm excited to like actually get the game to",
            "start": 1657.16
        },
        {
            "text": "We Played Assassin's Creed Shadows - Kinda Funny Games Daily 01.23.25\nwas just enough like uh lag where it's like I got to guess if it's going to be red or white so I'm taking blows I shouldn't be taking yeah uh and so I I I'm excited to like actually get the game to actually feel a bit more what the combat uh feels like but yeah it it's not like the most challenging thing but I don't think it's meant to be like uh it's just supposed to to feel solid and fun um yeah one quick question to both of you guys are you guys going to play it in Canon mode or are you going to do it with more choices I don't know like how much did you feel like you in your choices really felt like I like being able to tell people off and like I I don't remember any choice being like you **** you but I want I yeah I'm I'm not going to play in Canon mode I'm going to play cuz again it's an RPG I want to feel these characters I only played in Canon mode because we had the same demo and I asked them what you did and I was like I'm going to do the opposite yeah my we got a whole",
            "start": 1699.12
        },
        {
            "text": "an RPG I want to feel these characters I only played in Canon mode because we had the same demo and I asked them what you did and I was like I'm going to do the opposite yeah my we got a whole we still got 20 minutes of show left to get through so there's a lot going on here uh my one thing I want to cap and I'm sure most people click for this so it's fine my one thing I want to say that I am disheartened to say is that I left this demo and I am not anxious for more like you know how excited I am for a vow right now and how I could tell you three other games this year I can't wait to get for I'm I didn't leave this being like like when I left odyssey's demo at E3 I was like **** I need more Assassin's Creed Odyssey I can't think I'm saying that like when both cuz V was slay slated it for late last year like fall like so so was this game and I think leading into that I think I was more along the lines of oh man yeah I'll probably play Assassin's Creed Shadows who were AOW right now I",
            "start": 1741.56
        },
        {
            "text": "late last year, like fall, so was this game, and I think leading into that, I think I was more along the lines of \"oh man, yeah, I'll probably play Assassin's Creed: Shadows\" who were AOW right now. I think especially after this preview, I'm fully on yeah, I think I'll get to AOW first, and then if I play Assassin's Creed: Shadows, then great. But I think I'm prioritizing it out at this point. It's a very pretty world; I'm excited to actually see more of the natural like finding side quests and all that stuff. It felt very weird to try to find uh anything outside of the main quest. I got a side quest and like kill 25, and Demo's like \"you can't do that here\" by the way, you got you can't that you that requires you going outside of this province yeah, the demo area or whatever. Uh yeah, discovering things they want to be a bit more natural but it's all like you discover locations and then hopefully you can find stuff around those locations uh but with it being a bunch of question marks it's like what",
            "start": 1776.76
        },
        {
            "text": "They want to be a bit more natural, but it's all like you discover locations and then hopefully you can find stuff around those locations. Uh, but with it being a bunch of question marks, it's like what is my motivation to go to these question marks? Especially when visually, when I look over here, it's not like the most engaging to actually check out this house, you know. Um, and so I think that's like a weird line that I... I don't know if it's really going to fully work of like uh them trying to do this whole immersive naturally find everything in the world type of thing. But um, yeah, I'm I'm excited as an Assassin's Creed fan. It is one of those things where I was like man I'm so glad they delayed it another month because I'm playing all these Naughty Dog games right now and I was like I'm going to I'm... it has inspired me to like wrap that up because I want to have the time to like fully focus on Assassin's Creed uh whenever we get... we I forgot, I got delayed so actually that helps me out yeah.",
            "start": 1815.08
        },
        {
            "text": "I'm excited to have it has inspired me to like wrap that up because I want to have the time to like fully focus on Assassin's Creed uh whenever we get we I forgot I got delayed so actually that helps me out yeah I was going to say I was like you keep bringing up a bottom you got a month I to forgot about that so yeah March for this one obviously we'll keep you posted and I am anxious to get code to see if I hope that prologue keeps me going I hope that they do that and and I all right cool it was just the jump ahead but we'll see we see Barrett thank you so much thank you for having me anytime and thank you ladies gentlemen and NBS for supporting Kinda Funny with a Kinda Funny membership $10 gets you all of our shows ad free and of course you get your daily dose of me Gregway but right now you're not using your membership benefits on Spotify on Apple on youtube.com/kindafunnygames on patreon.com/KindaFunny so here's a word from our sponsors this episode is brought to you by Shady Rays get ready",
            "start": 1861.24
        },
        {
            "text": "using your membership benefits on Spotify on Apple on youtube.com/ KindaFunnyGames on patreon.com KindaFunny so here's a word from our sponsors this episode is brought to you by Shady Rays get ready for the season ahead with quality Shades built to last our friends over at Shady Rays have you covered with premium polarized Shades that won't break the bank Shady Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people they have hundreds of options to choose from so you're bound to find the perfect pair to match your style plus if your Shades ever go missing or take an unexpected hit don't sweat it they have the most insane protection in all of eyewear every pair is backed by lost or broken Replacements if you don't love your Shades exchange them for a new pair or return WorryFree within 30 days y'all know I've been outside a lot in the sun playing Pokémon Go and it's such a great experience wearing my Shady Rays when I'm out and about",
            "start": 1902.2
        },
        {
            "text": "them for a new pair or return WorryFree within 30 days y'all know I've been outside a lot in the sun playing Pokémon Go and it's such a great experience wearing my Shady Rays when I'm out and about looking dope exclusively for you, Shady Rays is giving out their best deal head to shadyrays.com and use code funny for 35% off polarized sunglasses try for yourself the shades rated five stars by over 300,000 people that's shadyrays.com use the code funny this episode is brought to you by Rocket Money you sign up for something free get about it after the trial period ends then you're charged month after month after month the subscriptions are there but you're not using them in fact 85% of people have at least one paid subscription going unused each month thanks to Rocket Money you can see all your subscriptions in one place and cancel the ones that you're not using anymore and save more money Rocket Money has helped multiple members of Kinda Funny learn that they are still paying for",
            "start": 1946.28
        },
        {
            "text": "your subscriptions in one place and cancel the ones that you're not using anymore and save more money Rocket Money has helped multiple members of Kinda Funny learned that they are still paying for things they totally didn't even realize Rocket Money is a personal finance app that helps find and cancel your unwanted subscriptions it monitors your spending and helps lower your bills so you can grow your savings Rocket Money has over 5 million users and has saved a total of $500 million in canceled subscriptions saving members up to $740 a year when using all the apps premium features cancel your unwanted subscriptions and match your financial goals faster with Rocket Money go to rocketmoney.com/kindafunny today that's rocketmoney.com/kindafunny rocketmoney.com kind of funny number two on The Roper Report Earthblade has been cancelled we have oh hey God damn it you go to kindofunny.com I know that feel what is it game League brother kindofunny.com oh I even care about the league",
            "start": 1993.08
        },
        {
            "text": "Roper Report: Extremely OK Games has cancelled Earthblade. We have oh, hey God damn it. You go to KindaFunny.com. I know that feel. What is it? Game League brother, KindaFunny.com. Oh, I even care about the League 2025. You do have this. It will not release. Also, not to make it about the League but just to make it about the League for a second, but like does this count as like a delayed game because it's forever delayed? Yeah, yeah okay. Dr, I'm **** up over this well for the fact that it's delay CU. I was looking for this, looking forward to this game. But if you remember doing The Fantasy Critic, I for my counter pick it came down uh for me between this and Mario and Mario... 3D Mario and because in my soul I was like ah if Earthblade comes out and it's incredible I'm going to feel more salty than Mario. Remember that if you want Kevin. I tossed in the YouTube trailer uh for Earthblade, that was the Game of Wars revealed two years ago. It says here on YouTube. I don't know if that right there but here's the",
            "start": 2039.28
        },
        {
            "text": "that if you want Kevin I tossed in the YouTube trailer uh for Earthblade that was the Game of Wars revealed two years ago it says here on YouTube I don't know if that right there but here's the actual blog post blog post from Extremely OK Games hey everyone I've got some sad news today to ring in 2025 late last month Noel and I made the difficult decision to cancel Earthblade yes we are opening the year with a huge heartbreaking and yet relieving failure I want to outline in this post what led to this decision and what it means to the Future of Extremely OK Games it's abbreviated that makes more sense that makes more sense I like I didn't read that was weird uh before I get into it however I want to acknowledge that this news will likely come as a shock to fans who have been eagerly anticipating the game we made this decision in December and felt it best to wait until now to announce it for us on the inside we've had some time to process grieve and work towards",
            "start": 2092.6
        },
        {
            "text": "We've played Assassin's Creed Shadows, Celeste dev's next game has been cancelled, and Dragon Age: The Veilguard didn't meet sales expectations. We made this decision in December and felt it best to wait until Nate Drake to announce it for us on the inside. We've had some time to process grief and work towards accepting this although that process is nonlinear and still ongoing. For those only reading this now who might not be emotionally invested in the project, we're sorry to or who might be emotionally invested in the project, we're sorry to disappoint you. Quick aside, remember if you're an audio listener I'm sorry the trailer would have told you this is from the folks who made Celeste. Yes, that's why there's so much hype previously Maddy Makes Games they uh changed the company name to Extremely OK Games. Yeah, this was going to be this was announced I forget where but it was a few Game Awards it was The Game Awards it was a few years ago and it was just like this tease of like all right this is definitely looking like the Celeste art style with the platforming that you know and love but it's a Metroidvania.",
            "start": 2136.28
        },
        {
            "text": "it was a few years ago and it was just like this tease of like all right this is definitely looking like the Celeste art style with the platforming that you know and love but it's a Metroidvania with really uh cool looking combat and enemies and all this stuff and this is just this is a heartbreaker this is like of course I was thinking about the fantasy league but it was like **** we're never going to be able to play this like the fact that it wasn't just like hey we like lost uh someone who is like a major part of this project so we're delaying it but to straight up cancel it it's like **** that is well the story fasc yeah there's more to it of course this is you know Matt Mak's game this but it's like a small team right who's being very open and honest about what's going on earlier this year a fracture began forming in the team specifically this was between us Noel and I in Pedro a founding member of Extremely OK Games longtime friend and collaborator and the art director on",
            "start": 2173.28
        },
        {
            "text": "this year a fracture began forming in the team specifically this was between us Noel and I in Pedro, a founding member of Extremely OK Games, longtime friend and collaborator, and the art director on Earthblade and pixel artist on Celeste in TowerFall; the conflict centered around a disagreement about the IP rights of Celeste, which we won't be detailing publicly; this was obviously a very difficult and heartbreaking process; we eventually reached a resolution but both parties also agreed in the end that we should go our separate ways; Pedro is now working on his game Never Way, which you should check out – we've played it and it's very promising; losing Pedro wasn't the only factor in canceling the game but it did prompt us to take a serious look at whether fighting through to finish Earthblade was the right path forward; the project had a lot going for it but frustratingly it was also not as far along as one would have expected after such a protracted development process I do believe",
            "start": 2219.68
        },
        {
            "text": "We played Assassin's Creed Shadows, Celeste dev's next game had been cancelled, and Dragon Age: The Veilguard didn't meet sales expectations. was the right path forward the project had a lot going for it but frustratingly it was also not as far along as one would have expected after such a protracted development process I do believe that if we soldiered on despite it all that Earthblade could still be a great game but would it be worth the pain Noel and I began to reflect on how the game has felt for us to work on day-to-day and realize that it has been a struggle for a long time sure working on one project for so long is bound to become a slog but this feels like a deeper problem Celeste's success applied pressure on us to deliver something bigger and better with Earthblade and that pressure is a large part of why working on it has become so exhausting Pedro isn't to blame for this in fact the split with him has given us clarity to see we have lost our way and the opportunity to admit defeat I feel many ways about it but one big feeling is undoubtedly relief while this is shaken out",
            "start": 2260.96
        },
        {
            "text": "We've lost our way, and the opportunity to admit defeat. I feel many ways about it, but one big feeling is undoubtedly relief while this is shaken out. While this is shaken out, other members of the team have moved on as well. Noel and I now want to take all of the lessons we've learned from Earthblade, wipe the slate clean, and refocus ourselves on back to a smaller scale projects. We're prototyping again and exploring at our own pace and trying to ReDiscover game development in a manner closer to how we approach it at Celeste's or Tower Falls Inception. Scaling the core team up post-Celeste has ultimately been a failure, and that's okay. We gave it all we've got, and life goes on. We are happy to return to our roots and reclaim some joy in our creative process and see where it takes us. Yeah, so this is fascinating because I think it is sad that they're canceling this because this is one that they got to reveal, and like I think all of us were",
            "start": 2303.36
        },
        {
            "text": "We played Assassin's Creed Shadows, Celeste dev's next game has been cancelled, and Dragon Age: The Veilguard didn't meet sales expectations.",
            "start": 2348.48
        },
        {
            "text": "We played Assassin's Creed Shadows, Celeste dev's next game has been cancelled, and Dragon Age: The Veilguard didn't meet sales expectations. It's funny I listen I've been referencing this J. Cole podcast that I listen to where he's talking about like his album to album journey and he talked about like kind of his sophomore slump and like the pressure you feel when you're trying to live up to expectations and all that stuff right um them here you know talking about you know scaling up the core team post Celeste trying to do this trying to make a thing that might have lived up to it right and like it kind of leading into ah no like this Ain't this isn't going to work out for us I love that they're in a place where they're like hey stop this isn't working out we're not having fun making this cancel it let's go smaller like let's make something that's going that we're going to be happy with uh in the way that TowerFall was something that we made that was small scale that we were happy with and the way excited to do you and excited excited to do it seems like Earthblade started",
            "start": 2391.68
        },
        {
            "text": "with uh in the way that TowerFall was something that we made that was small scale that we were happy with and the way excited to do you and excited excited to do it seems like Earthblade has been cancelled - Blog Post from Extremely OK Games started to have a lot of uh emotional baggage for them and so I I am heartbroken but I do very much understand just creatively and um how strong willed you have to be to make that decision to let that project go especially when it was so anticipated by so many of us uh so yeah it's uh it's heartbreaking heartbreaking yeah but I'm G finally leave because we have 10 minutes 10 minutes was I was uh I was hoping you go just a little bit longer damn it damn it I what are you looking for now no you'll see hold on uh Kevin I'm sending you a link when you get just you me fill time I can fill talk just play this music when you get a chance uh no I think again and what a well spoken letter what a well- Written Letter you know what I mean and like what I as somebody who's publicly broken what it's time to go as",
            "start": 2433.64
        },
        {
            "text": "when you get a chance uh no I think again and what a well spoken letter what a well-written Letter you know what I mean and like what I as somebody who's publicly broken what it's time to go as someone who's publicly broken up with a creative partner before that's the toughest **** no I didn't say turn it up loud on me Kevin that's the toughest **** you could possibly go through so to have like this say this while you're personally grieving the loss of a friend the loss of a collaborator to do all this different stuff like hats off to them for handling this and more power to them for pushing through number no no keep it going I like keeping it why we get claimed you think Nintendo's crazy don't do it number three Dragon Age: The Veilguard had 1.5 million players in the first two months EA expected 3 million this is Rebekah Valentine at ign.com EA has announced today that it's revising its outlook for the fiscal year",
            "start": 2481.16
        },
        {
            "text": "Dragon Age: The Veilguard had 1.5 million players in the first two months, EA expected 3 million. This is Rebekah Valentine at IGN.com. EA has announced today that it's revising its outlook for the fiscal year after a slowdown in Go Global football net bookings growth and Dragon Age: The Veilguard missed the company's internal targets by nearly 50% in a press release, the company said it was reducing its expectations for the fiscal year ending March 2025 from mid single-digit growth to mid single-digit decline. The largest culprit EA says was the global football AKA Esports EA Sports FC, uh, which it says experienced a slowdown last year in Q3 after two consecutive fiscal years of double-digit net bookings growth. In a press release, EA CEO Andrew Wilson specifically pointed to EA Sports FC25 as underperforming. This is one of those days that I wish was a way slower news day because I would have loved to like take time to talk about some of this stuff um because I think both the Dragon Age Veil",
            "start": 2518.76
        },
        {
            "text": "this is one of those days that i wish was a way slower news day because i would have loved to like take time to talk about some of this stuff um because i think both the Dragon Age: The Veilguard and EA Sports FC parts of it are fascinating for different reasons one because i think to ea sports fc to be underperforming feels like a bad omen for the industry sure we don't need fifa oh yeah well you're saying the opposite way yeah i'm saying more so of like fifa the thing that always performs that's one of the highest performing games of the industry now of course this could come down to their projections and like what they wanted their fifa to do in terms of growth but even still like fifa not being enough it's like oh then what the **** is happening then if fifa is underperforming to the Dragon Age: The Veilguard part of it right like i only played a little bit of dragon age: the veilguard but i heard there's a lot of woke in it lot a lot you go broke my favorite thing of they went through here",
            "start": 2567.36
        },
        {
            "text": "Dragon Age: The Veilguard part of it right, like I only played a little bit of Dragon Age: The Veilguard, but I heard there's a lot of woke in it. Lot a lot, you go broke. My favorite thing is they went through here, of course, like Dragon Age is a niche game. How they expect to sell how much this is such a **** great example now sadly the shitty people on the internet are only going to take that part away from it and forget of course that when Dragon Age launched it was the top of the Steam charts, it was doing great, it had all this stuff. We're back to what your expectations are, what a little bit of profit isn't enough, it needs to be a major profit. I don't know what they if they go into how much Dragon Age in terms of success or whatever it was financially but this game sold well at launch 1.5 million nothing to is you know poo poo but when you're EA and you expect 3 million off of Dragon Age, when and you're making your one single-player game a year and you're like all",
            "start": 2604.84
        },
        {
            "text": "We played Assassin's Creed Shadows, Celeste dev's next game has been cancelled, and Dragon Age: The Veilguard didn't meet sales expectations. sold well at launch 1.5 million nothing to is you know poo poo but when you're EA and you expect 3 million off of Dragon Age: The Veilguard when and you're making your one single player game a year and you're like all right cool hopefully this has Star Wars numbers this yeah this will be exactly this going to come back around and just like man look at this you know single player games are dead so now we look toward Mass Effect also another thing of man again I wish we had one more time but then we get into the BioWare conversation of all right well Mass Effect: Andromeda didn't do it Anthem didn't do it Dragon Age: The Veilguard even though better than both those games in terms of sales expectations isn't meeting it for EA then like where are we at with BioWare but we can talk about that later number four power developer Pocket Pair moves into publishing to release Tales of Kenzera dev's next game this is Ryan Dinsdale at IGN Palworld, Pal World developer Pocket Pair is moving into the publishing business to",
            "start": 2642.8
        },
        {
            "text": "Developer Pocket Pair moves into publishing to release Tales of Kenzera dev's next game. This is Ryan Dinsdale at IGN. Palworld developer Pocket Pair is moving into the publishing business to release Tales of Kenzeria dev's next game. The newly formed Pocket Pair Publishing said on X/Twitter it will support a brand new horror game from Sergent Studios, which released Zhao and its debut title in April. The horror game is published by Pocket Pair won't be a continuation of the universe, however very fascinating, very exciting, love it really love that uh what Insurgent Studios after some after some going through like uh layoffs and like I think having kind of a tumultuous uh 2020 being very public of like we need money to keep doing this yeah yeah like being able to find a publisher for the next game and like doing something fresh doing something different for them looking forward to you know Abu was very public went through all that and the",
            "start": 2680.36
        },
        {
            "text": "like being able to find a publisher for the next game and like doing something fresh, doing something different for them, looking forward to you know Abu was very public went through all that and the Falco's and everything else, like we have our idea for the next game we just need someone as a publisher so it's see in a longer in a longer KFGD we'll then talk about Pocket Pair being a publisher uh hey don't you love to see this when you talk about Inner Sloth and Outer Sloth Games right where it's like hey we made an indie that was super successful Palworld now we're going to pay that money back to the industry and keep people around yeah number five on The Roper Report Final Fantasy 7 Remake Part Three won't be a PlayStation 6 exclusive, the producer promises this is Chris going to VGC I I can sum this one up basically fans are like wondering if this game is going to be I mean because of the the time it takes to develop these games fans are like oh this is going to be a PlayStation 6",
            "start": 2722.68
        },
        {
            "text": "I can sum this one up basically fans are like wondering if this game is going to be I mean because of the the time it takes to develop these games fans are like oh this is going to be a PlayStation 6 exclusive and he was basically like ah don't worry about that it's not going to be a PlayStation 6 exclusive May because they're like oh we're nine months into already developing it we're still talking about the Next Generation aspect of it maybe not the exclusivity but okay we'll see love that uh then number six is a Wii news demotion yeah this was a full story I'm you want to go news then blessing I'm so sick of the big news we've had to run through today what if we had a place to go for smaller news what would we call it we call it the Wee News Channel where we cover all the small news items they need to know about number six The Wee News uh the Game Awards Twitter account has confirmed that our friend of the show Kumail Nanjiani has been cast in Fallout season 2 as quote a high ranking official",
            "start": 2758.12
        },
        {
            "text": "they need to know about number six, the Wii news, uh, the Game Awards Twitter account has confirmed that our friend of the show Greg Miller has been cast in Fallout season 2 as quote a high-ranking official within the Brotherhood of Steel this is according to the Insider, the Insider's and I don't think it's a confirmation it's more so this person's report, the Insider is if the Game Awards is reporting it that means Jeff and K are sharing a cigar talking about it that's real take B uh from Variety via Wario64 Warner Bros. Interactive Entertainment president David Haddad has is exiting his role quote I'm so proud of everything we've accomplished together at Warner Bros. Games during my time with the company he said bro you **** this **** up so bad you **** this **** up so **** bad as he left the front door he out like a large fart you **** this up so bad get the **** out of here please just let me get Wonder Woman before it all **** gets sold uh from VGC",
            "start": 2795.08
        },
        {
            "text": "We played Assassin's Creed Shadows, Celeste dev's next game has been cancelled, and Dragon Age: The Veilguard didn't meet sales expectations. Go to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses. We've played Assassin's Creed Shadows - Kinda Funny Games Daily 01.23.25. Today after, KFGD, you'll get: Our Reaction to the Xbox Developer_Direct GAMESCAST - our post show breakdown The STREAM is Kingdom Hearts 2 w/ Mike If you're a Kinda Funny Member: You can get today's Gregway And you can get Alien In Review this afternoon, and tomorrow on YouTube and Podcast services. Thank you to our Patreon Producers: Delaney Twining & Karl Jacobs The Roper Report - Assassin's Creed Shadows Preview Ad Earthblade has been cancelled - Blog Post from Extremely OK Games Dragon Age: The Veilguard Had 1.5 Million Players in First Two Months, EA Expected 3 Million - Rebekah Valentine @ IGN Palworld Developer Pocketpair Moves Into Publishing to Release Tales of Kenzera Dev's Next Game- Ryan Dinsdale @ IGN Final Fantasy 7 Remake Part 3 won't be a PS6 exclusive, producer promises - Chris Scullion @ VGC Wee News! The Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join http://www.patreon.com/KindaFunny Subscribe And Ring The Notification Bell: Kinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1 Follow Us: Twitter: http://www.twitter.com/KindaFunnyVids Bluesky: https://bsky.app/profile/kindafunnyvids.bsky.social Instagram: http://instagram.com/KindaFunnyVids TikTok: https://www.tiktok.com/@kindafunnygames Twitch: http://www.twitch.tv/KindaFunnyGames Merch: http://www.kindafunny.com/store Listen To Our Podcasts on Your Favorite Podcast Service: Kinda Funny Games Daily: https://bit.ly/2T3Y3rS Kinda Funny Gamescast: https://bit.ly/3wBgRwg The Kinda Funny Podcast: https://bit.ly/3wA9GVo In Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7 Follow The Kinda Funny Team: Greg Miller: https://twitter.com/GameOverGreggy Tim Gettys: https://twitter.com/TimGettys Nick Scarpino: https://twitter.com/Nick_Scarpino Andy Cortez: https://twitter.com/TheAndyCortez Blessing Adeoye: https://twitter.com/BlessingJr Mike Howard: https://twitter.com/SnowBikeMike Kevin Coello: https://twitter.com/KindaFunnyKevin Joey Noelle: https://twitter.com/joeynoelle Barrett Courtney: https://twitter.com/SadBoyBarrett Roger Pokorny: https://twitter.com/rogformer The Pokémon company has confirmed the release date of the second full expansion for Pokemon Trading Card Game, Pocket, the SpaceTime Smackdown expansion will be released on January 30th and features two separate types of booster packs featuring legendary Pokémon Diga Di and Pa. I've saved up so many hourglasses I can't wait yeah that's all I got yeah you going to unleash them oh I'm going to unleash so many hourglasses for sure open up 10 packs at a time damn and believe it or not everybody that's another episode of kind of funny games daily we did it we crushed it we got there in the end of course if you're like man I'm sad that they sped through this episode remember it's because the biggest news of the day is probably the Xbox direct that we are live reacting to momentarily we're going to get",
            "start": 2838.16
        },
        {
            "text": "you're like man I'm sad that they sped through this episode remember it's because the biggest news of the day is probably the Xbox Developer Direct that we are live reacting to momentarily we're going to get this stream cut off so that you can get the chairs out here the mics up here get live for a little bit of a pre-show then live react uh on youtube.com/kindafunnygames twitch.tv/kindafunnygames come watch our reactions later after you watch it later if you want to and then of course stick around for a live gamescast where we do the post show breakdown with all our thoughts opinions and more will I make fun of Paris at some point I probably will until next time it's been our pleasure to serve you oh n a for",
            "start": 2882.56
        }
    ]
}