{
    "id": 13380,
    "video_id": "eZmG-DcIPAI",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Parris Lilly"
    ],
    "title": "Until Dawn Movie Teaser Reaction - Kinda Funny Games Daily 01.14.25",
    "description": "This episode is sponsored by BetterHelp — go to http://betterhelp.com/kindafunny to get 10% off your first month.\n\nGo to http://expressvpn.com/kindafunny to get an extra 4 months free.\n\nGo to http://meundies.com/kindafunny to get 20% off your first order and free shipping.\n\nWe’re here to talk about video game news!\n\nAfter 31 years at PlayStation, Shuhei Yoshida is out on his own, and his first stop? The Kinda Funny Gamescast! Wednesday at 4 pm PT, Shu sits down with Greg to talk about his career, the Vita, and his future! Don’t miss it live on youtube and twitch and later on podcast services!\nA lot of y'all have made comments about loving the anniversary logo and the water bottle/notebook we got for the team, so the new anniversary merch collection is now up on kindafunny.com/store!\nWe’re an 11-person business all about live talk shows.\nToday after, KFGD, you’ll get:\nGAMESCAST - Greg and Parris’s GOTY top 10\nThe STREAM is Roger, Joey and Nick flexing their movie knowledge in a new game.\nIf you’re a Kinda Funny Member:\nYou can get today’s Gregway\nThank you to our Patreon Producers: Delaney Twining & Karl Jacobs\n\n00:00:00 - Start\n00:04:30 - Housekeeping\nThe Roper Report   -\n00:08:26 - The First Teaser for the Until Dawn movie is here\n00:15:35 - Donkey Kong Country Returns Review Round Up\n00:26:30 - Ad  \n00:29:54 - Assassin’s Creed games and Metal Gear Solid Delta tipped for Switch 2 release - Tom Ivan @ VGC\n00:37:30 - Report: Microsoft To Reveal New Entry In \"Legendary\" Japanese Franchise Next Week - George Yang @ Gamespot\n00:44:55 - The Witcher 3 director reveals new open-world RPG, The Blood of Dawnwalker - Andy Robinson @ VGC\n00:48:12 - Wee News!\n00:50:30 - You‘re Wrong\n\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1736881689,
    "duration": 3619,
    "transcript_chunks": [
        {
            "text": "gets its first teaser Donkey Kong Country Returns Review Round Up, and more games are rumored for Switch 2. We'll have all this and more because this is Kinda Funny Games Daily. What's up, and welcome to Kinda Funny Games Daily for Tuesday, January 14th, 2025. Of course, I am Tim Gettys, and I'm joined today by Parris Lilly. How you doing, Tim? I'm doing fantastic. How are you? Oh, I'm great. It's always a good time when you and I get to do KFGD so rarely. So upsettingly Rare also having you in the studio is always a... a fantastic time. I love having you with the desk. I feel like you get so much happier when you get to actually be here, show up here. Yeah, how you doing overall? I'm good. I'm good. Yesterday was great; Game of the Year episode and fantastic stuff. Of course, you can check that out now. We did our Game of the Year yesterday, and all this week we're going to be doing our personal top 10, including today, that's right, you and Greg. Me and Greg, which I'm really excited about. Number seven, I can't wait to reveal number",
            "start": 15.28
        },
        {
            "text": "yesterday and all this week we're going to be doing our personal top 10 including today that's right you and Greg me and Greg which I'm really excited about number seven I can't wait to reveal number let's talk about this let's talk about this for a second because uh first off I hate GameOverGreggy he causes so much so much problems all the goddamn time I wasn't on the KF podcast yesterday uh cuz I was on other shows and then I had to actually do business stuff and and you know get some **** work done Greg figure it out okay he's having fun with you and Nick on the KF podcast he gives me the headline of the KF podcast and it is Parris Lilly has beef with Tim Gettys and of course I immediately roll my eyes and I'm just like what did GameOverGreggy cause like what what could have possibly happened here and on the drive uh into work me and my brother listened to the opening of the episode just cuz I I wanted context I was like I know it's **** but like what what is it what is it so I mean dude I don't",
            "start": 68.0
        },
        {
            "text": "on the drive uh into work me and my brother listened to the opening of the episode just cuz I I wanted context I was like I know it's bad but like what what is it what is it so I mean dude I don't want to put words in your mouth do do you have anything to say I don't have beef with you he it was it was a struggle you heard it I was like I liked him I know I liked him so I had to make quickly you very quickly my brother was like oh he got there fast he got no but like let's talk about it let's talk about it because uh one of your beefs was that on the game of the year episode yesterday yes that I gave you a a weird look yes that looked like I didn't respect you or something and I want to clear there was one weird look and that weird look was about sh number seven so you know you know how not worth respect cuz that's my thing you you brought it up in a way that I'm like huh it can only be one thing but it can't possibly be that one thing I I had to make it fun it had to be funny respect",
            "start": 106.36
        },
        {
            "text": "\"Worth respect, cuz that's my thing. You brought it up in a way that I'm like, huh, it can only be one thing but it can't possibly be that one thing. I had to make it fun; it had to be fun. Respect, I will say it was God. I don't remember what KFGD it was, it was you and Blessing, and I called in, and we're talking about console sales and all that, and the comments ripped me to shreds, but that's my thing. See, I remember that, and I don't take anything back. You were saying wild stuff; you say wild stuff, I'm responding, I'm going to respond. I respect the stuff out of you, and I love your takes and perspective on stuff, but when you're saying some stuff like no bro, no, no, I, I, I, I look, I deserved it, but but I had to we had to have some kind of beef so I made up beef exactly. I deserve that one. I love it though, and like obviously I love the stuff out of you; respect the stuff out of you. Yeah, but I can't wait to hear what your number seven is cuz like oh it's going\"",
            "start": 148.48
        },
        {
            "text": "I love it though and like obviously I love the **** out of you respect the **** out of you yeah but I can't wait to hear what your number seven is cuz like oh it's going to be great it's going to be great everybody but hey that's not what we're talking about right now right now we're talking about Kinda Funny Games Daily each and every weekday we run you through the nerdy news that you need to know about live on YouTube oh my god Brave man talking **** about me thinking I won't hear this is how it can happen at any point I want your stars get some stars and give them to me God this is this is just what I need to live with at all times I had no idea he was about to do that that like literally scared us we don't ever know it is I'm like where did he come from I didn't see him walk from there like where did he go is there a secret door or something did he make contact oh he made a lot of contact yeah I looked away when he got his tongue out it's enough contact that it dripped down",
            "start": 194.04
        },
        {
            "text": "like where did he go is there a secret door or something e did he make contact oh he made a lot of contact yeah I looked away when he got his tongue out its enough contact that it dripped down to my ear okay oh hes making faces now God I dont even have stars we the season hasnt even started yet theres nothing the threat is an empty one I hate it um but I love this show everybody and also I love you loving what we do supporting us with the Kinda Funny membership on Patreon YouTube and now Spotify and Apple Podcast to get all of our shows ad-free watch us record them live and get a daily exclusive show for chess be part of this show though you can submit your thoughts and opinions as YouTube Super Chat so if you have any questions for Paris any just compliments for Paris please send them our way a little housekeeping for you we've been teasing something big coming this Wednesday and now we can actually tell you what it is tomorrow on Wednesday you'll be able to see a very",
            "start": 237.44
        },
        {
            "text": "send them our way a little housekeeping for you we've been teasing something big coming this Wednesday and now we can actually tell you what it is tomorrow on Wednesday you'll be able to see a very special kind of funny games cast after 31 years at PlayStation Shuhei Yoshida is out on his own and his first stop the Kinda Funny Gamescast Wednesday at 4:00 p.m. Pacific Time Shu is going to sit down with Greg to talk about his career, the Vita, and his future don't miss it live on YouTube and Twitch and then later on podcast services uh it's going to be a very special episode how cool is that oh no that's awesome that's awesome I'm I'm excited to tune in myself and check it out and congratulations to Shu on an amazing run over at PlayStation yeah but can't wait to hear that myself as well uh and then a lot of y'all have made comments about the Kinda Funny anniversary logo the 10 year anniversary logo the water bottle and notebook that uh we got for the team so the new anniversary merch",
            "start": 282.24
        },
        {
            "text": "and then a lot of y'all have made comments about the Kinda Funny 10-year anniversary logo, the water bottle, and notebook that uh we got for the team so the new anniversary merch collection is now available on kindofunny.com/store you can get the notebook you can get a water bottle and you can get it on a t-shirt in two color ways the blue and the orange uh both look fantastic shout out to Campfire Designs for killing the design uh remember we are an 11-person business all about live talk shows today after Games Daily, you'll get Gamescast - that is Greg and Parris dropping their Game of the Year top 10 uh and then the stream here's the thing I think Greg is going to get way more **** than you do about your list oh no oh he 100% is yeah 100% is but my number we're going to have a fun conversation about number I love that it's the two of you as well man goal approaching everybody and then the stream after that oh man hard to explain but you're going to want to be",
            "start": 325.96
        },
        {
            "text": "to have a fun conversation about number I love that it's the two of you as well man goal approaching everybody and then the stream after that oh man hard to explain but you're going to want to be there Roger Joey and Nick are going to flex their movie knowledge in a new game there's this sensation sweep in the nation of the Kinda Funny Studios where Nick is addicted to some WLE type Movie game yeah and will not leave Roger alone like I don't know I don't know why he needs Roger to be a part of this he could just be a like a Solo I think he knows the website that's the thing it's literally something that simple but Nick will just also he can't type and hold the football at the same time you guys are about to learn a lot about the recent culture of this studio uh but real talk there's this game they're playing and it is a blast it's like a movie connection game uh cinu nerle people are saying is what it's called they could work on the name but you know it's fine um anyway check that",
            "start": 362.72
        },
        {
            "text": "game they're playing and it is a blast it's like a movie connection game uh Cinemaverse people are saying is what it's called they could work on the name but you know it's fine um anyway check that out after the games cast great day of content here uh we already got a super chat in here uh from Sen Nuggies requesting they demanding a Paris emote here in the KF chats if he allows it you know I i' I've been seeing that for a while I think it's time I think it's time too if anybody's listening that can make that happen please do uh Greg talk to Andy Andy talk to Roger Roger talk to Joey I don't know exactly how the whole emote process works but we need to do it hey I have another request and I'm going to right in the camera as I say it uh GameOverGreggy where's my bottle and controller a good question you know you always talk about an 11 person Studio I hear this all the time and I I get it you are an 11 person Studio but you're really 11.5 and that's me I'm the0 five I at least want a",
            "start": 410.76
        },
        {
            "text": "question you know you always talk about an 11-person studio I hear this all the time and I, I get it, you are an 11-person studio but you're really 11.5 and that's me, I'm the 0.5, I at least want a controller or no, no, I just want the water bottle, I got enough controllers can I get the water bottle please? Get this man a water bottle, Greg, please, jeez! Oh man, uh, if you're kind of putting it together remember, of course, you also get today's Gregway. Thank you to our Patreon producers, Delaney Twining and Karl Jacobs. Today we're brought to you by BetterHelp, ExpressVPN, and MeUndies, but we'll tell you all about that later. For now, let's begin with what is and forever will be the Roper Report. It's time for some news. We have six stories bigger... You got caught up there a little. Uh, the first story, the first teaser for Until Dawn: The Movie is here. We're going to live react to this. Paris, are you",
            "start": 454.72
        },
        {
            "text": "for some news we have six stories bigger you got caught up there a little C uh the first story the first teaser for Until Dawn: The Movie is here we're going to live react to this uh Parris, are you an Until Dawn guy really yeah I played the first loved the first we did it on stream but like I am not like the Until Dawn expert by any means Greg Miller come back we actually want you now yeah see it's time yeah because Greg Greg's a little higher on the knowledge of the retaining the characters and all that stuff here so I want him to come out to react to this thing as well but I'm excited that the movie's happening I want to see this like cuz I the story of the game I like a whole you know bunch of teen horror type situation Good Vibes all around forgot that I was actually doing something real on the show sorry sorry sorry about that sorry I li you so good yeah you L really really good um so I'll do the Nick I'll do the Nick are you hyped about this uh h no but not because I",
            "start": 500.72
        },
        {
            "text": "The First Teaser for the Until Dawn movie is here.",
            "start": 551.76
        },
        {
            "text": "Stuff, it's so close, oh my God, you never saw this. I never understood why but it's clearly because he's so close to the sidewalk he can see all the money on the ground. I thought he was just cheap but it's just like when it's all you know. Thank you for...ing why he. I was a huge fan of the Until Dawn game and how cinematic it was. I thought a lot about how we can continue the story without just giving the audience the same experience that they got when they were playing. The movie has sort of the same tone and the same vibe but it expands upon the universe. I'm very proud to be part of this evolution onto a screen. One of the creative things the game did is that people make different choices and die in different ways. The movie has this mechanic where things start over and then they get to try again, what just happened every time they come back to life it's like they're in a new horror genre to survive they have to make it until dawn. Okay I'm kind of hey that looks cool that sound is Cabin",
            "start": 600.12
        },
        {
            "text": "again what just happened every time they come back to life it's like they're in a new horror genre to survive they have to make it until dawn okay I'm kind of hey that looks cool that sound is Cabin in the Woods kind of vibe you know what I mean let's take a horror thing welcome I **** hate Andy all right **** hate him can can can I admit something as you too please can we call this fory yeah I hate Andy as a huge fan of the Uncharted see there we go that looked like it should have been on Tubi thank you that was the one that was where I was going interesting concept but something I've texted you before Tim is why is it sometimes I start a movie and I'm like oh immediately this doesn't look good like this doesn't this doesn't look like it's going to be a major motion picture that looks to me like that's be on Peacock where I was going yeah budgets you know what I mean yeah I think it's probably the right move to make a movie at the low budget for this type of thing actually make the",
            "start": 663.76
        },
        {
            "text": "me like that's be on peacock where I was going yeah budgets you know what I mean yeah I think it's probably the right move to make a movie at the low budget for this type of thing actually make the money back be a success I I mean I agree that like yeah like but I feel like a lot of these horror movies have that vibe and um what did he direct before cuz he I know he did Shazam but then before that like what got him Shazam was a bunch of really good horror movies I'm going look this up this is why I'm not playing who was the man who is the actor that that I recognize lights out people saying lights out horror movies I don't think you should did Shazam maybe that's why it came out the way it did Annabelle Ouija lights out coming okay yeah some of the better Conjuring movies yeah again what so what I'm saying is at first glance I was looking at it going like me I don't like this doesn't look high quality but then the concept seems cool and one of the women in the movie I was like I",
            "start": 718.32
        },
        {
            "text": "so what I'm saying is at first glance I was looking at it going like me I don't like the this doesn't look high quality but then the concept seems cool and one of the women in the movie I was like I recognize you from some picture I've seen before Peter Serafinowicz of course I know John Wick okay The Fargo but yeah I never saw Fargo also uh big too right they're nihilists Donnie um yeah I I like the idea I like the video gameification of it of just like they coming back and all that I think it's pretty a smart way to do a video game movie yeah not just making a horror movie like here's the game that was inspired by horror movies but since you're not making choices anymore it's just a horror movie again I like that idea that's cool yeah I wonder how they W how you wrap that up in a story different genres they're saying kind of interested in that I could actually mean it's going to be like a Saw movie like a Bigfoot movie like an Annabelle movie like you know I think I",
            "start": 757.72
        },
        {
            "text": "up in a story different genres they're saying kind of interested in that I could actually mean it's going to be like a Saw movie, like a Bigfoot movie, like an Annabelle movie, like you know I think I think that I think you go that way yeah those genres does that feel appropriate for the Until Dawn universe that seems kind of a step away right no I totally think that seems I mean we're playing fast and loose here right when you just talked about Until Dawn right we're talking about Until Dawn and then what two VR games uh but I would say really we're talking about Supermassive right and we're talking about Supermassive right every one of the Supermassive games kind of does jump genres and stuff and what it's doing with horror what what are you laughing at over here uh Cameran just said did he just say Bigfoot one of the classic horror icons Bigfoot you understood what I meant though you know monsters you know what's up come on now yeah and Bigfoot's horrifying when you think about it",
            "start": 798.4
        },
        {
            "text": "he just said Bigfoot, one of the classic horror icons. Bigfoot - you understood what I meant though. You know monsters... you know what's up. Come on now. Yeah, and Bigfoot's horrifying when you think about it. So this movie is coming very very soon. I think it's interesting that instead of dropping a trailer they did drop this kind of like a little bit more behind the scenes. Let's explain what this is - hey, that's helpful right? I'm getting People Like Us on board so when we do see the trailer we can explain it to somebody who's a novice to what Until Dawn is or hasn't been paying attention to the Video Game World. Yeah, so far I've liked not loved but liked I think all of the PlayStation movies that they've made. Uncharted - hold on, hold on. I can hear it - the audience is calling for PlayStation in review. They're not are you going to give it a Simp... not gr Turismo. Uncharted until Until Dawn. Let's go put him on the list. Let's rank him. Ragu - bagu remember that? Remember the bad guy from Gran Turismo. I sure don't but",
            "start": 832.96
        },
        {
            "text": "not are you going to give it Simon not Greg Turismo Uncharted until Until Dawn let's go put him on the list let's rank him Ragu bagu remember that remember the bad guy from Gran Turismo I sure don't but I know there was somebody who was a bad racer r or maybe maybe they respected each other at the end I forget what it was this movie is coming out April 25th so yeah two days before my birthday a little time yeah yeah yeah yeah interesting stuff we'll see I'm hopeful I'm hopeful too again I think it's a very cool concept and I think that's what I want out of a horror movie I've watched a lot of horror movies that are not filmed like give me a good movie I what's a movie that people like people like Schindler's List I've seen a lot of horror movies that don't look like they're going to win an Oscar you know what I mean but it's like okay I can enjoy this and I get down the concept this seems like a cool concept I hope it works yeah okay cool cool that's it all right good talk they didn't",
            "start": 872.16
        },
        {
            "text": "Oscar, you know what I mean, but it's like okay, I can enjoy this, and I get down the concept. This seems like a cool concept. I hope it works. Yeah, okay, cool, cool. That's it, all right. Good talk. They didn't give us much. I thought they were going to give us more to talk about, but cool. I yeah, I like, like the idea that they're bringing in The Hourglass right from the logo. You we don't see anybody really do anything with that. No, cool. All right, that's it for Story number one. Everybody thank you. Greg this has been a fun show so far, guys. Story number two: Get my water bottle. Talk about how good dinner was. Uh, Donkey Kong Country Returns HD gets a review Roundup here has a Metacritic of 77 currently open critic of 78. Logan Plant at IGN gives it an 8 out of 10 saying Donkey Kong Country Returns HD is a possible remaster of an amazing platformer. More modern improvements and a larger graphical update would have been nice, but this is still one of the greatest 2D Platformers Nintendo has released this.",
            "start": 915.2
        },
        {
            "text": "possible remaster of an amazing platformer more modern improvements and a larger graphical update would have been nice but this is still one of the greatest 2D Platformers Nintendo has released this Century uh Alex from Nintendo Life gave it a seven out of 10 Donkey Kong Country Returns HD is a fine way to play the 2010 original but it's also lacking any real reason for fans to double dip Beyond waggle free controls it's less of a remaster and more of a port to be honest which would be all well and good if it wasn't being sold at such a premium there's plenty of fun to be had but we can't help but walk away from it with a slightly sour taste in our mouths Our advice grab the superior Donkey Kong Country Tropical Freeze instead uh Steve Watts at GameSpot also gives it a 7 out of 10 saying the 2010 franchise Revival gets a makeover and some Modern conveniences but while difficulty spikes make it tough to recommend for anyone but the most dedicated DKC fans Paris have you are you",
            "start": 958.64
        },
        {
            "text": "saying the 2010 franchise revival gets a makeover and some modern conveniences but while difficulty spikes make it tough to recommend for anyone but the most dedicated DKC fans Paris have you are you playing this do you have it yet no I don't have it yet have you played the original yeah yeah I played the original um I am playing this mhm I uh I'm playing I the final boss right now the final boss very difficult if you remember so kicked my ass a little too many times but um I would give Donkey Kong Country Returns HD a score out of 10 as well I'm right there with IGN and GameSpot on this um I love the original but only in the context of when it came out and the time and like platforming around it mainly because Tropical Freeze is so much better in every single way I think um and this game the version solves many of the issues that the original had um the issues being it was on the Wii and Nintendo loved putting horrible gimmicks into games on the Wii that legitimately I feel like almost",
            "start": 997.88
        },
        {
            "text": "version solves many of the issues that the original had, um, the issues being it was on the Wii and Nintendo loved putting horrible gimmicks into games on the Wii that legitimately I feel like almost across the board you could remove the gimmick from the Wii game and it's a better game, yeah, um, and age has shown that and I think it's specifically with Donkey Kong Country Returns HD mechanics like the blowing where Donkey Kong just needs to blow on things, it's horrible, it's never fun in the game, it never feels good, it doesn't feel like it's doing anything useful for adding to the gameplay or the experience at all, um, so it's still being there kind of a bummer, the original game having waggle controls for the roll one of the most bizarre gameplay choices for a precision platformer that I've ever experienced, so getting rid of that makes this game better just from the jump, um, but yeah, so what are your memories of playing Donkey Kong Country Returns of the original, I mean, it's kind of",
            "start": 1047.0
        },
        {
            "text": "ever experienced so getting rid of that makes this game better just from the jump um but yeah so what are your memories of playing Donkey Kong Country Returns of the original I mean I it's kind of like you said I enjoyed it for the time because during that time period of the Wii the waggle controls and all the gimmicks made sense because we had never really seen that before but it got old pretty quick yeah so to at least remove the waggle but keep that part yeah I like you said 7 out of 10 sounds like what this should be but it almost excuse me it almost feels like hey let's just get this remaster out because we know we're about to go to Switch 2 and about to do a whole bunch of different things let's just get it on that platform yeah so I'm I'm conflicted in a lot of ways like because I think that the quality of the game in terms of level design and what's actually here is higher than a seven out of 10 but I do think that this package for this version in particular uh the price out",
            "start": 1094.4
        },
        {
            "text": "think that the quality of the game in terms of level design and what's actually here is higher than a seven out of 10 but I do think that this package for this version in particular uh the price point is the big thing absolutely outrageous it does also add the so the the original game came out on the Wii in 2010 then they ported it to the 3DS and got rid of the waggle and added I think like eight levels this version looks better than both of those and includes all of the levels from from both versions which is great in some ways though there's visual downgrades from the original Wii version some of the uh effects are gone like some of the coloring just doesn't feel authentic to what the original looked like so not everything is better but I'd say overall this is the better looking game so it's and I think you even said in then the Roundup so it's kind of fair to say this is really more of a port where they fix some things that they could but this isn't a true remaster of the game yeah",
            "start": 1140.64
        },
        {
            "text": "and I think you're even saying in then the Roundup so it's kind of fair to say this is really more of a port where they fix some things that they could but this isn't a true remaster of the game yeah I mean the fact that the original was on Wii and looking at this like there's no way to say it's not a remaster it very much is you know it's uh the in any way that you can graphically improve it compared to the Wii like they did it's just I don't think that every Improvement actually is an improvement you know what I mean like just cuz something's technically better does it make it artistically better um and I think that that's something that is very true about a lot of uh Nintendo games couple interesting things here though Donkey Kong Country Returns was announced at the first D3 I ever went to which is just crazy to think about the time and then Paris realized how old I am because there's been less time between the original release of Donkey Kong country 3 on the Super Nintendo to",
            "start": 1182.72
        },
        {
            "text": "to which is just crazy to think about the time, then Paris I realized how old I am because there's been less time between the original release of Donkey Kong Country 3 on the Super Nintendo to Donkey Kong Country Returns than the original release of Donkey Kong Country Returns and this version right now, yeah, which is 5,169 days, crazy stuff man. I hate that. I hate that also where's our new Donkey Kong Country games? You know it's funny driving in with Greg this morning I was even saying that that of and I know we're getting into Switch news here but that's what I want to see I want a new Donkey Kong, I mean it it's time. And you know Tropical Freeze was really Wii U right 2013 yeah yeah yeah so it's that's 12 years so yeah it's it's time 2014 yeah I want I want a new Dunky Kong game it's uh man and Tropical Freeze is absolutely amazing and that's another thing Tropical Freeze had David Wise the composer of the original games back and blew it out of the",
            "start": 1218.4
        },
        {
            "text": "want a new Donkey Kong Country game it's uh man and Tropical Freeze is absolutely amazing and that's another thing Tropical Freeze had David Wise the composer of the original games back and blew it out of the god blew it out of the park you get what I'm saying uh knocked it out of the park blew it out of the water um this one didn't have David Wise and the sound jack still good but does not hold a candle to Tropical Freeze and I think that's kind of what the biggest problem about this game is that Tropical Freeze exists and is cheaper and I think that there's a ton of PE I know there's a ton of people out there that haven't even played Tropical Freeze and if you're choosing between the two play Tropical Freeze I think that's an absolute no-brainer from any perspective you look at having said that there's a great game here I think that this game represents it's worth your time definitely worth your time it's not worth $60 um but it is uh definitely worth your time it is brutally difficult in",
            "start": 1265.6
        },
        {
            "text": "a great game here I think that this game represents a it's worth your time definitely worth your time it's not worth $60 um but it is uh definitely worth your time it is brutally difficult in a lot of ways to an extent that they didn't need to go that hard like it the most of the game feels very modern compared to the original games where it is uh a little easier a little bit more about the adventure than anything but then you get to a certain point and some of the levels are just frustratingly difficult um and I I can see a lot of people kind of giving up on the game and like not like just putting down being like I'm not having fun anymore because of these uh Barrel rocket levels um very Flappy Bird inspired which is not necessarily what you want from from a game of this Prestige right so some of the boss fights very uneven some of them are very cool and interesting but I feel like over half of them are probably like I didn't really enjoy my time with that let me get back to the the",
            "start": 1303.36
        },
        {
            "text": "some of the boss fights are very uneven, some of them are very cool and interesting, but I feel like over half of them are probably like me didn't really enjoy my time with that. let me get back to the platforming levels because the platforming levels are great. um this comes from an era where I feel like the birth of the cinematic 2D platformer kind of started and um this game is a great example of it, like every single level has its own unique uh locations and vistas and ways that you're like platforms you're interacting with and enemy variety and just gimmick but in a good way. um and I I really feel like the team over at retro uh back then played like the Uncharted games, the original Uncharted games are like okay, but what if we added that energy to a Donkey Kong game, and what I really love about uh returns in particular is things like you're seeing right here he's a giant ape they treat him like an ape, you know he's not just a plumber jumping around on things it's like just because",
            "start": 1346.88
        },
        {
            "text": "about uh returns in particular is things like you're seeing right here he's a giant ape they treat him like an ape you know he's not just a plumber jumping around on things it's like just because there's similar similarities with other Platformers like there's a bigger emphasis on like grabbing and climbing and swinging and things like that um that I just feel like really kind of you can see the love that Retro had after making the Metroid Prime series and just being like all right we took a 2D Metroidvania like exploration based game and how do we turn that into a 3D Adventure but keep the spirit of it with this you could really tell they're like all right how do we keep the the what made the Donkey Kong Country game so special in what they were the essence of them but how do we make it more modern and actually like lean into what Donkey Kong can uniquely bring to gameplay and uh they did a great job with it and playing this game um for as many faults as I have with this version of",
            "start": 1391.2
        },
        {
            "text": "more modern and actually like lean into what Donkey Kong Country Returns can uniquely bring to gameplay and uh they did a great job with it and playing this game um for as many faults as I have with this version of it and the price and all that stuff the actual game design is impeccable yeah and I kept thinking like man I'm looking forward to see what Retro does next like Metroid Prime 4 like we're we're supposedly getting it this year like to the team over there just gets creativity and gameplay so much better than most other developers that I'm looking forward to see anything that they work on but anyways it great to go back to one of these Platformers because uh this is a classic at this point and I do love it I just think that it is a really good example of um sometimes when a better version comes out later it can kind of take the place of it and feel like all right Donkey Kong Country Tropical Freeze is a must play this is uh if you really like Donkey Kong Country Tropical Freeze maybe you get this on sale and play through it later type deal so do",
            "start": 1434.2
        },
        {
            "text": "kind of take the place of it and feel like all right Donkey Kong Country: Tropical Freeze is a must play this is uh if you really like Donkey Kong Country: Tropical Freeze maybe you get this on sale and play through it later type deal so do you think this is and I agree everything you're saying but you think this is more of a thing of Nintendo looking at a game like this they don't want it to be lost to that era let's bring it to this era because it still holds up I agree with you on price I think it it probably should have been like $39.99 or something like that but at least now it's on the platform so now even when we go into Switch 2 with the backwards compatibility you're going to be able to pick this up in a few years and keep playing look I'm personally Tim Gettys I'm very happy that this game is on the switch I I think that it is a great classic platformer um zgm says I think this is still a must play but Donkey Kong Country: Tropical Freeze is just a perfect game I trust me I have so much love for this game but playing through it I've been",
            "start": 1483.28
        },
        {
            "text": "It's a great classic platformer, um. ZGM says, \"I think this is still a must-play,\" but Tropical Freeze is just a perfect game. I trust me; I have so much love for this game, but playing through it, I've been bouncing back and forth just to go like to Tropical Freeze and see it's like it's crazy how much better Tropical Freeze is. Like, I don't even think there's a question in terms of bosses or even the things this game does great; Tropical Freeze just does that much better. Um, but yeah, I agree with you that in terms of game preservation, it's awesome, and I want to see because I wouldn't want this game stuck on the 3DS or even worse, the Wii, with its wacky controls and stuff. So, yeah, like that's awesome, but the pricing structure is just totally out of whack for what they're offering here. Um, and I also think that there were some things that they could have improved even more, like they add a modern mode that kind of can make things a little easier for people.",
            "start": 1525.96
        },
        {
            "text": "They're offering here um and I also think that there were some things that they could have like improved even more like they add a modern mode that kind of can make things a little easier for people but the Nintendo games are really good at adding a ton of options to make the games accessible to people of all ages or or anything to be able to play through um and I feel like they could have even went harder with uh making this easier for some people cuz some of these levels are just absolutely brutal um but anyway that's Donkey Kong Country Returns HD Story number three is something we're going to talk about right after a word from our sponsors this episode's brought to you by MeUndies at some point in our illustrious love lives we've all asked our partner the same age-old question that guys have probably been asking for thousands of years am I big while MeUndies doesn't know the actual answer to that or if your partner gave you the actual truth this Valentine's Day they can help you",
            "start": 1565.68
        },
        {
            "text": "Have probably been asking for thousands of years, am I big? While my unis doesn't know the actual answer to that or if your partner gave you the actual truth this Valentine's Day. They can help you look huge with their contoured pouch and ball caddy. Choose from tons of awesome Valentine's Day prints and styles and match unis with your special someone for an extra special holiday treat. From all black classics to fun expressive prints, MeUndies has a look for everyone. Y'all know I love MeUndies - all my black t-shirts are MeUndies, including this one I'm wearing right now. Uh, try MeUndies out and if you're not happy with your first pair of undies, it's on me. MeUndies this Valentine's Day: good things come in big packages at MeUndies. Get 20% off your first order plus free shipping at MeUndies.com - KindaFunny that's MeUndies.com KindaFunny for 20% off plus free shipping.",
            "start": 1614.4
        },
        {
            "text": "MeUndies.com - Kinda Funny for 20% off plus free shipping. MeUndies, Comfort the outside in. This episode is brought to you by ExpressVPN. Going online without ExpressVPN is like not closing the door when you use the bathroom, even if you think you have nothing to hide. Why give random creeps a chance to invade your privacy? Internet service providers, including mobile network providers, know every single website you visit. ExpressVPN reroutes 100% of your traffic through secure encrypted servers so your ISP can't see your browsing history. It hides your IP address, so it's even harder for third parties to track your online life. It's so easy to use - you just fire up the app and one click gets you protection, and it also works on phones, laptops, and more. I use ExpressVPN everywhere because it gives me so much peace of mind that I can explore the internet safely. Protect your online privacy today by visiting expressvpn.com Kinda Funny. That's ExpressVPN.com Kinda Funny, and you can get an extra 4 months free with our link.",
            "start": 1663.8
        },
        {
            "text": "gives me so much peace of mind that I can explore the internet safely protect your online privacy today by visiting expressvpn.com Kinda Funny that's expressvpn.com Kinda Funny and you can get an extra 4 months free expressvpn.com Kinda Funny for an extra 4 months free this episode's brought to you by BetterHelp what do you want your 2025 story to be every January brings you 365 blank pages waiting to be filled in in 2025 maybe you're ready for a plot twist or maybe there's part of your story you've been wanting to revise life isn't about resolutions that fade by February it's about picking up the pen and becoming the author of your own life think of therapy as your editorial partner helping you write new chapters and create the meaningful story you deserve to live some of my best friends use BetterHelp and love how helpful it can be for learning positive coping skills and how to set boundaries if you're thinking of starting therapy give BetterHelp a try it's entirely",
            "start": 1715.72
        },
        {
            "text": "best friends use BetterHelp and love how helpful it can be for learning positive coping skills and how to set boundaries if you're thinking of starting therapy give BetterHelp a try it's entirely online designed to be convenient flexible and suited to your schedule and it serves over 5 million people worldwide Write Your Story with betterhelp visit betterhelp.com kindafunny to get 10% off your first month that's betterhelp.com/kindafunny and we are back everybody with Story number three close the to I'm having a bad day y'all I'm I apologize I don't know why I was just saying like my brain's not hitting the right it needs to uh even in that statement what the hell did I just say um Story number three everyone is Assassin's Creed games and Metal Gear Solid Delta are tipped for a Switch 2 release so many switch rumors Paris oh yeah what exciting time this comes from Tom Ivan at VGC Ubisoft is reportedly",
            "start": 1765.72
        },
        {
            "text": "and Assassin's Creed games and Metal Gear Solid Delta are tipped for a Switch 2 release, so many Switch rumors. Paris, oh yeah, what exciting time this comes from Tom Ivan at VGC. Ubisoft is reportedly working on half a dozen Switch 2 games while Metal Gear Solid Delta: Snake Eater has also been tipped for release on Nintendo's unannounced console, that's according to Industry Insider Nate the Hate who has a strong track record of breaking news prior to its official announcement. The latest episode of their podcast claims Nintendo Switch 2 will be revealed this Thursday, January 16th, ahead of a possible launch in May or June 2025. Uh, it goes on to discuss a number of third-party games reportedly to be released for the console including Final Fantasy VII Remake in 2025 and its sequel Rebirth in 2026. One title that will be there within the launch window comes from Ubisoft and it's going to be Assassin's Creed Mirage, uh, Assassin's Creed: Shadows which will be released for uh PS5 Xbox Series and",
            "start": 1818.96
        },
        {
            "text": "One title that will be there within the launch window comes from Ubisoft, and it's going to be Assassin's Creed Mirage. Uh, Assassin's Creed: Shadows which will be released for PS5, Xbox Series, and PC in March following a recent delay is expected to come to Switch 2 at a later date. Quote to my understanding, Assassin's Creed: Shadows is one of those in-development ports; it just won't be ready for launch and it probably won't be ready for the launch window. It was claimed I've been told that Ubisoft's doing more than half a dozen games for the Switch 2, and a lot of them are going to be late ports. These are from a range of franchises like The Division in Rainbow Six Siege. There was also some discussion and consideration of doing a Mario & Rabbids collection so it would have one and two in a single package. Some other third-party games I've heard include Metal Gear Solid Delta, which is coming out in 2025; right now it lacks a release date for all platforms, and I'm hopeful that that maybe it's a",
            "start": 1862.72
        },
        {
            "text": "Metal Gear Solid Delta, which is coming out in 2025 right now, it lacks a release date for all platforms, and I'm hopeful that maybe it's a day-and-date release when it does come to Switch, because if that game lets say comes out in the summer of 2025 there's no reason it shouldn't be day-and-date. Where do you want to start? I'm excited uh for the Switch too um, and a lot of it comes down to that you're hearing these third-party publishers committing to it so of course we know we're going to get an amazing first-party lineup for the Switch to but to see Ubisoft is bringing Assassin's Creed games there, Metal Gear going to potentially be coming there along with I know there's rumors about Xbox and the stuff that they're going to bring there as well it's exciting it tells me it's probably going to be more powerful than we realize or they're doing some magic under the hood with Nvidia and DLSS or whatever but we're going to",
            "start": 1902.8
        },
        {
            "text": "to bring there as well it's exciting it tells me it's probably going to be more powerful than we realize or they're doing some magic under the hood with Nvidia and DLSS or whatever but we're going to we're going to get we're going to get a lot of games like it's almost crazy to think the Switch might be the the console of of you know when it comes out this year like that's where all the games are going that's going to be the thing the must have Hardware to have because all the games are going to be there yeah I mean that's Nintendo baby it is interesting like I I do think that it's going to be uh I I've been saying for a while I think that we're going to be getting a lot of the third party games on Switch I keep championing Elden Ring I think it's will be there and I think it'll be a big deal for Nintendo but I don't think it's going to be like I still think at the end of the day it's going to be the least powerful system and it's still yeah exactly and it's still going to not be",
            "start": 1946.0
        },
        {
            "text": "big deal for Nintendo but I don't think it's going to be like I still think at the end of the day it's going to be the least powerful system and it's still yeah exactly and it's still going to not be the place that that people that are already on PS5 or Xbox are going to want to play these third party games but I do think that there is a very very large audience that we clearly see of Switch owners that don't own the other consoles that now might play Metal Gear Solid Delta or some of these Ubisoft games or whatever very interested to see how they run what it looks like um and if the DLSS and all that stuff can actually get things where they need to be I'm hopeful though I feel like where the timing of the Switch 2 coming out is a good place uh in terms of technology in terms of where the advancing techs are and uh being so far into this like handheld race that we are and Nintendo obviously having such a leg up in um consumer base and also just kind of output uh what they've had with",
            "start": 1987.04
        },
        {
            "text": "advancing techs are and uh being so far into this like handheld race that we are and Nintendo obviously having such a leg up in um consumer base and also just kind of output uh what they've had with this success of the Nintendo Switch since 2017 um I think just it's a great time Metal Gear Solid that that would be rad to have right um and even just the support of Ubisoft, Ubisoft traditionally has supported Nintendo consoles like uh I mean infamously right even the Wii U right we did get uh Assassin's Creed as a launch title um and uh in addition to that they did put Assassin's Creed 3 and like all those um era games so I feel like the Ubisoft's not so much a surprise but even thinking about it Assassin's Creed Mirage that does give us an idea of the power yeah yeah and that's think yeah and the fact that they're talking about Final Fantasy VII remake and rebirth coming there and then like what even Assassin's Creed Shadow right ex they say as well so it tells me look like you said it's going to",
            "start": 2028.68
        },
        {
            "text": "that they're talking about Final Fantasy VII Remake and Rebirth coming there and then like what even Assassin's Creed: Shadow right, ex they say as well so it tells me look like you said it's going to be the least the least powerful we understand that there'll probably be some degradation of of visual quality or fidelity but the thing excites me the most would be from a third party standpoint is we know Ubisoft already supports it we know Xbox is starting to support it as well is these cross platform saves so let's say I am playing Assassin's Creed on my PC and I'm I'm about to leave and go I can pick up my progress and take it with me on the go with the Switch too that'll be highly appealing for a lot of third party games my op yeah yeah and yeah there's so much exciting stuff coming from this and I I again I do think that it's uh very important to look at third parties and Nintendo and just the fact that this might be the first time since the GameCube there's been any level of parity",
            "start": 2076.8
        },
        {
            "text": "this and I again think that it's very important to look at third parties and Nintendo and just the fact that this might be the first time since the GameCube there's been any level of parity between PlayStation, Xbox, and Nintendo in terms of game releases um and with the success that the Switch has had and continues to have I mean even just putting out Donkey Kong Country Returns now like they've been putting out games constantly uh throughout the last year and a half um way longer than I expected but I am of the camp now like I keep seeing online people getting upset at Nintendo for not announcing the Switch 2 and I think that's kind of silly where it's just like yo we know it's coming like they're still putting the games out for the switch I'm ready for the new hardware I there's nothing I'm more excited for than the Switch completely agree I do get some of it because I I'm guilty of it as well of in the sense that look we know Nintendo's on their own",
            "start": 2122.64
        },
        {
            "text": "new hardware I there's nothing I'm more excited for than the Switch completely agree I do get some of it because I I'm guilty of it as well of in the sense that look we know Nintendo's on their own time they're going to announce when they want because it doesn't matter we're all going to buy it anyways right but I I I don't like finding out all this info through I I I wish there weren't it really just comes down to the leaks I wish there weren't leaks so the fact that we've seen the motherboard now obviously Nate Hay announced all this game stuff it's like man I really wish we would have gotten that in a presentation versus getting that through a a forum leak or whatever it was a podcast yeah me too for sure but I also just feel like at the end of the day like that stuff isn't the exciting stuff you know what I mean like the excited stuff is going to be seeing the next 3D Mario and all that so God but yeah know I I'm I we might be two days away from a Switch 2 announcement so I'm",
            "start": 2168.68
        },
        {
            "text": "Stuff you know what I mean like the excited stuff is going to be seeing the next 3D Mario and all that so God but yeah, know I, I'm, we might be two days away from a Switch 2 announcement, so I'm very, very excited. Stay tuned here obviously if anything is announced Kinda Funny is going to be here reacting uh and going freaking crazy I'm sure um We got some super chats here DJ Kento says do you think the Switch 2 will get Cyberpunk and if so run it better than Steam Deck? I do think it'll get Cyberpunk, I don't think it'll run better than Steam Deck no I I I mean no I wouldn't I wouldn't think so yeah but I mean because think about it The Witcher 3 is on the original Switch so I would imagine that they'd get Cyberpunk running on there um Story number four Microsoft is reportedly going to reveal a new entry in a legendary Japanese franchise next week, this comes from George Yang at GameSpot. Microsoft is reportedly announcing a new entry in a quote legendary Japanese IP during its",
            "start": 2209.84
        },
        {
            "text": "Microsoft is reportedly announcing a new entry in a \"legendary Japanese IP\" during its Xbox developer Direct on January 23rd, along with this new game Microsoft will also show off Doom: The Dark Ages CLA (Obscure EXP Edition) and South of Midnight. According to Windows Central, this IP has decades of history and should make a lot of fans happy. The phrasing is rather vague so fans have been speculating what the game could be. I am very excited for multiple reasons; I think Xbox has done a great job with its developer directs - um, I feel like every year has something cool or interesting and I like that they're continuing here straight up saying \"hey you're getting it\" a big game announcement like a returning game announcement cool let the speculation begin but on top of that confirmed South of Midnight Expedition 33 Doom: The Dark Ages games that we're excited about like we're going",
            "start": 2258.44
        },
        {
            "text": "like a returning game announcement cool let the speculation begin but on top of that confirmed South of Midnight Expedition 33 Doom The Dark Ages games that we're excited about like we're going to get to see more that's very very cool oh completely agree I mean I'm you know I got to see South of Midnight already so I'm I think people definitely should put that on their radar um do Doom is Doom yeah we already know that's going to be amazing that Expedition 33 really caught me by surprise when when we got to see that so definitely looking to hear more about that and then this mystery game that's coming out Japanese origin whatever obviously whatever the rumors you're saying let's see let's see I you know I don't think I would set expectations that it's not going to be the Super major big thing but I think it'll be a pleasant surprise like people like oh okay I can't wait to play this kind of thing you know yeah yeah I mean like there's so many things it could be",
            "start": 2302.6
        },
        {
            "text": "The First Teaser for the Until Dawn movie is here.",
            "start": 2350.44
        },
        {
            "text": "The worst thing is when it's like, \"Well, who's this for?\" You know? My gut tells me whatever this is going to be, we're going to know who it's for. Now, I doubt this is it, but I would love it because they said it's an unannounced Japanese IP. I would love for Xbox to go back into their own lineage and bring back Lost Odyssey or bring back a Blue Dragon, something like that. I would love to see something like that. I don't think it's going to be, but do you think that that would hit with people? I think it would for the legacy Xbox people – people who have been around since the 360. It would correct mean were those games well received? I think Lost Odyssey was Blue Dragon was kind of a Hit or Miss, yeah, yeah. Okay, that would be interesting. Yeah, I mean especially with where Xbox is at currently, like they have so much IP, but the one thing with Xbox that they still haven't completely nailed is more Japanese IPs on that platform. I mean, I know that's something I talked to Phil Spencer about before.",
            "start": 2395.4
        },
        {
            "text": "they have so much IP they got so much IP but the one thing with Xbox that they still haven't completely nailed is more Japanese IPs on that platform I mean I know that's something I talked to Phil Spencer like 5 years ago about that and that was something that was very important to him which then they get tangled and they close it so it's like what the hell but yeah they they need more Japanese IPs on Xbox I think that'd be very well received I I mean look legendary Japanese IP new entry I feel like one of the go-tos right now just thinking about okay what could it be and what are we expecting what are we waiting for an announcement of Persona 6 yeah obviously I think is uh the the easiest jump to point they're not going to do that here Persona 6 like especially after Metaverse and everything like Persona 6 would be I think a showcase Premier placement uh type thing right um but again going back to the the placement of it all like last time we had a Developer Direct I think we got some",
            "start": 2436.48
        },
        {
            "text": "like Persona 6 would be I think a showcase Premier placement uh type thing right um but again going back to the the placement of it all like last time we had a developer direct I think we got some Indiana Jones stuff like yeah and and here we're getting south of midnight and and doom like yeah I really like that these don't just need to be the smaller titles it's cool when it is smaller titles like Pentas and things like that but I mean to be getting an update on on I just love that Xbox has enough stuff to talk about throughout the year at this point that they can have things that aren't just the summer showcase uh that we all expect major announcements but we're still getting announcements in January yeah yeah I know it's cool cuz yeah last year was AOW Indiana Jones I think it was ARS: History Untold and then and you know it was Visions of Mana and I'm missing something else it was another game too I think that five last year that was great I mean obviously AOW got delayed and it's",
            "start": 2481.76
        },
        {
            "text": "history Untold and then you know it was Visions of Mana and I'm missing something else it was another game too I think that five last year that was great I mean obviously AOW got delayed and it's coming out next month but yeah those were major titles that they were able to show um think about even this year we know Outer Worlds is coming because I drafted it is not in this Dev direct yeah we know Fable is coming this year because I drafted it it's not in this Dev direct you know they got Call of Duty and all that stuff so they got a ton of IP I am most excited for South of Midnight I I am too everything I've seen that game I'm like oh this looks I mean I you know Again full disclosure I I went to Compulsion I got to sit down with the team got to see the game got to talk to the game director whole team all that they're very passionate about it and it looks like this is a love letter to the Deep South that's what this game is",
            "start": 2526.4
        },
        {
            "text": "to see the game, gotta talk to the game director, whole team, all that. They're very passionate about it, and it looks like this is a love letter to the Deep South. That's what this game is - all the folklore, the legends, everything of the Deep South is what South of Midnight's going to be. The artwork is incredible; in it, the music is fantastic. Even just the basic sounds - like they went down there and captured like the sounds of the South. Like when they were showing it to us, and I go, \"Oh yeah, that sounds like something.\" Cuz I grew up in the South, you know what I mean? It's gonna be good. I think people should definitely have it on their radar. I am hoping it comes out in the first half of this year; I kind of think it will. You said that uh at some oh my God, that excites me cuz like I for some reason I was surprised when you even got to go see it. I was like, \"Oh when we seen this game the past,\" I was like, \"I thought that that it was going to be uh like way down the line.\" Like I thought",
            "start": 2567.84
        },
        {
            "text": "Some reason I was surprised when you even got to see it. I was like, \"Oh, when we saw this game in the past, I thought that it was going to be way down the line.\" Like, I thought it was, \"Hey, look at this game we're working on,\" but uh, no, okay, cool, we're getting close. So, in the chat, someone's saying April. I mean, man, yeah, I mean that wouldn't shock me at all because what got to see playable? I mean, it looked ready; you know, a couple of kinks here and there, but it was very playable. To the fact, I'm like, \"Oh, man, this game's coming soon.\" Yeah, that was my first thought when I saw it. Very cool. Robbie Rob super chats in saying Sonic is a legendary Japanese franchise; it's not going to be Sonic. That Sonic has more than enough places to do their own announcements at this point, like they're Sonic centrals and all that. So, and also we just literally got Shadow the Hedgehog: Shadow the Hedgehog Generations. I think we're a little off from the next announcement.",
            "start": 2614.56
        },
        {
            "text": "at this point like they're they're Sonic Central and all that so and also we just literally got Shadow Sonic Shadow Generations like I think we're a little off from the next announcement dude 123 says in new Castlevania I think it's about that time it's always about that time you know what I mean one day one day we're going to get a Castlevania I don't think it's I don't think this one's going to be Castlevania that's still Konami right yeah yeah yeah so I mean that is legendary Japanese IP though um God that could mean so many different things um trying to think of like what I hope it is I mean at the end of the day I hope that it's something I'm interested in and there's a ton of things that could be but like if it's Dragon Quest like cool I'm happy for you Jared Penny but I'm not happy for me you know um let's move on to Story number five The Witcher 3 director reveals new open-world RPG the Blood of Dawnwalker this comes from Andy Robinson at VGC a group of lead developers",
            "start": 2656.6
        },
        {
            "text": "Happy for me, you know. Um, let's move on to Story number five. The Witcher 3 director reveals new open-world RPG, The Blood of Dawnwalker. This comes from Andy Robinson at VGC. A group of lead developers behind The Witcher 3 have revealed their new RPG, The Blood of Dawnwalker, developed by a new Polish studio, Rebel Wolves, which is cool as hell and published by Bandai Namco. Uh, The Blood of Dawnwalker described as a single-player open-world dark fantasy action RPG. What a genre! I'm all in on this. I mean, getting to see this early reveal on it, looking at the lineage of the people that are making it, sign me up. I'm day one for me and uh has a strong focus on story and narrative. The being developed with Unreal Engine 5 for PC, PlayStation 5, and Xbox Series X and S. A debut trailer was published on Monday with a full gameplay reveal planned for the summer. Uh, you play as Cohen, a young man turned into a Day Dawn Walker forever treading between the world of day and the realm of night uh",
            "start": 2698.2
        },
        {
            "text": "on Monday with a full gameplay reveal planned for the summer uh you play as Cole, a young man turned into a Daywalker forever treading between the world of day and the realm of night uh synopsis for the game reads use your skills and combine vampiric strength with human resolve as you take on a quest to save the ones you love face your foes be they human monster or the ticking clock itself but remember the real evil may bask in the Sun's light and the most loyal of allies could lurk under the cover of night Rebel Wolves is helmed by The Witcher 3's game director and head of production secondary game director for Cyberpunk 2077 uh the game director is joined at his new Warsaw, Poland-based studio by The Witcher 3's art director as well as a writer for The Witcher 3, Cyberpunk 2077, and Thronebreaker a design director for The Witcher 1 and an animation director for The Witcher 3 I mean kind of an All-Star team oh yeah we've seen this happen a couple times where like very very",
            "start": 2748.04
        },
        {
            "text": "2077 and Throne Breaker, a design director for The Witcher 1 and an animation director for The Witcher 3. I mean, kind of an All-Star team. Oh yeah, we've seen this happen a couple times where like very very established uh members of incredible teams leave to do their own thing that's very similar almost a spiritual not successor but like in in the the vein of uh their previous work. Um and we haven't seen too many examples of succeeding yet which is true which is a bummer because I just think that like you know it's there's a lot of things to go into it whether it's budget resources of when you're known for making a game this big and then you make a game that tries to be that big it can kind of cause some issues but I think that it's good that this is backed by Bandai Namco. I feel like there's this what we're hearing and seeing so far seems like there's a bit more buying for it all oh yeah 100% I mean Again full disclosure they had reached out to me a few weeks ago about this so I knew this",
            "start": 2788.28
        },
        {
            "text": "what we're hearing and seeing so far seems like there's a bit more buy-in for it all oh yeah 100% I mean again full disclosure they had reached out to me a few weeks ago about this so I knew this was coming um but to your point you got you got have the people that made The Witcher 3 worked on Cyberpunk over at CD Projekt Red doing this you can even see in this that they are definitely taking some elements of The Witcher and putting this in there but then they're trying to spin it out and into its own unique thing with the day-night vampires and all that I guess the full gameplay reveal is going to be summer they said so I'm assuming probably Summer Game Fest or something like that yeah this really feels like a key event type but this looks like big AAA RPG open world I mean hey like you said they don't all hit I mean Kaltos Protocol is just screaming at me right now because you just thought that was a layup right so hopefully they're able to nail the gameplay on this it has a great",
            "start": 2834.44
        },
        {
            "text": "don't all hit I mean Killzone: Liberation is just screaming at me right now because you just thought that was a layup right so hopefully they're able to nail the gameplay on this it has a great story and uh again the people making it know what they're doing so we'll see yeah definitely I hope it's big though Paris I hope it's really big it's good specifically I need to ask am I big but that's a question for another time if I was looking for something small Paris where would I look you would go to our last story the Wii News Channel where we cover all the small news items you need to know about I will not apologize for the ad by the way it is one of my favorite things ever uh The Witcher: Sirens of the Deep coming to Netflix on February 11th what is this is this an anime spin-off of the Netflix Witcher show I think so yeah I I don't know just looking at the name I'm like that's what that sounds like I'm pretty pretty sure it's anime yeah uh Everhood 2 launches March 4th",
            "start": 2881.84
        },
        {
            "text": "of the Netflix Witcher show I think so yeah I I don't know just looking at the name I'm like that's what that sounds like I'm pretty pretty sure it's anime yeah uh Everhood 2 launches March 4th on Nintendo Switch and PC The Legend of Zelda: Wind Waker original soundtracks now available on Nintendo music I'm Still Loving Nintendo music Paris like it's I this drip feed is getting me cuz I'm like you know what I'm listening to today Wind Waker okay it just gives me an excuse to whatever they release I'm like I guess I'm going back Dragon R style question is Wind Waker on the Switch no it probably will be soon it's criminally not on the Switch Yeah it's that and Twilight Princess which got HD remasters or ports whatever on um the Wii U those are pretty much two of the last like five Wii U games that have not made their way to the Switch we got Xenoblade Chronicles X but they're remedying that that's coming out uh Nintendo Land um NES Remix and I think that's it mm let me know if I'm",
            "start": 2927.48
        },
        {
            "text": "that have not made their way to the Switch, we got those Xenoblade Chronicles X, but they're remedying that - that's coming out, uh, Nintendo Land, um, NES Remix and I think that's it, mm, let me know if I'm wrong everybody. Well, some oh Star Fox Zero, but let's let that **** thing die. I don't think there's a game I have more beef with than Star Fox Zero in the history of video games. Star Fox one of my favorite franchises and they just yeah, I know that's what they did. Um, Meagon Industries has announced a January 21st, 2025 release date for Lonely Mountain Snow Riders on Xbox Game Pass. Snowbike Mike is hype. Uh, Blizzard announced today the next season for Diablo 4 is Season of Witchcraft starting January 21st. 2K has announced PGA Tour 2k25 for Xbox Series X and S, PlayStation 5, and Steam. The standard edition of the game will be released worldwide on February 28th, 2025, and that's it all right, yeah, let's do you're wrong, let's see what we got wrong, nothing I'm, yeah, we got a couple things",
            "start": 2973.68
        },
        {
            "text": "standard edition of the game will be released worldwide on February 28th, 2025, and that's it all right yeah let's do you're wrong let's see what we got wrong nothing I'm yeah we got a couple things but I doubt I doubt it let's see all right we got um I appreciate this we got you're wrong that then you're wronged themselves for being wrong about that you're wrong uh Drew writes in says David Wise did actually work on at least a couple of tracks on Donkey Kong Country Returns and then he replies nope Tim was right never mind that's awesome uh but I think I think what he was saying was that uh a lot of the songs were originally composed by David Wise because they were just arrangements of the Super Nintendo music um in the new one uh Robbie Rob says for the power of the switch 2 and Assassin's Creed Mirage the game does run on iOS devices with the iPhone 15 same with Capcom games like Resident Evil 4 and Kojima's Death Stranding the thing about the I the iPhone comparison to me doesn't",
            "start": 3027.88
        },
        {
            "text": "Creed Mirage the game does run on iOS devices with the iPhone 15, same with Capcom games like Resident Evil 4 and Kojima's Death Stranding. The thing about the iPhone comparison to me doesn't fully add up because the iPhone is like a $1,000 plus device. Look, I'm an idiot, but I'm pretty sure my iPhone's more powerful than my Switch right by a long shot, like that's just how that works. I mean, hell, it can run Resident Evil 7 native. Yeah, it's like, yeah, iPhones are very, very powerful and very costly. The fifth gen game the fifth game at last year's Dev Direct Paris was missing was Hellblade 2. There you go, I knew I was forgetting something. Yeah, yeah, uh, yeah. There we go. Wow, pretty good. I'm are we just sufficient because I feel like we even went all the way to the end of the hour. Oh, we got some super chats too. Yeah, we're heading out, Paris, and also, is there anything you want to talk about? Um, can let me ask",
            "start": 3077.16
        },
        {
            "text": "all the way to the end of the hour oh we got I mean we still got some super chats too yeah we're heading out Paris and also thing is there anything you want to talk about um I mean can let me ask you this m because we're talking about the switch to stuff like my height level is really growing I truly hope this thing gets revealed this week and then they'll probably do some big game reveal later on what is the the game not that it has to come at launch but what is the game that you're looking forward to on switch 2 I mean I I am a Nintendo Fanboy through and through my entire life like I said I am not even close to as excited for anything as I am the switch 2 being shown um I I'm just it's easy I my whole thing with switch to is don't get cute just keep doing what's working that's what I say so with that yeah Mario Kart Mario 3D like those are the things seeing a new Mario Kart is going to get me incredible um and it's funny like we look back at the different generations of Nintendo",
            "start": 3122.28
        },
        {
            "text": "I say so with that, yeah, Mario Kart Mario 3D - like those are the things seeing a new Mario Kart is going to get me incredible um and it's funny. Like we look back at the different generations of Nintendo and I remember going from the Wii to the Wii U and when it was confusing and all that stuff to me I'm like, but at least it's HD. I love Nintendo and I love tech and I hate how behind they are on everything, but that jump to HD - I'm like I'm going to get to play Smash Bros in HD, it's not going to look like blurry, it's all **** muddy and just shitty looking, it's like it's going to be crisp and 1080 and I can't freaking wait for that. And then imagining oh my God we're going to get a a 3D Mario game that's like in in 1080, we're going to get a Smash Bros, a Mario Kart, a Metroid - and we didn't get a lot of those things, we got Mario Kart, we got Mario 3D World which is one of my favorite yeah uh ones but it's not like Odyssey right, it's not it's not what we expected to get from from the the the followup.",
            "start": 3168.4
        },
        {
            "text": "those things we got Mario Kart we got Mario 3D World which is one of my favorite yeah uh ones but it's not like Odyssey right it's not it's not what we expected to get from from the the the followup to um Galaxy and then uh we never even got the Metroid we never got the Metroid for years it's like oh retro is going to put out Metroid and they put out Tropical Freeze which I love but it wasn't Metroid right we're now getting Metroid so I'm just like all right it's the things are all finally happening and at this point it's like all right we're we're well into Nintendo being 1080 um not always but like I to me it's just like keep doing what you're doing give me play the hits that's what I want from Nintendo there's going to be a lot of surprises because that's what Nintendo does too yeah completely agree I mean my thing uh is I everyone's always wants Nintendo to to innovate something because they obviously they've done it over the years their track record is immaculate when it comes to",
            "start": 3217.36
        },
        {
            "text": "agree, I mean my thing uh is I everyone's always wants Nintendo to innovate something because they obviously they've done it over the years their track record is immaculate when it comes to that I don't think they need to do that this time I think you cracked the code you created a handheld device that can play AAA games but it also can be docked and played on your television it works clearly it's being cloned all around the industry at this point just give me a more powerful version of that continue these games that you're talking about mine is 3D Mario I personally as much as I love Odyssey it wasn't the followup that I wanted from Galaxy and I hope we get what they're not going to call it Galaxy 3 but I hope we get the true successor to Galaxy I mean you that's what I want it was our game of the year Astrobot right I mean real talk though like Astrobot is more a Galaxy sequel than like Odyssey is very much more like a Mario 64 sequel um and I love it all you know what mean I mean",
            "start": 3262.36
        },
        {
            "text": "game of the year astrobot right I mean real talk though like Astro Bot is more a Galaxy sequel than like Odyssey is very much more like a Mario 64 sequel um and I love it all you know what mean I mean I love it all I'm not complaining even if they just did a followup to Odyssey I'm not going to be upset by that but I I want that Galaxy 3 I I will never forget the first time I play Galaxy and I was like this is incredible yeah and I I just want more of it so that would probably be my most anticipated I'm I'm assuming we'll at least see it I'm leaning towards it's not at launch I think it'll be later but that's the game I want to see and to your point about cart I mean Cart obviously they won I mean that's my thing is I I'm firmly a 3D Mario at launch believer at this point um but it's either going to be Mario Kart or Mario um but like it's the evidence is stacking against me where I'm like I think it's going to be Mario Kart just based on what people are saying in my heart though I",
            "start": 3313.4
        },
        {
            "text": "going to be Mario Kart or Mario but like it's the evidence is stacking against me where I'm like I think it's going to be Mario Kart just based on what people are saying in my heart though I think it it should be 3D Mario um but hey we're going to find out hopefully soon I mean soon no matter what like even if it's not this week we're going to find out uh by the end of March they're saying so yeah um my I keep saying this but I don't know if you've heard me say it my prediction for the 3D Mario is that it's going to be a Mario Donkey Kong joint like I think I think it'll be like a 3D Mario Donkey Kong Adventure they have the theme parks the movie Now features them as if they're all together it's like yeah it just makes sense it adds up uh besides those games is there any other one that you're like that's I'm hoping for and that's what I want to see um I mean Metroid obviously is is on that list now I I have a deep cut I would love to see them bring back and they're probably not",
            "start": 3361.04
        },
        {
            "text": "you're like that's I'm hoping for and that's what I want to see um I mean Metroid obviously is is on that list now I I'm I have a deep cut I would love to see them bring back Kid Icarus well so that's the other thing we talking about Wii U ports Kid Icarus: Uprising on the 3DS I hate that it's stranded there fantastic game that would make so much sense on the switch and I I feel like it's inevitable like it's going to happen I just don't know when I don't think that that needs to be like a a a launch game but I mean yeah being a poor like I'm surprised actually that we didn't get it in this final run of the switch and it's not too late I wouldn't be surprised if we get a Kid Icarus: Uprising switch Port um that it backwards compatible with switch 2 but they're still going to be putting out switch games um and then yeah Chris H says Fire Emblem yeah I'm still convinced we're going to get those Fire Emblem I think",
            "start": 3400.24
        },
        {
            "text": "compatible with switch 2 but they're still going to be putting out switch games um and then yeah Chris H says Fire Emblem yeah I'm still convinced we're going to get those Fire Emblem I think it was three and four remakes or whatever like we're about to get a whole bunch of stuff so very very excited and I'm not crazy Galaxy one and two are not on the switch right galaxy one is is is it like in the shop or whatever no yeah what is it Parris yeah you want to just buy a Nintendo game on a Nintendo system what are you talking about no it's in Mario 3D All-Stars which was only available for like 3 months and then they delisted it that's why I didn't know you **** it's nintendo eShop what the **** one of the most bizarre choices they've ever made like the game sold incredibly well and it would just keep selling well yeah it it's not like oh it only sold well because it was a limited thing what the hell Nintendo the anniversary is over but it wasn't",
            "start": 3446.56
        },
        {
            "text": "keep selling well yeah it it's not like oh it only sold well because it was a limited thing what the hell is the weirdest of we Nintendo the anniversary is over but it wasn't even happening for the whole year yeah yeah 3D Allstars had 64 sunshine and Galaxy 1 but Galaxy 2 never got ported are both agree I love Sunshine but I mean I know neither neither does uh does Andy I mean it's the worst of the 3D Marios by far but I still love it it's a great time uh great time yeah broken is all **** but like great time um but the uh we we can agree Galaxy 2 is better than Galaxy one correct there go cuz they learned they they they learned they got Lessons Learned and they made it even better that's why I want a Galaxy 3 it's like give me that yeah that'd be awesome um and that's it everybody for Kinda Funny Games Daily what a fun day and it's just beginning you're about to get Paris and Greg's personal top 10 list for Game of the Year strapping for Paris's number",
            "start": 3490.2
        },
        {
            "text": "that's it everybody for Kinda Funny Games Daily what a fun day and it's just beginning you're about to get Parris and Greg's personal top 10 list for Game of the Year strapping for Parris's number seven y'all it's going to be an adventure I don't know what it is but I think I know what it is uh anyway Parris always a joy to hang out with you I'm glad that we've squashed the beef uh so yeah hang out with us all day we're doing gamescast after that we're going to be doing the super fun Movie game stream with Roger Nick and Joey you're gonna want to see that but until next time I love you all goodbye oh",
            "start": 3538.36
        }
    ]
}