{
    "id": 13454,
    "video_id": "iVScd-yC48E",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Andy Cortez",
        "Blessing Adeoye Jr."
    ],
    "title": "Citizen Sleeper 2 Review - Kinda Funny Gamescast",
    "description": "This episode is sponsored by BetterHelp — go to http://betterhelp.com/kindafunny to get 10% off your first month.\n\nGo to http://joinbilt.com/kindafunny to start earning points on your rent payments today.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1738268188,
    "duration": 3207,
    "transcript_chunks": [
        {
            "text": "what's up everybody Welcome Blessing Adeoye Jr. Jesus Christ you scared me I didn't see that one coming at all I had no way to be ready for it **** for this January 30th 2025 I'm one of your hosts Greg Miller alongside Forbes 30 under 30 AKA New York game awards nominated AKA Magic the Gathering poppy Blessing Adeoye Jr. everybody in this office is sick you know sneezing coughing uh I don't trust you guys first off we your whole family is sick we're recording this in a Time Loop of course we're recording this on Tuesday after we did the last Gamescast I sound great today compared to Monday Monday I had that cough you guys made me laugh so much it irritated me but I've been great today I've been fine excuse you made me laugh so much that I'm coughing nonstop I mean I was coughing I'm funny throughout the year you had a cough the last Gamescast and you're the last 10 minutes I was like oh there there there was an entity that that exited that well that's where I kicked it out you know",
            "start": 13.82
        },
        {
            "text": "throughout the year you had a cough, the last Gamescast and you're the last 10 minutes I was like oh there there there was an entity that that exited that well that's where I kicked it out you know end of it for me, that's how uh of course Hispanic he's from Texas Street Latino Heat clicking heads and ripping him to shreds, the Globe Trotter and headshot and three-point shooting, rooting tooting Nitro rifle from twitch.tv Andy Cortez, how are you feeling? I'm doing great, awesome. What was that sneeze? Was it just a I got some dust in my nose, I felt a I felt a tickle felt a tickle in the nostrils. You're the one you're the one out there in the night right playing Magic: The Gathering board games people puking child what are you what are you going to do with the children and also I was careful about cuz like those was one of the kids who how young are these kids you're playing with uh well I'm not playing with the kids, the kids are just happened to be there, the adults are playing the adult games wait I",
            "start": 66.56
        },
        {
            "text": "those was one of the kids who how young are these kids you're playing with uh well I'm not playing with the kids the kids are just happened to be there the adults are playing the adult games wait I thought the 9-year-old beat you up in what which nine-year-old nyar oldold beat me up no that was uh when you went to a Magic: The Gathering Fest oh yeah no that was yeah that was at the Whistle Stop pre-release um yeah no then but he didn't beat me up though I beat him because it's best two out of three I beat him the first game he beat me the second game but then we ran out of time and so I gave him the win so that one of us could win the pack cuz you have to win like if you you submit a tie nobody wins the pack and so like I'm like well he's a kid so what I'm not going to flip points around people too you're getting sick too all right I'm saying I got the dad B the dad immune system I'm I'm watching I'm I'm at this board game night I'm watching this three-year-old right",
            "start": 110.24
        },
        {
            "text": "around people too you're getting sick too all right I'm saying I got the dad B the dad immune system I'm I'm watching I'm I'm at this board game night I'm watching this three-year-old right and like like there's a lot of snacks and stuff like it's I I love this this game night it's like it happens like this is at a friend's house right and it happens like once every like probably five weeks or so and um they have children and like this last time you know he had Cheetos out he had like uh yeah different snacks oh just the hands are everywhere and I just see this kid oh man this kid's hands are all the way snacks and I was like not eating those not smart smart move yeah 100% 100% yeah that's the you know Ben learned a valuable lesson that I have to you know repeat 14 1300 thousand times uh but this weekend when we were playing our games he is getting better but he's still getting over sucking his thumb and so yeah he had me beat a part of Astro Bot or Sonic for him and I passed the",
            "start": 149.6
        },
        {
            "text": "uh but this weekend when we were playing our games he is getting better but he's still getting over sucking his thumb and so yeah he had me beat a part of Astro Bot or Sonic for him and I passed the controller back and he pulled I'm like nobody this is a DualSense all right there's a microphone that's a great call get him started early on that I'm not going I'm not going to raise one these kids who's just a Ruffian who has no idea what he's doing out there you know controllers exactly it wasn't until Greg really sort of like drilled that idea into your mind of when you go to Convention don't ever touch your mouth that's why I ever get sick yeah and like I am so self-conscious of that now it's always in the forefront of my mind whenever I'm anywhere with food it's like I I either have I'm always wearing a mask in an airport um because that's always like the place that I always get sick at I always take a disease back home and I get sick when I'm back in Texas or I'll bring uh",
            "start": 191.92
        },
        {
            "text": "I'm always wearing a mask in an airport, um, because that's always like the place that I always get sick at. I always take a disease back home and I get sick when I'm back in Texas or I'll bring it uh sickness back over here, yeah. So that's like eliminated pretty much. But then when you're at a convention and there's finger foods, or you're at a you know little event, touch let's touch the controller, then let's pick up a slider. All it takes is one time. It took the one time where I almost passed out of Comic-Con, I was like never again, never do you guys try to fist bump people? Oh yeah, I no, I fist bump so my emmo upon uh leaving the hotel room or whatever going to a preview event is that my hands are biohazards. So I shake hands because I know I'm not I would never in a million years touch the food and eat it or do that or rub something. I once I'm out, I know it's whatever. And then I had a thing um at I believe it was oh I forget, I think it was PAX East, it was PAX East where I it was",
            "start": 226.24
        },
        {
            "text": "and eat it or do that or rub something I once I'm out I know it's whatever and then I'll be see I had a thing um at I believe it was oh I forget I think it was PAX East it was PAX East where I it was lunchtime and I was like man I'm starving I'm going to go to like the food court area that's the convention center and I had like I was like okay let me find a nearby bathroom because I don't know if I'm going to be wash my hands when I'm at the food court I'm sure this bathroom but who knows so I washed my hands and like it was an obstacle course of like trying to make sure my hands stayed clean ran I ran into a friend of mine who yeah I love him so much but he will not just like not shake my hand like anytime he sees me he needs to DB me up fully and I I like tried so hard like I made the fist apparent of like I'm fist bumping you and he grabs my hand I'm like come on my guy see I I I I've been in that situation and I will stop I I will stop everything I'm about to go eat I'm about to do",
            "start": 269.24
        },
        {
            "text": "apparent of like I'm fist bumping you and he grabs my hand I'm like come on my guy see I I I I've been in that situation and I will stop I I will stop everything I'm about to go eat I'm about to do this yeah I'm not afraid of you know making an enemy out of a friend yeah but you know I don't know just not I don't like an awkward situation n my whole life's an awkward situation it's this has been the thing of course you know being a a germaphobe but on you know lower level not like you know OCD or anything like that not there anything wrong with that I'm just making sure I'm not trying to you know have false valor here but the idea of like the things I've had to get over with having a kid you know what I mean of like I'm still hungry in the half-eaten sandwich that he has been playing and touching I was like you know what I mean like I got to keep the immune system going whatever I'm hungry I'm in terms of again the levels like sure I'm a germaphobe but I'm a fat guy first so like",
            "start": 312.32
        },
        {
            "text": "and touching I was like, you know what I mean? Like, I got to keep the immune system going, whatever. I'm hungry, in terms of again, the levels. Like, sure, I'm a germaphobe, but I'm a fat guy first, so... like today he's not going to finish that egg sandwich, give me that thing! I made a great egg sandwich today, come on now! You, of course, I'm going to make a great podcast for you today as well because this is a Kinda Funny Gamescast, each and every weekday. We run you through the biggest topics in video games, whether they be previews, topics to talk about or like today, reviews of games you should be paying attention to. If you like that, of course, join us each and every weekday here on Twitch.tv/KindaFunnyGames, YouTube.com/KindaFunnyGames, and podcast services around the globe. Uh, of course, if you're watching live, I would normally tell you you could be a super chatter and get a part of... but like I already told you because the travel and previews and all these things we're recording this ahead of",
            "start": 350.48
        },
        {
            "text": "watching live I would normally tell you you could be a super chatter and get a part of but like I already told you because the travels and previews and all these things we're recording this ahead of time however Andy Cortez went above and beyond and put up a Blue Sky post so we do have audience feedback good job Andy Round of Applause no problem good job out there of course man of course if you want to support us Beyond following us on Blue Sky it's pretty simple you should get that Kinda Funny membership $10 gets you all of our shows that's 20 a week 80 a month ad free and and of course the ability to watch the afternoon podcast live as you record them and of course a daily dose of me in a series we call Greg Way where even when I'm on the road like today somebody else does it I think it's Roger today Roger with his Trinidad stories is he back on Thursday back on Thursday oh gota is that what we're calling him I like that the Trin Dad can we say that wait you're saying he's back",
            "start": 391.2
        },
        {
            "text": "it's Roger today, Roger with his Trinidad stories, is he back on Thursday, back on Thursday, oh gota, is that what we're calling him, I like that, The Trin Dad, can we say that, wait, you're saying he's back this Thursday, that's what the calendar says, thought he was gone for two weeks, has it been no 10 days, wait, was he gone last week, yeah, oh yeah, wow, it's like he, I didn't even notice, don't let Roger see this chat, cool chat, do not show this to Roger, was gone last week, do not show this to Roger, it was birthday yesterday but can't no way G for you, didn't notice he wasn't part of Game Showdown, he's like your cohost on that thing, he wasn't here for it, oh yeah, I guess he wasn't, it was a Kinda Funny episode, you know we only do one if you got no bucks or toss are way, no big deal, youtube.com/KindaFunnyGames, twitch.tv/OfunGames, podcast services like subscribe share ring the bell tell your friends leave a review if you have Amazon Prime you have Twitch Prime you know the whole song housekeeping",
            "start": 428.88
        },
        {
            "text": "games twitch.tv/ ofun games podcast services like subscribe share ring the bell tell your friends leave a review if you have Amazon Prime you have Twitch Prime you know the whole song housekeeping for you you already got Kinda Funny Games Daily today of course you're getting a stream after this that as of Tuesday is supposed to be Sniper Elite Resistance uh if you're a Kinda Funny member you can get today's Greg way hopefully from Roger uh today's uh we want to thank our Patreon producers Delaney Twining and Carl Jacobs today we're brought to you by BetterHelp and Built we'll tell you about that later for now let's begin the show with what is and forever will be topic of the show Andy hey Greg in 2020, 2022 a game called Citizen Sleeper came out I heard no one speak about it until you started speaking about it and for three years now is you've never shut up about it yeah you loved Citizen Sleeper you enjoyed Citizen Sleeper had an 82 on Metacritic and now Citizen Sleeper 2 is",
            "start": 471.2
        },
        {
            "text": "You started speaking about Citizen Sleeper, and for three years now, is you've never shut up about it, yeah. You loved Citizen Sleeper; you enjoyed Citizen Sleeper, had an 82 on Metacritic, and now Citizen Sleeper 2 is finally upon us. Uh, the Steam description reads: A DIC-driven RPG in a human and heartfelt sci-fi world. World, you are an escaped Android with a malfunctioning body, a price on your head, and no memory of your past. Get a ship, find a crew, and take on contracts while you navigate across the starward belt. Of course, it is developed by Jump Over The Age, published by Fellow Traveler, out January 31st. Andy Cortez, as the biggest Citizen Sleeper fan I know, does Citizen Sleeper 2: Starward Vector live up to the hype? Yes, excellent, yes. It sure does. Greg, is it a contender? I am proud to say that Citizen Sleeper 2 is a contender for at least my top 10 right yeah of course and I've always talked about how Citizen Sleeper is a much more different game than I would ever give a chance to it just I",
            "start": 518.48
        },
        {
            "text": "Citizen Sleeper 2 is a contender for at least my top 10 right yeah of course and I've always talked about how Citizen Sleeper is a much more different game than I would ever give a chance to it just I think it was one of those right moments in time for me where I was listening to the Besties podcast never heard and they were just waxing poetic about San Sleeper and how amazing the storytelling is and the writing and it was available on Game Pass and I fired up my Xbox during the pandemic and I was like let me see what this game is all about and I think I beat it in one day cuz I was just so immersed in the story and the characters and everything and so impressed by the writing mainly how every line of dialogue reminds me of watching Andor where there are so many monologues in Andor just like God that's a",
            "start": 574.8
        },
        {
            "text": "every frame of painting in movies or whatever this is, this is like every line of bar like like every it reminds me of watching Andor where there are so many monologues in Andor just like God that's a that's a **** poem right there like give that like some Award right there just that one line like that that happens constantly in Citizen Sleeper and Citizen Sleeper, um let me just do the little Wikipedia plot please do uh and this is also kind of over encompassing Citizen Sleeper's to plot as well in Citizen Sleeper, the player character is a sleeper, a human who mind has been digitized and put into the body the robot body to be controlled by the SynthCorp corporation the player sleeper has escaped indentured servitude on a freighter and arrived on the space station called the Eye that's for S and Seer one but just the general thing is in the future if there's a lot of debts you owe if you're kind of you don't have a whole lot of options in your life because corporations and capitalism has run",
            "start": 624.24
        },
        {
            "text": "Citizen Sleeper 2 Review - Kinda Funny Gamescast. This episode is sponsored by BetterHelp — go to http://betterhelp.com/kindafunny to get 10% off your first month.\n\nGo to http://joinbilt.com/kindafunny to start earning points on your rent payments today.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer\n\nSeer one but just the general thing is in the future if there's a lot of debts you owe if you're kind of you don't have a whole lot of options in your life because corporations and capitalism has run rampant and there's a lot of thank God this is fiction yeah there are massive amounts of wealth disparity right yeah you can lend your not not necessarily lend but you sell your body to a corporation they emulate and digitize your mind put it inside of a robot and that robot will work and make money and you will kind of exist there forever while your body is somewhere on a station whatever just kind of there sitting there being yeah sleeping yeah exactly getting milk yeah um and so it's really a pretty dreary look into the future and and a and a really depressing take on what future life can be but the thing that really struck me with Citizen Sleeper was always this feeling of Hope depending on whoever NPCs you would talk to any NPC you would talk to there there would always just be like",
            "start": 672.16
        },
        {
            "text": "be but the thing that really struck me with Citizen Sleeper was always this feeling of hope depending on whoever NPCs you would talk to, any NPC you would talk to, there there would always just be like this underlying positivity of \"as long as we have each other\" sort of mentality. If if we if as long if we stick together, you know, regardless of what awful things are happening out there in the space station or in the universe or in the galaxy, we can only control what we have right now and let's make the most of it. And regardless of how depressing it gets, there's always that sort of feeling. And I was just super drawn to it. And for whatever reason, it just worked in that moment whenever I played this game. This is typically a game I would never ever try because it's a lot of reading and there's no dashes, no there's no parries, there's no... yeah, that's what I was going to say if you're watching it obviously but if you're an audio listener, yeah, it's this interesting visual novel but",
            "start": 728.28
        },
        {
            "text": "and there's no dashes, no parries, there's no yeah, that's I was going to say if you're we're watching it obviously but if you're an audio listener, yeah it's this interesting visual novel but then mixed up with the as I read dice based RPG mechanic right where it is you have these set number of dice that you can then go and apply to the choices you make in the game so it'll influence obviously you know with more dots on the die if it's going to be a good outcome or a bad outcome and it changes the uh priority of what you're doing but you're yeah just making choices and seeing how they play out, yeah and I I think one thing for me when I played the first Citizen Sleeper is after the story that I experienced in Ceeper One is like that's my canon, that's yeah that was my story, I think I had one of the best endings to any video game experience I've ever had and something that will just constantly resonate with me and it was beautiful and emotional and just emotionally",
            "start": 780.64
        },
        {
            "text": "I had one of the best endings to any video game experience I've ever had, and something that will just constantly resonate with me. It was beautiful and emotional, and just... like emotionally wrecking you know? It was a very heartbreaking moment that was still so amazing to experience. Yeah, it felt great. And so many of the NPCs in Citizen Sleeper 1 and Citizen Sleeper 2 have a lot of those through lines. Whether you're talking to them for a tiny little mission or whether they're there to constantly go back to and kind of progress their story. Can I stop you right there, cuz I feel like you're going somewhere that I want to get one of our super chats in? It's a from your Blue Sky thing, right? You're talking about how much you have this cannon ending in Citizen Sleeper 1, Citizen Sleeper 2. Clearly a sequel. We do have a question from Eric Myers who says hypothetically, because this is how you phrased your tweet, if I hadn't played the first one would I be able to jump into this one?",
            "start": 824.96
        },
        {
            "text": "Citizen Sleeper 2 clearly a sequel we do have a question from Eric Myers who says hypothetically because this is how you phrased your Tweet if I hadn't played the first one would I be able to jump into this one and not be lost yes okay however do you recommend playing the first one first of course I think the I think the first game is a better video game I think if I were to Kinda Funny score you know we didn't have that scale back in the day if I already gave Citizen Sleeper 1 it's like close to a masterpiece for me I give it a 9.5 nice and Citizen Sleeper 2 I'm on the fence between 88.5 to 9 okay still extremely recommended absolutely play this game it's still incredible but in Citizen Sleeper 2 you are playing a different sleeper you start you're in a different you're a different character altogether but still the same through line is there you are a digitized emulated mind put into a worker robot body and it starts off with a bang and I think it starts off really great uh Citizen Sleeper 2.",
            "start": 876.36
        },
        {
            "text": "still the same through line is there you are a digitized emulated mind put into a worker robot body and it starts off with a bang and I think it starts off really great uh Citizen Sleeper 2 and the the Demo's out now you can still play the demo it's called the Hex Port demo up on Steam but yes you can absolutely hop in and not be lost or confused because it throws you into a very easy to digest situation you are confused you wake up what the hell is going on we're going to give you the best couple of paragraphs to beautifully you know describe the the environment that you're in and it's all written so incredibly great and somebody's hunting you and somebody's you know somebody's after your property back somebody's got a problem with your robot body and it's this dude named Lane and this Lane is bad news and this guy's like you know look what I've done for you and this is how you're treating me like you know I you know that I have plans for your body and you just treated it like crap",
            "start": 922.88
        },
        {
            "text": "bad news and this guy's like you know look what I've done for you and this is how you're treating me like you know I you know that I have plans for your body and you just treated it like **** and and and then you have a friend alongside you who's like we got to get the **** out of here and you're like who is this person you have different dialogue choices who are you like what the what do you mean like something happened to you there was some sort of test or some sort of thing happening to your body and it was interrupted and your brain is wiped and it's a great place to kind of fall into cuz it's immediately like I feel the tension I feel the action and I hate this dude already so I'm 90 minutes I did not play Citizen Sleeper one and so the only thing I found not jarring but I was wondering am I would I know more about me or Lane if I had played citizen sleeper and I think not knowing it not even knowing that just having that question didn't influence this having a great time",
            "start": 976.76
        },
        {
            "text": "wondering am I would I know more about me or Lane if I had played Citizen Sleeper and I think not knowing it, not even knowing that just having that question didn't influence this having a great time story is great conversations are great gameplay I'm still wrapping my head around because it is so new to me and different but I don't think you have to worry if you're a new player jumping in cuz I am right and you will have three different classes to choose from and the three different can I ask a question there too go ahead was that in Citizen Sleeper one as well yes okay and where um you know if we're talking the closest analog I can give you is strength dexterity magic whatever the **** right but these are Engineer, Pursuits I I'm blanking on what all the different skills are right but one character won't be able to do one of them well like each class won't be able to full won't be able to do certain moves when Kevin was going through it you saw the skill trees and like they're",
            "start": 1024.88
        },
        {
            "text": "but one character won't be able to do one of them well like each class won't be able to full won't be able to do certain moves when Kevin was going through it you saw the skill trees and like they're being a one reded out right that's the idea is you go in there and you have different base levels to start from let alone things that are closed off on it you will have some strengths and some of your fellow NPCs might be able to pick up the slack in those situations uh whenever you come across these uh moments where you have to roll your dice right um a new mechanic in this game yeah here we go here's the screen Mist right or Machinist yeah Machinist so this character can't do the Engage skill so if there's ever a test in the future that has Engage you will not be able to roll dice there you can roll a dice but since you don't have that skill it'll give you know if you have a six that you can roll because you just so happened to wake up that day and every day you wake up you are given",
            "start": 1069.96
        },
        {
            "text": "can roll a dice but since you don't have that skill it'll give you no indication if you have a six that you can roll because you just so happened to wake up that day and every day you wake up you are given five dice to roll and you could use those five dice on any place in any of the star stations that you're kind of located in if you get a six and I tried to use it on that skill engage it's going to become a four it it it takes away two points because you don't have that skill you can't use that here and the four gives you less chance of this having a positive outcome right I think all that stuff gets so like in the weeds though I don't really want to scare away people from like dice rolling type stuff cuz I think it I think it starts to kind of come more naturally to the player but when I hop into this I'm like I'm not a tabletop guy I'm not a visual novel type dude and I really was just there for the these human stories interesting I love that about I think that's the thing is like",
            "start": 1108.08
        },
        {
            "text": "I hop into this, I'm like, I'm not a tabletop guy, I'm not a visual novel type dude, and I really was just there for these human stories. Interesting, I love that about it. I think that's the thing is like not being a dice player either, like those kinds of games, even tabletop RPGs, I respect but I haven't done a lot of D&D. It was more like getting in and being like, \"Oh, it's the gimmick to the visual novel.\" Visual novels often I can enjoy, but often I find myself drifting away from it, I'm bored, to some respect, thing right? I'm just making choices, whatever the gameplay mechanic is, and the influencing then of the decisions, and the thing especially early on, right now where I am in the game, right over here, is like, \"Let's scr up some cash,\" I'm going to go do this, don't **** it up, and you walk around and either **** it up or don't **** it up, right? Like I'm in that section still, and so it is like, okay, this is a risky choice, do I use my big dice on it or do I not to go do this? Yeah, if you uh the",
            "start": 1156.48
        },
        {
            "text": "**** it up or don't **** it up right like I'm in that section still and so it is like okay this is a risky Choice do I do I use my big dice on it or do I not to go do this yeah if you uh the different test will tell you whether it's a safe Choice a risky choice or a dangerous Choice it'll have Danger on there and if you roll uh you know if you roll a a six that's 100% pass yeah you're going to pass that test if you roll a five you have a 50% chance of it being a positive outcome or 50% chance of it being neutral which is like still fine and that usually passes in a lot of cases yeah uh and then if if I were to try to roll a two then that's like negative or neutral like you're not really going to succeed here and if it's a dangerous task or a risky task a risky task will result in more punishment to to you the player so it's like do you want to take that risk do you want to deal with a consequences of undergoing stress and the more stress your character has your dice will break",
            "start": 1203.28
        },
        {
            "text": "punishment to the player so it's like do you want to take that risk do you want to deal with the consequences of undergoing stress and the more stress your character has, your dice will break and you have to eventually repair those but if your dice are broken then that means you only have four left instead of the usual five and if you keep on taking really shitty risks then you'll have another die break and then you'll have three left you know and so it's like there is a lot of that risk reward and a lot of that player payoff um but I kind of wanted to compare my experience with Citizen Sleeper 1 and with this game to another game that we played last year uh that Andy and I played last year Dragon Age: The Veil - Inquisitor (corrected title) oh yeah where I I think based on certain endings and certain outcomes you can have an incredible experience and maybe you get an outcome that you feel is lesser than you'll be like ah that really kind of hurts the overall what my overall feelings will",
            "start": 1252.28
        },
        {
            "text": "Certain outcomes you can have an incredible experience, and maybe you get an outcome that you feel is lesser than what you'll be like, \"Ah, that really kind of hurts the overall\" what my overall feelings will be here. Right? Yeah, and I, I, I stand by that. Whatever I did in Dragon Age: Inquisition, even in having a catastrophic ending with all the choices that I was making, I was like, \"Wow, I really loved what I experienced.\" And then I started up a new playthrough and I saw different dialogue choices, and suddenly I saw the cringe that reviewers are talking about. And I saw things that weren't lining up, and I saw things that didn't feel earned. And I'm like, \"Okay, now now I start to see why other people's viewpoints.\" That's not a you know, I'm not trying to excuse the writers here or whatever. But different you know, whether you're choosing a different backstory, it might lead to worse writing. It might lead to moments where you're like, \"Oh, that doesn't feel good. I don't really like the character saying\"",
            "start": 1297.76
        },
        {
            "text": "whether you're choosing a different backstory, it might lead to worse writing; it might lead to moments where you're like, \"oh, that doesn't feel good,\" I don't really like the character saying that; that makes no sense. How would you feel that way when I didn't experience... you know, blah blah blah. That you can kind of see where I'm getting at, and with sson saer one, I still feel like the ending that I got is the most perfect thing that could have happened for me in that moment; there could have been other outcomes that maybe didn't make you feel as satisfied. For me, it was like perfect; that's why it's like what an amazing experience with this game. It feels like there is one singular ending, but there are a lot of like... one A and one B and one C sort of like okay shades to it side endings to it. Because it still feels like there's one kind of this is the final thing that you will do in this game to eventually roll credits, but there are other sort of uh paths to pursue",
            "start": 1346.16
        },
        {
            "text": "to it side endings to it cuz it still feels like there's one kind of this is the final thing that you will do in this game to eventually roll credits but there are other sort of uh paths to pursue that you may not in certain playthroughs so that's where a lot of but I do think a lot of the choices still matter in this game a lot of the things you're doing a lot of the NPCs you're deciding to to keep around all of that stuff does matter um and the same with Citizen Sleeper 1 where you're making some big choices and if you fail some stuff you might have an ending that's like oh my God this is really depressing and sad and I I really **** up here what made those choices matter to you right like if it's not a thing of figuring out like oh I want ending A versus ending D or whatever right like is it the fact that you're just coloring in the story the way you want to color it in is it like what happens along the way that differs from what other people might might do or like is it something",
            "start": 1389.56
        },
        {
            "text": "is it the fact that you're just coloring in the story the way you want to color it in, is it like what happens along the way that differs from what other people might do or like, is it something else? I think what makes Citizen Sleeper 2 as long as I'm getting fulfilled emotionally. You know, I was talking... um, I had asked the developer where the demo ended, cuz I wanted to know for like embargo sake, and they were telling me that the demo ended at a certain spot, and I knew okay, I won't talk about what happens beyond that... Beyond, and then they said thanks for always uh talking positively about Citizen Sleeper one, like I really appreciate it, and I was like thanks for making me feel cuz that's these games have such an impact on me story-wise. And whether I could talk to an NPC in this game that only exists for a mission, and they just drop some of the most poignant... like just hard-ass stuff ever, and you're like goddamn man, that's like a tattoo, like that is such an amazing thing that you just",
            "start": 1435.12
        },
        {
            "text": "for a mission and they just drop some of the most poignant, like just hard-ass stuff ever, and you're like, \"God damn, man, that's like a tattoo.\" Like, that is such an amazing thing that you just said, and now you're gone. And I think what makes those choices matter to me is like the human connection to these characters, and how I don't think every character is necessarily the most believable. There are a lot of stretches that happen in this game where you'll meet a character, and they'll be like, \"Oh, oh, you're a sleeper? I don't see many of you by the way. You looking for a crew?\" And it's like, \"Oh, I don't know, that feels kind of like a stretch.\" I feel like maybe we would need more of a back and forth to eventually wanting to join a crew or maybe you just are desperate. But such a video game thing - Starfield is always the same way; they just bump into somebody like, \"I'll join you,\" trying to get me to the next point, and so I definitely see where",
            "start": 1481.2
        },
        {
            "text": "I'm such a video game thing Starfield is always the same way, they just bump it into someone like \"I'll join you're trying to yeah you're trying to get me to the next point\" and so I definitely see where you're going with this but for me the choices that what makes the choices matter to me are like feeling like I'm letting something down as opposed to in other games where I in in other games where I'm really curious to see what the developers were able to put into this game like like like Starfield right there, there or any game that has Choice the the game developer side of me like that's still somewhere in that brain goes \"man I want to pick this but I really want to see what happens if I pick the other choice\" just out of a game development like curiosity sake how far do they take this, how like asset-wise dialogue-wise how far are they going to take these cutscenes and these character interactions where in this game I'm really just more curious in how is this character going to react",
            "start": 1530.92
        },
        {
            "text": "like asset-wise dialogue-wise how far are they going to take these cutscenes and these character interactions where in this game I'm really just more curious in how is this character going to react to this how am I going to **** up this side of the story if I choose to side with so and so if I decide to make this choice like it it feels much more like I am choosing out of my own self-interest rather than oh what did this game developer have in store for me if I choose this path you know I don't really have that with this game here I'm just like I want to see what this character I want to see the future for this character if I do decide to side with them or help them out uh how long did it take you to get credits ball work much longer game I will say how long was Citizen Sleeper one Citizen Sleeper one I beaten about 9 hours nine nine or 10 hours I think how long to beat says 10 hours but I think it was a little bit shorter for me S two **** man like 22 23 oh wow okay wow wow",
            "start": 1577.0
        },
        {
            "text": "Citizen Sleeper 1 I beaten about 9 hours, 9 or 10 hours, I think. How long to beat says 10 hours, but I think it was a little bit shorter for me. S2 **** man, like 22, 23. Oh wow, okay, wow, wow. It is a lot more expansive. And I don't know if that... I was going to say does that work for it? Is that hey, I anytime I felt like it wasn't it reminded me of 10,000 Towns, right? Where that game, I mentioned in our review of it or you know just past sort of Game of the Year podcast about it where I felt like I had 12 different epilogues. Where it just kept on like oh there's more and I'd be like \"there's more\" and then you would get into the meat and go oh this is really good, though. Like this, this meal is tasty. I actually was still hungry, thank God. And I felt a lot of... I never felt like this game won't end, though, because I am still enjoying so much of it. Um, and I do want to learn what keeps on happening with these characters. And then a new NPC would pop up and be like",
            "start": 1623.56
        },
        {
            "text": "felt like this game won't end though because I am still enjoying so much of it um and I I do want to learn what keeps on happening with these characters and then a new NPC would pop up and be like What's your deal right the game definitely is longer I do think that I chose to go more of the completionist route with this one okay and that feels Citizen Sleeper 2 feels like it opens itself up more up to that where C Sleeper one did feel like all right point A to point B well there's five different points pick one or pick one or two maybe okay and this game definitely feels like it it gives you more time to kind of explore a lot of different options and a lot of different story paths um because there are a lot of characters and there's a big star system out there let me bring in this question then from the super chats and quotes Okami 13B says my biggest question is if it retains the heart and thought-provoking nature of the first one I'm happy it's bigger and has more systems than the first",
            "start": 1669.8
        },
        {
            "text": "from the super chats and quotes Okami 13B says my biggest question is if it retains the heart and thought-provoking nature of the first one I'm happy it's bigger and has more systems than the first but only if they don't get in the way of what made the first so special 1 million per. yeah that is without a question anytime that I was expecting for the writing to fall off it did cuz it's just so amazing throughout um and every character you meet there's always like this beautiful lesson at the end of it and there's always like a very uh impactful sign off to the way you are your character are thinking about an NPC and this character stayed there and it made you think what was really that you know you just have this sort of moment of self-reflection and it's like it's so beautiful and so hopeful and it's so reminds me a lot of The Vibes of Sinner: Sacrifice one this universe is punishing and it sucks and there's a lot of people suffering yet through it all there's this Silver Lining of humanity",
            "start": 1717.92
        },
        {
            "text": "so hopeful and it's so reminds me a lot of The Vibes of Soma this universe is punishing and it sucks and there's a lot of people suffering yet through it all there's this Silver Lining of human connection or in this case, Sleeper and human connection like synthetic connection and you as this sleeper anytime there was a moment of you was a sleeper talking to an NPC and then being like um hey you what's your deal right do you feel like what we feel do you have these memories and you as the sleeper being like actually yeah like I had this moment where I saw I had a vision of a butterfly I was like what's that I haven't experienced that but the person that I'm emulated from where my body is yeah experience that somewhere why is that memory leaking through and what is it to be a human you know it's like God it's so **** good and at every turn there are moments that hit you upside the head and like as bad as I am with ADHD and reading I was going to say it's so it's so **** good",
            "start": 1764.28
        },
        {
            "text": "know it's like God it's so **** good and at every turn there are moments that hit you upside the head and like as bad as I am with ADHD and reading I was going to say it's so it's so **** good GameOverGreggy super chats and says if someone who hates reading is it good yes like and I think because the writing is so good I find myself I found myself about at least like 20 damn times because of how bad I am with reading and this spans back to high school where suddenly when I like turned 12 and 13 and 14 I just could not get through a paragraph Without trailing off of my mind going somewhere else and being like what did I just read and that happens a lot in Citizen Sleeper 2 with me personally and that's just me being bad at reading and having just this brain that cannot focus and I would get to the end of the paragraph and go no don't move on you didn't know what you just read and you know it's going to be sick as **** and then I would read it and consume it and be like ah that was great like",
            "start": 1820.2
        },
        {
            "text": "end of the paragraph and go no don't move on you didn't know what you just read and you know it's going to be sick as **** and then I would read it and consume it and be like ah that was great like trust me like for a game that doesn't have dodges or parries or level design or anything like that like I am still so blown away by this experience you have a lot more questions here from Blue Sky that I want to get to but first I'll remind everybody that we are an 11 person small business all about live talk shows usually about video games if you like that and want to support that'd be great pick up a Kinda Funny membership on patreon.com/KindaFunny or youtube.com/KindaFunnyGames or Apple or Spotify and of course you'd get all of our shows ad-free the ability to watch The Afternoon Podcast live as record them and your daily dose of me Greg Miller in a series we call \"Gregway\" but right now you're not using membership benefits so here's a word from our sponsors this episode's brought",
            "start": 1868.36
        },
        {
            "text": "\"Live as we record them and your daily dose of me Greg Miller in a series we call GameOverGreggy, but right now you're not using membership benefits so here's a word from our sponsors. This episode's brought to you by Built. If you're a renter, I'd start taking advantage of Built if I were you. Here's the thing: we earn points on groceries, travel, and practically everything else we buy. But we should also be earning points on rent. One of our biggest monthly expenses. Built changed the game by letting renters earn high-value points on rents and around their neighborhood. There's no cost to join Built, and as a member, you'll earn valuable points on rent and your everyday spending. Built points can be transferred to your favorite hotels and airlines, and even the ones you haven't heard of - there are over 500 airlines in 700,000 hotels and properties around the world. You can redeem your Built points towards points, or also redeem them towards a future rent payment and unique experiences that only Built members get.\"",
            "start": 1908.24
        },
        {
            "text": "in 700,000 hotels and properties around the world you can redeem your built points toward points can also be redeemed towards a future rent payment and unique experiences that only build members can access so if you're not earning points on rent my question is why not start earning points on rent you're already paying by going to joinbilt.com kindafunny that's joinbilt.com kindafunny make sure to use our URL so they know that we sent you there joinbilt.com kindafunny to start earning points on your rent payments today this episode's brought to you by betterhelp what do you want your 2025 story to be every January brings you 365 blank pages waiting to be filled in in 2025 maybe you're ready for a plot twist or maybe there's part of your story you've been wanting to revise life isn't about resolutions that fade by February it's about picking up the pen and becoming the author of your own life think of therapy as your editorial partner helping you write new chapters and",
            "start": 1950.0
        },
        {
            "text": "life isn't about resolutions that fade by February it's about picking up the pen and becoming the author of your own life think of therapy as your editorial partner helping you write new chapters and create the meaningful story you deserve to live some of my best friends use BetterHelp and they love how helpful it can be for learning positive coping skills and how to set boundaries it empowers you to be the best version of yourself it isn't just for those who've experienced major trauma if you're thinking of starting therapy give BetterHelp a try it's entirely online designed to be convenient flexible and suited to your schedule and it serves over 5 million people worldwide Write Your Story with BetterHelp visit betterhelp.com kindafunny to get 10% off your first month that's betterhelp dot com slash kindof funny and we're back I'm going to start with David Paige who BlueSky and says did they gamify more of the systems from the previous entry or is",
            "start": 1999.4
        },
        {
            "text": "betterhelp.com kindof funny betterhelp.com kindof funny and we're back I'm going to start with David Paige who BlueSkye and says did they gamify more of the systems from the previous entry or is it still very much in line with how simple and straightforward the first ones systems were if the former did that detract from the experience of the first if the latter did it feel like it did enough to improve in other areas I think it improved the game for sure by adding this sort of stress meter so that's the new thing yeah the new thing is this whole sort of stress meter if you fail a check if you're going out to a side quest which I I love just having these tiny little moments of talking to an NPC and then being like Oh there's this like this crash ship out in this system they're looking for and that and if you want a job like go you know 200 cryo or whatever is as the currency and then so you would decide to fly out there and you would pick two of your NPCs that you've recruited",
            "start": 2043.88
        },
        {
            "text": "for and that and if you want a job like go you know 200 cryo or whatever is as the currency and then so you would decide to fly out there and you would pick two of your NPCs that you've recruited along the way and uh you look at what you know you have four skills right depending you know very varying strengths of the different skills and you have one you can't use you look at your NPCs and you're like all right who am I going to who should I take out with me well you have that one skill I don't have so I'm taking you out there and uh you're not so strong in that place but you are so I'll take you as well so you take two people with you and they have two skills or they have uh one to two skills but they have two dice that they can roll and you have your five dice that you can roll yeah yeah and you're out there and you need to make sure that you have uh it's if it's a mission that is going to take a long time you need to make sure you have enough supplies because every time you end",
            "start": 2097.04
        },
        {
            "text": "yeah and you're out there and you need to make sure that you have uh it's if it's a mission that is going to take a long time you need to make sure you have enough supplies because every time you end your cycle you uh you need to eat or else your character will like slowly start to lose stamina and you start to like break your dice or whatever and if you failed these checks you will incur a little you know here's a little ding on you and that's going to be your stress meter the more that fills up the more your dice breaks and you can't remove stress during a mission like that during one of these side quests you uh as the as that stress meter goes up your dice will continue to break and you could just straight up fail the mission and it's all **** and your dice are all super broken and you have to go back to your base or whatever and kind of chill out and when you go back to these space stations that's kind of your moment of reprieve that's where you are normally under less",
            "start": 2141.64
        },
        {
            "text": "and you have to go back to your base, or whatever, and kind of chill out. And when you go back to these space stations, that's kind of your moment of reprieve - that's where you are normally under less stress. And there are some really stressful situations where you might fail a check on one of these side quests, and then a sort of like stress side mission will pop up on that space station. You're at an interesting point, and it's like I can finish out this space station, I can finish out this quest where I'm looking for this treasure. But there's like a really, really high-priority thing that's now going off - it's an alarm that's going to alert the authorities. And if that thing goes off before I am able to get this treasure, all hell is going to break loose. So I want to go take care of disarming that alarm. I'm really stressed out right now; I only have two days left. Can I possibly just like push it and risk it with you know trying to get this treasure or should we try to",
            "start": 2190.56
        },
        {
            "text": "care of disarming that alarm I'm really stressed out right now I only have two days left can I possibly just like push it and risk it with you know trying to get this treasure or should we try to strategize and try to disarm the alarm right and that's like that's where the push and pull comes in and that's where like you're you're basically just throwing a dice but man all the stress is there and I'm feeling like the tension of like God I hope this **** rolls and if this doesn't land positively for me I'm really really screwed one thing I haven't seen in the game uh because I'm so early is a game over so let's say you do that you ignore the alarm the authorities come in you get into a battle where you're rolling dice or choices where you'd have to and then can you be killed is it game over and then you reset or is that the end of the game you will you will not game over there is a Permadeath Mode as the hardest difficulty where if you if you die it is the end of the game but you",
            "start": 2237.2
        },
        {
            "text": "over and then you reset or is that the end of the game? You will, you will not. Game Over there's a Permadeath Mode as the hardest difficulty where if you die it is the end of the game but you essentially like pass out, you're what I mean, like a Pokémon. I never did that gamer. I appear **** gamer. Oh my God, this guy's skills he's got. I'm assuming I would wake back up on a base and then be like, \"Man, you you knocked out man.\" We we just... or whatever. I don't really know what the end game scenario is. Got it, got it, got it. But I uh I do know that I incurred a lot of punishment and you know, hey, you really **** up cuz you really pushed it to the Limit and now you're stressed all the way out and you only have one functional die left. Like there, I did experience a lot of that uh throughout the game and um yeah, that really really hurt me for the future cuz I had to spend a lot of time trying to recoup because I was so just damaged you know. Sean writes in on Bluesky and says \"I'd always\"",
            "start": 2282.24
        },
        {
            "text": "the game and um yeah that really really hurt me for the future cuz I had to spend a lot of time trying to recoup because I was so just damaged you know Sean writes in on Bluesky and says I'd always like to hear about Steam Deck performance you got your Steam Deck right in front of you that's where I played but you're obviously way deeper into Steam Deck great I I had some issues with some UI elements uh especially when you are trying to fly to different parts of this little uh star system when you're trying to go to different planets or space stations um it can be kind of annoying I ended up just like tapping on the star system I wanted to go towards because when you move the when you move the d-pad there are moments like I'm I'm showing I I don't want to show the screen but if I hit right on the d-pad and I want to go to that one I see it's like it could get kind of like frustrating in some moments and it's not it doesn't always tag to the right thing but it does fill out the full",
            "start": 2327.16
        },
        {
            "text": "on the d-pad and I want to go to that one I see it's like it could get kind of like frustrating in some moments and it's not it doesn't always tag to the right thing but it does fill out the full like 1200 by 800 screen ratio for the Steam Deck it looks great uh it performs great yeah I had no no other issues with that I say I played like 90% of it on Steam deck awesome yeah uh Chris says how do you feel uh sorry do you feel like the choice of your starting class is impactful did it influence how you use your party members absolutely yeah especially knowing that one of those skills you cannot ever have and if you do try to use it you're going to be significantly at a disadvantage so yeah for sure I did start off as one class started off having these tests and being like oo me and my squad are not prepared for these let me restart the game as the other class cuz I already failed this first mission um and it wasn't a death but it was just like you failed yeah uh Drive failed or whatever",
            "start": 2372.76
        },
        {
            "text": "are not prepared for these let me restart the game as the other class cuz I already failed this first mission um and it wasn't a death but it was just like you failed yeah uh Drive failed or whatever these missions are called drives there's like major drives and minor drives and so I restarted as a different class but uh I guess I'm reminded of our Pokémon Nuzlocke where everybody was like if you go with if you go with a uh if you go with Charmander at the start it's going to be a lot easier for you at the beginning but get harder later on yeah but if you start off with Bulbasaur at the start it'll be a bit harder for you in the beginning but better for you in the long run that's kind of how you end up here it depends like by the end of it if you want a lot of squad mates on your ship and I say you should cuz that just gives you a lot more uh diversity for what sort of skills you would have options for using um definitely do that because you're going to have a skill that you cannot",
            "start": 2418.08
        },
        {
            "text": "I say you should cuz that just gives you a lot more uh diversity for what sort of skills you would have options for using um definitely do that because you're going to have a skill that you cannot use but um you'll have a lot of skills you can eventually upgrade to and uh every time you you know I believe it costs four skill points to up upgrade something so maybe that one skill that I was or or maybe that one uh let's call it like Engineer whenever I wanted to roll a dice on an Engineer test it was giving me no benefit but I leveled it up so much yeah that whatever I roll it gives me two extra bonus points on it okay okay so if I have a four dice left on an Engineer test I know I'm going to get a six because I'm getting two extra bonus points sure sure sure nerd **** just nerd **** I love for RP when you're on these uh when you're on these Quest there's these sort of like sub Powers called um a Push okay and that's another thing you can level up and it's like an either or thing",
            "start": 2462.08
        },
        {
            "text": "I love for RP when you're on these uh when you're on these Quest there's these sort of like sub Powers called um a Push okay and that's another thing you can level up and it's like an either or thing do you want to put points into upgrading your Push ability or do you want to put points into pushing down that skill tree right and that that Push ability will be anything from uh if I click this button on one of these side quests it'll add two points to my lowest dice available okay so I have a a One, a Five, a Five, and a Six if I click that Push that one becomes a Three so and if I level that up more it could possibly go further and further and the different classes sort of vary there where sure when I picked another class recently the the Push ability then became instead of benefiting you it said you take on One Blip of Stress which is like not good obviously but your squadmates' dice will raise like up by one or up by two so now my Two squadmates get stronger so it's kind of like",
            "start": 2512.84
        },
        {
            "text": "you it said you take on one blip of stress which is like not good obviously but your squadmates dice will raise like up by one or up by two so now my two squadmates get stronger so it's kind of like what do you want do you want to hurt yourself and help out your squadmates or do you want to benefit your own sort of dice what um advice would you give for people who want to jump in like whether it be you know a good class to pick or anything right because for me hearing this I think I made the decision I think I'm going to jump into Citizen Sleeper too thank you thank you thank you I would say one man you'd say one like one is shorter and it's I think a Game Pass two and Game Pass and I think it's the CL I think it's a bit more streamlined okay I I but I love the gameplay elements of part two a bit more sure no you're not taking away but that's your like blanket statement to everybody you think if you haven't played Citizen Sleeper because you have so many questions in here",
            "start": 2564.8
        },
        {
            "text": "two a bit more sure no you're not taking away but that's your like blanket statement to everybody you think if you haven't played Citizen Sleeper because you have so many questions in here if I'm a new player why should I get in should you say St where I'm coming in at is I really liked the premise that you talked about earlier of like coming in and like there's this mysterious guy and like talking to you and it does start off with a bang like that sounds like such a cool premise to me and then I also have it on Steam and so like I can play it on Steam I do have Citizen Sleeper One on Game Pass so I could play that way but now I'm like visualizing like you know an hour before bed with my Steam Deck and I'm just like you know reading for an hour before I before I go to sleep 15 minutes yeah exactly I is yeah Kevin you're the guy right Kevin you fall asleep every time you try to read right I sure do Greg I sure do the more I'm the more I I push you towards CBer",
            "start": 2614.72
        },
        {
            "text": "Citizen Sleeper 2 Review - Kinda Funny Gamescast\nsleep 15 minutes yeah exactly I am yeah Kevin you're the guy right Kevin you fall asleep every time you try to read right I sure do Greg I sure do The more I'm the more I I push you towards Citizen Sleeper one the more I just think about the all the amazing things that part two does uh and so it's like yeah forget it The other thing I'm thinking to is like it's a it just came out so it's fresh it's 2025 so I know I'm playing a game for this year and like I can factor into the Game of the Year I'm giving it a nine and that giving it an it's going up well cuz I just think about all the other NPCs I've experienced throughout and it's just like oh there's so good and there's so many impactful moments and just stuff that just it's it's it's food for the soul regardless of how dreary and depressing it can get it's just and this this one Citizen Sleeper 2 is food for the soul in the same way Citizen Sleeper one was absolutely dude cuz I'm also thinking of like I can always play Citizen",
            "start": 2648.16
        },
        {
            "text": "it can get its just and this this one Citizen Sleeper 2 is food for the soul in the same way Citizen Sleeper one was absolutely dude cuz I'm also thinking of like I can always play Citizen Sleeper one also no you're you're totally I play it down the line especially if I fall in love with this one that be an interesting one too of how much you enjoy this not having the baggage of Citizen Sleeper one yeah I I intend to keep playing it this but I I'm going to be like I literally opened up my I opened up my like game release calendar and then which isn't public anymore now it's just private and then I opened up like releases.com to look about at what's happening in the next few weeks and I'm like I think I can pencil it in I I think you could definitely get it done way quicker than I did as well because I I was trying to do everything and while I don't regret that I could totally see myself having a bit more streamlined of an experience where I wasn't you know getting bits and tastes",
            "start": 2690.96
        },
        {
            "text": "as well because I was trying to do everything, and while I don't regret that, I could totally see myself having a bit more streamlined experience where I wasn't getting bits and tastes from a lot of different experiences as opposed to like what if I just focus on one or two NPCs and really tried to make the most out of that. But then even as I'm saying this, there's also Andy in the back of my mind going yeah but all the other stuff you experienced was so fulfilling as well. Um, I think that there are so many great moments of excitement and stress you can experience in this game just with bringing your homies along, and it's like oh we've really messed up this side quest, are we going to be able to recover? This is a lot of money on the line, I'm kind of poor, I could really use that 300 cryo right now because I need to buy Fuel and I need to buy uh food and supplies",
            "start": 2724.6
        },
        {
            "text": "the line I'm kind of poor I could really really like it you get so immersed you're like man that 300 cryo would go a long way right now cuz I need to buy Fuel and I need to buy uh food and supplies this game rocks man yeah I mean here you talking about it reminds me of games I love like Disco Elysium and Near Aoma and like the Near franchise right like take some of those RPG mechanics of Disco and like especially like a lot of the tech Spa stuff I know Disco it took for the director's cut for me to get into it because they had the voice acting and so like they read all that **** out loud to me in really cool voices but even still that's another they really cool they super cool these are really cool if you play Just Cause 5 you know what I'm talking about the voices are so **** cool that was a I was I had the same thing while that's what I held off for Disco's director's cut as well but jumping into this one I was like reading like I like reading fine don't me wrong but it's",
            "start": 2773.68
        },
        {
            "text": "the that was a i was i had the same thing while that's what i held off for disco's directory cut as well but jumping into this one i was like reading like i like reading fine don't me wrong but it's like am i is it going to maintain my interest and i was shocked how in my hour and a half i like oh the there's voices to these characters as they go yeah and thematically just everything you're saying just reminds me of near right of like what does it mean to be human right like the idea of even like machine bodies versus actual bodies and like how much does a body matter and so like you know like I don't know that type of **** gets me and so i'm i'm excited to pick this up i i was uh i was just taking like some some photos of my Steam Deck just like moments of of of Brilliance with just small little entries of text right screenshot you can just hit the screenshot button uh on the Steam Deck I don't know how to do that really yeah it's like um the Steam button then click yeah yeah",
            "start": 2814.6
        },
        {
            "text": "small little entries of text right screenshot you can just hit the screenshot button uh on the Steam Deck I don't know how to do that really yeah it's like um the Steam button then click yeah yeah on like one of the one of the right bumpers I think I think it's R1 R1 but I I I just like wanted to read this I'm not going to include character names uh for spoiler purposes but I have this one thing it's like Steam button R1 you turn their coin over and over in your fingers you turn their coin over and over in your fingers as you stand in Flicker Row crowds pushing past on their way to whatever future awaits them your fingers glide over the worn metal as you imagine the characters have uh in moments of anticipation perhaps others before the coin came to become theirs have repeated the same ritual the same nervous routine but their fingers were human born not made this intrusive thought makes you slip the coin into a pocket quickly as if it had delivered a shock It is worn and",
            "start": 2857.8
        },
        {
            "text": "ritual the same nervous routine but their fingers were human born not made this intrusive thought makes you slip the coin into a pocket quickly as if it had delivered a shock It is worn and worthless it is bent and broken and it is beautiful in all those things and as you press your thumb against it your crooked Call's thumb again and again you realize you are the you are the corn you are bent you are broken it's like **** man this shit's just so good dude you what's what's hilarious is like I started to playing out my day of like oh what if I got home and immediately stream Citizen Sleeper too and I was like oh wait no this is pre-recorded the embargo wasn't for what if I went home and broke embargo I will say man Andy gave it a nine right in the Gamescast right before this a contender definitely not a game that I could stream just because of the amount of reading you have to read all that **** out loud even though I have so much fun like doing the voice acting stuff",
            "start": 2899.8
        },
        {
            "text": "definitely not a game that I could stream just because of the amount of reading, you know, yeah, you'd have to read all that out loud even though I have so much fun doing the voice acting stuff it's also one of those that I needed to kind of just experience this um and not be distracted because when I play if I'm streaming a game that's already you're already thrown in a distraction factor where it's easy for me to miss plot points and Miss stuff where I'm laughing at a joke in chat or I'm thinking of how am I going to entertain the chat in this moment, what funny line can I come up with here and when I was just there on the Steam Deck at night it was just like I was just in that world see the reason why I want to stream at first it's just for like the first stream of if I can have a reason for two hours to sit down and just have to play this and not be distracted like I want like I want it to grab me in those first two hours that way I can go off",
            "start": 2944.24
        },
        {
            "text": "stream of if I can have a reason for two hours to sit down and just have to play this and not be distracted like I want, like I want it to grab me in those first two hours that way I can like go off stream and then just play the rest by s cuz I'm like you where when I read I will read a paragraph and not internalize anything and then have to read it over again and so the idea of like having to sit there for a couple hours and like read it out loud and understand and like actually get a specific the meat of it and then like already be in cuz once I'm invested then we're good right, like that's what happened with me with um live alive where I played like the first chapter of live alive and was like oh man I'm playing the rest of this, like I didn't think I was going to be as into this game and now I'm into it so now I'm just going to cruise through this thing, oh and the music kicks ass too, like there's a lot of songs available on Spotify but just like part one Amos Rodriguez I believe is",
            "start": 2983.56
        },
        {
            "text": "now I'm into it so now I'm just going to cruise through this thing oh and the music **** kicks ass too like there's a lot of songs available on Spotify but just like part one Amos Abba is the name of the um musician and it kicks ass just like the first one did there's a lot of great Bops there's a lot of repeated Bops as well but even the the final song that plays during the I was telling Greg and and Blessing during the ad break like reading the final kind of paragraphs of as the game is ending and the music is playing I am just like an emotional wreck I like tears on my I was like man this is just I and the thing about the developer they mentioned that they are kind of done with Slay the Spire as a universe and they want to work on a they're making a tabletop game already but they mentioned I'm done with this I'm not doing this anymore and I'm just like pleading to any of my favorite developers like hire them to write for obviously they have their own game development",
            "start": 3024.56
        },
        {
            "text": "but they mentioned I'm done with this, I'm not doing this anymore, and I'm just like pleading to any of my favorite developers, like hire them to write for obviously they have their own game development studio, they're probably going to just make another game of this style sure but it's like man I just wish that their talents were you know let's emulate your brain put it put it in a robot body what does it mean to be human teaching AI to right just like this also to the Citizen Sleeper devs if you are selling the film rights to your IP we're interested in talking me and Greg are interested in having a little chat how can we capitalize on this not taking any of the lessons the whole plan of course is that we will do one of those we have to publish a movie every four years and we will agree retain the right for we'll just Resident Evil this thing and have a great one seen the Steam page by the way like we're on the Citizen Sleeper 2 Steam",
            "start": 3068.12
        },
        {
            "text": "mov retain the right for we'll just Resident Evil this thing and have a great one seen the Steam page by the way like we're on the Steam page, what yeah we have a quote on the Citizen Sleeper 2 Steam page and it's \"quote it's living up to the hype, it's a contender\" oh wow hell yeah hell yeah and it turned out it did it lived up to the A nine out of ten from the one and only Andy Cortez uh that of course is an amazing honor scale Citizen Sleeper 2 Starward Vector is out tomorrow January 31st uh pick it up or go play Citizen Sleeper one to see if it's your cup since it's on Game Pass it's on PlayStation Extra or PlayStation Plus Extra you can get that too but if you don't got that game pass the demo is still up on Steam as well fantastic I think the demo is probably up everywhere yeah but we already talked about this on the other show we don't know how to use demos on PlayStation 5 you know what I mean you down I got dots I don't know what's happening over here uh ladies and gentlemen and NBS",
            "start": 3112.84
        },
        {
            "text": "talked about this on the other show we don't know how to use demos on PlayStation 5 you know what I mean you down I got dots I don't know what's happening over here uh ladies gentlemen and NBS are you planning to pick up Citizen Sleeper 2 or is this a Time Loop and you've already played it and stuff let us know in the comments below what you think and what Drew you to it or what's keeping you away from it and then of course go ahead and pick up a Kinda Funny membership remember we're an 11 person small business that does live talk shows about video games all day every day uh and we couldn't do without you so head over to patreon.com kindafunny youtube.com/ kindafunny games apple and Spotify pick up a podcast and if you got no bucks like subscribe share tell your friends and until next time no it's been our pleasure to serve you",
            "start": 3156.44
        }
    ]
}