{
    "id": 13374,
    "video_id": "jMsGB2PItes",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Shuhei Yoshida"
    ],
    "title": "Shuhei Yoshida's First Interview After PlayStation - Kinda Funny Gamescast",
    "description": "This episode is sponsored by BetterHelp — go to http://betterhelp.com/kindafunny to get 10% off your first month.\n\nGo to http://expressvpn.com/kindafunny to get an extra 4 months free.\n\nGo to http://meundies.com/kindafunny to get 20% off your first order and free shipping.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1736994146,
    "duration": 7964,
    "transcript_chunks": [
        {
            "text": "What's up everybody Welcome to the Kinda Funny Gamescast for Wednesday, January 15th, 2025. I'm one of your hosts, Greg Miller, alongside the unemployed Shuhei Yoshida. He, Shu, how are you? Yeah, yeah, I'm I'm I'm unemployed. You're wearing a great Kinda Funny shirt, great Kinda Funny shirt, though. I'm very free, yeah. So I'm so happy and uh enjoying freedom. Free it is. You've had one day off, so you'd finished PlayStation, you'd had one day off, and now it's 9:00 AM in Japan, and you're nice enough to throw on a Kinda Funny shirt and come join us for the gamescast. Thank you so much, good morning everyone. Hi. So I mean first things first, I got a million things, I got a million questions all PlayStation stuff, but like do you feel like a giant weight has been lifted? I mean 31 years at PlayStation now you don't have a job. Well, I didn't realize how much the last five years I was in know one person Department doing Indie things and working with all different",
            "start": 1.71
        },
        {
            "text": "mean 31 years at PlayStation now you don't have a job well I didn't realize how much you know the last five years I was in know one person Department doing Indie things and working with all different uh Department people so I didn't have an organization to manage your staff to manage your budget you know what nothing right yeah so I I was so relaxed I felt and enjoying the you know work life however the last couple of months you know after especially after I um we made the announcement I I didn't realize how much pressure I was putting myself on and I was so really people told me how relaxed I look now and how happy you know I look you I tend to look happy but uh people who known me for years told me you know I look different oh even even I mean right now of course yes 9:00 a.m. you know you're you're bright eyed and bushy tailed here but even when we went to dinner when you were in San Francisco not too long ago in December like I said that to you at the bar I was like dang you you look",
            "start": 114.0
        },
        {
            "text": "you're bright-eyed and bushy-tailed here, but even when we went to dinner in San Francisco not too long ago in December, like I said that to you at the bar, I was like, \"dang, you, you've got a weight off of you.\" The fact that you're like, \"okay, cool, I'm doing this,\" and what you said felt... You graduated, right? Everybody's being so nice to you. You kept saying, \"Yeah, yeah, it's amazing.\" Amazing last six weeks after the announcement, the overwhelming volume of uh messages is all the great things people say to me and things they talked about the things they did with me many many years ago, you know, photos we took, yeah, unbelievable uh uh days that I spent for the last six six weeks. I you know I was excited to have this, it's your first podcast outside of PlayStation, it was a big deal, I thought we'd be the big news, but then lo and behold today you go and tweet you're not unemployed, you're a voice actor now uh you put out the game trailer for Promise Mascot",
            "start": 176.12
        },
        {
            "text": "It was a big deal, I thought we'd be the big news, but then lo and behold today you go and tweet you're not unemployed, you're a voice actor now. Uh, you put out the game trailer for Promise Mascot Agency, all these legendary Japanese voice actors, and then a gaming legend, Shuhei Yoshida, is in this game as well. How does that feel? Congratulations, thank you, thank you. I... well, I don't know if uh, you know they planned that way right after you know my leaving company, and uh it was great timing that they announced so it was a Tokyo Game Show last year, and I had a chance to show the game you know on stage uh as one of the upcoming you know uh great you know PlayStation indie games, and um as I was uh doing the uh uh stage show um uh we are playing live so you know because the game had a conversation and they didn't have voice over as yet, and I and the another you know host uh she and I are are taking roles to talk about uh uh play as the game characters, and I was playing the Mii, the lead character on that.",
            "start": 225.52
        },
        {
            "text": "have voice over as yet and I and the another you know host uh Shuhei and I are are taking roles to talk about uh uh play as the game characters and I was playing the Mii the lead character on that stage but uh what we doing uh developer was like um we should get Shuhei on the on the game I like this yeah yeah yeah I like this and they timed it out very well to ride your your freedom here to be able to say hey this is it well well that was my first ever really you know serious voice acting yeah and they are professional voice actors voicing the other characters so it was huge pressure and I I realize how hard it is you know to act oh yeah and you know just reading script but you know to become the character and try to convey the like emotions or personality it was so difficult and fun well Troy Baker look out she oh you did it as well right for my V game uh Shuhei I've done it for many games okay I'm a I'm a seasoned voice actor yes of course I was in solitary conspiracy I've been in",
            "start": 280.12
        },
        {
            "text": "well Troy Baker look out she oh you did it as well right for my V game uh sh I've done it for many games okay I'm a I'm a seasoned voice actor yes of course I was in \"Shadow of the Tomb Raider\" I've been in Lego Marvel I've been in DC Universe Online this isn't about me all right this is about giving you your flowers because this is the Kinda Funny Gamescast each and every weekday we run you through the biggest topics in video games whether they be reviews previews or interviews if you like that pick up a Kinda Funny membership of course you can get all of our shows that's more than 20 a week ad free the ability to watch the Afternoon Podcast live you record them in your daily dose of me trending gamer Greg Miller in a show we call \"Greg Way\" of course if you have no bucks to toss our way no big deal you can like subscribe share follow on youtube.com/KindaFunnyGames uh podcast services like Spotify apple and of course you can get that membership on Apple Spotify youtube.com/KindaFunny",
            "start": 338.24
        },
        {
            "text": "big deal you can like subscribe share follow on youtube.com/ kindafunny games uh podcast services like Spotify apple and of course you can get that membership on Apple Spotify youtube.com/ kindafunny games and patreon.com kindafunny to support an 11 person small business if you are watching live right now you can ask Shuhei your burning PlayStation questions or video game landscape questions by YouTube super chatting on youtube.com kindafunny games I already see so so many people coming in all right Ian CJ I see you will get to you don't worry housekeeping for you like I said kinda funny is an 11 person small business it's all about live talk shows today you've already got kinda funny games daily talking about ubisofts murky future and the stream was more of that movie game everyone is obsessed with if you're a member like I said supporting us my Greg way today was about if you have to finish a game to put it on your game of the year list thank you to our patreon producers",
            "start": 382.36
        },
        {
            "text": "I'm obsessed with if you're a member, like I said, supporting us. My Greg way today was about whether you have to finish a game to put it on your Game of the Year list. Thank you to our Patreon producers, Delaney, Twinning, and Carl Jacobs. Today we're brought to you by BetterHelp, ExpressVPN, and MeUndies. We'll tell you about that later. For now, let's start the show with what is and forever will be the topic of the show: Dots... Dots... Do... Dots. Great job, Shu! You're there; you're a fan. I love it. Thank you, thank you, Shu. He's 31 years old; it's done. You've left PlayStation. The first question has to be asked: Who do you hate at PlayStation? Oh, that's wow... Um, did you hate Heron? Was it Herman? Did you hate Herman? Uh, no... No, I don't think I ever hated Heron... Even though he took my job. Time! Yeah, he took your job; he took your job. He took my job. You were his boss at one point when you were president of Worldwide Studios. You're telling me Herman never was like, \"Missed a deadline, decided to make another Killzone?\"",
            "start": 426.96
        },
        {
            "text": "your job he took my job you were his boss at one point when you were president of Worldwide Studios, you're telling me Herman never missed a deadline, decided to make another Killzone and you were like \"bro come on no no no no no\", well they did amazing Killzone 2 right and Killzone 3 was great and The Shadow Fall, the launch title, and I love the V.A. game KZone game yeah of course and of course Horizon: Zero Dawn was amazing, concept and uh you know so um it was you know we we always did every year at E3 after E3 we gathered the you know people from Studios and they showed their what they doing each other like a sharing ideas and tech and K team um G.U.A. team presented the concept two concept actually they working on as a prototyping yeah and uh get all the studio people to vote for which project they should do next and one of which was Horizon: Zero Dawn and that looks so amazing and yeah so when we under GDC a few years after uh was the day of the launch of the game so we are we gathered together you",
            "start": 478.36
        },
        {
            "text": "they should do next and one of which was Horizon and that looks so amazing and yeah so when we under GDC a few years after uh was the day of the launch of the game so we are we gathered together you know during the GDC you know Studio people we got you know gather together so twice a year we got together together as a worldwide Studios teams and uh we celebrated the launch of Horizon together we did the countdown you know at the midnight um anyway so it's hard to hate him yeah got it yeah so who else um Kojima sounds so difficult hard to work with but he made PlayStation right he gave us all to uh have chance to work in this amazing in that amazing company and in my case for you know long time and Gave me uh uh did amazing careers so even though uh it was really hard uh to work for him um and we always talked about Kojima after hours you know when we go to drinks you know there there's always that person right oh yeah that person never exist in the party but everybody talking about that",
            "start": 538.68
        },
        {
            "text": "um and we always talked about K after hours, you know when we go to drinks, you know there there's always that person right oh yeah that person never exists in the party but everybody talking about that person so okay was one of those people how harsh he was or how difficult he changed mind all the time now one of my favorite Shuhei Yoshida stories of course is that you know you came to life for us when we were making podcast Beyond, you tweeted at me that you loved the show there was a whole thing it led to an interview it led to this friendship yada y y years into being your online friend and then obviously you're in real life friend I think it might have been no I was going to say it's Scott Rohow but it wasn't it was another developer who we were out for drinks when they were showing their game and I mentioned how great you were and how how much I loved you and they stopped dead and they looked at me and they were like do you understand how scary this man is like he and me like you think",
            "start": 615.56
        },
        {
            "text": "and I mentioned how great you were and how much I loved you and they stopped dead and they looked at me and they were like do you understand how scary this man is like he and me like you think he's so nice you think he's this teddy bear you think he's so funny on Twitter I've been in meetings where he you present the game for 30 minutes and then he goes what's fun about it what like what is this why is why are you trying to I heard you can say that Ken is tough Ken Kazaris used to be a tough guy and you'd go talk about him from what I understand people used to go talk about you that way Shu yeah I kind of remember that do you think that's good good thing good thing is the last five years yeah I was not like that so so the last five years I was working with uh uh young people in all different kinds of parts of the company you know St people tpr in marketing social they didn't know me like that yeah so they being all friendly and it was so fun and and they they couldn't believe",
            "start": 663.04
        },
        {
            "text": "Shuhei Yoshida's First Interview After PlayStation - Kinda Funny Gamescast\nkind, you know parts of the company, you know St people in marketing social, they didn't know me like that, yeah, so they being all friendly and it was so fun and and they they couldn't believe when someone said I was such a such a hard ass, oh yeah, so do you think that that comes from starting the way you did with PlayStation like you said, you know, you joined Ken's team, you joined the original PlayStation team in '93 and if correct me if I'm wrong, you join and you're the first non-engineer to join right, so like there must have been tremendous pressure put on that entire team let alone you then to justify your role in the whole thing, uh, so you know, so I when I was managing World Studio, that's the time people kind of uh knew me as a difficult uh boss because you know of course I was responsible for the final quality of the games right first party games but uh because the company is so created this environment for us to really you know they are saying in the English that give them enough",
            "start": 706.64
        },
        {
            "text": "for the final quality of the games, right, first-party games, but uh because the company is so created this environment for us to really you know they are saying in English that give them enough L right they hang themselves yeah so the company really gave us a chance to really do our best and gave us time and resources and understanding we always you know delay the game and exceeded budget and got complaints but in the end they trusted us, in the end we did you know a great job with the game in terms of uh quality and delivery so because we I knew we are in that environment if we don't do a great job making games it's all our fault right there's no one else to blame so so that's that's the reason I was so like demanding, demanding maybe the time yeah but with all respect with all respect for these you know great people making games well I mean it right I was again you know doing my research beforehand not that I need any refreshers on Shuhei Yoshida but I enjoyed the way uh when you",
            "start": 767.92
        },
        {
            "text": "for these you know great people making games well I mean it right I was again you know doing my research beforehand not that I need any Refreshers on Shuhei Yoshida but I enjoyed the way uh when you became a bat to fellow uh they put out this as president of SIE's Worldwide Studios from 2008 until 2019 Yoshida was among those responsible for producing several wildly popular franchises such as Uncharted God of War The Last of Us Horizon Zero Dawn Ghost of Tsushima MLB The Show Journey Bloodborne and six titles in the Ratchet and Clank franchise that's I think being a hard ass paid off sh that's a pretty great run of PlayStation exclusive games not even bringing in things like you know the last guy that you guys did and stuff well well the good thing is you know people don't remember bad games right people remember great games and uh people don't know how many games we cancel right sometimes we announced and cancel so people know you know about these games uh but but uh you know we",
            "start": 833.68
        },
        {
            "text": "right people remember great games and uh people don't know how many games we cancel right sometimes we announced and cancel so people know you know about these games uh but but uh you know we so because we are a big fan of doing new IPs right and trying new IP is always risky right so we start new game and evaluate the Prototype and if it doesn't look good we give more time or we just cancel it right stop early that's very important so people don't know how many can uh cancellations uh we have done so I want to stop you there because again this is you know 31 years of PlayStation I'm expecting people to have known your your whole history to some degree and y y I want to get into it but but right here this is a question like I think that speaks so much to blind spots for me sure as press but me as a fan as well when you're working on a game or you're you know either working on a game like when you were a producer or when you're a head of Sony Worldwide Studios and you have all these",
            "start": 883.28
        },
        {
            "text": "but me as a fan, as well, when you're working on a game or you're, you know, either working on a game like when you were a producer or when you're the head of Sony Worldwide Studios and you have all these developers showing games - how do you know when it's \"well, let's put our heads down and push for another year, try to find the fun in this\" or is no, we're stopping right here and we're canceling this project? Well, you know, you have to rely on your instinct. Right? In the...in the well of course, the game...what the team is trying to do and what's the foundation they are able to uh develop to build the game up and their experience of uh polishing and finishing the game in the past - and of course, the like a commercial kind of uh thinking: you know how much more money we have to spend and what's the revenue and profit we can bring in and compare that. But the you know forecasting sales is a is a black magic - you know no one can...no one can...you know I I you know after so many",
            "start": 939.96
        },
        {
            "text": "to spend and what's the revenue and profit we can bring in and compare that, but the you know forecasting sales is a black art, you know no one can, no one can you know I I you know after so many years in making games and in the industry, I don't trust any marketers who say that they can forecast game sales right, who would have predicted Horizon Zero Dawn to sell more than Spider-Man too? Right, Namco. So that's the nature of the business, so so you know of course we look at the commercial side of things but in the end you know you have to trust your gut. The biggest one I did was the PS3 generation, it was a huge cancellation, the biggest one I did was the \"The Last Guardian\" project, you know two projects after we spent $25 million so that was a huge cancellation at that time, but these days the size of the games is even bigger, so you know we see and hear about bigger cancellations, but you know $25 million, we've spent so many years on a team worked on do we stop",
            "start": 997.24
        },
        {
            "text": "at that time but these days size of the games is even bigger so you know we've seen and heard about bigger cancellations but you know $25 million - we've spent so many years, a team worked on it. Do we stop that now? So that was really a difficult decision we had to rely on. So no one knows right there's no A and B comparison if we had continued these games we might have had another game of the year who knows right yeah so who was making the games you canceled, which was 25 million dollars - I didn't say but studios so that's another thing. So what I always said and thought about is a great team, talented team, brilliant people um and spending so many years in development, they worked on this project. They got crushing so in order to make it a little bit uh more um acceptable I always said that I don't want you people - great people to spend another three years on this rather I want you to start something totally fresh and new um so so that's the best",
            "start": 1060.92
        },
        {
            "text": "uh more um acceptable I always said that I don't want you people great people to spend another three years on this rather I want you to start something totally fresh and new um so so that's the best better way of spending your talent that's that's how I tried to explain and they were like screw you I quit I'm not working for you another three years K some some some of them some so I appreciate so much that you obviously we're not going to talk about the specifics of these games that were canceled that's fine so stick with me this let's do a positive take on the the line of questioning we're on for you as Worldwide Studios boss what do you think was the most unexpected surprise you brought up Hellblade 2, which of course is after the fact that's more recent you were already over at Indies but when you were there what was a game that you're like oh this is cool and it's going to do fine and instead it went to the moon went to the moon that's a good way that's a positive take on oh yeah that's up",
            "start": 1126.12
        },
        {
            "text": "but when you were there what was a game that you're like oh this is cool and it's going to do fine and instead it went to the moon went to the moon that's a good way that's a positive note oh yeah that's up it's through the roof through the roof through the moon through the moon w I have to say Grand Turismo right Grand Turismo really yeah yeah yeah yeah well so the team that it was one of the first uh games I produced co-produced with Koji Yamashita and they had done two MotorGP games like kart racing games on PS1 that was a great game you know great cars but their next game was the uh Grand Turismo and of course the game had amazing visuals and the great car physics system uh but yeah so when the game was launching I was hoping that oh yeah if this could do you know million or maybe two million units or you know like that yeah it was a 10 million seller and tens of millions so yeah yeah I have to say Grand Turismo was the first huge surprise good in a",
            "start": 1182.48
        },
        {
            "text": "or maybe two million units or you know like that yeah this like a 10 millions and tens of millions so yeah yeah I have I I have to say Gran Turismo was the the first you know huge surprise good in a good way that uh I experienced this will sound negative but it's not cuz obviously the game got through and you made it and blah blah is there a game you think of like I can't believe that didn't do more is there a game you're like this is going to be a huge hit this is going to you know I know it's black magic to guess numbers but you were like this is going to be something amazing in terms of sales and it just didn't find that audience well yeah sometimes you know when a new IP launches and gets a great great reception you know the uh people want the sequel right they want more of that so the team makes sequel and you know many often times the second game does better because they are already millions of PS users but sometimes you know the one I I was a bit surprised you know in",
            "start": 1237.4
        },
        {
            "text": "team makes sequel and you know many often times the second game do better because they are already millions of PS units but sometimes you know the one I I was a bit surprised you know in terms of the number of units did was the uh uh second Horizon game okay you know I love Horizon games and the game did well and I was hoping that the sequel would do even better in terms of sales the game was bigger and you know great of course but I don't think the second one did as many units as the first one for sure so then for somebody who's just joining us 31 years of PlayStation history talk to me about that how does that start for you because of course you can go through and you can read your Wikipedia page and we see you doing stuff with Sony but how do you go into hey I'm going to go work on this PlayStation project how does that start for you yeah so I joined Sony Corporation the electronics company in 1986 and uh I was right out of college you know I joined Sony you know for one I",
            "start": 1286.12
        },
        {
            "text": "on this PlayStation project how does that start for you yeah so I joined Sony Corporation the electronics company in 1986 and uh I was right out of college you know I joined Sony you know for one I wanted to work outside Japan and uh Sony is 80 plus percent of business was outside Japan so I was hoping that but at the same time you know it's unbelievable but I believe Sony in the future will do video games because Sony doing like a consumer low end personal computers you know like a hobby PC and because you know gaming system is a computer so I was hoping the Sony would get into the video game business and I I was hoping to join that team I want to hard stop you right there were you hoping because you were already playing games you were already enjoying games you wanted to oh yeah yeah yeah I I was a huge game fan yeah from the uh early arcade days you know when I was a kid you know the new arcade came you know table top you know Pac-Man or you",
            "start": 1340.32
        },
        {
            "text": "you wanted to oh yeah yeah yeah I I was a huge game fan yeah from the uh uh arcade early arcade days you know when I was a kid you know the new arcade came you know table top you know Pac-Man or you know uh uh uh uh what's a shooting game asteroids uh space Space Invaders yeah like that yeah so yeah so I have a huge you know video video game fan and I wanted to work on video games if Sony you know when Sony got into it and I was talking about that so maybe that's the secret you know when you want to do something talk about it to whoever will listen because the when I joined Sony I joined in the headquarters function and the boss at the time, Teruaki Toya, was uh managing the helping the new business and one of the new businesses was K Team making audio chips for Nintendo's Super Nintendo system yeah so Super Nintendo system had the audio chip that K Team designed that's the reason Super Nintendo games sounded so good right yep and and they were working on the CD-ROM system for the Super Nintendo",
            "start": 1403.68
        },
        {
            "text": "yeah so Super Nintendo system had the ADPCM chip that Konami engineers designed that's the reason Super Nintendo games sounded so good right yep and and and they were working on the CD-ROM system for uh Super Nintendo oh I remember and uh the original PlayStation that didn't come out so the Teruyo's team my team another person was assigned to help Ken's team but that person was not you know uh knowledgeable about video game industry so I was giving lots of advice to that person my colleague that you know if uh you know Ken's working on 3D Graphics you know work with Namco or something like that sure and so Teruyo remembered me talking about video game and huge video game fun and when I was working in the PC personal computer Department in Sony he called me and asked me to meet this person Kaji and it turned out to be an interview so I joined Ken's team and two weeks after Teruyo came as the boss of the department boss of K so Teruyo was you know of course he was coming you know to join Ken",
            "start": 1469.28
        },
        {
            "text": "Kojima and it turned out to be an interview so I joined Sony's K Team and two weeks after that, Ken came as the boss of the department, boss of K. So Ken was you know, of course he was coming to join me and he started gathering people he knew that he thought he might be able to use. That's how I got into Sony's PS team. So when you come in there, how do you transition from \"I know I know game stuff\" but I'm working on this chip or whatever to then being the guy who's like producing titles who's you know giving feedback to developers? How does all that happen? Yeah, thank you, thank you. So when uh I started uh in Ken's team it was Ken's team was designing working on the very first PlayStation and everyone else was an engineer, right? You know, like 30 people or so, and I was the first non-technical person and I was assigned to uh uh do the like outreach in the industry, Japanese video game industry. Because K Team was getting ready to talk about PlayStation and uh and evangelize and trying to get the",
            "start": 1527.8
        },
        {
            "text": "I was assigned to do the outreach in the industry, Japanese video game industry, and because K team was getting ready to talk about PlayStation and evangelize and trying to get the Japanese publishers to make games on PlayStation, so that was my first assignment. And I made phone calls to companies from Hokkaido to Kyushu and brought together a team of leaders from K's team and presented and talked about this is great 3D graphics, real-time 3D, and can you make games on PlayStation? But most people, especially large companies, that 3D graphics doesn't help video game, it may work for racing games or shooters but not other games. Anyway, so that's how I got into the uh what we now call third-party relations department. I was one of the lead account managers, I was helping Konami and these Japanese publishers",
            "start": 1582.96
        },
        {
            "text": "how uh I got into the uh um what we now call third party relations department so I was one of the lead lead account manager uh I was helping Namco Bandai and these you know Japanese Publishers of course so I did it for four years I think uh with a group of account managers and me and um so because I was not uh because working on through uh through the work that we did I did I got to see how the new game is uh planned and presented and see you know milestones as I talk to and visit you know Namco and Konami and these companies they showed me what they've been working on so I kind of got the sense of the process of how video games are being developed so maybe that helped me to give some perspective and also you know as uh working with marketing uh and sales department from these Publishers so I learned the things you know from these people about marketing video games so um but but I didn't think at the time I would be able to join the game uh production team uh because I have I I cannot",
            "start": 1643.36
        },
        {
            "text": "so I learned the thing you know from these people about marketing video games so um but but I didn't think at the time I would be able to join the game uh production team uh because I have I I cannot program or I cannot create art or nothing right but yeah I feel like that'd be the biggest thing of like listening to your story and now you're getting these skills it starts to make more sense to me CU I would feel like I would feel like even now I can tell you what I like or don't like about a game but to sit there you know and it's like gray box or it's in Maya or it's just a pitch for I would feel so like well I've never made a game so me criticizing what you're doing at this stage I wouldn't feel like I would know I have a leg to stand on in the argument but obviously if you're seeing it already and going that makes more sense yeah yeah yeah so you know working with large company like Sony you know I learn you know people great people from these companies and also at the same time",
            "start": 1710.76
        },
        {
            "text": "already and going that makes more sense yeah yeah yeah so you know working with a large company like Sony you know I learn you know people great people from this company and also at the same time we wanted to find new exciting games you know from new developers right at the third-party department that's another thing we always wanted to find out new uh teams new talent uh so um and so lots of submissions like uh you know game pitches and like that so we are able to see many different like examples of how games are pitched how games are developed uh so that might also have helped me to look at what makes great games and what kind of teams and people make great games sure so I was always thinking about and also as a gamer uh I when I play game I always thought that why I I'm enjoying this game what about this game I'm so happy about playing uh so you know kind of analytical kind of thinking while I'm playing and I so for the last 30 plus years I think I never didn't do that I",
            "start": 1758.4
        },
        {
            "text": "this game what about this game I'm so happy about playing uh so you know kind of analytical kind of thinking while I'm playing and I so for the last 30 plus years I think I never didn't do that I I I always did that to think about games you know I played you know if I liked why I like this or you know games are popular uh I I try that game and try to understand why people enjoy this game sure and also read interviews or listen to or watch interviews and try to find out the people who made great games how they did it right yeah so that that's the for for the last 30 years I think I always always tried to because it's so magical of course yeah yeah in those 30 years of analytically thinking about games but more importantly maybe for this question creators what have you found like what do you what when you meet a developer and you listen to them talk about their game what are you looking for not only from the game but from them as a person them as a Creator yeah yeah sometimes you know",
            "start": 1816.56
        },
        {
            "text": "what when you meet a developer and you listen to them talk about their game what are you looking for not only from the game but from them as a person them as a creator yeah yeah sometimes you know you meet a creator who does not say this game is like you know sour like in the Souls series or yeah but but sometimes you know developers says you know this game I want you know people to feel this way and that way you know you know when you do this this is so cool I want to create the feeling of doing these things in this game like having very deep thinking of what kind of experience that the creator is trying to deliver to the player uh so you know there are few people in the industry who does that and that that's the kind of people I really uh respect and often times great names come from these creators yeah usually not saying you're copying something means you're on to something original right oh yeah yeah well it's it's kind of common right you know especially trying to",
            "start": 1883.88
        },
        {
            "text": "come from these creators yeah usually not saying you're copying something means you're on to something original right oh yeah yeah well it's it's kind of common right you know especially trying to find the funding right so people who are not in the industry who have money you know it's easy to explain your game associate with other successful games so yes that's why everything's trying to be Fortnite right you have all these investors and they're saying how do we make money like Fortnite you like oh my game's a lot like Fortnite I have a battle pass and they go okay let's go and then six years later it never comes out um before we get too far into the present the first days of PlayStation you start on this new team it's exciting it's what you've been kind of wedded to since '86 is there also a is there any fear is there a trepidation you're starting off and launching is is PlayStation ever going to see the light of day is PlayStation or is Sony going",
            "start": 1947.92
        },
        {
            "text": "existence since '86 is there also a is there any fear is there a trepidation you're starting off and launching is is PlayStation ever going to see the light of day is PlayStation or is Sony going to cancel it or not want to do it do you worry about that at all so uh because I love video games and I really wanted to work in video game uh as Sony uh so the goal my personal goal uh as I joined uh Ken Kutaragi's team was to help you know somehow contribute to make uh PlayStation uh be successful so that I can keep working on this project working on video games so that was the that was the most important goal I think for me uh so I was always thinking about the overall you know how PlayStation is doing in not just the thing I was uh directly responsible for but the I was always thinking what's lacking with PlayStation what needs to be done from you know game to platform to marketing to you know whatever uh so uh that that's how I I was always thinking the most difficult time uh during Ken Kutaragi",
            "start": 1991.32
        },
        {
            "text": "Lacking with PlayStation, what needs to be done from game to platform to marketing to whatever. So that's how I was always thinking the most difficult time during PlayStation, other than the launch of PS3, which was hard, but during PS1 days, you know we launched in Japan in 1994, the next Christmas, Christmas '95, we didn't have a big title for the Christmas and at that time in the industry, the Christmas season was so important, 100%. But um, we didn't have, you know, we had Konami's Dating Game, you know, \"ToiM Making Memorial,\" that was a great game, but that was the only game. And at that time, we were competing with Sega Saturn and Sega had Virtua Fighter 2 - it's an amazing game, an amazing game, hugely popular in the arcade. So the Christmas, the second first Christmas was great, you know, we had Ridge Racer, they had Virtua Fighter, so we sold out hardware, so both our companies did great, but the second Christmas, Sega Saturn was doing...",
            "start": 2048.96
        },
        {
            "text": "second first Christmas was great, you know we had Ridge Racer they had B of Fighter so we sold out, you know Hardware uh so both our companies did great but the second Christmas uh Sega Saturn was doing better so that was the most difficult time that I I felt as a uh as part of PlayStation when you say it's the most difficult time and what does that mean is it the morale is it pressure from the bosses, boss what what does that look like yeah because I was one of the you know leaders in the third party relations team the responsibility is to bring great games you know from third party companies and uh we are not able to deliver that Christmas so that was really you know tough of course uh I I want to talk about your Ascension to being but you bring up the PS3 talk to me about that how hard of a launch that was like what again is that like I I you know is this before Slack so you're in the office you're talking about this you're looking at numbers like when something like that happens",
            "start": 2121.08
        },
        {
            "text": "of a launch that was like what again is that like I I you know is this before PSN so you're in the office you're talking about this you're looking at numbers like when something like that happens when the PlayStation 3 comes out and doesn't do like where when do you remember being like ah we're in trouble on this one yeah so before the launch of PS3 because uh we you know uh we got the prototype hardware right yeah to work on you know first part and the team start working on and uh months it took months multiple months to get the team to have something on screen to see it know the PS3 CPU was such a uh Advanced kind of um um architecture the Cell processor never forget yeah Cell processor has the multiple processors inside the processor and uh um programmers have to divide the program into uh these uh different chunks to uh simultaneously use uh these processing power to draw the you know potential power of the hardware and uh you know great people makes it amazing performance you know",
            "start": 2179.64
        },
        {
            "text": "These different chunks to use simultaneously, the processing power to draw the potential power of the hardware and great people makes it amazing performance. The Peak Performance of Cell processor was huge; it was even banned from exporting to certain countries because it was considered supercomputing might be used for military usage or something. However, it's so hard to program that I learned from our studio teams that was scary. And another thing was the cost of goods we never announced, but it was so um... because the company built a factory to manufacture the Cell processor and the development of the Cell processor was a huge project with IBM and Toshiba, like multiple companies, lots of people involved, so the development cost was huge and manufacturing investment was huge. And when I was talking with Ken Kutaragi and he explained",
            "start": 2249.64
        },
        {
            "text": "it you know like multiple companies lots of people involved so the development cost was huge and Manufacturing uh investment was huge and uh one when I was talking with Ken Kutaragi and Ken explained the business model of sales processor was so he was Thinking Beyond video game right he had a huge Beyond um huge Vision that yeah well you know people said he he was competing with Intel at the time so he said that we're going to build the so PS3 would be huge and uh he said he's going to uh we're going to build as big new business new business outside the video game based on self processor so that was his uh business plan so when you hear that what what do you think oh okay we have to build a as big a new business out of this thing otherwise we won't be able to recruit the investment no big deal was that was scary yeah and of course that Vision didn't happen unfortunately and then one of like the big parts of the PS4 was like hey it's not the cell it's a PC it'll work you're C out there",
            "start": 2322.36
        },
        {
            "text": "deal was that was scary yeah and of course that Vision didn't happen unfortunately and then one of like the big parts of the PS4 was like hey it's not the cell it's a PC it'll work you're out there trying to tell every developer to bring their own stuff yeah yeah yeah yeah that was nice so so the launch year and the second year after launch the company made huge losses um yeah so I thought you know we would be over we are over uh but but luckily uh during these years Sony's TV division had a huge hit with a flat screen big screen LCD not CRT but called the Bravia series success yeah yeah so the Sony parent company made lots of money to cover the loss from PS3 so we survived was there ever a concern from you that you wouldn't that PlayStation wouldn't survive that oh yeah when I learned about the losses we were making I was like oh we are we are finished and so then I you know PS3 I feel like Sony Worldwide Studios you obviously 2008 this is when you take over for the president role",
            "start": 2395.36
        },
        {
            "text": "about the loss we are making I was like oh we are we are finished and so then I you know PS3 I feel like Sony Worldwide Studios you obviously 2008 this is when you take over for the president role but I feel like PS3 is really where that concept and becomes a thing where people really do think about what would become PlayStation Studios and we talk so much about first party and what people were making and all these different things like was that because people now had to work so collaboratively because of the Cell processor you're saying it's so hard to make stuff for it were people having to share more stuff and did it feel like it was y'all against the world um so Worldwide Studios was formed in 2005 yeah in you know um that was Ken Kutaragi's creation you know Ken's Vision uh because the games are becoming larger in scope and we are divided you know three different companies within the company and Sony Computer Entertainment Japan, US, and Europe had a totally different uh production",
            "start": 2460.68
        },
        {
            "text": "games are becoming larger in scope and we are divided you know three different companies within the company and Sony Computer Entertainment Japan Asia and Europe had a totally different uh production teams and making games uh individually um in and and each of us were like a midsize like a publisher and uh he thought Ken thought that you know it's about time to you know combine all the resources together to create the global organization so that was Worldwide Studios and um luckily uh because that happened and the PS3 was so challenging to work on um uh we uh leveraged the best of the best you know technical expertise within the various Worldwide Studios For example like a um um uh engine program that Notch did and Markus created um uh we uh provided uh made that available for all the teams you know in Worldwide Studios to uh make games on PS3 to extract the you know performance necessary to make uh games on PS3 and eventually because uh uh third party companies Publishers uh also struggled uh we made you know these",
            "start": 2516.04
        },
        {
            "text": "to make games on PS3 to extract the you know performance necessary to make uh games on PS3 and eventually because uh uh third party companies Publishers uh also struggled uh we made you know these programs available made available uh through our development portal uh to third party companies as well so uh so under Studio Phil Harrison and I worked you know to make it so that the you know teams let's you know collaborate let's share the you know ideas and uh you know knowhow and even Technologies tools together uh to learn from each other so that's how you know I started that twice a year Gathering of developers yeah during GDC and the three time and K succeeded Kutaragi to the head of PlayStation and he wanted one Studio teams to join the hardware development so you know after Ken left uh there are two new project PS Vita and PS4 so you know I helped you know how team to get Mark Cerny on board to become the Chief Architect of these Hardwares uh PSV and PS4 and uh you know I",
            "start": 2579.76
        },
        {
            "text": "Uh, there are two new projects, PS Vita and PS4. So you know I helped you know how to get Maru to on board to become the uh Chief Architect of these hardware uh PSV and PS4. And uh you know I moved to Japan, you know, me to move from us to Japan uh because uh he wanted me to work closely with the hardware team so while managing World Studio uh part of time I spent uh participating in Hardware uh meetings like PS Vita or PS4 meetings. And uh every time the hardware team had a question like uh there are lots of uh choices they can make you know what kind of device or technology they should uh choose to include in the future platform hardware um um they want to make the hardware uh best for the games so they really appreciate I appreciated me to connect the hardware team with the studios like Santa Monica Studios, na you know, games media Mo whoever has an a good idea uh on that particular technical topic that hardare team had in question. So hardare teams have created the prototype and",
            "start": 2644.6
        },
        {
            "text": "like Santa Monica Studios na you know g games media Mo Whoever has an a good idea uh on that particular technical topics that hardware team had in question so hardware teams have created the prototype and provided to all our studio teams and our studio teams created prototype games based on the prototype hardware and sent back to the hardware team and we gathered together and discussed and we I invited the hard team to join the you know Studio Gathering meeting during GDC and E3 so that they can have one you know one one you know face to face meeting to discuss these you know uh Hardware specification discussions and one great example uh fruit of that effort is uh for PS4 you remember du 4 had the share button right yeah I've heard of it once while yeah so the PS4 was the very first hardware game hardware to that anyone can become a streamer that idea came from Santa Monica Studios team no way they created this put together this presentation Nathan Gary uh who you know uh created in Ana",
            "start": 2714.04
        },
        {
            "text": "game hardware to that anyone can become a streamer that idea came from Santa Monica Studios team no way they created this put together this presentation Greg Miller uh who you know uh created in Ana interactive later and left on a interactive last year yeah so he put together a slide saying that now that YouTube and twitch are becoming popular how about adding a dedicated button on controller so that anyone can just press the button and start streaming the games from PS4 so that the hard team of the idea and that became the share and it was a brilliant idea right I think it was one of those things that was ahead of its time and now it's quaint because it's so easy to stream everything everywhere and everybody's doing it but I remember like you think of uh what would go on to become kind of funny but me streaming on my personal YouTube by GameOverGreggy and it was that idea of the hoops I had to jump through to make it work but this was TurnKey everybody could suddenly do it and try",
            "start": 2776.92
        },
        {
            "text": "funny but me streaming on my personal YouTube by GameOverGreggy and it was that idea of the hoops I had to jump through to make it work but this was TurnKey everybody could suddenly do it and try it and see if you liked it right like you could go live and get the two viewers you might get but you'd know if it works and you'd be able to see if you enjoy doing it like it was a brilliant maneuver and I think that comes from the collaboration you're talking about and I'm glad it works so well for PlayStation 4 but I need to ask Why didn't it work for Vita Shu where did we go wrong with PlayStation Vita you and I love the Vita you know we love it what happened Yeah well yeah then you know MP reasons right why VA didn't work um well you know it worked in a way that people love playing games especially you know indie games on PSV that right yeah yeah yeah so it was lovely Hardware you know I loved it people loved it GI Coy loved it you know almost too much right course to the show",
            "start": 2831.32
        },
        {
            "text": "especially you know indie games on PS Vita that right yeah yeah yeah so it was lovely Hardware you know I loved it people loved it GI Joe loved it you know almost too much right course to the show when PlayStation wanted to stop talking about Vita Gio and you would not let them stop talking about Vita yeah absolutely I remember you and calling always doing trying to help V the like a Vita Island right even tried to recycle people who stopped playing PS Vita you know send us so that I can provide the Vita relocation program never forget yeah a video we tried to we tried to Debunk that during our we did a PSX panel we did a Beyond panel for PSX every year and we tried to debut that video maybe it was PS I Love You even at this point it might have been PS I Love You it doesn't matter we tried to debut the video at the relocation thing at PSX and PlayStation PR called me the night before and they're like we're not going to we're not going to no we're not showing this video where you're talking about the",
            "start": 2877.68
        },
        {
            "text": "at the relocation thing at PSX and PlayStation PR called me the night before and they're like \"we're not going to show this video where you're talking about the platform being dead\" and then people should send it into you to give it away I digress, where do we go wrong was it the back touch or was it the touchscreen so the you know positive side you know when PS Vita started you know Mark Cerny got brought on and our team started joining and the original idea uh for the so so the you know core processor yeah was a different one and that was going to be a failure uh from our you you know team standpoint and Mark so we are able to convince the team to change the main processor so that was the very first contribution and uh you know we did a lot of uh you know conversations discussions and making prototypes and several technical uh choices uh we as a company made uh didn't really was a good one the you know uh one one of which was the like a um um um",
            "start": 2929.64
        },
        {
            "text": "conversations discussions and making prototype and the several technical uh choices we as a company made didn't really was a good one the you know one one of which was the like a proprietary memory card right yeah proprietary memory card that was a mistake people have to spend more money to get the memory card yeah and the back touch was not necessary right it was sometimes the team made amazing prototype that feels so good that misled everyone involved that oh this would be great but the back touch was not it it added additional cost to the hardware I think all was okay it was such a beautiful screen it was such an amazing one but the cost was higher yeah I'm talking about the cost and the one feature the hardware team had in the development Hardware like a dev kit for PS Vita you know the same kind of unit but it had a video out so that you know",
            "start": 2977.24
        },
        {
            "text": "about the cost and the one feature uh the hardware team had it you know in the development uh Hardware like a dev kit for PlayStation Vita, you know the same uh kind of unit but it had a video out so that you know a developer can connect to screen like a you know Monitor and develop games on and somehow you know team decided to take that feature out from the consumer I mean who would want a handheld you could also play on the TV it just doesn't make sense it's just really a bad idea right so team removed that feature just to save a few cents of cost from the hardware so that was not um but I think the biggest reason in my mind it's not a popular kind of thinking but I think the biggest reason for PlayStation Vita didn't do as well as we had hoped was we had to split all our efforts resources into two different platforms sure and Company didn't we didn't have that uh resource so you know PS3 and PS Vita or PS4 and PS Vita you know Studio had to decide which team to work on which and uh we",
            "start": 3056.84
        },
        {
            "text": "two different platforms sure and Company didn't we didn't have that um uh uh resource uh so you know PS3 and PS Vita or PS4 and PS Vita you know Studio had to decide which team to work on which and uh we didn't have that big uh uh talent uh talent pool to be able able to uh support two different platforms and of course you know console is the biggest platform we have to support PS3 and the launch of PS4 really we had to stop many projects from Vita because we didn't have a team to make PS4 games so otherwise so I I I think that's the biggest reason and and I think you know it's this is another personal thinking uh one of the reasons of the big success of Nintendo Switch is they uh stopped you know making working on two different platforms they always had you know console and handheld right and uh and it's like opposite of us Nintendo did very well on handheld but not so well on the console uh so it was different from our side but Nintendo Switch all first party just went to just one",
            "start": 3121.04
        },
        {
            "text": "uh and it's like opposite of us Nintendo did very well on handheld but not so well on the console uh so it was different from our side but Nintendo Switch all first party just walked on just one hardware right so that I think really helped oh 100% switch yeah I think so I I think that's the biggest reason was there and when you see the Switch and you understand what they're doing with this is obviously a debut I'm talking about had there ever been even an inkling of a conversation on PlayStation side of like what if we did that or was it I mean was it just oh well we make the Vita we make the console we make a handheld we make a console like you're was there ever even a conversation in a you know brainstorm of like what if we just did one um when I saw Nintendo Switch uh I thought oh this is a PS Vita 2 and it's a step of how great to play indie games on right yeah yeah it's an amazing system for indie games um but um in terms of if a company thought about making a system like",
            "start": 3185.32
        },
        {
            "text": "oh, this is a PS Vita 2 and it's an example of how great to play indie games on right yeah yeah it's an amazing system for indie games um but um in terms of if a company thought about making a system like that I I don't think so because PlayStation Legacy was to provide The Cutting Edge uh great Hardware performance hardware at a very affordable you know price and make the never seen before amazing uh you know especially Graphics games uh on Console so that was the you know Legacy so moving from PS3 generation to PS4 generation uh actually PS4 uh was designed uh alongside the PS Vita so yeah so PS4 is already in the making uh so after PS4 again you know the PS4 is so successful it's just uh uh natural to create a new hardware that's Backward Compatible with PS4 right that's the extension or in expansion of PS4 so that was PS5 so then before we move out of our handheld dreams here we talk about all this stuff talk to me about then and you're at this point obviously over in the Indie role but",
            "start": 3241.12
        },
        {
            "text": "of PS4 so that was PS5 so then before we move out of our handheld dreams here we talk about all this stuff talk to me about then and you're at this point obviously over in the Indie role but you're still at PlayStation were they shocked to find out we all wanted a PlayStation Portal like when that drops I know there's been you know it outsold it did more than what people thought it was going to do were you like see this is what I'm talking about people want to hold their games um maybe maybe Nan would say that when I learned about the PS Portal I I was like who wants this Hardware you know doing remote play right yeah so so I remember saying to the other team the only way the PS Port will be successful would be if we sell this at $199 that's the only only way and they did it you know not because I said that but probably they have the same kind of thinking uh at lunch you know the uh we you know hardware didn't have that streaming capability even though it was like a technical POS",
            "start": 3315.88
        },
        {
            "text": "because I said that but probably they have the same kind of thinking uh at the lunch you know the uh we you know hardware didn't have that streaming capability even though it was like a technical POS but they are not able to have it uh ready for the launch so the only function that PS4 had was to play your games on your you know PS5 right yeah uh yeah so uh so it's just a peripheral so um we didn't I didn't think uh people spend more than you know uh $200 for a device like that but you know luckily the company uh put that price and the people found out how nice it is to you know uh play games it's a huge 8 in screen it's kind of light right because it doesn't have you know big CPU or anything and uh it has the real dual sense features in it so yeah yeah yeah so so we are all surprised how well it was received and uh uh how it sold so now that you're out you have all this industry knowledge obviously this industry history you understand it now that you're out do you think we ever",
            "start": 3370.92
        },
        {
            "text": "how well it was received and uh uh how it sold so now that you're out you have all this industry knowledge obviously this industry history you understand it now that you're out do you think we ever see PlayStation enter again the handheld market like in terms of like the success of Portal the learnings of Vita seeing Steam Deck seeing Switch hearing about Xbox and there uh rumored handheld yeah yeah so personally you know for the last three or four years the the uh Hardware budget category I've been mostly excited with I might have uh talked to you about this is the portable gaming PC category that's you know so I purchased like a MPD uh GPD is a great company from China they make amazing portable gaming PCs how there GPD Max uh Wing Max 2 GPD Wing convention yeah the Crum shell version of GPD Wing uh to is so good and also Aino is another company who create a beautiful hardware and the latest uh that I enjoy using Ion Pocket S it's not PC but it's a uh Android device with two yeah",
            "start": 3439.0
        },
        {
            "text": "of GPD Win to is so good and also Aano is another company who creates beautiful hardware, and the latest uh that I enjoy using Ion Pocket S. It's not PC, but it's a uh Android device with two yeah yeah yeah, that's that's that's the GPD Win 2 you know. If you're an audio listener, this is a laptop there, a laptop that has dual sticks to the top and a dpad yeah, and then the Ion Pocket S is the Android device with two analog sticks and all the gaming buttons and it plays beautifully these you know recent mobile games uh some games are real action games right yeah and yeah so this uh uh uh um Android device you know plays games so well so that that's the you know the category I buy you know one or two new hardware every year these days, so of course I'm so excited if a PlayStation in the future makes something uh like this however um personally you know because I I said company you know even now PlayStation is much bigger than you know PS3 days but I don't think it's it's a good idea",
            "start": 3504.4
        },
        {
            "text": "future makes something uh like this however um personally you know because I I said company you know even now PlayStation is much bigger than you know PS3 days but I don't think it's it's a good idea to uh try to um manage two different platforms like PS yeah yeah I think everybody learned their lesson on that and saw the success now of switch and that's where they want to go uh Shuhei I have so many more questions for you I have so many super chats for you but I feel like it's about time to say hey everybody if you're enjoying this show what what what say you what oh no no no I thought you you were saying we we are going to be finished oh hell no I'm not letting you out of here I told Jen I'm gonna be home late I'm we're going to go longer I'm just going to go to the ads here everybody everybody if you like what you're seeing here remember we're a small person business and we need your support you of course can get us live each and every day talking video games for free starting at",
            "start": 3570.32
        },
        {
            "text": "everybody if you like what you're seeing here remember we're a small person business and we need your support you of course can get us live each and every day talking video games for free starting at 10:00 a.m. with Games Daily moving into the Gamescast around 11 and moving into a stream after that uh but of course you could go that extra mile and pick up a Kinda Funny membership a Kinda Funny membership gets you all of our shows ad-free it gets you the ability to watch the afternoon podcast live as you record them and of course your daily dose of me and a vlog podcast we call Greg way this is available of course on kindof funny.com, Patreon.com/KindaFunny, YouTube.com/KindaFunnyGames, Spotify, and Apple Podcast but right now you're not using your membership benefits so here's a word from our sponsors this episode's brought to you by MeUndies at some point in our illustrious love lives we've all asked our partner the same age-old question that guys have probably been",
            "start": 3622.52
        },
        {
            "text": "a word from our sponsors this episode's brought to you by MeUndies at some point in our illustrious love lives we've all asked our partner the same age-old question that guys have probably been asking for thousands of years am I big while MeUndies doesn't know the actual answer to that or if your partner gave you the actual truth this Valentine day they can help you look huge with their contoured pouch and ball caddy choose from tons of awesome Valentine's Day prints and styles and match MeUndies with your special someone for an extra special holiday treat from all black Classics to fun expressive prints MeUndies has a look for everyone y'all know I love MeUndies all my black t-shirts are MeUndies including this one I'm wearing right now uh try MeUndies out and if you're not happy with your first pair of undies it's on MeUndies this Valentine's Day good things come in big packages at MeUndies get 20% off your first order plus free shipping at MeUndies.com Kinda Funny that's MeUndies.com",
            "start": 3662.68
        },
        {
            "text": "pair of undies it's on MeUndies this Valentine's Day good things come in big packages at MeUndies get 20% off your first order plus free shipping at MeUndies.com Kinda Funny that's MeUndies.com Kinda Funny for 20% off plus free shipping MeUndies comfort and outside in this episode's brought to you by ExpressVPN going online without ExpressVPN is like not closing the door when you use the bathroom even if you think you have nothing to hide why give random creeps a chance to invade your privacy internet service providers including mobile network providers know every single website you visit ExpressVPN reroutes 100% of your traffic through secure encrypted servers so your ISP can't see your browsing history it hides your IP address so it's even harder for third parties to track your online life it's so easy to use you just fire up the app and one click gets you protection and it also works on phones laptops and more I use ExpressVPN everywhere because it gives me so much peace of",
            "start": 3713.52
        },
        {
            "text": "life it's so easy to use you just fire up the app and one click gets you protection and it also works on phones laptops and more I use ExpressVPN everywhere because it gives me so much peace of mind that I can explore the internet safely protect your online privacy today by visiting expressvpn.com kindafunny that's expressvpn.com kindafunny and you can get an extra 4 months free expressvpn.com kindafunny for an extra 4 months free this episode's brought to you by BetterHelp what do you want your 2025 story to be every January brings you 365 blank pages waiting to be filled in in 2025 maybe you're ready for a plot twist or maybe there's part of your story you've been wanting to revise life isn't about resolutions that fade by February it's about picking up the pen and becoming the author of your own life think of therapy as your editorial partner helping you write new chapters and create the meaningful story you deserve to live some of my best friends use BetterHelp",
            "start": 3763.56
        },
        {
            "text": "the author of your own life thinks of therapy as your editorial partner helping you write new chapters and create the meaningful story you deserve to live some of my best friends use BetterHelp and love how helpful it can be for learning positive coping skills and how to set boundaries if you're thinking of starting therapy give BetterHelp a try it's entirely online designed to be convenient flexible and suited to your schedule and it serves over 5 million people worldwide Write Your Story with BetterHelp visit betterhelp.com/kindafunny to get 10% off your first month that's betterhelp.com/kindafunny we're back still here with unemployed Shuhei Yoshida out free 31 years gone uh we're pivoting off of handhelds we're talking about you know the future of PlayStation the future of video games all these different things now that you're out and can talk freely what's your take on Xbox especially right now with everything's an Xbox screen",
            "start": 3815.72
        },
        {
            "text": "of PlayStation the future of video games all these different things now that you're out and can talk freely what's your take on Xbox especially right now with everything being an Xbox your screen's an Xbox those headphones are an Xbox it's very different than what you y'all had been doing at PlayStation what do you think of it well I have to be very careful because Xbox fans are so passionate right there's so few of them though really just SnowBike Mike and Ryan McCaffrey I think you're going to be okay no I'm kidding well yeah well with all respect you know they in my mind Xbox teams have done you know many times like some um pioneering things something you know ahead of uh everyone uh so that that's always great and it's you know for any industry having uh competition is always healthy you know because we have to work harder right so having you know yeah Nintendo does something different right yes so it's great to have Nintendo for different reasons you know they train young",
            "start": 3869.72
        },
        {
            "text": "you know because we have to work harder right so having you know yeah Nintendo does something different right yes so it's great to have Nintendo for different reasons you know they train young children how to use controllers and play games and become video game fans and uh send fans over to us like you know that's the minor leagues you guys are the major leagues of PlayStation no no no no no the generation you know yeah yeah yeah yeah yeah but but uh you know Xbox and Playstation were always head to head right so they for a while is a Xbox 360 and uh you know we did well on other you know Generations yeah uh so so it's always great to have competition and uh because uh of Xbox you know we have to be uh honest and humble and uh be uh always alert and sometimes get inspiration from what they do so yeah yeah so I think you know it's great great great to have Nintendo does as PlayStation consoles this is the whole thing we believe in Generations have you",
            "start": 3920.64
        },
        {
            "text": "they do so yeah yeah so I think you know it's great great great pleasure uh to have do you like this idea does as PlayStation consoles this is the whole thing we believe in generations have you do you see their play right now of being everywhere being a box being an app being this being on a phone being the cloud like do you look at that and go I believe that'll work or do you think that that's a thing to take but the safe spot is doing consoles well yeah well in my mind clearly that what they've been saying right they've been saying for years of course and this new campaign is different way of them saying the same thing um because Microsoft is a software company and the now uh you know server based uh service company I I think it's natural for their like a DNA to think about providing services you know through uh through cloud or you know to any hardware or platform like they made the uh Microsoft Office available on Macs right or the mobile or you know I I think that's personally I",
            "start": 3982.04
        },
        {
            "text": "you know through uh through cloud or you know to any hardware or platform like they made the uh Microsoft Office available on Macs right or the mobile or you know I I think that's personally I think that's the kind of same kind of uh thinking okay okay and you're okay with it you like it well I I don't know do you like it or not like it you say do you like it or not like it well I if I like it or not you know I like what they are doing okay okay that's fair that's fair I stop I stop there okay and I respect that I respect that thank you putting an end to the question right there I appreciate that a lot um in the other sense of like now that you're out and especially after I think you switched over to the Indie side right leaving Ro Life Studios and going to do the Indie side of all this when you look at the industry as a whole right now where are you I think there's so much conversation this year and last year about layoffs Studio closures there's been so much conversations about",
            "start": 4040.2
        },
        {
            "text": "when you look at the industry as a whole right now, where are you? I think there's so much conversation this year and last year about layoffs, studio closures. There's been so much conversation about this race to find the next Fortnite; everything has to be a game-as-a-service, obviously. Crunch this year - are you bullish on where we're going? Do you think in general the industry's lost its way and needs to get back to it? Where are you with that conversation that you've heard me and Blessing and Tim talk so much about on Games Daily? Oh well, yeah, so you know it's great to tackle something that's really difficult right? Yeah, you know go for you know go big or go home kind of thing. When I was managing first-party, you know I was managing you know of course like a business so you know we spend this much money we have to deliver this you know this many much revenue etc sure uh in my mind as you remember after we did uh we worked so hard on PS2 days and PS3 days",
            "start": 4095.6
        },
        {
            "text": "So you know, we spend this much money; we have to deliver this many revenues, etc. Sure, uh, in my mind as you remember after we did uh, we worked so hard on PS2 days and PS3 days, like a SOCOM or uh Killzone or Resistance, you know, um, you know these shooters, uh, you know there came Call of Duty and huge successful franchises, and uh, um, in my mind, you know working on you know these uh service games is uh, uh Winner Takes All kind of you know like a network effect kind of thing right, and working on only one platform to try to compete in that is uh, you know putting ourselves already at a disadvantage, whoever tried to do that, and uh also you know this game Call of Duty was available on PlayStation. Yeah, so I didn't think it's wise for me to allocate resources to try to compete in that uh, in that genre, so you know uh yeah, so we stopped making these only obvious games which always made so much sense to me, and granted you know like",
            "start": 4146.04
        },
        {
            "text": "compete in that uh in that genre so you know uh yeah so so we stop making these only obvious games which always made sense to me and granted you know like you and your reign as the president of Worldwide Studios lines up so perfectly with me entering IGN taking over the PlayStation team Beyond PS I Love You Etc like I never understood as somebody who loved Killzone 2 and played so much online like I knew it was a small community compared to Call of Duty and the fact that that juggernaut just kept rolling and rolling and rolling I always thought it was smart that PlayStation and I know that pisses off the Resistance fans and the Killzone fans but I always thought it was smart that they backed off you guys backed off and said you know third party can run that they can go do that we don't need to make our own shooter we don't need to make our own thing which is why I was like so perplexed when this time around there was the Jim Ryan we're doing",
            "start": 4216.8
        },
        {
            "text": "Run that they can go do that we don't need to make our own shooter, we don't need to make our own thing, which is why I was like so perplexed when this time around there was Jim Ryan saying we're doing more than a dozen live services and I'm like well they can't all be shooters but then it was Far Games and Concord and Marathon and the Hell Divers - shout out to Hell Divers, you know what's up with that? Like I... it's just been an interesting pivot and I wonder yeah for you with your eyes on the entire industry did it make sense to you? Oh yeah so so for me like I was saying I was managing this budget right annual budget and I was responsible to allocate resources to you know money to what kind of games to make if you know the company was considering that, that way probably wouldn't have made sense to stop making great you know like another God of War or whatever like a single-player game and put all the money into these service games however what they did after I... I moved on and Har took",
            "start": 4260.44
        },
        {
            "text": "It makes sense to stop making great single-player games like another God of War, or whatever, and put all the money into these service games. However, what they did after I left and Har took over the company, and Sony gave them a lot more resources, was that they said to him, \"Stop making this single-player game.\" They said, \"Oh, yeah, these games are great. Just continue doing that,\" and we give you additional resources to work on these service games and try it right? Yeah, and I'm sure they knew it's a risk - the chance of a game being successful in this hugely competitive genre would be small. However, the company knowing that risk gave Har resources and a chance to try it. I think that's the way they did it, so in my mind, oh wow, that's great, and hopefully some service games will become successful, and luckily, you know, they did so well - no one had expected right? Yeah, of course, so you can't.",
            "start": 4306.96
        },
        {
            "text": "Shuhei Yoshida's First Interview After PlayStation - Kinda Funny Gamescast\nmind oh wow that's great and hopefully you know some some games will become successful and luckily you know Harmon did so well it sure no one no one had expected right yeah of course so you cannot plan a success in this industry that's that's the most fun part that's the fun part that's the fun part that's the most fun part of this business right yeah yeah yeah so so I I hope you know I I hope you know this strategy would work in the end yeah so yeah how jealous were you though that Harmon takes control Herman takes control they give him all this resource and money to go make this second thing you're in there you're trying to make the V happen but you got to split teams they're not giving you more studios to make VA games I digress I I thought you know if I was in the position of the Harmon I would try have tried to resist that in direction so that yeah so maybe that's one of the reason they removed me from the F she's going to be a problem sho's going to be a",
            "start": 4365.16
        },
        {
            "text": "Shuhei Yoshida's position of the Harmon I would try to have tried to resist that in direction, so that yeah, so probably maybe that's one of the reasons they removed me from the role. She's going to be a problem; she's going to be a problem for a life service. P. She won't want to do it. Get him out. Move it over there. Yeah, yeah, yeah, yeah. Talk to me about that. What was the conversation? Uh, what was your reaction when it was all right? You've done uh you've been Sony Worldwide Studios president for this many years, right, 2008 to 2019, two thousand eight to two thousand nineteen. Yeah, and now we don't want you to do that anymore. Was that a shock to you? Were you upset? Um, I well, on one hand, I was enjoying what I was doing, sure. You know, uh, yeah, we had so such a great talent in the organization; we have so many uh uh great games and IPs to work on, uh, I I totally enjoyed working on first-party game development, and in my mind, I didn't have any interest to work in the company other than game development after so many years, sure. But when Jim offered me this idea to",
            "start": 4422.56
        },
        {
            "text": "working on the first part of game development, and in my mind, I didn't have any interest in working in the company other than game development after so many years. Sure, but when Jim offered me this idea to do something with Indies, like he was like, um, at that time we as a company were criticized for not supporting Indies enough, like during the launch of PS4 days, Adam Boyer days, you know, we were helping and promoting INDIE games so well, and people loved it, and the industry loved it, and I loved what Adam's team was doing, Gabe, and you know, Nick Suntani and all these people, uh, John Drake, and you know, Sean Bean. We don't compliment him here; we don't compliment John Drake here. Okay, okay, okay, yeah, well, John was an interesting personality, but anyway, stop what does that mean? What does that mean, John was an interesting personality? I wouldn't say a particular title, but when we launched as the first-party game, uh, that game didn't get the good uh for him.",
            "start": 4479.84
        },
        {
            "text": "mean Greg Miller was an interesting personality what does that mean I I wouldn't say a particular title but when we launched as the first party game uh that the game didn't get the good uh for he came to my office and said sure you should you know you should shut down this studio that's what he said cold blooded cold blooded yeah yeah yeah yeah yeah well he I always teased him uh saying that he for him anyone he's always the smartest person in the in the room yeah so he it's very hard for him to not to kind of shut down other people people gotcha gotcha Yeah Yeah well yeah I love working with Shuhei Yoshida so you know sorry Shuhei pleas share that episode anyway what we are talking about um I thought about Indie yeah yeah so so when Jim offered me so so because the company was criticized and I was very worried about the trend as well how we are being seen um so when Jim said you know you know sh you know we being criz you know we are not doing enough for Indies and I said yeah yeah yeah you know Jim",
            "start": 4540.72
        },
        {
            "text": "about the trend as well how we are being seen um so when Jim said you know you know sh you know we being criticized you know we are not doing enough for Indies and I said yeah yeah yeah you know Jim you should do something about it and Jim said that no no no I want you to do something about it me and he said that oh and you know I I get uh H to manage the first party and I'm like oh okay like okay demotion great cool I didn't think it was a demotion yeah I I thought you know it's it's it's something thing I I cared about and I thought I could uniquely do something about like U yeah so after 11 years managing Worldwide Studios uh even though I I enjoyed and we we I was proud of what we have accomplished you know leading the the group with by the same person for such a long time might not be a great thing like like you know talk about service games you know because I had one way of thinking and looking at games certain things I wasn't interested I I wouldn't even try like I I I totally was not",
            "start": 4606.64
        },
        {
            "text": "Shuhei Yoshida's First Interview After PlayStation - Kinda Funny Gamescast\nthing like, you know, talk about service games, you know, because I had one way of thinking and looking at games certain things I wasn't interested in, I wouldn't even try. Like, I totally was not interested in movies being made based on our game IP. So, you know, the film industry, you know, looked down on us, and they didn't respect the creative aspect of video games, and they would make very bad movies if they tried. So, I had no interest. But after I left, look at all these great movies and TV shows being made right? Yeah, so, with your energy and passion, um, because I got the world's present of a world Studio job in early 40s, like, same age as Herman Hulme, so I thought it's great to bring in new person with new energy and passion and different way of thinking for sure, and uh, got to challenge something even seems difficult, uh, so, you know, even though I was set to move on from first party, the part of me are thinking",
            "start": 4670.24
        },
        {
            "text": "and different way of thinking for sure and uh got to challenge something even seem difficult uh so uh so you know even though uh I was set to move on from first party you know part of me are thinking maybe it's a good thing for the company you know if because if the company let me because I have continued right yeah just kept going yeah yeah so so it has to be you know made like that to for me to move on and Jim created a really exciting and uh um role for me to work on so then when you come into this Indie role what what do you bring to the table I think you know people see you so much publicly as okay you're changing your Twitter Banner you're doing you're tweeting about this Indie it's cool what does the actual job look like like what were you doing day-to-day yeah yeah yeah yeah so the uh that was it was at the time you know end of 2019 and uh 2020 you know covid happened right I remember yeah yeah plan was of course to visit you know developers or Publishers and visit",
            "start": 4735.8
        },
        {
            "text": "yeah so the uh that was it was at the time you know end of 2019 and uh 2020 you know covid happened right I remember yeah yeah plan was of course to visit you know developers or Publishers and visit events and now that wasn't possible right and Co sure so my focus initial Focus was more on working internally to find out what's going on you know what the you know leaders of uh different departments because I was one person Department reporting to Jim Ryan I was able to work with any you know all Departments like uh very flatly uh for them you know it's very easy for them to work with me as well I was the additional resource uh and to find out you know what's going on and of course you know I I talked to Publishers and friendly developers as well you know what what their views on us and our third party Department did the same you know they were working already working on what what internally we called the indies 2.0 initiative before I was I got assigned maybe",
            "start": 4792.6
        },
        {
            "text": "what their views on us and our third-party department did the same, you know they were working already working on what what internally we called the \"Indie 2.0\" initiative before I was I got assigned maybe you know they asked Ryan to add me to that project you know from uh TPR uh third-party uh Department teams because they were working on the Indie 2.0 initiative internally and uh maybe Jim Ryan saw the opportunity to add me to their efforts so quickly, you know I I I I uh started working closely on uh with the third-party department teams who are working on the in the Indie 2.0 initiative and luckily uh I got the message from uh Greg Miller he they just sold their company Douyin to Microsoft and as Greg was managing publishing business for for Douyin and Microsoft has decided to shut down that business, he kind of lost you know his his role half of his uh his uh responsibility, he was a producer as well but uh he asked me you know there's an opening at PlayStation about this leading uh in the account",
            "start": 4854.52
        },
        {
            "text": "know his role half of his uh responsibility he was a producer as well but uh he asked me you know there's a ro you know being open at PlayStation about this leading uh in the account management team can you say something good about me so I sent an email internally to the management people in third party relations that you should hire this guy Greg Rice so Greg joined uh about the same time as uh I got this new role and uh same time um uh uh Christian Sensing came over from uh you know he I've known him for a long time he was the head of Capcom US and uh he had his own you know uh developing developer business uh uh joined us as well in the TPR side so I have two great partners to work on this initiative and uh uh they the TPR team had a great network of uh publishers and developers they are talking you know throughout the year so I was able to join them in the meeting and go direct uh feedback uh from these um you know partners over us uh so so internally trying to",
            "start": 4918.92
        },
        {
            "text": "they are talking you know throughout the year so I was able to join them in the meeting and go direct uh feedback uh from these um you know Partners over us uh so so internally um trying to find out what we had to do we need to do what the developers and Publishers are struggling with working on PlayStation and try to change it you know create a plan and get the management of these Department to be able to support the initiative and give priority to create tools and uh some systems and uh policies change uh to help Indie Games become more successful on Playstation so the first two years during covid I my focus is more on the internal uh evangelism sure sure sure sure and after covid you know it's all about traveling you know I visited the 21 Game Event last year uh how many 21 video game event yeah yeah so so almost two per month so I I counted uh because I have to do for tax uh return uh I was outside Japan 120 days God Dam you know last year yeah so for the last three years",
            "start": 4980.12
        },
        {
            "text": "game event yeah yeah so so almost two per month so I I counted uh because I have to do for tax uh return uh I was outside Japan 120 days God Damn you know last year yeah so for the last three years and you know I was traveling in visiting game events and meeting with you know Publishers and developers uh to find out great new games and uh promote uh games on you know our social channel on my channel yeah yeah and and attend events and do presentations and do panels panel of developers uh I really love doing these things GDC I think the GDC last year I had four young developers in my channel and uh that was one of the sponsor sessions in GDC in a huge in a large room uh full of people attending I had two uh developers um in their uh 20s and all of them working on very very uh creative uh great games so they had great stories to tell uh so so we did you know I did that panel and after the GDC they send us uh like a uh report card scores uh after a few months and our session my session was",
            "start": 5044.36
        },
        {
            "text": "game so they had great stories to tell uh so so we did you know I did that panel and after the GDC they send us uh like a uh report card scores uh after a few months and our session my session was uh second most popular session under Game Design Truck very good who was number one yeah very proud uh I don't know yeah we don't they don't get their own interview here they don't matter it doesn't matter yeah yeah yeah so so so I've been doing that kind of thing you're on the road that much what's the family think you you got twin daughters at home are they do they are they where you at dad or they happy to see you gone oh my wife is very happy be out right it's one L thing to worry about you know she has you know uh we have two daughters you know twin daughters and my daughters because they've been seeing me outside out of you know Japan for so long you know for them it's kind of natural thing sure sure it's going to be weirder now that you're you don't have a job in your home more I",
            "start": 5117.36
        },
        {
            "text": "been seeing me outside out of you know Japan for so long you know for them it's kind of natural thing sure sure it's going to be weirder now that you're you don't have a job in your home more I don't know if they understand what it means like God Dad's here and he's doing a podcast in the other room why why does he keep saying Beyond so much I don't like that one bit so you go to this role you start making these inroads for Indies you're changing all the stuff why is now the time to step away like why leave PlayStation now yeah so after five years um we have made good progress on this IND the side you know we there are so so so much more we can do and we are working on at all the Departments are going on but uh we hear less and less you know problems uh from our partners developers and the Publishers of course you know there are so many games being made the discoverability is the biggest challenge for any you know IND the developers or Publishers to get their games being known or seen",
            "start": 5175.92
        },
        {
            "text": "Publishers, of course, you know there are so many games being made; the discoverability is the biggest challenge for any developer or publisher to get their games known or seen. So we're working on how best to show the kind of games that each player would find most attractive, even though they don't know anything about these games. Yeah, so uh, there's a lot more we can do and we are working on it, but the progress we've made over the last five years, I'm pretty happy and proud, and the team that we have in the company – Sean Barrett, those people, Johhny Vega, and great people working on indie titles across the company. And you know Jim Ryan was leaving, and he was the very last of our generation; the very first generation with the PlayStation. He's been with the company since PS1 days as well, so you know Kenichiro Yoshida...",
            "start": 5229.32
        },
        {
            "text": "and he was the very last of our generation, the very first generation with the PlayStation; he's been with the company since PS1 days as well. So you know Kaz Hirai, Andrew House, you know Jim Ryan, all these people... um... while managing the company, leading the company is now... uh... handing buttons to the next generation of management - Tanaka and Harada, and Nishimura is in his 40s, and he's you know early 50s, really, really young from our standpoint. So it's a great timing, and I I I I you know after Jim Ryan announced his departure, I was you know we were all talking about internally who would be the next uh leader... and at first, we were behind you; we sold the T-shirt with your name on it - oh thank you, thank you! I got the t-shirts. But but my choice would have been you know these people, you if they are to you know lead so I am so happy uh and I I have so so much confidence in them leading the company so I thought ah yeah it's about time for me to be",
            "start": 5293.52
        },
        {
            "text": "been you know these people you if they are to you know leaders so I am so happy uh and I I have so so much confidence in them leading the company so I thought ah yeah it's about time for me to be free so then what does that mean are you retiring from games are you are you just hanging it all up and going fishing what what are you going to do um in my mind the last five years even though I did things um I I was kind of you know the leading first party was a very tough job right yeah it was really fun and I enjoyed it but it was so much pressure and the uh responsibility but the last five years so so easy for me um no one to manage no one to manage no budget or nothing right no meeting I have to attend or you know Jim just let me do what whatever I I thought I should be doing so I didn't have to report anything so easy that the um um in my mind moving from worldwi Studio to Indie L it may sound sound strange but feels bigger change than me leaving the company oh wow and whatever I I",
            "start": 5355.92
        },
        {
            "text": "to report anything so easy that the um um in my mind moving from world wide studio to indie L it may sound sound strange but feels bigger change than me leaving the company oh wow and whatever I I do going forward because I I I want to continue to in some way or other uh help you know in the developers or in the publishers and there are so many friendly uh uh people that I I respect in the industry I hope they would uh want me to do something for theming yeah I'll be free so let me know what I can do for you so I I I'll be waiting for them to uh send me email that hey shuhei can you do this for us kind of thing and and if that's successful uh probably uh what I'll be doing going forward wouldn't be so much different from the last five years in in my mind sure that may sound strange sense delusional right but I'm just happy you're staying in games I wanted to make sure you weren't hanging it all up you oh yeah yeah yeah I have I I I still have lots of energy okay and I have time and luck",
            "start": 5420.88
        },
        {
            "text": "right but I'm just happy you're staying in games I wanted to make sure you weren't hanging it all up you oh yeah yeah yeah I have I I I still have lots of energy okay and I have time and lucky company paid me so well for the last so many years that I don't really have to work for money so yeah I shoot if you don't want to work for money I got to come do shows with Kinda Funny, come hang out with us cuz we don't pay nothing let me know uh what I can do for you we'll talk off air we'll get you a show we'll get you streaming well you can be the late night crew when we're going away You're streaming for us Sho picks here's the Indie games he thinks you should be playing yeah yeah well I I do only things I I I find it fun so yeah okay that kind of things that kind of thing good I'm glad uh Shu like I said earlier you have been getting tons and tons of super chats here over on youtube.com/KindaFunnyGames I want to start reading into them pepper in some of my",
            "start": 5490.8
        },
        {
            "text": "things good I'm glad uh Shu like I said earlier you have been getting tons and tons of super chats here over on youtube.com/ kindafunnygames I want to start reading into them pepper in some of my own questions but the one I've seen in chat a lot from a lot of different people and then the one I see over here speaks to something I know you love s.com says will we ever see Bloodborne again oh yeah you'd want right we'd want yeah so BR Bor is the one of the most popular as on my Twitter X Channel people like you know other popular things in L is one my games you know Apex Legends where a sequel or Legend of Dragoon you know where remake or something but Blackor has always been uh the most asked uh thing and the people wonder why we haven't really done anything like even like update yeah uh yeah or remas yeah or remaster yeah should be easy right EasyEye's hit the button known for doing so many remasters right some people get get uh uh frustrated SC well you know I you know I have only my personal",
            "start": 5542.68
        },
        {
            "text": "or Remaster yeah or remaster should be easy right Easy hit the button known for doing so many remasters right some people get frustrated SC well you know I you know I have only my personal theory okay to that situation I I you know I left first party so I don't know what's going on but my theory my theory is you know because I remember You Know M really really loved um Bloodborne you know what he created and so I I think uh he is interested but he's so successful and he's so busy uh so he doesn't want he cannot do himself but he doesn't want anyone else to touch it so that's my theory okay and and the PlayStation team uh uh respect uh his uh wish so that's that's my guess Right theory I'm not revealing any secret information to be clear hopefully Jim Ryan will still make an article about it but I understand you're not revealing anything to take that in a different direction and pull a thread you just put out there you talk about PlayStation respecting the Creator",
            "start": 5599.92
        },
        {
            "text": "an article about it but I understand you're not revealing anything to take that in a different direction and pull a thread you just put out there you talk about PlayStation respecting the Creator enough not just to go make someone else make it or stuff like that how much is respect in the conversation when PlayStation is making games cuz I think all the time of like I feel like even when you were in charge it would have been your prerogative to tell Naughty Dog don't worry about The Last of Us keep making Uncharted or don't worry about going back to Uncharted keep making The Last of Us like where do you because you worry about the business point because you are a business it is a business to make video games but then there is the art like how do you find a balance between that how much of that exists where it is okay we're not and I know there's so many people who want to be negative in comments I'm sure we're not just money grubbing here we are trying to make the right choices for our",
            "start": 5669.84
        },
        {
            "text": "exists where it is okay we're not and I know there's so many people who want to be negative in comments I'm sure we're not just money grubbing here we are trying to make the right choices for our creators how does that all play out in your mind um well I I think I I'm one of these people in the industry who are so naive to believe that you know developer creator has to really really believe on believing something they are making and has to be so passionate about something they are making to make something great uh because making a game is so hard and there's no no clear way of saying this is good or this is good enough there's no like a uh service level agreement that you have to the game has to uh satisfy these functions to be able to be accepted anything it's all um subjective subjective judgment right yep how good is good you know how good is good enough so so they go well beyond beyond their limit to make something special if they truly believe in what they are making and",
            "start": 5713.2
        },
        {
            "text": "judgment right yep how good is good you know how good is good enough so so they go well beyond beyond their limit to make something special if they truly believe in what they are making and uh and doing uh and passionate about so often times we had management had to make the studio stop making the game because it was you know great enough not just good enough great great enough but every time a great game like a Game of the Year receiving game was in development the developers you know game directors and these people would say there are so many issues you know in the game they wish they could fix them or improve them right so we had to remove them from doing it um so at the very very end we always had to do it but during the development I always believed in the thing that I said that the best results best game would be like how great games are being made and how",
            "start": 5768.92
        },
        {
            "text": "know I always believe in the thing that I said that the the you know best results best game would be like like I was thinking all the way you know how the great games are being made and how you know people make great games and I one of the answer should be you know because the uh uh developer is so so much you know into the uh project uh they they do amazing things so I love that thank you I want to Pepper in one on my own here uh you of course have been a a kind of funny Beyond IGN listener for quite some time as long as I've known you it's how we became friends you listen and can you listen to every Games Daily you tell me that's what you told me right you listen to Games Daily regularly every day uh well yeah uh when when I commute yeah to oh so now you're done now it's over you're canceling your Patreon yeah yeah maybe I stopped listening but no no my question is from our side if you want to call it press uh critics enthusiasts whatever what's the biggest misconception you hear us",
            "start": 5842.28
        },
        {
            "text": "your Patreon yeah yeah maybe I stopped listening but no no my question is from our side if you want to call it press uh critics enthusiasts whatever whats the biggest misconception you hear us say over and over again what do you hear us say or go back to and be like Ah thats just not how it works they dont understand games that way thats thats a great question because I do feel occasionally like that but the you know um particular example I that just doesnt come up I have to think about think about it you got we got three hours of show left you can think about yeah yeah yeah you had asked that question because I wonder too what what to toss it in the hopper for you to think about as it kicks around fans as well like I know theres a difference between the people who talk about in the games and then the people consuming it but like you interact so much with Twitter and what you see on social media and like and even when there was even when there was PSX and there should be PSX",
            "start": 5901.84
        },
        {
            "text": "the games and then the people consuming it but like you interact so much with Twitter and what you see on social media and like and even when there was even when there was PSX and there should be PSX again you interacted I wonder what you think fans get wrong as well that they just don't understand about making games oh like um you know I talked about you know I joked about H sometimes Crisis of making too many too many uh remasters right yeah yeah yeah yeah and I think the people who complain about that are maybe thinking that Housemarque is doing it instead of doing something new or something great right yeah but those resources a remaster instead of the next IP from Sony Bend or yeah but but I'm sure this remake is made you know by a dedicated different team or some you know some porting teams on especially PC version is a PC porting expert uh so so he's I don't think he's sacrificing anything by doing it but by doing remake uh or remaster uh it's it's um much cheaper to produce and uh uh create",
            "start": 5950.2
        },
        {
            "text": "PC version is a porting expert, so he's not sacrificing anything by doing it, but by doing a remake or remaster, it's much cheaper to produce and create additional revenue and create new users to the IP, especially when you port the game to PC, sure. That brings in revenues enough to keep investing in big titles like a big single-player game now cost so much, so you know they need additional income by doing remasters and the porting to PC to be able to do that. So for them if they like F1's output, like a big single-player game, you know they should support Harmon doing these things and the remasters so that he can keep investing in these great new games. That's a great point. You bring up the PC ports now that you're out, now that you can say whatever you think, do you think you'll ever see a future in the near future of PlayStation just being a publisher not having boxes just putting things on the PC?",
            "start": 6005.16
        },
        {
            "text": "Out now that you can say whatever you think, do you think you'll ever see a future in the near future, whatever, of PlayStation just being a publisher not having boxes just putting things on the PC? I think PlayStation makes great hardware, so you know, uh, one thing. Um, I really, really enjoyed you know working with the hardware team when I moved back to Japan in 2008 and uh ever since I worked closely with the hardware team and I enjoyed it so much because you know our studios, many of them, you know I shouldn't say many of them, all of them hopefully are such talented, you know great teams, studios that they only try to make the best game in the industry right? They really aim high and the PlayStation hardware team is the same; they only think about the best hardware in the industry. They want to make uh something innovative, something that's never been done like uh you know something like um um um the DualSense controller's adaptive trigger, that's amazing, isn't it?",
            "start": 6081.8
        },
        {
            "text": "they want to make something innovative, something that's never been done, like the trigger on the DualSense adaptive trigger - that's amazing, isn't it? You know, getting that feeling for the first time was really difficult to produce. But actually, the other team tried to make it for DualShock 4 and they weren't able to do it, so it was their second trial for DualSense, and yeah, working with teams like that only thinking about creating something innovative, something never been done or some of the best in the industry is so much fun. You know, so for me, working with a hard team and working with studios like F.Party Studios are similar because we're in such a blessed environment where the company lets us aim for the best - that's great. This is a nice question from Ian who super Chats on YouTube.com KindaFunnyGames, it piggybacks on this conversation: what's your favorite memory throughout your years working with PlayStation?",
            "start": 6146.2
        },
        {
            "text": "a nice question from Ian who super Chats on youtube.com kindafunnygames it piggybacks on this conversation what's your favorite memory throughout your years working with PlayStation yeah that's a great question and people ask me that and I have to I always answer the um biggest you know memory for me is when we launched the very first PlayStation in Japan yeah the December 3rd you know 1994 uh because it was our first entry into the business and it was you know uh KAG is team made amazing Hardware 3D graphics and Reger looked so good um but we didn't know how uh it will be received and so we at the launch of the new hardware we always go to uh Shinjuku or Akihabara or shuya the big you know uh electronic store to watch people lining up right long line of people waiting for the store to open so that they can purchase the hardware on launch day so we stood there for hours just watching people one by one purchase and couple games together and and they look so",
            "start": 6211.68
        },
        {
            "text": "waiting for the store to open so they can purchase the hardware on launch day, so we stood there for hours just watching people one by one purchase and couple games together, and they looked so happy; uh, we wanted to talk to them all but we refrained ourselves from doing it, yeah. So, every time new ones came around, it was very fun, but especially the very first one because it was our child – right? We worked so hard; we were like a small team when we started the company; we had only 80 plus people; I was like employee number 32, so it was such a special moment, special day for us all at that time. You know, at that time of the PlayStation... Have you thought about if you're going to be able to deal with when there is a PlayStation six or whatever they call it, and you're on the outside – like, you're not you know, you're not at the store, you're not one of us anymore? Right? Have you thought about that? Are you okay with that? Well, I'm not okay. Okay if there's no transition.",
            "start": 6277.48
        },
        {
            "text": "like you're not, you know, you're not at the store, you're not or if you are it's not yours anymore right have you thought about that are you okay with that well I'm not okay okay if there's no regulation new hardware yeah you know so company is so nice you know they our people there were so nice to set up multiple events for the last couple months uh to talk to people in the company uh not just in Japan but the US and Europe as well so uh for the last two or three months I had the opportunity three or four times to talk to employees you know gathering uh one which was like two days ago the last day of my my you know my departure last day of my company they uh uh uh in the late afternoon they had uh in you know inside company gatherings uh and ask me anything kind of sessions and uh so I did that and after that we had a party in the office and it was really fun so one of the things you know I said to I asked them is uh I you know in two 20 years hopefully I would have uh grandchildren",
            "start": 6341.92
        },
        {
            "text": "and after that we had a party in the office and it was really fun so one of the things you know I said to I asked them is uh I you know in two 20 years hopefully I would have uh grandchildren and uh when I I was dying I I I could say to my grandchildren that the yeah yeah that was the amazing cake amazing cake thank you thank you yeah I could say that uh to my grandchildren that the you know the PlayStation that everybody play and enjoy I was involved in the making that you know the very first one so I want to BR about uh when I was I'm dying so asked the aspiration company to keep keep working hard do do PlayStation great uh so that I'll be happy uh CJ splits on super chats and says what's your favorite project you were part of at PlayStation favorite project because CJ tosses out legend of dragon um the personally the the one I most enjoyed working on was AP Escape Legend of Dron was a huge project we had over 100 people working internally uh on PS1 uh that was really hard uh but uh",
            "start": 6404.24
        },
        {
            "text": "of Dragon Quest, the personally the one I most enjoyed working on was AP Escape Legend of Drakonis was a huge project we had over 100 people working internally uh on PS1 uh that was really hard uh but uh APS was much smaller team you know 20 or 30 25 people and um I was so involved in the game design side as well every creative decision I was also part of and we are making a game dedicated for the DualShock uh the controller had two analog sticks and so we are you know trying to make something that's only possible with two analog sticks and I remember you know us marketing lead asking us asking me that uh well you know this game requires just uh shock so can you make it compatible with the controller I was I was so mad that you know no no this is not the point anyway uh so AP Escape was the project I I I was personally on hands on and um you know most enjoy it and people will continue to ask for the rest of time when they're getting another one or when they're getting the remaster or",
            "start": 6474.12
        },
        {
            "text": "project I was personally on hands-on and um you know most enjoy it and people will continue to ask for the rest of time when they're getting another one or when they're getting the remaster or whatever, when that's amazing isn't it? The game was part of launching PlayStation Classics in the PS+ premium couple years ago. Yeah, and somehow the company decided the team decided to promote the new feature with Crash Bandicoot after so many years, you know I found my game being used to promote the new service and finding new players to try Crash Bandicoot for the first time uh The Uncharted Wolf Super Chat says \"I have so much respect for your many years of hard work at PlayStation Shuhei. Have you ever met a game developer who inspired you to do bigger things, any developer who inspired me to do better to bigger things? I think yeah like maybe you make a bigger version oh yeah yeah yeah so so I was so lucky that first project two projects I worked on was Crash Bandicoot and Gran Turismo right yeah and",
            "start": 6539.56
        },
        {
            "text": "Bigger things I think, yeah, like maybe you make a bigger version. Oh, yeah, yeah, yeah. So, so I was so lucky that first project, two projects, I I I worked on was Crash Bandicoot and Gran Turismo, right? Yeah, and the people like Marianne, Dog Kazi, they they are amazing people; they have such creative ideas and experience and vision. I was all I was so inspired working with these people, and they are very demanding because they knew they were making great games, so they wanted everyone who touched their games, you know, from production to marketing to service to you know, so it was really hard, but that really helped me to grow as a producer. Uh, you talked about Crash Kebab Super Chats and said as a huge Crash and Ratchet fan, I'd be remiss not to ask you uh to ask how you helped and influenced those games. Love you, Shu; you are such a bright star in gaming. Thank you, thank you. Crash Bandicoot, uh, because um the game the first game was pretty difficult one, you remember right? It was very challenging. Oh, yeah.",
            "start": 6601.2
        },
        {
            "text": "love you Shu, you are such a bright star in gaming, thank you, thank you. Crash Bandicoot uh, because um the game, the first game was pretty difficult, one you remember right? It was very challenging. Oh yeah, action platform uh uh. So when I got involved as a producer for Japanese um Market, I felt the game was too hard and not...and the game didn't explain enough to the onboarding wasn't good enough sure for the Japanese audience, you know it was it was okay, you know no problem for the probably you know Western audience they they are happy to find out you know how to play games. However, Japanese games and Japanese game players are so used to being like U you know um hand-held yeah uh to start games. So I I I talked to Mark Cerny and Naughty Dog and uh they didn't have time to implement these features for the US and European launch but they gave their time and resource to do something special for the Japanese version because the game came out in September for the US and Japan launch was planned",
            "start": 6663.92
        },
        {
            "text": "for the US and European launch but they gave their time and resources to do something special for the Japanese version because the game came out in September for the US, and Japan's launch was planned for December, because December is the most important month for the Japanese market. So they had three months to do things that I asked them to do, like add... when you pick up a mask, Aku has a window to talk about how to play games every time. That's one example. And they also allowed me to do the play test with users and find the difficult points in the game. Many people would have stopped playing. They gave us two additional continue boxes for only the Japanese version, and Mar had a system to look at how players were doing and dynamically change the difficulty of the game",
            "start": 6731.24
        },
        {
            "text": "box uh so only Japanese version had additional continue box and Mar and no do you know also had a system to look how the players are doing and uh dynamically change the difficulty of the game if you are struggling too much and try not to be obvious that the the game is doing it so they they customized the game so much for the Japanese version and the game became a hit in Japan Jaan the you know uh marketing uh activity in Japan was also great as well so they first they let us do that they you know do they they customize their game for the Japanese audience and they took all the improvements that they made into their future titles sure uh for example second game uh Japanese marketing team created TV commercial with the Crash Bandicoot dance, ing you know Crash dance yeah and if you remember the Crash 3 at the opening crash start dancing right yeah that they took the uh dance that crash did only for the TV commercial in the marketing and put that into the game so that was really",
            "start": 6798.28
        },
        {
            "text": "the Crash Bandicoot at the opening crash start dancing right yeah that they took the uh dance that Crash did only for the TV commercial in the marketing and put that into the game so that was really fun um collaboration between the Japan team and Naughty Dog that's incredible uh CJ Martinez On's back with a different one and says what did you originally dislike about God of War 2018 remember this that that that video right a classic story where Cory Barlog talks about how you said you were horrified to someone after you played yeah yeah yeah I was horrified because the game was huge right and we had so much expectation as a company as well and when I visited Santa Monica Studios you know Cory uh presented the the uh game and let me play the game and I and at that time the game was coming out in October of that year or so and so I I was like thinking about how many more months the team has and the state of the game and I was like this is this is bad you know in terms of situation you know this",
            "start": 6864.28
        },
        {
            "text": "of that year or so and so I I was thinking about how many more months the team had and the state of the game, and I was like \"this is bad\" - in terms of the situation. You know, this game would never be finished in a good state if we kept the schedule. But Cody was so passionate, and he's such a nice guy; I couldn't tell him that, even though my face was saying something else. So I walked back into Shuhei's office - yeah, Studio Director - and said to him, \"We have a problem.\" But then I explained things to him, and... I had a chance to talk to Cory later, and I said, \"I was horrified\" when playing the game. But in the end, we were able to move the project forward with additional time - maybe six months or so. The game came out in April or June the year after - 2018 - as a Game of the Year quality, for sure. So I'm really happy that the team was able to...",
            "start": 6925.56
        },
        {
            "text": "six months or so the game came out in April or June the year after uh to make the game that was God of War uh 2018 so like a game of the year quality so for sure so I'm so happy that you know team team pushed to keep keep working on to polish the game yeah yeah so so what what was the problem yeah the game had the uh some you know frame rate issues and also the camera issues and AI uh enemies shooting at me from outside the view or sure you know yeah the gameplay wasn't you know really pop Notch so that was the problem okay horrifying horrifying uh Omega Buster says when you are looking at potential new games how do you know if a new idea is the right fit for PlayStation what makes something a PlayStation Studios game um in my days right yeah your days back in the days yeah we always wanted the yeah so we we are big fans of new IPs and new ideas so we always wanted to find something new you know for example when European team Feel Good Inc. acquired the title you know signed up with",
            "start": 6992.64
        },
        {
            "text": "the yeah so we we are big fans of new IPS and new ideas so we always wanted to find something new you know for example when European team feel Heist uh uh uh acquire the title you know signed up with a medium molecule about LittleBigPlanet that was amazing you know New Concept at that time you know I I don't think we are talking about UGC you know before little be Planet yeah so something like that you know that has not never been done before kind of thing uh that that that's the thing uh uh excited me the most for sure okay that makes sense uh I like this one I don't know if you'll have an answer but I'll read it anyway uh Joshua Super chats and says congrats end of an era indeed Regarding UMDs why were they clear on the bottom at my old job we frequently had Parents demanding refunds after they had opened them up for the PSP the UMDs why was the bottom clear people were cracking open the case thinking it was a CD to put in they are people doing it apparently oh no yeah",
            "start": 7061.48
        },
        {
            "text": "after they had opened them up for the PSP, the umds why was the bottom clear? people were cracking open the case thinking it was a CD to put in. they're people doing it apparently. oh no, yeah so wow, yeah it's uh, yeah sorry, sorry about you, my apologies. i didn't i didn't think people would do that, i didn't know they would crack it, yeah, yeah we didn't think, you know, we thought it's uh, it's easier to handle a smaller disc than a CD with a case, yeah so yeah Kebab says my mom did that, dang. i okay, i didn't hear about people cracking them open, i didn't know that was the thing that was going on out there, there yeah uh and then finally there's a whole bunch of people who wrote in just saying how much they love you respect you, i think i'm going to give it to Guitar Hero here who sums all that up, congrats on this new chapter uh to the best smile in the business thank you for helping shape PlayStation into the amazing experience it is today thank you and then final question from the chat team",
            "start": 7116.28
        },
        {
            "text": "congrats on this new chapter to the best smile in the business thank you for helping shape PlayStation into the amazing experience it is today thank you and then final question from the chat team ramrod says Shu can you rescue Gravity Rush from PlayStation now like Freedom Wars was just rescued we love you Shu oh wow yeah that Freedom Wars came out and the original developer uh did the Remake that's amazing so right these days you know because original creators are you know left the company right in most cases for these old IPs yeah it's a developers you know outside the company who have knowledge and uh more passion about so I I think the you know again after I left you know the company first part is more open to license IPs like you know you remember when uh uh we launched PSVR 2 there's a Font Vision right Fantasight Vision yeah uh in VR uh that was actually created by the original creator of Fantasight Vision he is now in devop and he asked for the license and did yeah so",
            "start": 7170.08
        },
        {
            "text": "PSVR 2 there's a Font Vision right Fantasy Vision yeah uh in VR uh that was actually created by the original creator of Fantasy Vision, he is now in dev and he asked for the license and did yeah so so it was done with much love and care and knowledge uh so the yeah you know Gravity Rush the team team is now an independent developer called Boa Game Studio they just released the sad you know To's okay you know team so uh you know never say never right who who who knows I never thought there'd be a Freedom Wars remastered so don't worry about it I was very shocked and happy to see that you know how much I love Freedom Wars uh Shu I want to close you out get you a few things and get you on your way cuz you have a whole free day in Japan to do whatever it is you want since you have no job uh we just just you know right now declared our game of the year gave it to Astro Bot we've been doing our top 10 lists all week long for you Shu oh you're welcome yes we did it just because you're going",
            "start": 7227.48
        },
        {
            "text": "just just you know right now declared our Game of the Year gave it to Astro Bot we've been doing our top 10 lists all week long for you Shu oh you're welcome yes we did it just because you're going to be honest you can read the comments everybody understands for you what was Game of the Year 2024 what was your game of the year my game of the year 2024 was a game called Nine Souls ah yes yeah it's a game developed in by Taiwanese developer Red Candle Games yep know they used to make horror games but this one is uh actually an action platform uh I I say Sekiro like uh it's the best secular kind of game you can play on any platform uh but in 2D it's a beautiful game cute character but really scary kind of story um very very good um it's amazing amazing game I finished the game on PC the game came out on PC first uh but uh but I couldn't finish the game with the uh normal difficulty you know some of the hard so I had to drop the you know difficulty to finish it yeah so I restarted the game",
            "start": 7281.72
        },
        {
            "text": "out on PC first but I couldn't finish the game with the normal difficulty, you know, some of the hard ones, so I had to drop the difficulty to finish it. Yeah, so I restarted the game when the game came out on PS5 in November, but I got stuck at the same boss later, so I wasn't able to finish the game on PS5 with the normal difficulty, but still, the game is so good - my game of the year. You're making Barrett very happy, of course. Nine Souls number eight on Kinda Funny's top 10 for 2024. Yeah, had a bunch of \"wow\" thank you, no problem. We're doing our best out here; we're trying our best out here. No thanks to Roger. My question for you, Shu, is then 2025 - what's your most anticipated game? Oh, it's so easy, it's so easy. What is it? Oh yeah, it's so easy. You know how much I love Ghost of Tsushima; Sak punch, you know. I'm so excited for Ghost of Y...",
            "start": 7340.48
        },
        {
            "text": "So easy, you know H, you know, you know how much I love you know Ghost of Tsushima. Sak punch, you know, I'm so excited for Ghost of Y, yeah, me too, yeah, yeah. Actually, uh, every time I was in some office, you know, um, in my last role at Sony Worldwide Studios, you know, the head of the studio, uh, was producing the game working with Sucker Punch and they always brought me into the office and let me play the game and uh ask for feedback. Uh, so I've been playing the game for the last few years. You suck, I hate you is that one of... I mean, I guess that's like picking your children, I guess. I was going to say one of your bright spots but obviously when you were president of Sony Worldwide Studios, you're working so closely with Sucker Punch on inFamous watching them make this franchise into superheroes what was how did they pitch you Ghost of Tsushima? Did they just walk in or did you have a conversation? Were there multiple things like there was an Infamous 4 technically but you know what I",
            "start": 7400.84
        },
        {
            "text": "what was how did they pitch you Ghost of Tsushima? Did they just walk in or did you have a conversation? Were there multiple things like there was an Infamous I guess four technically but you know what I mean well you know they they you know they are sure they they are confident as confident they'll make great game but they are not sure if it's the right idea for them to tackle on this Japan-themed game from a studio in the US yeah of course uh but I I remember saying that so they didn't want to do it wrong in the wrong way right they don't didn't want to upset people in Japan um but I said well you know I don't remember exactly what I said but I said that you know Japanese Market is so small don't worry yeah but but but the but the after that you know the you know SIE Worldwide Studios (Studio Japan) people to make sure that they treat the material and gave you know I personally gave you know some feedback you know well do you know it's very easy to mix and match things from",
            "start": 7458.92
        },
        {
            "text": "Studio Japan Studio people to make sure that they treat the material and gave you know I personally gave you know some feedback you know well do you know it's very easy to mix and match things from China or southeast Asia with things in Japan right because it's all Asia right from Western people so Sakai early days had pushed you know uh put some things from different culture and the uh and the team in Japan myself no no no remove this remove this and yeah so gave gave enough feed they did research and uh treated the materials with respect so the game was not just great game but also um made people in Japan proud um yeah good all right then the final thing before I let you go live your life I want to go through and do word association all right I'm going to give you words you tell me the first thing that pops into your mind about it okay okay PlayStation one love all right PlayStation 2 to um us I moved to us okay okay good uh PSP PSP PSP was uh oh short SC yes oh my God it was open",
            "start": 7515.52
        },
        {
            "text": "thing that pops into your mind about PlayStation one love all right PlayStation 2 to us okay good uh PSP PSP PSP was oh short SC yes oh my God it was open t never forget you and then of course you got to go be in the the one they put out on PS4 remember that when they made you they put you in that oh yeah the field love that one uh PSP PS3 PS three was hog PS4 PS4 was Mark okay uh vita va va was VA was VA was again VA was L okay it also meant life but I'll accept love it's fun oh yeah yeah psvr psvr was the most fun I had why personally oh well you know that's another one of collaboration between the game team and the you know Hardware team you know it was God of War team in PS3 days they customized the PS3 God of War and they put PS move onto the video viewer yeah and created a headset you know a v headset and made and they put me that headset and I was wow I was a cros that really amazed me so it was the idea the the",
            "start": 7572.48
        },
        {
            "text": "put PS Move onto the video viewer, yeah, and created a headset you know, a V headset, and made, and they put me that headset, and I was wow, I was a cross that really amazed me so it was the idea the the PS4 uh generation we can do proper VR uh so that idea came from Studio side and the hard their team love as well and I was I was one of the internal lead as an executive lead with the hardware head and myself leading the project internally and I got to announce the project right at GDC, yeah, so I remember I still talk about that all the time whenever we talk about VR you coming on the GDC show and talking about look this is we are PlayStation one again we are starting from scratch back to the I'm sorry I was wrong you know PSVR 2 didn't become PS2 so yeah you can you can what happened with PSVR2, what happened with PSVR2 Shu uh well let's move on the conversations well spoilers it's coming up in a second I need a word for it uh PlayStation PS5 PS5 what's your word association with PS5 PS5 to me",
            "start": 7656.4
        },
        {
            "text": "happened with PSVR2. Sho, well let's move on to the conversations. Well, spoilers, it's coming up in a second. I need a word for it. Uh, PlayStation PS5. PS5 - what's your word association with PS5? To me, somehow, well, Co, yeah, Co days, yeah, yeah, that makes sense. PlayStation VR2 to um is uh two games I super super love you know Synapse Sign-ups, yep, synaps, yeah, and before your eyes, oh, before your eyes, two amazing amazing game, yeah, I want everyone to try if you have PSVR to 100%, yeah, I I remember you know that especially before your eyes hit you as well right, oh, yeah, oh, I I was, yeah, yeah, me too, you know I I had the tears in my eyes uh playing games only twice in my life you know one the first time was Johnny and second time was Before Your Eyes, yeah, it's amazing amazing story, yeah, totally, yeah, 100%. Uh, and then final word association Beyond, yeah, was a Happy Days, yeah, yeah. Uh, Shu, you are amazing, thank you for spending your day with me and coming to hang out and do this podcast with us uh, you're",
            "start": 7720.28
        },
        {
            "text": "uh and then Final Word Association Beyond yeah Y was a Happy Days yeah yeah uh Shuhei Yoshida are amazing thank you for spending your day with me and coming to hang out and do this podcast with us uh you're incredible I love you so much thank you thank you for having me I'm so proud the first thing after I left the company was to show up in this show so thank you for having me we got to figure out time zone to get you here regularly you know what I mean maybe we do every so often once a month we do a Games Daily at 4pm just so we can have Shuhei on to talk about it I'd be happy too I love that I want you to take care Everybody follow up with what Shuhei's on to next I'm sure it won't be long before he's in another game before he's announcing another thing but of course whenever he does announce something we'll talk about here I'm Kinda Funny because we're an 11 person business all about video games and live talk shows about those video games you can catch us with Kinda Funny Games",
            "start": 7794.68
        },
        {
            "text": "something we'll talk about here I'm Kinda Funny because we're in an 11 person business all about video games and live talk shows about those video games you can catch us with Kinda Funny Games Daily each and every weekday followed by the Kinda Funny Gamescast followed by a stream and then often all sorts of crazy stuff apparently the Switch 2 is going to be announced somewhat do you know anything about Switch 2, Shuhei? What do you know about the Switch 2 when are they announcing it I'm happy I'm so happy this show happened before they announce one day they'll talk about that and we'll talk about it as well if you love the content we make here remember you can get it all live and for free on twitch.tv/kindafunnygames and youtube.com/KindaFunnyGames and podcast services around the globe however if you want to go that extra mile pick up a Kinda Funny membership on patreon.com/KindaFunny youtube.com/KindaFunnyGames Spotify or Apple where of course $10 gets you all the shows at free",
            "start": 7844.36
        },
        {
            "text": "if you want to go that extra mile pick up a Kinda Funny membership on Patreon.com/KindaFunny, YouTube.com/KindaFunnyGames, Spotify or Apple where of course $10 gets you all the shows at ad-free, the ability to watch live as we record The Afternoon Podcast in a daily dose of me Greg Miller and a vlog SLP podcast series for now Shuhei Yoshida's amazing until next time it's been our pleasure to serve you beyond beyond",
            "start": 7883.16
        }
    ]
}