{
    "id": 13411,
    "video_id": "jsLjkO3yaFc",
    "show_name": "In Review",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Andy Cortez"
    ],
    "title": "Alien In Review - Every Alien & Predator Movie Ranked & Recapped",
    "description": "Go to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\n\nGo to http://rocketmoney.com/kindafunny to cancel your unwanted subscriptions with Rocket Money.\n\nThank You For The Support!\n\nTime Stamps -\n00:00:00 - Start\n00:08:00 - Thoughts\n00:26:56 - Plot\n00:26:56 - ADS\n01:37:50 - RaGu BaGu \n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1737727260,
    "duration": 6066,
    "transcript_chunks": [
        {
            "text": "It is finally time everybody, for years you have been asking for Kinda Funny to do Alien and Predator In Review, and we are finally here beginning one of the most epic journeys In Review has ever seen. Across many, many, many movies over the course I don't actually know, and they keep adding them, Greg. There's a new one coming this year, Prey: Bad Blood that's why we're doing it. What it's happening? Oh mhm, I've never heard of this. It's happening. Yeah, I don't know. Is it like a Prey thing? It's the guy that did... yeah, they're like I think, and I think it's theatrical right. It is, and then they're supposedly well, I guess we're probably not going to the series but they're supposedly like Alien: Earth as well which is going to be rad. Thank you for bringing that up though. We will not be doing the series this is uh us reviewing ranking and recapping every movie in the Alien vs Predator franchises we will be doing this in release order a lot of people have been asking about",
            "start": 3.44
        },
        {
            "text": "series this is uh us reviewing ranking and recapping every movie in the Alien vs. Predator franchises we will be doing this in release order a lot of people have been asking a lot of questions we will be doing theatrical cuts of all of these movies unless y'all riot and let me know before we get there of like no this's is a definitive version we need to watch no no we're fine we we can have a conversation off air about aliens but I don't think so I think the theatrical releases are totally fine for these theatrical releases is what it is then going forward and we're going to be doing these again release order making decision right now Alien is theatrical release only because I don't I don't like some of the scenes they included in the extra features well you'll have to educate us then I will when we get there I'm that's next week yeah perfect there you go I'm tasking you with that Nick yeah I'm tasking y'all to have a great time and to please show up and support",
            "start": 60.32
        },
        {
            "text": "to educate us then I will when we get there I'm that's next week yeah perfect there you go I'm tasking you with that Nick yeah I'm tasking y'all to have a great time and to please show up and support this again it is going to be a a very big undertaking for us Greg Miller is a very very busy man uh he's making his return here to In Review in the year of 2025 not only for the Marvel stuff and all that that he's always on but now this show which is going to kind of go all the way through the year in a bunch of different ways because remind me chat when we get to the end when it's when it's December I'll wear a croissant hat yep I had to look at you introducing the I'm this is Andy Cortez hello hello they're not on our level man I can see why you miss every day that's every day during Heisenberg or whatever In Review you guys did out here black and white art pieces Nick would slack me like please come back to the show can we watch a movie with a gun talking intelligently get",
            "start": 103.0
        },
        {
            "text": "or whatever In Review you guys did out here, black and white art pieces. Nick would slack me like \"please come back to the show.\" Can we watch a movie with a gun talking intelligently? Get flamethrower! I need Greg's oh my God. Watch a movie with a gun in it and R out the group. We have Nick Scarpino. Hello Tim, I am very very excited to talk about this movie and all of the upcoming movies. Cuz this is Kinda Funny as In Review each and every week we get together to rank review and recap different movie franchises. Of course if you want to go above and beyond you can get the Kinda Funny membership that allows you to get the shows ad-free, watch live as we are recording like Langley M Neely uh King Roba Cameron Kennedy Matthew Hialgo Mike L the goats. We appreciate you all so very much for doing that. You also get a daily exclusive Gregway that you can check out and you get to be a super cool Patreon producer if you would like like James Hastings Casey Andrew and Carl Jacobs um today you",
            "start": 152.36
        },
        {
            "text": "that you also get a daily exclusive GameOverGreggy that you can check out and you get to be a super cool Patreon producer if you would like, like James Hastings, Casey, Andrew, and Carl Jacobs. Um, today you Shady Rays and Rocket Money, but we'll tell you about that later. Little housekeeping going back to uh how we're going to handle this franchise it is going to be intermittent throughout the year whenever we have the space in between all the new releases for previous SP between uh then we're getting L I knew it I'm bad I mean it's just again I was getting all these things like I'm sick of watching Alien but over here when we going to talk about DMB what would you say Nick, you know exactly right, what would you don't mind the mail man like aliens like a real movie and I was hoping like one time we' just be like let's just be a little professional on this no you guys let it build up okay bu he's out of his egg now egg just like the little aliens off uh but we'll get there so this week we're doing",
            "start": 198.04
        },
        {
            "text": "be like let's just be a little professional on this no you guys let it build up okay bu he's out of his egg now egg just like the little aliens off uh but we'll get there so this week we're doing Alien next week we're doing Aliens then the following two weeks we'll be going back to where it all began the MCU it will be our great Marvel rerank and then Captain America Brave New World after that after that we're coming back to this franchise Predator 1 Predator 2 Alien 3 Alien 4 all right I don't want to go past that because who the hell knows what the hell's going to happen but the series will go past that yes say yes after that we will but it's just going to be a while cuz there's a lot of movies backed up after that uh new franchises I think we're returning to The Karate Kid oh with karate K Legend I haven't seen any of those freaks oh the the Netflix I didn't finish it you're only me you better catch up you only got a couple weeks we're doing that as a screencast cuz TV shows now",
            "start": 248.0
        },
        {
            "text": "K Legend I haven't seen any of those freaks oh the Netflix I didn't finish it you're only me you better catch up you only got a couple weeks we're doing that as a screencast cuz TV shows now screencast everybody Cobra Kai the end of Cobra Kai the end of an era around Valentine's Day I think we're recording it on your birthday actually a birthday present for you anyways we'll get to all that stuff later cuz we got to get into Alien released on May 25th 1979 months before Nick Scarpino was even born that's right May yeah uh directed by Ridley Scott with music by Jerry Goldsmith uh but it was conducted by Lionel Newman and that mattered enough that it was one of the first things you see on the screen the conductor I thought that was interesting yeah do you know who Lionel Newman is great never heard of Lional Richie's brother they did in Reverse actually their names are different back then if you're going to be in this musical family we're the Lionel family but not our",
            "start": 294.96
        },
        {
            "text": "Is great, never heard Lionel Richie's brother; they did \"In Reverse\" actually. They're names are different back then. If you're going to be in this musical family, we're the Lional family, but not our last name. You want to call them Newman - the musical family, in fact, is the Newman part, not the Lionel part. Cuz remember Lionel Newman, brother of Alfred Newman and Emil Newman; Uncle of composers Randy Newman, David Newman, Thomas Newman, Maria Newman, and grandfather of Joey Newman. We got to save this cat, Joie. Andy, let me ask you a question: You're in this situation right? You go back for the cat... no... no dude, a catat... like... anyway, the end sucks. I saw this and I was just like, \"I don't care if it's Patel I'm out.\" Yeah, see you - you know what I mean. We got bigger problems going on here. Yep, I'm why the alien leave him alive? I know we're jumping ahead a little bit... the cat yeah sees him in the box. I well, I mean chill. I don't I mean you have to think of it this way: an alien's like seven feet tall.",
            "start": 338.64
        },
        {
            "text": "I'm why the Alien leaves him alive, I know we're jumping ahead a little bit. The cat yeah sees him in the box. I well, I mean chill, I don't I mean you have to think of it this way, Aliens are like seven feet tall, this cat's a little snack to him, doesn't really matter. Also, that's my favorite shot in the whole movie is when he like it rack focuses from the cat in the cage to the Alien realizing that the cat's like leaving and the Alien has to leave, it's cool cool stuff man. Uh, this one had a budget of $1 million on a box office of $187 million. In terms of Awards in 2002, Alien was deemed culturally historically or aesthetically significant by the Library of Congress and was selected for preservation in the United States national film registry in 2008. It was ranked by the American Film Institute as the seventh best film in the science fiction genre and the 33rd greatest film of all time by Empire. It initially received mixed reviews but it won the Academy Award for Best Visual Effects three.",
            "start": 392.4
        },
        {
            "text": "as the seventh best film in the science fiction genre and the 33rd greatest film of all time by Empire it initially received mixed reviews but it won the Academy Award for Best Visual Effects three Saturn Awards and a Hugo Award for Best Dramatic Presentation uh what I find I don't want to hate too much I love this movie just want to get that out of the way before getting some stuff couple things I have big problems with you got and one of my big problems with maybe I am just completely off base on because one of these Awards the Saturn Award was Best Supporting Actress for Veronica Cartwright yeah yeah I love her I hate her so much in this not it's not a matter of hate it's just a matter of like she's the character that just kind of loses it and I think she's I think her performance in this is awesome man could not disagree more but we'll talk about that when we get into our thoughts speaking of thoughts Andy I want to start with you have you seen Alien before no this was",
            "start": 436.72
        },
        {
            "text": "in this is awesome man could not disagree more but we'll talk about that when we get into our thoughts speaking of thoughts Andy I want to start with you have you seen Alien before no this was my first time as an adult watching this movie I'm recording a track so I'm trying to keep on tempo this is my first time watching this movie as an adult uh one of those typical in reviews just like you know Terminator back in the day my dad had this movie on a whole lot when I was a kid so I know all the the family guy jokes all that **** you've heard if you've seen an interview you kind of know my backstory with a lot of '80s movies but this is like my first time actually kind of fully watching it as an adult front to back and uh man watching it's like they don't they don't make them like they used to you know I just I there's just a there's a different like strategy and letting just cameras sit on **** and just letting environment kind of be an actor this movie kicks ass dude I I",
            "start": 485.48
        },
        {
            "text": "they used to, you know, i just, there's just a there's a different like strategy and letting just cameras sit on **** and just letting environment kind of be an actor this movie kicks ass dude i i really really enjoyed it i kind of you know kind of felt the same with that uh actor i think she was you know kind of wild um but i don't know man they just did such a great job with setting tension setting the mood the  littleit too much stroll blasts at the end God damn that was i had to like holy **** man it was a brand new technology in 79 yeah they stoked about it it's like when we got star wars where that **** what's the music we used in dubstep we really are we really abused dubstep yeah um i don't know i just really thoroughly enjoyed my time with this movie had an awesome time with it stoked for the rest of it because i know a lot of people love aliens uh even more Greg Miller hey are you a big Alien fan wow great question i have a great appreciation for Alien I would say",
            "start": 531.04
        },
        {
            "text": "it stoked for the rest of it because I know a lot of people love aliens uh even more Greg Miller hey are you a big alien fan wow great question I have a great appreciation for Alien I would say uh so me and my dumb friends were Terminator-obsessed as we've talked about you know what I mean we would all ride around we'd go out for you know in my mom and dad's RV we' go go to the campsites we'd take the banana seat bicycle off the back that was the motorcycle you play Terminator where one of you ran and hid and the other or well two of you run and hide the other on the bike tries to find you like Arnold from T2 great games and we had a shotgun that looked way too real I don't know why they were making shotgun fire real shells like that's a shotgun that's not a toy anyways uh you know the natural line there then of being obsessed with Schwarzenegger me you obsessed with Predator meant you were obsessed with any other Schwarzenegger movie which meant you were obsessed with the",
            "start": 579.8
        },
        {
            "text": "know the natural line there then of being obsessed with Arnold Schwarzenegger, me you obsessed with Predator meant you were obsessed with any other Schwarzenegger movie which meant you were obsessed with the one and only Danny DeVito that of course led us to Aliens too which or Aliens I should say sorry which then of course would lead us to Alien but as juveniles we're talking like sub 10-year-olds here watching it Alien was a much slower movie so Alien was appreciated, Aliens 2 was Aliens was beloved, Alien 3 was something we were all excited for and they like oh this is dog **** you know what I mean so it's like I've been around it but I would say especially as we've gone forward I've fallen off I still never seen Prometheus like I Alien 4 I that's Resurrection is that and that's the that's the one with Ron Perlman yes Ron Perlman when out writer yeah that's the one that I've seen uh on USA like Midway through or whatever you know what I mean so to jump back to Alien and what we're talking",
            "start": 626.48
        },
        {
            "text": "with Ron Perlman, yes, Ron Perlman, when out writer, yeah, that's the one that I've seen uh on USA, like Midway through or whatever, you know what I mean? So to jump back to Alien and what we're talking about today, this is my first time watching it as an adult sit down, I'm watching the entire Way start to finish but not my first time ever seeing the film so I, it was one of those I, I was I was actually when I sat down prepared to see a whole bunch of brand new stuff and by the end I was like oh no I have seen this movie enough that it was all assembled in my brain at least in somewhat of the correct order but what a film you know what I mean? I think again so funny uh you know for what a movie is in 1979, what a movie is in general, what this franchise goes on to become right like such humble beginnings of such a small character piece you know I mean a sci-fi film to its core an alien that like appreciate it don't you totally Embraces even when he's like all tired on the Escape show you know",
            "start": 671.04
        },
        {
            "text": "of such a small character piece, you know, I mean, a sci-fi film to its core, an Alien that likes to appreciate it, don't you totally Embraces even when he's like all tired on The Escape show, you know, there was like one second more of that shot in the director's cut. He goes, \"Hey, come on, come on, exactly, exactly, exactly.\" But it's like, yeah, I mean what a film, what a fun time, what what you know, what a tense time, it's you know such a great horror movie of like why are you doing this, why is that decision, why the **** going on with that and you know even they split up at every given opportunity, of course. And again, like I wish the one thing I wish I could have erased from my brain to get back to this which would be impossible with all the sequels right would be Ash and that reveal right of knowing he's an Android or whatever watching I had no idea, yeah, yeah, exactly. I'd love to hear you guys who haven't seen it talk about that mind was blown at that moment I had remembered it from the one time I watched it and I",
            "start": 710.64
        },
        {
            "text": "whatever watching I had no idea yeah yeah exactly I'd love to hear you guys who haven't seen it talk about that mind was blown at that moment I had remembered it from the one time I watched it and I forgot and then when I started seeing the the white stuff I was like oh I remember what's about to happen she was like what the fck it's such an interesting one and correct me if I'm wrong please but it's such an interesting one of knowing that information from a previous watch and watching it again like when it starts happening it's so like there haven't been that many nods to it there haven't been in that many things I feel that the movie tells you to be like on the lookout that this guy might be an Android or whatever well you don't have any watching this movie for the first time you don't even know there is such a thing in this universe as a synthetic life form so when it starts going wigging out I like I can only imagine what this must have been like for Giamatti yeah exactly it's less",
            "start": 759.44
        },
        {
            "text": "know there is such a thing in this universe as a synthetic life form so when it starts going haywire I like I can only imagine what this must have been like for Ripley yeah exactly it's less than the clues that there's an android not that I saw that but like just clues that you should be suspicious of this guy he just joined the team yeah there's the moment where we like I don't trust him and to that degree like Ian Holm does just such a good job of while all the other characters are reacting in a terrified way he's like interesting like are they though what's that I feel like one of my biggest criticisms of this movie is like no one seems scared until like it's in their face they walking around this room just like Joe I agree but you have to remember also like up until basically the last like 15 minutes of the movie they don't really know what this thing is the last time they saw it was a facehugger and then when it pops out well it pops out of the chest",
            "start": 795.0
        },
        {
            "text": "basically the last like 15 minutes of the movie they don't really know what this thing is the last time they saw it was a facehugger and then when it pops out well it pops out of the chest it's just this little tiny thing so they just think they're hunting something the size of a cat they don't know that in five minutes this thing grows to the size of a massive like nightmarish monster and so by the time she sees like I think Ripley sees it for the first time when she comes around the corner with Jones and it's like **** like what is that thing and that's when she runs back to try to stop the self-destruct I could be wrong she might have seen it when it killed uh and Parker sees it and it's telling them that it's all it's huge it's **** huge which is weird because Parker we actually that was a part that was cut out I think there's actually a three hour I think the original cut but there like three hours so there are parts of it where I think he saw it CU there",
            "start": 834.24
        },
        {
            "text": "actually that was a part that was cut out, I think there's actually a three hour original cut, but there are parts of it where I think he saw it CU there is there are some weird edits here where he's like this thing's huge man you're like you haven't seen it we didn't see you see it as an audience member I'm so glad that but they don't believe him they're like what we don't know what this thing is I'm so glad you're telling me that because without those cuts if I were the other crew I'd be like Parker's killing everybody yeah Parker is the only one who saw it lift homeboy in the bottom of the work uh you know when he lifts him up or chains are there and then you know he's like man this thing was huge I can't believe he took him and then when uh Dallas is in the thing and he goes down there he's like all all we found was the flamethrower it's like hey Parker what you're doing you I don't know what I don't",
            "start": 871.28
        },
        {
            "text": "Dallas is in the thing, and he goes down there; he's like, \"All we found was the flamethrower.\" It's like, \"Hey, Parker, what you're doing?\" You're the only one who likes... I don't know what. I don't think they know quite what they're dealing with until it's too late. And then she sees it, and she's like, \"You know that? That's like yeah.\" Anyway, totally, that's where that goes. Uh, before I get to your thoughts, I forgot to ask you: So, what is your history with the Alien franchise? I've seen... oh gosh, well, I'm not going to future-spoil one of the future Alien movies, but I have seen Prometheus a couple times, and like, I know nobody loves that movie. I really kind of dig the movie; my wife loves it. I just dig more like the sci-fi concept, not necessarily what happens in the movie. She likes about it too; it's like weird. I think it's just so creative with kind of creating the prequel order, but yeah, that's pretty much it. It's just that, and then along with when it comes to the Predator.",
            "start": 904.44
        },
        {
            "text": "about it too it's like weird I think it's just so creative yeah with kind of creating the pass order but yeah that's pretty much it it's just that and then along with when it comes to the Predator movies I've seen Prey I've seen we saw the first Predator remember we had that watch party with James and here um I saw Predator 2 on a **** you know Summer Afternoon on HBO I was like man Danny Glover is hot out there you know like he's sweaty he's so sweaty um but yeah as far as Alien movies goes it's pretty much this was the first one that I watched in a long time front to back and I've seen Prometheus and Aliens I've just kind of seen Stills and different parts of that throughout my childhood as well but the other ones I don't really have any clue I have no idea Nick what about you for me uh my entry point into the series was Aliens so that movie came out I believe in '86 and I could be misremembering it but I'm pretty sure I saw it in theaters which sounds nuts cuz I was 6 years old",
            "start": 952.48
        },
        {
            "text": "My entry point into the series was Aliens, so that movie came out I believe in '86 and I could be misremembering it but I'm pretty sure I saw it in theaters which sounds nuts cuz I was 6 years old and there's no way my parents should have been allowed me to do that but I distinctly remember a tagline of some sort where like the second we will like blow you out of the back of the theater and I remember we're sitting at the back of the theater I was like I don't want to get blown out of the back of the theater and then and then I remember being like it's it's it's I remember falling in love with that movie being terrified of it but wanting to watch it over and over again uh my dad being pissed off because we took all of his PVC pipe and made all the Colonial Marine gear including like the helmets and like we made all the guns and like we're walking around with like his duct tape he's like that was like $40 worth of duct tape and PVC pipe we're like but it's so cool I'm and and and no",
            "start": 998.44
        },
        {
            "text": "helmets and like we made all the guns and like we're walking around with like his duct tape he's like that was like $40 worth of duct tape and PVC pipe we're like but it's so cool I'm and and and no one wanted to be Hudson um you'll get that next week um but then I distinctly remember there was a moment where I was like that's so cool this movie is called Aliens and I don't know if it was my parents or if it was the guy at my local video store who was like you know that's a sequel right and I was like what are you talking about and then you'd go and you because I remember seeing this but I never put two and two together because the cover for Aliens was I just I guess maybe it was different and I remember like when it came off the news shelf and went to like the old school shelf it's right next to Alien right next to Alien I was like what and I turned it over and I saw Sigourney Weaver with the longer hair and I'm like wait there's another one of these that happened before this and I watched it",
            "start": 1037.6
        },
        {
            "text": "next to Al right next to Alien I was like what and I turned it over and I saw Sourhwe with the longer hair and I'm like wait there's another one of these that happened before this and I watched it was blown away that I'm like whoa that makes a lot of sense and you'll see next week because that one starts off and it's clearly a sequel um I love this movie I think from a production standpoint uh it is from production design standpoint it is one of the most stunning movies uh of its time and putting it contextually like you have to give credit to Dan O'Bannon, John Carpenter, and Ridley Scott guys because um you know there wasn't really anything like this back then uh Star Wars and A New Hope was huge uh 2001: A Space Odyssey was huge you had movies like uh Star Trek: The Motion Picture that was like Hey we're going to make 2001: A Space Odyssey but we're going to try to do our own take on that with Star Trek and that failed miserably",
            "start": 1074.32
        },
        {
            "text": "Had movies like uh Star Trek: The Motion Picture, that was like \"Hey, we're going to make 2001: A Space Odyssey, but we're going to try to do our own take on that with Star Trek\" and that failed miserably because it was just boring as hell. And so for him to look at and sort of be inspired by New Hope and inspired by 2001 and be like \"What if we did... what if we could take that into space and basically make Jaws in space, which is how this was pitched?\" Um, and then have it be as good as this movie is and as iconic as this movie is and then as enduring as it is is just a testament to how awesome that crew was that worked on this. And I just give a shout out to Sigourney Weaver for just being like \"hard\" not hard carrying the movie but being just like the Ripley character in this, specifically obviously Ripley - one of the most iconic heroes basically of the Silver Screen. But I think Sigourney Weaver brings such a level of groundedness to this and I love her.",
            "start": 1116.6
        },
        {
            "text": "obviously Ripley is one of the most iconic heroes and heroines basically of the Silver Screen, but I think Sigourney Weaver brings such a level of groundedness to this and I love her character because she's the only one who's like \"follow quarantine, what are we doing this for?\" and she's fighting sort of that fear of the corporation or you know she has that altruism to it and I think she just brings an awesome dimension to this role 100% yeah yeah so I'd seen this movie when I was like 15 or something and like I appreciated it, I liked it a lot then but I remember it being really slow and stuff and then I was hyped on it though and I was like \"oh man, the next one's what everyone loves, it's more action focused\" and I convinced a group of my friends to watch it uh like during college or something like at one of our FR Hangouts right which meant I didn't really watch the movie you know what I mean so I can't wait for next week to see",
            "start": 1160.44
        },
        {
            "text": "to watch it uh like during college or something like at a one of our like FR like Hangouts right which meant I didn't really watch the movie you know what I mean so I can't wait for next week to see what actually happens there then I saw Alien vs. Predator in theaters with Alfredo and then I saw Prometheus in theaters with Alfredo because he was a big uh aliens person that's it so I haven't seen any Predator movies and haven't seen the majority of these Alien movies so I'm incredibly excited uh and we are starting off on a very very very good foot because this movie is freaking incredible man like I was blown away from the jump of the production design um and mostly by realizing that Nintendo ripped them off and Metroid has nothing unique about it all whatsoever like it's insane like the even the escape sequence at the end and Ridley Scott's Alien, specifically Ellen Ripley, I'm like okay female heroine it's like her and the underwear and stuff I'm like this is crazy like Nintendo you should be sued",
            "start": 1202.76
        },
        {
            "text": "like the even the escape sequence at the end and Ridley Scott's Alien, I'm like okay, female the heroine, it's like her and the underwear and stuff, I'm like this is crazy, like Nintendo, you should be sued, you keep suing everybody before they had international law, they figured out you know, but like it is like kind of wild, like they clearly were like oh let's just make an Alien video game but for kids and make her a bounty hunter which is dope as **** um but yeah this movie you said Jaws in space like that's such a great way to put it because it's just such a great sci-fi horror movie that doesn't like go too hard or go too far, like I love how limited it all is, I love that the world is so black and white in a cool way, where like the Nostromo, such a well-designed ship, Nostromo, I come on, cool as hell, I love that the title card is giving you everything you need to know, like the crew, what the mission is all that stuff, okay, kind of sick, seven people in this movie it's it and I I love that you kind of",
            "start": 1248.4
        },
        {
            "text": "love that the title card is giving you everything you need to know like the crew what the mission is all that stuff okay kinda sick seven people in this movie it's it and i i love that you kind of get a countdown right you're like all right cool like how many are there going to be by the end of it right uh but that was so cool and seeing the ship and all the production design in the very first shots of the movie is the camera's kind of just going through introducing you to the halls and stuff everything has this like sick ass white look but it's very different than like the Empire ships from Star Wars and then later getting into the Alien ship and everything looking like organic and black i'm like this is so well thought out and i feel like so much of this tells a story without them saying anything which reminds me of Metroid a lot um but very very cool stuff throughout the the entirety of it some stuff's weird and comes out of nowhere it's fun and twisty and i feel fits the",
            "start": 1293.16
        },
        {
            "text": "saying anything which reminds me of Metroid a lot um but very very cool stuff throughout the entirety of it some stuff's weird and comes out of nowhere it's fun and twisty and I feel fits the world like the Android stuff but I feel like that could have been explained a little bit more um but also I buy it I get it contextually too and and no future spoilers but obviously we know like Androids are a thing in the Alien universe and so for me watching the second one first and getting a little bit more context for for how they exist going into that that that didn't ever stick out to me but I can opposite like seeing that now I'm like yeah that'd be weird as **** like why is he a robot is anyone going to explain that why is he have milk for blood I mean when when you see that moment of the sweat kind of looking milk and like I I immediately was like oh my God that kind of looks like the when you know I was watching Nick play Alien: Isolation and the enemies just kind of like have this",
            "start": 1333.48
        },
        {
            "text": "sweat kind of looking milk and like I I immediately was like oh my God that kind of looks like the when you know I was watching Nick play Alien: Isolation and the enemies just kind of like have this dude it was so weird looking cool as hell man but I usually don't like the slow play stuff love to hear I thought that they just did a very good job of like leaving you in the world and making you feel and believe what they were setting up um and this being 1979 what a goddamn accomplishment like it is just so practical set practical models that look amazing um those moments where like we'll get into the plot in a second but my one of my favorite things about this movie is how it starts right um it's that title sequence that's pretty iconic and if I'm not mistaken I think I read a piece of trivia that said Dan O'Bannon, uh designed the actual lettering and stuff like that we see the crew of The Nostromo you know deep space mining Bessel in a Strom 07 whatever they're coming back and then we get just",
            "start": 1375.88
        },
        {
            "text": "that said Sal Bass uh designed the actual lettering and stuff like that we see the crew of The Abyss you know deep space mining Bess in a Storm 07 whatever they're coming back and then we get just the shots of the Interior cuz you know at one point Ridley Scott looked at it and was like this looks **** cool let's just start the movie with it and then you get the shots of the the the bridge and then those weird ass they never use them you never see them again just these weird emergency helmets that are just sitting behind them and then the shot of the screen then the shot of the helmet then the shot of the screen and the shot of the helmet you're like why am I so tense right now and the screen lights up and scares the **** out of you you see it on the helmet and it's called Mother Brain I'm telling you they should just be sued what I what I loved about those moments of just kind of here's the inside of the ship is like hey this isn't going to look like this later so",
            "start": 1423.96
        },
        {
            "text": "Mother Brain, I'm telling you, they should just be sued. What I loved about those moments was just kind of here's the inside of the ship; it's like, \"Hey, this isn't going to look like this later.\" So, look at how it is now - peaceful, it's quiet, nobody's awake still in their pods, and get ready for the chaos that's going to happen later. So cool! I absolutely loved it. On the Kinda Funny scale, I'd give it a nine out of ten because I think it's such an incredible 1979 film; I can't believe they pulled so much off, but it's not without criticism. I do feel like some of the um, I mean, that Veronica Cartwright - yeah, Veronica Cartwright really didn't like what she brought to the table here, and I think that uh, story-wise, character-wise, some stuff just feels very... un, I just don't understand why they would do the things they're doing; it doesn't feel like it fits in the world. Like, the fact that everybody is constantly splitting up, the fact that they do not feel as terrified",
            "start": 1463.92
        },
        {
            "text": "understand why they would do the things they're doing, it doesn't feel like it fits in the world. Like, the fact that everybody is constantly splitting up - the fact that they don't feel as terrified. I get that they didn't see the big guy, but they did see the little thing suck onto a dude, true, and essentially kill him, uh, and then kill him, and then burst out of his chest, and then have acid blood, and they're just walking around the rooms like \"minorly\" - where is this little thing? Didn't like that you let the cat go get it on your own. Like, that dude's like, \"Oh yeah, I'm going to go do that.\" I didn't like that stuff. And then, like Andy said, I thought that the uh um strobe light stuff was incredibly overused. I get that they want you to feel like you're there and feel the tension - it's like, okay cool, I'm now upset at this as opposed to feeling immersed and turning away at the end. I was like, it kind of hurts the sound design when it hits - oh my God, it hits but there are",
            "start": 1514.32
        },
        {
            "text": "the tension it's like okay cool I'm now upset at this as opposed to feeling immersed and turn away at the end I was like it kind of hurts the sound design when it hits oh my God it hits but there are minutes of this movie that are just yeah there is I was wondering if maybe that was my speaker or my TV that wasn't set up for Dolby because there's there's a high-pitch scream slash white noise sound that happens when the aliens on screen that I was like that's that is a little that takes you out of it a little bit it's anytime the aliens are there but mainly my criticism is when they land on the planet anytime and I get what they were doing and because it does work a bit where it cuts from on the ship it's dead silent and then they're outside and it's just chaos but it's like okay show us once or twice like we don't need literal minutes of this like sound so yeah that's all I have to say about the negatives otherwise like goddamn this is awesome really really cool Andy",
            "start": 1553.44
        },
        {
            "text": "Show us once or twice like we don't need literal minutes of this, like sound so yeah that's all I have to say about the negatives otherwise, like God damn this **** is awesome really really cool Andy Cortez are you ready to get us to the plot? Yes good after a quick word from our sponsors. This episode is brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends over at Shady Rays have you covered with premium polarized shades that won't break the bank. Shady Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people. They have hundreds of options to choose from so you're bound to find the perfect pair to match your style. Plus if your shades ever go missing or take an unexpected hit don't sweat it they have the most insane protection in all of eyewear every pair is backed by lost or broken replacements if you don't love your shades exchange them for a new pair or return worry-free within 30 days.",
            "start": 1595.44
        },
        {
            "text": "it they have the most insane protection in all of eyewear every pair is backed by lost or broken replacements if you don't love your Shades exchange them for a new pair or return WorryFree within 30 days y'all know I've been outside a lot in the sun playing Pokémon Go and it's such a great experience wearing my Shady Rays when I'm out and about looking dope exclusively for you Shady Rays is giving out their best deal head to shadyrays.com and use code funny for 35% off polarized sunglasses try for yourself the Shades rated five stars by over 300,000 people that's shadyrays.com use the code funny this episode is brought to you by Rocket Money you sign up for something forget about it after the trial period ends then you're charged month after month after month the subscriptions are there but you're not using them in fact 85% of people have at least one paid subscription going unused each month thanks to Rocket Money you can see all your subscriptions in one place and cancel the ones that",
            "start": 1640.64
        },
        {
            "text": "you're not using them in fact 85% of people have at least one paid subscription going unused each month thanks to Rocket Money you can see all your subscriptions in one place and cancel the ones that you're not using anymore and save more money Rocket Money has helped multiple members of Kinda Funny learn that they are still paying for things they totally didn't even realize Rocket Money is a personal finance app that helps find and cancel your unwanted subscriptions it monitors your spending and helps lower your bills so you can grow your savings Rocket Money has over 5 million users and has saved a total of $500 million in canceled subscriptions saving members up to $740 a year when using all the apps premium features cancel your unwanted subscriptions and match your financial goals faster with Rocket Money go to rocketmoney.com/kindafunny today that's rocketmoney.com/kindafunny",
            "start": 1686.96
        },
        {
            "text": "faster with Rocket Money go to rocketmoney.com Kinda Funny today that's rocketmoney.com Kinda Funny Rocket Money.com Kinda Funny noo has got that's what I got and he made that while we started recording I was that was I was in my car wash I got a car wash a little while ago I was like oh **** I I got stupid plot on God damn I love that so much Kevin can I tell the story real quick yeah I guess one of my favorite Kevin Coello stories that I've told all of you before but everybody needs to know uh we were 12 years old taking a bus down to Lake Tahoe uh we're me cool Greg and Kevin trading off our Game Boy Advance back and forth playing Donkey Kong Country meanwhile the new technology like CD players and headphones are a thing oh yeah Kevin's headphones CD players he has one song on loop the entire time Domo arigato Mr. Roboto",
            "start": 1730.12
        },
        {
            "text": "playing Donkey Kong Country meanwhile the new technology like CD players and headphones are a thing oh yeah Kevin, headphones, CD players he has one song on loop the entire time Domo arigato Mr. Robot and Kevin with the headphones on singing out loud randomly throughout the entire music Just Hits you know am I is so cool it is so cool you just do this a par wants our race grey welcome to Alien everybody as we've already said multiple times you're on the Nostromo which has been a name I've been struggling to remember I love it Nostromo, Nostromo yeah but it's like Nostradamus but then it's Nostromo apparently they got the word the the name when uh I guess one of the writers or producers was uh got it from a Joseph Conrad novel and was like that's it means I guess he's like people like what does it mean what's the significance he goes it just sounds cool and it does uh they're on their way back to Earth or so they would think but guess what on the way there they get interrupted by",
            "start": 1789.68
        },
        {
            "text": "what does it mean what's the significance he goes it just sounds cool and it does uh they're on their way back to Earth or so they would think but guess what on the way there they get interrupted by Mother waking them all up because what uh we will eventually find there's a distress signal being that's been found and that they're being called down to or at least that's what they'll tell Dallas yeah I have one minor I don't have any criticisms I like Veronica Cartwright I like everything I don't care how goofy the Alien looks falling out of the thing at the end I don't like whatever why they put John Hurt in this little diaper why do he got to wear the little diaper everyone else gets normal underwear he wakes up and he's just like in this weird like like diaper We does not have normal underwear space space under explanation for this no that is I think I would assume that uh the corporation that is never named here right uh I don't know that they bring in we're always called the",
            "start": 1845.72
        },
        {
            "text": "underwear space was a reference to the Y-fronts style in the movie, specifically the Alien franchise. The correct term is likely from the 7 I think that's the style of what underwear was back then but it's odd that they that they were like you're going to get naked here it's it's a weird moment for that and uh yeah that's always one of those scenes where you watch it now in the year 2025 and you're like why why did she have to be like that yeah he's in this weird oh he does have a diaper yeah remember he's European so that's probably why that's fair it's English uh of course they all start waking up from their little sleep pods as you see Johner wakes up first of course first to die oh is that you uh so they they get up and they all start making",
            "start": 1883.6
        },
        {
            "text": "English, of course, they all start waking up from their little sleep pods as you see John wakes up first, of course, first to die. Oh, is that you? Uh, so they get up and they all start making their coffee and having their breakfast, and the coffee is the only thing good on this ship. We get a lot of lovely crew banter here. Another great choice by Ridley Scott. He basically turns the camera on and tells his crew who's been hanging out to just talk, and you wouldn't get this in any other movie because there's nothing really audible about this. They're talking about like past this, what's this? I want to rate... whatever subtitles can't even keep up. You can't keep up, and I think he did that on purpose to be like these guys are they're deep space truckers basically, they're kind of blue collar, is they've been around each other forever, they would be friends there would be this banter around this, and it really makes this scene for me feel like real. I agree, good uh yeah I agree with",
            "start": 1927.92
        },
        {
            "text": "collar is they've been around each other forever they would be friends there would be this banter around this and it really makes this scene for me feel like real I agree good uh yeah I agree with that 100% uh yeah as you said the banter eventually goes to Parker and Brett wanting try to negotiate more negotiate a full share which already tells us you know they're the they're the Gearheads they're not the they're not the scientists they're not the actual astronauts here which they're not they're the maintenance crew basically right love these guys of course there's a fun banter about that hoay hoay hooray uh but then Ash gets a word that mother is calling Dallas our captain down to the mother pod so he heads down there on I mean come on Dallas where did we last see Dallas Andy Cortez Top Gun Top Gun one oh **** I didn't remember that he just looked familiar and I googled I was like oh yeah's a handsome son of a **** God handsome as hell dude uh he goes down there and starts",
            "start": 1968.36
        },
        {
            "text": "Top Gun Top Gun one oh **** I didn't remember that he just looked familiar and I googled I was like oh yeah's a handsome son of a **** God handsome as hell dude uh he goes down there and starts getting his messages of course meanwhile upstairs everybody reports to their crew assigned positions where suddenly they realize something's not right they don't know what that star system is there we're not where we should be uh Ripley keeps saying we're not in our solar system whatever she said she has a great way too where it's like it's not she's like we're not I'm telling you we're not in our solar system L's like I know yeah great I know shut the **** up we get it know it all right uh Dallas comes up with bad news of course it's the fact that we are not on our way to home we are not stop we are not that close to Earth like we hoped we are not on the Outer Rim uh we have uh intercepted our mother has intercepted a distress call and we're going to go check it out to which immediately",
            "start": 2008.28
        },
        {
            "text": "we are not that close to Earth like we hoped, we are not on the Outer Rim uh we have uh intercepted our mother has intercepted a distress call and we're going to go check it out to which immediately uh Ripley's like \"the ****\" we are I didn't sign up for that that's not the thing to which of course Ash is already established we how much Parker and Brett W money Ash flips on him is like of course you know sub paragraph 12 of your contract says if you don't go do this you get no money so you have to go do this and that's mirrored later in the scene where Ripley pulls Dallas aside she's like \"we shouldn't be doing any of this\" and he's like \"we just do whatever the **** Corporation tells us to, like let's be honest who we are here B like we're just going to do what they tell us to cuz they have all the cards and it's a shitty place to be to it's a great place to put your characters in because if they're desperate they don't get their shares unless they go to this thing when they're talking",
            "start": 2046.32
        },
        {
            "text": "all the cards and it's a shitty place to be to it's a great place to put your characters in because if they're desperate they don't get their shares unless they go to this thing when they're talking to mother you're like what are what do these lights do what do these lights here for it's cool I just love the tiny little TV tiniest little and they're kind of all around the room but it's just hilarious that like when they show it kind of reminds me of like looking at the the old model Nintendo Switch with the bezel yeah it's like here's this wall tin little screen I uh I love also the buttons too like the buttons aren't like wasd they're they're weird iconic like the iconography on the buttons are just like weird I didn't notice that yeah some of it's like it's not like a standard keyboard but all around there's like little weird symbols and stuff everywhere of like what is this yeah when they're talking to Mother especially when Satoru Iwata goes down there",
            "start": 2081.24
        },
        {
            "text": "a standard keyboard but all around there's like little weird symbols and **** everywhere of like what is this yeah when they're talking to Mother especially when Soury Weaver goes down there yeah they get a lot of close-ups on the weird buttons yeah it's weird uh from there we get a picture perfect landing on this place no we don't actually it looks fine until the very last second and then they kind of just drop and everything breaks loose all hell breaks Lo pouring in well they don't have a hole breach that was the concern CU they' be dead right there's a lot of concerns is that a hole breach no but XY and Z is all wrong on the **** ship uh Parker and Brett immediately run down there see so cool like what is that it's Avid that's the that's the ID that's the self-destruct button but it does look like Avid holy **** right that's a good pull Parker and Brett go investigate they're calling back up there all hell's breaking loose gy Weaver's doing this thing blah blah",
            "start": 2125.4
        },
        {
            "text": "button but it does look like Alien vs Predator right, that's a good pull. Parker and Brett go investigate, they're calling back up there, all hell's breaking loose, Weaver's doing this thing blah blah blah blah. There's a conversation of how long it'll take, which I love, \"how long's\" and then in Brett Parker Longs he's like calls back, he's at least 26 hours so yeah uh while this is happening of course uh they're like well we should go out and investigate this signal right uh Ash is going to run basically Hawkeye the lookout there you know be on top of it Overwatch uh Dallas Lambert and Kane are going to go out there no guys not the Big Red Machine, who's the mayor in Tennessee, different G uh he's going to go out there his brother uh they get ready to head out there. Soury Weaver see that's everybody, you don't know what amazing that was the uh sour Weaver goes down there to talk to Brett and Parker, they're like screaming over the smoke and being dicks to her or whatever and she walks off just",
            "start": 2158.88
        },
        {
            "text": "you don't know what amazing that was the uh Sourhweaver goes down there to talk to Brett and Parker they're like screaming over the smoke and being dicks to her or whatever and she walks off just turn it off a bunch of **** I like that that's another little good moment in there and I you know I don't think I ever caught that sort of divide between the crew like the executive branch of the crew and then the sort of Gearheads until this time where they really don't like anyone except for each other yeah and then like and also just shout out to the actors Harry Dean Stanton of course has been everything and then Yaphet Kotto who I actually only know from Live and Let Die he was in a Bond movie and so I know him from that so seeing him in this it's cool as well is he the one that always just says okay or whatever har that's say that's that's uh Brett yeah when the two main dudes are down there and Sordi was like I'm going to head down there and they're like why you coming down",
            "start": 2203.04
        },
        {
            "text": "Says okay or whatever, that's say that's uh Brett yeah. When the two Alien movies are down there, and I was like I'm going to head down there, and they're like \"Why you coming down here?\" She better be ready for a piece of my... you know, like God damn everybody's on edge there, they're high-strung, you know scary out there in space. Nobody can hear you scream, you know what I mean? Uh, this is where we are on the very, very loud planet, of course. Also, Ash seems way too excited about this entire thing; he's horny for it, and gets in the seat, you're like he's warming up for it. I'm like, \"Wow,\" uh yeah, you know... uh. Lambert and Dallas make their way through this horrible-looking environment, you know what I mean? Just terrible out there. So pausing here of oh sorry we get let's get to the ship first, but I do love that at one point Lambert is like at every point she's like \"We should not do this, we should turn back,\" and then once they get on the ship she's like...",
            "start": 2238.84
        },
        {
            "text": "Let's get to the ship first, but I do love that at one point Lambert is like \"at every point she's like we should not do this, we should turn back\" and then once they get on the ship, she's like \"we should turn back.\" It's like nobody listened to her, that's why she's pissed. But yeah, they crushed over a hill, and there it is - a giant U-shaped thing that they all go, \"What the **** this is crazy!\" And I could have gone for a little bit more of \"what the **** this is crazy\" because I had to confirm with Jen, who's actually seen all the Alien movies, a few things to make sure I was right. As a novice, at least my knowledge ends... um, I don't want to get it wrong. Well, I mean, all these spaceships look weird to me, god. Yeah, this one looks like a double-sided dildo - what the ****? A lot of phallic imagery here. We should pause here to talk about sort of the person responsible for all that right, which is H.R. Giger, how you pronounce it?",
            "start": 2280.84
        },
        {
            "text": "a lot of phallic imagery here image we should pause here to talk about sort of the the the the person responsible for all of that right which is H.R. Giger is how you pronounce it right so the story goes uh Dan O'Bannon had worked with a guy named Alejandro Jodorowsky when he had the original rights to Dune to make a Dune movie and that movie of course was was there's a documentary on Netflix about it called \"Jodorowsky's Dune\" highly recommend you watch it but in that uh he put together an amazing crew of people one of whom was H.R. Giger another one was a guy named Syd Mead another one all these great designers and production designers shut the **** up super cool right all of them did all this great concept art and then of course that movie fell through and so Ridley kind of took a lot of those people some of them went to like the next Star Wars but a lot of them came over to work on Alien but Giger was definitely like known for this of over like crazy violent sexual phallic",
            "start": 2315.96
        },
        {
            "text": "a lot of those people some of them went to like the next star wars but a lot of them came over to work on this but H.R. Giger was definitely known for his over-the-top, crazy violent, sexual phallic uh so you know imagery so every time you see the alien and it's that organic it's not just organic it's phallic it's glistening it's dripping it's very even as they enter into the ship you see the openings of them which look like a vaginal opening uh you see later that in this one but the face hugger has sort of like a it has a phallus but it has sort of a vagina so a lot of that is used to specifically like a specific intent for this especially as it's meant to sort of assault the men first in this and it's all sort of has that psychological effect on the audience of being an antithesis of harsh tech and then just being hyper-organic, hyper-insulting uh or organic",
            "start": 2358.64
        },
        {
            "text": "effect on the audience of being an antithesis to harsh tech, and then just being like hyper-insulting or organic tech, organic. Yeah, there's definitely a sort of category that it falls into. But yeah, I all that stuff is just so damn cool. I really need to check out that documentary. I remember talking about that on a Kinda Funny podcast a long time ago. It's it's it came out a while ago, I think it came out pre-pandemic, but it's cool because you see all of his like he did the ship design for Baron Harkonnen in and it's like just a face, it's like hitting the Baron's face with like... and then the people would come out of its mouth. So you see some of that like some of that stuff just made it over to here, it's really cool. I definitely recommend checking that out, and then Moebius was the guy who was a graphic novelist and he did all the ship designs basically so you'd see the ship designs",
            "start": 2410.2
        },
        {
            "text": "really cool I definitely recommend checking that out and then Moebius was the who was I think he was a graphic novelist and he did all the the ship designs basically so you'd see the ship designs and those you could see just like all the DNA come into this and it's it's it's **** I designed all these ships yeah yeah look at that right there that's look at that that's so so cool so that's a lot of the concept art that he that's really cool that's some good information Nick I like that thanks uh Dallas Lambert and Kane uh go in and they make their way to the ship and as they get closer we start to lose signal eventually completely losing it back on the ship this doesn't worry Ash it does worry uh Ripley who's like whatever became of that signal he's like **** if I know **** mother's working on it she can't even crack it and she's like well can I go look at it he like knock yourself out right of course this is fishy in the long run uh but she goes down there and starts cracking on it",
            "start": 2452.96
        },
        {
            "text": "on it she can't even crack it and she's like well can I go look at it he's like knock yourself out right of course this is fishy in the long run uh but she goes down there and starts cracking on it just to toss it in here she eventually is able to get through some of it and comes up and is like this doesn't seem like an SOS this seems like a warning and she's like we gotta tell them Communications are down I'm going to put on a suit and go what's the point if it's a warning by the time you get there it'll be too late they'll know we cut back to the ship right I love that every 12 seconds we're getting this message and it's like SOS like **** that's so cool I also I want to give a shout out to the use of video in this as well which is very off-putting and and a great device that will be used later to isolate the audience and to create tension with the audience because you're watching uh the video signals that we're seeing through their cameras uh it's it's not clear right it's hazy",
            "start": 2491.08
        },
        {
            "text": "later to isolate the audience and create tension with the audience because you're watching uh the video signals that we're seeing through their cameras uh it's it's not clear right it's hazy it cuts in and out and when you're watching through their perspective on that that gives you as an audience member a trem builds the tension in you cuz you you don't have control over the sight of what they're seeing right so you'll you'll see that for future spoiler you'll see it later in the Alien franchise as a device as signals are popping in and out to to tell to as a visual storytelling means it's want you want to listen to a cool song just made me think of Alien all the time, a song by CeeLo Green called \"Delirium\" (Trigger), Google that **** chat just like the the lyrics are just sick as **** systems malfunction blasted this Dam machine they're like a parasitic cyst I can't bear to watch it's coming up and out of your chest it's like oh this is so cool um I wanted to um I we have to",
            "start": 2527.96
        },
        {
            "text": "systems malfunction blasted this Dam machine they're like a parasitic cyst I can't bear to watch it's coming up and out of your chest it's like oh this is so cool um I wanted to um I we have to also make it Canon that to to go along with this interview we also have to watch all of Nick's playthrough of Alien: Isolation well it's it's very cool cuz I was I was watching this a sequel right it is a sequel that that happens in between basically I want to say it happens between this movie and Aliens and so it's uh I don't know if you know who the protagonist truly is yeah because it picks up with uh it's have you played Alien: Isolation I mean yeah but I I I know the thing you're dancing around which I don't think you danced around but like it's supposed to be Ripley's daughter right it's Amanda Ripley yeah and she's going to look for her mom who has how old is she the daughter the daughter is like 30 that can't be right then how does that make sense have a 30-year-old because Ripley had her",
            "start": 2573.4
        },
        {
            "text": "She's going to look for her mom who has how old is she, the daughter, the daughter is like 30, that can't be right, then how does that make sense have a 30-year-old because Ripley had her to sleep. You're sleeping my apologies I'm an idiot. The movie is well I don't want to spoil future spoilers how long she's been asleep on this machine a daughter but the thing that I wanted to call out because of this playthrough was Nick was the one who taught me about the Alien: Isolation game, yeah this not there can we get there can we just get there can we just get there sorry sorry sorry sorry sorry. We by the time you'd warn them they'd be dead they would know it was warning we're back to the ship they've infiltrated the ship they are going through it's all biomechanic, they probably actually before this find a gigantic alien there right basically sitting at what to me looks like a telescope but I'm sure it's the controls or whatever and he's dead as hell he's fossilized and they're",
            "start": 2614.92
        },
        {
            "text": "this find a gigantic alien there right basically sitting at what to me looks like a telescope but I'm sure it's the controls or whatever and he's **dead as hell** he's fossilized and they're like oh look at the ho in this chest and he's like wait it's coming outward right so cool everything about the scene is perfect I I love them getting into this giant room and then it's the first time we see an alien in the movie Alien and you're like it's dead and what is this and like what what is he on like terrifying the massive wide shot of just this gigantic Cavern with the tiny little lights repelling down yeah dude that and they stuck on that shot for so long it was so damn cool but the the jockey I still don't quite I don't understand it I've never understood it because I part of me feels like they like tried to recontextualize what the actual thing CU like At first I was like oh that's a dude sitting down but then they made it seem later on that like it opens up and it's a suit and like",
            "start": 2656.4
        },
        {
            "text": "like they tried to redcon what the actual thing was CU like At first I was like oh that's a dude sitting down but then they made it seem later on that like it opens up and it's a suit and like the person is in that casing no spoilers no future spoilers about we get when we get there we'll get there cuz I I don't know what I don't know what how we to see what that means so cool anyways though they do that they continue and then they find a hole that they go down or actually Kane goes down a small piece of it might ruin this scene for you cuz it kind of does for me but I'll tell you anyway a small piece of trivia is that he in order to get a better sense of scale uh Ridley Scott put his kids in the suits so as they're climbing up you see them walking around you can actually see they're smaller if you look closely so that the statue itself looks like a foot taller that's it's pretty fun awesome also the suits were not um properly ventilated so everyone kept passing out cuz this",
            "start": 2697.56
        },
        {
            "text": "smaller if you look closely so that the statue itself looks like a foot taller than it's pretty fun awesome also the suits were not um properly ventilated so everyone kept passing out cuz this is back in the 70s they didn't have LEDs they had hotlights so people all the actors were like we lost another one you see every single I mean I I also watch this in 4k so it's way less forgiving but like God walking then walking in and the CO2 blasters that we have shooting up smoke I'm just like okay Alien Planet uh anyways uh Kane repels right there that's funny you can see it so funny you it wouldn't you wouldn't clock it but now you kind of see the proportions are a little bit like that uh can repel is down uh he's walking he looks he sees just little facehugger eggs everywhere uh and makes a comment yes that there's a light field there that's like a security system which is cool cuz as he crests it you hear that e like as he gets farther into it it is like an organic alarm system",
            "start": 2734.4
        },
        {
            "text": "makes a comment yes that there's a light field there that's like a security system which is cool cuz as he crests it you hear that e like as he gets farther into it it is like an organic alarm system basically for these things to come alive this whole thing is so sick as he like repels down and like the shot of him coming down and just it's hard to understand exactly like what he's in and then you get that wide shot and you're like wow that that long Cavern thing he's in is just one of hundreds of these things and you like see them go down and I love the smoke and I love the blue light and all the eggs underne like everything about this room I'm like this might be the coolest room in the the here's a question I have for you three fine gentlemen I've worked alongside of you for many years at what point during this process would you three have turned around so much sooner I don't understand would have been the big guy in the chair I'd have like NOP killed him still alive this is not a",
            "start": 2780.16
        },
        {
            "text": "at what point during this process would you three have turned around so much sooner I don't understand would have been the big guy in the chair I'd have like NO killed him still alive this is not a distress signal we don't need to worry about also take a picture get back I didn't love the way the dude got down there it like he was like oh I what happened he slips his he slips and then slides on down it looked like he was trying to trick us yeah right he can't he like oh I slip and was like H it looks like you wanted to get down he didn't I sure you he didn't want to do that he gets down there though and goes investigate an egg right and what does he find he sees it movements there oh my gosh something's happening shines the light in and you can see he's like it's there's an organic movement in here so cool there's a also just just to note there's a translucency to the to the aliens and to the eggs in this that I think I don't think they ended up doing later I think they ended up sort",
            "start": 2819.6
        },
        {
            "text": "in here so cool there's a also just just to note there's a translucency to the to the aliens and to the eggs in this that I think I don't think they ended up doing later I think they ended up sort of like making the alien a little darker but there are shots in this where you can see through um the alien's like skull and you can or like it's its face skin and you can see the skull on the inside of it with like the eyes it's it's really cool so sick yeah seeing through the egg it's like that is moment number 10 of like turn the **** around don't try to pry the thing yeah then he goes in like works on the egg I'm like **** off dude what are you doing dude of course though the egg does open peel back it's all membrane in there right just disgusting and then we cut uh what we cut too of course uh Dallas and Brett dragging Kane's ass back to the ship or whatever right breaking loose another moment of Tim mentioning that nobody's scared enough yeah because to me in these shots I'm like oh",
            "start": 2862.12
        },
        {
            "text": "uh Dallas and Bear dragging Kane's ass back to the ship or whatever right breaking loose another moment of Tim mentioning that nobody's scared enough yeah because to me in these shots I'm like oh they didn't know he got got they're just walking back to the **** yeah so look at that I was I was expecting them to be like Dallas where's **** Kane what's his name Kane where's Kane at like Oh I thought he came back they're dragging I I need more I need them dragging like open the goddamn thing he's got a **** thing on his face like my mind is your mind yes what movie of a similar ilk am I going to to talk about that kind of tension that kind of scaredness it's it's tough because the movie I'm thinking of you haven't seen unfortunately really well I'm going to The Abyss, oh and Harry dragging his ex-wife right screaming as and use the wide shot where you can see how far he is is he trying to go you just would have thought this guy got a concussion and they're like he he got hit going be",
            "start": 2904.32
        },
        {
            "text": "his ex-wife right screaming as and use the wide shot where you can see how far he is is he trying to go you just would have thought this guy got a concussion and they're like he he got hit going be okay though yeah there's like no yelling there's no especially too for like a team that they aren't like they aren't the Colonial Marines they weren't sent out on a mission to do this like I would understand more if you're like all right guys suit up the objective is to infiltrate do this thing get this there's risks you know we're a bunch of *** what are they miners or scientists they're basically minor yeah be like oil drillers I guess the closest thing and I don't quite have the the the answer for this is I don't think that it's really been established in this universe that extraterrestrial life like exist that was a question I had so I don't know so if it had if there was like oh we sort of know that other species exist that makes sense that they're not as freaked",
            "start": 2950.0
        },
        {
            "text": "that extraterrestrial life like exist that was a question I had so I don't know so if it had if there was like oh we sort of know that other species exist that makes sense that they're not as freaked out by this but I think he's like I think Ash is like there nothing else is ever I'm pretty sure I think it's yeah Ash when he has the face hugger up in the can't kill this thing he says it's the first yeah Alien but he does say alien whatever extraterrestrial something he he references that this is a breakthrough the only and when that first distress signal goes out there is a question like is it human like they have a question that made me feel oh they're aware of that there are extraterrestrials but maybe they just haven't read I thought I read it more as a question of our boys are flying back from Mars right now and get a thing and it's like no one else is out here what the would that be you know I mean that kind of thing doesn't anyways we get the trio really two",
            "start": 2990.08
        },
        {
            "text": "flying back from Mars right now and getting a thing, and it's like no one else is out here - what would that be? You know, I mean, that kind of thing doesn't happen anyways. We get the trio really, two and the one guy getting carried, come to the door, pound on the door, hit the button, let us in, of course. Ripley, uh, she's third in command; she's the only person on the deck. She says I can't - you know, that's protocol. This is we got to get into uh quarantine and they say \"quarantine\" let us in. They argue for a while before Ash, of course, just hits the button and lets them in. Stupid ass; well, he's you know, he's a robot just doing his thing. What was that? What was that? Oh, that's the entry into the yeah, that's very very much like a bu um, you know. They bring him in uh there's this whole hu uh they get him into we jump from this whole thing though to him in the uh medical Bay right and it is Ash cutting off like we get the shot to see the face hugger not only grabbed you know smashed through",
            "start": 3032.08
        },
        {
            "text": "get him into we jump from this whole thing though to him in the uh medical Bay right and it is Ash cutting off like we get the shot to see the face hugger not only grabbed you know smashed through the glass got in there and wrapped on his face the neck wrap yeah was first such a visual man the sort of the sort of cesarian section like imagery of them cutting through the mask and then popping it off and going oh geez they all react finally get to see it they couldn't see what it was before just crazy and their little cool laser light like scalpel is sweet of course everybody you know who isn't involved in this is watching from the other side of the glass on the Outside Inside we got Dallas and Ash working on Kane they do that and then it is this experiment of like okay well let's try to get it off and they try to peel you know grab the with the forceps grab the finger and it's a Titan AR okay it's going to kill him if we do that what do we do put him into the C the tail",
            "start": 3075.04
        },
        {
            "text": "try to get it off and they try to peel you know grab with the forceps grab the finger and it's Titan AR okay it's going to kill him if we do that what do we do put him into the C the tail that's what you do and one of the fingers go to the start at the base of the tail like all right base of the tail H and he's got but then the acid would have gone through his throat but who don't know they don't know that yet yeah they don't know that you're right they put him in the CT scanner they get some stuff I'm sure maybe even in here if you're looking closely it's there you know more about trivia but I would assume Ash is looking at it and realizes oh it's putting **** inside him or **** there's a moment where they're like something yeah something's gone down it's breathing for him they just they just ash says that and I wonder if he knows probably yeah yeah they pop him back out and then it's like uh you know Dallas is like we got to get it off we got to kill him I'll make the",
            "start": 3119.72
        },
        {
            "text": "they just ash says that and i wonder if he knows probably yeah yeah they pop him back out and then its like uh you know dallas is like we got to get it off we got to kill him ill make the call its my call whatever i like they get this moment where theyre like what do we do lets cut it off and then they have to they have this little line of dialogue where hes like what do we start he goes right just right here like right at the like right below the knuckle like theyre just having this analytical decision of like where does it make sense to cut this thing off so you can pull it off cool ash takes his little razor uh cuts the knuckle acid blood shoots out falls down come on dude this is the coolest thing ever ive totally forgot about this it coming out and boiling through the entire ship like runs out its burning through the could through the hole they all run they all start looking down there trying to figure out where its going theyre getting there its going down",
            "start": 3152.88
        },
        {
            "text": "entire ship like runs out it's burning through the cloud through the hole they all run they all start looking down there trying to figure out where it's going they're getting there it's going down going down going down were they alluding to like this sort of alien controlling the viscosity of the air no cuz they made I got like a hint from them that like like oh it stopped it stopped like doing the burning now it's like what it I don't know I got the vibe that I think it just I think it was done enough that it went through too far and that where it would stop yeah they've never had just great moment where he takes Brett's pen uses it and then gives it back to him br br just looks at it yeah I love that uh so yeah they're at kind of a stand still here right of course they have this done what are they going to do with it uh well cool effect that's a practical effect right yeah of course that's cool and so the decision is to let it ride right they got to figure out what to do but they got",
            "start": 3190.08
        },
        {
            "text": "are they going to do with it uh well cool effect that's a practical effect right yeah of course that's cool and so the decision is to let it ride right they got to figure out what to do but they got nothing they can do right now uh so the decision is made to let that happen uh Ripley then confronts Ash on of course the fact of like hey by the way how's it going oh it's going well yeah like and Ash completely trying not to engage in the conversation but her eventually like you **** us over right like you know doesn't seem great for a science officer to not follow the scientific team protocol uh after this conversation uh she confronts Dallas of like how much do you know about him Dallas is like it is weird you know we were getting ready to what was it two days or something till the sh and they replace our science officer with this guy but he's here and he's us and that's what it's got to be blah blah blah this is again where we get that line where he's like he's like why didn't you",
            "start": 3231.8
        },
        {
            "text": "they replace our science officer with this guy but he's here and he's us and that's what it's got to be blah blah blah this is again where we get that line where he's like he's like why didn't you push back he goes rep place the corporation like what are you going to do whatever the **** they tell us to do I'm sure there's some superfluous stuff here that I'm going to miss but this is a is a plot that moves at a pretty quick pace when you're recapping it right so the next big thing would be of course that everybody applauds for Greg he's doing really good thank you everybody thank you everybody good stuff uh the next big plot point here outside of the confrontation we've had there right is of course hey to Dallas who I think's back down talking to Mother asking a bunch of questions and I was like don't have enough information don't have enough information Andy Cortez you know what I was really kind of impressed by because I've we've seen a lot of",
            "start": 3269.56
        },
        {
            "text": "of questions and I was like \"don't have enough information\" don't have enough information don't have information Andy Cortez you know what I was really kind of impressed by because I've we've seen a lot of these older movies and whenever there's any sort of Motion Graphics it looks like the oldest technology probably sure they redid those this looks so redone I think they redid that yeah I I could have sworn cuz this does not look like something that was made back in the day yeah I we'd have to to look that up and maybe Kevin can look at that but I'm pretty sure it was just like the standard typing back in the day with the cool sound effect and now it's got that motion blur sorry what what uh look up Mother Mother Motion Graphics UI was it redone because as Mother's typing across the screen it looks like something that's like very sleepy made like 10 years ago or something yeah I don't I don't I I'm pretty sure they redid that we get multiple calls I'm I'm going to put Dallas in talking to Mother",
            "start": 3303.8
        },
        {
            "text": "something that's like very sleepy made like 10 years ago or something yeah I don't I don't I I'm pretty sure they redid that we get multiple calls I'm I'm going to put Dallas in talking to Mother both times the first call of course is you should come up here look at this and what do they find Kane with nothing on his face still asleep but the face hugger has moved on then of course they have uh the moment of well **** we got to find this goddamn thing right let's get the whole group in here and bumble around a little bit so they have just the three of them all right yeah Hey where's they leave the door open for so long they leave the door open they go in with like put the **** suits on get in there like I I was so annoyed this the fact that it has acid blood it's like probably has other **** it also was cut open so maybe it's going to bleed more and it's like it ended up being above them like that's just the worst scenario to be yeah I I love this scene cuz they're like cautious",
            "start": 3343.0
        },
        {
            "text": "it also was cut open so maybe it's going to bleed more and it's like it ended up being above them like that's just the worst scenario to be yeah I I love this scene cuz they're like cautious for a second but they're kind of bumbling and they're not they're not thinking clearly and then it's at one point you all of us had the same thought close the door and then Ash goes oh sh and walks over and closes the door and and then it's just this see is like the scariest scene cuz they look at like is it up there no I looked up and then it come and then you see the tail pop down first well so what happens she just trips on something or something happens where Dall knocks something over like you guys yeah this is a great Point too uh just as we're calling this out to pull this over and put a quick stop on it everyone watched the movie Life with Ryan Reynolds did you watch this I remember that yeah I sat on that Forever Until I watched it and I did a Greg Miller",
            "start": 3383.84
        },
        {
            "text": "this over and put a quick stop on it everyone watched the movie Life with Ryan Reynolds did you watch this I remember that yeah I **** sat on that Forever Until I watched it and I did a GameOverGreggy about how much I watched it but I loved it but underground no no this is where they're in a space station and they find they find an alien and they're like a a little microscopic alien in their Mar stuff **** little Venom kind of Al where you going sit down two seconds we're about to get to a bit I can't you can't leave we're too close to get away from the bit now so we can't not to do the bit with you I couldn't find anything on the mother thing thank you we appreciate that Tim I can make it fast I'm sorry they bumble around they do the thing as we said they finally found it uh for no reason it really seems like the face hugger's tail finally drops on Ripley she screams it comes down she throws it away they come over it's dead oh my God this is the organism right this leads to of course uh",
            "start": 3423.84
        },
        {
            "text": "really seems like the Facehugger's tail finally drops on Ripley, she screams, it comes down, she throws it away, they come over, it's dead. Oh my God, this is the organism right? This leads to of course uh you know Ash laying them out and poking around and being all gross with him right, it's so wet, it's so wet and disgusting KY Jelly. However, the death of this Facehugger of course leads us to our brand new segment for In Review, Andy hit the song what is just go just give me just go perfect, just face huggers face hug them or face **** them. This is a new segment in review where we talk about face huggers and we say I want to hug that Facehugger cuz it was so good or **** that hate Facehugger it was so stupid. Is this a face hug them or a face **** him everybody okay, so **** him as in **** off not yeah not **** him the face I'm sorry it's already inseminated someone else so I could put my penis in it no no what no we're just do we like it or not like the Facehugger in Aliens I love",
            "start": 3459.76
        },
        {
            "text": "off not yeah not **** him the face I'm sorry it's already inseminated someone else so I could put my penis in it no no what no we're just do we like it or not like the face hugger in Alien I love the face hug this is a face hug them for sure I mean this thing I think the face hugger is arguably as scary as the Xenomorph itself that thing is terrifying yeah like just like the thought of it like back to you can go to the bathroom now if you want to okay cool cool yeah just need your re did face **** him you know you're face hugging though right your team face hugging yeah no I think the Alien the Xenomorph obviously horrific the second mouth everything else right is terrifying there and this goes back to what you were talking about what the chat was talking about of like the phallic and being very sexually charged like the violation of the face hugger the fact that it jumps on shoves its dick down your throat then leaves a baby inside you that's going to kill you like",
            "start": 3509.44
        },
        {
            "text": "phallic and being very sexually charged like the violation of the face hugger, the fact that it jumps on shoves its dick down your throat then leaves a baby inside you that's going to kill you, like that there's like right there. I did a bunch of Gregisms to talk about something that is like so such a violation and so terrifying and gross and disgusting and like such a **** and I specifically like that you know in a movie like this where and you can you can start peeling back layers and maybe I'm reading too much into this, but me like this where it's a female heroin right a female hero a female protagonist Ripley is the main character for the most part of this movie even though it was an ensemble cast the first one the first person to get violated like this being a man yeah makes so it makes it so much you know there there's a dynamic there that's worth exploring and that that I think really works for the movie yeah just super creepy and I can't wait to talk about future iterations as we",
            "start": 3552.64
        },
        {
            "text": "it so much you know there there's a dynamic there that's worth exploring and that that I think really works for the movie yeah just super creepy and I can't wait to talk about future iterations as we get into our segment here face hug them or face **** them but it seems like this is a universal hug them right Andy this is a universal hug yeah I again you're so right with the just the disgusting nature of it and it being first off crashing through whatever the helmet however got through that helmet is terrifying enough the strength this thing must had it's to quote Tenacious D right it's a **** push-up right it just like pops so hard through the glass and it comes on in push up I I didn't think of that no how many can you do just one three just one I guess I guess you can only do one Tenacious D what a great B that's the uh that's the end of the segment Greg yeah so uh hit us with the theme song One More Time hold on hit us with the theme song One More Time hold on have to be him",
            "start": 3598.68
        },
        {
            "text": "Tenacious D, what a great B, that's the uh, that's the end of the segment. Greg, yeah, so uh hit us with the theme song One More Time hold on, hit us with the theme song One More Time hold on. Have to be him **** it's not working, it's fine, we'll have it next time but it was just remember it was uh face huggers do we face **** them, face hug them, that's pretty much it. You got it, don't worry about it, we'll get there next time, we don't have to worry about it. Uh back to your plot recap so now they have it, they have it laid out, they're investigating it. Do again this is again Dallas go **** off again to go talk to Mother about whatever that sounds like a fart sounds like a baseline FY fart. Um now I have it now I have it okay face **** them, face **** him, face face hug, face **** him, face huggers, that's that's what it is. It's supposed to be like hold on yeah okay I got it yeah yeah I got it I got it got it okay uh they have him down Dallas **** off for a little bit now there another call.",
            "start": 3640.56
        },
        {
            "text": "that's that's what it is it's supposed to be like hold on yeah okay I got it yeah yeah I got it I got it got it okay uh they have him down Dallas off for a little bit now there another call you got to get up here okay why and he's like it's best if you just see it maybe I'm confusing it but then he does the other one where Dallas is so he gets this call from the science officer and just goes oh yeah is it bad it's like it's interesting or whatever and then he just sits there for a second and then he calls Ripley's like meet me in the thing and he actually sounds like there's immediate action needed for Ripley but I feel like Ripley's going to beat him there like you know what I mean it's like me telling Tim meet me in the conference room for then I go get his coffee first like it's I don't know but they get there and what do they find of course Kane is up Kane is awake Kane is alive right uh he had a dream about suffocating but that's about it he doesn't remember everything right",
            "start": 3690.08
        },
        {
            "text": "don't know but they get there and what do they find of course Kane is up Kane is awake Kane is alive right uh he had a dream about suffocating but that's about it he doesn't remember everything right he's smothered yeah smothered that was it thank you very much uh and so great Kane's alive fantastic we got the thing oh yeah I guess we I skipped it right we already taken off at this point Didn't we where uh there was a check-in with Dallas and yeah they're back up there like it's going to be 10 months yeah yeah yeah but more importantly the well not more importantly I apologize but just the conversation I was hung up on was when they're in the hallway and she's stopping the she's stopping him from a whole conversation about science offer and he's like all right well let me know or what's going on with Parker and Brett and she's like oh they're almost done done how close like we can **** take off with that let's go and so they they force the ship up and they get up there and uh yeah",
            "start": 3732.92
        },
        {
            "text": "going on with Parker and Brett and she's like oh they're almost done, done how close, like we can take off with that, let's go, and so they they force the ship up and they get up there and uh yeah 10 months back to Earth uh they of course give all this information to Kane uh he just wants to have some grub before they put him back to sleep because they're going to go back to sleep and go back to Earth and everything's going to be hunky dory, they did the goddamn thing right uh so they all sit there and they start having their little food uh you know uh the Ash is drinking milk it's all those drinks you know what I mean seen mhm uh and everybody's having a good time talking and being stupid right and then Kane starts choking on his grub he's like what do you mean and the Parker like what do you mean the food's not that bad right and they roll him over and then of course don't let him choke on his tongue this is an outdated thing about seizures everybody don't worry",
            "start": 3773.08
        },
        {
            "text": "the park like what do you mean the food's not that bad right and they roll him over and then of course don't let him choke on his tongue this is an outdated thing about seizures everybody don't worry about it you're not going to choke on your tongue uh but they he's they think he's having a seizure yeah I think it actually more people get hurt by people trying to stop them from I think you could bu I you're not supposed to put anything in a person's mouth chat let me know if that's also true but I remember that being a thing interesting spon yeah you're not supposed to do that anymore Parker stop you're making the situation worse but it's a whole other thing anyways uh the first Blood splurt they all kind of look at it like yeah cuz I I I don't I don't think I've ever seen this scene in its entirety I've just ever seen I've seen the chest burst and then I've seen the the space balls you know red I had no idea that was just an initial like Poo of blood that was crazy was that John Hurt in",
            "start": 3809.64
        },
        {
            "text": "entirety I've just ever seen I've seen the chest burst and then I've seen the the Spaceballs you know red I had no idea that was just an initial like pool of blood that was crazy was that John Hurt in that in Spaceballs as well was he the person that I I think it was yeah yeah he might even say not again I think when it happens to him right yeah that's a good reference good PRL I forgot about that part well we have to put Spaceballs in this now we do it's a we also have to go and watch CW for Ghostbusters In Review but somebody doesn't want the content to be good likely says uh the scene's so good because none of the actors knew that the blood squirt was going to happen so they were genuinely surprised that's cool **** and they also like let go for it like what the like what the **** F just happened this scene's scary obviously Caesar scary always chest bursting scary this guy scary the dick coming out all that but when he runs away it's the silliest thing the best thing ever man I",
            "start": 3846.8
        },
        {
            "text": "just happened this scene's scary obviously Alien scary always chest bursting scary this guy scary the head coming out all that but when he runs away it's the silliest thing the best thing ever man I this form of him my favorite so far the I don't need a whole song for it and all that stuff but I just want to let everybody know the weird little Alien like that's in the mouth doing his little run best thing so far when he um it's it's silly this this comes off as sort of silly and unfortunately kind of doesn't ruin the scene for me but it's a little silly he pops out and they're like what the **** is that he goes and then and then like kind of runs off it's the silliest thing ever very similar sound to uh Mystique Mystique oh I'm on the Epilepsy Foundation uh FAQ myth and facts uh myth you should put a spoon wallet or another object in a person's mouth during a seizure fact never put anything in a person's mouth during a seizure doing so can cause injury to the teeth or gums a person",
            "start": 3890.2
        },
        {
            "text": "should put a spoon wallet or another object in a person's mouth during a seizure fact never put anything in a person's mouth during a seizure doing so can cause injury to the teeth or gums a person cannot swallow his own his or her own tongue during a seizure wow don't do it everybody don't do it uh Alien runs off and everybody's like what the **** did we just see dude come on Kane's dead and he's not even Kane from wrestling and now this thing just shot off and it was disgusting and if I'm **** Ripley I'm like I **** told you people you know I mean I **** **** told you people not to do this um however as we've stated before everybody's pretty cool everybody's pretty chill about the whole thing you know it sucks right they fire kan's body off into space yeah any last words nah leave him like literally when that happened I was like joking to you they're just going to dump him in space now and they just dump him in space I'm really it's an interesting thing it's it's very much",
            "start": 3943.04
        },
        {
            "text": "him like literally when that happened I was like joking to you they're just going to dump him in space now and they just dump him in space I'm really it's an interesting thing it's it's very much like the differences between IGN and Kinda Funny, Kinda Funny we're all friends here you know what I mean we love each other we're a family right right over there Rebecca Valentine bites the big one parachuting around to space never saying the goddamn word he didn't even know her probably doesn't even know her last name no idea I uh um we that was a rare good deadp from all of us talking about the death of one of our friends what our other friend doesn't matter yeah um I imagine PA just like just shoving her out of that third floor window that we used to working we can't get into Space Marine I'm I'm so glad I'm so glad that Ash ends up being a traitorous robot because when he tells Parker not to attack it yeah I was like just **** man quit being an idiot what are you doing so now I'm so",
            "start": 3986.92
        },
        {
            "text": "I'm so glad I'm so glad that Ellen Ripley ends up being a traitorous robot because when she tells Parker not to attack it, yeah I was like just quit being an idiot man, what are you doing? So now I'm so I'm so happy that we know why Obi-Wan Kenobi makes course spoilers of course. You know, Ripley eventually goes down there and gets to see the Order, and the Order of course is expendable - it's like you didn't have to put that there, dude. That he did was pretty dope though, pretty dope. He was super pissed uh before all that though, there's a shipwide search for this little guy, you know what I mean? What are we going to do with this snake hybrid guy? We got to find him; he's got metal teeth - that's crazy, is it metal teeth? I think just shiny, they're just kind of shiny. That song yeah uh anyways though so they all break into teams right uh we send uh Brett Parker and Ripley, that's the first team right yeah of",
            "start": 4027.08
        },
        {
            "text": "just shiny I they're just kind of shiny that song yeah uh anyways though so they all they break into teams right uh we send uh uh uh Brett Parker and and Ripley that's the first team right yeah of course and they've got the net and then they've got the little uh they got the little gun thing yeah which I the tracking device they have a track they have a little wishy-washy on the science for me on that one I'm just like no it's a motion tracker we know motion trackers are a thing later so we did there much better yeah that's the thing I was surprised by I thought I was like oh here here's the moment where we see the thing that I saw Nick using an Alien: Isolation and it looks nothing like it again you know stick around stick around there explanations I also just I I know that it's fine but just being a net I thought was funny well",
            "start": 4075.56
        },
        {
            "text": "alien isolation and it looks nothing like it again you know stick around stick around there explanations I also just I I know that it's fine but just being a net I thought was funny well big it's like what are you going to do the cat could squeeze through that Ripley takes it to Kane's body and it's like it's it's going to get through guys it's going to get through but I do love I do love that they're cognizant of the fact that they can't stab this **** thing right they can't shoot it they can't stab it so they got to light it on fire or they got to catch it and suck it up the or else it could it could destroy them all uh so yeah they go through with their little tracking device a little motion tracker trying to find them trying to do the things uh eventually they think they got him it's over there in the locker d d big reveal it's **** Jonesy Jonesy you the Kramer clap as he walks in uh he they catch Jonesy but Brett lets him go uh obviously Parker well they're about to",
            "start": 4120.64
        },
        {
            "text": "him it's over there in the locker room big reveal it's Jonesy Jonesy you're the Kramer clap as he walks in uh they catch Jonesy but Brett lets him go uh obviously Parker well they're about to shoot him and he goes and they're like why did you let him go he goes the cat it's the cat it's the cat guys they're on such high tension that they just saw something run and they thought it was the alien yeah and Brett's stealing that's like God it's the **** cat like don't kill the cat so then they're like you idiot now we know if we get another **** molecular spike on it could be him yeah so you gotta go get him so Brett sends walks all by himself dude just what do we do ship thing of all time I I I think this might be the best choice that they possibly made in this because I have no **** idea what this thing is that he goes into what this room is Wheels what is it I have to imagine equipment storage but it's but it's like there's condensation well that's my moisture that's a",
            "start": 4158.72
        },
        {
            "text": "\"I have no idea what this thing is, that he goes into, what this room is. Wheels, what is it? I have to imagine equipment storage, but it's... but it's like there's condensation. Well, that's my moisture, that's a different thing. I said this to Jen too - where I'm like, nothing like sitting under the random condensation of a spaceship, you know what I mean? That water's not clean, that's got to smell terrible. There's a lot of rust in there too, so you have to imagine it's rusty. But I like that they don't call attention to it, make reference to... oh, he's in the condensation room. What he just goes into this room and it's creepy as ****, and part of it's just leaking. It's a chamber room, says M CH - there's change, like the sound design here is so good. I loved it. And also, like this is one of those weird things where watching the movie more than once... type things, but knowing what the aliens are eventually going to look like, we haven't seen it yet in the movie, but I know - little skin here. Uh, yeah. The skin, honestly Greg, I had a thought of\"",
            "start": 4202.72
        },
        {
            "text": "than once type things but knowing what the aliens are eventually going to look like we haven't seen it yet in the movie but I know little skin here uh yeah the skin honestly Greg I I had a thought of like is this why Greg exact there yet it was it wasn't there yet it wasn't in my mind yet well we I know what the big alien looks like and the the Shadows that we see from the chains kind of like swinging back and forth on the walls kind of looks like the alien and I'm like oh this is so freaking cool um so it's some nice little foreshadowing but without knowing there right what's up you can see it here yeah yeah he is there in that scene oh I didn't real I never caught that exactly we had seen it yet yeah oh **** I didn't know that blends in with the environment that's cool I got to go back so anyways yeah you know brick goes around then Jones's on a tank Jonesy jumps down Jonesy runs over go finally he gets up to close to get Jonesy and then Jones we see from our perspective from",
            "start": 4247.04
        },
        {
            "text": "Back, so anyways, yeah, you know Brick goes around, then Jones's on a tank. Jonesy jumps down; Jonesy runs over to go finally get up close to get Jonesy and then Jones. We see from our perspective, from Jonesy's perspective, the alien dropped down behind Brett. Uh, Jonesy hisses; Brett turns around; Brett gets iced. But even before that, we get this: him walking; Jones runs through the door; we get the tracking shot where like there's just a small opening in the door and it's just like as an audience member, we're with him not knowing what's behind it... so cool hearing the chains and like the water dropping and all that stuff is powerful. This is where Parker sees uh Brett get pulled up. Oh, I guess that is true; sorry, I misspoke 'cause I maybe took my far away but it's getting pulled up that's right. So there is a reason why he had seen him. Uh, then we jumped to the you know everyone circled up getting this information: Dallas of course is like okay cool he pulled him up into the air.",
            "start": 4292.4
        },
        {
            "text": "Right, so there's a reason why he'd seen him, uh. Then we jumped to the you know everyone circled up getting this information Dallas of course is like okay cool, he pulled him up into the air. Ducks, he's using the air duck. Do we get the mouths in this? The two mouths, yeah, yeah. I think like the first time see like the iconic Predator Grill and the thing comes out, you know, sick. See like for whatever reason when I watched it though Nick, I I don't recall seeing Parker see him get killed. I don't recall that either, yeah, but maybe I'm wrong, I don't know. But there was a moment the next scene he goes \"that thing was\" and I don't remember him seeing Parker get pulled up. I'm with you, yeah, I'm with you. Yeah, I I don't think I saw it last night. Thank God I was still paying for Peacock by the way, I forgot I had that. I mean they're not making awesome so what are you going to do? You've been paying it for uh been paying for it since I think the",
            "start": 4335.96
        },
        {
            "text": "thank God I was still paying for Peacock by the way I forgot I had that I mean they're not making awesome so what are you going to do you been paying it for uh been paying for it since I think the Olympics oh wow yeah you had a show in there for a lot longer than that Raiders oh yeah damn damn I don't have that that subscription it's a different one I for no it's right look at the tab WWE is right there yeah it's right there andy yeah you could get anytime you want to they're still good they don't expire you can go watch them ah anytime you want to it's using the air shafts to get around yeah rocket money it what a dope ass lie why are we making airshafts this big we haven't learned I time huge in this thing uh hug yeah I guess have you seen the air shafts in any other building they're like this big so I I know that this is part of the whole thing there aliens and stuff and there's future movies so maybe they explain it but like I am very interested in how quickly little guy turns",
            "start": 4386.36
        },
        {
            "text": "like this big so I I know that this is part of the whole thing there aliens and stuff and there's future movies so maybe they explain it but like I am very interested in how quickly little guy turns into big guy yeah I know right you insane growth yeah um it's it's one of we're watching it right there's the double Mouse you got me punched right okay so I see so we see as an audience the Xenomorph cut right here and then we I'm saying Parker says he saw it he saw it but maybe again maybe you know he ran around the corner right as they cut you know yeah maybe you know how the alien was hidden in the on he was in the reflection he was in the reflection of Jonesy's eye I uh or Jonesy reports back we don't know if cats can talk in this universe I I I like the shot of Jonesy by the way with the light on it and you see symbol of shots like that in Blade Runner which was another Ridley Scott film like the light kind of coming off of their eyes and making them look kind of weird so cool cool um",
            "start": 4431.44
        },
        {
            "text": "light on it and you see symbol of shots like that in Blade Runner, which was another Ridley Scott film, like the light kind of coming off of their eyes and making them look kind of weird so cool cool um anyways we then have like I said Circle up he's using the air shafts all right we're going to get him there the plan is to systematically shut down the air shafts uh Corner him in the one room in the air lock blow the air lock we don't have to worry about this little Spud no more great plan everybody uh we need people to go up in the air duct and do all this different stuff we got flamethrowers this will be fun so it's I love it because he goes do we have any weapons and he's like I think they have some line where he's like can you make a makeshift a lot too he's like yeah no problem like makes this thing it's cool and the comfort at which they walk around with these flamethrowers the lit flame on the side of it I could never do it it's when Dallas is crawling through this claustrophobic",
            "start": 4484.84
        },
        {
            "text": "this thing it's cool and the Alien at which they walk around with these flamethrowers the lit flame on the side of it I could never do it it's when Dallas is crawling through this claustrophobic air vent and the flame is just hitting like on the side of it and I'm like that's going to light you on fire bro Also let's talk for a second is there anyone in this movie that's not going to eventually like maybe a year later die from lung cancer they're all smoking so many cigarettes that's how it was man that's how we did it Tom Skerritt's teeth were this like literally the shade of Andy's crew neck right now but if if I lived in space I would definitely start smoking you know okay be a bounty hunter it reminds me do you remember Thank You for Smoking when uh he's he's trying to get a cigarette inserted into the movie and Stanley I think it was Stanley Tucci was is talking about how he's like we'll sell to marrow and Aaron Eckhart goes isn't there like",
            "start": 4525.6
        },
        {
            "text": "inserted into the movie and Sigourney Weaver, I think it was Sigourney to she was like \"oh no\" it was Ridley Scott who was talking about how he's like \"we'll get to the marrow\" and Aaron Sorkin goes \"isn't there like uh isn't it not a good idea to light a flame inside of an highly oxygenated space station?\" She goes \"we'll write a line that just writes it out\" we got the technology that can do that in the future, uh anyways, uh Dallas, uh Captain decides to go out with his flamethrower and do all this and he says \"I'll go first right\" and Dallas no I'll go yeah yeah he's well he's a good Captain you know what I mean similar to me would you go opposite of Tim I would do everything for you guys you know sense for me and and would be the Android sending us out there to die I like Dallas dying here I think that was like a very good you know the subverting expectations of the team and all that stuff him being the leader the hero looking guy like like 1979 what up yeah uh so yeah he walks through with the",
            "start": 4565.48
        },
        {
            "text": "was like a very good, you know, the subverting expectations of the team and all that stuff; him being the leader, the hero-looking guy, like 1979 what up, yeah, uh, so yeah he walks through with the thing they've got the Lambert; this is where Lambert turns the corner I think to Annoying Town, uh, she's got the little uh tracking device, she can see it, oh he's coming right at you and then of course he just goes quiet, I I wonder and I've never seen like the like I don't know that I've ever watched the three-hour cut if it even exists but I wonder if there was more to their relationship because this is the cracking point where I I started feeling like she liked him or they had a relationship and she was freaking out because he was about to die and this kind of like sets her off, well again it's Captain you know what I mean; he's he's the leader die in the air vent Mike's going to lose it Mike's not going oh Michael yeah Michaeel never come back um and so yeah there's this whole like where is it",
            "start": 4603.52
        },
        {
            "text": "you know what I mean he's he's the leader die in the air vent Mike's going to lose it Mike's not going oh Michael yeah michaeel never come back um and so yeah there's this whole like where is it what is it going on and the dots on top of you you should see it I don't see anything and then finally the which is which again I is still scary and off puding but it's just funny of like in all the things we've seen and all aliens goes hey I'm here and I got him I think because it's not the scene but I I think because when we close enough like the close enough the Predator is clearly dude in a suit but it has those proportions it has bipedal without like but he feels like a dude period but the alien yeah the alien in this circumstance just looks like a dude with the alien head head on with like normal human anytime that it's like he looks like an alien majority of the time but there's a couple times you're a dude in the suit they were very cognizant of that as well that's why if you I think",
            "start": 4642.24
        },
        {
            "text": "normal human anytime that it's like he looks like an alien majority of the time but there's a couple times you're a dude in the suit they were very cognizant of that as well that's why if you I think the total screen time for the Alien in this movie is like 3 minutes makes sense cuz he knew he was like and everything for the most part is done in closeups this is one of those unfortunate like signs of times of the editing where if they had shaved off like four frames of this it would have been terrifying but it's just that he goes like this and holds for just one second too long that it kind of ruins the suspense yeah that is the actor that plays uh this is when they go over there they find the the flamethrower there's no blood right yeah cuz he's taken and of course not to get into uh uh director's cut territory but originally they didn't have the concept of of how the Alien reproduced and how the eggs were made and so originally there there is a cut where they find Tom Skerritt",
            "start": 4691.28
        },
        {
            "text": "director's cut territory but originally they didn't have the concept of how the alien reproduced and how the eggs were made and so originally there there is a cut where they find Tom Skerritt and he's like cocooned and becoming an egg oh like I think that was what they I think the original concept was that the alien itself could like take you and then molecularly like reform you into the egg and then you you'd create a face hugger and that of course later would evolve into something else very interesting okay uh however they decide oh there had been a conversation by the way before then this will be important of we should get the emergency shuttles and just get the **** out of here and the idea was we're in the middle of nowhere no one's is going to find us kind of thing like we're well she says the life the the the shuttle can't sustain three people I think it only has one cryopod oh there you go there it is right there they they find him and that's that's sort of like him",
            "start": 4726.28
        },
        {
            "text": "well she says the life support system can't sustain three people I think it only has one cryopod oh there you go there it is right there they they find him and that's that's sort of like him morphing into something else and then I think uh they never went back to that because because James Cameron had a different idea for the second movie okay anyways I'm sorry yeah they had too many people they thought alive that would survive for the 18 weeks at the edge of known space so three of them for 18 weeks there they just wouldn't be sustainable yeah um so they you know agree that they have to keep fighting or whatever this is where it pulls up we go on we're doing a little bit we're trying to figure it out you know we're going to break into groups or whatever this is where uh uh Ripley's now the lead officer of the ship she goes to talk to Mother gets",
            "start": 4764.84
        },
        {
            "text": "doing a little bit we're trying to figure it out you know we're going to break into groups or whatever this is where uh uh Ripley's now the lead officer of the ship she goes to talk to Mother gets the facts finds out the order comes back to confront Ash on it Ash goes just **** crazy, doing **** robot **** or whatever you know what I mean and he's fighting and then he just gives the worst nipple twister of all time to Parker he's like grabs him by just not even by the nip right all can you before that can you imagine what was going through with the writer's brain where he's like you're going to kill Ripley by rolling up a **** magazine and shoving it down her throat what the **** wrong with you well he malfunctions like basically you can see literally screw loose but dude he's like and then shoving and she and she wakes up and like starts choking on it and again talking about the fall like I don't know but then yeah the the sort of like he's like **** like Jesus Christ",
            "start": 4806.36
        },
        {
            "text": "and then shoving and she and she wakes up and like starts choking on it and again talking about the fall like I don't know but then yeah the the sort of like he's like \"Jesus Christ\" and then but just knocks his head surprise to me I I had no idea and I I feel like I should have known cuz I've seen some stuff that spoils future movies but I it was when he picked her up and like launched her I was like Ian he's kind of a small guy I don't think come on like that's a little bit unrealistic and then I was like oh oh this is cool as **** dude even before before the head gets knocked off I was like oh my God it's like Alien: Isolation those dudes are really strong different different Corporation though the one thing I yeah that's why they they didn't have they didn't look like humans they were a different corporation that one of the things I I missed there is why they malfunction they they don't explain it in this movie they don't explain it in this movie but okay cool just",
            "start": 4848.32
        },
        {
            "text": "they were a different corporation that one of the things i i missed there is why they malfunction they they don't explain it in this movie they don't explain it in this movie but okay cool just wondering if i if i miss get knocked on the head or something whatever sort of gets won a little bit later okay cool we'll worry about that later uh for now though they beat the **** out of this **** robot and knock his **** block off right but then like **** we actually need information from him which i actually am blinking on with the information they needed from him know what the **** going on and then they got mad at him and they're just like shut up the **** up and i'm like why would you make that decision they know how to if that was right he might know how to hurt the alien he might know how to kill the alien right right right right i i've already missed it but they describe it as the perfect organism organism she's like you you admire this thing and he was like yeah he's the",
            "start": 4893.16
        },
        {
            "text": "know how to kill the alien right right right right I I've already missed it but they describe it as the perfect organism. She's like, \"You admire this thing,\" and he was like, \"Yeah, he's the perfect...like I love that he has frosting on his face though.\" Oh yeah, and him kind of spitting out of his mouth SP little well, it's that horrible cut right again sign of the ties where they've clearly got the prosthetic. This and then it cuts to an off like they needed to cut away from it maybe they do do a little cut away but then it cuts to a different angle of it and it's clearly him such good movie Magic I love that I love all the lines here though, like Ash can you hear me? Yes, I can hear you. What is your special order? Like such great stuff, but uh last word I can't lie to you about your chances. You have my sympathy. The coldest line ever freaking said, but like it makes me question like how much does he know you know does he know these aliens cuz earlier we got this whole",
            "start": 4929.04
        },
        {
            "text": "your chances you have my sympathy the coldest line ever freaking said but like it it makes me question like how much does he know you know does he know these aliens cuz earlier we got this whole like oh we got to save it like this is the most advanced like does he know that already or is this like new stuff like is he just assuming they're **** I don't know I'm excited wait and see uh of course Parker says he's had enough of that and then burns them cool very cool um now they're in their final thing here right where they got to get this done they're going to break into two things uh she's like We're going to blow up the ship yeah no take our chances in the in the Pod ex yeah yeah yeah yeah so I'm sorry they say that then they break into the two things where Ripley is going to go to the HQ the bridge set off the self-destruct and uh I don't know what the other two are doing Parker and Lambert have to go get the fuel cells for something or other for the cryo chamber there's",
            "start": 4968.16
        },
        {
            "text": "The bridge set off the self-destruct, and I don't know what the other two are doing. Parker and Lambert have to go get the fuel cells for something or other for Ripley. There's something they have to go get, yeah. And man, are they just subtle as a gentle breeze throwing these things up? I'm like, Lambert, stop throwing it, stop throwing the stuff up; they know where the alien is. There was a point where I thought, oh, oh, they're a distraction for Ripley exactly; they need her to go do the thing, so they're like... It was way too much, uh, speaking of way too much but in a cool way, I think. Is all the steps to starting the self-destruct thing, yeah? She's pulling out things that look like the Back to the Future plutonium; she's doing this, flipping switches and stuff, and finally it counts down right, and it's got a 10-minute countdown, and once you get to five minutes, it'll be irreversible or whatever. Yeah, it's Metroid did not like...",
            "start": 5012.4
        },
        {
            "text": "switches and **** and finally it counts down right and it's got a 10-minute countdown and once you get to five minutes It'll be irreversible or whatever yeah it's Metroid did not like yeah um Lambert reacting to seeing the alien she just shuts down she kind of double takes at it like he's like get out of the way she's like I can't I'm like well you're both dying then man and then we get the best bit of sound how this movie didn't win like Best Sound Design is beyond me obviously we had the issues with the screeching and **** but we have a moment where it cuts and Ripley is running toward them and you hear uh you hear Lambert screams like as they're they're having this conversation and you kind they're cutting back and forth with it but the last thing you hear is her like screaming and getting gutted over the over the speakers it's **** terrifying God yeah everything about the like the blocking of this that was very stupid in her acting and look get out",
            "start": 5054.6
        },
        {
            "text": "her like screaming and getting gutted over the speakers, it's **** terrifying. God, yeah, everything about the like the blocking of this was very stupid in her acting and look get out the way, just **** blast at a certain point you got to do it or else you're going to die but then I love the weird like scorpion tail up the GU like that cuz it's that cut to her screaming and like you can kind of add what happened the yeah cuz I needed I needed her doing the work you see the shadow turn and just like like a crazy but she kind of does like a see I I juste I love cuz she kind of looks at it and then she just she's so scared that she just slinks back and just just like and the thing just like as as the shadow comes maybe I don't mind maybe I don't even mind that just the Double Take I don't know didn't love it Ripley runs in on all this and she has Jonesy right and then this happens she gets Spooked and drops Jonesy believe Jonesy I'm a little bit loose on uh Alien sees",
            "start": 5094.36
        },
        {
            "text": "Take I don't know didn't love it Ripley runs in on all this and she has Jonesy right and then this happens she gets Spores and drops Jonesy believe Jonesy I'm a little bit loose on uh Alien sees Jonesy and is like yo what up cat and then the little mouth comes out and goes me you know they could talk to each other Giger's the cat and the alien uh probably yeah two perfect Predators yeah you will Ripley runs back to the bridge now to shut down the self-destruct to right uh well she isn't she's getting she's doing it she's doing and she's pushing the plutonium back in and she throws the switches and then like 459 all of it's done and Mother's like yeah you're **** it's still going to blow up too bad and she's like **** Okay cool so yeah I she **** you Mother screw you Mother you **** I guess I was just kind of confused as to why she tried reversing it because when she came around the corner and also shout out to all the the steady or like handy cam work on this which really Scott did",
            "start": 5140.16
        },
        {
            "text": "I was just kind of confused as to why she tried reversing it because she when she came around the corner and also shout out to all the the steady or like handy cam work on this which really Scott did himself, which is cool first person looking shots. All of the shots here were amazing but she comes around the corner and the whole that goes to the ship, the Alien's there so she goes... I can't get on the ship, puts the cat down, runs back to try to shut it off and then can't and then goes well, I have no choice, I have to now go back to the ship. I have one minute to get on that ship, and when she comes back of course it's gone because of course the Alien being a very smart creature, she's not smart and just sees that the cat... it kind of looks at the cat, it's like this cat's in a holder, and then realizes oh she's trying to get off the ship. I should I should hit your ride? Yeah, I wouldn't put that together either. It's it's the blocking is weird because of course in this specific instance uh",
            "start": 5181.44
        },
        {
            "text": "realizes oh she's trying to get off the ship I should I should hit your ride yeah I wouldn't put that together either it's it's the blocking is weird because of course in this specific instance uh there were lights strobing every 15 like 5 Seconds at you not even like every second so she comes around and looks and it's just it's like it's blocking I think it's blocking her entry into the ship into I see that but whenever the strobes weren't going nuts and it's a lot of smoke with the flamethrower and it's just some of the best shots you've ever seen in movies dude it looks amazing that's and Cinema and apparently there's another little small piece of trivia that on like day one or two shooting with a cat Ripley uh scorch weaver broke out in hives and was like **** I have I'm like allergic to cats I realize that and it turns out it was the Glycerin that they were putting on all the actors faces to get the sweat it was giving her hives they they had to switch that over something else but",
            "start": 5219.92
        },
        {
            "text": "cats I realize that and it turns out it was the glycerin that they were putting on all the actors' faces to get the sweat, it was giving her hives, they had to switch that over to something else but she's allergic, she got 15 right afterwards uh so anyways the can shot it down runs back to the little pod alien's not there climbs on the Pod shuts the doors gets out of there breaks away hooray we're free everything's going to be chill there's a big explosion so cool also it never occurred to me till this watch that the Nostromo, there's three ships in this, there's the big thing that's holding what they mind then there's an Asimov which is technically a towing vessel it's not even like a ship it's like a towing vessel and then there's a little baby ship that comes out underneath it and we got one explosion to represent each one of them why was there so many freak explosions, was the best do some were cool yeah uh everything's chill man right we did it uh Ripley survived",
            "start": 5263.36
        },
        {
            "text": "it and we got one explosion to represent each one of them why was there so many freak explosions the best do some were cool yeah uh everything's chill man right we did it uh Ripley survived she's super stoked or whatever uh she's she doesn't record her mess notes so then yeah she's like cool now I'm going to strip down to my 70s underwear and 70s tank top and I'm going to get into my little space vest it's not that it doesn't make sense because look we all go home we're done we're ready to go to sleep what do you do you I mean she's going to sleep for 18 weeks or whatever you take your pants off you want to be comfortable when you go to bed it's just that the underwear that specific type of underwear is so egregious I but it's not sexy it's just a weird triangle that doesn't I don't think this is a sexualization thing as much as like a weird that's what it was yeah leg think that was 70s underwear but it does it doesn't cover anything like it covers",
            "start": 5306.2
        },
        {
            "text": "triangle that doesn't I don't think this is a sexualization thing as much as like a weird 70s underwear but it does it doesn't cover anything like it covers the wrong things like it's just it covers like the little triangle of the butt but not like the thong bar it's like not letting the cheeks breathe you just had to account for the butthole back then really the only thing that would get you banned on NBC was if you showed two holes one hole is fine yeah Bush is definitely fine well Bush there I think there are spots where you can actually see that it's creeping around there yeah I was very confused with what the alien was doing up there sleeping well I was confused too Andy, are you injured? Yeah, what tired are you serious? No, he's not. I'm dead, I'm dead serious. I think the alien is asleep. Shut the **** up, no, he's just little sleepy. Have you ever like I mean like he sleeps like Ben.",
            "start": 5352.12
        },
        {
            "text": "yeah what are you serious no he's not I'm dead I'm dead serious I think the Alien is asleep shut the **** up no he's he's just little sleepy have you ever like I mean like he sleeps like Ben my three-year-old sleeps where there's all this movement and like cuz like when she runs and hides in the thing the Alien isn't cognizant that she's there he he's like there fine it's not to she has to hit the thing and the smoke blows out that the AL like what the **** is happening and rolls out like what the **** going on well it reaches out for at one point right when she R there go no I mean yet it does reach out but it reaches out in the same way I go to me for me in the same way you're thinking the thing looks at the cat and knows that's what's going on I think this thing is like I'm settling down to hibernate or whatever his sleep cycle is and it is just a happen stance that he he stretches out there like I mean we're right there at the scene like you can watch how long we it",
            "start": 5397.16
        },
        {
            "text": "settling down to hibernate or whatever his sleep cycle is and it is just a happenstance that he he stretches out there like I mean we're right there at the scene like you can watch how long we it stretches out here and then we have so much time where Ripley's just being quiet she just backs off she gets in the thing she does the thing she does all the steps she holds back her scream there Alien I know we're talking about like a bunch of this is I guess theater of the mind unless there's some trivia you know about this I know I've never had an explanation this if the alien is awake for all this like this makes me like the movie I also in my brain in my brain I always just read it as like it had curled into this specific spot that was hard to get into so it could hide and and then realized that it doesn't it's it's one V one I was confused just nuzzling the pillow I was so confused I was confused but there was enough like smoke and like hot and cold and things like that I'm like maybe one",
            "start": 5439.52
        },
        {
            "text": "that it doesn't, it's one V one, I was confused, I was just nuzzling the pillow, I was so confused, but there was enough like smoke and hot and cold and things like that, I'm like maybe one of those things, it, I just thought we sort of read it as the Alien was, I'm not worried, I'm going to kill her, pulls its arm back in cuz it rolled out of bed and like oh that's not where my arm goes but like he saw her as she walked away and went into this room, but it's the Alien's eyes really open at that point cuz this whole time this is shot as if the Alien was injured severely throughout all of these battles and is like I'm really weak and I can't really do much right now and that like the fact there's no way it's sleepy that makes me so much less, I don't know, I don't have an answer for you, Milo Davis who's been on point for everything they've said because I think they're a super fan too goes it wasn't looking for Ripley at the",
            "start": 5483.92
        },
        {
            "text": "an answer for you Milo Davis who's been on point for everything they've said because I think they're a super fan too goes it wasn't looking for Ripley at the end it's like waking a bear from hibernation now time went by hey I'm not arguing with you guys just saying I I Lally one minute I would bet the **** house that this thing is asleep but it's just like that's such a stupid decision then because like it the cat and like oh the cat had to go there cuz the fires and stuff like you add all that up with immediately knowing that there's still a human here cuz he knows that Ripley's there he just faced off against her she's still alive I'm going to take a little nappy nap like what now Milo says again it's not injured but it was dying like a bug huh what Jesus **** man that's new information I didn't get any of that I I my head Cannon Tim is that again like I'm just saying like we've been talking however long we've been talking right now",
            "start": 5529.92
        },
        {
            "text": "\"Huh, what Jesus... man that's new information I didn't get any of that. I, my head, Cannon Tim, is that again? Like, we've been talking however long we've been talking right now - a minute, minute and a half, two minutes - and like it still hasn't exited to come after her. My head, Cannon, is that it's like when a stupid cat gets stuck in a little jar and it's like, 'Oh, says it didn't know it didn't know she was there.' But I mean like the scene with the chains - like he's up there for multiple minutes waiting for the right moment to attack. Like that whole scene to me is this again, right? I just imagine the alien thinking that there are air vents in this place and being stuck... like, 'Oh no, I'm up.' Yeah, I saw a video real quick - I saw a video recently of an owner getting home and they had like a security camera inside their house and they got home after several hours of work and their cat was stuck in the blinds and had like stopped like trying to.\"",
            "start": 5568.24
        },
        {
            "text": "a an owner getting home and they had like a security camera inside their house and they got home after several hours of work and their cat was stuck in the blinds and had like stopped like trying to because they were they were just stuck and to me this is the Alien so a quick search there's two there's two like I guess conflicting theories on this one says that Obi-Wan said that it was in fact like it had eaten and so it was kind of started going into hibernation and then Ridley apparently came up with a concept that the Alien's life cycle is like it's it's nearing its end of its life cycle because it's so fast the cycle itself was so fast and obviously we'd go into that's why he got big so fast but it got big and then it starts to it's it's actually dying I wasn't even talking about that cuz it just immediately snapped for me that like you said Ridley and Ripley but it's Ridley because of Ridley Scott yeah no in Metroid no because Ridley Scott",
            "start": 5615.44
        },
        {
            "text": "cuz it just immediately snapped for me that like you said Ridley and Ripley but it's Ridley because of Ridley Scott yeah no in Metroid no because Ridley Scott didn't work on this film what Ridley Scott directed this film yeah I apologize I'm confused with the other one I well I mean well maybe I thought you were doing like an oh play on words for me I'm like I mean I'm sure it's all connected right Scott anyways then she hits this button and wakes it up like it's it's asleep guys I'm sorry to break she trying to I'm sorry you guys thought this thing was was smart it's a baby was born yesterday as the chat pointed out I mean it was smart enough to know that like oh the cat this does not add up with the logic of this movie at all it's I'm not denying that it's sleeping that's stupid thank you thank you I just also thought my you want to know my cinema sin here if I will it's her singing the song yeah dude where I was like in a modern movie right now we would have gotten at least three",
            "start": 5656.64
        },
        {
            "text": "you thank you i just also thought my you want to know my cinema sin here if i will it's her singing the song yeah dude where i was like in a modern movie right now we would have gotten at least three times it would have been too much but at least in the intro you would have gotten her I Thank My Lucky Stars you know what I mean like set up this song that I don't know what it is really to me I was I this is the most haunting thing she does in this whole thing she so scared that she has to sing to herself but i would have this thing is **** waking up behind her especially you know us knowing uh through the video game that she has a kid yeah i would have loved a flashback at some point of her singing to her kid in the crib or whatever and that's what she's doing in this moment just singing it once when she's nervous sure to like shut down the bomb or whatever I man i i just love i love her performance anyway he wakes up cuz he is asleep he's all pissed off by the smoke or whatever",
            "start": 5698.44
        },
        {
            "text": "it once when she's nervous sure to shut down the bomb or whatever I mean I just love her performance anyway he wakes up because he was asleep, he's all pissed off by the smoke or whatever right stop She blows the door as it gets really close she waits Waits Waits blows the door I would have blown it a lot sooner I blow it a lot sooner every night uh he scratches himself where he gets sucked out she shoots him with the little grappling hook then she drops the gun the gun goes the door closes he hangs he starts crawling back up and then he's very smart just like in Life uh he tries to climb up into the air vent you know what I mean he sees something that looks like an air vent he likes I'm going in that Nails it and blows his ass out right cool effect here too where it's like Light and Water like whatever the fuel is coming out of they put",
            "start": 5739.68
        },
        {
            "text": "like an air vent he's like I'm going in that **** Nails it and blows his ass out right cool effect here too where it's like Light and Water like whatever the fuel is coming out of they put like moisture in it so you see like specks of water coming at the cameras it's like you know how I knew the blurring the lens you know how I knew the movie wasn't done when she gets on the Escape pod it didn't just end it didn't end they give you that one beat you go **** yeah I was like there more here because movies in the 80s she gets on the ship and it's like over what the **** it was 79 but still instead you get a nice little ending here right of her filing her report here that she's the last survivor you know third in command of the Nostromo she putting herself to sleep the last surviving member of the Nostromo she puts herself to sleep and that is the movie Alien I love her putting Jonesy in his own little pod well interestingly enough like",
            "start": 5780.84
        },
        {
            "text": "putting herself to sleep, the last surviving member of the Nostromo; she puts herself to sleep, and that is the movie Alien. I love her putting Jonesy in his own little pod. Well, interestingly enough, like I don't know if that was the same pod or a different pod because I I I I maybe I just totally made a head can there was only one pod in this thing but I remember, and maybe it's later that she wakes up; was it? Oh so maybe I don't know. I always thought that she like opened it back up grabbed him and like with him. I I love this last shot of like us kind of slow doing in or actually maybe it was a zoom cuz he's a lot of Zooms in this too, which is sign of the 70s; and then it just Fades to the stars and then the music. It's cool stuff man. Good. I hope Jonesy returns. We'll see next week. Ragu BaGu, what's up everybody? Welcome to RaGu BaGu, talk bad guys, the podcast within a podcast that's started it all. This is where we Rank and review all the bad guys in the Alien vs Predator Universe.",
            "start": 5823.4
        },
        {
            "text": "what's up everybody Welcome to RaGu BaGu, talk bad guys the podcast within a podcast that's started it all this is where we Rank and review all the bad guys in the Aliens vs Predator Universe obviously we're going to go number one here we're putting Xenomorph Facehugger Ash, Ash I put Ash on there okay and the Corporation maybe you know what hold on hold on and can you link me to this after uh it's the same one as always it's a new tab oh very cool maybe it's like a Ragu BaGu or something like the X Factor villain cuz it's always going to be the Xenomorph, the Xenomorph is always the baddy but who's the when we get to AVP we got to pick a side we got to pick a side we do got to pick a side there is an ongoing like Marvel Civil War there is a a very like a debate that's raging in the Scarpino household right now because every single time I watch either a Predator movie or an Alien movie my wife's like Alien scarier and I'm not arguing it but she just sees to argue that one I'm",
            "start": 5870.88
        },
        {
            "text": "scarpino household right now because every single time I watch either a Predator movie or an Alien movie my wife's like \"Alien\" is scarier and I'm not arguing it but she just sees to argue that one I'm like this is a one-sided debate you're right I'm agreeing with you she's like \"you like the Predator\" I know you do I'm like well it's cool but it's not as scary as the Xenomorph you're more scared of us in the video game \"Predator: Hunting Grounds\" when you were playing the Predator and we were the hunters I didn't know how it worked and we come through a clearing and just see the Predator in the distance looking up at a tree and turns around and goes \"oh ****\" The Predator runs away Tuesday, 10:22 p.m. This is me to I send this text to and I'm watching Alien remember when we were playing Predator and we found Nick just standing on the ground as Predator LOL and Andy responds in like the blocking quotes turns turns around and sees us quote \"oh ****\" it was scary man it was a complicated",
            "start": 5921.88
        },
        {
            "text": "and we found Nick just standing on the ground as Predator LOL and Andy responds in like the blocking quotes turns around and sees us quote oh **** it was scary man it was a complicated game man I had Zen more face hugger and Ash enter on Ragu Bagu Alien at number one yeah pretty good I I'm excited to see if we get more eh moments you know what I mean or we're going to move on from that cuz 1979 very different time from 1986 big old Jim Cameron is coming in the free man come on yeah let's go baby um Andy when you saw Ash the first time what did you think about my friend BBO BBO BBO bins yeah oh yeah I immediately the the the first thing I thought of was it's it's mine why shouldn't I keep it then yeah Bilbo Baggins I am not a conjurer of keep I forget what he says I'm trying to help you oh man so good so good of course Alien is number one right now uh we'll see where it lands after next week when we review Aliens directed by James Cameron so cool Jim himself yeah um thank you",
            "start": 5966.6
        },
        {
            "text": "oh man so good so good of course Alien is number one right now uh we'll see where it lands after next week when we review Aliens directed by James Cameron so cool Jimmy Cameran himself yeah um thank you so much for hanging out with us thank you GameOverGreggy for joining us this in Review series Alien and Predator in Review uh let us know in the comments below what you thought of this movie and if you liked him sleeping I need to know until next time I love you all goodbye",
            "start": 6025.76
        }
    ]
}