{
    "id": 1904,
    "video_id": "72UI3cgJcpc",
    "show_name": "Animated",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty"
    ],
    "title": "Tim Gettys Wanted For Murder - Kinda Funny Doodles",
    "description": "New episode of Kinda Funny Doodles every Friday!\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nAnimated by Zacq Wenzel\nFrom this video: https://youtu.be/IFuD0bZv2ic",
    "published_at": 1467993601,
    "duration": 90,
    "transcript_chunks": [
        {
            "text": "um I went snowboarding in Tahoe one time I don't know how to snowboard I was snowboarding though me and my friend tried it we we stopped at the edge of like a big turn and uh we see this like seven-year-old kid by himself skiing towards us down this hill and he's going fast screaming and I just hear and I'm looking at him I look at my like dude what do we do what do we do what do we do and he's like I don't know I don't know I'm like should should I let him hit me like that'll stop him and he's like I don't I don't know I'm like it's going to really hurt dude let's move let's move so we move out of the way and that kid just goes flying off the cliff in the trees and all we hear is you got to be kidding me nope that was it and then and then like 2 minutes later I was like oh my God oh my God we were freaking out no we Little Sirens we just the little like snowmobile sirens and we were like oh my I don't know what happened to that kid I hope he's okay I hope he has a family",
            "start": 0.48
        },
        {
            "text": "God oh my God, we were freaking out. No, we Little Sirens - we just the little like snowmobile sirens and we were like, \"Oh my, I don't know what happened to that kid.\" I hope he's okay. I hope he has a family. Things are good. I'm willing to bet for the last year this kid has been thinking about you like that son of a... Yeah, you now identified yourself. It's like one of those crazy things where he's like gone back through all the Life records. He's got the he's got the Pinto Pin connections trying to piece it all together and now's crazy man. I felt so bad then me and my friend like let's go let's get the hell out of here, access but then we sped off lame. You wanted you're wanted for... man no probably he might have died.",
            "start": 47.44
        }
    ]
}