{
    "id": 1912,
    "video_id": "ia6QRaNV89M",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Pokemon Go and What Games Are We Playing Now - Kinda Funny Gamescast Ep. 76 (Pt. 2)",
    "description": "What games are we currently obsessed with.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1468328403,
    "duration": 1141,
    "transcript_chunks": [
        {
            "text": "We're Time Warp now we're in topic two this is topic two here we are ladies and gentlemen we are now in topic two that that topic was thrilling wasn't it I bet we were awesome I'm going to kick my feet up when I talk to you I'm going to get I'm going to get we a lot of times we're here and we're buttoned up a little too professes I like to say we're going to let it all hang out during that inside cast I'll tell you what all 6 in um so besides inside I want to talk about what games we've been playing recently this is a recurring Kinda Funny Gamescast topic we haven't had one for a while Colin what have you been playing uh primarily only Adventures of Mana on Vita which we talked a lot bit about a bit on PSI love xoxo but it's a basically a remake of the 1991 Final Fantasy Adventures which was a Game Boy game uh known as Seiken Densetsu: Final Fantasy Gaiden or Seiken Densetsu 3 in Japan which was released I think in 1990 um released by Square in the late 90s on Game Boy Advance",
            "start": 0.44
        },
        {
            "text": "Adventures which was a Game Boy game, uh known as Seiken Densetsu: Final Fantasy Adventure or Seiken Densetsu 3 in Japan, which was released I think in 1990, um released by Sunsoft in the late 90s on Game Boy Color, although it didn't uh uh have much fanfare when it came out cuz Game Boy was kind of dying at the time except for with Pokémon which came out later that year, um and uh it's just so The Adventures of Mana is just a remake because the original one is a Mana game, um as people you know know that series now it's not a not a it's not a fledgling series by any stretch of the imagination, so um so I'm uh enjoying it, it's it's but it's it's very vanilla, um it's just scratching an itch right now I don't think it's an exemplary game by any stretching the imagination, it's also broken in a lot of ways, just hit the buttons though right, it's what you want out of a game right now yeah I'm I'm just feeling it, it's just an it's very Zelda-like, it's easy um uh but there is ways to break the game pretty",
            "start": 50.04
        },
        {
            "text": "just hit the buttons though right it's what you want out of a game right now yeah I'm I'm just feeling it it's just an it's very Zelda-like it's easy um uh but there is ways to break the game pretty easily by not having certain items in certain situations and I can't believe that they haven't edited that or fixed that in this new game um basically there's just RAM limitations on the original Game Boy that didn't allow the game to remember that doors were unlocked or that these use these items called MXs which are basically pick pickaxes to get through like whole like cracks and walls you make and the walls in the game just didn't remember that they were there so there there are ways to get trapped in multiple places in the game um and the Vita could certainly remember that these things were unlocked so I don't know why they didn't edit those things out um so I did get stuck in a specific place and Ian actually helped me get out of it which was funny um how she uh it was uh we so on",
            "start": 89.92
        },
        {
            "text": "were unlocked so I don't know why they didn't edit those things out um so I did get stuck in a specific place and Ain actually helped me get out of it which was funny um how she uh it was uh we so on PS I love you but basically there's a new game continue and load game option at this at the screen she was playing around and she died she was like trying to get she she doesn't really play games so she was just kind of messing around and I kept going to continue to continue my game uh and she went to load game and loaded it and loaded me outside of the castle that I was in um good job Aaron so she totally fixed it um but nonetheless it's just scratching in it it's cheap I think people might enjoy it also might send Square Enix a good message about maybe bringing Imscared and some other Vita games over although they're being pretty generous with the Vita with Dragon Quest Heroes 2 with Dragon Quest Builders um Final Fantasy Explorers Final Fantasy Explorers: The Chosen One exactly so they are",
            "start": 127.08
        },
        {
            "text": "games over although they're being pretty generous with the Vita with Dragon Quest Heroes 2 with Dragon Quest Builders um Final Fantasy Explorers, Final Fantasy Explorers: The Chosen One (EXA), exactly so they are they are supporting the VA in a tri-Ace capacity and I don't mean these are tri-Ace games but in a tri-Ace publisher capacity more than almost anyone else um so that's basically all I've been playing playing and I've just been messing around with this and the other thing but that's that's basically the extent of it cool I've been doing I've been doing a bunch of smaller things we played Inside last night obviously you already saw that topic but before then we've been on the road so much uh doing a lot of Odin Sphere on Vita enjoying that came back a few uh I guess last week before RTX was playing uh Pac-Man 256 on the PlayStation 4 enjoying that so finally yeah finally a year late whatever it's still fun to I I never played it before yeah had you played it a lot on what was mobile yeah yeah here's the thing",
            "start": 163.32
        },
        {
            "text": "on the PlayStation 4 enjoying that so finally yeah finally a year late whatever it's still fun to I I never played it before yeah had you played it a lot on what was mobile yeah yeah here's the thing almost bought a mobile game Teen Titans Go! put out their iPhone thing which is Pokémon but you actually make them fight and stuff like that you're collecting Teen Titans figures almost did it didn't do it 3.99 I was like ah for something I'm not going to play too much I'm not I can't get into it but Odin Sphere I've been really really enjoying it I forgot how much I liked that game cuz that you know when that came that's a definitive moment for me of that coming to PlayStation 2 and me still living with Micah which is like when I first moved the first nine months I was here and working at IGN uh he was so into that game and I enjoyed it but I liked GrimGrimoire more and I was uh reviewing that at the time uh to now I get to play it and have it be such a great fit for the Vita",
            "start": 201.2
        },
        {
            "text": "at IGN uh he was so into that game and I enjoyed it but I liked GrimGrimoire more and I was uh reviewing that at the time uh to now I get to play it and have it be such a great fit for the Vita where I'm jumping in I'm playing all right cool oh how did I only get an A on that level go back or that fight as it would be go back try to Srank it you look at the map and realize I haven't you know before I progress the story go back and try to clear out these entire expanses to go get the rest of my equipment get my S-ranks and stuff like that it was scratching the itch similar to what Colin's talking about where you know Odin is a product of its time it's not like the most deep game in the world right you grow fruit you eat the fruit you get the XP everybody's happy but I'm enjoying playing through it again I'm enjoying getting out there I'm very excited for Gal Gun that's what I'm waiting for right now because I'm going a platinum The Perv Game Gal Gun you the plan is to do it in stream",
            "start": 240.32
        },
        {
            "text": "I'm enjoying getting out there, I'm very excited for Gal Gun, that's what I'm waiting for right now because I'm going for a platinum in the game Gal*Gun. The plan is to do it in stream if possible, I don't know, come on let's not get ahead of ourselves, who knows how much grinding and I've got to do this but last night I started playing a game called Pokémon Go. So did Tim Gettys. By the time I got there, it was annoying for the game over that took it. Kevin raised his hand like he took it. I got you, kind of funny, Kevin, good job. Yeah, I mean, whoever is out there, real talk, go **** yourself, yeah not cool, yeah not cool at all they got you. I feel like I got Nick Scarpino this is the whole reason I don't use Snapchat, it's probably the whole reason I won't play much more Pokémon Go also it's not the most interesting game everyone's crazy about it right now, night one was fun to have the Pokémon on Portillo's head or whatever but never going to play it again.",
            "start": 276.28
        },
        {
            "text": "much more Pokémon Go also it's not the interesting of a game everyone's crazy about it right now night one was fun to have the Pokémon on Portillo's head or whatever but never going to play it again yeah I mean but that's the thing is like you're talking about it being stuck in this room the amount of people going out like actually trying to go get them all and once it once it gets to the the higher level stuff of getting the more rare stuff that shit's F that's cool and I like that idea of especially when you think about conventions like things like Pokémon Go it's got a lot of potential and when they add to it like I think there's a lot of potential with this game and like seeing the stories people have had about going out and trying to find Pokémon pumping into other people doing the same thing because the gyms are at like locations and monuments and like all these like it's cool um places I think it's really cool the question is how long does this last but I think that it doesn't need to",
            "start": 320.28
        },
        {
            "text": "because the gyms are at like locations and monuments and like all these like it's cool um places I think it's really cool the question is how long does this last but I think that it doesn't need to last forever I think that it's um as long as they keep adding to it the people that enjoy it are going to keep doing it it's not supposed to be this crazy it's a Tamagotchi thing I know you know it's just like it is it isn't a full-fledged I'm not saying I hate it or something or it's horrible it's just not like I get it I played it I was like okay cool this isn't what I'm going to keep playing but I enjoyed it for the night and I've enjoyed watching people finding all the Poké Balls in their bathroom or who like everyone is talking about it today the entire Twitter feed is pictures of it or conversations about it I wonder how long that's going to last you know like with Momo uh it lasted a lot longer than I thought it was like there was that initial craze of everybody and it's again it's",
            "start": 354.16
        },
        {
            "text": "about it I wonder how long that's going to last, you know, like with Pokémon Go. Uh, it lasted a lot longer than I thought. It was like there was that initial craze of everybody and it's again it's the thing of supply and demand - when not everyone can have it, the people that do have it make everyone else think it's the coolest thing in the world, sure. So the fact that it wasn't on um the iOS American app store for so long I think really kind of contributed a lot to its popularity. Xavier Woods wouldn't shut up about it every tweet from Austin, blah blah blah, where is it? Yeah, and uh again obviously it's Pokémon so that's what's going to sell it alone but I think also the fact that it was all the biggest group didn't have access to it I think caused a lot of the stir and commotion. Um, but now that everyone has it and it's not even working everywhere is the most frustrating thing - it's it's always hard with these online games where it's like okay how did you not prepare your servers for this like did you not",
            "start": 388.04
        },
        {
            "text": "it and it's not even working everywhere is the most frustrating thing it's it's always hard with these online games where it's like okay how did you not prepare your servers for this like did you not expect everybody to download the Pokémon Go um AR game free Pokémon yeah like come on uh but it's like I don't know is there a solution to that probably not did know yeah every other game it's like they know that they're going to get hit super hard and there's not really a way to to kind of prevent that so it's been annoying trying to but I haven't been able to really do much really I was going to say I want to know what if it's your dreams come true no oh it's oh no God no no no no this is not my dreams come true is it cool and like is it a nice kind of hint at the future and what could be yeah and I definitely think that it's it's a a good start and for Nintendo to be doing things like this is great like different uh gameplay Styles and like new Innovations and stuff or innovations that",
            "start": 428.92
        },
        {
            "text": "and I definitely think that it's it's a a good start and for Nintendo to be doing things like this is great like different uh gameplay styles and like new innovations and stuff or innovations that are not new but are now finally being viewed by the mainstream because it's Pokémon, like Niantic did their thing before, but don't give a **** you know now everyone at least knows what this could look like and yeah it looks like admittedly higher quality Pokémon models than I ever expected to see in admittedly lower quality scenarios of them just kind of popping up in a camera yeah yeah you know so it's kind of like it's I give them an A for effort you know um again I don't think that there's a fun game there uh but I think that the idea of the the gyms and seeing where a lot of other people are at with screenshotting like you get to choose kind of the team that you end up following uh like like the Team Rocket style thing and um seeing the gyms like last night I was laying in bed",
            "start": 471.2
        },
        {
            "text": "people are at with screenshotting like you get to choose kind of the team that you end up following uh like like the Team Rocket style thing and um seeing the gyms like last night I was laying in bed and seeing where the things are in relation to where I live it's like that's cool like I wouldn't ever think that they'd be there but looking at the map it's like it's just fun where is the same where are the same San Francisco gyms are they at the Golden Gate there's a whole bunch of them Grimecraft holding it down Grimecraft has a team of like a thousand Zubats and they're all hella high leveled and me it's funny though but I know he was holding down a gym over the last couple days like that's funny and seeing all the Raids people play like they look stupid as **** all running around everybody likes D doing it yeah but it's like I it's cool to see them like Ashley Jenkins holding down a gym out in Austin and it's like that the idea of that once it gets to be more competitive thing there",
            "start": 519.76
        },
        {
            "text": "likes D doing it yeah but it's like I it's cool to see them like Ashley Jenkins holding down a gym out in Austin and it's like that the idea of that once it gets to be more competitive thing there actually is people that are challenging holding down uh the areas that is kind of cool yeah and again once it gets to the traffic I'm excited cuz we travel sure so it's like we're still in that that early part we're great okay I got my starter I'm seeing some Pidgeys we'll go through there but it's like once we get to like the the more real stuff I think that's why I want the AR Animal Crossing game so I can go to Austin and get a peach and bring it back and plant it in my AR Animal Crossing backyard yeah it'll be but I mean that that really is the what we're going to be seeing right and like that's the stuff that works with these types of games it's cool PC people celebrating and have fun with it yeah and it's Pokémon, Pokémon's awesome so people do like Pokémon what El like that it's OG Pokémon",
            "start": 559.28
        },
        {
            "text": "the stuff that works with these types of it's cool PC people celebrating and have fun with it yeah and it's Pokémon, Pokémon's awesome so people do like Pokémon what El like that it's OG Pokémon what's up what else have you been playing I've been playing a whole bunch of I mean I want to give a shout out to Gang Beasts because we've been playing a lot of Gang Beasts at different events and stuff for anybody that hasn't seen it by now the Kinda Funny vs Screw Attack panel we did at SGC is live over on youtube.com/ ScrewAttack and it's an hour of us just playing a bunch of different games ending in Gang Beasts yeah that game is always fun as hell we did it also at let's play live when we were graced by Colin's presence as well you're welcome and the we did a let's play at E3 with Tim Schafer that went live on the channel there's a bunch of yeah there's a bunch of Gang Beasts let's plays as well yeah finally um but like I every time I play that game I'm reminded of like how awesome it is but",
            "start": 603.4
        },
        {
            "text": "that went live on the channel there's a bunch of Yeah, there's a bunch of Gang Beasts let's plays as well. Yeah, finally um, but like I every time I play that game I'm reminded of like how awesome it is, but and Greg always jokes about like dude we should get really really good at Gang Beasts and just **** **** everyone's day. I don't know if anyone is really yeah it's that thing every time we play it I feel like it's a game we play all the time and when we play it there's always that thing of like wait why what is it again and why and like I'm in there and I'm alternating left and rights and I'm like here we go and like I know I was like during the screw attack thing Greg wasn't and he was still knocking me I'm like what the **** I'm hitting you two fists they should go down yeah yeah but uh it's such a funny game and I think it's designed around not necessarily winning but more just like creating funny scenario exactly exactly it's very visually funny comedic game I always have a lot of",
            "start": 639.44
        },
        {
            "text": "It's such a funny game and I think it's designed around not necessarily winning but more just like creating funny scenarios exactly, exactly. It's very visually funny, comedic game. I always have a lot of fun with that. Um, going back to last year, it was my birthday, and I played through Crash Bandicoot 1, and I wanted to do a stream of Crash Bandicoot 2 this year, but we were traveling so I was going to RTX. I really wanted to play it especially now that the games have been announced, there's going to be remakes on, and that's super exciting to me, obviously. For anyone who doesn't know, I'm excited about this; he's very excited, yeah, very popular. But I've been upset because I couldn't play it on the Vita; I've talked about that a bazillion times. But I was like, why am I bitching about this? I can just bust out my PSP and play it there, so that's what I did. Yeah, did my charger doesn't work anymore. Greg Miller, the one household in the world that still has a PSP charger, just ready you like how I",
            "start": 675.88
        },
        {
            "text": "just bust out my PSP and play it there so that's what I did yeah did my charger doesn't work anymore GameOverGreggy the one household in the world that still has a PSP charger just ready you like how I knew it was one of three places and there probably multiple and when you walked in like I'd have a PSP I'm like yeah it's either in the controller drawer I had this bag with old gen stuff or it's under here you go check those two play check immediately found it immediately had it and it was awesome so my PSP somehow still totally works the battery still charged on the plane didn't need to plug it in I just played the entire time be Crash Bandicoot 2 and man Crash Bandicoot 2 is awesome that is what it is from like Uncharted to Uncharted 2 where it's like Crash Bandicoot one playing through it like I almost believed you guys telling me that those weren't good games and uh and Crash Bandicoot one it you know it has its its issues and it's uh difficulty spikes and the save system is atrocious and the controls are a little",
            "start": 716.0
        },
        {
            "text": "me that those weren't good games and uh and Crash Bandicoot one, it you know it's it has its its issues and it's uh difficulty spikes and the save system is atrocious and the controls are a little bit janky but Crash 2 man like that it's a good platformer like it's really good I'm going to play through them all start to finish when that remaster comes out just for you Tim just for appreciate that might want start with we'll do full plays no no no I'm going I want to start with one and I'll go all the way through and you'll have to next to me and you'll hear me **** and complain and scream at it I'm excited to to play through three as well because three was my favorite growing up um but I don't know if it's going to be able to beat two cuz two is really solid now do you want to talk about picking Crash Team Racing and then the Crash Team Racing and then you lost it that was your game that was you won yes first off the not to peel the **** curtain back we were supposed to win and lose",
            "start": 754.48
        },
        {
            "text": "Crash Team Racing and then Crash Bandicoot team racing, and then you lost it, that was your game, that was you won yes. First off, the not to peel back the curtain we were supposed to win and lose every other match for the things you didn't you didn't win you you didn't lose that on purpose I'm not saying I I did he didn't throw it guys I didn't throw it but I threw the the the third round of it for sure when it looked like I was coming back absolutely I know I'm just and anyway even then um no I mean that it's I'm not saying I'm good at it never said I was good at it stand by that um but I do stand by Crash Team Racing being the superior C better than Mario Kart yeah man absolutely of that generation yes well yes it's better than Mario Kart 64 is what I'm saying yeah um I think it might be the best car racer ever though well no cuz remember then there was Mario Kart Double Dash yeah I do remember that there's also Mod Nation Racers so I but I'm not throwing that out I mean",
            "start": 790.04
        },
        {
            "text": "it might be the best car racer ever though well no cuz remember then there was Mario Kart Double Dash yeah I do remember that there's also ModNation Racers so I but I'm not throwing that out I mean if you want to put Mod Nation Racers out there is a better one than Mario Kart Double Dash I mean I don't I think you're crazy but I respect the choice if it wasn't the load times it'd be a different story about Mod Nation Racers to this day but I I do also want to give a shout out to the PSP because it is beautiful piece of Hardware  fantastic I hadn't held one in so long and I took years and held it I was like damn I missed I missed this it feels so good that's springy weird thing of the UMD when you shake it you nice um I love the d-pad you were holding that was an original chunker that wasn't any of the slim ones that wasn't I want that slim  I don't want that go  no the go neither of those were  to be clear Oh you mean the go you had to like hold it like it was",
            "start": 831.52
        },
        {
            "text": "\"wasn't any of the slim ones, that wasn't. I want that Slim Vita. I don't want that Go ****. No, the Go neither of those were **** to be clear. Oh, you mean the Go, you had to like hold it like it was the Game Boy Advance SP. I like how you talk like you have Andre the Giant hands. This you're complaining against the Vita too. It is yeah, you got normal ass hands. I got some normal ass hands and I'm still playing with this tiny ass thing. You know how silly you look, Greg? No, I looked awesome playing on your Vita. You look silly. People like, 'Is that an Engage over there?' Oh yeah, for the Vita. Yeah, no every's like what the hell is that thing? Yeah, no, no, but uh anyways so I'm doing a lot of that and it's hot pink people like it and but in terms of like current like games I haven't talked about this on the show Overwatch. Yeah, you're Overwatch obsessed with Overwatch. It's so much **** fun. Uh every couple nights I just pop in play for a bit. I love it because it reminds me of Smash Bros in the sense that it's fun.\"",
            "start": 870.84
        },
        {
            "text": "yeah you're Overwatch obsessed with Overwatch it's so much **** fun uh every couple nights I just pop in play for a bit I love it because it reminds me of Smash Bros in the sense that it's fun even if you're not good um I haven't really played with friends yet which I would love to do and I'd love to get anybody here that actually gives a **** to try it cuz it's it is cool it's really refreshing that it's not um Team match over and over and you don't really need to be good at killing people you can just kind of like be supportive and help um having all the different Heroes you can play as that's where the Smash Bros thing comes into me where it's like you have your main character that you go to but it's still fun to play as the other ones and uh I really like that in the game you switch between the characters in the match so if if your your team's not the strategy is not working you can what just Kevin yeah Kevin what's even happening he was trying Kevin was reaching back blindly",
            "start": 905.08
        },
        {
            "text": "between the characters in the match so if if your team's not the strategy is not working you can what just Kevin, yeah Kevin, what's even happening he was trying Kevin was reaching back blindly to grab his uh Power and grabbed the cable that comes out of the wall that goes nowhere, the co-axial cable. What did I do then? You grimaced and went further back and got the power cord. All right, just saying, just saying - success story. So over on PS4, I played a little bit; it seems cool, and I but I left it behind, but if I was playing with people, I think I'd be more interested. I mean that's my thing: I'm having so much fun without people, with people, I'm sure it's a whole other level. I want to try playing with my boy Andy Cortez; he sucks - he plays on all the systems, all the different teams; he has no leg up like how he works at Rooster Teeth helps us out all the time then talks **** about us to Rooster Teeth; it's true. I hate him, yeah me too. Do you want to come over this weekend and",
            "start": 944.28
        },
        {
            "text": "has no legend similar like how he works at Rooster Teeth helps us out all the time then talk crap about us to Rooster Teeth it's true I hate him yeah me too do you want to come over this weekend and bring Kevin and then we all set up the Overwatch room out there and we have TVs all in okay cool no no but I do want to play with you okay that's some point so we should do that um what else is there we missed anything else games we've been playing no cuz I mean we've been on the road so much that I've limited it to Vita and I've been trying to focus on Odin when I'm on there cuz I did I did I in Adventures of Mana I did play for a little bit and I was like okay cool it wasn't bad but it was just like not what I wanted whereas Odin for me is the one of like oh right beautiful I feel like I'm getting stuff done I'm going through I can feel the power yeah um and real quick randomly I had an urge to play it race the sun",
            "start": 986.12
        },
        {
            "text": "Odin for me is the one of like, oh right, beautiful. I feel like I'm getting **** done. I'm going through. I can feel the power, yeah. Um, and real quick, randomly, I had an urge to play it - Race the Sun on Vita. Race The Sun's a great game that **** back I played long time ago, but I just was like, \"I just want to play it again.\" I played through just for a bit, and yeah, it's it's just it's a fun game, man. It's a really cool game. It's an addictive hook to that game, yeah. It's a nice idea; it's very simple, very hard to master. Uh, changes dynamically which is cool. I like when playing it gives me kind of that roller coaster sensation where like I can kind of feel it sure like move as I'm doing. I'm wow, that's a it's cool just like the the way that it it looks kind of does that to me. I also really dig the music, yep. It's just one track but it's like great song, yeah. No, it's good. What have you been playing? Kevin, get on the mic; he had to wake up; he took off his comforter. Uh, just caused three oh you got the",
            "start": 1028.28
        },
        {
            "text": "the music yep it's just one track but it's like great song yeah no it's good what you been playing Tim Gettys get on the mic he had to wake up he took off his comforter uh just caused three oh you got the season pass right season pass yeah so I had all the DLC how's that going for you with Just Cause I like clearing the map and then I'm like I'm over the story so I cleared the map took me 3 hours I did it it's one of those poor decisions where it was midnight and I was like I'll just why not I'll just try this real quick it's like oh now it's 4 in the morning uh what else was it worth it though oh it totally worth it I love that game have you started Overwatch cuz you've been talking a lot about Overwatch too I installed it 2 days ago and I was about to play it yesterday and Paul was like let's watch a movie I was like sure it's called Overwatch and she's like is this this movie has no story and I wanted to play it today but I'll be editing doing videos and making a show with me bu",
            "start": 1070.4
        },
        {
            "text": "Let's watch a movie. I was like, \"Sure it's called Overwatch\" and she's like, \"Is this movie has no story.\" And I wanted to play it today but I'll be editing doing videos and making a show with me by Pizza. Well that was the video and then going to the movies so what movie May tonight we're going to go see Swiss Army Man. Mhm Kevin. I have a big date night planned, that sounds that sounds fun.\n\nI corrected the following:\n\n* \"OverWatch\" to \"Overwatch\", capitalizing it as it's a proper noun (a popular video game title)\n* \"Pizza\" to \"by Pizza\", assuming it was a typo and meant to be \"with me by Pizza\"\n* Left other minor errors, such as typos or grammatical mistakes, intact as per the instructions.",
            "start": 1112.96
        }
    ]
}