{
    "id": 1897,
    "video_id": "LdQTLcBzQGA",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "All The Games Coming Out Next Year - Kinda Funny Gamescast Ep. 75 (Pt. 3)",
    "description": "What games are coming in 2017, and which do we think will get delayed?\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1467810001,
    "duration": 678,
    "transcript_chunks": [
        {
            "text": "All right, next topic let's talk about the games coming out next year 2017. Yeah, I'm happy that in 2016 there's not too many that we think you're going to get delayed, cuz most of them already did. Sure, so that's why you can but at least most got delayed have release dates, so that's good. Like actual numbers, yeah it's not just uh it's going to come at some point, you know. I'll be interested to see what all you put on this list we'll see. Um, Scalebound is coming out when got that down for just next year. There's not a actual this is backwards now uh so Scalebound SE a Thieves Crackdown three, Crackdown three, yes really you're a Crackdown fan, yeah I like one quite a bit. SE of Thieves is interesting because so many people seem to be very very very high on it after E3, like it won a bunch of rewards and a bunch of stuff and like I I was telling you that was to me the low point of any of the the conference I was like this is garbage playing it had a lot of fun entirely.",
            "start": 0.31
        },
        {
            "text": "it won a bunch of rewards and a bunch of stuff and like I I was telling you that was to me the low point of any of the the conference I was like this is garbage playing it had a lot of fun entirely attribute it to the setup that we had the people around us so um I think that people are going to be a little upset about that The Witcher 3: Wild Hunt's Whispers evolve but will you listen I won't thank you wait for I will I'm already sold um Detroit: Become Human at some point **** yes but I do think that could get to L which is funny because I thought it might my prediction was they'd give a date and it would be this fall and then when they didn't and they gave another character I was like oh right you're I forgot of course you guys are very ambitious I could see this being Death Stranding mhm Crash Bandicoot N. Sane Trilogy remastered I am so excited I don't think that'll get delayed but doesn't have a date yet next year is the is when they're targeting so that'll be fine Overkill's The Walking Dead oh right that's a thing",
            "start": 51.16
        },
        {
            "text": "I am so excited, I don't think that'll get delayed, but doesn't have a date yet. Next year is the target, so that'll be fine. Overkill's The Walking Dead - oh right, that's a thing. **** That's been God, I forgot all about that game. We had a conversation about that, jeez, years ago now. We were at IGN though, right? Yeah, Jesus, all right, yeah. And they made the weird thing where it was a VR game, right? Isn't that what they did? Isn't it just on one of the VRS? Oh, is it? I-I don't even remember. I'm going to drill into that 'cause once they said that, I kind of stopped paying attention to it because I was like, all right, see you later. Then there's... I don't know how to say this, but near Automata - autom autom. Have you seen this? **** Yeah, it looks **** awesome. Yeah, it looks cool. Um, Star Ocean looked cool too. So I'm so skeptical about about this game, but uh, Platinum's making it, I think. So I'm also skeptical about it. Uh, I-I'm going to look into that as well 'cause I think near is being made by",
            "start": 94.28
        },
        {
            "text": "cool too so I'm so I'm skeptical about this game but uh Platinum's making it I think so I'm also skeptical about it uh I I'm going to look into that as well cuz I think Near is being made by Platinum the original Near is like a cult classic though I don't know if you played it but it's it's it's a it was a cool game I played it for like 10 hours maybe um weird is how I would describe it this one looks cool it's giving me Anima Vibe yeah it looks cool I mean the Anima Vibe are coming from what the **** that game called uh Apotheosis the Technomancer game Neo: The World Ends with You right that's where the **** but see that that's a little PL making the game that one it's that's Onin mixed with the stuff I'm just like looks **** awesome it does look **** cool uh Resident Evil 7 stoked January 24th I hope ITR psvr January 27th is the release date M delayed sorry what delayed I don't think so I think I think it was delayed out of October is my theory and I apologize apparently Overkill The",
            "start": 139.8
        },
        {
            "text": "24th I hope it's PSVR January 27th is the release date, not delayed. Sorry, what delayed? I don't think so. I think I think it was delayed out of October, that's my theory, and I apologize. Apparently Overkill's The Walking Dead is on PC, Xbox One, and PS4. Cool, no platforms have announced yet for the VR experience. All right guys, Sniper Ghost Warrior 3 is coming January 27th. Didn't you play that? No, I played Sniper Elite 4, and I'm **** stoked by that game, by the way. I had never played Sniper Elite; I was like this is **** dope. I was like this is this is really cool. Rebellion is doing their thing over there. I had no idea. The thing about it is they had reached out to us ahead of time, uh, before E3, like we want to set up demos for you, and I was like, \"And they're like,\" oh actually, it was that they wanted to talk to them, they wanted to talk to us about maybe one day doing the Patreon sponsorship. So if they ever pop up, great. They didn't, so this isn't a sponsored thing, so whatever, and then they were like, \"Do you know our games?\"",
            "start": 182.6
        },
        {
            "text": "talk to us about maybe one day doing the Patreon sponsorship so if they ever pop up great they didn't so this isn't a sponsored thing so whatever and then they were like do you know our games and I was like not really and they're like good this is Colin's your shooter guy and we are making Sniper Elite and this is a game we think would totally work for him it's a good shooter we feel like it's going to be our breakout shooter like people are going to play this and be like oh these guys are great at making shooters similar to like how you know The Witcher was a wake up call it's really neat now this is this is new to this is not new to people that played Sniper Elite I've just never played these games before people love this game um I was in a map uh it was in the 40s um somewhere I think in Germany I'm fighting Nazis at like they have a rail gun they're protecting a rail gun and you're slinking around it I mean I can imagine these games take for **** ever to play because you're",
            "start": 231.36
        },
        {
            "text": "in Germany I'm fighting Nazis at like they have a rail gun, they're protecting a rail gun and you're sneaking around it. I mean I can imagine these games take forever to play because you're sneaking around and just waiting and waiting and waiting. You're like a sniper, you've got to be stealthy and you've got a sidearm and all this kind of stuff but you don't want to be seen, they'll track you down and all this kind of stuff. I was like, \"this is cool\", I'm feeling this, I don't know if it's all going to be that good but I really was actually looking forward to it when I went to that appointment, I'm like, \"all right, let's get this over with\", didn't really know what to expect and then I was there, I was like, \"I wish I had more time to spend with this\", I had to go after about a half an hour but that was probably actually the game I went hands-on with, except for Horizon Zero Dawn, in terms of length, I was I was liking",
            "start": 263.76
        },
        {
            "text": "to spend with this I had to go after about a half an hour but that was probably actually the game I went hands on with the exception of Horizon Zero Dawn in terms of length I was I was I liked it Also, it comes to my attention now as I finger my Lego Dimensions Portal that you did not mention Lego Dimensions Year 2 in your 2016 stuff so **** you I didn't no **** you it wasn't on any list that I found last night because it's not a real game right it's like you know expansion packs and stuff so you don't that doesn't count to you fake gamer boy well The Division was on there plus with expansion Son of a **** and so is Destiny Fallout Understand these are toys the toys are the expansion of the game con understand they're toys yes 2017 I can't **** wait I could see it being delayed I hope it isn't but I could easily see it being delayed I hope it isn't but yeah playing that together Undead Labs yeah Undead Labs up in Seattle me and big Kev out there big slaying some",
            "start": 298.24
        },
        {
            "text": "delayed I hope it isn't but I could easily see it being delayed I hope it isn't but yeah playing that together Undead Labs, yeah Undead Labs up in Seattle me and big Kev out there big slaying some Zs for Honor February 14th ah that game just doesn't do it for me go get them people who like it Sniper Elite 4 speaking of that February 14th Happy Valentine's Day I'm all over it but the same day Persona 5 can't wait Halo Wars 2 February 21st Ghost Recon: Wildlands March 7th another me and big Kev dog we got to **** get on that there I'm G play by myself I know you are yeah but we're going to force you to do a let's play with all of us and it's going to be a lot of fun you're going to have so much fun you'll come play with us yeah it's I know and then it'll be well then Nick say he'll play it but it'll really end up be us three and Fran who play all the time cuz Nick won't play his wife won't let him Tekken 7 early 27 on PC and PS4 in 2017 granted I just did the",
            "start": 336.96
        },
        {
            "text": "Say he'll play it but it'll really end up being us three and Fran who play all the time cuz Nick won't play his wife won't let him Tekken 7 early 27 on PC and PS4 in 2017. Granted, I just did the trading card thing and had to install so I stopped, but you can take your little sentiment there - you're going to play Wildlands with us once and you're never going to play into one of those cool little love notes from high school shove up right back into your P-hole. I'm not getting any of that back into your P-hole, Tim. I'm sorry, Nick's admitting that I am correct and that he won't play those games. Final Fantasy XII HD 2017 on PS4 - I'm going to play it if it comes out. I'm interested if it comes out on Vita too because they're all weird about that. Yeah, it won't happen. I don't think it will. Need for Speed there's going to be one coming in 2017. Is it based on the next movie? Star Wars Battlefront 2 2017 at some point. Mass Effect Andromeda early 2017 - yep, that'll be delayed for sure. Greg Miller, we got Tales of Berseria - I'm a Tales fan, yeah. Coming",
            "start": 382.52
        },
        {
            "text": "based on the next movie Star Wars: Battlefront 2 (2017) at some point Mass Effect: Andromeda early 2017 yep I that'll be delayed for sure Greg Miller we got Tales of Berseria I'm a Tales fan yeah coming you're excited about that what what excites you about Tales of Berseria the fact of it's just a different look for them this time what's happened is you start the game and your character Artesse has died and it it'll be a journey through hell to get back to the front of Heaven you're a **** Che out um f Fay early 2017 Days Gone just 2017 uh Injustice 2 (2017) that'll be fun Phantom Dust remaster actually box one 2017 I didn't know that was happening I didn't either I must have known that Death Stranding God of War Death Stranding mhm who said that oh there was on my list that ain't going to happen no death strand we God of War Spider-Man Spider-Man Spider-Man's not not Spider-Man's not coming out next year you don't think so no but that'd be awesome no it's not it's not coming",
            "start": 432.4
        },
        {
            "text": "going to happen no Death Stranding we God of War Spider-Man Spider-Man Spider-Man's not not Spider-Man's not coming out next year you don't think so no but that'd be awesome no it's not it's not coming out next year that's upsetting you believe God of War hits yes Days Gone hits yes okay one of them is definitely going to hit I think anything God of Wars 2018 Fallout 4 VR Doom VR Quake Champions Doom pre Fallout 4 VR do you think pre happens 2017 H yeah game's been in development for three years by that time before at Arcane Austin so yeah I do I do believe so but that's need games next year ukulele I'm excited about Horizon Zero Dawn February 28th y um Legend of Zelda Breath of the Wild along the NX gonna give it to every a whole bunch of NX games so we'll see that's what that is what I'm looking forward to most in 2017 now is Nintendo's announcement of the NX it's coming that'll be in 2016 yeah I know this year this year we're going to get some event and it's going to blow",
            "start": 489.16
        },
        {
            "text": "what I'm looking forward to most in 2017 now is Nintendo's announcement of the NX - it's coming that'll be in 2017 yeah I know this year this year we're going to get some event and it's going to blow everything out there's reports yesterday about them looking into VR but not wanting to see anything because they didn't want to show their hand at E3 **** yeah love that **** they're looking into it all right I know whatever check out what the hell it is they're all putting on Virtual Boy back then home whatever I feel pretty good Moto has a virtual boy rubber band to his head please stop I can't see ladies and gentlemen this topic has been brought to you by Squarespace whether you need a landing page a beautiful Gallery a professional blog or an online store it's all included with your Squarespace website let me tell you through the product spe let me run you through the product features Craig do it man I'm right here me I was thinking about getting por a website good cuz it's easy",
            "start": 545.4
        },
        {
            "text": "Squarespace website let me tell you through the product spe, let me run you through the product features. Craig, do it man, I'm right here. Me, I was thinking about getting a website good cuz it's easy creating a website with Squarespace is a simple intuitive process. You can add and arrange your content features with the click of a mouse or if you're using a laptop, weird little trackpad thing, it'll work on a Mac, it won't work on the Origin PCs. We use it's fine; they work fine. Tim is just a big baby. Free custom domain, Squarespace makes adding a domain to your site simple if you sign up for a year, you'll receive a custom domain for free for a year. Guess what I have, TimGettys.com? How dope is that? Guess what Nick Scarpino doesn't have, NickScarpino.com? He doesn't cuz he doesn't play video games; he doesn't know how to play video games. He does have NickScarpinoDonnet so beautiful templates you can design a best-in-class online store with Squarespace award-winning templates, customizable settings, and more all",
            "start": 585.8
        },
        {
            "text": "how to play video games he does have Nick Searcy so beautiful templates you can design a best-in-class online store with Squarespace award-winning templates customizable settings and more all sing plug can all go **** yourself wow Nick Nick's angry but he does have stay where he's at he's cool thank you shove yourselves up each other okay start your free trial today at squarespace.com and enter a code kinda funny to get 10% off your first purchase whole bunch of other brands and websites have used Squarespace to make their websites work and beautiful and all that stuff Squarespace set your website apart beautiful nice yeah Gotta Have It great Gotta Have It that was for you thank you",
            "start": 625.48
        }
    ]
}