{
    "id": 1889,
    "video_id": "mOqeRfsIkRM",
    "show_name": "Animated",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty",
        "Zacq Wenzel"
    ],
    "title": "100 Bears Attack San Francisco - Kinda Funny Doodles",
    "description": "New episode of Kinda Funny Doodles every Friday!\n\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nAnimated by Zacq Wenzel",
    "published_at": 1467388804,
    "duration": 151,
    "transcript_chunks": [
        {
            "text": "so what I've been saying lately is that I don't like bad guys everybody knows this right I'm saying I'd have to tip my hat I i' I'd respect them a little bit if any of these people did it with a bit of panache they did it with a bit of theatricality right I the idea of the how come there has never been a villain that takes over all the TVs and like all the feeds right that's actually it turns out that's really hard to do but again I would respect it I would respect it so much if we were all out to lunch and we're chilling and all of our phones turn on is like hello it's me the K B I'm going here's why here's why you came out and we were like I would really admire a super villain who just dropped a hundred Bears into the middle of San Francisco I did say that originally I said what I wanted to do was have a semi truck yeah and then have the back of the semi filled with the Bears and they parked there and then yeah we all hit the button and it goes and the sides fall down in every one",
            "start": 0.28
        },
        {
            "text": "To do was have a semi truck, yeah, and then have the back of the semi filled with the Bears, and they parked there. Then, yeah, we all hit the button, and it goes, and the sides fall down in every one of these, and these Bears just pour out. That's like visually cool; there's no way that doesn't happen. It's gonna take time to figure out our plan. I say we Dumbo drop them. You air-drop I say we air-drop 100 Bears. Don't get me wrong, that Air Force One is also a **** awesome image. We have to have three like one big one, another big one, and then one small one that we make and spray paint them all, and then put the big white spot on their tummy. That way, these ones come out. People like the Care Bears are killing people. We have to make one look like Yogi, one looks like Boo-Boo. We got a **** Poo Bear coming out. Paddington Bear is the general G Commander General Paddington Bear rides on the back of another bear, an even bigger bear, that's and that's what that's what the goal we're",
            "start": 46.2
        },
        {
            "text": "poo bear coming out Paddington Bear is the general Commander General Paddington Bear rides on the back of another bear an even bigger bear that's and that's what that's what the goal we're driving at right you know what I mean cuz again Obama would come on and be like state of emergency in California we're sending in the US Army and he's like I this is deplorable we won't deal with terrorists like this but I got to respect them how do you how did they get a 100 bears there Force One there Force hoha there Force once yeah",
            "start": 89.28
        }
    ]
}