{
    "id": 1892,
    "video_id": "pZcxEZ6YFzQ",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "What Does \"AAA Game\" Mean in 2016? - Kinda Funny Gamescast Ep. 75 (Pt. 1)",
    "description": "What does AAA mean in the modern gaming landscape?\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1467633603,
    "duration": 2009,
    "transcript_chunks": [
        {
            "text": "What's up, guys? Welcome to the first ever episode 75. That's a real thing, guys. We're hitting it. We're like 25 away from 100. That's how that works. Congratulations, Tim. Episode of the Kinda Funny Gamescast. As always, I'm Tim Gettys, joined by the coolest dudes in video games, Colin Moriarty, and Greg Miller. Hey, that's me. Can you believe this 33-year-old man is single? Now, what I've done, ladies and gentlemen, is I've decided it's time to close up the Lego Dimensions Portal. It's looked bare bones too long. So, I bought this Lego superheroes. And you opened it. You opened it like classic Greg unboxing fashion. Hey, you know what? I got to get inside of the box. I don't care about the case. This is not okay, Greg. I'm okay with ripping it open. I don't physically understand how this happens. Some of the This was bought at VidCon. down at Disney. So, some of the smush is from the bag. The bag had it smushed and then it's got this little tear away thing",
            "start": 0.31
        },
        {
            "text": "understand how this happens. Some of the This was bought at VidCon down at Disney. So, some of the smush is from the bag. The bag had it smushed and then it's got this little tear-away thing here. You pop in and you pull open. So, imagine the box. Yes. I wouldn't have torn it up like this. I wouldn't have torn through it. But it just happened that way cuz the box is already weakened. It outer structure had been weakened by my luggage and it trip from VidCon to here. Yeah. But I mean like that that looks like something that Kevin would do. But not even like Kevin wouldn't even do that type of damage to the DC Comics. His hands don't have his hands don't have the growth. They don't have the pull. They don't have the power. They got the Kevin's hands got some pole, Greg. Look at them. They're tiny. You put those hands in. Anyway, so what I'm doing is I bought this not to build the Batman v Superman playset that it comes with, but instead to get the bat uh the bat signal and put it",
            "start": 53.44
        },
        {
            "text": "They're tiny. You put those hands in. Anyway, so what I'm doing is I bought this not to build the Batman v Superman playset that it comes with, but instead to get the bat uh the Bat-Signal and put it onto my Portal. Got it. So now I'm building out that portion of the of the thing to How did you feel about the Lego Dimensions section at the Lego store? Piss poor. really an embarrassment honestly that there wasn't more there. Same thing with the superhero section. There just wasn't enough. They had all they have all these generic guys and all this generic Lego crap nobody wants. But where was all the superhero stuff? Where was all the Dimensions of you know what I mean? Like they needed more for sure. I couldn't even get every Dimensions character. You should be able to get every Dimensions thing there. Period. We went to Target last night. Me and Kevin. Sure. You guys go you guys go there a lot. We do. And we we ventured through the toy section as we do. We ventured through the video",
            "start": 91.68
        },
        {
            "text": "Thing there. Period. We went to Target last night. Me and Greg. Sure. You guys go you guys go there a lot. We do. And we we ventured through the toy section as we do. We ventured through the video game section as we do. One of the moments I knew I was special to is when you brought me the LEGO Ninjago characters for Lego Dimension. It meant a lot to me. And there was there was a whole bunch of uh a whole bunch of that **** There's new fun packs. There's Bane. Greg was this close to getting you Bane. I got Bane. Good thing you didn't get them. Yeah. Thank you, man. Don't worry about it. I got I got all the DC characters, Ghostbusters characters, Doctor Who character. They did have quite the Lego Dimensions thing though, which is what made me think that LEGO needs to set their game. And that's why like I understand you're a little you're a little LEGO story. You don't have, you know, room for everything Lego Dimensions because it's such a smash hit. So anyway, so now you're building. I",
            "start": 128.96
        },
        {
            "text": "why like I understand you're a little you're a little Lego story. You don't have, you know, room for everything Lego Dimensions because it's such a smash hit. So anyway, so now you're building. I appreciate that. That's the fun of it though. I do like and appreciate that you can kind of just make whatever the hell you want on top of this thing. Yeah. Yeah. Yeah. I'm I'm having to come up with on the fly here as a master builder cuz like they have the play set obviously builds the bat signal in a different fashion than what I'm going to be available to. So I think I figured it out what I'm going to do. I'm going to do this. Okay. And now I can put that anywhere I want on the portal. I'm proud of you. And of course, I'm I've I was foolish to wait this long because now the story pack that will come out in September is the Ghostbusters story pack that has a new shelf for the portal itself. But will I like the movie enough to represent the new movie? Who knows? No, that's the prediction.",
            "start": 163.28
        },
        {
            "text": "What Does \"AAA Game\" Mean in 2016? - Kinda Funny Gamescast Ep. 75 (Pt. 1)\n\ncome out in September is the Ghostbusters story pack that has a new shelf for the portal itself. But will I like the movie enough to represent the new movie? Who knows? No, that's the prediction. The answer is absolutely not. Ladies and gentlemen, this is the Kinda Funny Gamescast. Every week we get together to talk about video games and all the things that we love. You can get it early at patreon.com/kindafunnygames. If you throw money our way, you'll get the goodies. As Greg likes to say. You like to say that if you want it for free, you can stay right here on youtube.com/kindafunnygames and make sure you subscribe cuz YouTube decided to do this whole purge thing. Get rid of a whole We hit the 200k. We celebrated now we're back to 194. So, let's get back to 200k so we can celebrate. It's a good thing the purge. The purge is a bad thing. I tweeted about that because why would you I mean assuming it works and it doesn't seem like it worked because it seems like some people that like",
            "start": 195.84
        },
        {
            "text": "a good thing The Purge. The Purge is a bad thing. I tweeted about that because why would you I mean assuming it works and it doesn't seem like it worked because it seems like some people who were already Yeah. losing their sub subscriptions or like why why why would you want fake numbers? I would rather have the real amount of people that are actually watching us. But I was saying they were eliminating people who I'm more upset that people who wanted to stay subscribed got right. But I'm saying in theory The Purge in theory The Purge is a great idea. Yeah, exactly. They're on number three. I know that's crazy. Uh but I I think that the the number I'm just upset because more numbers just means more for everything. I want the views to be accurate. I don't give a **** about subscribers. Give us 10 million. People think we're bigger than we are. That's our whole stick. Twitter um do the same thing. I was saying I tweeted out yesterday, I'd love to see Twitter erase all the old",
            "start": 232.96
        },
        {
            "text": "Give us 10 million. People think we're bigger than we are. That's our whole stick. Twitter um do the same thing. I was saying I tweeted out yesterday, I'd love to see Twitter erase all the old accounts and inactive accounts and fake accounts and spam accounts to see what the numbers really are. You have there's little things you can do on Twitter to figure out like what your real account is. Um I don't know. I just think that it's because if if the vanity numbers all go away if everyone is hit. Yeah. So it doesn't matter, you know, then everyone loses their subscribers. Yeah. But it was funny to see those FunHouse idiots dip below a million again. Dude, that sucks. They lost like 60k. They're dorks. They they were lying. You know, KSI did it on purpose. I've seen there were some channels that lost like 300,000 people. I heard PewDiePie lost like 600,000 or something. That's insane. But but again, those are not real assuming Mhm. that it worked, but I think YouTube tweeted out something",
            "start": 268.64
        },
        {
            "text": "What does \"AAA game\" mean in 2016? - Kinda Funny Gamescast Ep. 75 (Pt. 1)\n\nlost like 300,000 people. I heard PewDiePie lost like 600,000 or something. That's insane. But but again, those are not real assuming Mhm. that it worked, but I think YouTube tweeted out something saying that they don't know what was happening. Yeah, they did say we are aware of the problem. Yep. So, yeah. Such a weird thing. Anyway, subscribe to us if you like us cuz that would make me happy. Also, the other channel, too. We didn't lose We only lost a thousand over there, but still a thousand people. That's chump change to Kinda Funny Prime. No, I like it. Kinda Funny Prime doesn't need anybody. It absolutely does. So guys, I want to talk to you about video games. I'd love to talk about video games. Uh Greg, we were at VidCon last week. We got these these beautiful Lego. Exactly. These big beautiful Legos. Big beautiful kids. Um and we we were on a panel about indie versus AAA. And I thought it was a pretty pretty good discussion. It was us. It was Boogie. Yeah. It was Ashley from",
            "start": 306.48
        },
        {
            "text": "big beautiful Legos. Big beautiful kids. Um and we were on a panel about indie versus AAA. And I thought it was a pretty good discussion. It was us. It was Boogie. Yeah. It was Ashley from Capcom. Ashley Escalera. I don't know how to pronounce her name. Escalera. You've heard me try to pronounce that. I think it's a Spanish surname. And then who else was on that panel? Oh, uh Lawrence from Capcom. He was late, so he doesn't count, but he was really late. I heard that's why they took away some of his subscribers cuz he was so late. They're like, \"Fuck you.\" Um Oh, you're right. Ashley Escalera. She's great. So, we talked about the whole thing of indie versus AAA and we've had this discussion on our show many times, but it was interesting kind of talking to guys that are a little bit more PC focused or um dork focused.",
            "start": 342.24
        },
        {
            "text": "the whole thing of indie versus AAA and we've had this discussion on our show many times, but it was interesting kind of talking to guys that are a little bit more PC focused or um dork focused. Dork focused and they just obviously had different opinions about the whole thing. But I kind of got me thinking about the idea of back in the day there was a clearly defined AAA double A shovelware licensed games ecosystem of everything kind of fits into these little buckets. Sure. What is the 2016 market share? like how does that break down and what are the categories that we can I mean I've talked about it at length on a million different shows and panels but they all run together right and the fact that I think the middle has fallen away and I but I do think it's making a comeback but basically the middle's fallen away and that was always going to be your THQ your licensed games your door of the explorer all these games that were shoveled out there and then also the games that",
            "start": 383.44
        },
        {
            "text": "but basically the middle's fallen away and that was always going to be your THQ, your licensed games, your Door of the Explorer, all these games that were shoveled out there, and then also the games that you now see as I'm saying they're coming back, Deep Silver putting out for some reason, your Homeworld: Revolution, your Mighty No. 9 games that are not AAA and are not indie are in this weird space in the middle where they're half-baked and it's weird. It's interesting to see the reaction of that middle tier coming back and what people think of it because it has for so long been there's AAAs and there's indies and that's what it's been when when you saw THQ fall with UDraw when you saw a bunch of other mid-tier publishers like that start clamping down and not putting out stuff and Capcom getting burned and not being able to put out their games that they thought were going to be AAAs, you saw this middle section dry up and that's where it's been and that's why",
            "start": 426.32
        },
        {
            "text": "getting burned and not being able to put out their games that they thought were going to be AAA, you saw this middle section dry up and that's where it's been. That's why when we got asked to be on that panel and it was like an Indie vs AAA fight, and it was like well I don't think one exists without the other anymore. I think if there's no Uncharted 4, if there's no marquee title, if there's no tentpole title, indie games aren't enough to move units and consoles and what then we're just left with these PC gamers. And then in the flip-flop of it, if indies fall away, are you excited? Are you reading about games every day if you're only getting six really great AAA titles a year spread out, delayed, all these other problems? It's this weird ecosystem right now. But you're starting to see all of a sudden people who have moved from being indie and that's the weird thing I hate on that panel we",
            "start": 462.32
        },
        {
            "text": "It's this weird. It's that's the ecosystem right now. But you're starting to see all of a sudden people who have moved from being indie like and Indies and that's the weird I hate on that panel we talked about it right that I hate even having this argument or this conversation anymore cuz what what are we really defining as indie is it that you are an independent game studio or is it that you are a small team making a game on your own and you're getting funding from PlayStation or is it because it's that the whole thing where like well Insomniac Games then is an independent game studio right but they're huge and they're awesome they have a whole bunch of different partnerships and how does that work and where does that go anymore? I mean, but you know, when you look across the different forms of media media, I think that that is true as well. Like when you look at music, like with rap music, Drake was independent for a long time just because he didn't have a label representing him",
            "start": 497.68
        },
        {
            "text": "forms of media media, I think that that is true as well. Like when you look at music, like with rap music, Drake was independent for a long time just because he didn't have a label representing him, but he had labels backing him, which was the difference. You look at us, we're independent, but in a lot of ways, it's like we get to kind of coexist with people that are very not independent. So, it's like we're kind of in that same place like we would be the equivalent to uh to any of those companies. Insomniac Games. No way. We're not We're not cool as Insomniac yet. Yet, Ted Price and Naughty Dog Games. **** yeah. God damn it. I hate Nick. I hate that he started this. I hate that Colin knows it annoys me. Uh, sorry. Let on that was annoying. So, we talk a lot of **** about PC gamers, but it's all in jest. And in seriousness, the PC ecosystem is typically always well ahead of the curve. And um, they're ahead of the curve obviously in power. Um they're ahead of the curve in many ways in advancements in technology",
            "start": 533.92
        },
        {
            "text": "in seriousness, the PC ecosystem is typically always well ahead of the curve. And um, they're ahead of the curve obviously in power. Um they're ahead of the curve in many ways in advancements in the way we play. Yeah. In the way we download and enjoy games like Steam. Um and so I think we can look to PC games uh for answers to both uh the things that that Greg had mentioned. PC gamers uh first of all I mean something we didn't mention PC gamers have been well ahead of the curve in the digital revolution. No one buys their PC games physically at all. I mean that's just not a thing that went away forever. and it happened so quietly that console gamers didn't even notice. And so like while console gamers continue to cling on to the idea that they're going to be buying games in stores in 10 or 20 years and are not. PC gamers already know that that's going to be the case um forever because they've they've they've grappled with that. So they were ahead of the curve there, right? They've been",
            "start": 576.24
        },
        {
            "text": "20 years and are not. PC gamers already know that that's going to be the case um forever because they've they've they've grappled on that. So they were ahead of the curve there, right? They've been ahead of the curve in terms of the way we ingest games in terms of like you know PSN and Xbox - PSN really was the thing on original Xbox and then Xbox 360 really advanced it and the way we have a marketplace and all those kinds of things but it was really Steam that taught us about how uh we download games easily about how we have easy discovery tools how we have things like forums and um help desk stuff uh tied into the system how we have different pricing structures and tiers and flash sales um wish lists all those kinds of things. So, they're ahead of the curve there. And I think they're ahead of the curve with the indie versus AAA thing because actually like a majority of uh PC gamers We have to take a time out everybody. Where were we? Sorry about that. So, I had to go help our landlord",
            "start": 618.64
        },
        {
            "text": "ahead of the curve with the indie versus AAA thing because actually like a majority of uh PC We have to take a time out everybody. Where were we? Sorry about that. So, I had to go help our landlord with his computer. Okay. So, I'm back. Yeah. Yes. So, what I was saying was that the PC to catch everything up though everyone just heard it, but I didn't. Is that uh PC gaming has been well ahead of the curve and I think they're now ahead of the curve in the indie space versus the AAA space. So, the AAA space um is well established on PC. It's been established in some form for 30 plus years on the PC space more than anywhere else. And um but I think that the exploration of price points that I was talking about on Steam, the accessibility of the games and the ease of buying games and the ease of developing these ecosystems in one unified kind of place and I'm not talking about on a PC or a Mac, I'm talking about on Steam, um has cultivated a place where there's a 99 cent game, there's a",
            "start": 657.84
        },
        {
            "text": "of developing these ecosystems in one unified kind of place and I'm not talking about on a PC or a Mac, I'm talking about on Steam, um has cultivated a place where there's a 99 cent game, there's a free game, there's a $5 game, there's a $10 game, there's a $20 game, $50 game, and these are all what we would classify as indie games. Um, so I think that the PC has just been well ahead of the curve and I think we're going to start seeing that and have been seeing that seep into the console space. Um, and to Greg's point, um, I think that what's interesting is that publishers are starting to explore not the indie kind of they're not indie by nature. Um, but they're but they're independent. They're exploring more independent pricing schemes. Sure. An example is Square Enix just released Adventures of Mana on Vita. Been playing it. It's fun. It's a little vanilla, but it's fun. Uh, and they're charging like 12 bucks for it. Uh Sony releases Ratchet and Clank for $40 brand new",
            "start": 698.48
        },
        {
            "text": "Adventures of Mana Surprise on Vita. Been playing it. It's fun. It's a little vanilla, but it's fun. Uh, and they're charging like 12 bucks for it. Uh Sony releases Ratchet and Clank for $40 brand new right out of the gate. Um ReCore by Microsoft is going to be 40 bucks. Um we use my number nine $30. My number nine $30 retail I think $20 digitally. Um EA puts out Unravel. It's cheaper. Right. Exactly. So everyone's kind of exploring these spaces and then we see Sony San Diego exploring with the free-to-play or games as service model. So I think you're seeing a lot of this space. So I think that the walls between AAA and indie are kind of dissolving. Not necessarily in terms of quality because we know what AAA game when we see it in terms of quality. And I think that's what we're talking about mostly. Uh cuz like a game like Ukelele for instance, which is totally independent, independently funded, could be a AAA 3D platformer. So like I don't I I don't know that that word has kind of lost",
            "start": 733.44
        },
        {
            "text": "What Does \"AAA Game\" Mean in 2016? - Kinda Funny Gamescast Ep. 75 (Pt. 1)\n\nmostly. Uh cuz like a game like Ukulele for instance, which is totally independent, independently funded, could be a AAA 3D platformer. So like I don't I I don't know that that word has kind of lost its meaning. So that that's kind of what I wanted to to ask you guys about is so obviously indie AAA we have ideas in our head of what that means. But what is double A? Is that still a thing? Is A still a thing? Cuz I I remember two generations ago it very much was. Like when you look at specifically I think Nintendo is easy to look at because they have so many franchises to themselves. You can kind of delineate which is which right? You have the Zeldas and the Marios that are the AAA's. You go down to the the Mario or the Metroid and the the Star Foxes, right? And it starts going down the Donkey Kongs. Mario Kart would also be AAA. Mario Golf triple A quadriple. That's the thing is like on on Game Over Greggy which is coming out this week for you guys. Uh, one of the topics was the",
            "start": 770.32
        },
        {
            "text": "Mario Kart would also be AAA. Mario Golf triple **** A quadriple. That's the thing is like on on Game of Greggy which is coming out this week for you guys. Uh, one of the topics was the rating system of movies where it's like PG-13. They had to make that PG-13 to kind of explain the middle ground between the two. And I think like that is where the Mario golfs and stuff like that would fit. Sure. And I think that as you know, time has changed and have how games have evolved, a lot of the genres even have changed from that. So what 3D platformers, I'm not sure AAA 3D platformer can still exist anymore. Like I think that ukulele, no matter what went into it, I don't know if it would even qualify as AAA. Well, I think it's a it's a matter of it's a matter of scale in terms of the context of that particular genre. What I mean by that is uh I think Ratchet and Clank is a 3D platformer and it's currently an AAA game. So like I do, but it's sold at a $40 price point.",
            "start": 808.72
        },
        {
            "text": "of that particular genre. What I mean by that is uh I think Ratchet and Clank is a 3D platformer and it's currently an AAA game. So like I do, but it's sold at a $40 price point. So I don't think we can use necessarily the price point of the game to to say whether it's AAA or not. Homefront: The Revolution is a $60 game and that is in no way, shape or form a triple-A game. Not even **** close, you know? So, I think we have these two kind of competing things that we often use to kind of um we're conflating things and we all do it where we think a $60 game is like an indie game, the $20 game or the $30 game like Carnival Games on Wii was a was a **** sold like 10 million copies or something but it was a piece of shovelware. Um and then you have the indie space with the digital stuff. But what I we've talked about this a lot in the past where I think the pricing structure is not necessarily going to be commensurate to the to the quality of the game or vice",
            "start": 853.76
        },
        {
            "text": "with the digital stuff. But what I've talked about this a lot in the past where I think the pricing structure is not necessarily going to be commensurate with the quality of the game or vice versa because you have a lot of great free-to-play games that people enjoy. And then on the other side of the scale, and I do believe this, that uh a studio can one day get away with charging $100 for a game if it's so **** good and so AAA that it goes beyond a $60 game yet I don't think that the $60 price point that Uncharted 4 was at makes it any less of an AAA game. Uncharted 4 is about as about as AAA as it gets. So um so I think it's more complicated than that. The the good the good news though is that I think that to my point about kind of commenting about the PC space and the the kind of forward-looking nature of the PC space is that um we are going to just get we have a lot of stuff of exploration right now in that price point and in terms of exploring what indie A",
            "start": 894.08
        },
        {
            "text": "What does \"AAA Game\" mean in 2016? - Kinda Funny Gamescast Ep. 75 (Pt. 1)\n\nkind of forward-looking nature of the PC space is that um we are going to just get we have a der I think of of stuff of exploration right now in that price point and in terms of exploring what indie A and AAA mean. But in the PC space we don't have that. And so if if the past is any indication about how console gaming is catching up to PC gaming in those respects then I think we're going to get to that point as well. Um, and then I think that and then I think you have a a lesser delineation between uh indie and AAA. What is that huge PC game that was that's that was funded like something like $80 million or something like that. You know what I'm talking about? The off um like it's it's like in I wish people I wish I can remember what what his name Star Citizen. Yeah, something like that. Like some game that's like that made by an independent studio with no publisher per se. I think it might be Star Citizen but is is is made for AAA budgets. There are triple massive triple games",
            "start": 929.52
        },
        {
            "text": "That. Like some game that's like that made by an independent studio with no publisher per se. I think it might be Star Citizen but is it is made for AAA budgets. There are triple A games we love that were made for not even remotely that budget, but that's an independent game. So, so I guess that's kind of what I was thinking about is is it how much the funding goes into it like into the actual game? Is it the fact of how flagship it is for the the company making it? A game like Mario Maker, not that much money necessarily needs to be putting in to make that game, but it is that was Nintendo's flagship title that year. So, does that make it AAA? It's obviously not indie, you know, we we know that, but like where does that fall then? Is that where the A goes in? Is double A even still a thing? I think No, I think that I think that and I don't know if Greg agrees. I'm listening. But I think that Did you find the Kickstarter? Uh I'm trying. Star Citizen brought in $2.1",
            "start": 972.32
        },
        {
            "text": "A even still a thing? I think no, I think that I think that and I don't know if Greg agrees. I'm listening. But I think that Did you find the Kickstarter? Uh I'm trying. Star Citizen brought in $2.1 million. That's what I'm thinking of then. I think people don't like there's a constant rounds of funding. Like we like GameSpot kept writing about it every time it would reach like a new million dollar milestone. They wrote about like every week. Some PC game. Yeah, it was a PC. I don't remember what it I'm sure people know and they're probably going to **** talk about in the comments and it's great because I don't know what it is but I know you guys know what I'm talking about. It might not be 80 million. It might be 40 million or something but some extraordinary amount of money that these guys continue to collect as they create this game. I think per your point I don't know if Greg agrees is that you can't like Rocket League is was made for $2 million um which is nothing for to make a",
            "start": 1011.2
        },
        {
            "text": "guys continue to collect as they create this game. I think per your point I don't know if Greg agrees is that you can't like Rocket League is was made for $2 million um which is nothing for to make a game for and has made 60 times it its amount spent in profit um or I guess gross revenue not necessarily profit. And I feel like that I feel like Rocket League is a AAA game, you know, like it was made by a small studio on the side. Um, and it's easy to understand and it's bite-sized, but it's not what we would also look at as an indie game because it has such a huge reach and so much popularity that I think things start to get blurred where you're like, it's because of, in other words, you have to judge it based on like a bunch of criteria as opposed to just one. If you looked at if you looked at Rocket League, it was made for $2 million on the side by an independent studio that does contract work for other people, which is what they usually did at Psyonix, then you say, \"Yeah, it's an",
            "start": 1042.4
        },
        {
            "text": "at Rocket League, it was made for $2 million on the side by an independent studio that does contract work for other people, which is what they usually did at Psyonix, then you say, \"Yeah, it's an independent game.\" In that respect, it is. Its popularity is in no way, shape, or form independent. That's like when a music musician or a band, an indie rock band becomes a huge band. Well, you're not independent anymore. You know, you are independent if you don't have a label by definition. But if you have a platinum record, I don't know how independent you are anymore because that's not what we mean when we say independent. What we mean by that in the music scene is it's indie. We know what you and I know what indie music is. So I think it's what I'm saying is that I don't think there are a lot of definitions. That's the problem, I think honestly I I don't look at I don't look at Rocket League and say it's a AAA game, but in the same breath, yeah",
            "start": 1088.72
        },
        {
            "text": "That I don't think there are a lot of definitions. That's the problem is I think honestly I I don't look at I don't look at Rocket League and say it's a AAA game, but in the same breath, yeah, you're right. It's an indie game and I'd never really bring them up. It's the fact that we're trying to turn around and use the ancient terminology. And I say ancient meaning that you know 8 years ago, nine years ago when I started at IGN, I remember the E3 meetings where we went in there and Dunham had a spreadsheet and it we went through all the games and we labeled them AAA, double A, B-C, like to so you knew the importance of them and where they fell. And I don't know if we're trying to apply that now in a world that doesn't it doesn't matter in the same way. When you say this is a great indie game, you mean this is a great game made by a very small studio usually. You know what I mean? And that's why it gets so weird when people are like, \"Yeah, indie games like No Man's Sky.\" And it's",
            "start": 1123.04
        },
        {
            "text": "game, you mean this is a great game made by a very small studio usually. You know what I mean? And that's why it gets so weird when people are like, \"Yeah, indie games like No Man's Sky.\" And it's like, \"Well, it's kind of sort of PlayStation's helping.\" Well, oh, indie games like this thing that are being kickstarted that's being supported by PlayStation or this indie game that's only being published on Xbox. It's like, well, then they're second party and then how does that what there's no it's all murky now. Everything's mixed in there. You don't say, \"Man, Ratchet Clank was a great indie game because it was made by an indie studio.\" No. And Sony owns the IP and D. Yeah. I mean, well, going back to what I was saying, I think Ratchet and Clank would be the the solid A title in what in 2016 what that actually means where it's like it it has the the polish of a AAA game, but the scope isn't there. I think that's kind of the the big thing where using the word indie, you're right. It's",
            "start": 1160.56
        },
        {
            "text": "what that actually means where it's like it has the polish of a AAA Game, but the scope isn't there. I think that's kind of the big thing where using the word indie, you're right. It's like there's the actual definition of it, but then there's how people use it. And we specifically when it comes to indie games now, like that thing is you can use that in 10 different ways, but does it feel like an indie game? Is it an indie game? Those are different questions, you know. Um, like thinking back again to the other eras when Nintendo would charge $40 for a first party game, $50 for third party, you know, on Game Boy Advance it would be $30 for their games and $40 for the other ones. And that the price points almost didn't matter cuz when F-Zero came out, F-Zero was not a AAA Game. It had the polish. It had all the other things of it, but no one expected that game to sell super well. It didn't, but people love it and it still kind of fit that that groove where now we we",
            "start": 1196.4
        },
        {
            "text": "It had the polish. It had all the other things of it, but no one expected that game to sell super well. It didn't, but people love it and it still kind of fits that groove where now we just don't even have that. Star Fox Zero is the closest thing and it doesn't have the polish that the other games do. And that's because games are costing way more money now to make. Yeah. I think there are a lot of complicating issues about, you know, when you look at it historically about trying to talk about pricing in the cartridge era because pricing, for instance, in the cartridge era, was based on the size of the chip. Um, so you got NES games for $30 or $40 and you got NES games for $60 or $70. They got more pronounced on Genesis and Super Nintendo when you had games for $40, you had games for $100. Um, and which is why I always say games are so much cheaper than they were when we were kids because they are. And not when I was a kid",
            "start": 1242.0
        },
        {
            "text": "you had games for $40, you had games for $100. Um, and uh, which is why I always say games are so much cheaper than they are they were when we were kids cuz they are. And not not when I was a kid though. I think that's the difference is once we got into the the GameCube era, like the games were cheaper. They're way cheaper than they are. Well, they're $50 I mean an AAA game, right? But even at a even a $40 game in 2002 is cheaper than a $60 game today. based on inflation. So that's the whole so that's the whole that's the whole argument. But there's complications like um about pricing at retail and why retail I think holds the whole structure back is also because um uh GameStop for instance I don't know the exact numbers but GameStop like GameStop's margin is is really low on new games. They probably pay something like $47 or something something like $49 for every game. So they're charging in $60 for it but they're also have to pay their vendors and all these kind of things.",
            "start": 1280.0
        },
        {
            "text": "They probably pay something like $47 or something, something like $49 for every game. So they're charging in $60 for it but they're also have to pay their vendors and all these kind of things. So they're making like a very small sliver of money. It reminds me of a it's a a weird comparison, but there's a great book I like called The Great A&P, which is about the history of the supermarket and they talk about like how these companies exist on like razor thin margins and so there's no like supermarkets exist on something like 4% margin, which is insane. Like so there's no room for error. Um so like they'll buy a roll of toilet paper for 50 cents and charge you 55 cents for it. Like they're making like just little rips of money and they want to do volume. Um the game I think there's I think at retail there's they're held back because of these kind of Byzantine what seem like Byzantine rules uh in terms of what you're paying for the game up front and then what you can charge for it on the back",
            "start": 1322.0
        },
        {
            "text": "there's they're held back because of these kind of Byzantine what seem like Byzantine rules uh in terms of what you're paying for the game up front and then what you can charge for it on the back end. So there's like less there's less movement there because I don't think there can be and I would not be surprised if retail games were charging as they already do in Canada although money is different $70 for a retail game um just to get more of a margin out there but I also think that that would um hasten their demise as well. Um, so I think that a lot of the space is going to be explored not only with indie and AAA games and all these kinds of things uh with game types and pricing. Uh, it's all going to be explored uh digitally because then I think that gives people more room to take risks. There are few publishers to pay out. Um, and the 70/30 split that Sony has or Microsoft has with their publisher partners um for any game whether it's a dollar",
            "start": 1359.36
        },
        {
            "text": "gives people more room to take risks. There are few publishers to pay out. Um, and the 70/30 split that Sony has or Microsoft has with their publisher partners um for any game whether it's a dollar, whether it's $60 on digital is just easier for them to wrap their heads around. And that's what you're talking about, right? That's why, you know, as much as we give PC credit, it is a superior platform and a superior place. For years, that has been happening. It has been that way that like when we're when we first, you know, launched and started doing let's plays, we immediately did Stick Shift or whatever the game was where you're jacking off a car and it's like that's awesome and that exists because yeah, they can get that and they can put it up and they can get it on PC and cut through all this Now, it runs the risk of course like the app store where it's so accessible there's so much garbage on it then you can't find what you are. Yeah. Yeah. Don't get me",
            "start": 1393.44
        },
        {
            "text": "get cut through all this nonsense Now, it runs the risk of course like the app store where it's so accessible there's so much garbage on it then you can't find what you're looking for. Yeah. Yeah. Don't get me wrong, Steam is a pile of **** at the same time that it's a beacon of hope and freedom for gamers. Exactly. Pros and cons. Pros and cons. Like it really is worth noting what Greg said because I think it's really true is that the limited nature of console ecosystems is advantageous for game discovery with a more quality-oriented slant. That's not to say that everything's quality oriented. As we say on PS, I love you a lot. 90% of what's released on the PSN probably could go unnoticed ever. Like and then you have like a real game I would love if PSN literally released five or six games a month, you know, and we're just like these are the games and we literally stand behind all of these games, but they give you choice and all that kind of",
            "start": 1431.36
        },
        {
            "text": "if PSN literally released five or six games a month, you know, and we're just like these are the games and we literally stand behind all of these games, but they give you choice and all that kind of stuff. Steam is so open like iOS and like Android that there's no dearth of **** nonsense and garbage on there and people taking advantage of things and just straight copying games and early access and greenlight. It's a little bit of a mess, too. It's not all good. You can get in there, you can cut your teeth, you can make a game, and then you can turn around and make another game. You get to make a name for yourself like Steve Gaynor did with Gone Home where it's like, \"Okay, great.\" And then that gets to all these other platforms, but for Tacoma, it gives him a chance to get it on consoles at the jump. You can go out and be that indie studio you think of on PC and then become that mid-tier studio that nobody thinks of as AAA, but nobody thinks of as indie anymore",
            "start": 1468.72
        },
        {
            "text": "get it on consoles at the jump. You can go out and be that indie studio you think of on PC and then become that mid-tier studio that nobody thinks of as AAA, but nobody thinks of as indie anymore and be this, you know, make the games you want to and grow and, you know, change. And that's where it's gotten so awkward in terms of this terminology is the fact that yeah, there's these indie studios, but when we talked about indie studios, we did mean people in their garage, but they hit. Not all of them obviously, tons of them closed, but some hit and then they become like us where it's like we're moving out of a spare bedroom into a studio and da da da. And then it's like what you're talking about. Where are we in that discussion anymore of what exactly it is? Yeah. Yeah. And then there's I think new terminology that we kind of have to add to it. Free-to-play I think is a totally different section as is competitive multiplayer gaming you know I think those games like from a price",
            "start": 1502.48
        },
        {
            "text": "I think new terminology that we kinda have to add to it. Free-to-play I think is a totally different section as is competitive multiplayer gaming you know I think those games like from a price structure standpoint are kind of on their own you know and then from there they categorize each or or um indie of each. Yeah. You start getting into sub-genres. Exactly. But I think that those qualify enough to be their own genres and in a lot of ways eliminate the shovelware that we used to have. Shovelware is now fallen into the free-to-play. It has fallen into the app store. Yeah. There's no room for there's no room for shovelware anymore just in by the nature of a savvier consumer with more information um is going to make fewer poor choices and I think that's kind of the way you're seeing it now. So not that Carnival Games is a Carnival Games is the ultimate example. For people that don't know what that is, you should go",
            "start": 1541.52
        },
        {
            "text": "Poor choices and I think that's kind of the way you're seeing it now. So not that Carnival Games is a Carnival Games is the ultimate example. For people that don't know what that is, you should go look it up. Carnival Games was a Wii game, one of the best-selling Wii games. And it wasn't bad, but that was quintessential shovelware. That was an afterthought at the register. It was a cheaper game. It was just silly. It was it was stupid. It took advantage of what we did. Mhm. Um I but I agree with you. Free-to-play games as a service, games as a platform. Um which I'm surprised we're not seeing more of yet from big developers. I I think that we are. You know, we often talk about how the open world thing, we're seeing a bunch of open world games and reaction to to whatever. It's only been the last couple years that people like us have been talking about, oh, games should be platforms, blah blah blah. We're seeing that Street Fighter 5, right? Going people, you know, hesitant to it and",
            "start": 1579.36
        },
        {
            "text": "the last couple years that people like us have been talking about, oh, games should be platforms, blah blah blah. We're seeing that Street Fighter V, right? Going people, you know, hesitant to it and there's a lot of issues with it, but that's where you kind of roll through figuring it out where in a couple years I think we're gonna see that a lot more. Sure. Although in Capcom's defense, and I don't really want to say that way, I don't think that that was their intention with Street Fighter V. I think that they were like under the gun to get that game out. So like I think if they could have had taken that back and had six more months, they probably would have the game would have looked really different. What I was surprised about, Tim, was when Gran Turismo Sport was announced that it's a real game. Like that was the one where I was like Sony's going to make this free and just have in perpetuity a 10 year, 15 year, 20 year Gran Turismo game where you literally where there are",
            "start": 1614.88
        },
        {
            "text": "it's a real game. Like that was the one where I was like Sony's going to make this free and just have in perpetuity a 10 year, 15 year, 20 year Gran Turismo game where you literally where there are literally in 10 years hundreds of tracks, thousands of cars, you buy them all as you want them. They can make I really do believe that that would be a huge risk for them to take. But I also believe um that and that's why I think that Sony San Diego is testing all this **** on things that people frankly don't really care that much about. Yeah. And I don't mean that in any disparaging way, but it's like Drawn to Death is a cool idea, but no one has any investment in that game compared to Gran Turismo. And then if these things work, and I'm not sure they're going to, but if they work, then you have a you have an opportunity to make you have to get the consumer ready for it cuz we talk about all the time, right, the whole the best platform, the one we always talk about, why isn't this",
            "start": 1644.16
        },
        {
            "text": "you have an opportunity to make you have to get the consumer ready for it cuz we talk about all the time, right, the whole best platform, the one we always talk about, why isn't this platform Madden, is NHL, is all these sports games. Buy the base platform and then yeah, every year the expansion pack comes out where you do buy it at a discounted rate. those updated rosters, this new stadium, this the new new engine or whatever it's going to be that's going to change it infinitely. But until you wrap your head around that as a consumer, why would you do that with your biggest titles? Yeah. The question there though is what's the pricing on that base install? You know, when for Street Fighter 5 or for things like Overwatch or what like so the competitive multiplayer games or these platform games, should they be budget priced to get people in to then like the idea is you're going to pay more over time. Yeah. Yeah. Yeah. cuz like right that is why",
            "start": 1678.24
        },
        {
            "text": "or these platform games, should they be budget priced to get people into them like the idea is you're going to pay more over time. Yeah. Yeah. Yeah. cuz like right that's why the mobile space works so well it's free or it's a dollar and then we'll get you through time, right? And I think that we still see it with games. Overwatch, I was shocked. I didn't know it was $60 on consoles. That's insane. Like that game should not be $60, you know, and uh Street Fighter 5, same thing. Like I I think that you know until there is that shift where game developers feel more comfortable at the $40 level or whatever consumers aren't going to be comfortable having these platforms and committing to them. I mean of course some are. I'm talking about as a whole. You figure your way around it if you're going to let's say we let's say we're just assuming consumers are there and we want to do Madden as a platform, right? You launch the",
            "start": 1712.24
        },
        {
            "text": "about as an overall whole. You figure your way around it if you're going to let's say we let's say we're just assuming consumers are there and we want to do Madden as a platform, right? You launch the platform for free with everything restricted pretty much except exhibition with two or three teams. That way people jump in like, \"Oh yeah, I do like Madden.\" And at the end of every game you're like, \"Do you want to unlock the full thing? Do you want to pay what? Maybe it's $50, maybe it's 45, whatever.\" With the promise of more content throughout it or the, you know, a video explaining that next year when Madden 20, whatever comes out, it'll be you can get the roster, you can do this as we go, you can pick up more stadiums. I don't know. Yeah. And this puts a lot of a lot of games in, I think, a really weird spot. Like games like Doom or Wolfenstein or Deus Ex even, right? like Dave Sex. It's a AAA game, but I think a lot of people don't think of it in the same way that we think of the",
            "start": 1756.08
        },
        {
            "text": "a really weird spot. Like games like Doom or Wolfenstein or Deus Ex even, right? like Dave Sex. It's a AAA game, but I think a lot of people don't think of it in the same way that we think of The Uncharted or games like that. So, it's like what where does that exist? Like, it's a $60 game and it needs to be because that game needs money to the same time like it kind of at least in my opinion, it feels weird for games like that to be the same exact price as a lot of these other things when I feel like they would if that was a $50 game, would it sell more? I don't know. Yeah. And this is where I think this is goes back to the digital thing is that I really do believe that if we had digital only pricing that publishers would take bigger risks and dares as in a companywide way and as I said before if EA was just like all of our games are 50 bucks now then what does that do to Activision and Ubisoft like where does that leave them? But they can't do that. Like they they just can't do that",
            "start": 1788.4
        },
        {
            "text": "if EA was just like all our games are 50 bucks now then what does that do to Activision and Ubisoft like where does that leave them? But they can't do that. Like they they just can't do that right now. That goes back to the Overwatch thing where I'm like, I really feel like Blizzard had to charge $60 for that game because on console, maybe not so much on PC, but on console, our perception is that if it's not $60, it's not worth your time or your like there are so many people out there who I think are frankly like acting very in a very ignorant fashion that just do not still do not touch games that are not on retail on a shelf for $60. And I think you're totally messing up by doing that. Um, you're also losing the battle. But for now, um, that, you know, like I I Blizzard probably would have loved to make that game free. But like I I they just can't because whereas the value proposition in the console space when we look at games that are free is garbage and a lot of",
            "start": 1833.44
        },
        {
            "text": "would have loved to make that game free. But like I I they just can't because whereas the value proposition in the console space when we look at games that are free is garbage and a lot of them are. So it's it's I think that's like a more of an optics issue than anything else because um they probably, you know, they probably had their debate internally about what they're going to do and they they realize that Lion's Share of their gamers are probably on PC, but then everything has to be equal. Yeah, it's just it's so much more complicated from a marketing perspective and from just a publisher-wide perspective than I think we give credit for. So, it's complicated. We're going to see an evolution of it, I think, pretty rapidly in the coming years. Um, and as and I really just can't wait to see these big publishers eventually start saying like we're not releasing our games at retail anymore or we're going to release them um in a limited fashion. Um, I was talking",
            "start": 1867.68
        },
        {
            "text": "just can't wait to see these big publishers eventually start saying we're not releasing our games at retail anymore or we're going to release them in a limited fashion. I was talking to my girlfriend yesterday about uh she likes to buy physical books. She likes to buy physical books, I buy my books on Kindle. I don't like to do that, but it's just practical, right? I'd rather have my books. And I was saying that I see a future for books similar to vinyl where in 10 years Stephen King writes a book and they're like we'll make 10,000 physical copies of the book and that's it and that's your limited edition and everything else is going to be available digitally and you're going to have no choice. Exactly. And so I think that I think you're going to see that more and more. And wouldn't it be interesting if Ubisoft in five years made another Assassin's Creed game and they're like it's digital so you're either going to buy it or you're not, you know.",
            "start": 1902.96
        },
        {
            "text": "and more. And wouldn't it be interesting if Ubisoft in five years made another Assassin's Creed game and they're like it's digital so you're either going to buy it or you're not, you know. And they still they're still on that razor's edge with the people they have to please at Amazon and the people they have to please at GameStop. And they just aren't ready to stab everyone in the back yet because once this happens, it creates a huge problem on the market for the people that you rely on to get your consoles and your other products out there. Sure. Get the system on the shelf. We've seen it like everybody is doing that with smaller titles little by little by little. And I think you know down the road Yeah. ramp it up from EA when EA ramps it up from Unravel to Battlefield. Mhm. Battlefront 3 digital only, you know, something like that. They would, the publishers are going to love to do this cuz they cut out everyone. They don't have to manufacture",
            "start": 1938.8
        },
        {
            "text": "Battlefield. Mhm. Battlefield 3 digital only, you know, something like that. They would, the publishers are going to love to do this cuz they cut out everyone. They don't have to manufacture anymore. They don't have to put on trucks and send it to retail stores and have all this semantics and their sales teams just dealing with this They don't have to do it anymore. Like, they can cut their staffs down. I mean, I'm not saying that that's great or people are going to lose their jobs probably, but they have a fiduciary obligation to their investors and they're going to make more money and they're going to spend less money. So, we'll see what happens.",
            "start": 1974.96
        }
    ]
}