{
    "id": 1032,
    "video_id": "rvW_sw2fDUg",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Who Has The Best Fall Lineup? - Kinda Funny Gamescast Ep. 27 (Pt. 4)",
    "description": "We discuss each of the console's fall lineups.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1437051601,
    "duration": 1494,
    "transcript_chunks": [
        {
            "text": "[Music] So, if you guys don't know, every week on the Kind of funny games cast, I like to have the last topic be reserved for your questions. So, you go over to kind of funny.com/forums, go to the gamecast forum, leave some threads, leave some like uh posts and stuff, leave questions and comments and concerns about the kind of funny games. We'll get to all of them at some point. Dallas Rico. That's a great name. I'd love to hear what you all think about this fall's lineup across the three platforms. Do you think PS4 sales will suffer? This is what we keep we were going back to after E3, right? The fact that Xbox actually has exclusives for the fall where Sony does not. Maybe No Man's Sky. Probably not. But so, no. You know what I mean? So, what does that mean? I don't I I think Xbox narrows the gap but doesn't surpass PlayStation here. And I don't think PlayStation's too worried about it because they're still going to sell PS4s. You still have Fallout. Batman will still carry over.",
            "start": 0.31
        },
        {
            "text": "the gap but doesn't surpass PlayStation here. And I don't think PlayStation's too worried about it because they're still going to sell PS4s. You still have Fallout. Batman will still carry over. Metal Gear will still carry over. And then on the other side, yeah, I mean there Xbox has Halo, you know what I mean? Which is the big one. But like Halo does only speak to a certain audience. And do those people already have Xboxes? Were they waiting for this? There's more Destiny content out now that's keeping those people happy and grabbing those people to come play. like we are in this interesting spot where it seems like and I say seems with a shrug, right, that it's flip-flopped a bit here to where PlayStation is in front and PlayStation is where your friends are playing. So when the new multiplayer game, if Destiny is still popular, comes out, you play it there. And so as we saw with PS3, right, like all the exclusives in the world didn't make them catch up and surpass 360. Eventually",
            "start": 51.64
        },
        {
            "text": "game, if Destiny is still popular, comes out, you play it there. And so as we saw with PS3, right, like all the exclusives in the world didn't make them catch up and surpass 360. Eventually it did years and years and years later, but in terms of right now, this holiday season, I don't think Sony's sweating it. And I don't think Microsoft has delusions of grandeur that this they're going to run away with this holiday. They're definitely laying the groundwork to pull ahead, get past, you know, next year cuz next like that's what we're talking we kept talking about with E3 and then Gamescom. The fact that Microsoft has so many exclusives. They're able to come out at E3 or before E3 and be like, \"Hey, you're not going to hear about Quantum Break. You're not going to hear about these other two games. We're going to talk about them at Gamescom. This E3 is going to be totally focused on what's coming out this fall and into the future.\" So that you know, 2016 looks awesome. Even though you",
            "start": 90.88
        },
        {
            "text": "games. We're going to talk about them at Gamescom. This E3 is going to be totally focused on what's coming out this fall and into the future.\" So that you know, 2016 looks awesome. Even though you know that 2015's end looks awesome as well. We have Tomb Raider, we have Halo. Exactly. I don't think PS4 sales are going to suffer because the people that are going to buy it are going to buy it anyways. And I don't think that any of the the exclusives would be the system sellers that people would like think that they are. You know, like even Uncharted 4, if it came out this holiday, I don't think that the that's going to sell a bazillion systems. You know what I mean? Especially because there's a bazillion already out there. Yeah. What I actually do think is I think Xbox sales are going to be be pretty good because of all the people that decided to buy a PS4 that are that were Xbox guys. Yeah. To begin with that are now going to be like, well, you know what? Now it's time to buy an Xbox.",
            "start": 128.96
        },
        {
            "text": "be pretty good because of all the people that decided to buy a PS4 that are that were Xbox guys. Yeah. To begin with that are now going to be like, well, you know what? Now it's time to buy an Xbox. There's no longer connect. The price is lower. Here's Halo. Like, okay, you f because how when you talk to somebody who doesn't have an Xbox One, what they say is, \"Oh, I need a game on it that I care about.\" You know what I mean? And this is which is a weird thing to say, but when you think about the fact that if you're just buying thirdparty games, then PlayStation 4 can give you Batman, Witcher, whatever, you're fine. But when you get over there, you're building the same case now, right? And the fact of you have uh Sunset Overdrive, you have Halo, you have Tomb Raider, you have Massive Chalice, you have and the list goes on of games that are already games that are exclusive that you've heard enough good things about where you're like, \"All right, time's now. It's the holiday. I'll ask",
            "start": 165.76
        },
        {
            "text": "you have and the list goes on of games that are already games that are exclusive that you've heard enough good things about where you're like, \"All right, time's now. It's the holiday. I'll ask for it. My wife will get it for me.\" So on and so forth. Yeah. Exactly. And then of course there's Nintendo, which between Mario Maker, Yoshi's Willy World, and Star Fox, I'm excited. It's going to be a great time for me. Is this going to sell systems? Absolutely not. But it's going to have a good lineup of games for sure. I'm looking forward to Mario Maker. I just worry about how much I'm actually going to play it. You know what I mean? It feels like it I worry about it being one of my usual I'm super excited for this Nintendo game and I get it and I play it for a weekend and I'm done. And I don't want that. guarantee that the only time I'm ever going to actually make a level is going to be in the let's plays that we do. I'm never But that will still be fun. Like I It's going to be fun, but",
            "start": 202.32
        },
        {
            "text": "want that. guarantee that the only time I'm ever going to actually make a level is going to be in the let's plays that we do. I'm never But that will still be fun. Like I It's going to be fun, but it's like I'm I'm not looking forward to Mario Maker to make Mario levels. Sure. Sure. Sure. I'm looking forward to playing others. I Mario Platformers will forever be my favorite game, right? Ever. So, the fact that I'm now just getting that Oh man, I'm going to be all about that. But see, like that's my thing is like it sounds good on paper. You know what I mean? just like Little Bigplet does. But there has to be a finish to what's built in the game. And so once you have all the gold stars or whatever the hell they do in Mario, red coins, blue [ __ ] gems, a purple shoe, once you have all the collectibles that are built into the hundred levels that are on the the CD, right? What's next? You know what I mean? Like is it just that now there's infinite worlds, but like I mean that that's how",
            "start": 236.8
        },
        {
            "text": "collectibles that are built into the hundred levels that are on the the CD, right? What's next? You know what I mean? Like is it just that now there's infinite worlds, but like I mean that that's how do we vet the crap and what am I do? Why am I playing them over and over again? So here's the thing. Like I love Mario platformers. I specifically love Mario World. And I remember back in the day there was a huge thriving community for ROM hacking. Yeah. With the Mario games, specifically Mario World. And that this is to this day one of the reasons the PSP will be one of my favorite systems of all time is because you could do emulation. You could do all this stuff and you could play the ROM hacks. And all it was was expertly created Mario World levels. But the thing that made it special was that they were full games. like there was thought put into the progression of the levels and the difficulty curve and all this stuff. With Mario Maker, I am a little concerned that we're just getting",
            "start": 275.36
        },
        {
            "text": "that they were full games. like there was thought put into the progression of the levels and the difficulty curve and all this stuff. With Mario Maker, I am a little concerned that we're just getting level level. It's not just it's not going to be actual experience. But what I am looking forward to is the creators that do do that have download these 20 stages. They're a game. Yep. And uh it's going to be interesting to see how Nintendo kind of supports that and if they do support collections of levels being a thing package. Yeah. Yeah. You know, because jump and do a creators thing and do that would be that's going to be the thing that makes this go from, oh wow, I really love this and I love playing this to, \"Oh my god, this game is amazing.\" Yeah. Yeah. So, we'll see how that goes. Um, Andrew Jeff wants to know what our favorite gaming all-nighters from back in the day are. The one I immediately default to is whatever NCAA. the NCAA, we'll say 2000, 2001 where uh I was it must have",
            "start": 314.32
        },
        {
            "text": "Andrew Jeff wants to know what our favorite gaming all-nighters from back in the day are. The one I immediately default to is whatever NCAA. the NCAA, we'll say 2000, 2001 where uh I was it must have been, let's see, I went to college in 01. So then it must have been NCAA 02 where I came home. It was building up to coming out. Uh my best friend Po I we he went like a week before and bought his PlayStation 2, which was a huge deal cuz in my community of gamers or friends, I was the gamer, right? And so Po always came over and played stuff at my house. He's the guy who I always talk about like we pass a controller for Metal Gear and like that was like we discovered that together. um finally buys this PS2, buys NCAA, and then the we both bought it that, you know, Tuesday or whatever. Then he came over and we played from like 4:00 in the afternoon until 6:00 in the morning the next day. Like I remember opening the door to say goodbye to him and the sun was coming up. You know what I mean?",
            "start": 358.76
        },
        {
            "text": "came over and we played from like 4:00 in the afternoon until 6:00 in the morning the next day. Like I remember opening the door to say goodbye to him and the sun was coming up. You know what I mean? And we had it where I brought the TV out of my bedroom downstairs onto a card table and he played on the TV and I played on the big screen and then whenever one of us got to the big bowl game or the big rivalry game, the other would stop and hold off. so that we could switch spots. So, whoever had the big game was on the big screen TV and stuff. And we played like Yeah. some ridiculous amount of seasons that year, you know, because we played every game in our season. We were insane. Insane people. Crazy people. Sounds about right. I mean, I have so many me like this. This is a topic that I can go on forever. Topic, right? Yeah. We should probably Wrestlemania 2000, Golden Eye, Mario Kart, all that stuff. But yeah, Smash Bros. I'm not even going to get into it. The amount of all nighters",
            "start": 406.88
        },
        {
            "text": "go on forever. Topic, right? Yeah. We should probably Wrestlemania 2000, Golden Eye, Mario Kart, all that stuff. But yeah, Smash Bros. I'm not even going to get into it. The amount of all nighters I've had with that doesn't even count. all four games. There's been multiple ones. The Tony Hawk games, like I have so many memories. Blockbuster games, like I feel like that alone could be a topic of games I've rented and just played all night for three nights because the rental was that long and we had to get it done. Um, but the story that will always come to mind is Halo. So Halo 1, me and my friends beat together. This is me, Alfredo, and then my best friend Curran. Like they were way better than me, but we all really enjoyed playing Halo together. Halo 2 comes out November 9th, 2004. We get there, we play it, beat it in one sitting together, co-op. Halo 3 comes out, we do it again. And I will never forget it because this was a time we were in my living room. Each of us had our own TV.",
            "start": 445.68
        },
        {
            "text": "there, we play it, beat it in one sitting together, co-op. Halo 3 comes out, we do it again. And I will never forget it because this was a time we were in my living room. Each of us had our own TV. We system linked it. Yeah. And we're just sitting next to each other playing co-op. We played through the entire thing and we were playing online with one other person doing co-op with us, one of Alfredo's friends. And I remember we playing on I don't know if it was legendary. It probably was legendary or at least heroic. So it was difficult and I am not good. So I was definitely the like the guy that like just hide in the corner, let us get far and then when we hit a checkpoint, you can come out. And I was like, \"All right, I'm just enjoying this for the ride.\" And at the end of the game, spoilers for Halo 3, um there's a part where you get into Warhogs, the vehicles. Yeah. And two people are driving, two people are on the the gun seats, and you're driving a across this big thing in the",
            "start": 488.72
        },
        {
            "text": "for Halo 3, um there's a part where you get into Warhogs, the vehicles. Yeah. And two people are driving, two people are on the the gun seats, and you're driving a across this big thing in the sky and like it's blowing up and parts of Halo are falling off and all this [ __ ] and then at the end there's a big ass jump. So Kurt and his friend and Kurt and Alfredo's friend jump and make the jump. Alfredo is driving and I'm like shooting the gun and stuff and we're going he's about to make the jump and I accidentally hit the button to get out of the car. So I fall off and Alfredo just starts driving without me and then he realizes I wasn't in the car and then in real life everyone just kind of looks at me like what the [ __ ] man. I'm just like, \"Just go without me, dude. Just go without me.\" And they're like, \"Are you sure?\" Like, \"Dude, just go without me.\" Like, \"We got to finish the fight.\" And Alfredo like goes off and in the cut scene, it like cuts to the the in-game cut scene and",
            "start": 531.36
        },
        {
            "text": "And they're like, \"Are you sure?\" Like, \"Dude, just go without me.\" Like, \"We got to finish the fight.\" And Alfredo like goes off and in the cut scene, it like cuts to the the in-game cut scene and you just see my character just explode. And it was just it was just the best end. And it was then like 7:00 in the morning. We all just look at each other like that just happened. That was great. So yeah. Yeah, those moments are just the best, man. The other one for me was I think it was the original Smackdown of PS1, but it might have been Smackdown. No, it must have been Smackdown on PS1 where uh so for some reason at like 3:00 in the morning like the parties part sleepover is winding down and my friend's like let's just do an hourong Iron Man match and we're like all right. And so 4 in the morning we play and at the end like it's tied or whatever and I think we went it gives you like one overtime or whatever they call it and it we didn't finish and so at the end it was like it was like",
            "start": 572.32
        },
        {
            "text": "morning we play and at the end like it's tied or whatever and I think we went it gives you like one overtime or whatever they call it and it we didn't finish and so at the end it was like it was like the most like am I dreaming right now cuz it was just a screen that said it it awarded one of us the win and it was like Vince McMahon has declared that this person won and it's like what like is this we had never heard of this feature. This was never in anything we like I since then have told that story and people are like yeah that that happened to me too but it's like such a weird thing where eventually the game and you weren't even playing smackdown you were playing some other game just decided you won the Mario Kart screw job. Yeah. Oh my god. All right. Who is this dude? Thomas Sinclair. Hi. Owner of the Sinclair gas station. Is it worth it to finally make the jump to current gen? Which system wins for the late adopters? For sure it's worth it to make the jump. Yeah. I mean, I'm",
            "start": 610.64
        },
        {
            "text": "Hi. Owner of the Sinclair gas station. Is it worth it to finally make the jump to current gen? Which system wins for the late adopters? For sure it's worth it to make the jump. Yeah. I mean, I'm playing to the audience, but PlayStation, you know what I mean? Like, I would say I I it's I honestly do feel like at this point, it's whatever whatever one you got, you'll be happy with. You know what I mean? I do think that PlayStation seems to have the leg up. And again, this is my personal interest in terms of what's out right now. Like, you know, let alone for Uncharted next year, you know what I mean? But what I'm excited about, like everything I listed today, right? So, Witcher, Batman, Dying Light, right? You and her story is a PC exclusive. So those three games right there you can get on Xbox One no problem. Massive chalice chalice state of decay are Xbox One exclusives. They're awesome. You know what I mean? In terms of consoles, but then yeah, I mean just I like the interface of",
            "start": 649.36
        },
        {
            "text": "on Xbox One no problem. Massive chalice chalice state of decay are Xbox One exclusives. They're awesome. You know what I mean? In terms of consoles, but then yeah, I mean just I like the interface of PlayStation 4. I like how it runs. I like the community. Granted, I covered it for so long. It's second nature to me. You know what I mean? So it's a weird question, but like if Halo and Tomb Raider do something for you right off the bat, then there you go. But Uncharted Collections this year still, you know what I mean? Uncharted's next year, which is awesome. Uh I'd love to see what the other first parties are doing, but like yeah, you really couldn't go wrong. It's like I always used to answer this question. I still should. I guess with the thing of just like where are your friends? Like wherever your friends are playing, that's where you want to be. So just worry about that more than anything. I do think it's where it's a fine time to jump. Yeah. Yeah. Me too. I feel like you need to.",
            "start": 690.56
        },
        {
            "text": "your friends are playing, that's where you want to be. So just worry about that more than anything. I do think it's where it's a fine time to jump. Yeah. Yeah. Me too. I feel like you need to. And you know, uh if Alfredo was here, I know exactly what he'd say cuz he is an Xbox guy through and through. But he bought a PS4 because early on that was the answer. Yeah. You know, and like everyone was saying that, but at the end of the day, his friends play Xbox still. So he plays both constantly, but Xbox is where his where his shit's at. So it really honestly for me it's like they both seem great. They both have lineups where both systems have some games. I'm like, \"Fuck, I want to play that.\" Right. You know, if PlayStation had things like Ory, I'd be like, \"Yep, I don't need to play.\" And Cuphead, I'm like, \"Nope, that's coming Xbox, so this is going to happen.\" Yeah. No, that's the big thing is like there's just such parody there. You know what I mean? Where it's like I we have the PS4",
            "start": 723.2
        },
        {
            "text": "I'm like, \"Nope, that's coming Xbox, so this is going to happen.\" Yeah. No, that's the big thing is like there's just such parody there. You know what I mean? Where it's like I we have the PS4 out there. I was trying to get us onto one PS4 in the living room where Colin and I have the same our accounts are on one unit. So we have to keep disconnecting it. Then I I thought through the problem more and I put it on a second system instead of my primary system. So now my primary system is never hooked up. So I can never remote download anything cuz So I switched it out and then I come out there and Colin's disconnected it to put back in the other system. Like just recover your profile on this other system. Like it's so easy. But and it's also like well hold on the Xbox is turned on at all. You're only turning on this other thing to play Netflix. Like the Xbox can do that too. Why don't you just turn that on? You know what I mean? Yeah. Plus, Xbox Skype is awesome. We use that all the time",
            "start": 760.8
        },
        {
            "text": "only turning on this other thing to play Netflix. Like the Xbox can do that too. Why don't you just turn that on? You know what I mean? Yeah. Plus, Xbox Skype is awesome. We use that all the time now. It's just Yeah. It's [ __ ] rad. So, if you like Skype, get an Xbox. That's Yeah, that's the one to go for. Get that connect on that Xbox Skype ready to go. At Nafier 6, what do you want to go back and play, but you know, you never will. Oh man, that's like half the games that have come out in existence. I mean, I would love to go back and I mean, like, this is not I'm sure how he means the question, but I'll get to more of his thing. I'd love to go I would love to only play DC Universe online. I would love to be so dedicated to that game that that's all I play. But the problem is there's so it's such a time sync especially now at endgame where it's just raids and [ __ ] for me where it's like I'm more than 500 hours into that game and it's just like I know when I inevitably I'm going to",
            "start": 795.36
        },
        {
            "text": "it's such a time sync especially now at endgame where it's just raids and [ __ ] for me where it's like I'm more than 500 hours into that game and it's just like I know when I inevitably I'm going to stumble off the wagon here and get back into it and that's a month and a half of my life of just nightly grinding and trying to get Exo Bits and Bites which you can't do right now. It's like in terms of a game I've already I'd love to get back to. That's one of them. I could go out there right now and read off the the list of all the games that are still in rap. You know what I mean? There's so many games out there still in plastic. I was like Sunset Overdrive. Like I love Insomniac. I love uh Drew and Marcus who made were the guys in charge of that game. I've never played it. Like I played it at preview events and stuff and I was like this is cool. But yeah, you just It's not like I've never actively like I need to sit down and play Sunset Overdrive. You know what I mean? Like that's",
            "start": 833.04
        },
        {
            "text": "it at preview events and stuff and I was like this is cool. But yeah, you just It's not like I've never actively like I need to sit down and play Sunset Overdrive. You know what I mean? Like that's just not how it is for me. Yeah, for me it's like the majority of the Kingdom Hearts spin-off games where it's like I'm sure I'd like them and I hate on them blindly without actually playing them and knowing how good they are cuz I know a lot of them are really good and just because they don't have a number in front of it doesn't mean that they're any worse than one and two. Um, and then Peacewalker I think is the glaring answer for me where it's just like I'm not going to go back and play. But you can just now you just got to you'll be fine once you get Phantom Pain. It's going to be fine. Be I'm just going to be in it. Damn. I can't [ __ ] wait for Phantom Pain. Do you understand? Every day I think about Fan of Pain. Every day I wish it was Fan of Pain Day. And like now we're we're so",
            "start": 869.04
        },
        {
            "text": "Be I'm just going to be in it. Damn. I can't [ __ ] wait for Phantom Pain. Do you understand? Every day I think about Fan of Pain. Every day I wish it was Fan of Pain Day. And like now we're we're so close that we're starting to book trips maybe around it. And I'm like, well, I'm bringing them a [ __ ] thing. I'm not going out. I'm not going out. I'm going back to my room after our commitments. Maybe bringing the games the Yeah. the game screen I have with me to play wherever the hell my commitment is. You know what I mean? Like I'm so scared about that game, man, because I play Metal Gear differently than you. I want I just play for the story and I just want the campaign. That's there. You can do that. I know. But like I'm more from everything I've heard about five, it's that it sounds so big and so open and I'm like I just want linear. Just go. There's a whole tab that says story. Just play those missions. Nothing else. Okay. Do I get quiet then? I want quiet. I can't spoil any",
            "start": 905.28
        },
        {
            "text": "so big and so open and I'm like I just want linear. Just go. There's a whole tab that says story. Just play those missions. Nothing else. Okay. Do I get quiet then? I want quiet. I can't spoil any story things as part of my NDA and embargo information. Fine. Greg, I got you. Kami Wesley Bray, if you were in charge of Sony, how would you make Morpheus a success? I would not do it. Your livelihood depends on it. I would I would show them the reasons it's not going to be a huge deal. Let's not do this, please. Yeah. I would say like literally I my my thing with how how to make Morpheus successful and how to make money off Morpheus would be all right, cool. This tech is cool and it's so close, but it's not there yet. We can let Oculus and Hollow Lens and everybody else do this and what we'll do is PlayStation 5 will come bundled with Morpheus from the get-go. Like, I feel like that's their problem. I feel like they're in another move situation where it's like what's going to happen is",
            "start": 936.48
        },
        {
            "text": "do is PlayStation 5 will come bundled with Morpheus from the get-go. Like, I feel like that's their problem. I feel like they're in another move situation where it's like what's going to happen is they're going to launch with a bunch of cool [ __ ] It's going to be really cool. Everybody's going to like, \"Oh, I can't. This is a nice thing. I use VR and I like it. I think it's cool. I like I like what I'm doing in these experiences. I don't know if I'd like to play forever.\" Blah blah blah. All that aside, it's going to be and I'm being generous. 10% of the PlayStation 4 owners buy very generous. Five between one and five are really going to adopt this thing. And so then immediately every [ __ ] developer is going to be like, \"Oh, it's cool and it's great, but like we need to make games that are making money that can go Xbox to PS4s and PC, so that's not how we're going to do it.\" You know what I mean? So unless Shu in all his wisdom is back there right now with the first parties being",
            "start": 983.76
        },
        {
            "text": "are making money that can go Xbox to PS4s and PC, so that's not how we're going to do it.\" You know what I mean? So unless Shu in all his wisdom is back there right now with the first parties being like, \"Cool, what we're I want you guys to make these games. Numbers don't matter. It get a team on this. Let's do something awesome.\" I feel like they're going to come out and it's going to be dreams. It'll be this like big thing that'll be really cool that not a lot of people are going to play and then it's going to be a bunch of other games that people aren't going to really play. Yeah. And then it'll be stuff like Bioshock Infinite and move integration. Yeah. Where it's like, all right, cool. You know, this thing has this and then there's like three levels like the next Batman or Rock Steady game will have three pre-order PSN things that you put on your Morpheus for and do things. It's like, what are you doing? I mean, you're right. It needs to be a pack in with the system and it can't",
            "start": 1023.36
        },
        {
            "text": "game will have three pre-order PSN things that you put on your Morpheus for and do things. It's like, what are you doing? I mean, you're right. It needs to be a pack in with the system and it can't be this system. It needs to be the next system. Yeah. It's way too late to pack it in now. It needs to be something. And this is where this will never happen. But if you want it to be a success, you need to partner with Microsoft in some way. Get it on the Xbox One as well because that's when it's an everybody wins situation where the only way that this is going to be a thing is if the developers can make games that work on both and third party games can get involved and it's not having to choose in this whole ecosystem of peripherals and [ __ ] that no one cares about. But that's not going to happen. Yeah. But that's the thing is like Yeah. Like if everybody could just agree to work with Oculus and have it plug into their console, you know what I mean? which I know is impossible, but but",
            "start": 1059.52
        },
        {
            "text": "happen. Yeah. But that's the thing is like Yeah. Like if everybody could just agree to work with Oculus and have it plug into their console, you know what I mean? which I know is impossible, but but that would be the answer, man. Like, Oculus has been doing this. Just support it. Make that a thing. Yeah. All right. Final question. It's the final. I love looking at some of these names and just trying to consider how to possibly pronounce it. We got Dabominic. It's like Dominic, but like dab. He's more of a bomb. Damn. Dam. Oh, Damn. Damn. He's the He's Damn. His name's Dominic. Dominic, but he's the bomb. Dominic, how often do you check the hours you spend with a single game? I wish it was easy. Yeah, that's the thing is that every game makes it a little bit bit different and more difficult. And like Batman, I would have no idea how many hours I put in, but I upload all my stuff to the cloud just in for fear that I was going to lose all my progress. So, I put 50 hours into Batman, you",
            "start": 1095.68
        },
        {
            "text": "And like Batman, I would have no idea how many hours I put in, but I upload all my stuff to the cloud just in for fear that I was going to lose all my progress. So, I put 50 hours into Batman, you know what I mean? Like, and that's just cuz I get to see that thing. I wish all games had it very easy. I wish all games played by the same rules cuz like The Witcher, time moves differently. when you suspend your PlayStation 4, The Witcher, at least in at launch, kept counting. So, I remember looking at it like somebody asked me how long and I'm like, \"Oh, cool. Yeah, I'll check it.\" I was like, \"Oh, man. It says I've been playing for 3 days and I've had the game for that's impossible. This is broken.\" You know what I mean? It's like come on. Yeah. That shit's weird. I always I'm fascinated with game time. Like, I'm con and percentage, too. Yeah. Like, if a game tells you the percent, you're through it. I hate it when it's like I like the percentage of the campaign. Yeah. And then I or I",
            "start": 1142.16
        },
        {
            "text": "game time. Like, I'm con and percentage, too. Yeah. Like, if a game tells you the percent, you're through it. I hate it when it's like I like the percentage of the campaign. Yeah. And then I or I want a separate percentage for collectibles and all this. What Batman does really well is when you go to jump into Batman, it's like here's your save file game over Greggy and it's like 10% or whatever, but that's 10% of everything. And then when you go in, you can then look at your radial wheel and see you've done 40% of the story and yeah, 2% of the Riddler. You know what I mean? Like you get to see it broken down where you understand where that number is coming. That's cool. And then when you go to New Game Plus, you're getting like 112%. I'm like, yeah. Yeah. See, that's just great. But like I always remember with games like Donkey Kong Country or Crash Bandicoot where it would say you're 30% done just because you haven't got all the collectibles and all that. No, it's [ __ ] I'm done",
            "start": 1176.08
        },
        {
            "text": "I always remember with games like Donkey Kong Country or Crash Bandicoot where it would say you're 30% done just because you haven't got all the collectibles and all that. No, it's [ __ ] I'm done with this D. Um but then there's games like Uncharted that I remember I check constantly every save point I would save and then or not save point every time I I decided I have a save point. Um I would save and then go back to the gameplay and then go back into the save because that's when it would update the percentage. So you want to see how it is. Yeah, we're weird. It becomes a badge of honor, right? And I mean, that's why I know my pat upon, you know, gameplay time on two. And then, well, I guess I don't even know it, but I remember bragging about it. And like now with Metal Gear, I'm always like, well, like in the let's plays, I'm like, this save says I've only played 67 hours, but you know, I played 90 and my Mario Golf 85 hours. You know what I mean? Like cuz it's just like you're,",
            "start": 1213.12
        },
        {
            "text": "like, well, like in the let's plays, I'm like, this save says I've only played 67 hours, but you know, I played 90 and my Mario Golf 85 hours. You know what I mean? Like cuz it's just like you're, you know, to another gamer that speaks volumes of like how much are you really into this game? Like how much you really know about this game? Well, that's what something I love about Smash Brothers and it's just the gift that keeps on giving because even the even like Melee had an achievement system. Yeah. And like they just notify you about a bunch of random stats. So you play it's like congratulations you played for 100 hours. I'm like cool. Nice. Yeah. Well, that was the thing even with like you remember Burnout Paradise like that was what they did so well of like all right you smashed like a [ __ ] cone. It's like all right 300 more of these go like oh gez all right. You know you won one out of 40 races. you're like, \"Oh man, there's so much to do.\" Because like that's what I was talking",
            "start": 1253.2
        },
        {
            "text": "[ __ ] cone. It's like all right 300 more of these go like oh gez all right. You know you won one out of 40 races. you're like, \"Oh man, there's so much to do.\" Because like that's what I was talking about with like why The Witcher got me the way it did, why Batman did, like why anything really quest based is getting me lately. It's just like I feel like if I can only chip away at something for a few hours, minutes, you know what I mean? Depending on what it is, I like to feel progress is being made. And that's why like to Colin's point earlier with The Witcher, right, is the fact that there's so much to do in The Witcher that it feels like you're not making progress. Yeah. All right, guys. So, thank you to Squarespace for sponsoring that topic. Squarespace is how we made kind of funny.com. It's true. I'm in love with how it looks and simple it was to make. Nick Sarpino did it himself. He did. And he's not the brightest guy in the world. He's not the brightest bulb. They made it all",
            "start": 1289.36
        },
        {
            "text": "It's true. I'm in love with how it looks and simple it was to make. Nick Sarpino did it himself. He did. And he's not the brightest guy in the world. He's not the brightest bulb. They made it all look the same on every site. That was that's one of my sweetest like memories of that first week when we were getting all that stuff working and how impressed he was that look it looks like this on the on the website and it looks like this on your phone and the iPad and all this stuff. So, that's that's great. So, the sites look professionally designed regardless of skill level. There's no coding required. It's very intuitive and easy to use. It's with state of state-of-the-art technology powering your site to ensure security and stability. Trusted by millions of people and some of the most respected brands in the world, including kind of funny. Starts at $8 a month and you get a free domain if you sign up for a year. Start your free trial site today with no credit card required at",
            "start": 1327.84
        },
        {
            "text": "most respected brands in the world, including kind of funny. Starts at $8 a month and you get a free domain if you sign up for a year. Start your free trial site today with no credit card required at squarespace.com. When you decide to sign up for Squarespace, make sure to use the offer code kind of funny games to get 10% off your first purchase. Squarespace. Build it. Beautiful. This is my idol animation. I like it. It's a good auto animation. You should probably do something interesting. You know what we got to do? What? We got to figure out how to [ __ ] capture the N64 again. Yeah. I want to play No Mercy so bad. I think about that every night, too. God, you have an interesting life, Greg. It's just Yeah, it's a weird life. All right. Yeah. Got to gota I either got to get Metal Gear, we got to be able to capture No Mercy. It's one or the other. It's It's going to come down to that. Kevin, figure it out. Wait. I mean, that should be No, but but yeah, but that'll be laggy then.",
            "start": 1360.0
        },
        {
            "text": "we got to be able to capture No Mercy. It's one or the other. It's It's going to come down to that. Kevin, figure it out. Wait. I mean, that should be No, but but yeah, but that'll be laggy then. Remember we bought that box that puts it through and Oh, we'll talk about this later. We have to figure it out. I was saying figure out the middle gear thing. Can you put on your Solid Snake? I should probably just give up. I can't I should just admit that I can't wait till August and I should start playing ground zero and not right now to start get 100% of Ground Zeros. It's too late, man. I need it. If you do that, it's gonna be worse than August when you're like, I've been playing ground zero for like two months. [ __ ] that's a good point. Kevin comes with good points. Ladies and gentlemen, this is the kind of funny Games Cast. The first and last ever episode 27 next week. Guess what? First and last ever episode 28. It's going to come. And then 29 and then 30. Because that's how numbers",
            "start": 1398.48
        },
        {
            "text": "this is the kind of funny Games Cast. The first and last ever episode 27 next week. Guess what? First and last ever episode 28. It's going to come. And then 29 and then 30. Because that's how numbers work. Unless you're Final Fantasy and then you add a bunch of weird numbers in between. It's going to be episode 29-2. Yeah. Oh, don't tell me, Greg. Should I do that at some point? No, don't do that. Save it for then, you know, because if we're coming up on like a milestone and we're early or late, then you can do it. That's that's the way you do it. It's like we get to 199-2 cuz we're not ready for 200 out of Duke. Duke. Yeah. Prologus. Duo Dekum. Duo Dekum. God damn it. Final Fantasy. God damn it. I used to call it Dukakum just to piss off at Ryan Clemens because he loved that [ __ ] Cut it, Kevin. No, you can keep it going, Kev. Let's just do a game over Greg [ __ ] What's up, everybody? Welcome.",
            "start": 1435.92
        }
    ]
}