{
    "id": 81,
    "video_id": "bT9sWtAYzA8",
    "show_name": "Miscellaneous",
    "hosts": [
        "Greg Miller",
        "Kristine Steimer"
    ],
    "title": "Teddy and Peggy: Nashville Season 2 Predictions",
    "description": "Just when you thought Teddy was out of Peggy territory, Mrs. Paisley reeled the mayor back in. What does it mean for season two? Our Nashville experts debate. \n\nSUBSCRIBE/LIKE/SHARE\n\nNashville's first season is in the books, but Greg and Kristine aren't ready to be done with the hit ABC drama. Join them as they predict just what's going to happen when Nashville returns for season two!\n\nAll of Greg and Kristine's predictions: http://www.youtube.com/playlist?list=PLOlEpGVXWUVsBA7Hn32dkMqYOcKYqw0jV\n\nCatch all of Nashville on iTunes: https://itunes.apple.com/us/tv-season/nashville-season-1/id550311456\n\nNashville music on iTunes: https://itunes.apple.com/us/artist/nashville-cast/id576010239\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy\nFollow Kristine on Twitter: http://www.twitter.com/steimer",
    "published_at": 1369832601,
    "duration": 517,
    "transcript_chunks": [
        {
            "text": "what's up everybody I'm Greg Miller and this is Kristine Steimer and we love Nashville, Kristine how much do we love Nashville so so so much so so so much that we decided to make a YouTube series of videos with our season 2 predictions, season one just wrapped up the finale just went down and it was batshit crazy it was batshit crazy I could have decided better myself funny um every episode we tackle a new relationship make some predictions about it today we're talking about Teddy and Peggy mm what's going to happen to Teddy and Peggy that's their couple name that's their couple name Teddy and Peggy I'm not good with words funny that I talk into a camera in mic all day what's going to happen Kristine um I think he will end up forgiving her obviously cuz he has to oh sorry so cuz she leaked the divorce to the press so what big deal so what only caused a lot of pain to their children they quick recap if you need it Teddy and Peggy they were working together on this Cumberland deal years ago oh right they",
            "start": 6.12
        },
        {
            "text": "So, what big deal so what only caused a lot of pain to their children? They did a quick recap if you need it: Teddy and Peggy were working together on this Cumberland deal years ago. Oh right, they're the whole other long thread of this - yeah, there's very few things that go past one episode in Nashville in terms of threads. This was one of them. Uh, they covered up some financial bad stuff. Uh, then they were going to have it exposed when he was running for mayor, but they didn't. But then they tried to say that they were having an affair, but they weren't. But then they really started having an affair for like 10 minutes before Teddy went to go break up with Raina and be with Peggy. Then Peggy and him were together. Then it turned out that the divorce got leaked to the tabloids by Peggy - yes. Then Teddy dumped her, said \"get the hell out of my life,\" pretty much. Yeah, cuz he had hired her entire team. Is this what being a mayor is like too? Cuz it was really like he's like the President of Nashville.",
            "start": 47.32
        },
        {
            "text": "\"Dump her said get the hell out of my life pretty much yeah cuz he had hired her exactly her team is this what being a mayor is like too cuz it was really like he's like the President of Nashville, he's like got these people he's appointing he's doing all this stuff it's like damn I choose you maybe it's just our mayor of San Francisco is so terrible oh well it's probably true it's true get some trash cans on the street um but then so it seems like he's cut Ted Teddy is going to cut ties with Peggy and uh Teggy just call him Tegy Tegy they were going no more and then Peggy comes in and says she's pregnant and that's how their thread pauses for yeah cuz now what's happening is the Cumberland deal is being investigated by the feds right and so they talked to him and alone yeah I think they were basically like we can pin this all on Peggy we should do that what did he say I don't remember this part I was reeling from the other Nashville I guess I\"",
            "start": 85.52
        },
        {
            "text": "to him and alone, yeah, I think they were basically like we can pin this all on Peggy, we should do that. What did he say? I don't remember this part. I was reeling from the other Nashville, I guess. I don't know, yeah. I mean, granted, I'm a little fuzzy on this part, but this is what I thought had happened when you bring in business and economics, me and Chris are like, \"What's that? There's something shiny on the wall.\" That's look at that instead of Portell somehow. No, and so... And then I'm assuming he had the idea that they were probably giving her the same story to Peggy. Oh yeah, CU, he asked her about that. She's like, \"I told her nothing,\" yeah. And she was like, \"What did they say? Why didn't you make a plea deal to save yourself?\" And she was like, \"I'm pregnant.\" You so what now do you think she's really pregnant? Yeah, I don't... They've been on enough times well sure, but but I mean that doesn't lead... I mean, you have to some things up for that to happen. You think she's putting holes in the condoms like what she's",
            "start": 130.8
        },
        {
            "text": "yeah I don't think they've been on board enough times well sure but but I mean that doesn't lead to I mean you have to make some things up for that to happen you think she's putting holes in the condoms like what she's saying she's not she's saying she's on the pill she's on the pill I don't know cuz here's the thing they didn't really go into their birth control methods sure I they should have Peggy of course played by Brad Paisley's wife uh star of not she is the star of Father of the Bride he wasn't she she was also oh my God that is her she was also an According to Jim forever but I understand no one ever watches that show here's the thing she's a seems like a lovely lady Brad Paisley is a lovely man I'm sure that means she's a kind of ruined the season finale song no well yeah it's not as good as it can't harmonize anyways go ahead Peggy as a character has those crazy eyes she is a totally crazy looking so it's one of those things I bet she's faking the pregnancy trying to",
            "start": 175.36
        },
        {
            "text": "anyways go ahead Peggy as a character has those crazy eyes she is a totally crazy looking so it's one of those things I bet she's faking the pregnancy trying to and and it might not be a bad move cuz what what they're saying with the whole Curb Your Enthusiasm room deal is if maybe she forces the card that I'm pregnant that means they get married and then they can do the whole I can't testify against my spouse thing ooh I forgot about that but I but if that's what it was going to be I would play it as that rather than all of a sudden I'm pregnant oh I miscarried and I never had any symptoms and we never wanted to get an ultrasound you know what I mean but the pregnancy might Force the hand of the marriage to get it going I'm going to go she's really pregnant oh and now here's something interest one I guess that I'm sure in Nashville craziness in in a previous conversation we we've talked about how upset you were that Teddy cheated on Raina about like 10 minutes before",
            "start": 214.76
        },
        {
            "text": "Something interests one, I guess. In Nashville craziness, in a previous conversation, we've talked about how upset you were that Teddy cheated on Raina about like 10 minutes before he came to break up with her. I'm not saying it's that I'm just saying it's kind of rude, it's a douche-y move. Do you think that the pregnancy is from that first time and they're going to be able to like chart it back like through all the okay, cuz they've had sex so many times after that, they wouldn't be like it's not like that was a one rare occurrence, sure. But it wouldn't I mean I wouldn't put it past them to be like try to make that cuz like I was saying Teddy still seems to me like a good guy, he's made some bad decisions, he's done some dumb stuff obviously. I mean they could if the baby was like what three months long and then they just got divorced like few months ago, then that would be like oh that's a good point too, I guess. The divorce papers too cuz it's it's hard to keep up too cuz we always talk about how",
            "start": 252.68
        },
        {
            "text": "and then they just got divorced like a few months ago, then that would be like oh that's a good point too I guess the divorce papers too cuz it's it's hard to keep up too cuz we always talk about how fast Nashville moves, it moves fast between episodes as well where they'll be like oh a couple weeks have passed or a month has but you know what I mean so that could all be part of it too that yeah when he oh this is interesting yeah it'll be that when he had the now then now there's a whole new instead of peeling back layers to the onion, I'm adding layers to the onions now what's going to happen is the pregnancy will happen and when it gets out to the press they'll be like wait a second like so you were this is the woman we thought you were cheating on way back in the day you added her to your cabinet and then she's pregnant like and then they'll do the math to find out that long they were still he was still married to Raina even publicly while for them to be able to do the math cuz you don't",
            "start": 292.08
        },
        {
            "text": "and then she's pregnant, like, and then they'll do the math to find out how long they were still married to Rayna even publicly. While for them to be able to do the math, cuz you don't typically announce you're pregnant for a while, yeah I know, I'm just saying, but yeah, they could be like wait a minute, you're how many months pregnant? I mean, they would have to fudge it and then be like the baby was just premature. Mhmm, interestingly, interesting, and then another secret that's another thing that you do if you get knocked up at an inopportune time, if you get knocked up up at an inopportune time. Come to Kristine's YouTube channel for tips on how to cover it up, yes, interesting. Well again, I think Peggy is crazy and I totally think my prediction for her character going forward in this is that she's going to be the Glenn Close, she's going to have a freaking psycho Fatal Attraction kind of spin-off here in this thing where like season one will end with her like trying to kill",
            "start": 329.8
        },
        {
            "text": "this is that she's going to be the Glenn Close she's going to have a a freaking psycho Fatal Attraction kind of spin-off here in this thing where like season one will end with her like trying to kill teddy or something crazy like that you don't think so am I going too Melrose Place I'm feeling I'm feeling Melrose Place about this but then Julie mother murdered a man yeah she loves him like in a crazy way sure sure but kind I love you and if you ever leave me um but I don't think she's dangerous and I do think the pregnancy's real I don't think she would lie about well she might lie about it but I just think in this case it's probably real okay but we'll see you could be right we will ladies and gentlemen Nashville back for season 2 soon that's when we'll find out before we go though time for a wild card prediction if you're just joining us if this is our first video for Nashville predictions we make ours our educated guesses then the gods of Nashville intervene and we do random grab",
            "start": 371.08
        },
        {
            "text": "wild card prediction if you're just joining us if this is our first video for Nashville predictions we make ours our educated guesses then the gods of Nashville's they intervene and we do random grab bags to put together what's going to happen I'm channeling the gods of nville all right there's there's the people bag this prediction is going to be about who Peggy Ketchum is it going to come true it's a national prediction party there's what'll happen to Peggy this season you're hoping for dead I have a I'm hoping for some of the fun ones I put in here she's going to shave her head everybody I told you she's going crazy she's going crazy crazy Spears and Amanda Maddox ruled in she's gone bat crazy for sure in season two this a good one this a good one ladies and gentlemen how much do you love Nashville if you love Nashville as much as we do make sure you like the video share it with your Nashville loving friends and then leave a comment about your predictions and if you're really into it",
            "start": 416.68
        },
        {
            "text": "Nashville if you love Nashville as much as we do make sure you like the video share it with your Nashville loving friends and then leave a comment about your predictions and if you're really into it leave a video response giving your predictions for Teddy what's going to happen to this relationship but if you are new to Nashville feel free to catch up on everything on iTunes you can get the episodes plus the soundtrack soundtrack is awesome in the it's down here and you go to the description of the video to find it I don't want to put the link here because a lot of people turn off annotations so I just be wasting my time I don't like wasting time so scroll down just a little bit except waste of time right now Kristine thank you so much for joining me until next time Beyond pap",
            "start": 463.16
        }
    ]
}