{
    "id": 75,
    "video_id": "MI5VJjMMcNs",
    "show_name": "Miscellaneous",
    "hosts": [
        "Greg Miller",
        "Kristine Steimer"
    ],
    "title": "Deacon and Maddie: Nashville Season 2 Predictions",
    "description": "As season one of ABC's Nashville came to a end, we saw the beginning of a brand new father/daughter relationship. Where are Deacon and Maddie going in season two? Our Nashville experts debate. \n\nSUBSCRIBE/LIKE/SHARE\n\nNashville's first season is in the books, but Greg and Kristine aren't ready to be done with the hit ABC drama. Join them as they predict just what's going to happen when Nashville returns for season two!\n\nAll of Greg and Kristine's predictions: http://www.youtube.com/playlist?list=PLOlEpGVXWUVsBA7Hn32dkMqYOcKYqw0jV\n\nCatch all of Nashville on iTunes: https://itunes.apple.com/us/tv-season/nashville-season-1/id550311456\n\nNashville music on iTunes: https://itunes.apple.com/us/artist/nashville-cast/id576010239\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy\nFollow Kristine on Twitter: http://www.twitter.com/steimer",
    "published_at": 1369832598,
    "duration": 688,
    "transcript_chunks": [
        {
            "text": "what's up everybody I'm Greg Miller and this is Kristine Steimer and we love a show on ABC called Nashville Kristine how much do we love Nashville uh so much so much that we are so stupid we'll spend a day off making YouTube prediction videos about Nashville season 2 that's what we're doing I could be playing God of War right now I could be playing a game I can't talk about and other things as well and making other YouTube videos um though let's talk about a specific relationship make some specific season 2 predictions talking Deacon and Maddie of course season 1 it was one of the it's one of the few long running threads in this show Kristine Nashville moves very quickly it does somebody's going to get married then all a sudden they're an old the next episode somebody's doing this they're drug addict then they're running for congress the next day they they've got a lot a lot going on a lot going on but Maddie of course the bespectacled daughter of Teddy and Raina there uh turned out though early on",
            "start": 6.24
        },
        {
            "text": "they're running for congress the next day they they've got a lot a lot going on a lot going on but Maddie of course the bespectacled daughter of Teddy and Raina there uh turned out though early on we found out that yeah Maddy probably wasn't Teddy's and then it was confirmed later on that yeah it was Deacon's and then at the very end she kind of blows the whistle on the whole gosh darn production again with the silver crate in the closet the silver crate that she knew just to go to was her mom was like I don't want to talk to you about anything serious right now me and your dad are going through some things she's like okay and then she just went to the silver crate which I hope it would have been full of scarves it's in your closet like why why is there a box full of important documents in Clos where do you keep your important documents you don't know a safe I live with you I don't but my dad does okay well so you mail anyways he's got all the that kind of stuff okay my paternity test",
            "start": 42.32
        },
        {
            "text": "Clos where do you keep your important documents? You don't know a safe. I live with you, I don't, but my dad does. Okay, well, so you mail them anyways. He's got all that kind of stuff. Okay, my paternity test. Okay, well, they...you know, they couldn't figure out who my dad was. Oh man, Forever on the internet. Yes, um, I could get that. She understood that maybe there seemed like we missed...they deleted a scene where they talked about it somewhere about the silver crate being important and that's how she knew. Together we're getting whatever what do you care? There's a million other things going on in the show that make no sense. We're hung up on the silver crate. Walks over to Deacon's house and is like, \"I think you're my dad,\" and then cut. That was it. That's all we get out of that. And that was like this moment I really wanted to see investigate and see how they'd all react together and we don't get that at all. No, we just get an angry drunk Deacon. Exactly. Deacon goes back down his spiral of destruction.",
            "start": 79.88
        },
        {
            "text": "I really wanted to see how they'd all react together and we don't get that at all. No, we just get an angry drunk Deacon exactly. Deacon goes back down his spiral of destruction. Maddie handles it way better than Deacon, I have to say. Yeah, yeah, I mean especially having everything she handled it awkwardly too though. Remember, cuz she was like \"You're not even my dad.\" Then and then she said, \"I want to live with you. I don't want to live with Mom. I want to go live with Teddy.\" I was like, \"What's going on?\" She's a confused teenage girl. She understood that you know it was Raina's fault. And I know in a previous video if or maybe in a future video they all go up at once, it just depends on when you watch them. Sure, sure, sure. We talked about the fact that I keep throwing Rain under the bus for this decision. I understand where she was coming from; it was both of their decisions though. It was a weird thing to do, but for season two then",
            "start": 121.48
        },
        {
            "text": "throwing rain under the bus for this decision I understand where she was coming from it was both of their decisions though it was it was a weird it was a weird thing to do but for season two then what do we want to see we've already talked about the fact that we think Deacon will get out of this this drugs and the alcohol pretty quick he'll be back to being old singing fun Deacon that we all love so much yes and you you had mentioned though that you don't want to see Deacon go back to rehab but just remember that Juliette's mom already went through rehab on the show and it was like an episode sure still I don't want to see it couple I know I mean I maybe he can just go to like quick boot camp it seems like he well it's I here's the interesting thing I guess is that and you and I believe it or not not addiction specialists oh so when his sponsor you know came over Cole  man of course and was watching through everything you don't like Cole man he's the worst what you like about Cole man uh he's",
            "start": 157.32
        },
        {
            "text": "not not addiction specialists oh so when his sponsor you know came over Clay Evans of course and was watching through everything you don't like Clay Evans he's the worst what you like about Clay Evans uh he's the biggest jerk and manipulator on the show the biggest jerk jerk on the show jerk Juliet's the biggest jerk but he's one of the biggest the Nashville thanks for watching Everybody Clay Evans' awesome I like Clay Evans fine I think it was interesting it was interesting that it turned out at the very beginning Clay Evans was the one who said that told Rayna to keep my secrets Clay Evans is doing some shady business and I don't like it one bit Yeah but he still seems like a nice guy no he got out of he got out of the mayor's office when Teddy was being bad too although he's like he's he's got some scheme going on now where he's going to try and and screw everybody and then become mayor again that's Nashville the Cutthroat world of Nashville and he's so he's telling Rayna one thing and then he's telling Deacon",
            "start": 195.88
        },
        {
            "text": "now where he's going to try and screw everybody and then become mayor again that's Nashville, The Cutthroat World of Nashville. He's telling Raina one thing and then he's telling Deacon another thing, and he told Deacon to stay away, told Raina to do this to make sure Deacon stays away, and that it was awful, he was rude, it was a bad idea, it was a bad idea anyway. He's a good sponsor, it seems, but remember, his sponsor, Deacon's sponsor Coleman said that you know, you know blah, just, and he's going to go get his new member chip or whatever like he was going to go to AA, it seemed like you might need to go right to rehab, it might you might not need to go to if you just fall off the wagon, you might not need to go to rehab, is what I'm saying. Correct, you typically, I think what well what they were insinuating on the show is that he would just start going back to meetings and then hopefully that does it and then if not I would assume rehab would be step two yeah there's",
            "start": 234.96
        },
        {
            "text": "what will what they were insinuating on the show is that he would just start going back to meetings and then hopefully that does it and then if not I would assume rehab would be step two yeah there's steps in there somewhere oh there's lots of steps that's one of the big things about it talk about Maddie at all okay well I mean like so I hope she'll have a bigger role in this show right in season I really like Lennon and Maisy I talk about them all the time there's link to their YouTube go to their YouTube stuff they're excellent they're excellent singers uh they're getting older they I thought and this is the other thing too for being YouTube Sensations that then got put on this show and stuff to be like these singers I thought they acted really well I mean I'm sure they've taking classes and doing whatever their whole lives and getting ready to be big stars they they were really good so I hope to see more of them I think it's pretty clear that they are going to end up being",
            "start": 273.68
        },
        {
            "text": "classes and doing whatever their whole lives and getting ready to be big stars they were really good so I hope to see more of them I think it's pretty clear that they are going to end up being musical acts in the show yes I'm actually hoping for a father daughter song yes oh my gosh on season two yes that and so that's what I want to see right is I want to see some quality bonding time Deacon and Maddie style just down there with their guitars picking away I do I want you know Deacon Maddie and then Teddy to all find some sort of common ground so that it's not going to be like a fist fight every time it rolls around and and see this is something I've said from the beginning too is that I like Teddy and I I feel for Teddy a lot in this show and especially in the Maddie relationship that he didn't want I understand that he raised this daughter he committed to this family he didn't want that to be ripped away from him but I think Maddie's smart enough she already showed that you",
            "start": 311.8
        },
        {
            "text": "that he didn't want I understand that he raised this daughter he committed to this family he didn't want that to be ripped away from him but I think Maddie's smart enough she already showed that you know she wanted to go stay with him called him dad still that there's more to it than just who the sperm donor is right there there's like a father there's a legacy already so I would really love to see at some point Deacon and Teddy kind of bury the hatchet but I know that's going to be super hard cuz honestly its Raina that's playing them against each other right uh not on purpose but sure not on purpose no no no just Game of Love she's the the friction between them exactly well they want some other friction anyways though it's I mean you figure Teddy did the right thing by raising the the kid when Deacon was a wreck Deacon should do the right thing by being a good dad now and like singing with her and teaching her how to come up in the industry and stuff like that it",
            "start": 350.56
        },
        {
            "text": "raising the kid when Deacon was a wreck Deacon should do the right thing by being a good dad now and like singing with her and teaching her how to come up in the industry and stuff like that it seems like they're on the same page it's just that yeah the weird thing of being in love with the same woman and and then of course Teddy not having that trust anymore of was this your whole plan Raina you know that sort of thing have you been wanting to get with him the whole time but even that I think I think the fact that they both rebounded so quickly Teddy immediately getting on top of Peggy who was the first one yeah sure but both of them kept both Rain and Teddy had keep kept their urges under control yes they they didn't cheat they they tried to make the marriage work but it was already over right that was when it was already declared over I thought he had no he with her he slept with her and then he went to the hotel and was like I'd like a divorce is that true I thought",
            "start": 388.8
        },
        {
            "text": "already over right that was when it was already declared over I thought he had no he with her he slept with her and then he went to the hotel and was like I'd like a divorce is that true I thought that was when they touched hands at the house and he's like no I believe you no they touched hands at the house and then and then it cut to them in bed together and then and then he was like okay oh you're right this this is wrong he said or something what happened and then he went did it then did it Colin quits now at that point though as a woman are you offended if if I was about to break up with you our relationship had gone down the tubes we both had already been on the ropes about this and we're talking about the fact that you know oh well this isn't working out and we're going to try and do all these things and we tried all these things and they didn't work and it was pretty much like a foregone conclusion I'm going to end this later yeah it's still still there's still",
            "start": 425.56
        },
        {
            "text": "and do all these things and we tried all these things and they didn't work and it was pretty much like a foregone conclusion I'm going to end this later yeah it's still still St there's still there's still a it's still like you don't have enough respect for me to break it off first and then go off with someone else sure that's a good point I'm just putting it out there y I think sometimes when you know the die is about to be cast though but I guess there is that whole thing that he he could have shown up and she could have said she was pregnant or she's she recants everything that's happened and she's so sorry and blah blah yeah and that would have made it super awkward yeah that would have been real awkward you put that one in your hat and N feel guys when Gunther cheats on Scarlet or whatever oh God no how did we get this far off track about it we're talking about Maddie and Deacon sorry well maybe cuz there's not a lot to talk about with M and D and we just hope that they have a good",
            "start": 467.6
        },
        {
            "text": "whatever oh God no how did we get this far off track about it we're talking about Maddie and Deacon sorry well maybe cuz there's not a lot to talk about with them and we just hope that they have a good relationship they sing some song they need to write some awesome songs together yeah yeah you think it'll happen I do I do I do too I really do I think they'll be good together and then and yeah I like I like what's happening maybe maybe that'll win best song next year on The Nashville oh yeah make sure you watch maybe Deacon can come on then and be their lead guitarist I imagine what's going to happen is the daughters get signed to Rayna's label cuz we already know that shady record guy who runs the record company but he's like such a dick yeah sure no Bucky's the manager I don't know it doesn't matter I don't remember the guy any Marshall you're good at names man God I drink too much but you imagine that he's going to make sure this happens and they get on",
            "start": 503.36
        },
        {
            "text": "I don't know, it doesn't matter, I don't remember the guy any Marshall.  Marshall, you're good at names, man. God, I drink too much, but you imagine that he's going to make sure this happens and they get on; they're great. So Len and Maisy go huge become a big deal. Well, it wouldn't be called Lenon Maisy, but yes, yeah. Well, I know I'm not it's D, be fun if they're like what band name should we have Lenon and Maisy? That would be kind of hilarious. They should just let them keep their names; give the kids a break; let them come up in the industry get them a chance that would be interesting. Yeah, all right, so that prediction is kind of in bed but it was kind of a snake's pit too. Uh, every show, every Nashville season 2 prediction we have Kristine reach into the random Wild Card prediction bag one bag has people's names in it; one bag has verbs so we know has things go the gods of Nashville decide what will happen they make a prediction we see if it comes true so Kristine reach in grab a person grabbing",
            "start": 539.84
        },
        {
            "text": "names in it one bag has verbs so we know has things go the gods of Nashville decide what will happen they make a prediction we see if it comes true so Kristine reach in grab a person grabbing a person she's doing it Scarlett oh Scarlett what's going to happen to Scarlett all right and then I don't think they don't really seem to shake when I shake it all right and then what's going to happen in Scarlett Wild Card prediction we'll see if the gods make it true on Nashville this season season two I guess this fall 2013 she's gonna quit music everybody Scarlett is going to quit music wow there you go that is a breaking AR one of the best singers going to quit music well I don't I mean I don't put it I mean she's not literally going to quit music but you know like for three shows she be like I'm hanging it up just to be with you this is Taran Killam and I have a relationship apart and or I'm pregnant or this that or the other better not be pregnant we'll make sure we see ladies and gentlemen",
            "start": 580.68
        },
        {
            "text": "hanging it up just to be with you this is Taran Killam and I have a relationship apart and or I'm pregnant or this that or the other better not be pregnant we'll make sure we see Ladies and gentlemen what are your Nashville season 2 predictions make sure you let us know in the comments make sure you leave a video response doing the same thing at your kitchen table with your comic books behind you talking about a show on ABC that you should download the link is in the description then make sure you share it with your friends so every Nashville fan in person can be part of our conversation until next time uh beyond beyond what what tagline oh right you're stealing your podcast it's not stealing it's cross-promoting",
            "start": 629.88
        }
    ]
}