{
    "id": 3119,
    "video_id": "3SmEzFZ65jE",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Greg Miller",
        "Gary Whitta"
    ],
    "title": "Why Walking Dead Resonates, Housemarque Shocks Us - Kinda Funny Games Daily 11.01.17",
    "description": "Gary Whitta joins Greg to talk about Housemarque leaving arcade games, rejoining Telltale's writers' room, and teaming up with Kinda Funny!\n\n00:06:40 - Housekeeping\nParty Mode is up -- Nick is Jason\nhttps://kindafunny.com/extralife\nThe Roper Report   -\n00:09:02 - Housemarque: “Arcade is Dead”\n00:30:15 - EA Not Rushing to Switch, via WSJ\n00:35:09 - Gary Whitta Returns to TWD\n00:49:25 - Some Sales Numbers to chew on, via IGN\n00:53:00 - PUBG GOTY? Via IGN\n01:03:38 - The official list of upcoming games\n Reader mail   -\n01:13:20 - Squad Up - Drue (PS4): the_prince09\n:: - You‘re Wrong\nTomorrow’s host: Andrea\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1509572448,
    "duration": 4771,
    "transcript_chunks": [
        {
            "text": "What's up everybody, welcome to Kinda Funny Games Daily for Wednesday, November 1st, 2017. I'm one of your host, Greg Miller, alongside Rogue One's Gary Whitta. Hello. Thank you for coming back. Am I always gonna be Rogue One? I have to come up with something new so I can be silly. You've done a bunch of, I mean, I have a self, not complaining, but sure, you've done a bunch of stuff in your career. Would be considered the met the best nut. You're actually in The Roper Report today, which is interesting. I don't know. Oh, I forgot my, I'd left my notes on. You will get your notes, alright? Because is there like an F'ing that can go get those for me? Not while JoJo is just a nice, nice woman or a nice person. Yeah, always just the F'ing business of it. I'm Harry F'ing, if anything. Are you thing? Let's let's just nip this in the bud. Two weeks ago, Gary, when it comes on Kinda Funny Games Daily, he does a great job. The next day, Andy Cortez decides he hates his job, doesn't come into work. I have to",
            "start": 0.0
        },
        {
            "text": "let's just nip this in the bud. Two weeks ago, Gary, when it comes on Kinda Funny Games Daily, he does a great job. The next day, Andy Cortez decides he hates his job, doesn't come into work. I have to call Gary Whitta back and really saw me. He's like, \"Thor can't compete with that.\" I can't compete with that. So then we get two shows with Gary, with a Rogue One's Gary Whitta, Book of Eli's Gary Whitta. We got two shows back to back with him. Everybody on the subreddit, everybody in the forums, ever in the YouTube comments, \"Gary Whitta is great! Gary Whitta is great! Hire Gary Whitta to reply.\" I don't go to those. Like, maybe I should stop visit. He's don't with you've got a big head. Go it. \"Hire him to replace Danny! Make it make Gary Whitta one of the Kinda Funny.\" Like, you and they all started knocking on my door, knocking on my Twitter to get you to come in here permanently, to have you be a reoccurring person. Ladies and gentlemen, this man wrote Rogue One, co-wrote, co-wrote Rogue One. He worked on The Walking Dead.",
            "start": 53.36
        },
        {
            "text": "knocking on my Twitter to get you to come in here permanently, to have you be a reoccurring person. Ladies and gentlemen, this man wrote Rogue One, co-wrote, co-wrote Rogue One. He worked on The Walking Dead. He's gonna work on The Walking Dead again with that. He's got a Star Wars book out right now. He's writing Rebels episodes and all stuff. Gary Whitta is does not have time to come in and do Kinda Funny Games Daily on a regular basis. A lifetime you do. I mean, it's what, an hour a week? It's my life. It's a longest essentially my lunch hour. Oh, so it's a night part. The reason why I've enjoyed doing it, it's a nice way for me to get out of the house. I'm a homebody. My wife said, \"You got to get out of the house more. Please God, get out of the house more.\" And I said, \"Well, you know, I've been doing the Kinda Funny thing. I don't if it's like a regular gig, but I enjoy going in whenever.\" But now I could, I could you, but you want me to come in like once a week or so? You want to make it official? Do you want to",
            "start": 94.92
        },
        {
            "text": "Kinda Funny thing. I don't if it's like a regular gig, but I enjoy going in whenever. But now I could, I could you, but you want me to come in like once a week or so? You want to make it official? Do you want to come once a week? You want to be, you want to be an official Kinda Funny, like every Wednesday, all coming Whitta Wednesdays. Coming Wednesday. This is why you are a media baron. Why you decided over media empire, the Rockefeller that you've taken Kinda Funny from a nickel and dimed outfit so what least like quarters and an actual whole dollars at this point. See, I like a you, you, you. It's been mere seconds of you being an employee of Kinda Funny. Look at you already, already compliment the boss man. That's right. I know. I know how to climb up the the ladder of successors. Brown-nose the the boss ladies. As this happens, this is special. Is this happening? Why you tell me, is it happening? Are you, you're officially a host now? We have to pay you. And you come in everyone. You could paint. We're gonna pay you. Oh my",
            "start": 136.48
        },
        {
            "text": "happens. This is special. Is this happening? Why you tell me, is it happening? Are you, you're officially a host now? We have to pay you. And you come in everyone. You could paint. We're gonna pay you. Oh my God, you could have got away with not paying me. Ladies and gentlemen, Gary Whitta is your new Whitta Wednesday Wednesdays until another like something more important comes along and then I'll do something else. Sure. Exactly. But yeah, we'll say, okay, yeah, let's do it now. That's the beauty of Kinda Funny Games Daily is that we have a good stable of hosts so people can move around. You want a conflict on what I also like about is like how nimble you are. Like you just made a major business decision just like boots. What I do extemporaneously just on the air. Like it's just done. You see, we have a big contingent of European fans over there. So they were really stoked when we had Danny O'Dwyer here with his lovable Irish brogue. Yeah, I mean, and then when we lost him and started going to America, he was a more",
            "start": 179.08
        },
        {
            "text": "of European fans over there. So they were really stoked when we had Danny O'Dwyer here with his lovable Irish brogue. Yeah, I mean, and then when we lost him and started going to America, he was a more cosmopolitan. Oh, what was it? Something else with an accent in here. Yeah, then you came in Euro Euro Flava. You made this folk hero speech against da last time you're here and everybody was like, \"This house in me up.\" Okay, they started painting your posters all over the wall. You're you're the voice of the consumer now. You know that big business Greg Miller. Well, I still, you know, it's been a long time since I was on the back in the day. Yeah, when I was editing PC Gamer and other magazines, I used to be on that free game gravy train. Okay. Yeah, that's why you want to work with us. Well, the reality, the sad thing about it is you do kind of lose touch with what it's like to go out and for games and play game and her be disappointed that but the part that really cases like I spent 50 bucks for this. Yeah, and it",
            "start": 219.94
        },
        {
            "text": "about it is you do kind of lose touch with what it's like to go out and for games and play game and her be disappointed that but the part that really cases like I spent 50 bucks for this. Yeah, and it sucks. I'm really, I feel kind of burned by it. And you is easy to lose touch with that when you don't have to do that anymore. I've been back buying games and you know, just a being like Johnny Consumer for a long time now. So yeah, I like to feel like I've rediscovered what it's like to just be a person, you know, playing and paying for and standing in line for video games like all the other. See, that's what I love about you in the shows you've done with us and just knowing you is obviously a friend to it throughout the years is the fact that to this show you bring such a great perspective that so many of you know, like Andrea and me and Tim and Andy, we're all in the same system of where we are right now in our careers, right? Whereas you did the whole PC Mag thing. You went off, you start writing",
            "start": 262.78
        },
        {
            "text": "many of you know, like Andrea and me and Tim and Andy, we're all in the same system of where we are right now in our careers, right? Whereas you did the whole PC Mag thing. You went off, you start writing movies and games. Then you're playing games, but you know the industry from both this consumer and development side that I think's fascinating. Thank you. Well, I mean, listen, I'm this is great. I'm happy to be be aboard. All right. This doesn't mean that you're my boss though. Oh yeah, no, it does. Yeah, yeah, for one day week, just Whitta Wednesdays for. Okay. All right. Okay. This'll be good. I need something to keep my keep me in check. Good. I need somebody keep complimenting me. This is Kinda Funny Games Daily each and every week. Dan, a variety of platforms. We run you through the nerdy video game news you need to know about before giving you perspective opinions, reading your questions, answering them, sometimes giving you bad PSN names, but mainly having a great time. Maybe like that you can watch live on",
            "start": 304.87
        },
        {
            "text": "need to know about before giving you perspective opinions, reading your questions, answering them, sometimes giving you bad PSN names, but mainly having a great time. Maybe like that you can watch live on Twitch.tv/KindaFunnyGames. But we don't check the chat. If you want to have a question read, you gotta write in to KindaFunny.com/KFGd. You can do it any time, no matter when you're watching the show. However, if you want to correct us live, which we need you to do if you're watching on Twitch, go to KindaFunny.com/You'reWrong. Tell us what we screw up as we screw it up so we can set the record straight for everybody watching later on YouTube.com/KindaFunnyGames and listening on podcast services around the globe. I'm gonna go for another perfect game today. No, no corrections. I'm sure like whatever your wrongs come in at the end, sure, they'll just be directed solely at you, not be able to find a deck. Yeah, go ahead on that way. We'll see. Yeah, we will see how Femi",
            "start": 345.85
        },
        {
            "text": "Corrections. I'm sure like whatever your wrongs come in at the end, sure, they'll just be directed solely at you, not be able to find a deck. Yeah, go ahead on that way. We'll see. Yeah, we will see how Femi for you. There's a new Party Mode up right now in YouTube.com/KindaFunnyGames. It's part two, a Friday the 13th. Nick is Jason. That of course also means there's a new Party Mode up on Patreon.com/KindaFunnyGames. For a dollar, you can get next week's Party Mode now. And then Saturday, we are streaming video games all day long, 24 hours to raise money for Extra Life. If you want to donate or be part of the stream, please go to KindaFunny.com/ExtraLife. Help us help the big beautiful kids. So I'm gonna come in for that too on Saturday, right? Yeah, that Kinda Funny. You think we'll figure out time for me to come in? Sure. And I definitely want to pitch in. What do you wanna play with unity? Well, I don't know. Do you have a you have a list of games you're gonna play? It keeping it loose.",
            "start": 385.48
        },
        {
            "text": "out time for me to come in. Sure. And I definitely want to pitch in. What do you wanna play with unity? Well, I don't know. Do you have a you have a list of games you're gonna play? It keeping it loose this year. We're making assignments for where everybody's gonna be, but then people can kind of play with in there. Not to crack the code finally on how to play with subs and not have it be a disaster. Cause pasty be like, \"Hey, we're gonna start at one o'clock.\" So everybody get ready. Oh my God, we'd go too late and then we'd cancel something and then people get mad understandably so. I do do this thing on with GamesBeat. They do a thing on Friday PUBG. No games were that they play with the community. Yeah, but it's a nightmare trying to, you know, you have to give a name to the server and they it's really, really hard to coordinate community code play. You guys have cracked the code. Yeah, okay. Cause we just play on PSN and we're like, \"Hey, we're putting in some only mo' chat at your PSN right now.\" If you complain, I",
            "start": 429.43
        },
        {
            "text": "hard to coordinate community code play. You guys have cracked the code. Yeah, okay. Cause we just play on PSN and we're like, \"Hey, we're putting in some only mo' chat at your PSN right now.\" If you complain, I remember like when Giant Bomb used to do like Thursday Night Throwdown and that it's always a nightmare trying to get people in. You're herding cats. Yes. It's pretty people shot their PSN, their name or whatever it is. They're not logged on yet. So you wait. They got the wrong firmware. It's some wood. You know what? So do you try to do you try to play games that are competitive or do you do speedruns? Like, you know, what do you know from calm a little calm B? That's kind of is whatever it's dealer's choice. Okay. We have this Kinda Funny World Championship. We got to decide how that's Kate. We got to get Xavier Woods, Commissioner of the Kinda Funny World Championship on the phone. See how that's being defended. I want to plant him Destiny. The Prince of Platinum's Josh gravel look says, \"I can't.\" But I'm gonna",
            "start": 467.65
        },
        {
            "text": "Woods, Commissioner of the Kinda Funny World Championship on the phone. See how that's being defended. I want to plant him Destiny. The Prince of Platinum's Josh gravel look says, \"I can't.\" But I'm gonna prove him wrong. I think Tim wants to get some more of them Mario moons. You ever heard of the Super Mario Odyssey? I have. I've heard about it. It's pretty good. It's pretty, it's pretty good about it today. I'm sure. Okay, good. You got to get those moons. Everything system. It just moons dominance and Multi-Moons. Not the motto moons of all team. There's nothing quite like nothing. Multi-Moon. So some you figure out. Let me know what you're doing and I'll figure out. Yeah, don't give me. I'm your boss. Remember? Don't give me. Go through proper channel. Exactly. Joey, if you want to talk to me for now, let's begin the show with what is and forever will be The Roper Report. Yeah, that's right. Kev, number one. Housemarque has put up a post on their website saying, \"Arcade is dead.\" Gary, I was floored when I read this. I I just",
            "start": 506.41
        },
        {
            "text": "with what is and forever will be The Roper Report. Yeah, that's right. Kev, number one. Housemarque has put up a post on their website saying, \"Arcade is dead.\" Gary, I was floored when I read this. I I just read it this morning and I to my jaw was was was in a lowered position. You know, Housemarque listener, viewer, we're talking about Super Stardust HD. We're talking about Dead Nation. We're talking about a whole bunch other game, Resogun, which I love. Let's just read out. Well, I'll get to all these. We're gonna read the post here from the CEO of Housemarque who so much. I won't put your his name. I think so. I think it's really interesting. I it's it's it's it's it's I feel like it's newsworthy enough that it's okay to do it unabridged. Thank you. Remember, you're my employer. You know, you're not use to all you go. Yeah, boss. Yeah, I like when it when I was doing this just as a favor, I could come in and do whatever I want. Now that this relationship has been formalized, I feel like this is a new dynamic emerging. I'm",
            "start": 547.24
        },
        {
            "text": "boss. Yeah, I like when it when I was doing this just as a favor, I could come in and do whatever I want. Now that this relationship has been formalized, I feel like this is a new dynamic emerging. I'm not sure I haven't feel about it. Housemarque CEO writes letter to fans for more than 10 years. We've been carrying the torch for arcade, bringing arcade coin-op inspired games to the market with a Housemarque twist. And I think it's fair to say we've gotten pretty good at it by now. Our games that receive great critical reception over the years, perhaps the best example being Nex Machina, which we published in June to great critical acclaim, garnering a Metacritic score of 88. Nex Machina was a dream project as we got to work with our hero, an arcade gaming legend, Eugene Jarvis. I jump ahead a bit. However, despite critical success in numerous awards, our games just haven't sold in significant numbers while some of them have reached a massive audience due to free game offerings across various digital",
            "start": 604.42
        },
        {
            "text": "despite critical success in numerous awards, our games just haven't sold in significant numbers. While some of them have reached a massive audience due to free game offerings across various digital sales channels, this unfortunately doesn't help pay for development, which gets costly for high production quality. We are extremely grateful to our fans and partners who have enabled us to work on awesome games like Super Stardust and Outland. For your unfailing love and support, we thank you from the bottom of our hearts. But now it's time to move on to new genres. Lackluster sales of Nex Machina have led us to thinking that it is time to bring our long-standing commitment to the arcade genre to an end. While this genre will always hold a special place in our hearts, the industry is moving more towards multiplayer experiences with strong robust communities, and it's time for Housemarque to move forward with the industry. Hence, Nex Machina and Matterfall will be the last of their kind coming out of",
            "start": 642.94
        },
        {
            "text": "multiplayer experiences with strong robust communities, and it's time for Housemarque to move forward with the industry. Hence, Nex Machina and Matterfall will be the last of their kind coming out of our studio. Our purpose as a company remains the same, however, to create enjoyable and memorable gaming experiences for players while simultaneously creating a great workplace that allows people to flourish both professionally and personally. Looking ahead to our next projects, we are exploring something totally different than what you might expect from us, but we believe this will lead to the creation of even more engaging gaming experiences. Our core values remain the same, gameplay first with first class execution. We are really excited about our new projects and look forward to unveiling our first game from the new era of Housemarque. Holy shit, what an honest, unblinking response from Housemarque on this. And just very much like, \"Hey, thank you for supporting this person who would read this.\" But",
            "start": 684.49
        },
        {
            "text": "game from the new era of Housemarque. Holy shit, what an honest, unblinking response from Housemarque on this. And just very much like, \"Hey, thank you for supporting this person who would read this.\" But it's just not having. First of all, I I it is, it's rare to read a statement as as frank as that, don't you think? Usually what you get in terms of press releases, and we just saw this recently with Visceral, yeah, and the official line of EA, it was just, it was pablum. It was just fluff. Yeah, it's just a bunch of word salad. You know, what does that mean? We're gonna say a lot but say nothing. Right. Exactly. Like you said a lot of stuff I didn't really understand. You said nothing at the same time. But this is remarkably frank. This is what I love about where we're at in the industry is that you have developers that are not this small. Like I'm insulting Housemarque. Housemarque's a great studio, but that no one owns them. They shareholders or whatever. They can just say whatever they want. Now, beyond that, of course,",
            "start": 727.69
        },
        {
            "text": "that are not this small. Like I'm insulting Housemarque. Housemarque's a great studio, but that no one owns them. They shareholders or whatever. They can just say whatever they want. Now, beyond that, of course, this is I think it's interesting on, you know, I mean, they what's interesting about this, I mean, they chose the title is it and just say, \"We're getting out of the arcade games business.\" They said, \"Arcade is dead.\" It almost was like this is a broader statement. They're basically saying, \"We're getting out of this business because this genre, games, classic old-school coin-op inspired arcade shooters, yeah, that's that's a dead business now. So we're getting out.\" That's I mean, that's a much broader statement. And also very certainly for gamers of a certain age like me, very quite a sad statement to make. But you're hard to argue with. Yeah, and that's the thing, right? Is that they are at the top of that pyramid. They're they're the king of the castle, writing the hill when it comes arcade games like that.",
            "start": 773.23
        },
        {
            "text": "but you're hard to argue with. Yeah, and that's the thing, right? Is that they are at the top of that pyramid. They're they're the king of the castle, writing the hill when it comes arcade games like that. Because yeah, Resogun is awesome. Dead Nation is awesome. Nex Machina is awesome. But they're being out there saying, \"Hey, we're the when you think of a great game, when you think a gameplay is king, when you think about you what who's doing these games right? We are unequivocally doing them right. And we can't make a business out of it.\" Okay, so why why why? I mean, this they've been very upfront and saying, \"Let people just ain't we're making is not at the game suck.\" Yeah, they're great. They're making they are they are the state of the art for like what an old-school arcade. Like Resogun is basically Defender within a cylinder. Yeah, and it's brilliantly done. It's beautiful. It's great. It has all the classic twitch-based like it touches presses all the buttons that Defender and Stargate in those games back",
            "start": 815.5
        },
        {
            "text": "within a cylinder. Yeah, and it's brilliantly done. It's beautiful. It's great. It has all the classic twitch-based like it touches presses all the buttons that Defender and Stargate in those games back in the day did, but with you know, fancier graphics. Sure. Why aren't get why why are video game players no longer responding to those games? Because they're so people ain't buying the games that I think. I think it's a niche market. And I think that much like when we talk about what what I was talking on the Bombcast yesterday about like Bethesda and the performance of Evil Within 2 and Dishonored 2. What were their goals? What were their sales goals? Was that game a success to them? I think for a Housemarque, they are a fairly large independent studio that makes great games. But if you're gonna get more people in there, ever gonna like you figure they had have hired more people to work on these two projects, right? Because Matterfall and Nex Machina came out within months of each other, which is rare",
            "start": 856.39
        },
        {
            "text": "for a Housemarque game, right? You figure they I would assume grew to an extent of, \"Hey, we need to be able to produce these games.\" And then they produce those games and they didn't sell that much. It's one of the it's always the thing of what a success to EA is very different than what's a success to the development team of seven people. I mean, I don't disagree that this kind of game has become a niche genre. Certainly it has, you know, just really only at the indie level, which is fine. You don't need triple-A budgets to make these guys. That's part of the appeal. But you know, Joey, there's always been a Geometry Wars or you know, Super Stardust or something out there plugging away. And I understand that as retreated into into a niche genre. But now it seems like it's it might be. I think it I think it'll still",
            "start": 896.71
        },
        {
            "text": "Wars or you know, Super Stardust or something out there plugging away. And I understand that as retreated into into a niche genre. But now it seems like it's it might be. I think it I think it'll still always be around. But it seems like increasingly now what you're gonna get is that stuff like Pac-Man Championship Edition DX where the share and but people will always be looking for Pac-Man. I know what that is. And I love Championship Edition DX. It's fantastic. And there are all there will always be games like that. But the original ones, the Resoguns, the Geometry Wars or Super Stardust, if they're going away, that's really sad. And maybe younger gamers who grew up a generation after the likes of me will feel less sad about looks. They don't have that same connection. But it's someone who remembers the days of pumping, wait for me, used to be like ten pence pieces and fifty pence pieces into an arcade game in the back corner of some dusty video arcade. That was the shit. That was what got me into video",
            "start": 933.01
        },
        {
            "text": "of pumping, wait for me, used to be like ten pence pieces and fifty pence pieces into an arcade game in the back corner of some dusty video arcade. That was the shit. That was what got me into video. I'll of that. He's the love arcade games and coin-ops. And obviously arcades have gone away, but that style of gameplay was surviving. And now this feels like a big bellwether. Like if Housemarque are getting out of one of the one of the top developers are saying, \"We're getting out because it's just not viable anymore.\" I feel like this shit is this kind of gate, this kind of video game, which is so specifically connected. Its roots go all the way back to the the genesis of video games of Space Invaders and Pong and Defender. If that's going away, that's really sad. But here's my question for you. Isn't this if we talk about Housemarque leaving this space, the arcade space, and then say, \"Well, arcade games in general are dying.\" And I mean, arcade games on a digital platform, not an arcade. Aren't we similarly",
            "start": 974.65
        },
        {
            "text": "if we talk about Housemarque leaving this space, the arcade space, and then say, \"Well, arcade games in general are dying.\" And I mean, arcade games on a digital platform, not an arcade. Aren't we similarly doing the same thing we're doing a single-player? We're sure the people who were doing it the best are leaving it and gonna go in a different direction. But isn't that in a way, and this isn't me insulting games, them growing up, them taking this next step to a bigger game, a bigger project? Because my argument would be that, you know, for your Geometry Wars, your things that these are simple games, great graphics, different things. People gonna put twists on them and stuff. I still think that the independent market has the ability to make those. I still think when you put together, \"Hey, where'd this new studio and we're trying stuff out and we just want to focus on gameplay.\" They're gonna make something like that and there put that out and that'll be have a chance for a greater success because there's less",
            "start": 1020.73
        },
        {
            "text": "and we're trying stuff out and we just want to focus on gameplay they're gonna make something like that and there put that out and that'll be have a chance for a greater success because there's less baggage or I really feel like Housemarque comes out of the gate does Super Stardust and then expectations begin they start signing two different deals they start growing and growing and growing but they get to this point that the smaller games they've made in the past for a dedicated audience just aren't paying the bills I don't think there's anything I don't feel like games like you know Resogun or Geometry Wars or Pac-Man DX or any of those kind of classic you know video game there's old coin up style titles and I don't think that they are any I don't think of those as like kids games oh yeah complicit that's not I mean they are often the greatest barometer of your skill as a gamer it's like you know what's your high score in Defender oh yeah you know Next Machina is tough if you want to go",
            "start": 1061.98
        },
        {
            "text": "that's not I mean they are often the greatest barometer of your skill as a gamer it's like you know what's your high score in Defender oh yeah you know Next Machina is tough if you want to go through there I mean you could argue that is like twitch game played is still down to its purest essence and I think there will always be apparently a shrinking but there'll always be a market for it I think just what's happened is though as the gaming has evolved so much around it and you're looking like Assassin's Creed Origins and mountain rounds and and you know even something like Mario Odyssey where they took they took a classic concept it's continued to evolve and grow become more and more sophisticated but while still you know really retaining that classic feel games that are unapologetically kind of throwback retro style games within the context of everything else around them maybe maybe they do look like maybe things that they look less appealing and again the the the kind of people who",
            "start": 1097.19
        },
        {
            "text": "kind of throwback retro style games within the context of everything else around them maybe maybe they do look like maybe things that they look less appealing and again the the the kind of people who have a natural affinity those games of my age you remember playing them back in the day where there's some nostalgic appeal maybe we're just aging out of the market and getting and gamers that are coming up you know the younger generations of gamers just don't have that same connection to those games the historical connection right the letter here says the industry is moving towards multiplayer experiences with strong robust communities and it's time for Housemarque to move forward with the industry but is there would there be a way though to combine those two could a very smart developer create a brilliant Defender or Stargate or a Tempest-style game that actually could work in a multiplayer social community context I don't know that I would think so be an amazing thing to try to do cuz",
            "start": 1135.23
        },
        {
            "text": "a brilliant Defender or Stargate or a Tempest-style game that actually could work in a multiplayer social community context I don't know that I would think so be an amazing thing to try to do cuz here's my thing I think when you read this I'm putting Mario Odyssey into that conversation because Mario Odyssey right now is a community movement when I talk to somebody else who plays games they're playing Mario Odyssey and we get to talk about it similar to when Pac-Man Championship Edition originally hit and Dave Clayman was obsessed with it all of IGN was obsessed with it we all talked about it right right that the games from Housemarque wall great the more and more they put out the less and less special I guess and I'm not insulting Housemarque I'm just saying like Super Stardust everybody was all over a Dead Nation people I remember having conversations with Shu and Sid on Twitter about Dead Nation but Next Machina did feel like I was playing you know vault by myself I believe",
            "start": 1175.19
        },
        {
            "text": "was all over a Dead Nation people I remember having conversations with Shu and Sid on Twitter about Dead Nation but Next Machina did feel like I was playing you know vault by myself I believe Mario is in the air supply right now because it's so great and everyone it's like you know million copies in a week or whatever and everyone's playing and it's the game of the moment for sure and well deserved it's a fantastic game but that's still unapologetically a closed-off single place not like someone else can jump into you're into New Donk City with you and start playing with you right what I'm saying is it is and I'm just completely making this up as I go would it be possible to resurrect the classic coin up shooter arcade genre by finding some way to make it social sake and maybe I drop into your game of you know whatever it is you know Resogun or geometry world superstar whatever it may be is there a way to kind of bring that multiplayer that social appeal and resurrect a classic genre",
            "start": 1216.68
        },
        {
            "text": "your game of you know whatever it is you know Resogun or geometry world superstar whatever it may be is there a way to kind of bring that multiplayer that social appeal and resurrect a classic genre that way I have no idea how you would even be I'm just asking the question I totally think so and I go back to last year when I fell in love with the game called Sparkcade you ever play this on your mobile device Sparkcade okay a Greg Canessa former the guy who started Xbox Live okay I'd overrun this thing it started this game up of course ooh disclosure after we talked about an interview Greg Canessa and I started playing it we did do a sponsorship with them at the end of the year so take all the grain of salt if you want but the idea was that it I love Tetris Sparkcade took Tetris and a couple other classic games put them into this mobile app and then had it where you could go challenge other players and you could if you could earn tokens in the thing to then bet on token only thing or",
            "start": 1259.01
        },
        {
            "text": "other classic games put them into this mobile app and then had it where you could go challenge other players and you could if you could earn tokens in the thing to then bet on token only thing or you could put real money in and play for real money in bet other people but what was interesting about it is it took everything I loved about trophies or Xbox Live and put it into one thing where I was leveling up which unlocked me new avatars which unlocked me better daily bonuses then when I'm playing people I could add them to my friends list so I would have challenges going back and forth with my friends so suddenly Tetris we should always been a very solitary experience I'm just playing Game Boy I'm playing it wherever suddenly became oh I'm now playing games of Tetris with a dozen Kinda Funny best friends out there not for real money some for real money whatever but I'm playing into that thing and doing it where I feel like all of a sudden there was a Sparkcade community doing it I'm",
            "start": 1298.19
        },
        {
            "text": "best friends out there not for real money some for real money whatever but I'm playing into that thing and doing it where I feel like all of a sudden there was a Sparkcade community doing it I'm just wondering what the real in trying to diagnose this yeah I'm wondering what the real issue is is it that people only want games that have some kind of social multiplayer connection Super Mario Odyssey which seems to suggest no because that again is a single-player experience there's no social and multiplayer aspects and yeah it's so well done everyone of course is is loving it and it's fantastic and doing very well so is it there is the problem simply that even if you added multiplayer and social aspects to you know a classic arcade style shooter you know done in a modern style that people would still look at and say that feels old-fashioned to me like it's still like d twitch shooting I understand that it has historical roots but like I just did gaming tastes again as more generations of",
            "start": 1334.88
        },
        {
            "text": "still look at and say that feels old-fashioned to me like it's still like d twitch shooting I understand that it has historical roots but like I just did gaming tastes again as more generations of gamers are growing up that grew up after that that coin up that arcade genre that don't have that sentimental connection to it it's just it's just just it doesn't appeal to them the same way I mean may well be as sad as it is that they would like like a style of music that's never really gonna come back that this is just that this kind of gaming is just now out of fashion and will and will forever be the province of like crusty old gamers like like you and me well I think it'll always come back into fashion though I think they'll always be a breakout jb's will come back again and again exactly I think we what I think this letter to me says is that for arcade for Housemarque is dead because there's a ceiling to that those kind of games right now based on their extensive experience only sell",
            "start": 1376.73
        },
        {
            "text": "I think we what I think this letter to me says is that for arcade for Housemarque is dead because there's a ceiling to that those kind of games right now based on their extensive experience only sell so many and only get so far Housemarque wants to be a developer that's around another I would say the good news about it though is it because this style of game is so I don't want to I don't mean this is a pejorative but it's it's primitive right you don't mean it fancy graphics yes you know it's a very select Defender and Pac-Man and Space Invaders with very simple ideas simply executed but there's something inherently compelling and about thing you know you what you want to keep playing you want to keep pumping the quarters in that's why those games are classics the good news about that is because the the the barrier to develop potentially is so low there will always be indie developers that can afford to keep plugging away exciting those things act like there's a game on Steam right",
            "start": 1416.12
        },
        {
            "text": "because the the the barrier to develop potentially is so low there will always be indie developers that can afford to keep plugging away exciting those things act like there's a game on Steam right now called 20XX and have you played it it's essentially Mega Man yeah on PC yeah and it's fantastic it's a brilliant game if you loved Mega Man it's it's an amazing got away with it frankly because it is really cheeky like the director which it is Mega Man is astonishing but it's a little developer and I can't imagine it costing a lot of money to make it so you can still you know if that's your nostalgia you have to remember people making games are still the ones that grew up with that original genre where we're gonna be two three generations from now who knows but for right now there are people that still want to hearken back and I would argue that considering it is the original genre that it is you know those kind of games are where gaming began that there will always be some fondness for",
            "start": 1461.21
        },
        {
            "text": "that still want to hearken back and I would argue that considering it is the original genre that it is you know those kind of games are where gaming began that there will always be some fondness for them but I think it's gonna become less and less you lost me I find these games but the day of them being a genre that you would put a like we're going you've got your it's like no one makes like Sims anymore right no one makes real time strategy games really anymore we're talking about this right at the PlayStation conference oh they're putting out a tennis game all right what happened to the tennis games genre oh they're putting out you know arcade racer games like oh yeah remember when there was a million of those there was everybody look there was a tennis game everywhere you looked it was motor any at any given time there there's a subset of game genres that are in vogue yeah so like right now obviously first person shooters has continued to be popular open-world Assassin's Creed",
            "start": 1500.4
        },
        {
            "text": "was motor any at any given time there there's a subset of game genres that are in vogue yeah so like right now obviously first person shooters has continued to be popular open-world Assassin's Creed exploit you know exploring sandbox type games yeah correct GTA they're very good everyone's kind of chasing that because that's where the big things are and like you said fashions change and you know flares flared trousers will be back again soon and for now and the 90s are back right now and the 80s will be back again in 20 more years this is weird to think that this age that we're living in 30 40 years from now will have a comeback oh yeah right everything goes around in this great circle of life but again its bottom line is someone who grew up on this old style game as inevitable as it is as you know kind of just the seismic geological evolution of of this art form continues there things are gonna its continued are going to increasingly disappear into the past they'll always have",
            "start": 1539.91
        },
        {
            "text": "is as you know kind of just the seismic geological evolution of of this art form continues there things are gonna its continued are going to increasingly disappear into the past they'll always have historical significance but less and less will they be the kind of games that we play today and it's it's inevitable and maybe it's just the it's a reality but it personally saddens me it personally saddens Eric who wrote into KindaFunny.com/KFGD and says hey Greg and Gary I went to look at the gaming news for the day and I saw a strange headline arcade is dead I didn't think much of it until my eyes wandered to the source that is when my heart sink Housemarque Games holy **** I'm sure many of us know the feeling of watching an issue genre series or games struggle despite their quality and the passion that goes into them but this one is extra hard to see Greg talks about how in game of the year discussions people at places like IGN will campaign for their game and one they know",
            "start": 1582.45
        },
        {
            "text": "and the passion that goes into them but this one is extra hard to see Greg talks about how in game of the year discussions people at places like IGN will campaign for their game and one they know doesn't deserve the mainstream appeal to win in the votes but feels deserving of the title nonetheless for me that would have been Next Machina Next Machina is perfect actually perfect but it is a perfect arcade game and I guess that is just not good enough I don't think that arcade games are dead I think that if a genre can make good games that will last forever for right now though a moment of silence as a great arcade games take a pause for however long that may be good luck to Housemarque on whatever they do next long live the kings of gameplay P.S. everyone should still go out and buy Next Machina and I believe it is getting a physical release soon also Matterfall while not perfect it's still a solid Housemarque game and currently on sale on the PlayStation Store I'm gonna pick up Next",
            "start": 1623.83
        },
        {
            "text": "and I believe it is getting a physical release soon also Matterfall while not perfect it's still a solid Housemarque game and currently on sale on the PlayStation Store I'm gonna pick up Next Machina I say I'm part of the problem I like you you should it's real good it's awesome like that's the thing is like you play it and it's great and you run through it but I guess it's the same thing I have always with the exception of Dead Nation which really pulled me in Alienation I liked a lot and would have gotten into deeper if there wasn't the bug like that are always as in a Housemarque game for people with a million trophy hunter friends it's the thing of you play them over and over again and I feel like that's what's not in vogue anymore is playing games over and over again to try to get a better score to try to get you because you figure I'm like over again so much of what we consider like that just just the vernacular of games like high score like when's the last time you talked about your high",
            "start": 1666.01
        },
        {
            "text": "score to try to get you because you figure I'm like over again so much of what we consider like that just just the vernacular of games like high score like when's the last time you talked about your high score in a video game right that's that's old man talk yeah leaderboards aren't even right like what we used to what we used to call clocking a game where you whether you get to like 99999 and the score resets high scores are gone like you don't think about high score anymore like your achievements in games are or have evolved so much more there's so many more sophisticated ways to measure achievement in a game yeah but the idea of like a high score that's something that exists in like you know classic game tournaments and things that they still have like Donkey Kong tournaments and etc. but it's no longer part of how it's just no part of no longer part of games are designed and that's back to what they're talking about really feel with the multiplayer community stuff not even like oh",
            "start": 1706.87
        },
        {
            "text": "it's no longer part of how it's just no part of no longer part of games are designed and that's back to what they're talking about really feel with the multiplayer community stuff not even like oh it's got it they're gonna make **** Destiny the way that it is just like how do you excite a community how do you make people interested in like what is the high score what is the new high score for video games and it is in Destiny its loot it's this armor in you know it's a chicken dinner in PUBG it's all these different things that you get proud of but you're not proud of the fact that I mean even I don't even here in the genre I don't play much multiplayer stuff is it really knows in terms of shooters you don't hear about kill death ratio that much anymore is worried for a while that was the big Battlegrounds it's still a big metric okay um but I know what you mean there's a met the metrics have become so much more sophisticated do you remember I miss putting my initials into",
            "start": 1746.77
        },
        {
            "text": "the big Battlegrounds it's still a big metric okay um but I know what you mean there's a met the metrics have become so much more sophisticated do you remember I miss putting my initials into high score tables do you still remember what GGM, GJM, GJM yeah okay what's them BJM, GJM, HJM yeah yeah I used to do GLW that was always me what would sell for L. Leslie that's my middle name I don't know that yeah okay yeah we're learning a lot about you know now that I'm on the team I fell open up number two EA is not rushing to the Switch this is according to The Wall Street Journal whose tech reporter put out this Dow Jones Newswires screencap EA and no rush to make more video games for a Nintendo Switch market och Electronic Arts is waiting until Nintendo's new Switch has been on the market a full year before deciding whether to release more games for it besides FIFA 18 the company's finance chief Blake Jorgensen tells The Wall Street Journal the",
            "start": 1779.56
        },
        {
            "text": "new Switch has been on the market a full year before deciding whether to release more games for it besides FIFA 18 the company's finance chief Blake Jorgensen tells The Wall Street Journal the Switch both a home console and portable gaming device launched in March and EA soccer game was released on at late September. Jorgensen says it's too soon for EA to judge the success of FIFA 18 on the device and wants to fully understand what the demand is for Switch before committing more resources to it just to toss out there because we're always worrying talking about what a third party's gonna do for the Switch where's that going yeah I think with the success at seeing they'll have to figure it out if they want to be on don't have to figure it out but again at the also don't care that much yeah again if you want Nintendo oh I think that the Switch at this point it's funny you look up go back in the Wii U the conversation was for a big part of it well can the console can",
            "start": 1829.9
        },
        {
            "text": "much yeah again if you want Nintendo oh I think that the Switch at this point it's funny you look up go back in the Wii U the conversation was for a big part of it well can the console can such a system survive without major support from the likes of EA and Activision yeah and the answer at the time seemed to be now yeah now that Nintendo has really got its house in order so much more they get so many like more great triple-A releases in the first year than you typically say over the whole life of an old style like a GameCube or whatever yeah and again such great we talked about a million times such great indie support I don't think they need them I don't think they need here EA I don't think they need Activision and again if you if you want to play Battlefront or Destiny or whatever chances are again we talked about maybe Switch is the first console under constant survival as like the one and only console that you own yeah I'm guessing most people have an Xbox or",
            "start": 1868.93
        },
        {
            "text": "or whatever chances are again we talked about maybe Switch is the first console under constant survival as like the one and only console that you own yeah I'm guessing most people have an Xbox or PlayStation is just going or PC go over there you're gonna play the EA and Activision the big triple-A high system spec games with big multiplayer communities and against which that's one things which can't offer you is like multiplayer community just come over there the Switch will be over here doing its own which continues its momentum though where people are like every time a game yes and that's like isn't running on Switch you know is happening there I think EA is gonna see dollar signs in that and Activision will see dollar signs yeah they're gonna they're gonna go with the money is that this there's obviously still you know looking at the viability of it it's probably still more expensive to make when they say making aim for this Switch I I would I would much rather here's what I'd much",
            "start": 1912.72
        },
        {
            "text": "there's obviously still you know looking at the viability of it it's probably still more expensive to make when they say making aim for this Switch I I would I would much rather here's what I'd much rather do yeah if I was head of EA or certainly as a consumer looking at them I would rather EA rather than them saying well yeah here's FIFA on the Switch here's you know a Battlefield one on the Switch or whatever create a Switch games division and make games that are tailored for the Switch that worked great for the Joy-Cons rather than settle **** how do we make Madden work with the Joy-Cons this year that's bad versions of those games do build for the system don't just pour over stuff and try and chew on it into a system that is technically inferior because it is is multiplayer inferior is is very wacky in its control scheme Nintendo does well and indeed really well on the Switch to they build games for the Switch and play to its strengths do that create a Switch",
            "start": 1948.34
        },
        {
            "text": "division inside EA and say make great games for the Switch and clearly at this point you simply seeing any developer saying we're seeing better sales on Switch than any other platform maybe the time is right to do that but I don't care about Battlefield or you know the big EA games on the Switch I'll play those somewhere else on systems that are better tailored for those games you're preaching and you're preaching the word there I think that's what the success will be and what I honestly think will happen is that as the Switch marketplace becomes flooded there are so many games out there and indies start to see less success not none none or anything but it becomes like PSN or Xbox Live well there's just way too much stuff where a developer like Housemarque is being overshadowed just by the sheer",
            "start": 1987.52
        },
        {
            "text": "start to see less success not none none or anything but it becomes like PSN or Xbox Live well there's just way too much stuff where a developer like Housemarque is being overshadowed just by the sheer number of games I feel like that's when EA and Activision is you can be like hey let's partner with this game you guys are come pitch us your cool game that is indie but we want to put on Switch don't want to help you it's in there interesting have EA on the platform yet in the right way because it's not it's not helpful to anyone I hope it to EA or Nintendo to see stuff like oh yeah here's Battlefront 2 on the Switch but it kind of sucks compared to the other versions yeah nobody wants that like build games for the Switch make the best games you can again encourage more you know mid-range indie development lower risk but potentially big rewards because the Switch is clearly you know exploding as a platform and then there's a big opportunity for EA I'm a I'd like to think no",
            "start": 2025.86
        },
        {
            "text": "mid-range indie development lower risk but potentially big rewards because the Switch is clearly you know exploding as a platform and then there's a big opportunity for EA. I'd like to think no people smart enough inside EA that they're already given this a hard look, they're just not really ready to announce anything right now. Of course, it was easy to ignore the other previously Nintendo systems because they just weren't, there's no viability there. The Switch is a different story right now, it's completely changed the game in terms of way that developers and the public are looking at Nintendo, but you just got to be just got to build games for it instead of trying to jam in things that don't really belong on that platform. Correct, Gary Whitta, you're smart man. I got it right. That's what I'm gonna say, that I got this one right. Okay, good. My opinion is correct. Yeah, well, I don't write into Kinda Funny that complex, you're wrong with opinion corrections. Try to read my thanks. Here comes a ****.",
            "start": 2063.78
        },
        {
            "text": "I'm gonna say that I got this one right. Okay, good. My opinion is correct. Yeah, well, I don't write into Kinda Funny that complex, you're wrong with opinion corrections. Try to read my thanks. Here comes a **** story number three. Gary Whitta is returning to The Walking Dead. What is this? How did this get in there? Right, so what they did is they announced that they're doing a Telltale Walking Dead Collection. It's coming out December 5th on PlayStation 4 and Xbox One. It is every episode of The Walking Dead, this Telltale series, before the news thing because they're doing one final season. I don't know if you've heard about it. I I'm just reading about it now. They're doing season of The Walking. Right in their press release about this Walking Dead Collection, they say in addition to the announcement of this upcoming collection coming out December 5th, PlayStation 4, Xbox One, Telltale also confirmed that Gary Whitta, Rogue One: A Star Wars Story, The Book of Eli, will be returning to Telltale's writer room.",
            "start": 2097.65
        },
        {
            "text": "upcoming collection coming out December 5th, PlayStation 4, Xbox One, Telltale also confirmed that Gary Whitta, Rogue One: A Star Wars Story, The Book of Eli, will be returning to Telltale's writer room, writers' room as a story consultant for the series' upcoming fourth and final season. Whitta was part of the BAFTA Award-winning team of writers on the first season of the Telltale series and will be collaborating with Telltale and the creative team at Skybound Entertainment on the final chapters of Clementine's story. Quote, collaborating with Telltale on the first season of Clementine's. Surely need to do that voice. That's how I read this quote from Gary Whitta. Yeah, yeah, collaborating with Telltale on the first season of Clementine's journey through the world of The Walking Dead was one of the highlights of my career. So reuniting with them to bring her now, sir, story to a close. That's my career. So reuniting with them to now bring her story to a close where the final season feels like a homecoming, said.",
            "start": 2134.81
        },
        {
            "text": "of my career. So reuniting with them to bring her now, sir, story to a close. That's my career. So reuniting with them to now bring her story to a close where the final season feels like a homecoming, said Whitta. Clementine has become not just one of the most compelling characters in The Walking Dead Pantheon, well, I can tell you actually wrote this, but the one of the great video game characters of all time. I hope we're able to do justice to her and to her millions of fans. This one, this one feels special. Writes this stuff. You did a job offer came over, talked about PR pablum, yeah, earlier, like words, meaningless words, salad. I guess I'm as guilty of it as the next man. Well, this is the problem, right? They come to you, hey, give us a quote about this thing around your weight, a secret. They asked me for a quote and I and I bashed one out. They asked me for a headshot. I said I don't have any good ones. Good luck with Google Image Search. I'm just gonna be that wonder why a Star Wars helmet again. I've every",
            "start": 2174.65
        },
        {
            "text": "and I and I bashed one out. They asked me for a headshot. I said I don't have any good ones. Good luck with Google Image Search. I'm just gonna be that wonder why a Star Wars helmet again. I've every day I got, you know, I have to get I have to find someone that can do a decent, I mean, I don't think it's it's it's possible, but like a decent headshot of me being. I'm glad I like literally whenever I'm in the news on whatever it is, like people go to Google search and leap it literally like a holiday snap or whatever. You know, there's no actual picture of me that's well. Now that you're a piece of Team Kinda Funny, we do have photo shoots all the time for now. Oh, well, maybe I think maybe I could get Sean Finnegan get a shot. We'll take one for you. We can add it to the Reddit too because the Subreddits got all our faces up there. That's a lot of work. A lot of things got to change now that you're here, you know. Yeah, yeah, I feel like this, I'm professional. Is it gonna be like a shopping montage where you",
            "start": 2229.64
        },
        {
            "text": "all our faces up there. That's a lot of work. A lot of things got to change now that you're here, you know. Yeah, yeah, I feel like this, I'm professional. Is it gonna be like a shopping montage where you take me to all the finest places, more respectable? Great. Congratulations. Thank you. It's so weird because I honestly, there's a complete coincidence that I knew that they were going to announce this, but I didn't know the dad. David, you knew I was coming back in here, but I didn't know the day and it ended up being the same day. That's awesome. Are you a lot of pressure? You excited? You got to end Clementine's story. Gotta land this plane. It's really interesting. There's only so much I can say about. Of course, of course. It's it's really interesting that I was talking to someone about this the other day that, you know, there are these there are many different iterations of The Walking Dead, but the ones that I consider like the three kind of main cornerstone pillars of it are of course the comic, yeah, the AMC TV",
            "start": 2266.78
        },
        {
            "text": "know there are these there are many different iterations of The Walking Dead, but the ones that I consider like the three kind of main cornerstone pillars of it are of course the comic, yeah, the AMC TV show, yeah, and I think legitimately the Telltale games, I don't have earned that the right to be to be spoken of in the same breath with the with the with the TV show and the comic books. This will be the first iteration of The Walking Dead to come to a definitive end. This story, Clementine's story, is going to end. And so we had to a bit. I've already been in the writers' room and sat around with a lot of the talented Telltale writers to figure out like what it what is gonna be Clementine's journey and what's going to be her story as we now bring because there won't be any more. This is the last time Telltale is gonna do one of these games, so you can't just leave it. Yeah, like you have to do has to be, you know, an end. The story has to end in a way that is satisfying for all the players out there who love",
            "start": 2310.01
        },
        {
            "text": "is gonna do one of these games, so you can't just leave it. Yeah, like you have to do has to be, you know, an end. The story has to end in a way that is satisfying for all the players out there who love Clementine and love this particular world. You know, so it's a big it's it's yeah, there's a lot of pressure. Yeah, you know, I'm one of those people. I know I used to write here. You love it. Yeah, exactly. I agree. And I loved and I loved Clem. And I remember when I did my episode of The Walking Dead, I literally I got, I mean, like playful, but like playful threats, like you better not hurt Clementine. Yeah, because people came to really love her. Yeah, and she is really is one of the great characters. And it's a lot of, you know, they would do set definitely like collectively all the people in that room that are responsible for figuring out how to bring Clementine's story to it to a to a definitive conclusion. It's it's tough. Yeah. Wow. I agree with you as a Walking Dead fan since, you know, graphic novel number two.",
            "start": 2349.28
        },
        {
            "text": "for figuring out how to bring Clementine's story to it to a to a definitive conclusion. It's it's tough. Yeah. Wow. I agree with you as a Walking Dead fan since, you know, graphic novel number two, right? And back in 2005 when I found The Walking Dead, I agree that like I think the Telltale games are one of if not the best iteration of The Walking Dead. And granted, you're stacking the deck. I'm making the choices. I'm building these relationships. I'm getting really invested because you exact in those choices. Yeah, but yeah, you know, it's outside of what Walking Dead #100, Issue #100. I like I mean, I teared up reading that, but like I cried playing The Walking Dead, right? Does it does it does it kill you that I know how Clementine's story ends, but I won't tell you? No, you're okay with not knowing. Yeah, no, I don't want to ruin it from you know. Yeah, cuz you say you're not the kind of person that has to know the spoilers, right? No, not at all. And that's the thing where it's like, you know, if Telltale always be",
            "start": 2391.22
        },
        {
            "text": "want to ruin it from you know. Yeah, cuz you say you're not the kind of person that has to know the spoilers, right? No, not at all. And that's the thing where it's like, you know, if Telltale always be like, hey, you know, we got the PC version of the game done. We can bring a bomb like I will for PlayStation. I was hoping it was something I'll be able to torture you with, but it's not. No, I'll give you I won't give you that. I won't give you that kind of thing satisfaction. Episode 1, just get rid of AJ, this baby. We don't need a little baby. Yeah, yeah, because you get them cuz that was the problem with the Season 2. They didn't give me the option just to leave this baby behind. That's what that is. That's an option you were looking for. Abandon a baby. I'm a kid. There's a baby. There's zombies. I ain't got time for this. How do you usually like to play? Do you like to try and are you more of a Paragon or a Renegade when you play through these kind of games? I for them I really really read the situation and I",
            "start": 2437.04
        },
        {
            "text": "for this. How do you usually like to play? Do you like to try and are you more of a Paragon or a Renegade when you play through these kind of games? I for them I really really read the situation and I think that's speaks to the power of what the game is in the fact that it's not I'm gonna be generally try to do the right thing. Like as Lee, I did as me. I think I think the the walk the Telltale Walking Dead games have done a great job of showing you how really you would transition into a gray area slash everybody's the villain here because with Lee at the outbreak, with Clem, like, you know, you guys played with our emotions. You gave us a kid to protect that we all fell in love with. So it was very much like, I'm fine, I'm fine, I'm fine. But like when you get to your episode, Episode 4 of Walking Dead, right? And that guy's like, listen, man, you know, she should come with us. We're better. That was definitely one of the first, not one of the first times, one of the most memorable times I grabbed him like,",
            "start": 2470.16
        },
        {
            "text": "right? And that guy's like, listen, man, you know, she should come with us. We're better. That was definitely one of the first, not one of the first times, one of the most memorable times I grabbed him like, ****. I'm like, we're going hard on this guy. Like, get the **** away from us. You don't know what to me like that. You don't talk to her like that. It's really interesting. I don't think even the guys at Telltale fully realized just how powerful that connection to Clementine was gonna be. Like, I got these kind of mark death threats over like, don't hurt her. Yeah, because you really wanted to protect her. And I remember it's funny, a lot of the ways that it's so instructive. I learned so much working with Telltale just on that first season that often and what's really interesting with you episodically, you're getting feedback from like Episode 1 while you're working on like Episodes 3 and 4, whatever. So you're seeing how people are reacting to the characters. And I remember a lot of people remember Ben.",
            "start": 2511.74
        },
        {
            "text": "you're getting feedback from like Episode 1 while you're working on like Episodes 3 and 4, whatever. So you're seeing how people are reacting to the characters. And I remember a lot of people remember Ben from Season 1. Oh, yeah. I've been everyone hated Ben because he was the guy like every every zombie group has that guy that the well-intentioned, but sooner or later he's gonna get every he's gonna get you all **** killed. Yeah, because he's incompetent or, you know, whatever. He's just not he's not a survivor. And we tried to build the character in that way. And we were getting all this feedback, can you please give us the opportunity if I can kill? I hate Ben. I hate Ben. Then we my god, this son of a **** Ben. I want to kill him. Well, okay, so when we got to my episode with there's a there's a moment where you can you can let you kill him, but you can let him die from a bell tower and you can choose to either pull him up or let him go. And we tried to stack that choice in a way that would encourage",
            "start": 2549.09
        },
        {
            "text": "where you can you can let you kill him, but you can let him die from a bell tower and you can choose to either pull him up or let him go. And we tried to stack that choice in a way that would encourage people like it was okay to let him go. He was literally at that point in the story. He had recognized that he was a danger to the group. Yeah, and he was literally saintly like, just let me go. You know, it's the right thing to do. Like, I want you to let me go. And we had playtesters come in and play it and every single person saved it. And we were like, you've been begging for this joy. You've been begging for this opportunity to kill him. We gave it to you and none of you took it. And they were like, when when the moment came, I just couldn't do it. Like, I had to save him. Yeah. And so we had to go back. When that happens, that's a broken choice because you want people to have a hard time making a choice. It can't be too easy one way or the other. So we actually had to go back and find ways to stack the deck",
            "start": 2588.24
        },
        {
            "text": "that happens, that's a broken choice because you want people to have a hard time making a choice. It can't be too easy one way or the other. So we actually had to go back and find ways to stack the deck against Ben more so that people would be more inclined. And I think in the end it ended up like 2/3 to 1/3, which is still not as close to 50/50 as I would have liked, but like we pulled it back. Yeah, you know how we did it? We had him in danger, Clementine trouble, and he abandons her. Yeah, and in that moment, that's the first bet. That's when you're in distress right in there. But that was kind of like a reshoot. We had to reshoot that scene because the playtest demonstrated the choice was broken. Not not yet. Even though people are gonna drop down because they hate him, they hit him with the peeler telling us, but it's a big difference between what you say and what you'll actually do given the choice. Yeah, when you work, Mr. Okay, put up or shut up time. You want to kill him? You've been asking",
            "start": 2627.45
        },
        {
            "text": "telling us, but it's a big difference between what you say and what you'll actually do given the choice. Yeah, when you work, Mr. Okay, put up or shut up time. You want to kill him? You've been asking the killer more season. Here you go. And nobody killed him. So we had to go back. We look very careful about whenever we do a Clementine because we know that players respond to yeah, so powerfully. It's like she's like the Kryptonite to play it. So like we don't want to use her all the time, but we need is that what can we do? It's like I think I think he needs to put Clem in danger because we knew that people would have such a visceral reaction to that and it works. People started dropping him. Yeah, see, and that's what's fascinating because that whole thing that was one of my choices why I was like, I'm I was already against you. I you have to send what you're saying in the writers' room, right? As a player, I had to have a one sentence description of what my objective was and my objective was always protected.",
            "start": 2670.73
        },
        {
            "text": "already against you. I you have to send what you're saying in the writers' room, right? As a player, I had to have a one sentence description of what my objective was and my objective was always protected Clem. Get Clem from point A. That's always number one. Clem is my thing. So like, yeah, Ben, I obviously I already knew he was a threat to the group. I was like, well, you're out of this. You jump ahead to Season Two where you were playing as Clem. That's when I started being a little more like, I'm gonna be cool for the most part. I'm gonna be guarded with these people that I don't know. Rebecca's being a **** to me. I'm gonna be a **** back to her and threaten her with information that I know about like the, you know, the father of her kid or stuff. But then like getting in and I'm spoiling Season Two right now. You shoulda played by now. When we get in there like Michael Madsen's characters getting about to get beat down or whatever at Carver, I believe his name was. And it was like, I wanted to stay fit. I",
            "start": 2705.56
        },
        {
            "text": "now you shoulda played by now. When we get in there like Michael Madsen's characters getting about to get beat down or whatever at Carver, I believe his name was. And it was like, I wanted to stay fit. I made Clem stay to watch that because like Clem's we're transitioning. We're sliding into the darkness here and like she knows the world there and people are trying to pull her away and they're saying stuff like, but you're just a kid or whatever. And it's like, no, we're not a kid. I'm not a kid in this world anymore. That's not where we are in The Walking Dead. And when you get to the end of Season Two, and this is the AJ joke I made, right? We get there and it's Kenny and what was Christine's like? Do you remember Christine Lakin character's name? I want to say Christine, but that's not right. It's Kenny and Christine Lakin character and they've they're battling around. And I remember playing this in, you know, obviously I know the Telltale people super well. I'm playing this in a theater with my choices",
            "start": 2741.83
        },
        {
            "text": "Christine Lakin character and they've they're battling around. And I remember playing this in, you know, obviously I know the Telltale people super well. I'm playing this in a theater with my choices already laid out. And they're wrestling around and everybody knows that I'm Mr. Kenny. I love Kenny. I was so excited. I was a soft spot for Kenny myself. And it helps that even like Gavin, who's been on Gavin Hammon, who's been on the GameOver Greggy show and stuff, voices Kenny. So there's like that connection too. Just in the same way, you know, we know Melissa so well and she's Clem. But I'm sitting there, they battle and I let Kenny kill Christine Lakin's character. And I have the gun drawn and I don't do anything. And I'll never forget this. Then Kenny came back up and like it gave me the option to draw the gun on him or whatever, shoot him. And I and I drew the gun and there Laura from Telltale on the back gasped because everyone thought they knew me and how I would end this game. But I got to",
            "start": 2775.67
        },
        {
            "text": "to draw the gun on him or whatever, shoot him. And I and I drew the gun and there Laura from Telltale on the back gasped because everyone thought they knew me and how I would end this game. But I got to this point and it was the point for me where it was like totally broken for Clem of just like my I'm Clem and I got to survive and he's crazy now. And you pull that gun on him, he's just like, just do it. And like it's another one of those things. I'm like, he knows he's gone. He knows he's not the Kenny we all fell in love with and shoot him right in the head and have him drop over. It was great. But then we got to the moment of like she doubles back to get AJ. And I felt for me that was a break of just like, I I guess at that I went ice-cold on it, right? Like I Clem went ice-cold and killed one of the connections to Lee, which is one of the connections regular life relationship she had. So for me, I would have been like, see the baby in the car and shut it. We'll kill a baby probably, but shut the car door",
            "start": 2817.98
        },
        {
            "text": "to Lee, which is one of the connections regular life relationship she had. So for me, I would have been like, see the baby in the car and shut it. We'll kill a baby probably, but shut the car door and leave. That is one of the appeals of those games is even though they're single-player games, they're strangely social. If you play there with other people on the couch, everyone's invested. Everyone's kind of pitching in like, no, don't make this choice, make the other choice because everyone's got an opinion. Yeah, but only one person gets to drive. And it's really I was enjoy playing those guys when with my wife. When you know, you like if you've got sometimes you don't get enough time, but life if you got, it's fun to kind of get other people playing along with you. It may work socially as well if you when you like when you play them live, everyone's like, oh yeah, in the Twitch. Yeah, well, I mean, some of our most cherished IGN memories harken back to what we're talking about with Housemarque, right? And what I think a",
            "start": 2860.04
        },
        {
            "text": "multiplayer experience, a robust community means nowadays is the fact that I'd come home or come back to IGN after playing it or whatever. And Mitch Dyer would have played it that night too. And the first thing we would do is pour coffees and go into Meteor Mashup. And oh, I know what did you do? How did you? Why would you do that? What happens? I'm like, figure out. And that's the whole thing when people are like, I hate it when people talk about these games and they're like, it's the illusion of choice. There's no real choices. Bah, bah, bah. But like there would be these intense discussions how this happened, why that happened. Like all rights like what you start the same point, you go wide and you have to come back to the same ending. And then that's what was great is great about those kind of games. Yeah.",
            "start": 2896.04
        },
        {
            "text": "why that happened. Like all rights like what you start the same point, you go wide and you have to come back to the same ending. And then that's what was great is great about those kind of games. Yeah. I'm really I'm really glad that they're that we're doing this this final season and we like it so gonna try to do justice to a character that people over the years have really grown to love, a lot of affection for. I'm glad that doing this. I don't if you mentioned on this collection here, they've remastered everything, which is really nice. You know, everything everything all the DLC all in one box, but they've read their remastered all the graphics so they just look a little fresher the first time around. Cool. Yeah. Number four. I'm the longest Roper Report of all time. Some sales numbers to chew on. This is from IGN financial results for the second quarter of fiscal year 2017 revealed that Sony Interactive Entertainment set 4. million units to retailers this quarter bringing up the lifetime total of the",
            "start": 2928.99
        },
        {
            "text": "PlayStation 4 to 67.5 million units shipped. Remember, this isn't sold, just shipped to retailers. These numbers result in the company raising the predictions for PlayStation 4 to meet 79 million units shipped by March 2018. What is the current state? I know PlayStations ahead, but you know, if the top you had what the rough numbers are in terms like installed, like how many like in homes, how many? But yeah, yeah, well, we well, that's that's the thing. I think KindaFunny.com/You'reWrong. This is definitely one bill. I want to say what PlayStation the last time we reported was 65 and I want to say that was sold through. I don't think that was just ship PS4. Yeah, in homes. I think so. I I think so. Is that what that's worldwide? That's worldwide. Okay. And then Xbox never talked about",
            "start": 2969.97
        },
        {
            "text": "and I want to say that was sold through. I don't think that was just ship PS4. Yeah, in homes. I think so. I I think so. Is that what that's worldwide? That's worldwide. Okay. And then Xbox never talked about their numbers. They don't talk about the numbers, which means they're way behind. Oh, yeah. And so I think like there's been some creative science and sleuthing that I think pegged them around 40 million a while back, maybe. But I know it's I know it's a nice thing in the in the in the universe of bragging rights to say, you know, we have we've solved this many more than the other guy. Yeah, but at the end of the day, it doesn't matter that much if Microsoft cares about like, are we making a ton of money just, you know, in our own right? And guys across street might be making more and will always try to catch up, but all they long as they're profitable in their own right, that's that's enough. I guess the people always say about the console wars, right? And I hate that because it makes us",
            "start": 3017.25
        },
        {
            "text": "always try to catch up but all they long as they're profitable in their own right that's that's enough I guess the people always say about the console wars right and I hate that because it makes us get besides and argue about stupid stuff I make fun of PC on it but I'm you know I'm joking about it play wherever you want to play what I like about the console race is the fact that PlayStation being so far ahead makes my Xbox try harder and whether they've made so many great game or first decisions in the time since they announced the position is great and so the only way you can get ahead is by offering people a better a better a better deal and so let's say that that starts turn the corner Xbox One X does this great thing we're about to talk about PUBG that brings more people in then suddenly PlayStation has to look at what Xbox has done with backwards compatibility what Xbox has done with the Xbox Game Pass program I think that's why they call it or whatever that you know",
            "start": 3056.79
        },
        {
            "text": "PlayStation has to look at what Xbox has done with backwards compatibility what Xbox has done with the Xbox Game Pass program I think that's why they call it or whatever that you know the one where you like Netflix for games they've done so many great things there that I'd love to see that shine out but you know playing nice with them on terms of a cross-platform play it's a really interesting spot to be in right now yeah the whole console wars thing is so boring yeah me I mean but people still do it everyday right you're either an Xbox or it's Sony I don't know what the what the pejorative there is Pony they call and Pony Pony yeah I've been called the Pony lion yeah you're a Pony no I'm not but I've been called that a lot yeah I prefer to PlayStation covered it for eight years right was my soul beat on the job so yeah I know it pretty well and then more numbers for you the Persona series has reached a new sales milestone according to Sega's 2017 annual report the franchise is",
            "start": 3097.18
        },
        {
            "text": "was my soul beat on the job so yeah I know it pretty well and then more numbers for you the Persona series has reached a new sales milestone according to Sega's 2017 annual report the franchise is now topped eight point five million units sold packaged in digital total across 13 total edition I've never played a Persona again really so many people I know alike if you're into like there's no casual Persona fans if you're into Persona you're in together one Persona yes I would I like Persona do you like turn-based RPGs do you like high school drama I like I like yeah I guess yeah then you bug it yeah sure all right play the new one what's the good can you can you just dive in yeah I mean if you want a plan you've either play Persona 4 Golden and have it with you at all times if you want to play on the PS4 you don't have any choices I don't know Persona 5 ok which is awesome it's okay to come in yeah but well they're like yeah they're like Final Fantasies you know really different yeah",
            "start": 3134.86
        },
        {
            "text": "play on the PS4 you don't have any choices I don't know Persona 5 ok which is awesome it's okay to come in yeah but well they're like yeah they're like Final Fantasies you know really different yeah you might get a reference here there understand something a bit more but it's that you don't need to all right I'll give it a try ok and then finally number 5 PUBG Game of the Year remark this is an IGN story that I found interesting speaking to PlayerUnknown's Battlegrounds creative director Brendan 'PlayerUnknown' Greene that's a mouthful I asked what he thought of early access games like PUBG being considered for Game of the Year awards and he somewhat surprisingly told me quote personally I don't want a win game with I don't want to win a Game of the Year award well I would love to win it for the team I think this year there have been far better games Greene specifically called that The Legend of Zelda: Breath of the Wild and Horizon Zero Dawn asked quote masterpieces of game design and",
            "start": 3173.89
        },
        {
            "text": "it for the team I think this year there have been far better games Greene specifically called that The Legend of Zelda: Breath of the Wild and Horizon Zero Dawn asked quote masterpieces of game design and storytelling they're just wonderful wonderful games I think they will probably win it I would hope they would win it Greene said of the award I'm Greene said the award would be a nice feather in their cap for the PUBG Corp team but reiterated I don't know if we deserve it PUBG Corp CEO CH Kim said quote we're really not interested in whether they deserve awards or not and our instead focused on bringing the best gameplay to the Xbox Game Preview and PC version Kim followed up by saying early access shouldn't matter when judging games for awards and that you should just look at the game itself not the label it has Kim explained that once the 1.0 version comes out we're going to continually upgrade the game going forward we're not gonna stop there they're answering the question we've been",
            "start": 3212.83
        },
        {
            "text": "not the label it has Kim explained that once the 1.0 version comes out we're going to continually upgrade the game going forward we're not gonna stop there they're answering the question we've been debating on this show forever they've been listening is it should it be consider for Game of the Year and then deep Icahn has a shot I you know I I like Brendan a lot and I think he's always being very gracious here but I don't think he's saying this just for you know just appear gracious I think I think this is honestly as opinion I think you're right I think there I love PUBG and it's absolutely one of the great games of this year I think it's gonna be in every Game of the Year conversation I think it will win a ton of awards either you know formats percent your PC Game of the Year probably is PC Game of the Year is my guess as genre-specific in terms of overall Game of the Year I think he's right as much as they love PUBG Breath of the Wild I can't speak to Horizon Zero Dawn haven't played the other",
            "start": 3256.75
        },
        {
            "text": "Game of the Year is my guess as genre-specific in terms of overall Game of the Year I think he's right as much as they love PUBG Breath of the Wild I can't speak to Horizon Zero Dawn haven't played the other world I haven't played it I'm waiting for PS4 Pro, my 4K TV shows up okay going all-in for all in on the enhanced version but I think the Breath of the Wild and Mario Odyssey I'm can only assume that Brendan hasn't played Mario Odyssey to see how those you'd be talking about that well I think those I think between those two do you think Horizon Zero Dawn is legitimately up there with Zelda and Mario is like top-tier contender for Game of the Year I think and this is a conversation we've had on all the Kinda Funny products yeah up until that's is that what you call them yeah well I call it content shows it's it's been a it's been a race between is it gonna be Zelda it's gonna be Horizon I mean again I haven't played Horizon Oh a lot of people love it yeah I know Breath of the Wild it is absolute",
            "start": 3298.03
        },
        {
            "text": "it's it's been a it's been a race between is it gonna be Zelda it's gonna be Horizon I mean again I haven't played Horizon Oh a lot of people love it yeah I know Breath of the Wild it is absolute masterpiece it's Horizon Horizon genuinely on that level I think so I think that I've been the one saying I would vote for Horizon for Game of the Year however today I will officially confirm I'm pretty sure I'm switching my vote tomorrow you think Mario Odyssey is gonna is gonna beat out Zelda and everything else I mean this is for what I would vote for and Kinda Funny Game of the Year I think I think right now and I'm not I'm at Bowser's Castle in Odyssey I think I like Mario more than I like Zelda and I'd love to at that point I think it comes down to largely a matter of taste don't you think because they're so good yeah yeah and again I can't speak to Horizon but I do think that if you ask me right now Zelda a few months ago or even a couple of weeks ago but I said I did",
            "start": 3338.68
        },
        {
            "text": "don't you think because they're so good yeah yeah and again I can't speak to Horizon but I do think that if you ask me right now Zelda a few months ago or even a couple of weeks ago but I said I did on this show so it's Breath of the Wild its Breath of the Wild there's nothing else because it's so good and I knew that Odyssey would you know they very rarely fail on these games like but maybe it could have been a Sunshine or a game that she liked less but it's not it's absolutely I think probably its top tier one of the best Mario games of all time absolutely phenomenal and now I think between Zelda and Mario it's a coin flip between the two very very hard to pick I was talking to him about it the other day for me I think the difference here and why I think I want to put Mario in front of Zelda is just the fact that I love them both Mario is pure joy the entire time yes in Zelda I'm just and I'm not even saying often but enough there'd be times of like wait I dropped the stick I",
            "start": 3380.23
        },
        {
            "text": "Zelda is just the fact that I love them both Mario is pure joy the entire time yes in Zelda I'm just and I'm not even saying often but enough there'd be times of like wait I dropped the stick I wanted to you I dropped the sword I do this like Odyssey's cumbersome what am I supposed to okay there it is and I'm talking about like out of the however many hours I played Zelda I beat it you know begin and all that stuff a few times this happens but I mean Mario literally is I jump in and it's just like either it's 15 minutes or it's you know multiple hours all night long sitting there just playing it's there is you know if you don't love with it if the metric and everyone obviously has their own different philosophy but if if you're if you're saying okay here's what makes a great game I want something that is just a pure to pure delight to play yeah every minute just the constant joy of oh my god that happened or you can do that and just delight of discovery and exploration and basically the",
            "start": 3422.62
        },
        {
            "text": "that is just a pure to pure delight to play yeah every minute just the constant joy of oh my god that happened or you can do that and just delight of discovery and exploration and basically the sense like you're playing a game with like a constant goofy smile on your face Super Mario Odyssey is the Game of the Year yeah there's nothing that even comes close to it but this is where I always come down the Game of the Year is the fact that you put Horizon Zelda Mario into the Game PUBG into the Game of the Year conversation I think it always comes down to a coin flip right of personal preference yeah so look at all those games and be like what works by the end of every year there are a few games that are also fantastically good that the only daylight between them as your own personal biases and preferences yeah and that's why you know people end up you know when Giant Bomb would ever get together anybody the end of the year and have their their giant already big they're big giant argument",
            "start": 3462.72
        },
        {
            "text": "preferences yeah and that's why you know people end up you know when Giant Bomb would ever get together anybody the end of the year and have their their giant already big they're big giant argument it comes down it often comes down to personal preference because you can't say oh well but Mario's not really that good like no one with any brain or any understanding of video games would say Mario Odyssey's not that good anyone can see that it's phenomenal yeah so it just comes down to I don't personally like that like one of the reasons why I love Odyssey is I love that it's that they moved away from that there's the different styles of Mario games like there's one way okay here's a bunch of seconds on the clock there's a flagpole at the end go and there's a sense of like constant and a lot of the games almost have that kinda like the screens always like pushing you forward there's a sense of like pressure and true movement I got to keep moving forward I'm gonna I'm gonna die some",
            "start": 3505.17
        },
        {
            "text": "a lot of the games almost have that kinda like the screens always like pushing you forward there's a sense of like pressure and true movement I got to keep moving forward I'm gonna I'm gonna die some people really respond to that kind of Mario game I mean it's been that way since the very first Mario Super Mario Bros. I personally much prefer the style of open-ended exploration and I don't feel the time pressure and I can go up what's over here yep oh my god there's a whole hidden area over here and I can explore and discover and play the game at my own pace that's the kind of Mario game that I love and Odyssey is all that and I just love it I was talking you know on the Bombcast with Jeff about it yesterday and it was the fact that there is no wasted space there's no there's no corner like I'll be playing the game and I'm like there's the objective but there's just a patch of green over there a new platform that's why I shouldn't jump - why would I you jump over there even if",
            "start": 3541.65
        },
        {
            "text": "like I'll be playing the game and I'm like there's the objective but there's just a patch of green over there a new platform that's why I shouldn't jump - why would I you jump over there even if it's just invisible coins that are there yeah everything is there everything is there for a reason yeah exactly and and the same again the same is true of Zelda are we missing anything like what what else would you be talking about if so I talked here so it's I think it's Zelda I think it's Horizon I think it's Mario I think PUBG is because in the conversation I know a lot of our audience says Persona 5 needs to be in the conversation ok and I I'm only 5 hours into Persona 5 so I know I haven't started it but Nier people always want Nier to be talked about in this but this is where we start getting into I definitely think these games are the ones that you want to give the nod to you want to be able to say they are a Game of the Year nominee I don't know personally and I haven't played Nier",
            "start": 3580.2
        },
        {
            "text": "into I definitely think these games are the ones that you want to give the nod to you want to be able to say they are a Game of the Year nominee I don't know personally and I haven't played Nier that it can get up to that level right like it's competing with Mario but it's one of these outstanding Games of the Year that needs a tip of the hat I mean the other thing about it is just just the broadness of the appeal like if someone said I'm getting a Switch tomorrow and I can afford one game to get but what would I get I'd say Mario of course and again Zelda by some standards might be the better game well I would say like what kind of games do you like exactly maybe if they like Zelda if they like the stellar Zelda more I'd point him in that direction but that's the thing right is that I feel like Mario is a game anybody could pick up play and enjoy and have something to it whereas Zelda I do think there is a do you like open-world do you like this are you looking for a story in",
            "start": 3622.44
        },
        {
            "text": "I feel like Mario is a game anybody could pick up play and enjoy and have something to it whereas Zelda I do think there is a do you like open-world do you like this are you looking for a story in your open world kind of where's Mario's just like hey run around and get stuff and have fun playing it and take what's gonna happen when you take over this what goofy costume are you gonna get what's hidden behind my wife is playing it more than me right now and every time whatever the the kind of the signature Cappy is world like she got to the world a couple of days ago where you capture the caterpillars that can kind of objects gone so it's I remember thinking when I first saw that dynamic of the Hat can become things I remember thinking they might have just shot you this might be one gimmick too many but it's not it's brilliant and it gives each level its unique there's a different approach to gameplay in each level based on what your capture is and obviously the levels and the",
            "start": 3660.84
        },
        {
            "text": "gimmick too many but it's not it's brilliant and it gives each level its unique there's a different approach to gameplay in each level based on what your capture is and obviously the levels and the puzzles are all structured around can you see okay so you can stretch here or over here you know you've got you can jump really high or whatever and each level is is is built around whatever the specific captured don't you have what is what are the properties you inherit when you capture this character just as a again game design master class absolutely genius yeah and again there's that sense of like every minute you're playing it you've got that silly grin on your face because you're just having so much fun exactly and it's discovering the new little intricacies have you done the food world or whatever we're getting so we're getting there we just got done with New Donk City no we're on whatever then what a great ending of that and I think I thought that New Donk City was no people",
            "start": 3697.92
        },
        {
            "text": "world or whatever we're getting so we're getting there we just got done with New Donk City no we're on whatever then what a great ending of that and I think I thought that New Donk City was no people complained about like can I add that fully kind of anthropomorphic humans and it didn't feel like somebody said to me one of the complaints against it is there's no consistent aesthetic yeah the each world feels very very tightly loved that and even though New Donk City is it is a bit jarring at first wait he's in like the quote unquote kind of real world he's actually like real people but just little things like how the how the the question blocks are on the oh yeah doesn't they go on the crossing it's a little oh my god like what a nice little touch so it's like every five seconds with that game there's something it's example s an Intendant of it are they God for food have them get me food yeah uh I'm sorry I got a tight schedule we've gone along cuz we're having a great show and I",
            "start": 3735.03
        },
        {
            "text": "that game there's something it's example s an Intendant of it are they God for food have them get me food yeah uh I'm sorry I got a tight schedule we've gone along cuz we're having a great show and I want to stop it now here's the thing you need to understand yes about you joining a full time now every to every show I'm gonna kick to you out with a little funny thing after this segment okay and I'm gonna say where would I where we're gonna go to know what came to the mom and pop shops I mean you read all these lines just this stuff you want me to read this what's in bold here and then this list of you know just just so what's in bold I'll take it over from there cuz okay job of the permanent co-host area yeah exactly exactly you want me to read it now no no I'm gonna set you up okay I'm getting ready to tee it up ready I'm learning on the job here so Gary I'm super excited for PUBG on Xbox One but it's still a ways out if I wanted to know what came to the mom and pop digital shops",
            "start": 3776.43
        },
        {
            "text": "getting ready to tee it up ready I'm learning on the job here so Gary I'm super excited for PUBG on Xbox One but it's still a ways out if I wanted to know what came to the mom and pop digital shops today where would I go the official list of upcoming software across each and every platform as listed by the Kinda Funny Games Daily show hosts each and every weekday do did it - yeah Wow today Sokoban Next on Vita Kotaku listed as PlayStation 4 but I did some sleuthing apparently only if a Vita game releases in the forest and there's no one I'll be playing it ever he's gonna go play this so kiddo you know what I mean that's the one it's all about that's where we're all released today apparent Limbo Pikmin hey blitz what was Wednesday yes when Tuesday was right there you got Call of Duty on Friday there's a million things happen why is that releasing one it's Friday the new Tuesday what's I think Friday's the new hey we've all Blockbuster over here we got this crazy game it's gonna go",
            "start": 3816.12
        },
        {
            "text": "Friday there's a million things happen why is that releasing one it's Friday the new Tuesday what's I think Friday's the new hey we've all Blockbuster over here we got this crazy game it's gonna go mainstream we think everybody wants it for the weekend what's the early word on that I haven't heard anyone well - I haven't heard any okay you should I guess embargoes up what soon this week sometime probably tomorrow yeah yeah you can tell we can get a copy because I don't even know what's happening with it that's coming up soon though so there you go it's got to be out you'd assume you were showing me videos today leaked from Europe of a loot boxes boxes only Beach what what it what what what ad respectful tributes it to the countless brave who died on Normandy Beach to shower players with with microtransaction loot box there is their cards to play a little bit further anyways we got new dates for you PUBG is officially coming to Xbox One's early access program on December 12th it'll be",
            "start": 3863.87
        },
        {
            "text": "microtransaction loot box there is their cards to play a little bit further anyways we got new dates for you PUBG is officially coming to Xbox One's early access program on December 12th it'll be out of early access on PC in late December is a big month for PUBG yeah exactly which really screws people over if they were gonna do that thing of like well it isn't really access on PC so we can't put I am so interested and invested in how the Xbox version of PUBG is because as much as I love it I think part of the reason why it crept away from it was I'm just lazy I'm just sitting at home talked about this before the show like my PC is in my office which is in a totally different part of the house and like I kind of want to play PUBG but I got a client I gotta go all the way downstairs get you know set up my headphones and my and turn on the PC and I'm like isolate from the rest of the house I just want to do it babe it's on Xbox and I'm watching TV let's press a button and I'm playing",
            "start": 3910.22
        },
        {
            "text": "you know set up my headphones and my and turn on the PC and I'm like isolate from the rest of the house I just want to do it babe it's on Xbox and I'm watching TV let's press a button and I'm playing PUBG frictionless maybe that's my way back into Battle Royale, Walkley the KindaFunny.com/KFG D just like you can and says how well will PUBG do on Xbox One I like Greg play on console rather than PC and have been super excited for PUBG on Xbox One however Fortnite's Battle Royale mode came out of nowhere and is already doing what I had hoped PUBG would do for me when it launched today we talked about the release date of 12/12 looking the replies it looks as if there are two lot of groups of people responding to the news of the 12/12 release date one group seems to be PC players mocking the release and the other console player saying they don't need this game foreign that",
            "start": 3948.35
        },
        {
            "text": "of groups of people responding to the news of the 12/12 release date one group seems to be PC players mocking the release and the other console player saying they don't need this game foreign that is free in Fortnite beat PUBG already what do you think is gonna happen guys I think I'm going to happily buy this on Xbox One and actually be playing my Xbox One pretty consistently I was telling you what I have the Xbox One X at home now that from the Kinda Funny that I'm screwing with and when this inevitably happens I plan on bringing the Xbox One S to work and put it on my desk and you're a Pony I am a huge Pony alright Shuhei, or Battlegrounds can get Ponies yeah so the Xbox we talked about this we only talk about there's many sons from the Xbox and the PlayStation there's so few games that make the difference like your matically the idea of like the format exclusive like you know Halo over here and what does PlayStation have nothing nothing oh wait everything that's right they",
            "start": 3993.34
        },
        {
            "text": "that make the difference like your matically the idea of like the format exclusive like you know Halo over here and what does PlayStation have nothing nothing oh wait everything that's right they have every first-party so I'll source of stuff Resistance is that is that coming back no there knows Gran Turismo yes Horizon you know they that's a lock solid that they would never that would never be on Xbox no that's Death Stranding you're gonna go you know I'm you keep going that way is Spider-Man right right right so Days Gone those games that you can lock down and say hey if you want to play this game you can only play over here there's those games a few and far between Battlegrounds is clearly one of those games I think Microsoft made a very smart decision backing up the money truck and saying come here come here we want you we know you could be a needle mover there obviously will be Battlegrounds there'll be a Battlegrounds special edition Xbox will be painted they're smart they like a flying",
            "start": 4032.97
        },
        {
            "text": "here come here we want you we know you could be a needle mover there obviously will be Battlegrounds there'll be a Battlegrounds special edition Xbox will be painted they're smart they like a flying pan or some **** you can whack people with her or a frying pan controller they'll figure it out yeah all of those things are gonna happen I'm very a lot of it's gonna depend on what how well did they adapt it a lot of people have talked about well yeah that's how all of the controls gonna map to the controller will he be able to do the precise aiming and stuff early word that I've heard from people is that they're actually done it quite well I really hope that done it well because I'm very invested in playing it but I do think he has the potential to again once the holidays come around and a lot of people out there well which one we're gonna go oh I've heard PUBG Battlegrounds I've heard about that supposed to be the **** right yeah Xbox yep I think it'll be interesting yeah for the",
            "start": 4076.95
        },
        {
            "text": "a lot of people out there well which one we're gonna go oh I've heard PUBG Battlegrounds I've heard about that supposed to be the **** right yeah Xbox yep I think it'll be interesting yeah for the people who are the ones who have been on the fence about the Xbox One X or whatever like people who are like I have PlayStation 4 I'm set there's this and then the promise of whatever Xbox is gonna do down the line yeah I want to play some Cuphead what the Fortnite guys have done is is obviously pretty cheeky right they saw that Battlegrounds was was was going viral essentially yeah and they already have a game out there can we adapt this very quickly and beat them to market they did it seems like people are liking what they did if I was Brendan I'd be a little bit irritated they've done their cuz they've copied my game and now they're eating out like people say oh we don't need it we've got Fortnite yeah waiting what Battlegrounds comes out and we'll see it's gonna be a movement and I",
            "start": 4118.23
        },
        {
            "text": "cuz they've copied my game and now they're eating out like people say oh we don't need it we've got Fortnite yeah waiting what Battlegrounds comes out and we'll see it's gonna be a movement and I think that you'll see a lot of people flocking to it and talking about it wanted to play and I think about beeping I got bad news for you over on PlayStation 3 DC Universe Online is shutting down on January 31st, 2018 you can still of course play on PlayStation 4 Xbox One and PC but a sad day for one a places it started on all boys coming to PlayStation 4 Xbox One and Switch on February 13th and then there's gonna be a Nintendo DS The Legend of Zelda: Ocarina of Time 3D version that comes out for 80 bucks it's got its own it's a green Nintendo DS with all those other stuff if you're hanging out and do it there you go so the 2DS is coming pre-installed with Ocarina of Time 3D yeah that's what's wrong that something feels wrong about that yeah it's a confusing thing to do it Nintendo give up on",
            "start": 4154.78
        },
        {
            "text": "it there you go so the 2DS is coming pre-installed with Ocarina of Time 3D yeah that's what's wrong that something feels wrong about that yeah it's a confusing thing to do it Nintendo give up on 3D cuz I know they're like yeah I guess so never in it never really took on in any iteration on it no I used to I haven't read yes but I always turn that slider right down it never really appealed to me the 3D part no no what's that and then they're also putting out The Legend of Zelda: Breath of the Wild Explorer's Edition a bundle that includes their critically acclaimed and award-winning Nintendo Switch game a 100 page Explorer's guide and a two-sided map for a suggested retail price is 60 bucks deals of the day for a PlayStation Plus games have been revealed for November Until Dawn: Rush of Blood is coming to PlayStation VR this is outside of the realm of the usual PlayStation Plus is our plus it's gonna be November 7th through January 2nd so a long time to pick that up what is Rush of",
            "start": 4196.0
        },
        {
            "text": "blood is coming to PlayStation VR this is outside of the realm of the usual PlayStation Plus is our plus it's gonna be November 7th through January 2nd so a long time to pick that up what is Rush of Blood is that like a different Until Dawn type experience but built just reveal that's what it is is a it's a shooting gallery of shooting gallery in VR where you like ride a minecart and you shoot stuff that pop out and scare you it's a horror yeah it's really fun it sounds stupid because Until Dawn wasn't at all but weird spin it was them applying to it implying the licenses to this it was made by Supermassive so it's cool and it's polished and they're really likes legislations decided Until Dawn is like a horror franchise exactly sense to slap the label on it represent then what happened what do I want to eat spicy tuna just put you know what I like I can't stop the ship for lunch Worms Battlegrounds is coming to PlayStation 4 Bound is coming to PlayStation 4 Our Type Dimensions is",
            "start": 4231.4
        },
        {
            "text": "do I want to eat spicy tuna just put you know what I like I can't stop the ship for lunch Worms Battlegrounds is coming to PlayStation 4 Bound is coming to PlayStation 4 Our Type Dimensions is on PS3 Rag Doll Kung-Fu: Fists of Plastic and on PS3 if you didn't play that don't I remember playing that back in the day no here's three so still seeing new releases still slugging no no no this is just PS Plus this is not own a PS3 Dungeon Punks comes the PlayStation 4 Vita I'm sorry the Vita this is cross buy a PS4 and then Broken Sword 5: The Serpent's Curse Episodes 1 and 2 are available on PlayStation Vita as well for the month of November all around kind of week month but gotta put out there also right now there's also the PlayStation Plus double discounts a whole bunch of games like the Mega Man Legacy Collection 2 Kingdom Hearts Horizon Zero Dawn are all seeing double discounts for PlayStation Plus subscribers that ends so here's to get into PlayStation Plus member yes 44 percent",
            "start": 4271.51
        },
        {
            "text": "Mega Man Legacy Collection 2 Kingdom Hearts Horizon Zero Dawn are all seeing double discounts for PlayStation Plus subscribers that ends so here's to get into PlayStation Plus member yes 44 percent off and you'd be right you'd be right there you'd be all set for next week's DLC frozen while next week and the PS4 Pro optimizations they just that just comes in the form of a free update upgrade them for Pro yeah I think they're my I've never used there might be a you go to the settings or yeah maybe we're going to set some games you have to go into settings and opt-in safe enable Pro whatever okay but yeah once you're there it's all good to know yeah the 4K era begins for me tomorrow so I'm very excited about what's out there yeah it's gonna be a whole new world for you how big is this 4K TV 65 Hui it is a biggie yes what you want that's wrong very excited now I'm not you don't even the price did it set you know these things still ridiculously expensive or they coming down",
            "start": 4318.88
        },
        {
            "text": "is this 4K TV 65 Hui it is a biggie yes what you want that's wrong very excited now I'm not you don't even the price did it set you know these things still ridiculously expensive or they coming down yeah I was like but I heard my current TV for like seven or eight years it's got a bit clunky and I feel like the tipping I mean right now I feel like just at the beginning of the viability of with the One X um PlayStation 4 Pro and you go to the store now and all the big releases are big movie releases are in 4K I feel like that that tipping point it there's not still not a ton of content you're to the sword though your there's content there for you yeah yeah time to squad up this is where one of you writes in to Kinda Funny.com/KFGD you give me your name your username your platform of choice and what game you need help in I read here the Best Friends find you when everybody plays games together today Drew wrote in he needs help on PlayStation for his PSN handle is the_prince",
            "start": 4364.78
        },
        {
            "text": "and what game you need help in I read here the Best Friends find you when everybody plays games together today Drew wrote in he needs help on PlayStation for his PSN handle is the_prince09 I think I might have played Friday the 13th with him last night but I'm not sure what's up everybody doesn't it suck when you and your friends start getting older so finding time to game together is difficult between work significant others getting different consoles drifting away from games breaking up while destroying wait what breaking up while deployed so your girlfriend keeps your console to him that one sucks and more a lot of stuff and getting away I've been into single-player games more recently but want to get back into multiplayer I picked up Friday the 13th Elder Scrolls Online WWE 2K18 and soon we'll have Battlefront II have Injustice 2 Tekken Overwatch Uncharted 4 if any of those sound fun hit me up on PSN hell we can even just add each other and never actually play it's",
            "start": 4407.14
        },
        {
            "text": "18 and soon we'll have Battlefront II have Injustice 2 Tekken Overwatch Uncharted 4 if any of those sound fun hit me up on PSN hell we can even just add each other and never actually play it's all good thanks Kinda Funny and the Kinda Funny Best Friends hashtag let Cool Greg host everybody on PS4 hit up V_prince09 become his friend play those games have some fun I might have to hit you want to squat like I've known what the next one be like this appear and I was just really looking for people to play Destiny 2 with you couldn't do it I got a cowboy but now right now I've got a regular slot and come on the show and say my knee I need to squat up there you go we squad you up next the next week we're to Wednesday crazy and we're now going to Kinda Funny.com/you're wrong this is where you the people watching the show live on Twitch right in the Kinda Funny.com/you're wrong and tell us what we screwed up as we screw it up so that we can set the record",
            "start": 4445.21
        },
        {
            "text": "wrong this is where you the people watching the show live on Twitch right in the Kinda Funny.com/you're wrong and tell us what we screwed up as we screw it up so that we can set the record straight Jason I say how do I know I did great I'm asking how did how did you do uh he's mad at you who is in the Oh A Oh she wrote Hudson says hey guys welcome aboard Gary just so you know Super Mario Odyssey is two player share the joy of the front the other person can play the hats but that's still local local single-player it's putting out there - saying that you know that wasn't perfect mmm thumbs down apparently Tim yesterday asked for work on Pokémon stuff like how many Pokémon there's been and now there's a huge fight in there with Kevin, Capitalist Pig picking a bunch of other people trying to debate how many there actually have been so I'm not gonna get involved with that one I don't want to get into it I just said I'm not gonna get into a Kevin, Capitalist Pig dinner I didn't say Christine Lake his",
            "start": 4488.02
        },
        {
            "text": "many there actually have been so I'm not gonna get involved with that one I don't want to get into it I just said I'm not gonna get into a Kevin, Capitalist Pig dinner I didn't say Christine Lake his character was Jane and The Walking Dead Sea's got to know thank you very much for that Capitalist Pig comes back and says wait yeah no that's what I said that I don't know I don't accept that correction because he's saying the PlayStation 4 is shipped 667 point five million I'm saying yes that's what I said yeah thank you make that Clement I wanted know how you've gone before hand that's uh no because I said they had to remember that's not sold through I said the exact opposite of that can mean any time you got a Best Buy or whatever and you see a big pile of PlayStations those those relations have been shipped yet no one's bought him yet you're talking you microphone or I guess you can hear yourself but if you're gonna be if you're gonna give me a real correction I need you're talking like",
            "start": 4530.95
        },
        {
            "text": "been shipped yet no one's bought him yet you're talking you microphone or I guess you can hear yourself but if you're gonna be if you're gonna give me a real correction I need you're talking like I thought you had said afterwards that they had sold 65 as well which I thought was weird but then I thought I said that last time we got ya was 65 million and you're okay the last okay okay so you're saying so what Capitalist Piggy saying that he's saying that last time we have a check in on this but he's saying September 30th ship and whatever **** it video games are dumb yep Calf Calf 3330 says hey Greg just a quick update on Xbox One sales from a Business Insider article quote though Microsoft stopped reporting sales numbers of its Xbox One console numbers provide I'm sorry Xbox One console numbers provided by SuperData Research indicate Microsoft has sold approximately 26 million Xbox One consoles as of January 2017 so do you think that the the it could be like in terms of installed it",
            "start": 4575.32
        },
        {
            "text": "numbers provided by SuperData Research indicate Microsoft has sold approximately 26 million Xbox One consoles as of January 2017 so do you think that the the it could be like in terms of installed it could be like two to one PlayStation Xbox like it right they're talking about it yeah it's a lot isn't it that's a lot to and then here is where I guess with The Waterman's throwing a nice name by the way The Waterman is throwing out VGChartz which kinda just makes everything up but they're saying the PS3 the PS4 is sold sixty three point twelve million units worldwide Xbox One has sold thirty point nine seven millions worldwide there's no way yeah they're out and then another one from I'll beat that one but that's it that's not that bad there's more clarification pretty good yeah we'll do it you screwed up the worst you know it's a full-blown yeah you got a big nails you don't trust me I reject that one ladies and gentlemen this has been Kinda Funny Games Daily for Wednesday, November",
            "start": 4620.14
        },
        {
            "text": "you screwed up the worst you know it's a full-blown yeah you got a big nails you don't trust me I reject that one ladies and gentlemen this has been Kinda Funny Games Daily for Wednesday, November 1st, 2017 thank you for caring watching enjoying welcoming new Kinda Funny Games Daily Show host Gary Whitta I'll come up with a better name for you you don't to be Rogue One anymore I'll come up with something well now I'm Kinda Funnies it's gonna be fun when that's the one thing we screwed up if we would have gotten his news out first that could have been putting the Telltale release that's right writer of Rogue One and and co-host Kinda Funny chucklehead tomorrow's co-host will be Andrea Rene making a return to the show I feel like I haven't worked with her in a while oh if you didn't know each and every weekday on a variety of platforms we run you through the nerdy video game news you need to know about before jumping in to your questions comments and concerns giving your",
            "start": 4660.64
        },
        {
            "text": "didn't know each and every weekday on a variety of platforms we run you through the nerdy video game news you need to know about before jumping in to your questions comments and concerns giving your perspective answer your questions bad PSN names talking to Gary and having a good time if you like that you can watch a live on Twitch.tv/KindaFunnyGames you can watch later on YouTube.com/KindaFunnyGames or you can listen on podcast services around the globe no matter where you get the show thank you so much for supporting us remember Extra Life this Saturday 24 hours of crazy stuff games shenanigans maybe blue hair all benefiting the Children's Miracle Network so please go over there subscribe have fun until next time it's been our pleasure to serve you",
            "start": 4706.54
        }
    ]
}