{
    "id": 3127,
    "video_id": "8dXjsEDDxDQ",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Tim Gettys",
        "Nick Scarpino",
        "Kevin Coello",
        "Andy Cortez",
        "Elyse Willems"
    ],
    "title": "Funhaus' Elyse Willems (Special Guest) - The GameOverGreggy Show Ep. 204",
    "description": "Elyse Willems from FunHaus joins us to discuss American Vandal, fan theories, Muppets, and Margot Robbie. (Released first to Patreon Supporters on 10.27.17)\n\nThanks to Blue Apron for sponsoring this episode. Go to https://BlueApron.com/Greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1509724801,
    "duration": 4981,
    "transcript_chunks": [
        {
            "text": "Hey everyone, you know what I resupply be a few weeks ago? Blue Apron. If I'm lying, I'm dying. You've all been so great at supporting Cooking with Greggy, but I'm no master chef. I don't know how to cook a lot of stuff. That's why I love Blue Apron. Jen and I get easy meals we can whip up on a whim, and I get to learn how to make couscous or fish or something else I've never heard of. You sign up, pick your menu, and they deliver pre-portioned ingredients with step-by-step instructions. You just follow along, make the meal, learn something, have a good time. They've even included this handy little flowchart the last time I did it, teaching me how to make sauce from the fond. It's got wines in there. It's like a flowchart, like I said, that it's cool. I'm gonna laminate it again. This isn't something they wrote for me. I'm literally telling you things that are happening in my couch. If you know a good laminator, hit me up. Check out this week's menu and get $30 off your first meal with free shipping.",
            "start": 0.07
        },
        {
            "text": "they wrote for me. I'm literally telling you things that are happening in my couch. If you know a good laminator, hit me up. Check out this week's menu and get $30 off your first meal with free shipping by going to BlueApron.com/Greggy. You will love how good it feels and tastes to create incredible home-cooked meals with Blue Apron. So don't wait. That's BlueApron.com/Greggy. Blue Apron, a better way to cook. I used it at home. I'm seriously, in the comments below, tell me where to get something laminated. So kids, what's up everybody? Welcome to The GameOverGreggy Show. I'm your host Nick Scarpino, alongside, well, if you go that way, the Pure Ones, Tim Gettys Sixpence None the Richer. That was really good. Hunter Pence and Andy Cortez is joining us. Well, you don't have a **** name. What is your stupid nickname? Pomeranian. Take some treasure candy from fart from a galaxy far, far away. Andy Cortez, I guess. And joining us for the very first time, and we're very excited to have you.",
            "start": 41.07
        },
        {
            "text": "what is your stupid nickname? Pomeranian. Take some treasure candy from fart from a galaxy far, far away. Andy Cortez, I guess. And joining us for the very first time, and we're very excited to have you, Elyse Willems. Thank you for coming up. Thanks. Cool. Tim, I know. Yeah, I was like, hey, we should get Elyse up. And Tim and Colton was like, I'm gonna, I'm gonna make that happen. And he did, 'cause he's so **** cool. That's kind of what Greg made it happen. We all just like the most requested guests we've ever had. We say that a lot to the guests, but that's because it's true. It's true. Who these people requested, we make sure nothing. So here you are. You're doing not one, but two shows with us. Whoa. Like we brought some buddies, come a baker's dozen. We brought you up here to do Gamescast, but we're like, you know what, we got it, we got to talk about puppets and other stuff too. So we need you for dogs. First off, that's this podcast internet job. We should also note Greg is with us in spirit, but he, hey guys, do cat.",
            "start": 97.7
        },
        {
            "text": "what we got it, we got to talk about puppets and other stuff too. So we need you for dogs. First off, that's this podcast internet job. We should also note Greg is with us in spirit, but he, hey guys, do cat. What do you plan? You gotta catch up on something. He's sorry. He's got to get, he's had a long, great summer working a lot. So we gave him a little bit of a break today. He's gonna just sit over there and contribute when he feels like he wants to. This is a punishment. It's not a planet. Yeah, no, he's in timeout for not finishing his game. No, he has working back too hard. Fine. He's in timeout. He's in timeout. Solid. I don't know what it's called, grito Josh. Yeah, I call that the who's a one-armed guy from the band, the drummer, Def Leppard, Steely Dan. It was great. I bet you didn't know something, but I'm gonna say right now, what's up? They gave a radio show as a podcast for each and every week, four, sometimes five, best friends gather around this table, each bring a topic of discussion for you are listening.",
            "start": 154.1
        },
        {
            "text": "say right now, what's up? They gave a radio show as a podcast for each and every week, four, sometimes five, best friends gather around this table, each bring a topic of discussion for you are listening and/or music viewing pleasure. Almost got it. We break that top, we got break the podcast up, of course, taught by topic. We day by day, week by week, month by month. And if that doesn't sound confusing enough, well, and you want to get early, go over to Patreon.com/KindaFunny. And for $1, you could support us. I was gonna print a picture of a dog up and say that, well, your one dollar will save this dog's life. But then I started looking through those pictures and I was like, these are really sad dogs, and I don't contribute enough to the world, and I started feeling bad about myself. So I just left that joke out because he's on death's door. There's nothing I can say for telling Kentucky that has an Amazon wish list, so you can buy them stuff. Trust Amazon wish list. Okay, here we go. Seems like a very cool.",
            "start": 202.34
        },
        {
            "text": "out because he's on death's door. There's nothing I can say for telling Kentucky that has an Amazon wish list, so you can buy them stuff. Trust Amazon wish list. Okay, here we go. Seems like a very cool. I've been burned way too many times by people wish lists of things that you should get them. They never, they never take the picture with them. You know what I mean? You're talking about the girls way that sounds. Yeah, try to get out. I'm Kovac to do that. I'm like, make your wish list, put it in your Twitter. Madame Kovac, she's always so over everything that he doesn't have a wish list. You know, you like, hey, do you want that over? Like, I don't even like housing. I hate shelter. Of course, we love all you guys. Right now, subscribe to our channel if you're watching this on YouTube. And we're gonna go to the first topic right now, which is brought to you by, I guess, like a lot louder when Greg does it. I've noticed. Well, I like to be out to be the morning show. Now, what's up everybody? What's up everybody? Welcome to.",
            "start": 240.23
        },
        {
            "text": "topic right now, which is brought to you by, I guess, like a lot louder when Greg does it. I've noticed. Well, I like to be out to be the morning show. Now, what's up everybody? What's up everybody? Welcome to the game of boxing. First topic is from Tim's topic, same. What's your topic today? I want to talk about American Vandal. Here's the thing, we recorded this episode on when it's going out. So this might be a little, a night one might have already watched. The thing is, American Vandal going to be on Netflix forever. It's, it's an original series, so this is going to be relevant forever. And I feel like it's the type of show that you might miss out on if you don't hear about the hub of at the right time, right? So in the future, when you're watching this, if you haven't seen American Vandal yet, I recommend you watch the show. Why, Nick? Because it's really good. It's really good. Now, you guys got in the end of the show. I haven't finished, right? Got me into it, but you guys can feel free spoiling this for anyone.",
            "start": 296.69
        },
        {
            "text": "watch the show. Why, Nick? Because it's really good. It's really good. Now, you guys got in the end of the show. I haven't finished, right? Got me into it, but you guys can feel free spoiling this for anyone. Spoiler cap on. Let's keep it spoiler light. I should know I have not finished this because Tim told me yesterday, Nick, go home tonight and finish American Vandal. But we all had a really such a good time with Max Landis that I decided I was gonna start Dirk Gently's Holistic Detective Agency. Got hella into that. Forgot about American Vandal for a night. Came this morning, was like, ****, ****, I should have finished it. But it's really good. You goofed, man. It is done in the style of Serial and Making a Murderer, in that style. Yeah, exactly that style of right now. Have you, have you been listened to Serial? Oh, yeah. I, I, all those true crime docs, Shadow of a Doubt, Serial, The Jinx. I'm on there. S-Town, which is the spiritual successor to Serial, right? It's produced by the same. Yeah, I love Serial and.",
            "start": 343.85
        },
        {
            "text": "oh yeah, I, I, all those true crime docs, Shadow of a Doubt, Serial, The Jinx. I'm on there. S-Town, which is the spiritual successor to Serial, right? It's produced by the same. Yeah, I love Serial. And then I got to the end of Serial, and I was like, are you **** kidding me? Like, there's no definitive answer at the end. There's nothing. All of this was for nothing. They didn't really prove anything. They didn't get the guy out of jail. And I was like, no. Maybe the life, though. It is the only situation where I can think where there's actually, you'll find some kind of resolution is The Jinx, just because there's that crazy moment when he's in the bathroom, he says, kill them all. Of course I did, or whatever. Yeah, you did such a good spot-on impression that it just gave me a flashback. I was in that moment. Guys, **** freaky, freaky. This freaky ****. Are you familiar with this? I, I've heard Danny told me about. I mean, James and I were watching that week to week, and we'd have to like, watch something after.",
            "start": 389.66
        },
        {
            "text": "guys, **** freaky, freaky. This freaky ****. Are you familiar with this? I, I've heard Danny told me about. I mean, James and I were watching that week to week, and we'd have to like, watch something after to cleanse or something. Felt so creepy. But the thing, that's the thing about Serial, though, is that they would do those like, it's obviously a beautifully produced show that keeps you riveted. And it's from, from start to finish. I'm like, wow, this is like, I'm really into the story. Like, I want to know if they made this phone call, and I want to know if this was even possible, and yada, yada, yada. But as you go on with it, and you look like it, when you finish it, you look back here like, yeah, some of that was completely ridiculous. Like the part, which is like, and that's what had me really concerned. You like those moments that I feel like people would smoke weed, listen to, and go, you know, we should make a show like this that's 40 million making me up. And yes, then that's what keeps me up at night. It's like.",
            "start": 441.11
        },
        {
            "text": "those moments that I feel like people would smoke weed, listen to, and go, you know, we should make a show like this that's 40 million making me up. And yes, then that's what keeps me up at night. It's like that alone was enough that you could tell, you could see the seeds of where the creative ideas from American Vandal came. Like Sarah Koenig, who's the Serial producer, she, it'd be ten episodes or eight episodes or whatever, and she'd explore every red herring, right? So just when you think she's on, she's presenting now to you what the most valid argument and suspect is going to be, that at the end of that episode, it's revelation. Allow, actually, was this is where this, this, you know, investigation ended, right? For this specific person. But that's what I loved about American Vandal watching it, because so Greg sold it to me, and he was like, dude, I watch this. It's so funny, 'cause I, my first introduction to the show was my TV was on, and we had just finished watching some ****, and then it was just cycling through.",
            "start": 483.97
        },
        {
            "text": "it to me, and he was like, dude, I watch this. It's so funny, 'cause I, my first introduction to the show was my TV was on, and we had just finished watching some ****, and then it was just cycling through like screen savers on my TV. Does that for some reason? And it was just like the thumbnail for it, but it didn't say American Vandal, and it was just a picture of a bunch of cars with dicks on it. I was like, what the **** is this? Like, that doesn't make any sense. If that was like, all right, whatever makes it work. Greg was like, dude, I just watched the show American Vandal. It's about drawing dicks on cars. And I'm like, tell me more. But the thing, the thing that they do so well in this show is obviously its satire, and obviously it's making fun of those. But I am legitimately invested in who drew the dicks on these cars. And it's actually, it's, it's actually a well done like whodunit. Like, there's a little bit of suspense, and I want to get the eye invested in the characters enough to want some sort of resolution.",
            "start": 530.65
        },
        {
            "text": "cars. And it's actually, it's, it's actually a well done like whodunit. Like, there's a little bit of suspense, and I want to get the eye invested in the characters enough to want some sort of resolution. Now, granted, I haven't finished it, and I swear to God, I know there's got to be no **** resolution, because it has to be no resolution at the end of it. But if it's such a well-done show, like from production design, the acting, acting, the active talk about camera work, the cameras mandating, let's talk about the motion graphics. Like, yes, what's the 3D ****? Oh my God, the best part. The thing that **** killed me was when they were like, could someone have ever seen the **** on the pier? And it goes in 3D, and it's just one like red character jerking off another red character. I was like, guys, are **** twisted. If you don't know the show, the basic premise is that this high school kid, he's accused repainting was 7 penises on 7 teachers' cars, right? And he's expelled from school, so he.",
            "start": 571.09
        },
        {
            "text": "**** twisted. If you don't know the show, the basic premise is that this high school kid, he's accused repainting was 7 penises on 7 teachers' cars, right? And he's expelled from school, so he can't finish out his year and graduate. And essentially, another kid and a documentary crew says, hey, we got a vehicle, decides to do this. And the best thing is, they commit so hard to it that even the opening credits, all the credits are the crazy kids' anime, not the people who directed the actual series. It's the name of your character, Sam Ecklund. Yeah. And kind of the main suspects are the AV Club, just be done. They would have had access to like the cameras, everything. But, but what I loved was that the reason, because the, the main like perpetrator, what's his name? Dylan. Dylan Maxwell. Greg, don't Greg. Greg, if you're gonna be a part of the episode, be a part of the episode. The camera and grimace while Elyse's talk. Well, Dylan, he's in the AV Club, right? Which even though, because every time we pick.",
            "start": 612.05
        },
        {
            "text": "Greg, if you're gonna be a part of the episode, be a part of the episode. The camera and grimace while Elyse's talk. Well, Dylan, he's in the AV Club, right? Which even though, because every time we pick attention, whatever shot, so he can use their camera equipment to make his YouTube, which, which is so good. Like, you so much subtlety. I mean, obviously, we are kind of behind the curtain on a lot of stuff, so that I feel like there's an extra layer for people that are really into internet video, right? Production, a lot of stuff, because there's so many jokes that are funny, like Marge and Babies. Even something as simple as Dylan's making shitty YouTube videos, whatever. But this documentary team, the AV Club, puts theirs on Vimeo. First episode being like, wow, I'm so hooked, 'cause it ends on the first episode's cliffhanger. Is just **** brilliant when it's revealed that the dude, there's like this nerdy ass dude, and claims he got a **** from some superhot girl. That guy's awesome. That guy's the actress. That's.",
            "start": 664.61
        },
        {
            "text": "is just **** brilliant when it's revealed that the dude, there's like this nerdy ass dude, and claims he got a **** from some superhot girl. That guy's awesome. That guy's the actress. That's **** funny. But I was like, how is this show, how does it have seven more episodes? Oh, I, I was like, I don't think this can possibly keep up. Edit, there's not a wall the entire time. There reaches a point in the middle of the series where I'm like, it's been four episodes since we've even seen Dylan. Yeah, I don't care, 'cause it's **** good. Yeah, I think for when I was like four episodes in, I was reminded of the four episode run that Castlevania had. So four episodes, and I was like, surely it's almost done, 'cause how can they possibly keep this up? And it just kept going and kept going. And then I was like, all right, episode 6, probably this is probably the end right here. I don't know. So eventually it's 8 episodes, right? But they do such a good job of throwing all these different layers at you, and to the point where.",
            "start": 718.52
        },
        {
            "text": "6, probably this is probably the end right here. I don't know. So eventually it's 8 episodes, right? But they do such a good job of throwing all these different layers at you, and to the point where you're like, legitimately, who the **** did the dicks, man? It's a great satire of those podcasts and those shows that they present every single avenue, every single suspect. They explore every opportunity that could have conspired to make this crime happen. And that's what makes it feel so real. And the basic premise is so immature, and it's done, it's so stupid. And that's what makes it even more compelling, because they found a way to weave a narrative around just this like base and idiotic. And it's hard to it, like it, maybe this is where there's something's like towards the end that I don't want to spoil, but I feel like the last episode and a half really kind of like puts everything in perspective of this, this type of **** affects people's lives. Like this kid getting expelled could totally change the.",
            "start": 758.51
        },
        {
            "text": "I feel like the last episode and a half really kind of like puts everything in perspective of this, this type of **** affects people's lives. Like this kid getting expelled could totally change the course of his life and the people around him and all that. And I like that they went there. I like that it wasn't just all jokes throughout the thing, although the jokes are so funny. The jokes are so, the teachers are subtle too. That's the thing is like, they're not in-your-face jokes. There's jokes for you're like, they're just all performance-driven. Like the Mr. Krarbs character is probably the most outlandish of all of them. But the Dylan Maxwell, we've all had those teachers. We've had the Mr. Krarbs. We've had, I like to believe that I worked hero, huh? I'd like to believe that if I were a high school teacher, I didn't win when, okay, so there's a scene, Elyse, we're square. I was gonna say Scarpino, but when Mr. Krarbs is on, he's taking Snapchat videos of himself, like one of my music on a hoverboard.",
            "start": 800.75
        },
        {
            "text": "teacher. I didn't win when, okay, so there's a scene, Elyse, we're square. I was gonna say Scarpino, but when Mr. Krarbs is on, he's taking Snapchat videos of himself, like one of my music on a hoverboard. Another one's like on a board with a low Reba. Oh, with a Cohiba. Accidentally drove into the exit of the McDonald's. But I was telling, so this past weekend, this is gonna show you like how dated this episode is, but we were at the Let's Play Reunion, and I was talking about this show with the guys from Sugar Pine 7. And I was telling Kid that Jimmy Tatro, he's, he's a YouTuber. I didn't know that, right? Yeah. So Jimmy Tatro plays, according to Jimmy, the main **** up guy named Dylan Maxwell. And it is one of the best acting performances. I was talking with like Benny Fine, like Fine Brothers React, because he knows him. And he was like, yeah, he's such a great actor. Like, I can't believe nobody realized like every line is so perfectly done. Like even going down to some parts of you think that could have.",
            "start": 842.11
        },
        {
            "text": "he knows him. And he was like, yeah, he's such a great actor. Like, I can't believe nobody realized like every line is so perfectly done. Like even going down to some parts of you think that could have been like improv and stuff like that. But the writing so good. And it didn't ever feel, the thing I was gonna be worried about is that it was gonna feel like 40 year olds writing a movie about a high schooler. So there's gonna be some stuff that was thrown in though that was odd. But like, they referenced which at one point, and they reference, of course, all the social media and Twitter and all things like that. Yeah. And it like everything felt so like me. And later on, it's funny because it's like, it's actually pretty fascinating. They do a whole episode where it's just the Instagram like, or just the, the, the, I know a message. Well, no, no, it was like everyone's social media feeds, and they pieced together what happened. And I'm like, that you could let you actually probably **** do that apart. It's like.",
            "start": 908.32
        },
        {
            "text": "the, I know a message. Well, no, no, it was like everyone's social media feeds, and they pieced together what happened. And I'm like, that you could let you actually probably **** do that apart. It's like legit. If they're a bit of crime and Let's Play, you could have taken all of us, probably figure out who had done this angle. You can see spoilers. It would have been that dude from Champaign. Mr. Krarbs's Twitter feed. Is it a real thing? Oh my. Maybe you haven't hit it yet then. Oh, no, no. Something happens to him. And then I know, yeah, they kind of flashes and you see all of his, yeah, class is boring in history teacher. And so history's the kids who are, who are part of the, the AV Club are all like kind of the key suspects because they have the capability to have deleted the, the security footage, right? There's like a, there's a 30 minute piece of security footage that's missing. And that's like the key piece of evidence that they need to see who was in the parking lot. And so they're referencing one random.",
            "start": 947.59
        },
        {
            "text": "like a, there's a 30 minute piece of security footage that's missing. And that's like the key piece of evidence that they need to see who was in the parking lot. And so they're referencing one random girl who's on them on the, the part of the AV Club. And they asked Mr. Krarbs about. And he's like, oh yeah, she's a cool girl. Yeah, really nice. But again, you know, just like super, super boring. And the fact that he feels like he's owed entertainment from a studio. So, you know, just present. But again, not only do every single character that's introduced at some point, you get deeper with. And at some point, you like, you learn something about them that you're just like, wow, this, the world is so fleshed out. It's off surface level stuff. And then getting likes gets so much deeper. And they'll be like flashbacks, or there'll be things where it's like parts of the documentary you have total different meanings later when you meet other characters. Yeah. And I love that there reaches the point. I think it's probably.",
            "start": 1001.74
        },
        {
            "text": "there'll be things where it's like parts of the documentary you have total different meanings later when you meet other characters. Yeah. And I love that there reaches the point. I think it's probably like four or five episodes into this series, but it starts getting meta as **** because the kids at school start watching. Yeah. They don't want to start being in the documentary. And it's so every time he's doing mural shots, like here you thought, like all that stuff starts happening. It's, it's, that's very fascinating. Yeah. That's like surface level. This reads like a, like poorly done satire or parody of what's going on. But it has a lot of depth. Not the least of which is when you're watching it, you're like, ****, the joke's on me because I am the idiot who is following all of these threads in real life and in this parody. And like, what does that say about me that I'm so invested in this thing that probably doesn't have a definitive outcome? Like, why do I view these series is like Serial and all.",
            "start": 1045.93
        },
        {
            "text": "life and in this parody. And like, what does that say about me that I'm so invested in this thing that probably doesn't have a definitive outcome? Like, why do I view these series is like Serial and all these other things as entertainment? Like, what's that say about me? I granted like Serial was a cause and they were trying to like actually bring more awareness to it. But at the same time, I'm like, this is **** riveting. And I wanted more of it. And I had, I didn't really care if the kid got off or not, you know? But like the ramifications it has in the lives of the people that are accused but proven innocent. They're still kind of that lingering sense of doubt. Or it just has like, it touches on those ramifications much later into the documentary. But where it's like, well, these people are sort of guinea pigs in, in these kids' video project. Yeah, yeah, the project. But it like does have a lasting impact. Hold on real quick. Greg, how are we doing back here? He's on the fairway. Cool, man. Now, this is not the.",
            "start": 1086.34
        },
        {
            "text": "pigs in, in these kids' video project. Yeah, yeah, the project. But it like does have a lasting impact. Hold on real quick. Greg, how are we doing back here? He's on the fairway. Cool, man. Now, this is not the same game you were playing before. Everybody's Golf. Now, how does it rate? How does it rank up to Everybody's Golf? Game we just got plugged. Um, I'll finish it this week. I'll probably call you. Do we, do we think before we move to the next topic, do we think that there will be any like serious award considerations? Oh, I think that what I get ready for this or listen odd for this. I would imagine this is **** brilliant. It's, I've never seen anything like this show before. It is brilliant because it, the execution is so perfect. And I feel like it succeeds in so many different fronts because if it was just a funny show, or if it was just like, oh, it's well thought out, it's parody, whatever, that'd be one thing. But the acting so good. It's so good. And again, going back to the cinematography, the amount of shots.",
            "start": 1130.35
        },
        {
            "text": "funny show or if it was just like oh it's well thought out it's parody whatever that'd be one thing but the acting so good is so good and again going back to the cinematography the amount of shots of through the drone, Charlie's the drone shots, the and but they're but they're perfect they're just perfect you know what I mean they're so good all of them are at sunset which is hilarious because after you through the thirtieth one you're like okay we get it you film the fucking sunset. Meta-production shit where it's like the types of shots they use and when they use them like there's a point in it where they're not allowed to shoot at the school anymore so it's like every shot from the school yeah becomes old shots that they had from before that you've seen but now they have different like meanings to it like or even though I love really pulled this off like that and the very first person you I feel a kind of parody that I would have watched satire that that really holds up as well it's",
            "start": 1183.18
        },
        {
            "text": "meanings to it like or even though I love really pulled this off like that and the very first person you I feel a kind of parody that I would have watched satire that that really holds up as well it's like well the part of the thing is Tim nailed it right there this is clever on so many levels because it's making fun and touching on so many different things which is like it's such an all of social media it's such an odd video uploading it's touching on the YouTube culture it's touching on what happens when when people get famous for making something and how does that affect their their reality suddenly like suddenly the kids who were making the thing became the celebrities and then that affects them in a different way right it's like it's just it's an interesting commentary on everything that is happening online right just so unbelievably well done but I also think that like as every minute I was watching it I couldn't help but think man it must have been so much fun to be a part of it",
            "start": 1224.25
        },
        {
            "text": "is happening online right just so unbelievably well done but I also think that like as every minute I was watching it I couldn't help but think man it must have been so much fun to be a part of it oh I'd like to be a part of the production to be a part of like oh we should cut to a shot like this because The Jinx did that or like I love the idea I you could just tell they had a blast being in the show every other cliffhanger is like and this changes everything and then the intro song with the video that's perfect because it's just good enough yeah like that good like it's not it's not perfect HBO quality it's like FX quality. The Onion's Sex House, no oh man it's it's I mean it's not this it's totally not in the same level in terms of like production value or just levels of genius I'd say in terms of parodying a reality show or that kind of like The Onion's Sex House is hilarious it's just a bunch of people that are put in this house with the indication that there's a Big Brother sound oh",
            "start": 1267.93
        },
        {
            "text": "terms of parodying a reality show or that kind of like The Onion's Sex House is hilarious it's just a bunch of people that are put in this house with the indication that there's a Big Brother sound oh yeah but then they don't give them food so they all start developing like scurvy and then like they start pumping like smells and it's just it's brilliant that's awesome but yeah it's definitely not on the same level as this but it is a fun one and we were talking about Burning Love which is it's a bachelor party I mean it just nails it but it's like yeah that's easy to parody it is it's low-hanging fruit as you watch it and the parody is almost like it's not any funnier than the show cuz it's kind of just the show and I feel like even that as well done as it was it lacks that that kind of wants you wants to it though like the point right it lasts like I feel like American Vandal I'm happy that you needed to happen like it is its own thing at the end of the day whereas Burning",
            "start": 1327.9
        },
        {
            "text": "kind of wants you wants to it though like the point right it lasts like I feel like American Vandal I'm happy that you needed to happen like it is its own thing at the end of the day whereas Burning Love is just it's a parody yeah whatever do you think you think they do American Vandal season 2? Definitely yeah I definitely think they do. I'd like the house or it could be American something well that's what I'm saying it's like do they do they do the the sort of thing that like yeah well it's like instead of O.J. it's the Menendez Brothers were actually under those that you don't separate true crime documentaries doing those but like yeah I wonder if they just do a different start completely from starting a fresh story as I continue the story on this one yeah crazy yeah well we will have to wait and see everybody out there let us know watch American Vandal on this and let us know what you thought of there's a show that I wanna give a shout out to you that this reminds me of a lot and it",
            "start": 1374.46
        },
        {
            "text": "see everybody out there let us know watch American Vandal on this and let us know what you thought of there's a show that I wanna give a shout out to you that this reminds me of a lot and it doesn't parody any one specific thing there's kind of parodies like reality TV in general, youth culture yeah I love that you're just gonna use young children as a punchline even watch Young Sheldon the ratings were oh my god for life me and again I'm not I I of all people cannot sit on a high a mighty throne and tell people what they should or should not be watching but I have watched episodes The Big Bang Theory it's it's okay I don't I don't understand why that show is so popular why it resonates with people at all again not bad as a sitcom I'm like this is a beat well-made sitcom like they they hit every fucking point they need to hit to make this a sitcom I did feel the same way about Two and a Half Men at that point and then I like moved out of my apartment which had full cable into",
            "start": 1415.2
        },
        {
            "text": "they hit every fucking point they need to hit to make this a sitcom I did feel the same way about Two and a Half Men at that point and then I like moved out of my apartment which had full cable into an apartment which I only had the no basically had fucking antennae that like my oh my dad made me an antenna that like I put on that he's like he made out of a 2x4 and like like hangers like really yeah yeah and it worked better than the one I bought at Best Buy like I got Fox on it and I didn't get Fox and look from Best Buy there you go yeah it was crazy so anyway so that I was like man I'm living it to like ABC NBC Fox CBS let me see what's going on on a fucking ABC or whatever channel of CBS Two and a Half Men would be on be like fucking stupid show and like a couple days eventually that's how all sitcoms get you or you're like man I just have nothing better to do there's nothing yeah it's that stupid formula it's the characters never actually like being in any necessarily super bad",
            "start": 1462.75
        },
        {
            "text": "how all sitcoms get you or you're like man I just have nothing better to do there's nothing yeah it's that stupid formula it's the characters never actually like being in any necessarily super bad situations right the worst that the worst that happened to Sheldon is that you can't find his pants and the balls tonight where are his pants it's like whatever who fucking cares right was extra punctuated by the fact that Charlie Sheen was having a fucking meltdown when that show was happening higher blood fucking midway through them yeah this is like yeah we got they fired him off the show indication though like it said no no yeah yeah yeah along with a Wayne Brady and fucking what's behind this fucking thing you know oh wait there's no no during the day no it was a game show where like you either took what was this or what was behind the wall was it the what was it or the hell you're talking about Let's Make a Deal he did Let's Make a Deal - yeah Wayne Brady Wayne Brady yeah I didn't remember",
            "start": 1511.3
        },
        {
            "text": "what was this or what was behind the wall was it the what was it or the hell you're talking about Let's Make a Deal he did Let's Make a Deal - yeah Wayne Brady Wayne Brady yeah I didn't remember that he was great oh you're so good man that's the kind of thing aspiring stand-up comedians dream about right being just relegated a daytime TV I have to Google this cuz maybe I'm wrong why don't you Google that at least what is your topic my topic you have to read the whole spiel the Margot Robbie thing oh oh this time Wayne Brady doing it he's been known to 09 - Wayne Brady man and you're still talking about it Margot Robbie recently oh I'm sorry I do apologize I apologize that's the last topic the first topic is fan theories Oh fan theories yeah right I'm a big advocate and lover of fan theories whether they are debunked proven true good bad atrocious can we help you Kev is everything okay yeah Kev just does that thing, Elyse is so scary just concerned I was like what okay hold on I'll",
            "start": 1571.0
        },
        {
            "text": "whether they are debunked proven true good bad atrocious can we help you Kev is everything okay yeah Kev just does that thing, Elyse is so scary just concerned I was like what okay hold on I'll give it to Kevin cuz Kev, you nailed it that's like your whole family got but died can you can you give it to us one more time the other one is good or bad proven or disproven and so I love talking about that my love re I'm in the fan theory subreddit all the time and just sifting through trash upon trash and so I was wondering what all of your kind of favorite fan theories are love is and one of those Tim or Andy said maybe we come or maybe you even come up with some news next I want yeah I wanted I want to start a fan fan theory at some point Jason Statham and The Rock it'll come out they're related they're brothers that's just like saying this is like a seed of truth as 90% of the fan theories on the internet no let's go through let's go through some of your favorites and they both fight okay they",
            "start": 1617.2
        },
        {
            "text": "they're brothers that's just like saying this is like a seed of truth as 90% of the fan theories on the internet no let's go through let's go through some of your favorites and they both fight okay they actually be a sizable aside from the fact that they should hate each other and they still have to love each other and that's what brothers do they've already like established you as a family they both have British accent seen The Rock's family yet that's that is true why haven't we seen The Rock's family these are the real questions they're both black men true story or Polynesian I don't think Jason Statham is but I think he's super British yeah not to be then that that you can't be British and black at the same time but I'm pretty sure he's white as fucking milk there's a there's a boxer named Lennox Lewis sure yeah and he's a black man and I was very young when he was boxing but he has a very and he's very English yeah and I was like how is that possible I didn't know that as a kid when",
            "start": 1704.83
        },
        {
            "text": "Lennox Lewis sure yeah and he's a black man and I was very young when he was boxing but he has a very and he's very English yeah and I was like how is that possible I didn't know that as a kid when your dumb little kid the exact but I've told this story before but Michael Jackson confused the living fucking out of me when I was like under 10 I was like okay so Michael Jackson is a white woman like I was convinced it was a white woman based on the music videos from the early 90s but then I saw videos of him and he was like a little black gorilla right and I'm like this doesn't work. Jackson's inside my head and so it's like there was so much going on but then I found out it's like oh no he just that's just how things go and that's your family woman but I thought he was a woman yeah I think as a child sometimes you can't understand motivation so you look Michael Jackson I guess for me too I was almost like I don't know how he got from A to B 30-man frame in the middle that was bleeding we",
            "start": 1753.66
        },
        {
            "text": "a child sometimes you can't understand motivation so you look Michael Jackson I guess for me too I was almost like I don't know how he got from A to B 30-man frame in the middle that was bleeding we need to find out well I don't think anyone will ever 100% understand Michael Jackson's motivation. Sammy Sosa dyes his hair or does his skin white he's at skin bleaching didn't Michael Jackson Sammy Sosa had like I know that Sammy Sosa does not for sure Oh Michael Jackson claim to have that whatever nothing was the autopsy did establish maybe I'm wrong I don't know I don't really with all the skin and conditions and things like that's like when you don't understand that's like it affects the people that have it and it affects the people that are close to them because they are you know educated on that otherwise you just I don't fucking know any that stuff like Gia's dad definitively looks black if you just said she's she looks just like me yeah but her dad like looks like a black man and you",
            "start": 1792.99
        },
        {
            "text": "that otherwise you just I don't fucking know any that stuff like Gia's dad definitively looks black if you just said she's she looks just like me yeah but her dad like looks like a black man and you wouldn't ever know and I know that's like like James's dad is from Ghana and he has like some siblings that are like so like their skin is so dark compared to his it's like so weird it's like yeah okay yeah we're a big melting pot see I got my Michael Jackson's perfect a perfect place to bring it back to the topic because there were so many different theories about what was going on with that guy right he never really knew but it was always fascinating for people to like to think about you're like is he bad or is he not bad well first off first off let me just set the record straight on this Michael Jackson was in fact bad he was fucking bad yeah I don't care what anyone says about the man that's a person but his music and his performance next level fucking no I'm talking about I thought you",
            "start": 1843.49
        },
        {
            "text": "Jackson was in fact bad he was fucking bad yeah I don't care what anyone says about the man that's a person but his music and his performance next level fucking no I'm talking about I thought you were saying is definitively back no he was a bad fucking I don't know if he was like a bad person I just mean bad as in like who's bad I would you I absolutely loved them I didn't know that you love it you love about that stuff my favorite one has to be the the Pixar the same Universal my love how many little things like make it make sense there are a couple things that when you look at it you're like alright it obviously isn't real then there's a lot of Disney ones because you know they kind of have their universe going there's some that I'm like I don't even count them as fan theories because it's like so obvious but it is being that kind of got confirmed a little bit I feel it was it was the jeez what dude of Aladdin that's like on the camel the shopkeeper yeah that's telling the story it's",
            "start": 1891.22
        },
        {
            "text": "like so obvious but it is being that kind of got confirmed a little bit I feel it was it was the jeez what dude of Aladdin that's like on the camel the shopkeeper yeah that's telling the story it's the Genie yeah and it's like I even when I was a dumb little kid I knew that cuz it's the same voice and he kind of looks like a same facial hair and fucking and then also when you widen to that Aladdin 2 & 3 with my mind he ends 3 like it's like it all wraps together and even kind of like that's probably where I went wrong and watch anything past Aladdin anymore that is where you went wrong cuz never sure I'm not fucking with I'm just saying when be my only access for the Disney movie back in the day was the really big puffy VHS case no I'm good I don't want I didn't see it in the theaters son were they in our theaters because Disney just had this thing they did where all of their animated movies were like in these big white puffy VHS I mean I think it's cuz kids do you want them no you're",
            "start": 1938.38
        },
        {
            "text": "were they in our theaters because Disney just had this thing they did where all of their animated movies were like in these big white puffy VHS I mean I think it's cuz kids do you want them no you're right yeah cuz I remember having several not on these fucking The Little Mermaid it's all fucking not my source is that it was me the Pixar theory is great and being able to arrange those chronologically and say like oh this is you know A Bug's Life was the repopulation of the earth after WALL-E I love that there's they're like microcosm theories that like uh Jessie from Toy Story was like Andy's mom and it's it's great though because there's so much evidence that you're like wait a minute this is fucking but do I feel like that's a fan theory that's just backstory that tests come out no why do you think we is just like okay just things that people did but they're not there's not some overarching like conspiracy to make them connect it's just the guys at Disney and Pixar really good at flushing",
            "start": 1983.13
        },
        {
            "text": "think we is just like okay just things that people did but they're not there's not some overarching like conspiracy to make them connect it's just the guys at Disney and Pixar really good at flushing out their characters well because they'll do that even in multi movies like yeah it looks like comparing to Toy Story that are totally separate and right universes right but then there'll be things where it's like the pizza delivery truck from Toy Story is yeah Pizza Planet is all fucking up and dilapidated in kind of create a timeline when you look at it interesting like like the theory gets really off-the-wall and it's like it goes to me in like oh man this is this has to be true to then it reaches a point of like the machines take over and that's why Cars exist ya know I think the best fan theories are the ones where there's actually like contextual clues that the creator is piecing together to say this is not someone that goes like oh so-and-so exist in the same universe why because",
            "start": 2034.7
        },
        {
            "text": "theories are the ones where there's actually like contextual clues that the creator is piecing together to say this is not someone that goes like oh so-and-so exist in the same universe why because the character is the same name but it's like well that's just a little lame but when you can actually deduce and identify clues similarities threads that's well yeah I mean like but I mean I and I loved it and I loved when those fan theories become reality like one of the bigger fan theories that are not necessarily fan theories we've kind of knew it but like they confirmed it evidently in the news last couple days with Spider-Man: Homecoming in Miles Morales being in like in the universe we knew was in fact I mean he was well he that's the uncle but we never really I think this I believe in reaction what's that I think I know about the Tarantino Universe how like it's all in the same universe I didn't know that you know that is that supposed to be I think well that's a fact well those are",
            "start": 2079.37
        },
        {
            "text": "what's that I think I know about the Tarantino Universe how like it's all in the same universe I didn't know that you know that is that supposed to be I think well that's a fact well those are all tied got tied together with the Red Apple cigarettes right every time someone order cigarettes are smoking something they have the same products and I think that that's that's what ties that world together so that makes sense be familiar that like no that's when Pulp Fiction when they walk up when he walks up to the bar and he's like pack of smokes he like every every time anyone smokes apparently in the Tarantino world their their specific brand of cigarette that doesn't exist so it's a fictitious brand of cigarette and so apparently that supposed to tie everything together I could be totally making this up but I'm pretty sure it's Red Apple cigarettes oh yeah I'm pretty so like oh by the way like in Pulp Fiction when when they are at the diner when him and Mia Wallace are at the",
            "start": 2126.95
        },
        {
            "text": "totally making this up but I'm pretty sure it's Red Apple cigarettes oh yeah I'm pretty so like oh by the way like in Pulp Fiction when when they are at the diner when him and Mia Wallace are at the diner and they're talking about the movie that she made and the the kung-fu movie that she made and every character that she talks about are the bosses in Kill Bill so she talks about like someone so it was good with explosives and so and so it was good I never put that one of the things of the Tarantino Universe is that the universe is obsessed with terrible fan the universe is obsessed with film because Hitler died in a movie theater in an Inglourious Basterds in that in that parallel or alternate timeline Hitler's killed in the movie in a movie theater what yeah you see no glasses but you guys right now so in that theory then in his you alternate universe that's why everybody knows movies in this way in Kill Bill they reference arting in Pulp Fiction reference movies all the time Kill",
            "start": 2162.29
        },
        {
            "text": "Bill is a movie with its the movie within the universe like interesting that's um so Kill Bill is supposed to not necessarily have happened in the Tarantino Universe it's supposed to be movie that was amazed me that people can reference in the turn yeah and that universe yeah that's not and that's supposed to be like oh well this is why you were blowing my mind I love it I love the Jar Jar Binks as a Sith it's like what is this you explain this to me over lunch and I'm like how can anyone draw that parallel is there anything to back that up at all I don't remember the exact like points of it we can Google it yes the Jar Jar Binks thing is it's equally a Sith character there's a full story online where like it goes through piece of a piece of every single action he does and like yeah",
            "start": 2209.84
        },
        {
            "text": "we can Google it yes the Jar Jar Binks thing is it's equally a Sith character there's a full story online where like it goes through piece of a piece of every single action he does and like yeah how it could have reacted like why the whole story happens people listening this are like really mad right now we can bring up the chat by the way if you're if you want to watch this live well do it you can support us on Patreon we're talking about the Tarantino Universe yeah yeah let's shared universe I love I love you know one of the things I love doing is reading IMDb trivia as I'm watching whatever movie because I've seen Pulp Fiction so many times and I saw I found some things in there I was like I can't fucking believe I didn't know that like for instance do you guys remember how that whole monologue that Vincent Vega has about someone keying his card he's like I wish I knew that fucking was supposedly it was supposed to be Bruce Willis's character yeah oh he was a dick to him in the",
            "start": 2255.8
        },
        {
            "text": "bar and Bruce Willis leaves and apparently keys his car for me my favorite theme for fan theories is video games because there's so many that it's like wow this is so crazy that it could totally work like Mario 3 being a play yeah I mean was it I guess I'm a weird loose thing but like because the the oh because it looks like a stage the opening menu is the curtains open and then every single level like every platform or whatever is held up like by looks like a stage and even the border of the the game looks like it's a like a bunch of flats and can you hear how the levels that you can like hold down and go behind you can go backstage in it you're going backstage it's cool I thought I think so I thought I heard that too well I'm sure that's all I'm sure like and then this is where this gets",
            "start": 2296.54
        },
        {
            "text": "into meta territory right because I bet if you asked the art director of that that game he was like yeah that was our idea behind it it's not necessary that we embrace that fully as a storytelling device it's just it's cool this is our art style and that's what we're going with right because like Mario is that there's so many different types of art now that they've done difference there is like for example Yoshi's Island is the art style of it is a coloring book but that doesn't actually affect the gameplay of it and like things that happen whereas in Mario 3 it's like there are moments and I'm blanking on some of them now but like there are things where it's like whoa like that's straight up like the way that he wears the costumes is different than when he has abilities in other",
            "start": 2339.92
        },
        {
            "text": "and I'm blanking on some of them now but like there are things where it's like whoa like that's straight up like the way that he wears the costumes is different than when he has abilities in other games because they're play costume that's a really cool concept yeah I'm looking at me like I'm so much more theories on fan theories right now like from all time give it to me um the entire movie of Aladdin was simply the fulfillment of his first wish it was it was don't **** with me we did a while back where it was like what would you wish for what are your three wishes but we always felt like they always get you right really I want to be taller that but all said you're like eight feet tall and you're a **** 40 feet it has to be your first wishes have to be whatever you want whatever you want and don't **** with me I'm not three more wishes no no you can't wish for more wishes because that's always that's always the they tell you can't yeah the third ones always don't **** with",
            "start": 2380.51
        },
        {
            "text": "want and don't **** with me I'm not three more wishes no no you can't wish for more wishes because that's always that's always the they tell you can't yeah the third ones always don't **** with me okay the best Disney fan theory though and the one that like I stick to being **** true I don't care if it's debunked or not is the Frozen Tarzan Little Mermaid like situation where it's like the when the mom and dad leave Elsa and uh yeah and they take the ship and it crashes or whatever it's the same ship that Ariel sees in Little Mermaid and the when the ship crashes they end up on an island and they're Tarzan's dad like they have Tarzan and then they're killed in Tarzan Tarzan got the **** Tarzan's also not his brother Wow Link being dead in Majora's Mask my favorite fan theory of all time Pokémon Red and Blue when the when he gets a Lavender Town and and then this has been debunked the creepy music it's been debunked but when you go up the tower you fight your rival and",
            "start": 2425.09
        },
        {
            "text": "of all time Pokémon Red and Blue when the when he gets a Lavender Town and and then this has been debunked the creepy music it's been debunked but when you go up the tower you fight your rival and he was talking about how he's there to mourn the death of one of his Pokémon and he'd had Raticate a Rattata that turned into Raticate throughout the game and he no longer has Raticate in his party and it's just like holy **** is he mourning the death of his Raticate and then for that's the game doesn't have Raticate he poisoned it, dick yeah and he would have it what are the top ones right now I'm looking through them that I mean they're for again they're very very worried because I'm just top level for me let's see in Predator 1987 the first one the alien tries each man's masculinity each man who dies so each man who dies does so in a manner befitting to his swagger yeah but that's not a fan theory that's just that's the story what happened the fate of the Starks wolves dictates the",
            "start": 2477.95
        },
        {
            "text": "man who dies so each man who dies does so in a manner befitting to his swagger yeah but that's not a fan theory that's just that's the story what happened the fate of the Starks wolves dictates the fate of the Stark children interesting alright but again that but I don't know if that's necessarily like so that's thing I don't know if it's necessarily like something in the workings happening behind the scenes or if that's just a good storytelling device of like the thing is anyway it's a fan theory when it you're predicting it seasons in advance right once then it happens it's no longer a fan theory sure so like Jon Snow and Daenerys being related R+L=J or whatever the **** it was L+R=J, you know nothing, Jon Snow that line of something that was a fan theory until it happened fair right there's some silly ass **** on here let me hear brother kick it over but this one requires a lot of photos is that gonna make sense but just listen to the title just **** take in this title",
            "start": 2526.29
        },
        {
            "text": "right there's some silly ass **** on here let me hear brother kick it over but this one requires a lot of photos is that gonna make sense but just listen to the title just **** take in this title for a second the members of Smash Mouth have the same blindness slash sensory powers as Daredevil but the power is passed around between the members at random only one member can have them at one time so in their hit song All-Star one of the line clearly admits my worlds on fire how about yours that's why I like it I never get bored one of the key tenets of Daredevil's comedy Netflix series is that while Matt Murdock / Daredevil was blinded during an incident with chemicals his other senses were heightened to the point where he couldn't only still see he states what he sees as a world on fire and so they have different photos of the band were like operated love is like apparatus someone's brain had to go to start making it isn't that but isn't that the fun of the fan series right isn't the",
            "start": 2578.13
        },
        {
            "text": "and so they have different photos of the band were like operated love is like apparatus someone's brain had to go to start making it isn't that but isn't that the fun of the fan series right isn't the fun of saying like let's just see how deep down this rabbit hole I love the the Paul is Dead which is really really old what is this Paul McCartney died in the 70s or whatever accident and that though the Beatles found were identical person Joey's not as he knows it yeah so like they find someone to replace Paul and identical they give him some soft plastic surgery his back is facing the album yeah so like yeah be the infamous Abbey Road cover was the Beatles in their guilt revealing it cuz uh Paul's the corpse so he doesn't have any shoes on and then John I think is like the gravedigger and and like Ringo's the priest-like one of them is Jesus or John guys we're doing way too much drugs to think that way about **** like that Sgt. Pepper's album cover has clues like I love it the Paul is",
            "start": 2616.17
        },
        {
            "text": "and like Ringo's the priest-like one of them is Jesus or John guys we're doing way too much drugs to think that way about **** like that Sgt. Pepper's album cover has clues like I love it the Paul is Dead theories but I love to have the Harley asking all of that on Saturday Night Live like so there's a theory that that you died that was a hoax right he's like yeah yeah I'm not I'm not really dead Chris, you're saying, right? Yeah but those see those are like that's that to me gets out of the range of fan theory and more than just the **** bold-faced conspiracy theory yeah yeah conspiracy theories I think I go a little bit deeper because that gets into people's life like that psychoses The Shining was Stanley Kubrick being guilty over the moon landing that he helped faked it alright that's definitely conspiracy theory right that but I mean that's it and it blows my mind that people are still arguing about that to this day it blows my mind that like people that I follow a guy named Eddie",
            "start": 2676.15
        },
        {
            "text": "conspiracy theory right that but I mean that's it and it blows my mind that people are still arguing about that to this day it blows my mind that like people that I follow a guy named Eddie Bravo and I love him he has done amazing things for the sport of Jiu-Jitsu and and mixed martial arts but he is a **** conspiracy nut and will not shut up about how we faked the moon landing he will not shut up about how we've never been to space and how like I don't think he's a flat earther but he's close to and I'm like I just don't get it like how can you what how much proof do you need right and they have like all this telescopic evidence that like the the all the pictures were faith because they wouldn't have looked like this and you're like dude how do you I don't know I don't know like what causes people to do that my brother's was obsessed with JFK for a couple years I didn't know no sense because he was like eight years old that's one of those that I don't think we'll ever have the",
            "start": 2727.12
        },
        {
            "text": "causes people to do that my brother's was obsessed with JFK for a couple years I didn't know no sense because he was like eight years old that's one of those that I don't think we'll ever have the full story fair right I mean there's there's a lot of evidence there that you're like this weird **** that happened there as far as like at the bullet trajectory and how you know it makes sense that there were multiple shooters and yada yada but can we go man I feel like there's a **** live stream of a dude up in space right now we went to space we're in space I jumped down yeah all the way like my favorite is that when they they'll like make CG that looks really really real and super they were like see it's perfectly real and I'm like, 'Yeah, but no' you could not have done that in the 60s like you couldn't it just wouldn't have they didn't have the technology back then yeah and people swear they did and I'll never know but I also just don't care enough you showed me one that reminds me of",
            "start": 2770.12
        },
        {
            "text": "you couldn't it just wouldn't have they didn't have the technology back then yeah and people swear they did and I'll never know but I also just don't care enough you showed me one that reminds me of another two Pokémon fan theories that I love I was real deep in the Pokémon fan theories you'd be surprised but one of them is that Giovanni is Ash's dad and it like totally makes sense but the more gym leader yeah but the more interesting one is that Pokémon Red and Blue at least take place after a crazy-ass war happened that pretty much every man had to be involved in so they all died and this takes and you there's a bunch of hints like Lieutenant Surge the third gym leader what was a **** soldier in the war and there's like a bunch of hints throughout the game that make it sound like this should happen with Ho-Oh Mewtwo conspiracy and all the stuff on Cinnabar Island and that's why there's so few kids that's why kids are going out as like 10 year olds just **** travel the world",
            "start": 2816.47
        },
        {
            "text": "this should happen with Ho-Oh Mewtwo conspiracy and all the stuff on Cinnabar Island and that's why there's so few kids that's why kids are going out as like 10 year olds just **** travel the world alone and like there's no dads anymore like a mall that is **** moms and kids oh **** really Mars Needs Moms it's super cool dad oh my god I forgot about movie no you didn't forget about Joey no no some of them are oldies this is a new one for me but that there's no way Danny Tanner could be the father Danny Tanner which one was the aunt Danny was the dad couldn't be the father of all the blonde girls just in terms of how genetics work okay passing down eye color etc because the the girl's mother is Jesse Katsopolis his sister Greek whose black hair she's darker features like shorter and you know you think the recessive genes would have made at least one of those kids brunette yeah or the the blonde I mean it's not my theory this is just you know it's your theory now children",
            "start": 2863.45
        },
        {
            "text": "and you know you think the recessive genes would have made at least one of those kids brunette yeah or the the blonde I mean it's not my theory this is just you know it's your theory now children could not have been all blue-eyed yeah this is the theory that so the the what is presented in the theory is that Joey you know Joe Gladstone cut it out he is the actual father if I found out after all these years that Joey was the father my children I would break a bottle and kill every one of the room I'll be honest with you I couldn't handle it I'd be like not less than anyone in life John Stamos you'd rather involve saying no no if I were Bob Saget I was like oh god I would have grabbed the idea of it, you're right I didn't realize that but I still would have rather John Stamos father of my children then **** good I'm sorry yeah maybe next week did you watch it I am halfway done yeah what do you think I do not like it I can understand why you wouldn't I think maybe his comedy is not no",
            "start": 2933.03
        },
        {
            "text": "then **** good I'm sorry yeah maybe next week did you watch it I am halfway done yeah what do you think I do not like it I can understand why you wouldn't I think maybe his comedy is not no it's always been like that that's just Jerry Seinfeld's comedy it's the special I think it's very poorly put did you want that to be the next topic we could talk about that I haven't seen it the next type explicit let's go into the next topic which was going to be Muppets and puppets let's do but we can't I'd love to talk about Seinfeld with you some points watch it maybe next time yeah again it's another one of those Netflix specials that's going to be relevant for a very long time yeah so but I'd like to hear your opinion so at least I want to talk to you about Muppets and puppets then I say banana yes the internet knows one thing about you it's that you love okay so mostly my touchstone for the Muppets not bad right I like his Muppet Babies okay okay so when I was a kid I remember watching The",
            "start": 2979.23
        },
        {
            "text": "yes the internet knows one thing about you it's that you love okay so mostly my touchstone for the Muppets not bad right I like his Muppet Babies okay okay so when I was a kid I remember watching The Muppets I remember watching Sesame Street all those all the Jim Henson studio stuff and not I don't I don't have a lot of like deep memories with the live-action show but when it came to Muppet Babies they had me when they did the Star Wars episode with the closet Kermit Skyhopper I feel like I was - it was I think I want to say Fozzie the Bear was Chewbacca the Wookiee and I can't read the other ones Animal night I'll have to come to me but I just remember thinking wow this is a really really cool well done cartoon and then I go back and look at some of those older episodes of Muppet Babies and the Muppets and I'm like what a **** wildly creative thing why and I remember when when Jason Segel and that team was trying to bring Muppets back and did in fact bring them up it's back to movies",
            "start": 3026.53
        },
        {
            "text": "the Muppets and I'm like what a **** wildly creative thing why and I remember when when Jason Segel and that team was trying to bring Muppets back and did in fact bring them up it's back to movies I just remember being very happy that I'm like I'm glad we live in a world where the Muppets are relevant again because they represent to me one of the height of human creativity you're literally like they just were like you know and it's a weird thing to say because it's a weird thing to think of like these puppets these Muppets is marionettes taking on a life of their own but like you think you they just they're just a very special thing but to me it's the movies it was The Great Muppet Caper and then my wife really loves Muppet Christmas Carol like that we watch that every year oh yeah oh I want to or not we have to watch it as my sister-in-law loves it as well really scared me in that and like, and my wife, my way that was Michael Caine oh yeah oh my god okay I just can't",
            "start": 3089.53
        },
        {
            "text": "oh yeah oh I want to or not we have to watch it as my sister-in-law loves it as well really scared me in that and like, and my wife, my way that was Michael Caine oh yeah oh my god okay I just can't see that now holy **** it's Michael Caine man my wife loves the moment where the rat kisses Gonzo's nose. Brutal. Wrath. And Gonzo's best good holy hair shampoo because of Mean Kevin yep looked so cool because he always had the cool jackets on and that voice Rizzo, you know, he had that kind of New York accent, looking oh **** again well wow what brought this on again are you a huge Muppet fan I I do love the Muppets like I mean I've always been kind of into the Muppets specifically I like other forums like claymation and stop-motion there's just saw something to me always about the Muppets that just maybe just because of how genuine it is and how the comedy was always it was never malicious no in a way and I mean puns especially like the Muppets if you watch the old Muppet Show or even",
            "start": 3140.23
        },
        {
            "text": "that just maybe just because of how genuine it is and how the comedy was always it was never malicious no in a way and I mean puns especially like the Muppets if you watch the old Muppet Show or even Muppets Tonight that's that's all that was too but like yeah I think of them up it's in weird different compartmentalized ways much like you do like when they first you know kind of a were thing it was like SNL nothing so no that's right Jim Henson was making Muppets for that that's right and everyone hated working with Muppets in primetime that was the thought like for a mature audience and and so I don't wanna get into like the whole history because it was like a British show that - let's go too deep but the show this is what the show is all about but the teaching-learning aspect carried the Muppet Show I guess I guess was perceived to fail but it was like a raging success and was supposed to be for a more mature audience but it was weird because it came out with this more like targeted",
            "start": 3198.04
        },
        {
            "text": "Muppets Show I guess I guess was perceived to fail but it was like a raging success and was supposed to be for a more mature audience but it was weird because it came out with this more like targeted toward children feel especially like post Muppets Show and all the movies and that's kind of my relationship with the Muppets it's not as much the mature, like, let's do a late night show sure thing but maybe some of the variety show aspect but more of the like here's a group of characters that they're they there's a certain spirit to them and there's a certain element of heart and sincerity and humor without being malicious humor without being just doom and gloom but the Muppets it's always like how can they leave it how can they reunite how can they save something so fun yeah it's a rainbow song first dance of my wedding that James' idea was to Rainbow Connection and it was he was like it was his idea he's like you should do like Rainbow Connection and I was like no you don't have to",
            "start": 3256.24
        },
        {
            "text": "song first dance of my wedding that James' idea was to Rainbow Connection and it was he was like it was his idea he's like you should do like Rainbow Connection and I was like no you don't have to do that he was pretty sweet but yeah to me the Muppets are just this like beacon and bastion of light and like goodness boy and for me it's it's very nostalgic Rob yeah because that's my childhood but I also I'm get more and more nostalgic the older I get because as everything goes more and more toward really photorealistic CG it's still missing that level of life performance that I think the Muppets nailed right yeah they're puppets but there's also there are tangible things that are really there you're getting the performance directly from the Muppets mouths right which is the performer right underneath them and so there's something special about that and we saw it with The Force Awakens where JJ Abrams purposely wanted to go back to that style of filmmaking because there's just",
            "start": 3312.37
        },
        {
            "text": "right underneath them and so there's something special about that and we saw it with The Force Awakens where JJ Abrams purposely wanted to go back to that style of filmmaking because there's just something that you can connect with even though they're inanimate objects and then we clearly made of cloth because you can tell the texture you connect with that on a level that I just don't think you can ever connect with on CG. That physicality to it it's funny because I even even with Star Wars for I love Star Wars so much but there's something about the look of the the characters and even if it's like the costumes and stuff where it's like there's still something impractical about seeing aliens and their mouths aren't moving when they're talking because they are just these costumes right but then there's something about the Muppets and about any type of puppet Sesame Street in any of that thing any Jim Henson thing where it's like they feel real because they obviously don't look like",
            "start": 3361.45
        },
        {
            "text": "but then there's something about the Muppets and about any type of puppet Sesame Street in any of that thing any Jim Henson thing where it's like they feel real because they obviously don't look like they're perfectly humanoid right whatever it is like they're supposed to be a cloth frog right and it's like watching it it's it's funny because there's not too many examples of like animation in live-action things in the sense of like Space Jam or Who Framed Roger Rabbit or things like that but those movies work so well especially Who Framed Roger Rabbit because the every shot that every animated shot was lit as if it was in real life so yeah felt like you they were the live-action actors were interacting with real thing yeah even though it's a **** cartoon it's obviously fake but there are moments that that that you stop believing that because you're just watching he's like oh I totally buy it and I think that the Muppets has this magic where even from the beginning you don't really look at",
            "start": 3397.54
        },
        {
            "text": "that that that you stop believing that because you're just watching he's like oh I totally buy it and I think that the Muppets has this magic where even from the beginning you don't really look at it and go always talking to a puppet it's like oh that's a character but they're they're actually going back and yeah and there's comedy in the motion it's like if there's layers to it I think that's what's important is that it's not just the mouth is moving and it's lip-synched but it's like just the way the characters like this performance is actual performance and you'd be like if you look into like puppetry and like skill and technique just the way that you can like Kermit's face how you can emote with it in such simple ways make it make him look like he's sad by turning his face down his eyes don't change I think but it's just the the angle like it's almost crunches it away I just like the techniques that Jim Henson was pioneering or crazy getting them to ride bikes and if you go and",
            "start": 3444.01
        },
        {
            "text": "don't change I think but it's just the the angle like it's almost crunches it away I just like the techniques that Jim Henson was pioneering or crazy getting them to ride bikes and if you go and you look I was always worried when you saw Kermit's feet always I was like don't do that anymore that's a lot of feet. You're like, 'What?' Like, 'Shaven?' I'm not like, 'Sure.' Yeah I'm just think it was always off-putting whenever they had to roll anywhere I love it and because that was part of the the endearing quality of it was that they were always like at the bottom half of every frame so they like Steve Martin and Kermit had to be down here yeah yeah so I always get in fights with my friends about the Muppets experience at Disneyland I love it because it's this we're in a play room and then there's like there's a theater screen happens guys going on it's gone I know it's gone but I always loved it because it's like they'd be moving around I'm like this isn't a movie these are real things that are",
            "start": 3484.18
        },
        {
            "text": "there's a theater screen happens guys going on it's gone I know it's gone but I always loved it because it's like they'd be moving around I'm like this isn't a movie these are real things that are happening around me and I believe it it's like who the **** where I don't know what the names are Statler and Waldorf up there like talking **** it's like it does it feels right it's like you can go watch this video of the intended plans they had for doing a Muppets world at Disneyland and it was in the works with Jim Henson's and like Disney before Jim Henson died and then after he died they kind of just lost interest yeah well I think at that point to that it kind of worn off. Like, yeah, they weren't in small parts the blueprints for that what that Muppets land would have been are incredible there's like they're right there was an idea for a restaurant where like an animatronic rats would be bringing new food and they would stage different theatrical events like a kitchen fire where a",
            "start": 3531.73
        },
        {
            "text": "like they're right there was an idea for a restaurant where like an animatronic rats would be bringing new food and they would stage different theatrical events like a kitchen fire where a Swedish Chef would run out and be like and like all this interactive that it was heartbreaking that I don't have the videos but I'm sure if you look like you look up failed Muppets land or something they don't have that theater show anymore it's talking about what they were planning they replace it with Marvel things that to be fair are pretty freaking cool he'll be offended trailers for whatever Marvel movies coming out right be like a 3D experience was like they blew the same thing with the Star Wars or are they not doing that supposing that took over Captain EO what's next on the docket for Muppets is there anything well they just canceled the show right didn't feel like the spirit was there. They just... Frank, and not Frank Oz, but someone's not doing the voice anymore right yeah",
            "start": 3584.53
        },
        {
            "text": "Muppets is there anything well they just canceled the show right didn't feel like spirit was that the brain just they just Frank and not Frank Oz but someone's not doing the voice anymore right yeah Steve Whitmire but yeah I was having a tough time transitioning to the new voice for Miss Piggy because it's no longer Frank Oz right guys he just didn't want to do any more what happened uh no no he may have just yeah I kind of aged it's oh man if you guys want have you seen I Am Big Bird: The Caroll Spinney Story yes Oh wild wow that's a great like if you're looking for something no it's just gonna hit you heartstrings and the way that they they trained their replacements these Muppet ears like decades because like what happened you know Big Bird were supposed to be on the Challenger yeah oh yeah isn't it well it the one that blew up they couldn't see they never never ever this imagine having like it's it's a really weird info he would have just blown up I don't know man yes Unni no there's no rider I",
            "start": 3627.54
        },
        {
            "text": "well it the one that blew up they couldn't see they never never ever this imagine having like it's it's a really weird info he would have just blown up I don't know man yes Unni no there's no rider I got Disneyland like I love to see Lance so much everyone knows that but my favorite thing is they just want to keep the magic up so they make sure that two Mickey Mouses are never in the same place so there can only be one Mickey in any land or whatever yeah and it's just like they're so dedicate to that that yeah magining if Big Bird Falls purple isn't they were like well Caroll Spinney won't be able to do Big Bird and if he's getting old so we're by the way he has to do bigger bird like this yeah yeah so he has to have his hand up like this the entire time just fits the neck yeah and it is it looks like torture it looks terrible there are a lot of like puppets and puppets they use Waldos 4 which is like animatronic or robot controlled hmm but yeah that it's it's this forever so I",
            "start": 3677.74
        },
        {
            "text": "is it looks like torture it looks terrible there are a lot of like puppets and puppets they use Waldos 4 which is like animatronic or robot controlled hmm but yeah that it's it's this forever so I don't think he does it that much anymore I don't know yeah I can't remember that the documentaries Pacifica but yeah it was it's just cool to see that early time that early era as well and like here I'm kind of talking **** about some of the other puppeteers how they were like drug addicts and **** like wow this is intense yeah it's pretty wild but that that is a great document what's it called again I Am Big Bird I am big will you check that up it's definitely just check it out last topic oh this is gonna be a good one and at least this actually is the topic that I asked you to read five times anyway so if you could go into this and shoot out for us that we can cut out and edit the last no we will not do that we're not professional F to have done that Margot Robbie recently revealed",
            "start": 3724.93
        },
        {
            "text": "times anyway so if you could go into this and shoot out for us that we can cut out and edit the last no we will not do that we're not professional F to have done that Margot Robbie recently revealed that in in auditioning for The Wolf of Wall Street for the character of insanely hot woman wife of Leonardo DiCaprio she was a little concerned she was felt a little self-conscious that she was not hot enough to be portraying this role have you guys ever felt not hot enough every day of every day of my life the thing about them that blows my mind is I know this sounds like I'm just a dude Tama how hot a woman is but Margot Robbie in The Wolf of Wall Street that to me is like it was such an like she used to sexuality that I've never seen captured on film the great actress - and it was just mind-blowing where I'm like in that moment she was the hottest person to ever exist and that moment lasted for three hours I wonder if that I wonder if that moment is gonna be like how people that are like",
            "start": 3772.24
        },
        {
            "text": "where I'm like in that moment she was the hottest person to ever exist and that moment lasted for three hours I wonder if that I wonder if that moment is gonna be like how people that are like 4050 years old when they were kids and they had that moment of like the really hot woman on screen Julie Christie in Doctor Zhivago wasn't there a moment where many moments I plenty moments were mice coming-of-age when I realized something like that what you're talking about well yeah like the the crew left maybe were the guys like looking at the girl for the restroom Fast Times that Porky's is it is it Fast Times I talk about when they looked at the girls that were naked through the people no that's sexual assault nobody was looking at a girl through the window and like somebody walks in on on him doing that you gotta gonna warn that that was every 80s movie yeah that happened so much I think a Peppercorn I think dressed up in a suit Jesus Christ what the **** are you talking about I think more news",
            "start": 3826.12
        },
        {
            "text": "you gotta gonna warn that that was every 80s movie yeah that happened so much I think a Peppercorn I think dressed up in a suit Jesus Christ what the **** are you talking about I think more news I think of Porky's when I think of that when it was like the first time I ever saw a woman naked on screen was at my at my next-door neighbor's house we were watching Porky's and it was the scene where they were looking through into the girls showers and the guy puts his tongue through like one of the guys puts his penis through it all the girls got anything guy puts his tongue through and they put soap on it it was a that really shitty like nutty was like like poor soap was not even liquid it was just like grains granular and I just member thinking oh that's disgusting but worth it I think was the first time I ever saw boobs that weren't my mom's oh you're talking about the famous when she was in the in the pool the girl yeah the pools here yes Phoebe Cates who - Phoebe Cates was one of",
            "start": 3879.94
        },
        {
            "text": "the first time I ever saw boobs that weren't my mom's oh you're talking about the famous when she was in the in the pool the girl yeah the pools here yes Phoebe Cates who - Phoebe Cates was one of those human beings that I looked at and I was like yes I am aware that I have a penis now thank you for that kids she was so hot that's it but yes like Margot Robbie though go back to that like sure not thinking she is qualified for that Wendy from it's a hopeful wonder here's would be right you know if not you then who like cuz that that was just unreal but yeah you cover me there's been so many times so many moments where I'm just like man I just goes back to our topic a couple weeks ago about we did a topic at least this might sound like a joke but we were topic art she knows you're cool and we I was the only one of the famous I'm not cool everyone else said that they're cool at least I said I have cool moments I do cool **** I wasn't on the show what a cool thing for cool Tim to say",
            "start": 3915.55
        },
        {
            "text": "we I was the only one of the famous I'm not cool everyone else said that they're cool at least I said I have cool moments I do cool **** I wasn't on the show what a cool thing for cool Tim to say that he's not cool you know he has like 15 different bomber jackets where 14 would be not cool but 15 is actually cool it brings it into the critical area other way to put it bomber jackets are out they've been out for a couple years and that's not gonna give up on you know I like you're not you like them there's other job but ya know it's like I there's so many things that going back to the cool topic where I was just like I wish I looked if I looked hotter I'd be more confident to the poor oh you know I'd be super down for this I think about that all the time when I'm not I'm just not in like a moment that I had and there's a moment I was telling you about and didn't you as well um it was during the Let's Play Reunion this weekend where it's like Tim Gettys a couple years ago the night",
            "start": 3959.23
        },
        {
            "text": "a moment that I had and there's a moment I was telling you about and didn't you as well um it was during the Let's Play Reunion this weekend where it's like Tim Gettys a couple years ago the night we're about to be in front of Ronald a lot of cool people there's a pool you're gonna have to take your shirt off like I would have been horrified but now I hit that point over Mike I'm so fat that I'm like there's not even hope so it's like it's not even like you're a they're not fact we do not in that level I'm not in that level where I'm like oh man he's a little overweight right you know cuz that Ben there's a lot of shame there yeah I hit that point that I'm like it's all shame so just roll with it Tim and it makes you feel so much better selling your head I'm confident I'm saying this in a good way oh yeah like this weekend I just didn't want to ensure at all neither did I yeah I definitely was like I didn't want to crush it off the first day then Barb showed up the second day and I",
            "start": 4017.88
        },
        {
            "text": "a good way oh yeah like this weekend I just didn't want to ensure at all neither did I yeah I definitely was like I didn't want to crush it off the first day then Barb showed up the second day and I was like well I am definitely not taking my shirt off now that's not happening but then I just got to a point I'm like why not who cares nobody **** cares I yeah well my swimsuit and whatever cuz I'm like I'm over 30 woman it's you know I in internet years I'm 47 good 17 years I've kind of gotten to play a place in my life where I'm like I just can't be bothered to be completely like influenced by all this and I also like an influence influencer influenced influencer and I also like made a decision at a young age that I was like oh man I really need to try to be funny cuz I can't wait I can't relax I'm really good trying to hone this yeah yeah you can't only stop yourself having fun because you feel insecure yeah I was wearing a shirt for like 80% of the pool we had a great can of",
            "start": 4057.39
        },
        {
            "text": "I can't relax I'm really good trying to hone this yeah yeah you can't only stop yourself having fun because you feel insecure yeah I was wearing a shirt for like 80% of the pool we had a kind of conversation about I'm not gonna go into detail on it but we had a Kinda Funny conversation about how both of us were like self-conscious about our bodies yeah and I just feel like I had the same thing to my wife has helped me out a lot with this because she loves sitting by pools and I don't mean that and like she's helped me out in a positive way I mean she loves sitting by a pool so at a certain point I'm like I just gotta take my **** shirt off because I can't be that guy that always moves the umbrella over and it like says underneath everybody gets **** hot but eventually I'm just getting my wife's like what you look perfectly fine it's almost in your hair yeah I'm already guy I've already have someone that I might be able to have sex with later no one else gives a **** about it",
            "start": 4110.69
        },
        {
            "text": "my wife's like what you look perfectly fine it's almost in your hair yeah I'm already guy I've already have someone that I might be able to have sex with later no one else gives a **** about it like and that's kind of what it boils down everyone wants to feel attractive right everyone wants to feel it and you don't want to put yourself in a situation that might be ego destroying know the best way to put yourself in a situation that's not ego destroying timing to take your shirt off in a pool you're not confident in front of a bunch of people you think are cool and the internet launch there's 10 000 people watching us right now oh yeah but at the same time that was that was a good testament to me right where I was like I looked at everyone in the pool and I'm like everyone's having fun no but I mean that's the thing what school Tim's at the party yeah I be as nearly as cool so it's kind of a relief it's a yeah nobody's gonna top that bar might not just go for me but sorry I'm not",
            "start": 4153.71
        },
        {
            "text": "no but I mean that's the thing what school Tim's at the party yeah I be as nearly as cool so it's kind of a relief it's a yeah nobody's gonna top that bar might not just go for me but sorry I'm not something like the whole internet years thing or whatever like that makes total sense because like Sugar Pine 7 there and they're all these super successful dudes and girl that are like  3 years old it's like what's the point what's the point of a who cares like I mean that's a perfect example I don't have my fatale is always going to be someone that has something you don't right there's always gonna be someone who's younger or taller or better-looking or has better hair and you can lament on that and be like I'm a **** troll which sometimes I think myself like I **** hate myself right now or you just be like all right now I literally am the best I can be I got to be happy with this and I got to go in vessel I want to get in that pool probably because lots of shenanigans are",
            "start": 4190.94
        },
        {
            "text": "right now or you just be like all right now I literally am the best I can be I got to be happy with this and I got to go in vessel I want to get in that pool probably because lots of shenanigans are happened in that pool probably from like the age of like 14 through  0 I like never wore shorts or skirts always wear pants because I was super self-conscious of how skinny my legs were and then a certain point I was like I'm in the height of summer I'm sweltering because I'm too self-conscious of this I'm like I just need to stop and then looking back I'm like man I was an idiot like why did I just let that get to me like yeah this is another thing I've told in the podcast a bazillion times but like I grew up in San Francisco and all of my friend group was Asian every single person and I felt so self-conscious that I didn't have black hair I felt so self-conscious that I had hair on my body and they did it your hairy man and it was just like it was going to pools and stuff was even that",
            "start": 4233.48
        },
        {
            "text": "so self-conscious that I didn't have black hair I felt so self-conscious that I had hair on my body and they did it your hairy man and it was just like it was going to pools and stuff was even that much more stressful because it's like I had chest hair Oh see it's just like I was different but that made you cool see I was super fat I was super fat when I was a kid so I have a lot of like stretch marks left over from that and that was what I was always very self-conscious about was that people didn't understand that back in the day now you look and like I can't be like everyone has a blemish here or there but but when you're a kid and everyone's growing up in their normal and you and you like I had people make fun of me for it back in the day okay not not knowingly like no they didn't know how deeply that went in my psyche but they were like oh oh this guy looks like he was pregnant he had a kid and I'm like well that's just gonna destroy me for the next three years is more with the",
            "start": 4280.79
        },
        {
            "text": "how deeply that went in my psyche but they were like oh oh this guy looks like he was pregnant he had a kid and I'm like well that's just gonna destroy me for the next three years is more with the Twinkie and I **** lost so that was heaven around us we'll always have someone - well let me not anymore Kevin looks great no no no no you're taking that completely wrong like what I'm saying like I I'm never can make you think it's okay to make fun of Kevin no I'm not saying that I'm saying that I will never be safe because that kid that made fun of you grew up with me Kevin has not grown up yeah worst possible thing to me yeah Kevin that's the possessed that that's the double-edged sword with my count is that he's been with you so much he knows all of your strengths and all of your weaknesses sure and if he wants to bully us he can push that button you know when you get this close bad things happen right make sense that makes sense right up in his face no but I mean I can imagine I",
            "start": 4319.16
        },
        {
            "text": "sure and if he wants to bully us he can push that button you know when you get this close bad things happen right make sense that makes sense right up in his face no but I mean I can imagine I remember I remember distinctly I had one of my uh my buddy's sister who I was like kinda had a crush on as she was on and like you know she was like a senior when we were freshmen so she she was an adult she was like an adult right and I just remember after beach outing and no one had said anything but she just made fun of me she said someone crack about because that we were like joking around with each other she said one crack in it **** destroyed me I mean I bounced back originally cuz I'm a **** G but eventually but I was like wow I like to have all of your fears about yourself yeah I mean just I mean again it wasn't like I had a huge crush on her which is like I found her unbelievably she's she's still hot it's unbelievably attractive but to have her be like yeah I see you for how you",
            "start": 4365.25
        },
        {
            "text": "just I mean again it wasn't like I had a huge crush on her which is like I found her unbelievably she's she's still hot it's unbelievably attractive but to have her be like yeah I see you for how you see yourself I was like wow that's a blow to my confidence but I mean that's again it's like that Loveman well but that was yeah that was difficult I had a lot of lots of those moments growing up yes because I don't think I didn't lose any weight until I was like  5 so that was I had all of my youth like all of my formative years as a teenager early  0s being like overweight just feeling like that about and they didn't want you and now you're hot yeah what's like what's that Kanye I have a message that I would give to people to young people if they are watching and feeling this way if you my message would be don't let the insecurities you have about yourself stop you from having a good time and living your life because you're your you'll regret it later yeah yeah I mean I can't speak",
            "start": 4424.97
        },
        {
            "text": "my message would be don't let the insecurities you have about yourself stop you from having a good time and living your life because you're your you'll regret it later yeah yeah I mean I can't speak specifically to a lot of different things but I can say like if you're if you're self-conscious about your body you just have to get to a point where you go **** it you know and I don't know I don't know how you get that point to everyone it's different but just know that somewhere along the way everyone has something about themselves they don't like necessarily and I've learned enough about a lot of my friends to understand that like you know I don't want I'm not gonna specifically like portray people's confidences but you'd be surprised at how people how self-conscious people are about different things and so just know that and also just know that like the **** that you're being bombarded with every day this perfect body the **** cover of Men's Health magazine the movies and all",
            "start": 4470.59
        },
        {
            "text": "things and so just know that and also just know that like the **** that you're being bombarded with every day this perfect body the **** cover of Men's Health magazine the movies and all this **** where people have makeup that's not theirs one Instagram star that she shows the behind the scenes **** that goes into her yeah we seen her like she's like oh this photo shoot she's like I didn't eat yesterday before I did that she's like oh this one there was a whole crew lighting me yes it was just me lying in a like she went there and she did it and I was like good for you like I think I just see the internet tearing people down so many times and people that I that I now know personally and I see them get criticized and stuff like that yeah but like but back that up right why do people do that right an Internet idiot well no but it's not right cuz I would say that a lot of the reason why people do that is because they are insecure about **** and it's easier to lash out at",
            "start": 4511.87
        },
        {
            "text": "people do that right an Internet idiot well no but it's not right cuz I would say that a lot of the reason why people do that is because they are insecure about **** and it's easier to lash out at someone else than deal with your own insecurities and that that I believe is where 99% of the **** and the internet come from is they're not happy with something that's going on with them and it's easier to tear down someone else than it is to effect real change in your life and that's how it that's happened sorry Anna Rose I think it's that or hey I want this funny snarky tweet that I just made to get a million likes on it or whatever sure was wrong I like it like that's that's the thing too you saw reception with ourselves really like we you know it's self validation toward anger yeah that's the goin out like what do you mention like we're gonna be on camera friend a lot of people on this livestream that definitely hit me and I was like huh man like everybody here so tall like and I've",
            "start": 4557.68
        },
        {
            "text": "the goin out like what do you mention like we're gonna be on camera friend a lot of people on this livestream that definitely hit me and I was like huh man like everybody here so tall like and I've always been a year's go away eventually just hang out with him and Greg big ears I wouldn't I yesterday Greg was like I got **** up teeth and I'm like oh yeah Greg's big this is deep Greg's thing Greg ni GN he used to I mean he would had a big hang-up about it and I was like I have never noticed that before about you but he would he would think about it all the time he would obsess about and I was like that is a weird and you know what it comes from is cuz someone at some level when he was in a sensitive place probably made fun of his teeth in a comment session and he took it to heart and that that kind of got engrained into his psyche and he's had six had Invisalign enough it's like Tim's dicks too big yes affects him all the time you can see it in his chair little Tim little cool - IG",
            "start": 4594.52
        },
        {
            "text": "that kind of got engrained into his psyche and he's had six had Invisalign enough it's like Tim's dicks too big yes affects him all the time you can see it in his chair little Tim little cool - IG IG a nose like you can't wear skinny jeans anymore it's like what's the real story how's that baby the advice I would give and this is some real **** again just speaking for me is it's like it never gets easier like it's not like I hit up like I would consider myself a confident person but it's like again even this weekend it's like I didn't feel good I was like I'm confident and do this it was I still had to like push my sink these five beers so maybe I can feel it a little bit more just like you I don't think it ever gets better no because you have you're still gonna have forever yeah just learn other feelings and like I feel that you need to be able to master understanding the value of the other feelings over don't ya I would say I would say that it gets better from a psychological",
            "start": 4635.98
        },
        {
            "text": "learn other feelings and like I feel that you need to be able to master understanding the value of the other feelings over don't ya I would say I would say that it gets better from a psychological standpoint the more you invest in yourself and the more you believe in yourself and do things that make you happy right because oftentimes in I I look at my early  0s my late teens and I I didn't really do much to better myself and that's where a lot of my self-confidence issues came from it wasn't until I started learning tools like how to work with a camera how - After Effects Premiere like Edie I'm not Premiere Final Cut back man how did I started investing in myself that I started getting a little bit more confident about going like yeah I might not be the tallest guy in the party I might not have Tim's big fat dick but I but like but I have these tools that I that I can start to build off of and build some momentum of my life and then when I hit around like you know when I hit  8",
            "start": 4693.31
        },
        {
            "text": "not have Tim's big fat dick but I but like but I have these tools that I that I can start to build off of and build some momentum of my life and then when I hit around like you know when I hit  8 30 I've met a woman I was like oh I have something to offer you like I have I'm a confident person because I've invested in myself that makes sense but but but you're right on one level that when you like life gives you all these things and then you hit 30 and then it starts slowly thank you those things we're physical physical but my thing is I feel like like you just start shaking it's a fact it's just gonna keep changing and you're always gonna have something you're hung up about and I show that so I was gonna be bad things happening because I remember when I was like what I just said about like now I'm the right color hair having too much hair stupid **** but I look at now I'm like what's a **** that seems stupid but then there's other things like when I was in high school I had a lot",
            "start": 4736.59
        },
        {
            "text": "now I'm the right color hair having too much hair stupid **** but I look at now I'm like what's a **** that seems stupid but then there's other things like when I was in high school I had a lot of acne on my face and I distinctly remember thinking like I still deal with it I would do **** anything to not have this like if a genie came number three would be don't **** yeah number number one would have been like getting rid of the acne just give me clear skin like I would **** do anything and I go look at that now and like my skin is totally fine and I grace believe it cuz it's like looking better like well but it's like now there's total if a genie came and I could not exercise and get thin I would **** do it you know but it's like it's 30 years when I look back there's gonna be some other **** that I would say it's sure just gotta kind of just keep pushing yeah this I'll never forget going into winter ball in 2006 and Alfredo's mom picked us up in her Odyssey Toyota",
            "start": 4773.82
        },
        {
            "text": "be some other **** that I would say it's sure just gotta kind of just keep pushing yeah this I'll never forget going into winter ball in 2006 and Alfredo's mom picked us up in her Odyssey Toyota Odyssey seems like it was amazing tell you that an Odyssey Honda Odyssey and she looking around and she was just there to see entik oh my god you guys are so handsome you secure like Tim you look so good like even with the acne and I was just like it broke me **** broke me and she was trying to be nice like but I was just like you did need to give that Alfredo is man I've been man yeah I've been there I like your dude hmm yeah let's let's let's let's give the audience for address right now this has been a really good podcast check it with Greg Miller became bad guy though whatever the issue was got resolved Kevin apparently decided that it was so intense that he had to go eat a tuna sandwich I assume that whatever it is Tim and Elyse thank you guys allowing me to host delight thank you for",
            "start": 4814.92
        },
        {
            "text": "got resolved Kevin apparently decided that it was so intense that he had to go eat a tuna sandwich I assume that whatever it is Tim and Elyse thank you guys allowing me to host delight thank you for now say it again you're an amazing human being you're a great addition esteem but if you **** leave us for Funhaus I will I will I will smack you in the nose my friend I told people on the Facebook there was some people who were legitimately like it's Andy really and I was like I would never leave unless they like offered me but I would never leave like unless it was like a good opportunity you know well maybe one day they'll learn about your drug addiction ladies gentlemen thank you so much let us know what you thought about all of our comments that come no oh all of our topics in the comments below make sure you like subscribe and share this video if you got a friend named Ryan we all have a friend named Ryan but like hey Nick was talking about you on the podcast Ryan you should",
            "start": 4873.55
        },
        {
            "text": "comments below make sure you like subscribe and share this video if you got a friend named Ryan we all have a friend named Ryan but like hey Nick was talking about you on the podcast Ryan you should totally **** it yeah share this with him it should get him to subscribe to this channel he talked about you at the very very end so watch and watch you live on Patreon stay tuned we're about to do Gamescast with Elyse that's going to be crazy yeah I tell ya we will see you guys when we see you guys see you on the flip side on the C I'm high science thanks for watching The GameOverGreggy Show everybody click here to subscribe to the channel click here to check out our Patreon click here for a playlist of previous episodes and click down here for whatever cool Greg wants to put there I hope it's cool I know it will be",
            "start": 4933.49
        }
    ]
}