{
    "id": 3140,
    "video_id": "9LIIhbvT4KM",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Greg Miller",
        "Mike Howard",
        "Adrian Williams",
        "Mike Doherty"
    ],
    "title": "Sneaking Into Events - The GameOverGreggy Show Ep. 205 (Pt. 3)",
    "description": "Thanks to ProFlowers for sponsoring this episode. Go to https://ProFlowers.com and use promo code: Greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1510128001,
    "duration": 1154,
    "transcript_chunks": [
        {
            "text": "You know what I'm not about fall, it's my favorite season that has my favorite holiday and brings out the best ingredient on Earth, pumpkin. So imagine how happy I was when ProFlowers sponsored us and sent us a fall bouquet bursting with the colors I loved so much this time of year. The flowers are beautiful, they smell great, and I know from experience they're gonna last a long time. Their best-selling Cinnamon Cider Roses are a great option for a birthday, an anniversary, or any fall occasion, or go with one of the more classic ones like 100 Autumn Blooms or a Dozen Autumn Roses. Seriously, stop what you're doing and send it set to your mom or partner, they'll love them. And if you don't have anyone to send them to, let's be crazy this week, look up a nursing home in your area and send them there with a note asking the receptionist to give it to a resident who doesn't get a lot of visitors. I'm gonna do this, I'm gonna send mine to The Cypress at Golden Gate because man, let's be better to each other.",
            "start": 0.0
        },
        {
            "text": "a note asking the receptionist to give it to a resident who doesn't get a lot of visitors. I'm gonna do this, I'm gonna send mine to The Cypress at Golden Gate because man, let's be better to each other. To get 0% off all the bouquets of $9 or more, go to ProFlowers.com and use my code Greggy at checkout. That's ProFlowers.com and my code Greggy. It's know Mike, Mike, what do you got? Alright guys, well I have a fun one sticking with this. I've been reading Bleacher Report, of course, keeping up with my sports news and they had a great article recently about people sneaking into sporting events, entertainment events, anything. So they chronicled three guys' stories. One guy sneaking into Game Seven of the Warriors Cleveland Cavaliers, okay, here in Oakland. Beautiful story, very cool, and made his own media badge, walked right in. Yeah, second guy bought a $4,000 ticket for the Conor McGregor fight, somehow made his way into the front row with LeBron James and stuff. Wow, good for him. Final one was",
            "start": 39.96
        },
        {
            "text": "own media badge, walked right in. Yeah, second guy bought a $4,000 ticket for the Conor McGregor fight, somehow made his way into the front row with LeBron James and stuff. Wow, good for him. Final one was just a guy sneaking into the Yankee Stadium to watch a game. So got me thinking, man, that's so cool, making press passes, acting with confidence like you own the place and walking in. I think I'll be thinking, you know, I've done a couple of those before. So I wanted to ask you guys before I start telling tales, have you snuck into any sporting events or entertainment concerts? Maybe they had a good story from by saying I Love You Man. See that, you, you, you hit the nail on the head with the first part of it where you're saying, come in with confidence. My, yeah, exactly. And that's the, it happens for me all the time at Comic-Con, not so much I guess nowadays, but back in the mid-tier days, right when I was like still wanting to go to every party but not having invites to any of them or whatever, whereas",
            "start": 96.51
        },
        {
            "text": "all the time at Comic-Con, not so much I guess nowadays, but back in the mid-tier days, right when I was like still wanting to go to every party but not having invites to any of them or whatever. Whereas like now I just want to go to bed one of my Comic-Con, but like then it would just be the thing of showing up in like I would always tell people who'd be walking with me, I'm like, cuz it's always somebody new. It like when we first started going to stuff, it would be Tim and Kevin who would **** it up, right? Where they'd be like somebody to ask them a question like, where you go? Were you doing? Like, oh, I find. I'm like, no, no, you say, I'm going to this to do this. I need to go, excuse me. And that's what I do at Comic-Con all the time when event staff tries to stop you or whatever, cuz they're ****, they are not there to meet you. Don't know us to be here. Oh, exactly. I have to do this. It's a money, I have to **** go over here and I'm hosting this panel. That's the other thing to panel doors always like, oh,",
            "start": 146.67
        },
        {
            "text": "not there to meet you, don't know us to be here. Oh, exactly. I have to do this. It's a money, I have to **** go over here and I'm hosting this panel. That's the other thing to panel doors always like, oh, yeah, well, I'm here as media or I'm on this panel or whatever. My gosh, come on in. You know, to me, just say the right thing, you can get in. I don't think I've ever done it where I've never had a ticket or anything. That that's crazy. I give mad props to that. Some mad Photoshop skills. Exactly. A shy don't have. No, I've never done it, but my uncle has. Yeah, so I came here what award show it was. It was might have been like, I don't know, it wasn't like the Emmys or anything, which might have been like the VMAs or something like that. But essentially his plan was he was just gonna look as important as possible and and instead of like trying to sneak through like a side, go through the red carpet. Yeah, and his only plan was he's gonna wear the nicest suit he has, he's gonna look very busy on a cell phone. Yep.",
            "start": 185.07
        },
        {
            "text": "and and instead of like trying to sneak through like a side, go through the red carpet. Yeah, and his only plan was he's gonna wear the nicest suit he has, he's gonna look very busy on a cell phone. Yep. And he's just gonna walk through like he's just doesn't have time for anybody's ****. He's got to be in there and he's just got a lot of **** to do that day. Yeah, any work. Hell yeah. Only other thing that I could think of is I don't know, maybe sneaking into like, oh, the Mall of America. So like when you're underage, you have like a curfew, you just get kicked out. But the Mall of America is so **** big, they don't pay enough security people to like one monitor all of the interests is sure and also to even give a **** if you like run away from him. So like sometimes we'll get caught and then they'll just escort us. We'll just go right back in. Yeah, we'll just start like just paying out the most fun. Would we would play like hide-and-seek with the security guards? They don't know they're playing.",
            "start": 225.64
        },
        {
            "text": "just escort us. We'll just go right back in. Yeah, we'll just start like just paying out the most fun. Would we would play like hide-and-seek with the security guards? They don't know they're playing hiding. Sheckler, we do. So we would go in, we're hiding like Macy's and they'll see us and we'll just run out and then we'll go through like the food court or in the middle of the Mall of America, there's an amusement park and we'll just slide in there and we're lost to the sea because like there's just a much, yeah, yeah, family member. So like work in there. But that's like the only thing I didn't really seeing like a legit security guard. You got to like see like how am I gonna like scope this out like Metal Gear Solid style. I'm not, I'm not down for that ****. Yeah, I'm trying to think. I know I have something similar to this with a bounce to, but it's one of those stories I haven't talked about in years and years in here. So I got to think on it. What are yours? It'll click back on. Let me let me paint.",
            "start": 272.71
        },
        {
            "text": "similar to this with a bounce to, but it's one of those stories I haven't talked about in years and years in here. So I got to think on it. What are yours? It'll click back on. Let me let me paint you a couple pictures here. So you know, growing up in beautiful Lake Tahoe for most my life, we've had one big concert venue that is MontBleu Casino Resort. Shout out to them bringing all those concerts to us. Sponsorship. What they had was a tiered concert venue. So at the beginning of the first couple years, it was mayhem. You'd go wherever tier you want to be popping it, having fun, right? Well, they caught wise and they're like, you know what, the first people who get in, they can have the bottom mosh pit area next to the concert and then we'll go up from there and limit people going in. Well, they started an uproar from us youngsters out there that you can't hold me back from the mosh pit. So we'd always jump over each tier and then you go to the next tier and jump over that railing. You'd be grabbing girls.",
            "start": 309.97
        },
        {
            "text": "from us youngsters out there that you can't hold me back from the mosh pit. So we'd always jump over each tier and then you go to the next tier and jump over that railing. You'd be grabbing girls and dresses like, I got you, babe. And then you throw her on the ground like Jesus. So each time we would jump to tiers and eventually they caught wise to that. So here we are, the biggest night, biggest concert I've ever been to in Lake Tahoe. Bassnectar is set to go womp womp for two nights in a row. We're getting tickets to this event. We're going for it. He looked at me, he's like, Mike, that sounds dope. Let's make it happen. So I buy two tickets off a buddy of mine. We show up night of. Now there's some rumors going on. Oh man, did you hear about that kid with the fake tickets? Or did you borrow any of those fake tickets? One man, did you see his backpack full of money? I'm like, man, I don't know anything about fake tickets. Me and my boy are going in, right? We wait in the line. We meet the security guard there. He",
            "start": 350.14
        },
        {
            "text": "tickets. One man, did you see his backpack full of money? I'm like, man, I don't know anything about fake tickets. Me and my boy are going in, right? We wait in the line. We meet the security guard there. He looks at us without a blink of an eye, how these tickets are fake. You got to go up there. I'm like, God damn it. Food is the biggest gossip. These are for real. So we go up to the ticket office, everything on crackers. Man, this is gonna suck. PJ, I'm sorry I ruined this. He's like, it's all right, Mike. Let's see what they say. We walk up, there's a kid just like Chicks Jr. next to me and next to him is this beautiful blonde woman. And guess who's next to her? Chuck, man, the Iceman Liddell. Okay, he has got this small Asian ticket boy by the neck, yelling, we're getting in this concert, me and my girl and these kids, they're with me. And I will get the Iceman. I'm like, let's do it by the hand. And this guy's now taking us to the backstage. There's Bassnectar word **** in. I'm why it's going down. Chuck Liddell gives.",
            "start": 402.16
        },
        {
            "text": "they're with me and I will get the Iceman. I'm like, let's do it by the hand. And this guy's now taking us to the backstage. There's Bassnectar word **** in. I'm why it's going down. Chuck Liddell gives us one look, he goes, have fun, boys. This one's on me. Wow. We now were out there. We're whomping. We're having a good time. And at the end of the concert, Bassnectar likes to take the big shot of, hey, we're all here. And then he goes down the line. I'm like, I'm about to wha whomp with Bassnectar. Watch this. He comes up, he wanted just to do a high five, not so like Mike fashion. I got him in a headlock just like this. Take a photo of us. He's looking at me like, don't ever do that again, man. I had a long night. I'm like, geez. So we used to abuse poor MontBleu and their security staff and event staff. Shout out to them. And you want to know the full circle thing about it? Yeah, my new boss is the entertainment director of MontBleu. So I would tell him all these toys. He'd be laughing telling me.",
            "start": 450.14
        },
        {
            "text": "staff. Shout out to them. And you want to know the full circle thing about it? Yeah, my new boss is the entertainment director of MontBleu. So I would tell him all these toys. He'd be laughing telling me stories on the opposite side. Oh, it's been great. Yeah, you've lived life. I think I've done it where like I had tickets for WWE or whatever and it would be talked my way a little bit closer. You might I mean, get down there. And I want to say we've gotten into skyboxes for other stuff where we're not supposed to be. And I mean like press kind of past kind of **** where you like there and it's people start looking. I'm not ****. Although I'm not going crazy like that. Yeah, **** meeting Chuck Liddell. Hey, the Iceman saved my day right there. That's awesome. Have you seen him since? Have you talked to who's not seeing the Iceman? If I do, I own my drink. But I do, I will tell you this. They caught the young man with the backpack in the fake tickets in the parking lot for the next night. Nice. You think he made.",
            "start": 508.52
        },
        {
            "text": "not seeing the Iceman. If I do, I own my drink. But I do, I will tell you this. They caught the young man with the backpack in the fake tickets in the parking lot for the next night. Nice. You think he made X amount of dollars, sold all these fake tickets night one? You think he wouldn't show his face there? He is night two, backpack full of cash. This gasps fallen out of the bag of and they got this kid in the headlock. Oh man, it was a great thing to see. Do you still like going to live events? Uh, yes, I do. Yeah, I'm going a lot of events. Yeah, we just did a Last Stand two weeks ago now, Monday Night Raw. We all went to and man, did I not? I like once I'm there, I'm fine. But I am the kind of person that gets ratcheted up. Like we were, I was, we filmed, I filmed the thing for this documentary beforehand. And then it was that, it was one of those where I wasn't lead on this event. You know, I mean, this is what this was a Kevin and Cool Greg joint that I was just like into. And they had been in San Jose all day. They went.",
            "start": 555.83
        },
        {
            "text": "that it was one of those where I wasn't lead on this event. You know, I mean, this is what this was a Kevin and Cool Greg joint that I was just like into. And they had been in San Jose all day. They went down it. They went down at ridiculous hour to get to meet Sasha Banks to get an autograph. And then rather than come back because San Jose is like, you know, 45 to an hour away depending on traffic. They were like, we're gonna stay down here all day and bum around till the show. And I was like, okay. And being a Midwestern boy, I'm like, one Monday Night Raw comes on at 8 o'clock or whatever, whatever. I got plenty of **** time. Wait, is actually see, I'll do all this stuff. But now it's a three hour long show. So it's actually 7 o'clock where we're from. But here, yeah, like finally I had a head of this whole day booked and I was supposed to end it like for for me and Cool Greg finally text is like, all right, man, so tickets are at will-call in your name. It started the doors are at 3:30, pre-shows at 4:30, the.",
            "start": 600.0
        },
        {
            "text": "day booked and I was supposed to end it like for for me and Cool Greg finally text is like, all right, man, so tickets are at will-call in your name. It started the doors are at 3:30, pre-shows at 4:30, the curtains that it starts at 5:00. And I'm like, well, **** dude, I got this thing till at least for like, I'll be there when I could be there. And then it dawned on me and I texted them back and I was like, is my ticket in my name or are all the tickets in my name? He's like, they're all in your name. And so immediately I was like, I guess I did the thing, got on the road. What like as I'm packing up, Nick's like, you okay? I'm **** late. This is happening. They left it all my name. I don't want to let everybody down. And he looks at me, he's like, oh dude, you can totally get San Jose in an hour. And I'm like, dude, it's for one **** thirty right now. It was on a Monday. I'm like, there's no **** way. And I got out and sure enough, I got there so late. And then it's like, where do you park? And you park there and.",
            "start": 642.9
        },
        {
            "text": "it's for one **** thirty right now. It was on a Monday. I'm like, there's no **** way. And I got out and sure enough, I got there so late. And then it's like, where do you park? And you park there and it's not even just that one event, right? Cuz again, once we're inside, it was fun. But it was like when I went with Marty and a whole bunch of people to see Taylor Swift, it was the same thing two of like, all right, we're going to Santa Clara. Give myself so much time. And we got there and we ate some food. And then as we got there, it was the thing, here's good sneaking and story of we're going and we're getting closer. And it's that thing of like, man, this is taking longer. Oh, there's this police holdup thing over here. ****, I'm getting tweets from other people that I know they're there of like, where are you guys? Like, it's on like, there she's not out yet, but like her second opening act seems like they're about to wrap up. And it's like, ****. And as we start getting closer again, I'm just stupid and not.",
            "start": 683.31
        },
        {
            "text": "guys like, it's on like, there she's not out yet, but like her second opening act seems like they're about to wrap up. And it's like, ****. And as we start getting closer again, I'm just stupid and not only do I not drive anymore, it's been years since I was going to Bears games and WWE events and driving. So like as I start pulling up, it's like Lot D or Gold Lot and all this ****. And I was like, ****, I have no parking pass. And there's and I've never, I've never driven the the 49ers Stadium. I've only gone to be a train. And so it's like, we're slow ways away from the front door. And so finally I was like, **** it, whatever, we're late. We have no time. Any, we're gonna get over there. And I'll just, I'll pony up the whatever one fifth. I'm gonna get my head running numbers. 150 for gold, you know, 50, whatever the **** it's gonna be there. I've got like a minivan I've rented with all these people in it. Like we got to get them there. I'm gonna miss Taylor Swift. And I drive up to like as close as I.",
            "start": 723.83
        },
        {
            "text": "whatever the **** it's gonna be there. I've got like a minivan I've rented with all these people in it. Like we got to get them there. I'm gonna miss Taylor Swift. And I drive up to like as close as I can. It's like gold, platinum, premium, whatever this way. I'm like, all right, I take the left. And there's lady. I'm like, where do I pay? She like, just keep going. You'll run into it. So we're driving, driving, driving, winding, winding, winding. And we finally come down. There's the security tent here. And the dudes and I pull up and the guy comes over and he's just like, hey. And we're like, hey, like, sorry, we know we're here for the thing. And I'll pay you what? And he's like, how did you get here? And I'm like, oh, well, you know, we drove. And the lady said, and I'm like, why? He's like, you're technically not supposed to be able to get here. He's like, this isn't like a parking lot anymore. This is like, we're all security and event staff parking ****. And I was like, oh. And I'm like, he's like, full-on. He don't know he's a.",
            "start": 763.28
        },
        {
            "text": "able to get here. He's like, this isn't like a parking lot anymore. This is like, we're all security and event staff parking ****. And I was like, oh. And I'm like, he's like, full-on. He don't know he's a cop, but he he had a badge of some kind and like a hat and like whatever here. Exactly. Maybe he was like top-notch security. And he was just and I'm like, wow, like, I don't suppose you just look the other way and let me park here. And he's like, well, I mean, I don't run the parking lot. So technically. And I was like, thanks for doing this. Swung it is hard when it came out. Never had to pay a dime. Was right up there and did it. Literally got there and got to our seats as she started. However, because I was late, didn't get to the merge booth. Always regret that. I always regret that. Similar the WWE thing. Didn't I know I **** up. And this is the problem now. I find myself and I I went to this Michelle Branch concert. You know, realization of a dream going to see Michelle Branch. Terrible venue. **** way too.",
            "start": 803.57
        },
        {
            "text": "I know I **** up. And this is the problem now. I find myself and I I went to this Michelle Branch concert. You know, realization of a dream going to see Michelle Branch. Terrible venue. **** way too crowded and hot. Awful. I don't want to get there four hours before he **** Michelle Branch. I also had seen Vanessa Carlton with Gia and Tim Harris months before. That was lovely event. There weren't many people there. I got to sit. It was great. But now it's just something and I'm like, am I over live events? Do I not want to go to events because I just want to deal with any of the **** anymore? Yeah, I haven't liked a live instance birth. I hate people, just crowds. Like I'm really into person. That was the biggest shock coming to the Bay Area. It's not that crowded, right? Yeah. And first Bart experience, I'm like, the walls are closing in. Oh, I'm like chest to chest with people. Like I'm a real intimate. And I'm like, yeah, come on, Bart. Oh man, any type of event and SF has events **** every like three days or just.",
            "start": 842.55
        },
        {
            "text": "the walls are closing in. Oh, I'm like chest to chest with people. Like I'm a real intimate. And I'm like, yeah, come on, Bart. Oh man, any type of event and SF has events **** every like three days or just in the Bay Area in general. So I just going back and forth, Bart just sucks actually. Yeah, there's no solution, right? Because someone who rode Muni for so much immunity's. I was just like, why isn't everything underground? Because I've been on the Muni where it pulls up and just stops and lays on the horn because there's a car double park. Yeah, yeah, this is like, oh, it's an elevated rail system is great stuff. Let's San Francisco's transportation is terrible. No ****. See, yes and no is the thing, right? Where I feel like, yeah, it's bad because we use all and we know how much it sucks. But it's like for 90% of the country, it's better than anything anybody else has, which is weird, right? Like doing me wrong, New York kicks the **** out of it. The subways great. But it's that thing of like in Chicago, like the L.",
            "start": 887.61
        },
        {
            "text": "of the country, it's better than anything anybody else has, which is weird, right? Like doing me wrong, New York kicks the **** out of it. The subways great. But it's that thing of like in Chicago, like the L, like that's not that's not a great solution either. I would prefer that L over anything related to Bay Area Transit. Sure, it's all ****, just sucks. So like I guess I was reading like NASA, they were like NASA engineers that design Bart. So there are no redundancies except for like a couple. And so I for the like if there's a failure than when you just gotta shut **** down. Yeah, and so like, you know, last week, I think there was a dog on the track and it was a system-wide delay. Yeah, well, I guess I'll work from home today. Yeah, like it's just they should be embarrassed. I agree that 100%. No, just a hundred percent. They should be better. It's **** garbage. No, I agree. The fact that doesn't run 24 hours. Yeah, also still shutting down at 1:05. Track felt bad the other day walking through my.",
            "start": 938.25
        },
        {
            "text": "just a hundred percent. They should be better. It's **** garbage. No, I agree. The fact that doesn't run 24 hours. Yeah, also still shutting down at 1:05. Track felt bad the other day walking through my neighborhood. Homeless gentleman did it. No, no thanks. I'm fine. Cuz I mean like I'm I don't mean to be desensitized whatever, but you know, you homeless people in San Francisco and usually they're kind of aggressive and just like whatever. Yeah, like what followed. Yeah, I'm like, no, I think I've talked about this on one of the shows recently or whatever at Last Stand where a couple a while ago now though the homeless guy went up to right on me or whatever where I was walking. He's stumbling. He was way too close to his woman coming at me. And I was just coming down the corner of the corner shop. And I like, I must have given him like a real like, hey, don't be like that ever. And he kind of got with he just went like this up to me. And I was like, yes, I know Gor that guy through the **** stand upside for.",
            "start": 983.78
        },
        {
            "text": "I must have given him like a real like, hey, don't be like that ever. And he kind of got with he just went like this up to me. And I was like, yes, I know Gor that guy through the **** stand upside for Pacis like get up just go all ****. God, I'm like, no, I'm fine. And he goes, no, what time is that? The the owl run. Oh my God, I'm sorry. I think it runs a little too in the morning. Whatever. Because it was like, yeah, at the end turns into the owl. And I don't know. Yeah, sometimes just like, do you like Whole Foods? They have like weird like dingy looking, you know, for sure, sure. I was like, do you work here or are you just crazy? He was crazy. Okay. Matt Jones on the two days ago just being followed by security or like he's hostile. Call the cops. I was like, okay. Yeah, he doesn't work. You just barking at people. Yeah, yeah, that's like digging into the earth. Yeah, sure. Yeah, there's a lot of schizophrenia that's escapes reform. I mean, that's the problem with the homeless problem, right? Is that it's not you're not.",
            "start": 1024.49
        },
        {
            "text": "we're not talking about people who are like, yeah, I'm down. Oh my, it's a, hey, I have a real mental illness and I cannot. That's not how this works in this country. So we we can't put you in jail and we can't put you in the hospital. So you live in Golden Gate Park. Great. Awesome. Stab you to the bushes. Exactly. That's a really intense e true story about the suburbs of I think I don't want to dime out Glen Ellyn, my hometown or whatever. And I think it was, but I can't be sure. I'm pretty sure it was meant that like one one or two homeless people would come around Glen Ellyn. I mean, it was a suburb of Chicago. I don't I don't want to dime out the good people for Glen Ellyn PD. But I remember hearing this story as a kid that the cops would come and get them and put them in and then just drive them across the.",
            "start": 1078.73
        },
        {
            "text": "I don't I don't want to dime out the good people for Glen Ellyn PD but I remember hearing this story as a kid that the cops would come and get them and put them in and then just drive them across the town line a lot of things to fix in this country you do let's fix it on this one our path my topic thanks for watching everybody click here to subscribe click here to see a playlist to other videos click here to go to our Patreon page and click here to go to the vortex of darkness I don't know what it is",
            "start": 1119.51
        }
    ]
}