{
    "id": 3148,
    "video_id": "AyRwF5CFSCY",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "Battlefront 2 vs. the Internet - Kinda Funny Games Daily 11.13.17",
    "description": "UPDATE!! EA is lowering the cost of  characters: https://www.ea.com/games/starwars/battlefront/battlefront-2/news/swbfii-changes-launch?utm_campaign=swbf2_hd_ww_ic_soco_twt_swbfii-launchchangesblog-tw&utm_source=twitter&utm_medium=social&cid=41287&ts=1510608729384\n\nTim and Greg recap all the microtransaction happenings from the weekend.\n\n00:00:30 - Housekeeping\nExtra Life topped last year! Thanks, IP and OK Beast!\nThe Roper Report   -\n00:03:35 - EA Chimes in on Battlefront II MicroTransactions and Internet explodes, via Reddit\n00:26:00 - Xbox One X Overwatch Coming, via windows central\n00:30:28 - The official list of upcoming games\n Reader mail   -\n00:33:35 - November 13th is your 100th show! Congratulations - Kenny Belou\n00:36:35 - What are your thoughts on games creating timed content that can be accessed only for a limited time? - DocDoomII\n00:39:25 - What couldn't Lego worlds capture that makes Minecraft so great?  - themendoz\n00:43:10 - The overall negativity regarding seemingly everything in the games industry - Drew\n00:50:30 - Squad Up - Gus PS4:Razorblood09\n00:51:05 - You‘re Wrong\nTomorrow’s host: Andrea and Gary Whitta!\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1510609612,
    "duration": 3464,
    "transcript_chunks": [
        {
            "text": "What's up everybody, welcome to Kinda Funny Games Daily for Monday, November 13, 2017. I'm one of your hosts, Greg Miller, alongside the peer one, Tim Gettys. Let's him host. Let me tell you something, I'm telling you, Greg, it's been, you know, it's been a crazy few days for me. It has shot off to Maryland, did Extra Life there with the Irrational Passions. Thank you all, of course, for watching the Irrational Passions stream, but thank you, the Irrational Passions kids, for stream of four hours. Thank you, the OK Beast crew, for streaming for seven, I think it was, hours, maybe eight. Right now, Team Kinda Funny on Extra Life has raised about $85,000. Holy crap, putting us within spitting distance of the year's goal of $110,000, which means I'm gonna probably have to stream some more at some point. I think we're so close now. I know I gotta cry, I gotta just push it a little bit. Yeah, yeah. Anyways, I've been frazzled with that. Mm-hmm. I got a new iPhone coming today for you. Love that one, Greg. Jen and I are trying to",
            "start": 1.94
        },
        {
            "text": "now. I know I gotta cry, I gotta just push it a little bit. Yeah, yeah. Anyways, I've been frazzled with that. Mm-hmm. I got a new iPhone coming today for you. Love that one, Greg. Jen and I are trying to set up our own Slack, which has been a whole nightmare of trying to log in to talk to cross-platform, talk easier, because I don't have a Mac, because everyone here hates Macs. So we iMessage all day, but then I put the phone down and then it's a pain in the ass when I'm working. Do it. But if I have it all on one screen, no problem. You walked in, I was trying to get Kinda Funny Games Daily ready. Turns out everyone got mad about Battlefront again while I was gone. There's so many things happening. We'll talk about here on the show, but I meant to point out, you look really good. Oh, you walked in in your black. Thank you. Your beard's coming back. My beard is back, boys. Yeah, yeah. I'm very excited about that. I've looked in the mirror, I think it was yesterday morning, and I was like, I had this moment of like, yeah, if you",
            "start": 49.11
        },
        {
            "text": "you, your beard's coming back. My beard is back, boys. Yeah, yeah. I'm very excited about that. I've looked in the mirror, I think it was yesterday morning, and I was like, I had this moment of like, yeah, if you didn't know, gentlemen, this is Kinda Funny Games Daily, each and every week, down a variety of platforms. We run you through the nerdy news you need to know about. I like that. I'd like what you're doing over there. You know what, you're remodeling at first, but I figured I do it every episode. Do you? Yeah, I don't ever see you doing this. I do. I usually just try to keep, I try not to distract. You got me this time, so you **** it up. But no, I didn't turn fast enough. Anyway, I wore my Danny O'Dwyer shirt because I just saw Danny. We're sorry. Today we are very green. Friday platforms, we run you through the nerdy video game news you need to know about before giving you some perspective. I can't talk something up for 40 million hours, some perspective, answering your questions, reading you bad PSN names,",
            "start": 93.93
        },
        {
            "text": "the nerdy video game news you need to know about before giving you some perspective. I can't talk something up for 40 million hours, some perspective, answering your questions, reading you bad PSN names, hanging out with you, the Best Friends. If you like that, you can watch live on Twitch.tv/KindaFunnyGames. But the only way to contribute to the show is by going to KindaFunny.com/KFGD. Give me your bad PSN names, people you need to play games with, but most importantly, your questions about the day's news, like so many of you did today. Of course, if you are watching live, we need you to correct us. Go to KindaFunny.com/You'reWrong while we're broadcasting. Tell us what we screw up as we screw it up so that at the end of the show we can read it, set the record straight for everybody watching later on YouTube.com/KindaFunnyGames and podcast services around the globe. No matter where you get the show, thank you so much for enjoying it, watching it, sharing with your friends, and",
            "start": 132.48
        },
        {
            "text": "later on YouTube.com/KindaFunnyGames and podcast services around the globe. No matter where you get the show, thank you so much for enjoying it, watching it, sharing with your friends. And you enjoy what we're doing at Kinda Funny, head over to Patreon.com/KindaFunnyGames, kick us a buck. It really, really helps. For now, let's begin the show with what is and forever will be the Roper Report. There are two items on the Roper Report. Doesn't know why I also you say that, Kev. Item number one stretches on. I saw that. Three, three pages. So it's gonna be strapping that we've done well. I feel we've done well with the moratorium on the microtransaction loot crate. It wasn't, there was a couple weeks there, whereas every show with, hey, this is what's happening here, somebody else adding this in. What are we gonna do? Pandemonium, pandemonium. We did fine. Of course, corrected. Mm-hmm. Gary Whitta set a few things on fire since then. But while I was gone, while do we can hit Battlefront II exploded. Yeah, just out on",
            "start": 172.14
        },
        {
            "text": "do pandemonium, pandemonium. We did fine. Of course, corrected. Mm-hmm. Gary Whitta set a few things on fire since then. But while I was gone, while do we can hit Battlefront II exploded. Yeah, just out on the landing pad. I'll start you from the top. All right. So this is gonna come from multiple sources. We're talking about Star Wars Battlefront II, of course, out tomorrow. First off, there was a post over on Reddit. Someone put up, basically, over there, it started breaking down how long it would actually take to unlock all these things if you didn't pay any money. It's a very detailed thread. It has spreadsheets and all sorts of stuff. I'm gonna kick it over to Kotaku, who explains, by some estimates, the likes of Luke Skywalker and Darth Vader could take close to 40 hours each to unlock for the player intent on not spending any money on microtransactions. Heroes cost credits in Battlefront II, with the average multiplayer game currently netting people somewhere between 50 and 350 for 10 to 15",
            "start": 222.93
        },
        {
            "text": "intent on not spending any money on microtransactions. Heroes cost credits in Battlefront II, with the average multiplayer game currently netting people somewhere between 50 and 350 for 10 to 15 minutes of play. The road to buying all of them appears like will be a long one. Luke and Vader are two examples of the most expensive heroes at 60,000 credits each, but even heroes like Leia and Chewbacca still cost 40,000. Here are some calculations one user on Reddit came up with: The average Galactic Assault match length is 11 minutes, 9 seconds. Average credit per match is 75. Average credits per minute of gameplay is 25.04. Our gameplay minutes required to earn a Trooper Crate, 4,000. That comes down to, I'm sorry, that so it's 4,000 is how much you need to get a Trooper Crate. It's to get it in minutes wise, 159.73 minutes. Gameplay minutes required to unlock one hero, 395.97. So a lot is what",
            "start": 264.39
        },
        {
            "text": "you need to get a Trooper Crate. It's to get it in minutes wise, 159.73 minutes. Gameplay minutes required to unlock one hero, 395.97. So a lot is what they're saying there's, if you don't want to spend a dime, right, this is gonna take you forever is what they go. The Kotaku article goes on, talks about that there are, there are challenges in the game that can help players accrue credits more quickly, but these are limited. Once someone has finished them and cleared out any of the remaining milestones, the only credits coming in on a per match, the only other credits coming in are per match basis. Of course, daily crates can occasionally give you credits, but any Star Card duplicates will be broken down into currency as well. But neither of these is gonna significantly change your finances. That's the Kotaku summary. Good job as always. Over on Reddit, though, this is popping off, exploded on the Star Wars subreddit, to which EA's community team responds,",
            "start": 309.39
        },
        {
            "text": "significantly change your finances. That's the Kotaku summary. Good job as always. Over on Reddit, though, this is popping off, exploded on the Star Wars subreddit, to which EA's community team responds, 'The intent is to provide players with a sense of pride and accomplishment for unlocking different heroes. As for cost, we selected initial values based upon data from the open beta and other adjustments made to milestone rewards before launch. Among other things, we're looking at average per player credit earn rates on a daily basis, and we'll be making consistent adjustments to ensure that players have challenges that are compelling, rewarding, and of course, attainable via gameplay. We appreciate the candid feedback and the passion the community has put forth around the current topics here on Reddit, our forums, and across numerous social media outlets. Our team will continue to make changes and monitor community feedback and update everyone as soon as they can.' Yes, we can. Oh,",
            "start": 349.98
        },
        {
            "text": "topics here on Reddit, our forums, and across numerous social media outlets. Our team will continue to make changes and monitor community feedback and update everyone as soon as they can.' Yes, we can. Oh, what a nice, cool statement. Currently, it's the most downvoted Reddit comment of all time, by all 390,000, not murdered. I was like, 390,000 points on Reddit. Oh, this then led to people giving death threats to the people on Twitter who make the game, and the usual ugly side of the internet you get expected to see. Now, well, I want, we're gonna tackle all this, because again, in terms of who wrote in to KindaFunny.com/KFGD today, a whole bunch of you did. And I would say 90% was all about, what do you think about Battlefront? If you give your perspective, which we'll get to in a second. Though, however, what I found interesting is that Tim, you and I, mm-hmm, you and Andrea, and I mean, Gary Whitta, we talk in the show all the time about the loot boxes, the microtransactions. Gary Whitta,",
            "start": 394.83
        },
        {
            "text": "in a second. Though, however, what I found interesting is that Tim, you and I, mm-hmm, you and Andrea, and I mean, Gary Whitta, we talk in the show all the time about the loot boxes, the microtransactions. Gary Whitta, you know, defeatedly said, 'We've lost the war on microtransactions' last week. What I'm getting interested in, of course, with the accessibility of social media, how our industry is tied into everything happening, the people now popping off online about this and giving their perspective. I'm gonna kick it over to Guerrilla Senior Producer Sam Sharma on Twitter. All right. I followed him for a while, of course, talking about Horizon Zero Dawn. But he put up a thread all about not this in terms of Star Wars Battlefront II, but about microtransactions from a developer side, which I find very interesting. Let's go. 'There is a lot of very passionate discussion this week on the various sides of the microtransactions and loot box debate. Far be it for me to tell you how you should perceive the developments, but I",
            "start": 439.28
        },
        {
            "text": "wanted to add some facts which a lot of journalists are getting wrong. Simply put, publishers do not put microtransactions in any game. Easy. Publishers will give a budget and a profitability target and guide towards best practices based on their existing portfolio slash market conditions. Tough. Publishers will urge proven mechanics to minimize risk. In all cases, the development leadership decides the best way to maximize profitability for games. In extreme cases, there is a pub mandate to put in mechanics to ensure max profitability, but the way the mechanics work and the specifics, parentheses, drop rate, pricing, are all developer led. I wonder one argue as to specific mechanics and whether they are a good practice or not, but please know that development is complex and a publisher does not simply put",
            "start": 482.42
        },
        {
            "text": "pricing are all developer led. I wonder one argue as to specific mechanics and whether they are a good practice or not, but please know that development is complex and a publisher does not simply put microtransactions in any video game, parentheses, with exceptions, obviously. I also don't intend to shut down discussion as it is very interesting to read differing perspectives and learn. I am always here to learn more. And various perspectives on a complex issue help me grow as a developer. Also, also, I work for a lovely company and an amazing publisher, and these views are not endorsed by them or anyone here. I'm sorry, anyone there. So please subscribe all blame towards me.' Interesting take from a developer side, right? Yeah. Then us video game industry analyst for the NPD Group, Matt Piscatella, on Twitter, chimes in, 'Some of the most aggressive marketing ideas I've ever heard have come from devs, while some of the most adamant pushback on marketing, I'm sorry, microtransactions, actually, MTX. I'm getting confused.",
            "start": 527.78
        },
        {
            "text": "chimes in, 'Some of the most aggressive marketing ideas I've ever heard have come from devs, while some of the most adamant pushback on marketing, I'm sorry, microtransactions, actually, MTX. I'm getting confused and Tenex, you know what, just ****, you know, just right. I don't get Seward's drape saying them. Let's start again. Microtransactions. All right. Actually, Kev, cut. Let's start the show now. I'm **** around.' 'Some of the most aggressive microtransaction ideas I've ever seen have come from devs, while some of the most adamant pushbacks, push back on microtransactions I've seen has come from people at publishers. This idea of the big bad publisher and victim dev is in my experience a myth,' which I found super interesting. Yeah, it's ****. Let's throw the blame everywhere. Well, it's, it's, it's fascinating to see Sam Sharma coming out and then Matt Piscatella coming out and being like, 'I love this.' I feel like so many times as pundits, industry, yeah, exactly, we're out there in the dark. And it is always refreshing when I get a",
            "start": 572.12
        },
        {
            "text": "see Sam Sharma coming out and then Matt Piscatella coming out and being like, 'I love this.' I feel like so many times as pundits, industry, yeah, exactly, we're out there in the dark. And it is always refreshing when I get a text from someone on the development side or on the publisher side, he's like, 'Oh man, you guys really nailed this.' But it's always disheartening when I'm out at for drinks and something's like, 'Man, you guys don't know how this really works.' It's like, **** yeah. And this is a great thing of like, hey, let's pull the curtain back in a very public way and talk about the fact that they're now, granted, they're not saying what they don't know what's going on internally at DICE and how this is all worked out and blah, blah, blah. But it is interesting to say that this isn't always the case and it sounds like isn't most of the time the case that it's a publisher saying like, hey, we're gonna **** milk every dime we can. And that is something that we and other, well, we and then journalists out there, I didn't",
            "start": 616.82
        },
        {
            "text": "isn't most of the time the case that it's a publisher saying like, 'Hey, we're gonna **** milk every dime we can.' And that is something that we and other, well, we and then journalists out there, I didn't mean the octuple, have constantly pushed the idea of the publishers are the ones enforcing all this stuff and coming in and the developers are the, the victims there. So yeah, it's interesting. I, I will say that I love the transparency and I think that it's important. It is a good step. And at least there, at least there is another side being stood up for, because otherwise it's just publishers getting shat on and, you know, yeah, and Activision, there's pure evil and that's just all that people know. But the problem I have with it is at the end of the day, this is just putting blame somewhere else. This is just trying to push it off. There's so much negativity around this right now that no one wants it on their hands. And I totally get that. But it's interesting then put it on the developers. Yeah. So what is",
            "start": 661.28
        },
        {
            "text": "trying to push it off. There's so much negativity around this right now that no one wants it on their hands. And I totally get that. But it's interesting then put it on the developers. Yeah. So what is your read then, now dialing it back specifically this conversation about Battlefront II and 40 hours to unlock Vader or Luke? So I think then, just like we've said a million times in the countless days and days and days of us talking about microtransactions, I think that there was a right way to handle them, there's a wrong way. I think that every game, there's, it's context sensitive. And this is a perfect example of this sounds like the wrong way. Yeah. Will they change this? I have a feeling they're going to have to. Yeah. And it is a ever-evolving thing where it's cause and effect and people give feedback and then they have to respond to it somehow. And I think that these numbers are egregious. These numbers are insane. And it doesn't work. I don't think that people are gonna like that. They obviously",
            "start": 700.25
        },
        {
            "text": "and then they have to respond to it somehow. And I think that these numbers are egregious. These numbers are insane. And it doesn't work. I don't think that people are gonna like that. They obviously know they do not like it. But it's good like that. It's, we always talk about, oh, it's easy to talk **** about a, about microtransactions or about how a game monetizes when we're not part of the community, sure, or not that people actively playing. But I think that this is the type of thing where you can look at and even if you aren't going to play it, it's easy to be like, well, that is just wrong. Now, here's an interesting wrinkle to this. Wrinkle me up, Greg. Jeff Clark writes into KindaFunny.com/KFGD and says, 'I like the fact that we have to earn our heroes. Supposedly, it takes around 40 hours to unlock a character, which is not a huge amount of time in the world of online multiplayer. The biggest problem for me with Battlefront I was that I had nothing to work towards. They",
            "start": 744.62
        },
        {
            "text": "around 40 hours to unlock a character, which is not a huge amount of time in the world of online multiplayer. The biggest problem for me with Battlefront I was that I had nothing to work towards. They are giving me something to earn and, quote unquote, show off. Something that says, 'Hey, I put the hours in. I put the hours in to get this because I love this game. Keep up the great work. Love you.' That is very true. But I think back to Halo 3. Yeah. And I remember the, you haven't, you have your custom armor or whatever, the Samurai helmet. If you saw someone run around the Hayabusa helmet, you're like, 'Holy ****, that guy's good. That guy hit level 50 or whatever it was.' Did you had to do, that guy loves this game, put the time in to get that. That's **** awesome cosmetic. Yeah. That to me is the difference. It's, I totally get what you're saying about wanting to work to unlock things, but in an online game that is going to live or die based on being these heroes where it does give you a huge advantage, I think that",
            "start": 785.21
        },
        {
            "text": "I totally get what you're saying about wanting to work to unlock things, but in an online game that is going to live or die based on being these heroes where it does give you a huge advantage, I think that there's a difference there. Well, here's the, you know, here's the wrinkle that I don't have the answer to, and I don't know if you do either, but it's 'cause I've been on the road, obviously, and I've, for me, with Battlefront II, it's literally been like, I just gave me the game on it's, don't let me see, let me, but the product speak for itself. To unlock Vader, unlock Luke, whatever. 40,000. You're gonna have a hero no matter what when you start. I just assume it's not one you're watching, right? It'll be like Boba Fett or, yeah, it's one, it's, you still have that thing. I mean, cool. Vader and Luke are cooler, objectively, you'd say, than Boba Fett, who of course is a huge **** and went out like a **** and didn't know any cool movies. I doesn't make any sense why he likes him. I digress, though. He looks cool. Okay, apologies.",
            "start": 831.01
        },
        {
            "text": "say then Boba Fett, who of course is a huge **** and went out like a **** and didn't know any cool movies. I doesn't make any sense why he likes him. I digress, though. He looks cool. Okay, apologies. That make sense. I thought he looked like a, you know, not a shape guy, just sitting there with a gun, didn't really do anything. I thought he looked cool, of course, in the Prequels, when we found out really he was just an unprogrammed clone. And I still don't know what his medical rank. I'm just a stop trolling directors. Oh, I think it's still not cosmetic. He's cooler. I'm sure Darth's powers are a bit better. But I also don't know if this, here's what's really confusing for me in this argument, right, is taking away the what we've just talked about from the two analysts or two industry insiders, right, talking about how maybe this is on the dev, not the publisher. I wonder if we didn't already have the kerfuffle over loot boxes and microtransactions and everything, if the well wasn't already tainted, at least on",
            "start": 873.14
        },
        {
            "text": "how maybe this is on the dev, not the publisher. I wonder if we didn't already have the kerfuffle over loot boxes and microtransactions and everything, if the well wasn't already tainted, at least on Star Wars Battlefront II, if we would have sat there and said, maybe this is to what Jeff is saying, just a course correction way too far the other way. 'Cause you stick with me, what this sounds like to me is a lot of my complaints with Friday the 13th, right, where it's like, your trophy list is stupid. Who the hell is gonna play that much? Easy to get the 1,300 kills or whatever the hell it is. But then it is that thing is, I continued to play Friday the 13th week after week, I'm slowly doing that damage to it. Could it be possible that when DICE was designing these multiplayer awards, they weren't thinking of it from the skin of rubbing **** money? They were thinking of us, we want, we heard people like Jeff who said in Battlefront I, they ran out of stuff to do. Let's give them some giant carrot at the end",
            "start": 918.32
        },
        {
            "text": "it from the skin of rubbing **** money. They were thinking of us, we want, we heard people like Jeff who said in Battlefront I, they ran out of stuff to do. Let's give them some giant carrot at the end of stick so that one that you do see Vader on the battlefield, yeah, you do go, 'Holy ****, this guy's played a lot.' 'Cause even if you, and again, not having the game, not being in it, I'm not sure how much, how you go about buying the credits that you can apply to this. But I would still, my first reaction be, 'Man, this guy really loves his game, has played a lot of.' He's Vader. Nothing to do that with Vader and Luke, though. I think that's, I know you guys, all right, that's what I'm, that with the Friday the 13th thing is like, cool, getting the trophy, sure, that's definitely a, that the trophy is equal to cosmetics in my, in my mind. Okay. It's bragging rights. It's a thing that people see and like, 'Oh ****, this guy, I **** did this.' But Luke and Vader, you, you should not put characters like that behind such ridiculous paywalls. Do a",
            "start": 965.87
        },
        {
            "text": "it's bragging rights. It's a thing that people see and like, 'Oh ****, this guy, I **** did this.' But Luke and Vader, you, you should not put characters like that behind such ridiculous paywalls. Do a cool other, whether it's time or what, something like that. Exactly. I mean, I'm sorry, I have to bring him back to the, oh man, the online game I'm ****, you know, thousands of hours into nowadays. But like, I, there's a, there's a Jason I'm still striving to level 40, whatever, to get. But I still have a million other Jasons. So it's, but if I see that Jason on a map, I'm like, 'Oh ****, this guy's played a lot of this game.' Vader without his mask on, something like that. It's like, cool, totally. Am I on that? Put it behind it ridiculous. Like, you have to play a bazillion hours to get this, whatever. Yeah. **** Darth Vader and Luke Skywalker, people that are shown in so much marketing, yeah, material for the game. I don't know, that's where it gets you. Now, to come back to the conversation, I'm right there with, though, I know",
            "start": 1003.55
        },
        {
            "text": "is that I wonder where DICE's not all allegiances lie, but if it was more of just a course correction. But I'm even as a casual Star Wars fan, Luke and Vader were super early unlocks in Battlefront I. I remember playing as them, and I didn't, I mean, I played, me and Kev played a fair share of hours, but it wasn't like we were like, yeah, every day doing the work. Will Williams, over the weekend, one of the writers of Star Wars Battlefront II, and I thought some of the things he was saying were interesting. I think this was before, or at least it was like, it wasn't the, the worst part of this whole Reddit storm. Yeah, he was saying, 'Hating microtransactions is tired. What's wired?' It's a weird way to say this. 'Recognizing that a project-based industry attempting to maintain a'",
            "start": 1043.9
        },
        {
            "text": "worst part of this whole Reddit storm yeah he was saying hating microtransactions is tired what's wired it's a weird way to say this recognizing that a project based industry attempting to maintain a traditional full-time employment model must find new revenue streams to survive a sale focused consumer base that expects constant expensive innovation if you don't like how microtransactions are implemented in a game then let devs and pubs know many of you are that's good they will listen but if microtransactions don't work something else will replace it that's what happens when dev cost increased but real retail cost don't let's not pretend this is an EA / Ubisoft thing players are perfectly happy to engage with microtransactions when implemented in certain ways and that's partly because a good gameplay loop is designed to trigger the gambling impulse regardless of money being involved when the gameplay in microtransaction loop is balanced a certain way it creates the illusion of",
            "start": 1085.73
        },
        {
            "text": "a good gameplay loop is designed to trigger the gambling impulse regardless of money being involved when the gameplay in microtransaction loop is balanced a certain way it creates the illusion of being optional optional which in turn makes players more happy to engage via real money that's what my timeline is flooded with people saying just do it like Overwatch and then someone says yeah an Overwatch I don't have to spend 40 hours to play as Reinhardt. Walt replies I agree some smaller companies making smaller games can get by in less cash it would be incredibly helpful if journalists researched and published profiles of those companies that gave concrete info on how they do that and then he just goes on and starts replying to a bunch of people and it's just interesting to see that even the people that are working on the game and granted writers are different than sure yeah he doesn't have any say in how the company like I think one of the I'd have to be correct it correct me if I'm wrong",
            "start": 1124.97
        },
        {
            "text": "that are working on the game and granted writers are different than sure yeah he doesn't have any say in how the company like I think one of the I'd have to be correct it correct me if I'm wrong kind of like that Kinda Funny's You're Wrong like Walt was a contractor on this game whereas like Mitch is like in-house works at Motive he works for EA whereas Walt probably hired for this single player project wrote a story with Mitch and got out but going back to what you're talking about it being good that the the pubs are coming out and talking and setting up for themselves I think it's good that Walt whatever his position is he is saying that they're listening you know you decide enough to know they're like they are listening to this EA sees and on one hand I'm sure they see this and look this is a PR nightmare that I'm so upset we have to actually deal with but on the other hand they're like we gotta **** come up with solutions and fix it we can't just keep going being like well this",
            "start": 1160.37
        },
        {
            "text": "is a PR nightmare that I'm so upset we have to actually deal with but on the other hand they're like we gotta **** come up with solutions and fix it we can't just keep going being like well this will pass this isn't the type of news that passes no and that's it's so hard to separate the wheat from the chaff on this one right of just the fact that okay cool everyone's making their voices heard it's the most downloaded thing on Reddit a lot of people are having really great discussions about it that's the way to **** handle this people always ask how you know I weed on the show debate how to properly vote with your wallet to tell them you're not a part you mean you're not down with this everything that's happening right now is the not everything I'm sorry everything we've talked about right now is a great way to handle it the death threats being an **** horrible trying to be a **** sarcastic dick on Twitter to the community manager not the way to handle it this is speaking",
            "start": 1198.13
        },
        {
            "text": "right now is a great way to handle it the death threats being an **** horrible trying to be a **** sarcastic dick on Twitter to the community manager not the way to handle it this is speaking louder than anything the fact that we're still having this conversation speaks louder than that but it is still what is the you know I haven't I have not played a retail version of this game when we get this game on our hands and we're able to go through it and play on a live server what does all this look like is it is it that the rewards or what I start with are so bottom of the barrel that I'm never in and then I'm gonna look up the John this giant mountain and see that well to get to Vader to get to you know I hope Watto whoever's up this thing that I need to play is is my hero I'm gonna have to put 40 30 hours into this game and like the leveling that just breaks me from ever wanting to do it I mean this it goes back to what we were saying earlier like this is not a game that I'm gonna",
            "start": 1233.2
        },
        {
            "text": "have to put 40 30 hours into this game and like the leveling that just breaks me from ever wanting to do it I mean this it goes back to what we were saying earlier like this is not a game that I'm gonna play to that level yeah this does this news doesn't affect me as a gamer at all how it does affect me is the long-term overall forecast of microtransactions and how they're gonna be implemented in every game going forward sure so I it being such a big deal right now there will be changes the next game will not be this egregious you'd imagine based on this response once it's in how much money they make but yeah and that's true it does depend on how much money they need to vote with their wallets this is the whole thing of like and I don't mean I'm not trying to put down us as an industry or I should say us as consumers right but it happens all the time these announcements happen and everybody gets so up in arms and mad about it but then the game comes out nevertheless and does whatever",
            "start": 1271.93
        },
        {
            "text": "I should say us as consumers right but it happens all the time these announcements happen and everybody gets so up in arms and mad about it but then the game comes out nevertheless and does whatever nobody cares yeah if they see actual numbers like oh man people are not investing in the microtransactions oh man people are starting into this game and then seeing something like this and just bailing on this game people aren't buying this game based on it those are all gonna speak loud and clear let alone yeah this publicity nightmare sure I would like to imagine yeah I would like to give DICE the benefit of the doubt in the same way I give Gun Media and IllFonic the benefit out on Friday the 13th right that you know the intentness abroad players with a sense of pride and accomplishment for unlocking different heroes yep you've set you said it apparently too high based on what the early access kids are saying on Reddit and what you're the most hardcore this would be similar to us putting on",
            "start": 1312.61
        },
        {
            "text": "different heroes yep you've set you said it apparently too high based on what the early access kids are saying on Reddit and what you're the most hardcore this would be similar to us putting on something and going to the Patreon page and the Patreon page is like look we're the first people to get this and this sucks right like that's what's happening here your hardest of the hardcore early access I'm playing this you know so excited and putting our way outside my weekend and now I'm sitting there doing math on spreadsheets saying the system doesn't work and now it'll be on doing math on spreadsheet I wanted to **** be Han Solo, Darth Vader, Yoda and Here I am at home now exact so like a real PC gamer in here and just **** out there doing all this stuff we'll see what happens I'd like to imagine benefit of that that they see this and they have a response pretty quick like okay cool yeah that's too high we'll bring it down or but I think to what you're saying would've been a waste",
            "start": 1350.87
        },
        {
            "text": "to imagine benefit of that that they see this and they have a response pretty quick like okay cool yeah that's too high we'll bring it down or but I think to what you're saying would've been a waste smarter way of like hey here's a really cool cosmetic Vader, Luke maybe they have different powers or augmented things that are cool up there not like game winning whatever the hell it is I don't know man this to me the thing sucks the most is it good Star Wars games and you know with Visceral is going away and like there's been a lot of words going out there like how good was the game and all it says I don't even care I just like I want there to be real passion and thought put into Star Wars games because Star Wars is Star Wars should be a gold standard and to see all every time format yeah exactly and it's just like our and like I don't like that because Star Wars has so much marketing juice behind it of course these type of things gonna be a big deal because there is so much money",
            "start": 1393.17
        },
        {
            "text": "exactly and it's just like our and like I don't like that because Star Wars has so much marketing juice behind it of course these type of things gonna be a big deal because there is so much money to be made and I get it going on Walt's thing and said yeah money needs to be made like these games cut so you even think about how much money Star Wars Battlefront II must cost to make yeah holy crap there must be hundreds of people working on this game and the marketing budget alone is probably more than indie games are made for right of course yeah oh my god so it's like and to keep these teams going to keep people happy and to keep things moving keep putting out new content and last Battlefront I season pass was the big deal now microtransactions is a big deal they're just trying to find a way to be able to support these giant blockbuster games and it just sucks that like it seems like it's in such a they haven't figured out a way that people are happy to spend money for sure yeah and that's",
            "start": 1435.83
        },
        {
            "text": "be able to support these giant blockbuster games and it just sucks that like it seems like it's in such a they haven't figured out a way that people are happy to spend money for sure yeah and that's what this year has apparently been all about is that we try and experiment and figure out how you can keep a fanbase happy and keep some new community a community engaged in a way that makes money and I it's one of those man I'd love to live in that sea to be able to take a peek in that alternate universe right because I feel like what you're talking about yeah last you know last year there wasn't as much content there was an all this stuff like in keep people around or not last year last game for Battlefront I I would love to see the alternate universe where EA, DICE, and Motive take all that feedback and like cool single-player a multiplayer system that keeps you engaged and has less stuff no microtransactions or no loot boxes or just cosmetic stuff right and really their",
            "start": 1479.18
        },
        {
            "text": "take all that feedback and like cool single-player a multiplayer system that keeps you engaged and has less stuff no microtransactions or no loot boxes or just cosmetic stuff right and really their message is not hey this is the way the industry is going but hey this is what we're gonna go we've seen the success that The Witcher you know CD Projekt Red is able to have with The Witcher we're gonna do that again right here's the single-player thing you actually care about here's this thing we're not gonna nickel and dime you out the gate and see how it goes but again it's also what - what we're talking about of the community of I'm interested in Star Wars Battlefront II but I don't really want to like I think that forty-hour sounds like **** but also what am I getting in those 40 hours to get there like I'd rather play the game and see what happens so um I guess we'll know tomorrow genomics not very soon I'm on the report this is a short one Xbox One X is getting an Overwatch patch this",
            "start": 1518.33
        },
        {
            "text": "there like I'd rather play the game and see what happens so um I guess we'll know tomorrow genomics not very soon I'm on the report this is a short one Xbox One X is getting an Overwatch patch this is via I'm sorry this gave me Xbox Xbox One X is getting a 4K Overwatch patch from Windows Central. Blizzard told them Overwatch team is excited with great possibilities with the great possibilities Xbox One X opens the team is currently exploring how the game experience can be enhanced on this platform to leverage the consoles incredible hardware and is working on implementing a 4K resolution I'm sorry is implementing 4K resolution in the game on Xbox One X it isn't very it is very important for to make sure the user interface looks natural on the truly big on a truly big screen we will share more details about our plans for 4K support on Xbox One X later. Torch Kyle writes in and says hey guys Blizzard just announced they're working on that 4K support for Overwatch. Manning is in the main",
            "start": 1557.0
        },
        {
            "text": "more details about our plans for 4K support on Xbox One X later. Torch Kyle writes in and says hey guys Blizzard just announced they're working on that 4K support for Overwatch. Manning is in the main room I'm still waiting to grab a 4K TV but from what you guys have seen does the 4K resolution really make a huge difference over 1080p or will you only notice it if you're comparing the two side-by-side thanks for every you games are pretty cool man games are pretty cool item you you want a 4K TV on a 4K TV PlayStation sent to us for review purposes and it gets hard I've been saying a lot that it's like yeah you don't notice unless you're comparing out side by side however and this is kind of an empty statement because I don't have anything compared to but this weekend I played a game on my PlayStation 4 Pro on my TV yeah and it was 1080 and I was like ooh this really and I wonder what the 4K version would look like because I there was it was one of the first times I I had a moment",
            "start": 1598.78
        },
        {
            "text": "my PlayStation 4 Pro on my TV yeah and it was 1080 and I was like ooh this really and I wonder what the 4K version would look like because I there was it was one of the first times I I had a moment where I'm like it reminded me of playing a 720p game when I know what 1080 looks like mm-hmm and I was playing through this I'm like ooh like this should look better than it does and it made me think like **** the Xbox One X would help with that so I don't know there's the answer are you you do you regret pulling the trigger on your 4K TV oh my god no yeah my 4K TV is beautiful it's like it's that's the thing is the TV enhances the experience so much and we're just in that weird kind of catch-up phase where there's just so much I don't like that we have to wait for patches I don't like that we have to wait for these experience that wouldn't fall Final Fantasy XV came out and didn't have the the Pro update right away it's like oh that sucks yeah now I need to play through this game then once",
            "start": 1646.87
        },
        {
            "text": "to wait for these experience that wouldn't fall Final Fantasy XV came out and didn't have the the Pro update right away it's like oh that sucks yeah now I need to play through this game then once the updates out I'm not gonna keep playing you know I'm not gonna play again like just because it has this step I'm excited for a future where that is the standard day one there's a patch there's this there's that it's all good HDR beautiful although HDR is not even exclusive to the Pro models it's also on PS4 right slam or whatever yeah I think we're finally getting that tipping point where I know now that I have the PlayStation 4 Pro and in the company Xbox One X at home sitting there it was that thing or the other day where they when they announced the Destiny 2 4K patch was coming out which is actually I think coming up in the new yeah well new dates for you I'll jump ahead as detail in the post on the developers official website the update this is writ from IGN the Bungie update",
            "start": 1695.65
        },
        {
            "text": "which is actually I think coming up in the new yeah well new dates for you I'll jump ahead as detail in the post on the developers official website the update this is writ from IGN the Bungie update will arrive on December 5th the same day as Destiny 2's DLC expansion Curse of Osiris and its second season of content that's one it'll get its 4K super visual awesome thing and for me that was like huh you know I got these systems down there and I got and I'm I'm not in a hurry i but if I'm gonna buy a 4K TV I bet it'll be next year sometimes you're gonna if you're gonna buy one it's about to be a good time Black Friday I'm not that crap Black Friday you don't need you don't even worry about that but yeah it would be probably around December would be a good time they're gonna announce the new ones in January but I wouldn't worry too much about like missing out on this I'm not there yet I mean I'm not in that big of a hurry you know I'm not a graphics whore I'm a story **** like I look I",
            "start": 1731.58
        },
        {
            "text": "ones in January but I wouldn't worry too much about like missing out on this I'm not there yet I mean I'm not in that big of a hurry you know I'm not a graphics whore I'm a story **** like I look I look at my games they look good enough but it was like to your point of like oh well I still see myself playing a lot of Destiny 2 like a basket that's a game that's going to be there and ongoing even when I was playing like you know I was playing Horizon Zero Dawn at home on my PlayStation 4 Pro and even then I was like oh this looks beautiful is always like this looks awesome but I wonder what it looks like in 4K I know you can wait years before K yeah but again it's weird with with Sony because it's not really 4K and she's like upsampling Super Sampling blue you know let's **** **** yeah like I want to see what Xbox One X actual native 4K looks like sure see I just doesn't that do for me cuz I'm always in one-time trophies more than what they're for yeah that I mean I don't so but I also",
            "start": 1774.12
        },
        {
            "text": "I want to see what Xbox One X actual native 4K looks like sure see I just doesn't that do for me cuz I'm always in one-time trophies more than what they're for yeah that I mean I don't so but I also don't like wanna buy an Xbox One X just for third-party games yeah because you want those trophies and you want to be able to play stuff with me and coming in there right Kevin hey yeah Tim yes I'm super excited for the Destiny 2 expansion yeah but it's so far away mm-hmm if I want to know what was in the digital storefronts today where would I get official list of upcoming software crossed each and every platform? Elizabeth, Kinda Funny Games Daily Show host each and every weekday do do do do do do do you out today Repulze: Galactic Rivals on PC that's it but you better bet your bottom dollar it's a crazy we come to Switch this week you know that it's insane clearly Rocket League we can't win new dates for you though For Honor's Season 4: Order & Havoc starts tomorrow and Xbox One",
            "start": 1810.72
        },
        {
            "text": "PlayStation 4 and PC. Final Fantasy XV protagonist Noctis will join Tekken 7 as a playable file. Yeah, awesome. Speaking of that, let me jump ahead. TMNT in Injustice 2, you see that trailer? I did. I see the reaction reaction video reaction videos even better that's coming alongside The Atom and Enchantress. So what one thing I'm not clear on, sure someone please if you have information let me know in KindaFunny.com/YoureWrong. Do you play as each turtle or is it all four turtles at once doing some weird tag-team thing because the trailer they made it really could like we fight together and when they show them next to each other they're a group hmm I don't know how that would work out an Injustice 2. Yeah, I don't know either but let me know yeah I don't know if that's been announced but if you know",
            "start": 1855.36
        },
        {
            "text": "show them next to each other they're a group hmm I don't know how that would work out an Injustice 2. Yeah, I don't know either but let me know yeah I don't know if that's been announced but if you know that KindaFunny.com I was trying to find gameplay that's all they put out was a trailer as a update on that yeah that's the next wave of DLC and that starts with The Atom on December 1st for early access folks no date for the turtles themselves. The End Is Nigh is coming to Nintendo Switch on December 1st. Wolfenstein II: The New Colossus got a whole bunch of DLC dates. The Adventures of Gunslinger Joe comes December 14th, The Diaries of Agent Silent Death come January 30th and The Amazing Deeds of Captain Wilkins arrives March 2018. Then like I said yeah PlayStation 4 Pro and Xbox One X will soon be able to play Destiny 2 in 4K with HDR that is coming on December 5th for the Curse of Osiris thing. Supermassive Games' The Impatient and Bravo Team have been delayed. The Impatient is now coming January 23rd and Bravo Team",
            "start": 1900.57
        },
        {
            "text": "team is coming March 6th. Yes, that sucks but me okay whatever. It's also I mean The Impatient I felt like just missed its mark not be able hit Halloween yeah like hey we have a scary PlayStation VR game and it kept sliding anyway and then final one for you Axiom Verge is getting a retail release November 21st. Look this is cut now this is where it gets crazy there are five versions of the game coming to three platforms so it's coming to Switch, PlayStation 4, Vita. Then they're on top used by the game straight up his retail but then there's a Multiverse Edition that comes with an art book some posters but most importantly a documentary from 2 Player Productions about what's going on over there I think was people check that for me KindaFunny.com/Journal I want to see that because of course Axiom Verge",
            "start": 1942.57
        },
        {
            "text": "but most importantly a documentary from 2 Player Productions about what's going on over there I think was people check that for me KindaFunny.com/Journal I want to see that because of course Axiom Verge made by a friend of the show Tom Happ. I want to hear the whole story because I've heard bits and pieces. What did the Happs have? It helped Tim. Mmm, it's time for Reader Mail. This is where you write in the KindaFunny.com/KFGDD just like Kenny Belou did. Kenny Belou says today Monday November 13th is your 100th show. Wow, congratulations! Thank You Kenny for telling us thank you all for supporting the show and getting 100. I thought I would share some stats that may be interesting out of the 99 show so far. Greg has hosted 88 times, Andrea 41 times, Tim 30 times, Danny 11 times, Andy and Gary Whitta tied at 5. Anthony Carboni 3 times, then Gerard, Fran, Robin Hunicke and Janina Gavankar one time each. Okay, we'll see who breaks out of that one time or Club as soon as my numbers random facts the first",
            "start": 1988.77
        },
        {
            "text": "tied at 5. Anthony Carboni 3 times, then Gerard, Fran, Robin Hunicke and Janina Gavankar one time each. Okay, we'll see who breaks out of that one time or Club as soon as my numbers random facts. The first show was on June 19th, 2017. There have only been six weekdays without a show: July 3rd through the 7th for the holiday and August 11th for Kevin's bachelor party. The first non-Kinda Funny guest host was Anthony Carboni on September 4th, 2017. There was no handshake on September 6th, 2017 because Anthony left the show early. The first day Andrea repeated her outfit was on October 6th, 2017, her 37th show. Oh my god, really? She's insane. She is insane. Is that that a thing for her? Yes, she made up what she called it out because she knows I was complimentary cuz she looks so good but she knows Kevin I don't actually we can't pay that is that level awesome she's a **** like that's that's when you know you have a professional like host like Andrea's like a gun for hire right that she is like",
            "start": 2040.73
        },
        {
            "text": "thousands of outfits that she can just even freaking love that she's in the same person. The only show with more than two people on set was October 2nd, 2017 with Greg Miller's Industry Onset. Greg and Andrea have hosted together 36 times. Greg and Tim have hosted together 23 times. Greg and Danny have hosted together 18 times. Andrea and Tim have hosted together three times. Tim and Andy have hosted together three times. Andrea and Danny have hosted together two times. Greg and Andy have hosted together two times and Tim and Danny have hosted together one time. I'll tell you right now then to break some news for you tomorrow for the first time ever Andrea and Gary Whitta will host Kinda Funny Games doing a weird little mix-up. Kevin and I are going to LA for projects. Kinda Funny. Kenny says",
            "start": 2089.45
        },
        {
            "text": "news for you tomorrow for the first time ever and Andrea and Gary Whitta will host Kinda Funny Games doing a weird little mix-up Kevin and I are going to LA for projects Kinda Funny. Kenny says thanks for providing so much great content I love the show and can't wait for the next 100. PS I have all this in a spreadsheet if you like a copy for internal records. Now can't I trust you? You just keep record up today for episode 100 so we know what's going on there. Kenny Belou, hard to believe 100 episodes. It seems like a lot but I guess it's five days a week. I really like the show, it's a good show. Thank you all for the support. I was looking today at the YouTube numbers like, oh hey man, we grow. Yeah, these grow. This is like, I know we do. You point out what we're the number one daily video, number one daily video game audio's. Thank you for your support. We love you very much. It's our pleasure to make this show for you. DocDoomII writes in with a question that I thought was new but it actually",
            "start": 2132.95
        },
        {
            "text": "one daily video game audio's. Thank you for your support. We love you very much. It's our pleasure to make this show for you. DocDoomII writes in with a question that I thought was new but it actually it's like from the beginning of the month but I'm pretty sure I never read it. I thought I was still interesting so here, okay, mm-hmm. Hey Greg, what are your thoughts on games creating timed content that can only be accessed for a limited time? I'm referring to Hitman's Elusive Targets and Assassin's Creed Origins Trials of the Gods. It looks like the developer/publishers are trying to create a new trend to force more people to buy on day one or possibly very close to the game released. To me though, it feels like they want to try and force us to buy and play on their time schedule and not ours. And I don't like it. What if I buy their game six months after release? What if I buy it on day one but don't have time to play it? Should I be chastised for and blocked from accessing some content? Thank",
            "start": 2174.14
        },
        {
            "text": "I don't like it. What if I buy their game six months after release? What if I buy it on day one but don't have time to play it? Should I be chastised for and blocked from accessing some content? Thank you, keep up the good work. Ah, I'm I don't know much of my Trials of the Gods. Hitman Elusive Targets, I think it's a brilliant idea but it works for Hitman because they think of themselves as it games as a service. Yeah, I don't it's not that I'm forcing you to buy it, it's them encouraging you to keep coming back to it. Yeah, the thing is he's focusing, DocDoomII here, it's focusing more on the exclusive stuff that's day one or like the first week which I can see that being a little sleazy. But going on like, yeah, with the Hitman Elusive Targets, this is great because it's just giving people that have already bought the game even if it is six months down the line. Yeah, reasons to come back, reasons to keep playing. And it also, I would think, encourage people who are on the fence to buy it to buy because they",
            "start": 2215.33
        },
        {
            "text": "bought the game even if it is six months down the line. Yeah, reasons to come back, reasons to keep playing. And it also, I would think, encourage people who are on the fence to buy it to buy because they know it's gonna be so there's gonna be there's more stuff. I'm an Elusive Target in Hitman. Elusive Target, like, should play this. I want to **** kill Gary. And we talk about this a lot where, you know, coming from IGN, like we understand that once a game comes out, it's over, it's done, and it's not talked about anymore. So any reason to get the big sites to, yeah, right, and have to come through the blog roll and get that marketing push. Yeah, it's good for everybody. It's good for the gamers, there's more content. It's good for the publishers and developers because their game's getting marketed again and hopefully more sales and all that stuff. And correct me if I'm wrong, and I'll speak to Hitman again since I don't know what I don't really know any men to check a nice rate that",
            "start": 2258.56
        },
        {
            "text": "marketed again and hopefully more sales and all that stuff. And correct me if I'm wrong, and I'll speak to Hitman again since I don't know what I don't really know any men to check a nice rate that I'm KindaFunny.com/you're wrong. You're allowed to write in and tell me what exactly Assassin's Creed Origins Trials of the Gods is. But for Hitman, I believe all the Elusive Targets were free. Yeah, so it, well, it's exactly the opposite of what we're talking about with the other things, right? Where it's like, hey, we're encouraging, we're giving you content if you already own the game, but giving you content encouraging you to buy the game rather than nickel and diming. Yeah, I don't think all of them were free. Okay, so remember there was some of those weird DLC stuff and if you buy the collector's edition, you know, yeah, but I don't think it was the Elusive Targets. I thought I thought the Elusive Targets what is going and you're wrong. But I think it's great when they do that. It just it does become",
            "start": 2295.82
        },
        {
            "text": "you know, yeah, but I don't think it was the Elusive Targets. I thought I thought the Elusive Targets what is going and you're wrong. But I think it's great when they do that. It just it does become hard as a completionist to to miss something, you know. And it is then on their schedule and that does kind of suck. But it's like you just kind of get over that. It's video kind of the fun. Yeah, you don't. It's like one that when Destiny 2 was dropping and when Xur showed up for the first time and I was like, ****, I I really want I'm still into this thing. I want to be a part of it and go see what he has. And like that was a moment. Yeah, and then he's out all the time just tell the same things. Xur, I guess. I don't know. I've got back to us is the first time because it was like whatever, you know what I mean? Mmm, themendoz writes in. It says, hello Greg and not Greg. Let's Tim. I saw that Lego Worlds just had a steep steep discount and finally bought it. The price drop quite possibly indicates",
            "start": 2329.03
        },
        {
            "text": "I mean, mmm, themendoz writes in. It says, hello Greg and not Greg. Let's Tim. I saw that Lego Worlds just had a steep steep discount and finally bought it. The price drop quite possibly indicates poor sales, parentheses, given the game was recently released. This is the exact Minecraft I always wanted and a lot of people might share this feeling. So why did it not catch on? What couldn't Lego Worlds, I'm sorry, you know, he said what what could it like a world capture that makes Minecraft so great? Was it just a timing issue? Thank you all. I love your show. PS I love you beyond imagination. Oh wait, wrong show. I think the fact this goes back to Seinfeld, just like we already have a George, we already have a Minecraft, you know what I mean? Like Minecraft awesome. And if you love Minecraft or if you think you'd like Minecraft and you jump in, you know immediately if you're into Minecraft, if you're not into Minecraft. So for Lego Worlds come out, which I played at events and have chilling on my Switch and",
            "start": 2364.78
        },
        {
            "text": "like Minecraft and you jump in, you know immediately if you're into Minecraft, if you're not into Minecraft. So for Lego Worlds come out, which I played at events and have chilling on my Switch and have never actually used on my Switch. It's like I already have a Minecraft on my Switch. I don't need to worry about Worlds. I mean, Minecraft is the Lego of video games. That's how everyone pitches it immediately. And the Lego doesn't really need to do that lately or can't really do that. Lego has Lego video games have their own niche. They have their thing. People understand what those are. Yeah, so to do this, it who's no one thought this was actually gonna work or, you know, I'm sure somebody at TT probably really. Yeah, yeah, I don't know. It's just like Lego seems to me like the the type of property in video game form that will just kind of grasp at anything. Like they see some of the startups like, we're gonna do an MMO because people do whatever boss. Oh my God, spec. We're gonna be one of those. Oh, toys",
            "start": 2412.81
        },
        {
            "text": "game form that will just kind of grasp at anything. Like they see some of the startups like, we're gonna do an MMO because people do whatever boss. Oh my God, spec. We're gonna be one of those. Oh, Toys-to-Life. We're gonna do that. And they can do that because Lego has that type of recognition. Sure. And they can just put it out to see what works and then stop supporting it. Yeah, I think that's the big thing is that they have they know that games like Lego Marvel Super Heroes 2, full disclosure, were in that game. Take with a grain of salt is going to do well enough. And all their Lego-tying games are gonna do. And like where you talk about what a Lego game is is going to do well enough. So yeah, why not take a shot at Toys-to-Life? Take a shot. Really? I wonder, is it gonna do well enough where we'll see where's 2? Yeah, I think it's gonna I think for what they think a Lego game does. Yeah, I was Lego game is set the world on fire. I don't know. And I go, he's saying, but even then, look, the PS4 and Xbox One",
            "start": 2452.47
        },
        {
            "text": "where's 2? Yeah, I think it's gonna I think for what they think a Lego game does. Yeah, I was Lego game is set the world on fire. I don't know. And I go, he's saying, but even then, look, the PS4 and Xbox One launched with Lego Marvel Super Heroes 1. Sure. And that was a big deal because it was the first time all the Marvel Super Heroes together. Cool. Crasher looking at the box, real label: Marvel Lego Marvel Super Heroes 2. Yeah, and I'm like, huh? Yeah, there's a lot of who the **** are these guys? Right? Game 100%. I'm with you. Don't be like that. So now we're a new side conversation of how well Lego Marvel Super Heroes 2 is gonna do and what their projections are. I would imagine it's not gonna do that great. Yeah, it's also a Lego game. I mean, you might say, well, whatever. ****, we did it was in here the other day. Yeah, we bought Lego Ninjago. Yeah, all right. Like a great team. We'll see. Yeah, I wish I bet. But I mean, like, of course it is not gonna do Lego Marvel Super Heroes well. Well, Lego Marvel Super Heroes was on",
            "start": 2488.17
        },
        {
            "text": "day. Yeah, we bought Lego Ninjago. Yeah, all right. Like a great team. We'll see. Yeah, I wish I bet. But I mean, like, of course it is not gonna do Lego Marvel Super Heroes well. Well, Lego Marvel Super Heroes was on PlayStation 3, Xbox 360 as well. Correct? Yes, yes. So yeah, it's not gonna do those numbers because I guess it isn't launch game. People had it. We're ready to jump into. Yeah, but I mean, I just as a Lego video game fan, I'm a like a video game fan in the same way I'm a Telltale fan. When they put out a whole bunch of games and I'm gonna pick and choose which ones I want to play where you go with it. This one just seems interesting to me. Yeah, I mean, I I yeah, you gotta Spider-Gwen and Spider-Man 2099 on the front of the box. And those are among the most recognizable characters, right? They don't have Captain America. I think somehow I would have done this. But yeah, yeah, yeah, whatever. Probably some weird licensing thing for Marvel. Who the hell knows that what's going on over there? I digress.",
            "start": 2529.96
        },
        {
            "text": "Mal like Captain America. I think somehow I would have done this. But yeah, yeah, yeah, whatever. Probably some weird licensing thing for Marvel. Who the hell knows that what's going on over there? I digress. Let's finish with Drew. Drew writes in, says, I would like to ask you guys about the overall negativity regarding seemingly everything in the games industry and how it seems to stifle any positive conversation. My primary example example is Destiny. The Reddit is overflowing with negative post after negative post. And on the off chance that someone posts something positive, they seem to get attacked by people that post negatively. The majority of time I like to be a part of communities for the games I love, but I'm always afraid to post because I just don't have the time to be negative about this stuff. I'm an adult and this is my hobby, so why use that little time I have to dwell on the negative? I can't be the only one that feels like they have to suppress their positive comments out of fear of",
            "start": 2571.12
        },
        {
            "text": "I'm an adult and this is my hobby, so why use that little time I have to dwell on the negative? I can't be the only one that feels like they have to suppress their positive comments out of fear of being attacked because I'm quote letting these developers and publishers get away with ripping me off or stealing from me end quote. Why do we let the negative people suppress us? And I think he might mean suppress us. And he's that feeling of suppression. He didn't mean that ever going to switch to the positive movement outweighing the negative. I just want to be able to share what I love about these games without being downvoted to the point where my comments aren't visible or be attacked because I want to share constant but I don't want to share the constant negative circle jerk that floods most forums communities. Drew, you are not alone. I don't know. This is what Kinda Funny is literally what we found it. Kinda Funny, huh? As a place to come here and hang out with best friends who want to talk about",
            "start": 2615.16
        },
        {
            "text": "communities. Drew, you are not alone. I don't know. This is what Kinda Funny is literally what we found it. Kinda Funny, huh? As a place to come here and hang out with best friends who want to talk about things and celebrate things and not be dicks about things. Yeah, you're gonna be a dick in the community. Don't engage with the dicks. Tell them we don't do that here and then walk away and ignore or mute them to whatever. I think the heart of it is it's way easier to be negative about something, 100%, than positive. And I think that you are positively reinforced to be negative about things more than you are to be positive. Grateful what you really got them. Yeah, you know, like of the same way, I can't believe they're nickel and diming us on this. Exactly. Whereas when you're positive, it's way easier to be torn down. And I look at someone be like, oh, they're a fanboy or like, how can you like this? Not that how can you like the Fast & Furious movies? You're a **** horrible person. It's like, come on, it has",
            "start": 2652.57
        },
        {
            "text": "to be torn down. And I look at someone be like, oh, they're a fanboy or like, how can you like this? Not that how can you like the Fast & Furious movies? You're a **** horrible person. It's like, come on, it has to be a line here. And I think that it it gets more complicated when they're the critique, right? When you like something, you're gonna be its biggest critic. When we watch superhero movies, the first thing I think is what what did I not like about it? Obviously I liked it. Obviously I'm happy that this exists. I enjoyed it. I spent money on it. And I spent two to three hours watching the things, didn't do the credits, and watching the post credit thing. Like what I'm gonna talk about is what how does this rank against the other Marvel movies? How does this compare to this or that? Or I like this and I didn't. And it's like that gets taken so literally sometimes where it's just like, oh, he hated this. Fanboys. It's like everyone just wants to group people and label people because it's easy. That's how things",
            "start": 2691.09
        },
        {
            "text": "and it's like that gets taken so literally sometimes where it's just like, oh, he hated this. Fanboys. It's like everyone just wants to group people and label people because it's easy. That's how things work. And even what I was just saying, like comparing it to the other movies, that is just grouping. And it's just that's what people want to do. That's what humanity likes is being able to put things in boxes. And I think what you're seeing on Reddit, when it's the Destiny Reddit or whatever Reddit, these are the people that care about these games. So their negativity, I don't think always comes from a bad place. Exactly. It's not every person on there being negative is trolling. There's definitely people go to subreddits, forums, and just want to **** poke everybody with a sharp stick to get them mad. There's a line there to walk. And there is this thing of the investment. And I remember it of being a kid like that. You know what I mean? Like, you know, why do we let people suppress us? And like, why is this",
            "start": 2733.27
        },
        {
            "text": "there's a line there to walk. And there is this thing of the investment. And I remember it of being a kid like that. You know what I mean? Like, you know, why do we let people suppress us? And like, why is this happening? And you go back to it. I'm an adult. This is my hobby. So why do I use what little time? There's people I remember when I was on GameFAQs message boards for NCAA Football. And I was like, **** all about like being there all the time and talking all the time. And it was something I owned it. I'm one of the biggest fans. So of course somebody comes in and doesn't agree of my opinion with your **** opinion. Doesn't matter. It's a it's a young underexposed thing. I feel like I'm not having more to grapple with and deal with. And I feel like every time you seem like great example this weekend, I went into Extra Life in Maryland. We did the Destiny 2 raid. And I haven't played Destiny 2 in probably a month, a month and a half. Me, you know, whatever. Still into it. Still gonna platinum it all",
            "start": 2774.43
        },
        {
            "text": "I went into Extra Life in Maryland. We did the Destiny 2 raid. And I haven't played Destiny 2 in probably a month, a month and a half. Me, you know, whatever. Still into it. Still gonna platinum it all that jazz. And played it and finished it. And it was like, ****, this game's so good. You know what I mean? I love this game so much. And like I tweeted that out of this like after some time off, came back, loved it as much as ever. Right? And of course the majority, majority, but the comments that stand, the trolling, well, we're talking about just anyone cuz my nightmare because my enjoy it just **** off. I don't know. I'm not here to have this. I don't need to be attacked on this one belief that I feel this game's cool. And that every time you see me put up by, oh my God, man, I played two chapters of Call of Duty and I'm really enjoying this story. It's great. If somebody responds, oh wow, two chapters. Like, what do you like? What? Yeah, why can't you just accept that I'm enjoying this? This is an opinion I'm putting out.",
            "start": 2811.39
        },
        {
            "text": "and I'm really enjoying this story. It's great. If somebody responds, oh wow, two chapters. Like, what do you like? What? Yeah, why can't you just accept that I'm enjoying this? This is an opinion I'm putting out. Well, that's the people need to have a feel the need to have opinions on people's opinions. Yeah, and I mean, to be fair, that's but this entire company's founded on in a lot of ways. But I just think that it like everything, it comes down to communication. It comes down to knowing what words you're using and what point you're actually trying to get across. Because the moment you you drop a **** in there, the moment you add some word to modify the statement that you're making, it makes that really blows it out of proportion. And then the fight doesn't become sure about what you're talking about. It becomes this side or that side. And no matter whether it's Destiny or movies or YouTube communities, whatever it is, it just turns into this disaster of you're either with me or against me. And it's like there",
            "start": 2850.54
        },
        {
            "text": "this side or that side. And no matter whether it's Destiny or movies or YouTube communities, whatever it is, it just turns into this disaster of you're either with me or against me. And it's like there needs to be a gray area. There needs to be this middle ground where everybody can put their opinion out there. And those opinions can coexist with each other. Sure. And that that's not when you go to Reddit, that's not really no, it's going to be. And I think you just yeah, but I feel like what at the end of the day, the negativity most of the time comes from a good place. It's just presented the wrong way, which then results in toxic ****. And I mean, you're you know, you're talking in here, Drew, about like you want to do it, but you don't. There's a fear of it. But what the fear and all that doesn't go away until you actually go out there. And what we talked about when we started this, all right? And what are you talk about at IGN is that there is a vocal minority, the comments, and then there's",
            "start": 2887.8
        },
        {
            "text": "go away until you actually go out there. And what we talked about when we started this, all right? And what are you talk about at IGN is that there is a vocal minority, the comments, and then there's the silent majority that comes in, reads it, watch the video, like that was cool and bounces. Yeah, and if you want to change it, you need to be the change you want to see. And that what that also means is that when you see someone trolling or being an **** or what, and I'm not talking about being critical of something, I mean, being a **** dick, don't respond to them. Downvote them. Don't comment. Walk away. Don't comment. Cause all trolls are you don't feed the trolls as some people say all the time. But I mean, the better thing is just don't give oxygen oxygen to fire. But all of those people want. And when you just ignore them, they go away. Yeah, I I think going back to what I was saying about the buckets, I think even within the community is like people want to bucket everything. And that includes saying, all right,",
            "start": 2929.06
        },
        {
            "text": "ignore them, they go away. Yeah, I I think going back to what I was saying about the buckets, I think even within the community is like people want to bucket everything. And that includes saying, all right, it's negative. When you see a couple negative postings, like all this, it's **** talking here. And it just because everything is a toxic community, every community is a great community. It just depends on what you're looking at, what you get out of it. I the Kinda Funny Facebook group, depending on the day, depending on when I look at it, it's either the best place ever, the worst place ever. Sure. And it's like that's the community is great. I know the community's great. There are bad apples. And the bad apples can turn people off to it. People always talk about NeoGAF or ResetEra or whatever it is and how **** horrible they are. It's like, well, I have great experiences with them when I go and I click on the threads that I want to read. And it's like, yeah, when you go to a lot of the more political",
            "start": 2964.52
        },
        {
            "text": "how **** horrible they are. It's like, well, I have great experiences with them when I go and I click on the threads that I want to read. And it's like, yeah, when you go to a lot of the more political ones, it's gonna be a little ridiculous. But guess what? That's what politics do. You just need to kind of temper your expectations and know what you're getting into. And I think everyone's needs to have thicker skin and understand that they're not gonna get things the way they want them all the time. Agreed. Time to Squad Up. This is where one of you writes into KindaFunny.com/KFGd. Give me your name, your username, your platform of choice, and what game you need help in. I read them here. The best friends find you. If you're looking for you're wrong, I opened it for you. There you go. And then y'all y'all squad up and have fun play games together. Today, Gus needs help on PlayStation 4. His PSN name is Razorblood09, all one word. Razorblood09 says Platinum and Rocket League. Looking for best friends to",
            "start": 3001.48
        },
        {
            "text": "up and have fun play games together. Today, Gus needs help on PlayStation 4. His PSN name is Razorblood09, all one word. Razorblood09 says Platinum and Rocket League. Looking for best friends to make the climb to Diamond. Short to the point. If you want to get serious about some Rocket League with Razorblood09, hit him up on the PSN. Remember tomorrow's show, Andrea and Gary Whitta. Tim, yes, the people who watched us live on Twitch.tv/KindaFunnyGames are encouraged to go to KindaFunny.com/you're wrong. Tell us what we screw up as we screw it up. So at the end the show, we can give you one great rundown, set the record straight for YouTube.com/KindaFunnyGames and podcast services around the globe. Tim, what do we get wrong today? Dirt410 says Battlefront II's release date is November 17th and not the 14th as Greg stated. Thank you. Which kind of wait is it? Friday instead of Tuesday. Video games, man, they don't give a ****. Yeah, you know what's an",
            "start": 3044.26
        },
        {
            "text": "two's release date is November 17th and not the 14th as Greg stated. Thank you. Which kind of wait is it? Friday instead of Tuesday. Video games, man, they don't give a ****. Yeah, you know what's an entertainment milestone? It's also yeah, early access right now, I guess, if you wanted to play it. Yeah, no editorializing. Don't make you jokes either. I saw somebody correct in like Rick says, you've been awake for 40 million. I yeah, all right, man. J.S. Colin says, when Tim was using Halo as an example, he said the Satin Right helmet from Halo. This isn't Mark VI from Halo 3 as Halo had no customization. As I was saying that, I was like, a thing. This is wrong. It's been so long. Thank you for that. I appreciate it. Suck me a fake gamer. I am a fake gamer. It is true. It's all the moniker we got. And finally, mmm, this is a very loose, super handsome limb drawn today. I'm not thrilled with it so far. So, you know, I show to them all time. Tim still reading through again. He don't editorialize. What's the fact we got wrong?",
            "start": 3087.6
        },
        {
            "text": "is a very loose super handsome limb drawn today I'm not thrilled with it so far so you know I show to them all time Tim still reading through again he don't editorialize what's the fact we got wrong that's gonna I didn't do this I usually you know double up they trace the lines I was just doing it PD0000 says Battlefront II is eight heroes available from the start and there are six more to unlock in the first game all heroes were available from the start the six are Luke, Vader, Leia, Palpatine, Chewbacca, and Iden all but Iden were available in the first game from the start except Chewbacca who's DLC personally they got great carrots on sticks because I already have them in the first game and Iden in the campaign agree with him they should have been more obscure variants or something wait so I'm sorry whose unlock from the beginning did he explain that or he said there are six characters the six are Luke, Vader, Leia, Palpatine, Chewbacca, and Iden yeah okay Real Radek",
            "start": 3127.38
        },
        {
            "text": "something wait so I'm sorry whose unlock from the beginning did he explain that or he said there are six characters the six are Luke, Vader, Leia, Palpatine, Chewbacca, and Iden yeah okay Real Radek13 says Tim Tebow sees you most likely play as all of them but you can switch between one turtle during the match in Injustice 2 each character as a specific character power which is assigned to the circle button for example Harley's character powers her summoning her pet hyenas as a projectile Superman getting a short boost in attack power excite excited my prediction in for Ninja Turtles that you choose one of the turtles for example you stars Leo and you press down circle and switch to Donatello while keeping the one health bar cool alright that sounds fun this is you're gonna become an MLG now at Injustice that you can play as a turtle three their earrings yeah I'm excited about that okay Injustice looks great man that's a game that I totally just missed out on it right it deserves",
            "start": 3174.7
        },
        {
            "text": "now at Injustice that you can play as a turtle three their earrings yeah I'm excited about that okay Injustice looks great man that's a game that I totally just missed out on it right it deserves my time because man that thing looks beautiful yeah they keep doing cool **** with the team Tim still reading you're wrong he's got a weed through year I think Daddy Wolf says Hitman's elusive targets were only four players who bought the full season pass if you're buying episodes individually you were locked in the content oh okay my apologies still liked it though in terms of a reason to keep you coming back from war but I guess if you're paying for it maybe you should be able to access it later huh interesting but they still they went on forever right are you because they did give you chances I remember some people came back Kevin's just shrugging okay Capitalist Pig Assassin's Creed Origins Trials of the Gods limited time events where in the case of the first release at least you",
            "start": 3223.24
        },
        {
            "text": "I remember some people came back Kevin's just shrugging okay Capitalist Pig Assassin's Creed Origins Trials of the Gods limited time events where in the case of the first release at least you have to fight a boss like character to earn a piece of rare gear they're meant to be and gain level challenges they seem to last a week and there's no word on if they'll be revisited once they've occurred also says Walt Williams is contract only he goes on to say the only place I'm employed full time is Mickey D's heart oh the source is he asked him on Twitter good thank you very much thanks for doing the work out there Capitalist Pig I'm telling you he Capitalist Pig is the best at it Kevin you're gonna have to figure out how we Skype him in and just throw him up on the wall and he tells us what we got wrong he said it was that way that I'm not sure if we could do that Wow okay okay hey breaking news breaking is this coming through your own yeah okay well about 15 minutes ago Alana Pierce tweeted and",
            "start": 3271.17
        },
        {
            "text": "he said it was that way that I'm not sure if we could do that Wow okay okay hey breaking news breaking is this coming through your own yeah okay well about 15 minutes ago Alana Pierce tweeted and I'm gonna I know I can I got yet at this time but I don't think I'll screw up the name Alana Pierce tweets there won't be a Daily Fix today because a large group of IGN employees have refused to work until the company issues a statement / apology regarding what happened to Kallie Plagge I get all right Kallie Plagge damn its god I love her so much she's we talk all the time we are legitimate acquaintances for not like friends I don't like you know we don't paint your nails but like I just **** up your name every time I say it outside I'm sorry I'm calling Kallie Plagge we're calling okay from now on okay uh if you're Jesus Christ if you're out of the loop over the what Friday night wasn't she posted a me to post claiming that Vincent Zannita a former IGN editor has sexually harassed her at",
            "start": 3310.38
        },
        {
            "text": "on okay uh if you're Jesus Christ if you're out of the loop over the what Friday night wasn't she posted a me to post claiming that Vincent Zannita a former IGN editor has sexually harassed her at the company and that IGN basically didn't do anything about it it's all up on our Twitter Vince put up a response that was there thirteen tweet response or whatever to that thing and that was Friday night and there hadn't been anything said until apparently now IGN I put out a post will see I'm sure we'll cover this tomorrow I'm Kinda Funny Games Daily remember each and every weekday in a variety of platforms we run you through the nerdy video game news you need to know about before I answer your questions comments and concerns that you file over Kinda Funny dot com/AFGD no matter where you get the show thank you for watching remember you can watch live on Twitch.tv/KindaFunnyGames later on YouTube.com/KindaFunnyGames or listen on podcast services around the",
            "start": 3366.44
        },
        {
            "text": "where you get the show thank you for watching remember you can watch live on Twitch.tv/KindaFunnyGames later on YouTube.com/KindaFunnyGames or listen on podcast services around the globe no matter where you get it thank you for watching it thank you for consuming it it's our pleasure to make it for you and until next time it's been our pleasure to serve you",
            "start": 3415.04
        }
    ]
}