{
    "id": 3196,
    "video_id": "bwnql6efbOs",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Bruce Greene"
    ],
    "title": "What Actually Is The Let's Play Family? w/Bruce Greene - The GameOverGreggy Show Ep. 208 (Pt. 4)",
    "description": "Thanks to Blue Apron for sponsoring this episode. Go to https://BlueApron.com/Greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1512028804,
    "duration": 1196,
    "transcript_chunks": [
        {
            "text": "Kevin, how long does it need to be? 60 seconds on Blue Apron? No problem. That's right, there's no ad in the teleprompter. My name is Greg Miller and I use Blue Apron. They sponsored the show today. You need to go there. Why do I use Blue Apron? Legitimately, because I love it. Look, eyes closed, there's no teleprompter. I am the hot pickle. I'm paid to say this, but I'm not paid to use it, and I use it all the time. Blue Apron, of course, ships you prepackaged ingredients. They send them to you. You open the box up, you take them out, you go to step by step. They give you a little checklist. They come on nice card stock, which I like. I think you can save them with where I put all my other recipe books. You save them over there. You pull out when you want to use them. You follow step by step ingredients, instructions. You put it all together, you make an amazing meal in 30-45 minutes, depending on what exactly they're sending you. Now again, I use Blue Apron. This is legitimately the Blue Apron report that is asking",
            "start": 0.0
        },
        {
            "text": "you put it all together, you make an amazing meal in 30-45 minutes, depending on what exactly they're sending you. Now again, I use Blue Apron. This is legitimately the Blue Apron report that is asking me to rate my latest deliveries. Stir-fried beef and broccoli, five stars, it was amazing. Now here's where it gets interesting, right? Mushroom and red rice casserole. Kevin, does that sound like something I'd like? I liked it. I'm gonna tell you right now, I'm giving it four stars. Then salmon and honey glazed carrots. Here's the thing, nah, didn't, didn't do it. And they didn't do it because like, here's the thing with Blue Apron, of course, you get the food sent to you. If you want to make it into their dish, great. If you don't, freeze it, use it later, whatever. I think I ran out of time that week. I froze it. Now I'm gonna get some salmon. They're ready to go. Now I'm gonna read the one part that I have to read. Blue Apron is treating The GameOverGreggy Show listeners to their first dinner, a $30 value, if you visit Blue Apron",
            "start": 40.5
        },
        {
            "text": "I got some salmon. They're ready to go. Now I'm gonna read the one part that I have to read. Blue Apron is treating The GameOverGreggy Show listeners to their first dinner, a $30 value, if you visit BlueApron.com/Greggy. So check out this week's menu and get $30 off your first order with free shipping at BlueApron.com/Greggy. Blue Apron, a better way to cook. Hold on, Kevin, let me tell you what else I got coming up here. You can cut the ad if you want. You do whatever you want. I know people want to show here. There you go. This week, guess what's coming tomorrow? Shrimp and bucatini pasta. Then I got sauteed beef and kale rice, looking forward to that one. And then kale and ricotta hearts. Woo! Anything picked that one? John V.F. St. Thomas did. We'll see how that turns. I don't know. Also, I substitute what? Yeah, John V.F. St. Thomas Miller. I also subscribe to Blue Apron's Wine Club and I pay out of pocket for that one. Like, I mean, I'm, I didn't get a, what is it, BlueApron.com/Greggy thing for that. I just",
            "start": 80.04
        },
        {
            "text": "yeah, John V.F. St. Thomas Miller. I also subscribe to Blue Apron's Wine Club and I pay out of pocket for that one. Like, I mean, I'm, I didn't get a, what is it, BlueApron.com/Greggy thing for that. I just like wine and I like Blue Apron. I bought the cookbook because Cool Greg sent me a link saying they were putting on a cookbook. Blue Apron sent me a shirt. I'm a big fan. Tim, yes, what's your topic? Bruce, I want to talk to you about the Let's Play Family. Okay, everything. There's a lot of times on the Reddit of the Facebook group, whenever we do events, we recently did the Let's Play Reunion and whatnot and all that. And a lot of people are like, oh cool, like I'm familiar with Funhaus, so I'm familiar with Achievement Hunter, or I'm familiar with Cow Chop, or whatever. But like, there's always questions of who are these people and how do they differ and what do they do? And I feel like you are a good person to kind of have on to introduce the Kinda Funny brand. Do you pay attention? You",
            "start": 119.76
        },
        {
            "text": "questions of who are these people and how do they differ and what do they do? And I feel like you are a good person to kind of have on to introduce the Kinda Funny brand. Do you pay attention? You watch the content? I do pay watch people's gonna watch the content. Um, so you want me to describe the groups and I want your, your kind of take on what the groups do different from. You want me to describe them first, then you could tell me how long I have about? Yes. Kinda Funny. Let's start with Kinda Funny. Kinda Funny are in three and like three or four senses. Oh, a bunch of **** knuckleheads that probably wish you'd stayed where they were. Okay, so let's be honest. I think he's totally wrong. I think you guys are the more of the industry standard of video games. I think we come to you for the, the most inside video games knowledge as well as personality. That's the way I've always looked at you guys. I look at you guys as sort of the probably the best editorial voice for video games that you can have",
            "start": 172.94
        },
        {
            "text": "video games knowledge as well as personality. That's the way I've always looked at you guys. I look at you guys as sort of the probably the best editorial voice for video games that you can have in the Let's Play Family. But again, lots and lots of personality, which I appreciate because, you know, a lot of the times if you're at an IGN or if you're at a GameSpot or whatever, you sort of have to tone it down a little bit. And you guys are not to do that because you're your own group and that's the way I've looked at it. I think there's the, the amount of video game knowledge in this room blows my mind. So that's why I've always looked at you guys that way. Thank you. He says what? He's right. He's right. He was wrong about Dunkirk. All right, but what's the next group? Cow Chop. You used to be part of The Creatures, broke off through and now they don't know any of their names. Nice. And I'm scared of them. Okay, all right. So what they do, look like the rough, it may look like the biker gang from Sons of",
            "start": 217.19
        },
        {
            "text": "of The Creatures, broke off through and now they don't know any of their names. Nice. And I'm scared of them. Okay, all right. So what they do, look like the rough, it may look like the biker gang from Sons of Anarchy. When we see them, we're like, they are talking. I throw some in the air like they could steal Cool Greg at any moment. Their tough guys would love to have Cool Greg. They are the, they are the live-action, they're the Jackass. They have the looks like, um, 100-day play video games. They're very, very funny. Alex and James are inbred, are just like funny, funny dudes. But they're fantastic at the live stunts. They're fantastic at the stuff that like, you're just like, oh, like it's really crazy. You saw Jackass 2 and then you'd see another Jackass, not that was even **** crazier. Cow Chop's really good at that. Okay, they're really, really good at that stuff. So, and also like Nick's nightmare, it probably, you know, I'm very paranoid and I know I'm a liability insurance and I don't like people. I don't like pranks 'cause",
            "start": 257.27
        },
        {
            "text": "they're really, really good at that stuff. So, and also like Nick's nightmare, it probably, you know, I'm very paranoid and I know I'm a liability insurance and I don't like people. I don't like pranks 'cause I feel like that they're just inherently negative. They're not necessarily pranks and that it's just like Jackass where they prank each other. Yeah, so they're not pranking like in a second. Yeah, I know. I just like that, like that environment is always just kind of toxic. Like it or, or you can't spin it for Nick because I had this great idea for a prank. Okay, right? But it wouldn't happen. But it would be that if we got a car dealership or a car sponsor, we had a new car, we're gonna give it to Nick. What I wanted to do was we drive two different cars to Outback Steakhouse for lunch one day and we have cameras set up, of course. And we get there and then as soon as Nick shuts his door, unlocks it, I just throw a brick through his windshield. I told him this. He's like, I wouldn't like that. Cow Chop would do",
            "start": 299.36
        },
        {
            "text": "set up, of course. And we get there and then as soon as Nick shuts his door, unlocks it, I just throw a brick through his windshield. I told him this. He's like, I wouldn't like that. Cow Chop would do that. But then they light it on fire. Yeah. And then at the end, be like, we got you a new car. And they roll it up and it would be even worse than the car that they just, yeah. Also, they're much nicer and much friendlier than you think they are. How are really great dudes? How are really great guys? All right, let's do Sugar Pine 7. Seven of them there. Steven Suptic. There. They drew Elliott Morgan just hangs around for no reason. He's an actor and one of the things. But yeah, sure, whatever. I know Elliott Morgan, right? He hasn't acted a day. I mean, he acts like he likes me every time he sees me. Sugar Pine 7 are like the, the new, new, new indie filmmakers of online media. But they don't call it film anymore because it's film passé. We don't really",
            "start": 337.61
        },
        {
            "text": "acts like he likes me every time he sees me. Sugar Pine 7 are like the, the new, new, new indie filmmakers of online media. But they don't call it film anymore because it's film passé. We don't really know, you know, we don't want to offend people by calling it. And we don't film things, we tape it. I don't know. This tape weird. That should go. Sugar Pine 7 and they're funniest. Sugar Pine. No, but I always get what's this? His name, Ron Steven Cube. You got it actually all the time because you got, you told me, isn't it his, his real name starts with C? If that's Clayton. Yeah, Kev, I think you got the closest there. I'm Sugar Pine, I think so. They're, they're turning into what they're doing is like they're changing the way vlogs work. I think they're training on a sign of it. And like we've seen it a lot done with Arrested Development. And after watching Nathan for You, Nathan Fielder's another really good example of kind of what they do. But they're, they're unfortunately, guys, they're gonna, they're the future of what",
            "start": 383.99
        },
        {
            "text": "Arrested Development. And after watching Nathan for You, Nathan Fielder's another really good example of kind of what they do. But they're, they're unfortunately, guys, they're gonna, they're the future of what we're doing. So I don't know if they're better than us yet, but they're gonna get there. I've seen approximately ten minutes of their work and I was like, after first, really all the first thirty seconds after, I mean, cold cumulative, 'cause I don't watch things. I don't watch them anyway. And I've seen thirty sec, I saw Tim was like, Nicky, you can watch this. And he has to tell me like five, six times before I finally give in my ego and go watch it. And that's, I know it's gonna be better than me. And I watched 30 seconds. I was like, yeah, these guys are **** way better than I am. They're way better. So one thing that they, so **** something that a lot of people don't realize that they have on us is that their content is all very, very short and bite-size and easy to watch. It's like five to seven minutes. And that's",
            "start": 429.29
        },
        {
            "text": "so **** something that a lot of people don't realize that they have on us is that their content is all very, very short and bite-size and easy to watch. It's like five to seven minutes. And that's something that I always wanted to do with Inside Gaming. We first started was like, we make our videos three and a half minutes and we just boil it down to the funniest possible thing. So like really easy to watch. Really, really on a real note, geez, do you say they're the future? But YouTube speaks to the opposite of that, right? Where YouTube is trying to incentivize people to make longer to perform content. And Morgan's like that. But they want Sugar Pine 7 quality. Yeah, they do. You want that? Oh, that's interesting. That's true. So you're saying if they can find a way to make a twenty to thirty minutes show like that, you can they be incentivized by YouTube like that? That will be something YouTube Red was potentially be looking for, which is kind of like The Woods, which is what they did with their school.",
            "start": 465.32
        },
        {
            "text": "like that, you can they be incentivized by YouTube like that? That will be something YouTube Red was potentially be looking for, which is kind of like The Woods, which is what they did with their school. So yeah, so like, I don't know, they're, uh, they and they're also fantastic guys. They're, they're all on Adderall all the time. So remember that when you go, they're always constantly in everybody's improv thing all the time. They do. Oh, let's just talk about something for a second. Yeah, Tim and Andy were worried that Kevin and I would, one of us would die if we came together. They said that you guys are either gonna love each other or try to one-up each other so much that each other or just someone's going through a plate-glass window. And it's good like to tell people in all honesty, we had a lovely time and each other. We got to know each other. We bonded. They're great. He was great. I just feel like they didn't bring swim trunks over. They came in their underwear. I know about what that line of his penis",
            "start": 497.87
        },
        {
            "text": "and each other. We got to know each other. We bonded. They're great. He was great. I just feel like they didn't bring swim trunks over. They came in their underwear. I know about what that line of his penis looks like. And James, guys, you can say that. All right, how about Achievement Hunter? Oh, Michael Jones and friend are **** crazy. They're just crazy. Staple of the first time we did a Let's Play with them. They're the most intimidating group to do Let's Plays with. Not because they're like, like mean or intimidating like personality-wise. It's just they have such a good rapport with each other that it's like trying to cross a **** freeway like with cars going on miles an hour. I don't know how to get in this. And you know, like Greg is great because Greg is just a **** Mack truck that's going to. But those guys are, I mean, that's, they just had, they're on a different level, man. They got, they have an energy that's **** like forged in the heart of a dying star. They're the pillar of Let's Play. Like I",
            "start": 537.26
        },
        {
            "text": "those guys are, I mean, that's, they just had, they're on a different level, man. They got, they have an energy that's **** like forged in the heart of a dying star. They're the pillar of Let's Play. Like I call them the Godfathers. They're there, they're the ones that kind of started this whole deal. So it's, it's like, it's always the utmost respect, the foresight to actually get Let's Play. Yes. Yeah, come on. Well, that's ridiculous. All right, they started the start of the genre really. Yes, they, they're the Godfathers. And that's the way I see them. And then Funhaus. Oh, Funhaus. Those guys do a lot of cocaine. Just a lot of cocaine. We don't do any cocaine. No, it's doing. Who am I thinking of? You guys are to me like, I think we've hung out with you aside from the Achievement Hunter guys. We probably spent most of my time with you guys, right? Probably. I'm blown away about your guys like your chops as far as comedic timing goes. And I gave that, I talked to James and Elyse when I was down there Let's Play Live. I'm",
            "start": 589.49
        },
        {
            "text": "my time with you guys, right? Probably. I'm blown away about your guys like your chops as far as comedic timing goes. And I gave that, I talked to James and Elyse when I was down there Let's Play Live. I was like, dude, the stuff that you guys do is so **** fun and cool. And like when you show news, like you showed the show, the, yeah, yeah. And you showed the new episode of The Panel. And I was like, oh God, they're gonna show a video. And within five seconds, I was like, this is really **** funny. Okay, you guys have such a good improv style that I think that I think as much as Steven's content is the future, I think what you guys are doing is on another level too. I think what you guys are doing is the future of online media because you're, you're using the medium in its to its best possible outcome, right? Thank you. You, you not to suck my dick anymore. I really appreciate that. That's very, very nice. First time I never haven't suck anyone's dick. Scarpino doesn't have to. He just does. He loves it about Game",
            "start": 641.0
        },
        {
            "text": "thank you. You, you not to suck my dick anymore. I really appreciate that. That's very, very nice. First time I never haven't suck anyone's dick. Scarpino doesn't have to. He just does. He loves it about Game Attack. Who was waiting all **** time? Yeah, Kraken. A lot of panels. There's a feud. That's the joke if you didn't know. Game Attack. No, you can move on. I just want somebody out there's like, man, they really hate Game Attack. No, Kraken. I know the least about, but we spent some time. He's **** cool guy. Stole shoes and that's **** out. Is true. Give them back. But Jon Risinger, really, really smart. Very smart. Talk to about like business stuff, right? He's very, very smart. And then the rest of the Let's Play Family. There is JT Machinima and NoahJ456. What music? You know, and also extremely talented. Those guys are very, very talented. I don't know enough about them. We're gonna collaborate with them soon too. And then NoahJ456 is just like blowing up. Like, yeah, he's **** huge and he has been in love the last couple of",
            "start": 680.84
        },
        {
            "text": "very talented. I don't know enough about them. We're gonna collaborate with them soon too. And then NoahJ456 is just like blowing up. Like, yeah, he's **** huge and he has been in love the last couple of years. You just, he's nailed his audience and just, he's just growing it like amazing. He's a, again, a really, really smart dude. It's like, what, 100 years old? ****, I know, right? He's landed in Let's Play. Oh, and then there's Landon. Yeah, LazarBeam. Yeah, he's great. He's fun. I like him. He's really great. He's alone in my battery for his phone to charge off of it events. And then I gotta walk around 'cause it's always a parties and we're both drunk. I'm like, don't **** leave with that. I won't, mate. I don't, I can't do 'cause I don't know. I don't know if you can think so fast to do this. My best. But if you had to like, all of this goes under, you had to create one supergroup that you think their chemistry would be awesome between all the different people in the rooms. Interesting. What would be the like",
            "start": 741.35
        },
        {
            "text": "had to like, all of this goes under, you had to create one supergroup that you think their chemistry would be awesome between all the different people in the rooms. Interesting. What would be the like Avengers? Let's leave it as supergroup. Maybe just like, who do you, if we, if we all came together and were like, cool, we're all gonna make content together, who do you groups where who goes where? Well, I mean, like, clearly I'm an all-star. So here's what I, here's what I would love to do. And when I'm sure that Lewis has talked about this too, is it, we put like everybody moves to Los Angeles. I know you guys, women. Yes, everybody moves to Los Angeles. We get a giant building and then we basically, we block off parts of, parts of this building. We all get to make our own content. But then we're all within striking distance. I mean, that'd be awesome. So that may be so fun. And it would be, it would be great because then if like, for example, you went out of town, then it was like, hey, we need Bruce over there and fill",
            "start": 783.83
        },
        {
            "text": "distance. I mean, that'd be awesome. So that may be so fun. And it would be, it would be great because then if like, for example, you went out of town, then it was like, hey, we need Bruce over there and fill in for Nick or Greg comes and fills in for Adam or whatever else. It would be, it would be fantastic. I think breaking off people into that building, you do, you do Cow Chop and Achievement Hunter kind of close to each other. Hmm. I think you probably do, let's say, I'd say Funhaus and Kinda Funny. Yeah, yeah. Gaming, IGN. Like there's like a thousand Kinda Funny. And then you'd like have Sugar Pine outside. Sugar Pine, Kraken, NoahJ456 and LazarBeam. Those guys are all sort of in the middle of the building because I just, I don't know. I think it would be like, you, you push the older guys out and you put the, the younger guys in, in the middle there and playpen. It would be **** awesome. It would be so **** fun. Can we do floors instead though? And they have a fire pole. Yes. Like, oh, we got to come out",
            "start": 824.2
        },
        {
            "text": "the, the younger guys in, in the middle there and playpen. It would be **** awesome. It would be so **** fun. Can we do floors instead though? And they have a fire pole. Yes. Like, oh, we got to come out of the Funhaus floor. Yeah, I'm that **** pole cam. You know, it's all about me. You know what those conveyor belts like to have a skiing, you know, ski slope for you. Just like you grab onto it. It just kind of pulls you up. I'm not gonna, I mean, I know like, like a hook, you just ski on some ski slopes. Like they don't have lifts. Like you don't have to go all if it's a, if it's a shorter jaunt. Yeah, down the hill. You just be kind of ski up to it and you can like hold on to the thing. Oh my dear, I don't hurt myself. Um, before we go, Nick, at the beginning of the show, before we went live, you have said you got in an altercation at the car wash. I want to hear the story real quick before we sign off. Do we do all the topics? I go to the same car wash every time, right? Vista Car Wash over there under Vista Car Wash at",
            "start": 869.92
        },
        {
            "text": "at the car wash. I want to hear the story real quick before we sign off. Do we do all the topics? I go to the same car wash every time, right? Vista Car Wash over there under Vista Car Wash at the end, right? What up, Sal? Give us some more coupons. You know, so I go there, but it's abnormally hot. And so there's only, there's a big awning, like a big over, I don't the **** they call it, relief, whatever, where you could park your car and it's like shady, right? So obviously they're trying to get all the cars into that because they don't want the people working there to have to work out in the beating sun. I get that blacktop. It's, it's hot as ****, right? So they parked my car in a way that they've never parked it before. Usually they park it going like this way, but they parked it going horizontal or perpendicular rather to where they normally park it. I'm like, all right, cool. So I get my car back. Everything looks great, right? But I'm thinking that I look forward. There's a car parked this way. My",
            "start": 916.81
        },
        {
            "text": "or perpendicular rather to where they normally park it. I'm like, all right, cool. So I get my car back. Everything looks great, right? But I'm thinking that I look forward. There's a car parked this way. My car's parked perpendicular to it. Then there's one that they pulled up right behind me. So I'm like, I can't get around them. And I've never gone out that way anyway. I know the exit that I usually use is this way because that's the normal flow, right? So I start to pull my car out. Someone slams on my window and he's like, you can't go that way. All the cars are parked this way for a reason. And I'm like, okay, but normally. And that's it was the, it was the inclusion of the word normally that got me into an argument with this gentleman because he was like, he, he literally went, I'm like, I'm sorry. I'm normally used to pulling out that way. I didn't say it that nice. And he goes, yeah, but we parked the cars this way for a reason. And I'm like, well, how the **** am I supposed to know that? I thought you just put",
            "start": 962.95
        },
        {
            "text": "used to pulling out that way. I didn't say it that nice. And he goes, yeah, but we parked the cars this way for a reason. And I'm like, well, how the **** am I supposed to know that? I thought you just put all the cars in there because you didn't want your people working in the sun. And he goes, fine, then you can pull it out that way if you want. And I'm like, well, then I will. And then I continue to argue with myself in the car as I was making the world's big at like 50 point turn, right? And then I pulled that and almost hit a double-decker bus. Where the double-decker bus came from, I don't know, because this is not the neighborhood the tourists go to. You know, stupid. We know, we know. And I was just like, hey, he just kind of threw a little bit of attitude at me. And I was like, I wasn't ready for that. I'm sorry. But the car wash, you know, I got Joey knows I go to the car wash like this. It, oh, I like to sit down and read on my small phone the news. Okay, okay, okay. Talk about it. So, you know, if he's listening, I",
            "start": 1002.85
        },
        {
            "text": "I'm sorry. But the car wash, you know, I got Joey knows I go to the car wash like this. It, oh, I like to sit down and read on my small phone the news. Okay, okay, okay. Talk about it. So, you know, if he's listening, I apologize if I hit you with attitude, but you got me first, dog. You got me first. If you didn't know, ladies and gentlemen, this has been The GameOverGreggy Show. Each and every week, four, sometimes five, best friends gather on this table, each bringing a random topic of discussion for your amusement. If you like that, head over to Patreon.com/KindaFunny where a couple of bucks get you each and every episode early and get you a bunch of other exclusive perks and goodies. What are your belly meets your pants? It's not sopping wet like mine. It's, I'm just, I'm holding in my back. That's where the wet is. The sweat is just saturated. Yeah, the behind the knees. I got the damp knees. You never get that thing. I'm getting the beefy smell. I'm getting that like beefy Enchirito right now. If you got no bucks, drops away.",
            "start": 1041.7
        },
        {
            "text": "is just saturated yeah the behind the knees I got the damp knees you never get that thing I'm getting the beefy smell I'm getting that like beefy enchirito right now if you got no bucks drops away no big deal you can go to youtube.com slash Kinda Funny day-by-day topic by topic the entire show post until it goes up is one big video in mp3 the following Friday Bruce thank you for hanging out this for so long this has been fantastic we got to come down and see you know anytime always everybody check out Funhaus but not more than check us out and then bring their people back here to absolutely just watch both exactly yeah we usually say that on your shows about ladies and gentlemen it's been our pleasure to serve you thanks for watching The GameOverGreggy Show everybody click here to subscribe to us click here to subscribe to us on Patreon this one is for YouTube sorry it's cut the YouTube won't cost you nothing you're already on YouTube you probably have a YouTube account just",
            "start": 1084.75
        },
        {
            "text": "subscribe to us click here to subscribe to us on Patreon this one is for YouTube sorry it's cut the YouTube won't cost you nothing you're already on YouTube you probably have a YouTube account just click the freaking subscribe button for us will ya or you know what's gonna happen I'm gonna come over there in these pants and kick your ass that's right I know they're not my normal jeans cuz I couldn't find my normal jeans but again another one of our sponsors which I won't name cuz they didn't pay for this did it it was Stitch Fix again I pay for them out of pocket to getting here's the thing Kevin all right I'll let you know here's the thing Kevin people all oh man ads are bad sure that's gonna be annoying but alright our ads helpful helpful to me cuz I keep using all the Prophecy Movement sunglasses I'm like yeah these things are great Jenna wants a pair now well yeah no no well I couldn't use it first the Blue Apron one good for your first meal so I'm already I'm paying out of my",
            "start": 1132.45
        },
        {
            "text": "sunglasses I'm like yeah these things are great Jenna wants a pair now well yeah no no well I couldn't use it first the Blue Apron one good for your first meal so I'm already I'm paying out of my pocket not for that one Stitch Fix I think good for my first order paying out-of-pocket for that one now when I said when I get Jen's glasses yeah I'm gonna use that for Movement glasses yeah okay Oh click here for other **** I don't know",
            "start": 1169.23
        }
    ]
}