{
    "id": 3186,
    "video_id": "D6J9fQ6lM7w",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "PUBG Goes Mobile - Kinda Funny Games Daily 11.28.17",
    "description": "Tim and Greg talk about what PUBG coming to mobile devices means for gaming.\n\nThanks to Leesa for sponsoring this episode. Go to https://Leesa.com/KindaFunny and use promo code: KindaFunny and get $100 off\n\nThanks to Omaha Steaks for sponsoring this episode. Go to https://OmahaSteaks.com and use promo code: KFGAMES in the search bar, and get a 75% saving\n\n00:01:40 - Housekeeping\nGo Vote for Andre\nNidhogg 2 Party Mode:  https://www.youtube.com/watch?v=gNojg3VqEXQ\nPSX is NEXT WEEK!\nThe Roper Report   -\n00:05:20 - PUBG Goes Mobile, via Polygon\n00:18:00 - Square on Tomb Raider, Deus Ex, via GamesIndustry.biz\n00:27:45 - The official list of upcoming games\n Reader mail   -\n00:34:25 - How long will the current console generation last? - Diego\n00:49:32 - Thoughts on Net Neutrality - JaredTheBankGuard\n00:54:53 - Squad Up: Kaz Risk - kazrisk(Blizzard Battle.net)\n00:55:43 - One of them rotatin’ segments\n00:56:54- You‘re Wrong\nTomorrow’s host: Whitta Wednesday!\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1511906840,
    "duration": 3634,
    "transcript_chunks": [
        {
            "text": "what's up everybody welcome to Kinda Funny Games Daily for Tuesday, November 28th, 2017. I'm one of your hosts, Greg Miller, alongside the pure one, Tim Gettys **** demos. How are you doing? I'm good. How are you? Good. You ready to talk about some video game? I am. Haven't talked about video games for a while. Yeah, you're real rusty. You know, I got like a week and a half out. That's no good. Don't do that. You can't live that life. Did you play anything over break? I played a lot more Mario Odyssey. I think that's it. I don't know that I know I didn't get a no, no, be very behind. Yeah, I mean, Tim and Nick can only hold yours. Also, has left you behind for sure. You already, you know, you don't even get some of the references I tossed. I want to talk about my Leaf Tickets. Yeah, you can't understand what anyone's saying anymore, and I feel sorry for you, frankly. Yeah, yeah, if you gentlemen, this is Kinda Funny Games Daily each and every week. Then a variety of platforms, we run you through the nerdy",
            "start": 0.0
        },
        {
            "text": "what anyone's saying anymore, and I feel sorry for you, frankly. Yeah, yeah, if you gentlemen, this is Kinda Funny Games Daily each and every week. Then a variety of platforms, we run you through the nerdy video game news you need to know about. If you like that be part of the show, go to KindaFunny.com/KFGDD. Give us your questions, your bad usernames, everything else. Then watch the show live on Twitch.tv/KindaFunnyGames. If you're watching live, you have one job, and that's to keep us honest for everyone watching later on YouTube.com/KindaFunnyGames and podcast services around the globe. You live viewers need to go to KindaFunny.com/You'reWrong. Tell us what we screw up, just the facts, ma'am, as we screw them up. That way we can set the record straight. Everybody, it's the polished podcast, and we have a good old time. Tim, yes, got some housekeeping for you. Of course, Game Awards, yes, about a week away. It's time to vote for Andrea Rene. Everybody go to Google right now as we",
            "start": 48.29
        },
        {
            "text": "podcast, and we have a good old time. Tim, yes, got some housekeeping for you. Of course, Game Awards, yes, about a week away. It's time to vote for Andrea Rene. Everybody go to Google right now as we tell you to go every day. Google search bar, trending gamer, trending gamer vote. It pops up right there. It looks like that. You click on Andrea's face, you click Submit vote, and you did your good deed for the day. We're gonna win this for Andrea, like we want, or you want it for me back in the day. Hell yeah, that big deal. She deserves it. Let's get it. Secondly, that Nidhogg 2 Let's Play still up on YouTube.com/KindaFunnyGames. It is a party mode. It is hilarious. It went up during break, and I don't think enough people saw it. So that's it going out of my way. There's a lot of really good party modes recently that I feel like just got lost in the shuffle, just too much it being and all that stuff. Yes, giving the holiday Smash Bros. one was also very good. Sure, but need how to better they talk to that's",
            "start": 93.74
        },
        {
            "text": "that I feel like just got lost in the shuffle, just too much it being and all that stuff. Yes, giving the holiday Smash Bros. one was also very good. Sure, but need how to better they talk to that's what I'm saying, Greg. They're saying that I'm just getting out there saying that right there. Of course, tomorrow they'll be a new one up on Patreon.com/KindaFunnyGames. If you want to go there and give us a buck, you could see it early. And if you say, I'll never watch the content early, I say, maybe just give us the buck if you like what we do. Really helps the business, you know what I mean? It's Arena Gods. It's Arena Gods in tomorrow. Laughing, laughing, laughing so loud and for so long. We're in the background. I'm like, there's nothing that could possibly be that funny for that long. Yeah, that would just make Kevin like Kevin sounded like a broken Tickle Me Elmo. Yeah, it was, it was kind of scary. He's gonna watch it again right now and start like everything's getting excited about it. Next week is also",
            "start": 133.88
        },
        {
            "text": "make Kevin like Kevin sounded like a broken Tickle Me Elmo. Yeah, it was, it was kind of scary. He's gonna watch it again right now and start like everything's getting excited about it. Next week is also PSX, if you can believe it. The details are up on all the social platforms for Kinda Funny Games in terms of what we'll be doing there. I, Greg Miller, am hosting panels. I, Greg Miller, cannot tell you about them still. I will be able to tell you about them at some point, hopefully the next couple days. You expect it for sure though. I can tell you Sunday is our fertility meet-and-greet in Buena Park. Make sure you come to that if you're at PSX. But more importantly, Monday is the first ever Kinda Funny Community meetup Christmas party that we're all doing in San Diego with Polite Provisions. Everybody bring an ugly Christmas sweater, bring a white elephant gift exchange. Come there, drink some great cocktails with Erik Astra. If you're going to PSX San Diego, just an hour and a half away by going that's",
            "start": 173.93
        },
        {
            "text": "an ugly Christmas sweater, bring a white elephant gift exchange. Come there, drink some great cocktails with Erik Astra. If you're going to PSX San Diego, just an hour and a half away by going that's what Joey and I are doing and Jen. We're gonna drive down there, do it, hang out on Monday, some one day afternoon. Come out and do that with us. But there you go, great. I have some, some feedback about this show. Okay, specifically about your, your intro rigmarole. I've thought about it many times as you've done it, but I never want to interrupt you when you're in your flow. But right now I had a good moment, so I'm going to interject. You say that the people need to keep us honest and go to KindaFunny.com/You'reWrong, so it can be a more polished podcast for the YouTube and audio listeners. But it's also a more polished podcast for the live listeners as well. Sure, like it's a weird thing, but what I like to do there is that I then call out the fact that we has available or no podcast service",
            "start": 212.15
        },
        {
            "text": "it's also a more polished podcast for the live listeners as well. Sure, like it's a weird thing, but what I like to do there is that I then call out the fact that we has available or no podcast service. Okay, good. You know, I'm cool. I, and if that's the case, which I had a sneaking suspicion at why, sure, I commend you on your pimping ability. Well, I try to get all the information in there without it just, you can get it here, get here, get here. Yeah, you know, I want to make sure you understand there's different leveling zones. There's levels to this ****. There's lots of Kinda Funny Games Daily. Alright, thank you. No problem. No, I appreciate your contributions. Thank you. Aww, look at that. Well, it's, he's still thankful, you know, it's the effort. Thanks, guys. No, and I found piece of housekeeping to tell you that this episode is sponsored by Leesa and Omaha Steaks. But I'll tell you about those deals later on in the show. For now, let's begin the show with what is and forever will be the Roper Report. Two items on",
            "start": 249.74
        },
        {
            "text": "this episode is sponsored by Leesa and Omaha Steaks. But I'll tell you about those deals later on in the show. For now, let's begin the show with what is and forever will be the Roper Report. Two items on the Roper Report. Very pathetic. I don't want me to do. I can't. I'm not gonna make the news happen. Quick thing. I, I don't actually mean it. The kids, they just want me to mix it up sometimes. So I got, I gotta go with something else next. Number one on the Roper Report, PUBG is apparently going mobile. This is via Polygon. Why not a mobile version of PlayerUnknown's Battlegrounds is in development. Tencent announced this week the mega publisher is working with developer Bluehole to port the Windows PC hit to smartphones for Chinese audiences. Tencent promises a similar PUBG experience on mobile as on PC, although it remains to be seen how the company will translate the shooter to a smaller screen. Parentheses, there are plenty of Battle Royale style games already on mobile that may give fans",
            "start": 287.57
        },
        {
            "text": "as on PC, although it remains to be seen how the company will translate the shooter to a smaller screen. Parentheses, there are plenty of Battle Royale style games already on mobile that may give fans an idea of what to expect, at least in parentheses. The game is currently planned to launch in China first, although Tencent neither gave the release date nor detailed plans to expand to its other markets. But as the company pointed out in its Chinese language press release, PUBG has sold more than 20 million copies worldwide. So we'd expect a Western release at some point. How you feel about that one, Tim? Man, this is Tencent, Tencent, Tencent. I don't know, is it? That's, I heard it pronounced. I'm fairly. It just, it's interesting because as somebody from America that understands American companies to an extent, and even how America deals with like Japanese companies with video games and all that, it's China is something that you rarely hear about. I think it's because a lot of times they don't play",
            "start": 335.33
        },
        {
            "text": "an extent and even how America deals with like Japanese companies with video games and all that. It's China is something that you rarely hear about. I think it's because a lot of times they don't play nice. They're very insular. They have their own things going. So it's like Facebook and all that not really over there. So they have to have their own kind of systems and social, social sharing and all that stuff. Tencent apparently grown over there, and I hadn't heard anything about it. Then sounds like, oh, they own Riot Games. Yeah, they got stakes in a holding station in Activision Blizzard. And we want to say Epic Games. Kind of fun that you're, well, they do. And it's like when you add all that upside, holy ****, that's huge. And then they're just only Riot alone. That's really crazy. And then for them to be with now PUBG, this game that is selling gangbusters day after day, like not slowing down at all, bringing it to mobile platform that has so many available units out there. It's, this is pretty nuts. And I mean,",
            "start": 380.45
        },
        {
            "text": "PUBG, this game that is selling gangbusters day after day, like not slowing down at all, bringing it to mobile platform that has so many available units out there. It's, this is pretty nuts. And I mean, it's like inconsequential, I think, in terms of the from the gameplay perspective. Like why, I don't think that people is seeing the show are going to be affected in a way that they're not gonna play it. They're not like this, this doesn't matter to these people. I don't think. You do think so? No, you only when this comes, PUBG on mobile, people are gonna play it. Mmm, namely no ****. I think PUBG, I mean, if people can't play simple platformers on their phone without complaining, they're not gonna be able to play a proper mouse and keyboard game without complaining. Sure. And the exact same PUBG. Exactly. The Polygon article in that parenthesis I read right there, are plenty of Battle Royale style games already on mobile. That's a hyperlink showing they've written about it. And I think those are things that",
            "start": 421.73
        },
        {
            "text": "Polygon article in that parenthesis I read right there, are plenty of Battle Royale style games already on mobile. That's a hyperlink showing they've written about it. And I think those are things that let me know if I'm wrong. These audiences, these are like their what people think of when they think mobile games, right? When the time of these other Battle Royale games taking something like PUBG, an IP that people understand what that is, and mobile-ifying it, I think it's great for the people that want those games, and more power to them. But I think it's gonna make a ton of money, and I think it's gonna be super successful for Tencent. But I just think that this is like, so we always talk about the industry as it is, and then there's all these weird splinters we don't really know about because it's not our, not our, what's our neck of the woods, not our ecosystem. No, yeah, and I think that this, this is just an example of mobile games, and like esports is one of those branches, right? And then it's",
            "start": 467.06
        },
        {
            "text": "it's not our, not our what's our neck of the woods, not our ecosystem. No, yeah, and I think that this, this is just an example of mobile games, and like esports is one of those branches, right? And then it's just like, just MOBAs in general is another. And then there's things like mobile games that millions of people are playing and millions of people are paying for, but not us. So here's my thought. Um, this one is that I see, I understand what you're saying, and I think in a traditional sense, you're correct. I think the PUBG license in name, fact that Bluehole's involved in that, you know, Brendan Greene left something to say when they put this out. I feel this could be the game that converts 1% or whatever, 0.05% of PUBG players to actually stick around and play it. I think when it comes out, it will be, oh, ****. Like, I mean, look at Animal Crossing, right? Animal Crossing on mobile, all like, you know, Hamza put out a great tweet today. It was like, Hamza, you're playing that Animal",
            "start": 506.84
        },
        {
            "text": "out, it will be, oh, ****. Like, I mean, look at Animal Crossing, right? Animal Crossing on mobile, all like, you know, Hamza put out a great tweet today. It was like, Hamza, you're playing that Animal Crossing game, right? And her responsive, yeah, I love it. And then the person in her hit fictional conversation, is it good? And her going, no. Like, it, we're all playing it. Not all, you're not, but like a lot of us in this room are playing that game and enjoying it, even though it's just task management. It's not like a real Animal Crossing in quotes. I feel like this is the same thing where curiosity is gonna get you if it's a free-to-play PUBG on mobile that comes out. Yeah, it's not gonna be PUBG that you know from the PC or that you know from the Xbox One, or it's gonna be a modified, boil down, whatever you want to call it, not really pink, but a different version of PUBG. But I think there's a chance enough I'm gonna download to see what I feel like Animal Crossing isn't an apt comparison here. I think",
            "start": 552.05
        },
        {
            "text": "want to call it, not really pink, but a different version of PUBG. But I think there's a chance enough I'm gonna download to see what I feel like Animal Crossing isn't an apt comparison here. I think it's more similar to Super Mario Run situation where it's like there's an IP that you know and love, and everyone understands what that means. Let's again, mobile-ify it. Yeah, and take that idea and make it work with using touchscreens and all that. And it didn't work to the extent that the one on time out the people listening wanted to. And I think this is an example that will go down that route. Animal Crossing is a totally different beast. Animal Crossing is, it's a time waster, you know, it's not a video game in the traditional sense. Sure. My thought process would be, I don't see it being, I don't think PUBG at the moment has the cachet, the nostalgia, the history that Mario has, that you know what a Mario is supposed to play like, supposed to feel like. I feel like they can give you PUBG and like",
            "start": 594.38
        },
        {
            "text": "PUBG at the moment has the cachet, the nostalgia, the history that Mario has, that you know what a Mario is supposed to play like, supposed to feel like. I feel like they can give you PUBG and like, cool, you're getting paired in after a thirty second load each time to a match of 15 players. Matches only go for two minutes. You already start with all your weapons, run around and kill each other. Yeah, I don't, I don't think that's gonna be awesome. And I think it's gonna speak to people on the level PUBG did. But I do think it's something people would download. You'd lose 90, 95, 98 percent of your players that downloaded that hardcore gamers. And then there is this percentile that's gonna be like, well, whatever, I got to Mr. Killa on this bus ride. Well, there's already all those games, the, the Tencent games that are the, I don't know the exact names, but like the call of ward share booty at tanks in your total, ya know. And those look like colorful experiences, and they are shooters, and we don't give a",
            "start": 637.28
        },
        {
            "text": "games that are the, I don't know the exact names, but like the call of ward share booty at tanks in your total, ya know. And those look like colorful experiences, and they are shooters, and we don't give a **** about them, right? Play them at all. I think that's why this is a gateway Trojan horse to get people that actually in the door to actually download it. You're a thousand percent right. I see Game of War ads all the time during football or whatever, and you don't ever eat. You're like, well, what a shitty **** name. What a cheap grab, blah, blah, blah, blah. You're just trying to get mainstream people confused when they go to the App Store. I think this actually works the opposite of it. It's like, oh, well, hey, we're talking about a mobile game on this show, which is rare because it's PUBG. And when again, when the first preview is available for IGN or GameSpot, or ever, we're gonna read and look at those videos and think about, yeah, I mean, you're right in that there is a cachet to that name. I just",
            "start": 676.18
        },
        {
            "text": "again when the first preview is available for IGN or GameSpot, or ever, we're gonna read and look at those videos and think about, yeah, I mean, you're right in that there is a cachet to that name. I just don't, I can't imagine a way that that experience translates to mobile in any way that's substantial as we worthwhile, Hoss. Yeah, that's not saying it's not gonna sell something to say that people are gonna enjoy it. Millions of people are gonna play this game. Yeah, they're gonna enjoy this game. They're gonna play this game daily. If there's microtransactions in it, they're gonna pay a butt ton of money there. Yeah, it's gonna be such a success. We will never talk about it. We're never gonna see people really actively playing this game after the first week. Okay, that's what I'm saying. Yes, will they ever? A lot of people go, oh, that's interesting. I'm gonna try it out. And then that thing's getting deleted. We'll see. We'll see how it shakes out. For now, Bobby Wasabi writes into KindaFunny.com/KFGDD and says,",
            "start": 715.36
        },
        {
            "text": "PUBG coming to mobile. This news doesn't surprise me too much personally. Though this news coming out just weeks before the release of PUBG on Xbox One makes me hopeful that perhaps a PS4 and more excitingly, a potential Switch version could be possible. What do you think the odds of this a Nintendo Switch version happening are? Good question. Think very slim. Yeah, yeah. I mean, especially right now, Nintendo's online infrastructure is a disaster at best. Once next year, we understand what their paid app looks like and, and all that, that whole system. Yeah, that could change things. I don't know. There's something about games like PUBG where it's strictly online multiplayer. That's all that it is. Yeah, and it'll don't work that way. Sure, sure. And that is true. But I, I, here's, I don't know. I",
            "start": 752.98
        },
        {
            "text": "know there's something about games like PUBG where it's strictly online multiplayer. That's all that it is. Yeah, and it'll don't work that way. Sure, sure. And that is true. But I, I, here's, I don't know. I don't, the Switch, the Switch, like he said, more excitingly, the Switch. I think that's more exciting. I think it's exciting. You don't fit PS4. Yeah, you know, like which will happen. Console that you can have tied with an Ethernet cable that you're playing at home, and that's no problem. Yeah, yeah. It's like the, what could be interesting, I guess, from the Switch is if they did figure out like a LAN local thing where it's you like the two of us could play together on our Switches. I don't know. Yeah, I don't think it's a, I don't think it's that far-fetched. I think you would have asked me this February or March of this year, but you had no **** way, no bubble. But I think the adoption and success so far of Bethesda on the Switch, I think, you know, the fact that they are putting Doom out there, that or Doom is",
            "start": 803.36
        },
        {
            "text": "of this year, but you had no **** way, no bubble. But I think the adoption and success so far of Bethesda on the Switch, I think, you know, the fact that they are putting Doom out there, that or Doom is out and Wolfenstein coming out shows that Nintendo wants it a place for mature games. I think the success of Indies on the platform shows that independent studios like, and I'm roping in Bluehole and PUBG Corp and whatever you want to call it now, and Tencent involvement. I think they that make that looks enticing to them. I do think the wild card is how the **** does online work there. However, a huge part of Rocket League is online, and I don't see people bitching about it. There's a single-player to Rocket League. There's local co-op to Rocket League, all that jazz. That's a good point. But people love playing Rocket League online, right? Yeah, and that's a huge part. And even Minecraft, they love playing online, but they're in completely different experience. Yeah, yeah. The thing with Rocket League is, I",
            "start": 857.3
        },
        {
            "text": "think a lot of that's focused on the 1v1, which we could do one of you one together. That's the appeal of the Switch port for Rocket League on the go. And I think that's an important thing to keep in mind for the Switch for games like this where it is strictly online, and I, it is massively multiplayer. 100 people being dropped in. You know, again, I think you'd maybe see it change. You'd morph this, right? Where it is, it's 50 people. It is this thing. The maps are smaller. I think there's ways to work around it. Or, you know, the big thing with when you hear PUBG's self, Brendan Greene, be interviewed about what's happening with the Xbox version, is ever coming to PlayStation. He's very clear in saying that, you know, we're trying to make the best version this game possible. We're working on the Xbox version.",
            "start": 900.08
        },
        {
            "text": "happening with the Xbox version is ever coming to PlayStation. He's very clear in saying that, you know, we're trying to make the best version this game possible. We're working on the Xbox version. That's where we're at. We're gonna see how much Microsoft will pay us. 1000 ****. Biggest exclusive on Xbox One. We're not gonna **** that up. I don't know. I mean, I'm talking years, mate. You know, late, late next year, you get an announcement, and then maybe it's released in 2020. Like when things have settled down. I mean, 2020, right? My math's not wrong. What year is it out? No, my math's wrong. 2019. Yeah, sorry. I'm living in the future so much. I mean, I got these robots talking to me and setting timers and stuff now. I don't, it feels like I live it in 2026. I would think that would be more likely, but it would be when the team grows and they have these things. And they just, if they're still a gold rush on Switch, if they're still there, I don't think mine looks like, oh, yeah, there's, there's so many questions with the",
            "start": 943.73
        },
        {
            "text": "the team grows and they have these things. And they just, if they're still a gold rush on Switch, if they're still there, I don't think mine looks like, oh, yeah, there's, there's so many questions with the Switch that I think it just makes it a very slim chance of this coming to fruition. I think it coming to mobile doesn't have any effect on it. No, no, no, no, on other systems. Like that's, we've seen that before with other, other games. Like the mobile versions are kind of just like a different beast. And that's the thing. There's making a mobile game from everything I understand is a completely different beast. And it is that there would be another team working on this. It's not the same team that's making PUBG to Xbox One or try. You know, it's funny that Bobby Wasabi brings it up. Xbox One's imminent release. Also the imminent release of V1 of PUBG. The first like officially out of beta. Yeah, for a real game. No, that's, that's interesting. That's exciting. And it's just gonna keep things rolling. I, I",
            "start": 985.52
        },
        {
            "text": "think that the, the conversations more, will it come out on PS4? Will it come out on Switch? I think is like, that's, I, I just think that's pie in the sky, you know, in a way. They're like, gee, there's so many, well, if this, then that, and then if this, then that, and then if this. Like there's so many ifs. Yeah, I don't think we'll get there. Interesting. PS4. Yeah, you assume the rumor was right that an Xbox was trying to get more of, more exclusivity out of them. And there was never any like finish to that rumor. Yeah, and what does that mean? More months? Does that mean they're trying to get it legitimately is an exclusive? Yeah, that is the question is, but Microsoft's eyes are gonna pay a lot of money and get that, or it's gonna be on PlayStation 4. Yeah, one of the other. I mean, well, it's gonna eventually be next year at",
            "start": 1023.14
        },
        {
            "text": "Yeah, that is the question is, but Microsoft's are gonna pay a lot of money and get that or it's gonna be on PlayStation 4. Yeah, one of the other. I mean, well, it's gonna eventually be next year at some point on PlayStation 4. Now, yesterday we gave a pat on the back to GamesIndustry.biz. They had a great Matsuda-san interview up from Square CEO and president of Square. Did you hear this? He was talking yesterday about stuff easier for Final Fantasy. That that wasn't a one-off. I didn't put that on there today. He said 2018 is gonna be a big year for Final Fantasy or somebody did it from Square. I was like, alright, great. That's whatever. That's just PR talk. Guess what everybody, 2018 is gonna be a big year for Kinda Funny. We don't the **** or day one. They don't yesterday were very open, honest about the IO Hitman stuff. I'm like, hey, I loved it. Wasn't turning a profit the way we needed to. We gave it to him because it's not Hitman if it's an IO. Today on GamesIndustry.biz is Matsuda-san",
            "start": 1067.18
        },
        {
            "text": "honest about the IO Hitman stuff. I'm like, hey, I loved it. Wasn't turning a profit the way we needed to. We gave it to him because it's not Hitman if it's an IO. Today on GamesIndustry.biz is Matsuda-san talking more about Tomb Raider and Deus Ex. So here comes a whole bunch of quotes. I'll tell you when I'm switching back over to GamesIndustry.biz. There are actually lots of misunderstandings here, he says. This is him talking about the person they clarifies, like, why didn't I put in the intro here? Let me try again. There are actually lots of misunderstandings here, he says, on the perception that the firm's Western games are struggling. First of all, Tomb Raider is a very important title and very important piece of IP for us and nothing has changed about that. The fiscal year prior to the one where I became president in 2013 was one where overall our earning numbers were not very good. It was immediately before the end of the fiscal year in March that Tomb Raider came out, so we had very high",
            "start": 1107.18
        },
        {
            "text": "I became president in 2013 was one where overall our earning numbers were not very good. It was immediately before the end of the fiscal year in March that Tomb Raider came out, so we had very high expectations for that. Looking back on that now, I think the target we set for ourselves was extremely high. I say this with the benefit of hindsight now, but at the time our numbers leading up to the release of Tomb Raider had been very poor and I think our people were probably banking on that and wondering how much it was going to help our final earnings. In the end, it didn't quite sell as much as we anticipated. Matsuda, and this back to GamesIndustry.biz, Ms. Croft's reboot adventures have certainly delivered strong sales since today. The 2013 Tomb Raider has sold more than 11 million units worldwide. The 2015 sequel, Rise of the Tomb Raider, has shifted nearly 7 million units. And remember that it wasn't available on the market dominating PS4 for a year for the first year. Matsuda is also quick to",
            "start": 1151.97
        },
        {
            "text": "the 2015 sequel, Rise of the Tomb Raider, has shifted nearly 7 million units. And remember that it wasn't available on the market dominating PS4 for a year for the first year. Matsuda is also quick to quash premature reports of Deus Ex's demise. Quote, we have never said anything about discontinuing that title, but for some reason that's the rumor on the market. What I can say is that I, what I can say is Eidos Montreal has always developed Deus Ex, and the issue is we do not have limitless resources. We have several big titles that we work with and that's partly a factor in what our lineup looks like. Of course, it would be ideal if we could work on all of them all the time, but the fact of the matter is some titles have to wait their turn. There it is. Reason there isn't a Deus Ex right now is just a product of our development lineup because there are other titles we are working on. He went on to add, the Deus Ex is also an extreme, a very important franchise for the publisher, highlighting its unique",
            "start": 1194.63
        },
        {
            "text": "of our development lineup because there are other titles we are working on. He went on to add, the Deus Ex is also an extreme, a very important franchise for the publisher, highlighting its unique position in Square Enix's portfolio as a first-person title and added, quote, we are already internally discussing and exploring what we want to do with the next installment of it. It's another, hey, we're giving you actually answers. We're gonna talk about this stuff. I like them. I, you know, I don't think he'd, I don't totally agree with his thing. I've like, I understand we're like this idea that Western IPs are struggling from us. Like, well, no, they're struggling. You came out and said that Tomb Raider needed to like, didn't perform the way you wanted to, even though it's sold great the first time around. You have said that like, alright, Deus Ex is to on hiatus or whatever, being to anything. And everybody just reads into that the fact that the games didn't sell well. Exactly. And then all the Marvel stuff, it's like,",
            "start": 1241.24
        },
        {
            "text": "that like, alright, Deus Ex is to on hiatus or whatever, being to anything. And everybody just reads into that the fact that the games didn't sell well. Exactly. And then all the Marvel stuff, it's like, okay, well, this makes a lot of sense. A quick question here, Shadow of the Tomb Raider, where the hell is that at? Great question. I mean, you figure that the Game Awards, that would make sense. That'd be a good review. Yeah, I just already banging the drum. He's got a lot of stuff up. Is, I feel like it has to be there, but yeah, I'm a little shocked it hasn't been formally announced yet. Yeah, because that was a while ago, right? Yeah, that is that last year, I want to say. It's pretty three. Yeah, that does make sense. Yeah, yeah, feels like forever. It feels like a lifetime ago. Yeah, yeah, yeah, yeah. But Game Awards to be a good, a good one. But then again, maybe yeah, what's confusing about it, right, is that that's the one, help me out, that's the one. So Crystal Dynamics, mmm-hmm, working on Avengers. That's confirmed. That's",
            "start": 1280.39
        },
        {
            "text": "a good, a good one. But then again, maybe yeah, what's confusing about it, right, is that that's the one, help me out, that's the one. So Crystal Dynamics, mmm-hmm, working on Avengers. That's confirmed. That's confirmed. Shadow of the Tomb Raider is supposedly rumored to be Square Enix, no, Eidos Montreal working with Crystal Dynamics, right? Yeah, Crystal. But there's a Deus Ex team, right? And there's a rumor, there's a rumor that the Avengers game is being, is that confirmed that Crystal's working on Avengers, getting help from, there's like some weird, I thought there was two stories, two rumors that it's Crystal is main on one of them, Eidos Montreal's main on the other, but they're both helping each other. Yeah, the other project. Yeah, that's what has been out there. Okay, so yeah, I mean, with with Deus Ex, I think that it's good that they're coming out and saying it's important to them and all this. And it's like, even though it's just lip service anyway, so I think it's important lip service where it's like, hey,",
            "start": 1323.59
        },
        {
            "text": "well, we are giving up on this. It is still a thing. We understand that people enjoy these games, so they sell good enough, you know, not crazy, but good enough. Do you believe it's lip service? Do you believe they actually care about Deus Ex? Do you think they're gonna come back? I do think that they're gonna come back. I'm this, the whole Disney thing, the whole Marvel deals and all this, like that complicates everything because like that, like what they're saying, they do not have limitless resources. That just doesn't exist. You can't like, only so many AAA huge video games can be made because there's only so much talent even out there. There's so much money to be put into them to make them happen. Like it's when there's gonna be Avengers, this, that, and this, and Spider-Man, and all the Marvel games, like those",
            "start": 1376.15
        },
        {
            "text": "so much talent even out there. There's so much money to be put into them to make them happen. Like it's when there's gonna be Avengers, this, that, and this, and Spider-Man, and all the Marvel games, like those need to get made, which means other games aren't gonna get made. Hmm, on that level. And when you look at it, like Deus Ex is a AAA game, at least from development, and they're sure from budget, all of that. And when it doesn't have AAA sales, yeah, of course they're gonna be like, well, we're gonna do this Marvel stuff and go from there and we'll see because I, they'll come back to Deus Ex. Will it be a sequel to the first team? Not. It'll probably be another reboot whenever, smaller-scale. I don't know. And Tomb Raider's the other interesting one where it's like, I feel like Shadow of the Tomb Raider is gonna be make-or-break for the franchise in the sense that will it be regarded like Arkham Origins? Okay. Oh, okay, okay. You're saying because it's not a real one or Crystal Dynamics didn't work on this one",
            "start": 1414.73
        },
        {
            "text": "gonna be make-or-break for the franchise in the sense that will it be regarded like Arkham Origins? Okay. Oh, okay, okay. You're saying because it's not a real one or Crystal Dynamics didn't work on this one full-scale or will it be like, oh, cool, no, there is a future for the Tomb Raider franchise that isn't just kind of like, well, this makes money. So the wild-card in that that you're not, not like you're **** forgetting is the fact that movies coming out. I don't think that's relevant. I mean, the Square has been making shitty movies for years. Rumor is this one might be good though. Who says that? Me. Movie sucked. We all, that's the story every time. That's the best one based on the original game though. So like, that's a good jumping-off part. As long as they don't go to the whole ending with the **** spoilers. Ghost for a night. Come on, what the ****? I know it's got the girl from Ex Machina. It does whatever. The trailer I saw it, I'm like, this looks fun. Yeah, this looks like a Tomb Raider like video",
            "start": 1466.83
        },
        {
            "text": "game. Angelina Jolie ones, of course. Yeah, my thought would just be if that movie even finds a modicum of success, you want to have Tomb Raider a viable franchise still, beginning something in that world to get you going back. I guess my prediction, yeah, that movie's gonna flop. Sure. Yeah, like not just critically, like I don't think it's gonna push the needle in terms of ticket sales and stuff. Remember what it comes out. It's an interesting thing because with yesterday's piece where he's talking very openly about Hitman in IO, it was like, man, this is a really telling, cool, I'm gonna glance behind the curtain. And this one has the same shade of that, but doesn't feel as honest where I read all this and I'm okay, cool. I could totally see them dropping all Western IPs at Crystal Dynamics. So yeah, or",
            "start": 1521.97
        },
        {
            "text": "you know, we're getting rid of. I mean, that's that always was a weird match to me. Like that, I remember when all that was first happening, I said, whoa, wait, Square makes all of these games. Like that's just like, oh, okay, well, I guess they just bought those companies. So it's like, really, it is still Crystal Dynamics. It is still Eidos. Yeah, whatever. But like, the that was always weird. And I feel like it was at a time when Square's properties were at a wall. It was, you know, Final Fantasy XIII. And they, you know, Final Fantasy didn't really have like a good will behind it, sure, in terms of the fans in the audience. And with the newer games, Final Fantasy XIV came out, was like a super big dud. And then it wasn't until Naoki Yoshida came out, people like, oh, ****, Final Fantasy XIV, it's awesome. And we do love this. And XV came",
            "start": 1569.7
        },
        {
            "text": "and with the newer games, Final Fantasy XIV came out, was like a super big dud. And then it wasn't until Naoki Yoshida came out, people like, oh, ****, Final Fantasy XIV, it's awesome. And we do love this. And XV came out and, you know, wasn't perfect, but also was like, oh, ****, this is way better than it could have been after the development cycle. And people been, I think the Final Fantasy has a better feeling about it right now. And we'll see what they do next. And like, the game sold super well. Yeah, so maybe they are gonna look at this and be like, well, we're back. Yeah, you know, and is that a smart decision? Probably not. And their Kingdom Hearts III still coming in, you know, 2018. And we got Final Fantasy VII Remake, maybe 2020. So we can go from there. Kingdom Hearts III, whatever, Tim. Yeah, that's never coming out. Yeah, but if I want to know what came out today to the mom and pop digital shops were today, you can tell we're after Black Friday. Mmm, today you're getting Resident Evil Revelations on Switch. Resident Evil Revelations",
            "start": 1620.34
        },
        {
            "text": "Switch, Black Mirror on Xbox One, Bystander on PC, Star Ocean: The Last Hope on PS4 and PC. And that's it. One of my fingers met from new dates. Try to creep up there. New dates for you. Vostok Inc. is coming to Switch on December 7th. A game I enjoyed quite a bit. I highly recommend you check it out. And here we go, Greg, Gang Beasts is coming to PlayStation 4 December 1st. Are you kidding me? They feel like we did a Let's Play of Gang Beasts on PlayStation 4 in our first year of Kinda Funny. 100% we had off. I mean, this thing's been coming forever. How Tim Schafer, Tim Schafer sits on his golden throne of Double Fine money and decides when he wants to give us a crumb. And apparently he's not gonna hit his fiscal earnings for December. Is unleash the Gang Beasts. He's, he's pretty money button. He's got this",
            "start": 1668.19
        },
        {
            "text": "of Double Fine money and decides when he wants to give us a crumb. And apparently he's not gonna hit his fiscal earnings for December. Is unleash the Gang Beasts. He's, he's pretty money button. He's got this whip and he's hitting Greg Rice and staff and he's like, get the game out now. I'm excited. I can't wait for Gang Beasts on PS4. Isolated at home on that console. Yeah, no, of course, because you know, consoles are great and PCs weird. Ah, there's another one for you too. All the crazy games are hot popping today. Yooka-Laylee is coming to Switch December 14th. Yes. Yeah, are you kidding me? Are you **** kidding me? Yooka-Laylee was like, oh man, I'm excited for this game. A return of 3D platformers that spent so long since we got a good platformer in a while. Oh, and then this, Cuphead and Super Mario Odyssey and Sonic Mania. It's like, okay, well, sorry. Yeah, yeah, you believe your window, Darwin. Sid Meier's Civilization VI: Rise and Fall expansion is gonna be available February 8th, 2018. And then Parkasaurus is coming to stores on",
            "start": 1731.02
        },
        {
            "text": "2018. Miller, tell me what Parkasaurus. The press release reads, has the ultimate dinosaur zoo management game. Parkasaurus takes a fresh approach to park simulation. Parkasaurus challenges the player to plan, design, and construct fabulous exhibits that maximize both the happiness of their dinos and their park's guests satisfaction and willingness to spend money. I do anything for you. No, I don't like those games. It's got a really interesting visual art style. So I got the press release today, put it in there, then went over to IGN when I was gathering news and they had a full-blown preview up of it. I look, oh, looks interesting. Yes, you like those games. You like the SimCity's and the, I do. But this one doesn't look like it's like their home. I can FPS to shooting first-person perspective. You know how",
            "start": 1775.24
        },
        {
            "text": "they do whatever they, you know. Alright, time for Reader Mail, Tim. Mmm-hmm. But first, let me tell you, Reader Mail and Kinda Funny Games Daily is brought to you by Leesa and Omaha Steaks. Let's start with Leesa. Now, I've been saying this for a while. Well, use that. If I'm lying, I'm dying. Go to the mattress store. Sucks. Uh-huh. And I went there with Jen. Maybe wrong. What they made me lie. And they say they put these little weird things on top of our pillows. Yeah, and I don't like that one bit. And then he's like, this guy's asking me my wife how this bed feels. I mean, let's go away, man. And it's like that. And then they, they have these giant jump, let's jump in prices. And you go to the cheap one and that one feels like he's just garbage. You know what that left? Order my mattress online. That's what you do now in",
            "start": 1828.43
        },
        {
            "text": "they, they have these giant jump, let's jump in prices. And you go to the cheap one and that one feels like he's just garbage. You know what that left? Order my mattress online. That's what you do now in 2017. Is you in a box. It's a press you little box. Yeah, you pop it open. Yeah, that's the most exciting part. Joey, was that the most exciting part when you got your Leesa mattress? Do you like your Leesa mattress? I told yesterday, I told a lie on the show that you missed work because the Leesa mattress was so comfortable. You're still sleeping. Joey missed it for other reasons. I don't know why. Anyways, the Leesa mattress is 100% American made and delivered in a compressed box to your door. It is thoughtfully crafted with high quality materials to create what Leesa calls their Universal Adaptive Feel. It's three foam layers provide support, pressure relief, and cooling that adapts to all body shapes, sizes, and sleeping styles. You get a hundred night trial. You don't like it, they come back for it. You get",
            "start": 1870.97
        },
        {
            "text": "three foam layers provide support, pressure relief, and cooling that adapts to all body shapes, sizes, and sleeping styles. You get a hundred night trial. You don't like it, they come back for it. You get your money back. Everybody has fun. Mattresses cost thousands of dollars in the store, but Leesa starts at just five hundred and twenty five bucks. But you can get $100 off by going to Leesa.com/KindaFunny and there the promo code KindaFunny all one word. That's Leesa.com/KindaFunny promo code KindaFunny all one word. Next up, Omaha Steaks. Nick, you like meat? Damn right, you love to meet. You remember Extra Life when I barbecued all that meat? It was from Omaha Steaks. That's what they do. They have these crazy packs. I'm gonna tell you or today about the of how $49.99 can get you the family gift pack when you go to OmahaSteaks.com and there are the code KFGAMES in the search bar. That's 75% off. If I'm minded on again, I've used this code before and I went and bought my",
            "start": 1909.82
        },
        {
            "text": "you the family gift pack when you go to OmahaSteaks.com and there are the code KFGAMES in the search bar. That's 75% off. If I'm minded on again, I've used this code before and I went and bought my dad this. Do you remember this? Yeah, he was it so impressed that my dad, but I don't know my dad well enough to get great gifts. Dad doesn't know me well enough to get Greg gifts. I gave him Omaha Steaks for my birthday. He gave me Omaha Steaks tit-for-tat. That's how it works. You know what I'm saying? Family, Nick, that keeps on giving. Nick, right now, Omaha Steaks is giving you exclusive savings just to you. Listen, everything you're gonna get for that less than fifty dollar price tag. Two filet mignons, two top sirloins, two boneless pork chops, four boneless chicken breasts, four kielbasa sausages, four burgers, four Potatoes Au Gratin, four Caramel Apple Tartlets, one Omaha Steaks seasoning pack, and you get four additional kielbasas, the kielbasas for free. Those were my favorite ones from Extra Life. Kielbasas and",
            "start": 1956.47
        },
        {
            "text": "then remember I made the bagel burgers and those were great. We dropped this information on Anthony yesterday. He called it a game-changer. We agreed. Go to OmahaSteaks.com and enter the code KFGAMES all one word in the search bar and you'll get 75% off. It's gift that's guaranteed to be a hit. OmahaSteaks.com code KFGAMES all one word. Come over here because they can't hear you. You can't hear you if you, that's fine, but you can't, they don't know what you're saying till you come over here. You know what I mean? Okay, okay, cool. Um, some hot stuff, babies. And yeah, oh jeez. Tim, read a question. And I'm gonna, we're gonna read a question as Greg does some stuff. Let's go. I'm gonna start here with Diego. Hey Greg, long time, first time. I was thinking about upgrading my PS4 to a PS4 Pro or an Xbox One X. I have",
            "start": 2001.53
        },
        {
            "text": "a 4K TV. So the upgrade to me makes sense, but I'm hesitant because I don't know how long the generation has. If I upgrade it a couple months than in a year, they might announce a PS5 or an Xbox. So my question to you is, how long will the current console generation last? How long will the PS4, Xbox One console generation last? I think, yeah, lay it on me. There's no chance of a PS5 or next Xbox. You don't need out. Okay, at next E3. Oh, no, no, wait, no, no. So next year at all. Then the question is the following E3. So write all this down. Alright, so we're in 2017. I've already confirmed that I don't know what year it is. 2018, 2019, 2020. And then I'm stupid and always forget 2013. That's when the release date is. November 2013. We, I don't know, really bad one time. Well, let's just kind of never heard the end",
            "start": 2056.52
        },
        {
            "text": "of it. Well, it's the, the problem, of course, is the fact that time has lost all meaning to us. And I just don't understand where I am in ever. So 2013, you say, is when it comes out again. Tim says that if he's wrong, it's on him because when it's, when I went to Japan, I got one of those things. Yeah, that makes sense. It was four years ago is what I got the little Facebook memory for Japan. I got to visualize this all. I think when you spell it out and you say not 2018, I agree. But I also feel like 2019 is also too soon. I feel like these things are still selling so well. You don't want to **** that up. PlayStation just said yesterday, you weren't on the show. Have you caught, caught in that Black Friday was their biggest Black Friday ever in the company's 20 years or 2003? They had never sold more",
            "start": 2113.88
        },
        {
            "text": "PlayStation just said yesterday, you weren't on the show. Have you caught, caught in that Black Friday was their biggest Black Friday ever in the company's 20 years or 2003? They had never sold more units, more consoles on that a date on a Black Friday than they did this Black Friday. Yeah, so the PlayStation 4 is still a juggernaut, still running away. The there is excitement behind the Pro and the Xbox One X where people are like, all these games look great. They look better. You can ride that for a few more years. You can get people to buy those for a few more years. If it is that, oh, I want to upgrade. Oh, I want this. You figure it's both the sales figures of the unit itself. When is it gonna plateau? When isn't gonna dip? That is gonna motivate these companies to actually pull the trigger. But then it's also PC games pulling away and not being able looking like **** on PS4 and all this stuff. And we're not running into that doing the wrong place. PC games look better and HDR technology.",
            "start": 2172.17
        },
        {
            "text": "it's also PC games pulling away and not being able looking like **** on PS4 and all this stuff. And we're not running into that doing the wrong place. PC games look better and HDR technology and less crap. And okay, but I still think that consoles have such a stranglehold right now going. They have so much behind them that PlayStation is worried about **** it up. The wild card is Xbox. Is when does Xbox want to come out? Do they want to be out before everybody? Do they want to wait and see? Do they want to see if they can make up ground with Xbox One X? Like what is there? I don't know what their, as I said on multiple shows, this about Xbox One and Xbox One X and Microsoft and Xbox. I don't understand what their vision is anymore. I think it is all driven by software. When we look at how long this console generation has been so far and how long it could keep going compared to last generation, debate the generations before that. You can't really tell too much just being like, well, this lasted",
            "start": 2218.73
        },
        {
            "text": "this console generation has been so far and how long it could keep going compared to last generation debate the generations before that you can't really tell too much just being like well this lasted this long so this must last this long because no there hasn't been any type of consistency especially recently but what I do think you can do is kind of look at it from me because you're talking about hardware sales and why hardware keeps selling and it's because games are still coming out for those they're games that have consequence the major exclusives or the major third-party hits and once you see the franchise of those third parties kind of run their course that generation that's when it's like oh **** whatever Call of Duty still going strong and we've we've seen kind of a resurgence here how long will that last Assassin's Creed same thing yeah that's from a third party perspective from the first party stuff it's like alright cool we got Last of Us on the Sony side we still have deaths",
            "start": 2272.44
        },
        {
            "text": "long will that last Assassin's Creed same thing yeah that's from a third party perspective from the first party stuff it's like alright cool we got Last of Us on the Sony side we still have Death Stranding we still have The Last of Us and then third party there is still Kingdom Hearts there is still Final Fantasy 7 right yeah those are all the the furthest out games that we know Sucker Punch and second bunch right all of those you gotta believe will be out if all goes well let's just say 2019, 2020 right at the latest oh I think yeah Death Stranding I can see Death Stranding is gonna be the last horse in the race of what games we just talked about there yeah okay so let's say it is let's say that it is I'm gonna say 2020 then sure which **** that even sounds really far out it does sound really I mean Death here's the problem with Death Stranding saying it's gonna be far far away is that this is going to be much like my Persona 5 prediction and that and that's gonna get **** delayed where",
            "start": 2316.96
        },
        {
            "text": "I mean Death here's the problem with Death Stranding saying it's gonna be far far away is that this is going to be much like my Persona 5 prediction and that and that's gonna get **** delayed where that was just months of people **** screaming at me every day being like oh the website says this year and they would have finally got delayed I got the **** piss on all their graves and **** their grandmas right yeah remember that that's what's gonna happen with Death Stranding them out it's going to be years of being told we're wrong but it'll never be that long and then finally getting to a 2020 after multiple multiple delays okay so if that's the case let's take that as where we're jumping out from here sure is there another lineup of games after that yeah because I think that's the question and I feel like if the answer is yes if Sony can manage to have another big push of that wall and here's what's next yeah then it might push the PS5 back quite a bit but the other way to",
            "start": 2362.41
        },
        {
            "text": "question and I feel like if the answer is yes if Sony can manage to have another big push of that wall and here's what's next yeah then it might push the PS5 back quite a bit but the other way to look at it be like this is it for PS4 yeah in terms of the big exclusives and then it is PS5 time in which case it that does lineup and I can see Death Stranding coming out at the the tail and being kind of elastic dial game I also say being a God of War 2 yeah or God of War 2 yeah so yeah but I also wouldn't be surprised if the PS4 keeps going as well as it is it eventually becomes the PS4 Pro as like they drop the Pro that just is what the PS4 is they keep it going and announce another lineup and PS4 keeps going until 2021, 2020 yeah 2021 let me just remember the like piece or last generation lasted forever yeah Kevin's crazy is a it's a fascinating question that I think really does play into it were in a different spot than we've been ever in terms of how these units are selling the continued",
            "start": 2408.82
        },
        {
            "text": "forever yeah Kevin's crazy is a it's a fascinating question that I think really does play into it were in a different spot than we've been ever in terms of how these units are selling the continued success of them the success the Switch these new iterative consoles what does that do to the lifespan how does Xbox it for sure this year no and that's why I feel like for the way like obviously I'm so sure you won't hear about a PlayStation 5 Xbox Two at 2018 E3 then it really makes me wonder yeah what tweet 2019 sounds too far out than - and so then does it become yeah here there's a reference to and 2018 or is it all just 2020 like there's a February event for PlayStation 5 and that's what it'll be is I think that when we do here are these games at our systems it's not going to be at E3 it will be at a PlayStation PS4 was revealed where it's like yeah yeah they just had an event and here it is so I talked a lot about PlayStation but Xbox that you saying this reminding me it's",
            "start": 2468.13
        },
        {
            "text": "at E3 it will be at a PlayStation PS4 was revealed where it's like yeah yeah they just had an event and here it is so I talked a lot about PlayStation but Xbox that you saying this reminding me it's like I think that Xbox is the the more interesting player in the race because I think Halo has a lot to do with it not depending on when the next Halo comes and what they do with the next Halo that could dictate when the next system is launched and and whatever if they do have a plan to launch a successful Halo game on Xbox One X and everything they announced at E3 that changes things to me if they don't then it's like ooh maybe they're just holding it for the next system and I'm gonna bet big on it I mean yeah you that's been what I feel like you've been able to take away from Xbox this generation of what are the exclusives were the exclusives I do think they understand they lost this console race and so they probably have people working on things that are planned for the next console",
            "start": 2524.45
        },
        {
            "text": "of what are the exclusives were the exclusives I do think they understand they lost this console race and so they probably have people working on things that are planned for the next console because they need a long lineup that makes you do it but even then you usually don't launch with multiple first party exclusives that are like you know I mean like you don't want things to get buried yeah I mean look at the Switch and why it was successful is it had a limited launch but it it had a steady release calendar if Xbox could do something similar to that that could not be interesting I don't know if it works in the same way like I I know that the Switch is a home console but I think it's selling like and it has a really schedule similar to handheld devices and it also it can be a handheld device I don't know if a pure console can have that same type of success based on well and here's Halo it here's Gears yeah here's Forza and here's you know like the new thing want a new thing too and",
            "start": 2578.9
        },
        {
            "text": "I don't know if a pure console can have that same type of success based on well and here's Halo it here's Gears yeah here's Forza and here's you know like the new thing want a new thing too and that's the next Xbox where I feel like they've tried to play that card already in with Xbox One like there's a Halo and here's the end it's just no nobody cared I didn't move the needle the way it did before but I don't think that they they had that the calendar structure that I'm talking about where it's like where there was tentpole event after tentpole event after tentpole event the way that even Sony I think just luckily it kind of fell into place this year had um so what does that look like if it the launch is that way like the Switch did you know like where you were to come out with a killer app and then keep growing from that it's like well there's this co-op and then next month this and the next month is in the next one this and then on top of that you get to the fall and then it is all the",
            "start": 2624.59
        },
        {
            "text": "then keep growing from that it's like well there's this co-op and then next month this and the next month is in the next one this and then on top of that you get to the fall and then it is all the third party games I think the Xbox One X it almost doesn't matter in the sense of this conversation of one will Xbox notice Xbox could announce Xbox Two next year and the Xbox One X just coming out I don't think affects that because they know what they have and that I truly see the Xbox One X as hey we can sell this I doubt that their sales margins are high enough where they need to sell that many of it for it to be a worthy investment sure turn the conversation hmm so to what you're saying I feel I understand that calendar structure we're talking about but I also feel that Halo and Gears this time around and on Xbox One like once it came out she didn't move the needle in terms of people really don't care about those franchises like they care about Zelda and not that you know I mean you",
            "start": 2667.61
        },
        {
            "text": "time around and on Xbox One like once it came out she didn't move the needle in terms of people really don't care about those franchises like they care about Zelda and not that you know I mean you know you understand I do I I think that uh with Halo specifically I think Halo is due for Renaissance no reboot it's not not necessarily that but I'm saying that like yeah you know Halo kind of like it got a little bit too here's another here's another here's another here it feels like it's been long enough now since we've got a proper Halo game and they've been quiet about Halo prop yeah for long enough that I think that the next one could be that exciting thing to get people back and then my other problem would be that yeah Xbox Two could happen at any point I don't think he can happen I don't think he can happen for another two years at the earliest because if you like you're saying where if they did it right up now it would be a hey wait **** you like you've been turning the ship",
            "start": 2710.33
        },
        {
            "text": "don't think he can happen for another two years at the earliest because if you like you're saying where if they did it right up now it would be a hey wait **** you like you've been turning the ship slowly you've been making all these decisions Xbox One X has actually motivated people I know to go buy an Xbox One X in actually play Xbox One X play Xbox One games again that they haven't played and pick up things as they've missed and I feel like if you were to come out now and be like next year all right cool let's talk about what is next for the act I think there would be people like what the **** we just bought the Xbox One X and even though it's been walked back the oh this is you know we're done with console generations we're not you were making it sound like this was going to be a evolutionary step that this was a vision to believe in that didn't replace console generations but definitely was an investment I wasn't gonna get screwed on nine months later six months later I don't",
            "start": 2757.85
        },
        {
            "text": "step that this was a vision to believe in that didn't replace console generations but definitely was an investment I wasn't gonna get screwed on nine months later six months later I don't know I I think that the Xbox One X was an obvious move of desperation and it was definitely a money grab of or not money grab a investment of money total opposite investment of money to stay relevant and to like keep the name like to keep goodwill for the Xbox yeah because the way I'm looking at it you said it earlier with the Wii U and I think there's a lot of comparisons between the two obviously it's not as dollar not as bad as that and the Xbox One is still like we always talked about it's not being a PS4 but it's still doing really well but they want better than that and I think we just talked about PS4 and they had this lineup of games that we know what's coming next year being 2018 and we also know what's coming for all these years that were talking about at least a couple big titles and we",
            "start": 2800.33
        },
        {
            "text": "PS4 and they had this lineup of games that we know what's coming next year being 2018 and we also know what's coming for all these years that were talking about at least a couple big titles and we also know that there will be more games announced for Xbox don't really know let's like Sea of Thieves yeah a couple things here and there see and then but beyond that we don't have that kind of next big lineup we don't have The Last of Us and Death Stranding and you know this this and that so I think a big question is will that be announced or is it gonna be kind of are we just gonna see more things like we saw at the end of the Wii U lifecycle where everyone was waiting for Metroid Prime everyone was waiting for a proper 3D Mario and everyone was waiting for these big temples we didn't we got a Yoshi game we got a Kirby hand yeah we got Mario Power Tennis we got Star Fox Zero it's like what we start seeing out with Xbox where they kind of just keep getting Forza you're getting stated okay",
            "start": 2851.9
        },
        {
            "text": "Yoshi game we got a Kirby hand yeah we got Mario Power Tennis we got Star Fox Zero it's like what we start seeing out with Xbox where they kind of just keep getting Forza you're getting stated okay - that's what I'm saying well just give me a title I got the caliber of title if that is the correct if that is hey here's State of Decay 2 and here's Crackdown finally in here's something akin to a Cuphead not because Cuphead it's a great quality game but I mean in terms of like an IP you and exclusive right then yeah that would be signs that yeah they are just keeping the troops in the back let's work on everything let's get it to Xbox Two and let's get that out E3 is gonna be extremely telling for for Microsoft and I think that a big part of that is going to be what they decide to do with Halo mmm interesting if we don't see Halo next year E3 absolutely we're getting an Xbox One or Xbox Two 2019, 2019 okay yeah and I might I see that that would line up a bit with what I'm",
            "start": 2893.8
        },
        {
            "text": "to do with Halo mmm interesting if we don't see Halo next year E3 absolutely we're getting an Xbox One or Xbox Two 2019, 2019 okay yeah and I might I see that that would line up a bit with what I'm thinking is I feel like Xbox has got to get out in front of PlayStation 4 or 5 this time around right and I feel like they do a 360 move and come out a year before whatever PlayStation's planning and see how that rolls and actually get people a we're the only next next-gen you know the next next-gen unit on the market right now but there's gonna be well I have a PlayStation 4 probably Xbox One X I would have that it's fascinating situation we're all in mm-hmm Jarrod the Bank Guard writes into KindaFunny.com/KFG D and says hi guys I wanted to ask you guys your thoughts about everything going on with Net Neutrality and more specifically how it affects both of you all as people who use the Internet to cover games as well as gamers as a whole who use the Internet to play them do you see",
            "start": 2936.07
        },
        {
            "text": "on with Net Neutrality and more specifically how it affects both of you all as people who use the Internet to cover games as well as gamers as a whole who use the Internet to play them do you see a possibly future a possible future where we have to pay Comcast or Spectrum or Time Warner or extra for a gaming package with our internet or we're gonna be charged a fee to download podcasts and videos the future of the Internet seems pretty uncertain and it seems like a lot of people aren't all that concerned would love to hear your thoughts thanks for all you do Jared a lot of people are concerned I see it every day the retweets and gusts are roll out they're saying we got these people stop calm and ready the day that should happen though grazie it's it's I mean man it's interesting yeah I **** hope this **** doesn't happen I could see it happening I can hopefully see it I hope that like we've all spoken in America as loud as we can right now by doing the Reddit stuff and",
            "start": 2979.87
        },
        {
            "text": "yeah I **** hope this **** doesn't happen I could see it happening I can hopefully see it I hope that like we've all spoken in America as loud as we can right now by doing the Reddit stuff and hitting the button and calling your Congressman a bubble and like the Internet is a powerful beast and when you talk about the Internet as this this being this living thing sure that that's an army of people that can act on stuff and there's nobody that is would consider them part of that army part of the Internet that is citing for this yeah right and I feel like we see this whenever there is like oh **** someone's like raised their hand is like guys uh we need to pay attention to this right now yeah everyone's like yep right and then they stop and it did you know goes away and this is something that every couple years pops back up it's like every few months I feel like and I feel like more recently it's just coming up more and more and more and yeah like that I feel like all the people",
            "start": 3017.4
        },
        {
            "text": "that every couple years pops back up it's like every few months I feel like and I feel like more recently it's just coming up more and more and more and yeah like that I feel like all the people that would actually care are caring and are voicing their opinions then there's all the rest of people that don't care and don't understand and don't know yeah and that's why things get really scary with this yeah like very very scary but then I at the same time looking at it I'm like I don't know I don't know what would actually come from this like because right now it is very doom and gloom and it is like all these people making Photoshop pictures of like here's what you have now here's what you will have if this is true and it's like I don't know how much that's true seeing a lot of the companies would come out and have statements of won't ever do this this or that and be like well you've already done some of that like yeah I don't know it's everything always shifts and everything always",
            "start": 3062.28
        },
        {
            "text": "would come out and have statements of won't ever do this this or that and be like well you've already done some of that like yeah I don't know it's everything always shifts and everything always changes and I can't imagine people regulating the Internet in that way like that sounds so foreign and there's no way that they could do that and it's like in 20 years maybe we'll look back on it be like oh I couldn't imagine being limited on you know phone calls or whatever but it's like well at one point we were and now we're not and like things just change and evolve I wonder how bad this would actually be and how much this is actually gonna affect people if it were to come into play yeah and I'm saying that I don't trust Comcast as far as I'm going I don't mean either but I already feel like they're **** with things I already show exactly it's like this gives them excuses to do more that **** and that sucks it really sucks the other side of it is I'm paying less for higher like crazy",
            "start": 3102.66
        },
        {
            "text": "they're **** with things I already show exactly it's like this gives them excuses to do more that **** and that sucks it really sucks the other side of it is I'm paying less for higher like crazy high speeds of Internet than I ever have before for high speed yeah for internet but there is way more options when it comes to fiber and you know like it's no longer in beer in the Bay Area there's only two it's either AT&T or Comcast now there's like oh well Verizon has this in these areas and sonica there's Monkey Brains there's all these like more like local Ray's things but if all these new things were to come into play like that changes everything and I I'm scared of this future I do not want this future I hope that we keep voting against this and keep pushing against this and have enough say against this I think eventually we're gonna lose the war you think so yeah well I I did hope would be they were able to turn like a corner where I still feel like this is similar to you know",
            "start": 3148.02
        },
        {
            "text": "say against this I think eventually we're gonna lose the war you think so yeah well I I did hope would be they were able to turn like a corner where I still feel like this is similar to you know violent video game arguments that I always make right over the the people who don't understand video games will die and I don't mean in a bad way I mean that they'll age out of Congress and then you're gonna have people who grew up with the Internet I feel like we're in the final throes of this where we're gonna get everyone in there who's lived and had Instant Messenger and knows how Facebook works and this will just be some lobbyist trying to make sure this **** stupid **** happen but there's a big difference there and that is the violent video game thing isn't making anyone money like isn't making the Congress people money whereas this there's so much money to be made so much like that it's imagine how much money would be made if people had to pay for porn had to pay for porn that alone",
            "start": 3192.57
        },
        {
            "text": "making the Congress people money whereas this there's so much money to be made so much like that it's imagine how much money would be made if people had to pay for porn had to pay for porn that alone I lived that nightmare what would change things so much ya know start adding that to things like a gaming package it's gonna suck people I'm not even gonna do it eventually you will because it's normalized and that's just what happens yeah you know like growing up I would have never thought that I'd pay as much as I do for a cellphone plan but it's like well it's cell phones have evolved cell phones have changed what they offer you is different yeah yeah it's scary pay attention I guess yeah is like try to read about this and when you see this **** don't just look at the red image and be like oh like actually look into it and see how this could affect you because it does affect you know these questions are speaking to me so I'm gonna go to Squad Up this is where one of you write singing",
            "start": 3230.79
        },
        {
            "text": "oh like actually look into it and see how this could affect you because it does affect you know these questions are speaking to me so I'm gonna go to Squad Up this is where one of you write singing what sorry KindaFunny.com/KFG D give me your name your username your platform of choice and what game you need help in I read it here the best friends come and find you you all play games together cuz you're the best people on the Internet Kaz Risk wrote in he is playing on PC cuz he's a huge dork he says he needs help on Blizzard Battle.net he puts Kaz Risk all one word Kaz RI SK I actually liked Destiny 2 and I'm a huge lore nerd we knew it PC player so I'm looking for a best friend clan that has a cool name and maybe plays enough for the bonus engrams if you're playing Destiny 2 on PC you need to go find Kaz Risk on the Blizzard Battle.net help him out place in people and speaking of Destiny 2 Greg yesterday Anthony and I talked about Destiny 2 this whole shenanigans about",
            "start": 3276.1
        },
        {
            "text": "them fudging the XP numbers if people cared a casual gamers versus being I liked it a lot of people don't like it what do you think Chase wrote him - KindaFunny.com/KFG D and says regarding the casualness of Destiny 2 I felt somewhat burned by how easy it was to get 305 all three of my characters were 305 two weeks after launch as the crazy person I am I wanted to put in thousands of hours into this like I did Destiny 1 or like I did DC Universe Online I love the grind ensure the two weeks were a grind but I haven't played since getting all three 305 nor will I play until the cap is increased but I crave that grind that's just me you are a crazy person I appreciate I love Destiny 2 and I had a great time with it and I like the 305 was achievable and it wasn't gonna be thousands",
            "start": 3332.32
        },
        {
            "text": "increased but I crave that grind that's just me you are a crazy person I appreciate I love Destiny 2 and I had a great time with it and I like the 305 was achievable and it wasn't gonna be thousands of hours but again similar to what Andy was talking about right where we talked about how Destiny 1 kinda has rose-colored glasses this point remember vanilla Destiny wasn't great it was until stuff started coming but you're getting more next one or two weeks from now right with the Destiny: Osiris pack so we'll see what gets there I'm not sure if all the caps going up I like to be surprised hmm Tim mm-hmm we asked people watching live to go to KindaFunny.com/You're Wrong tell us what we screw up as we screw it up what do we get wrong today the Noisy Elk says okay this isn't actually you're wrong let's say you're right I enjoy it I wrote in yesterday to complain about Destiny 2 Anthony said I bet if we check this guy's profile he's logged back in and his playing Destiny 2 I totally was",
            "start": 3383.41
        },
        {
            "text": "wrong let's say you're right. I enjoy it. I wrote in yesterday to complain about Destiny 2. Anthony said, \"I bet if we check this guy's profile, he's logged back in and is playing Destiny 2.\" I totally was. I have a problem. And then a capitalist pig. There's not really you're wrong here. This is your senatorial is, but I like it. It's some important. I don't think a lot of people would know. Tencent is the fourth largest Internet company in the world behind Facebook, Alphabet (which is Google's parent company), and Amazon. They recently passed Wells Fargo as the tenth biggest publicly traded company in market value. Tencent currently owns the following gaming properties: CrossFire, the world's largest first-person shooter (unheard of in the US), and who Remedy is helping with on the sequel. They outright own Riot Games, which makes League of Legends. They own a majority eighty-six percent stake in Supercell (Clash of Clans, Clash Royale). They own nearly 50% of Epic Games. Wow, and they own close",
            "start": 3424.75
        },
        {
            "text": "Games, which makes League of Legends. They own a majority eighty-six percent stake in Supercell (Clash of Clans, Clash Royale). They own nearly 50% of Epic Games. Wow, and they own close to 5% of Activision. They coming zoo. Those things I knew odds. I didn't know the numbers. Yeah, yeah. I knew they had a lot of money and I knew they were too super invested. In Q1 2017, Tencent's online games division, this is just that part of the company, earned 3.3 billion in revenue. That's more than Ubisoft and Take-Two earned in all of 2016 combined. Wow. Rockin' says Shadow the Tomb Raider leaked October 31st, 2016. Yeah, we're getting due to here, son. Well, that game's won over a year ago. It's also, I meant to bring this up, we got off topic, but I was also, \"When are we hitting about Avengers?\" You know, I mean, 3, right? You'd think. I mean, it's another trailer. Game Wars can be cool, but I think it's too close to the Age of Ultron, or not a title front, sorry, Avengers 3, or whatever video games when they come. We",
            "start": 3467.89
        },
        {
            "text": "3, right? You'd think. I mean, it's another trailer. Game Wars can be cool, but I think it's too close to the Age of Ultron, or not a title front, sorry, Avengers 3, or whatever video games when they come. We no, no. Hi, thanks, q laudatory Eliza. Yep. Nade Sticker says more info. Parker Saurus becomes the first-person shooter when the dinosaurs escaped and you have to hunt them with tranquilizers. Nice, nice. Thank you, Parker Saurus. Truckasaurus watches Parker Saurus make his move. All right, everybody, that's another episode of Kinda Funny Games in the books. Remember, tomorrow is Whitta Wednesday! Gary Whitta comes here to rant and wear sweatpants. Oh, every day you can watch the show on Twitch.tv/KindaFunnyGames, YouTube.com/KindaFunnyGames, podcast services around the globe. No matter where you get Kinda Funny Games Daily, thank you so much for watching it, supporting it. We love making it for you. If you could and subscribe, like, share, go on Patreon.com/KindaFunnyGames. Toss us whatever",
            "start": 3521.62
        },
        {
            "text": "Kinda Funny Games Daily. Thank you so much for watching it, supporting it. We love making it for you. If you could and subscribe, like, share, go on Patreon.com/KindaFunnyGames. Toss us whatever you can, even if it's just a buck. It helps make the world go round. Until next time, it's been our pleasure to serve you.",
            "start": 3589.48
        }
    ]
}