{
    "id": 3191,
    "video_id": "MGXJ7OtQ224",
    "show_name": "Kinda Funny Morning Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Kevin Coello"
    ],
    "title": "Avengers: Infinity War Trailer Live Reactions and Breakdown - The Kinda Funny Morning Show 11.29.17",
    "description": "Thanks to Dollar Shave Club for sponsoring this episode. Go to https://DollarShaveClub.com/Morning\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1511993550,
    "duration": 4091,
    "transcript_chunks": [
        {
            "text": "Oh Nick, Nick, Nick, Nick, Nick, Nick, oh yeah, yeah, yeah, I was like, you are a little ****, why don't you come up with a better insult, **** yeah, come on man, **** lazy spaghetti. Ladies, gentlemen, hello, welcome to the Kinda Funny Morning Show for November 9th. It is, as I've been reminded by the fine gentlemen that were out working out there, the fifth Wednesday of this month, which is weird, fifth Wednesday of the month. It was very, very weird. We're gonna get through it together, ladies, gentlemen, Hump Day. I'm Nick Scarpino, this is my partner in crime, Tim Gettys, and as I am host, we got lots of really fun stuff. I'm gonna solve all the **** and get to the trailer. It's true, we have our wait, Infinity War trailer today. I've already seen a bunch of screens, it's already been ruined for me, **** internet. Where no, I don't want, I was a planet, bro. I'm the opposite of radio silent, but I woke up really late today and I was like, you know what, I'm gonna save this, I'm gonna save my infinity virginity, but boom.",
            "start": 1.87
        },
        {
            "text": "no, I don't want, I was a planet, bro. I'm the opposite of radio silent, but I woke up really late today and I was like, you know what, I'm gonna save this, I'm gonna save my infinity virginity, but boom. Wow, didn't intend for that. Right, it's so good. Okay, here's the funny thing about Marvel, alright, is that like they took over the **** internet today with this trailer. Yeah, the story I looked at was like eight stories, follow up like a mess, 50. The whole website's **** Infinity War or my felicity, right? They got screen grabs, got clue or grabbed all these screen grabs from it and like captures, like this is really cool. So I mean, it's just fantastic. Well, we're celebrating a trailer and they made the right. We knew that we're all super excited, the culmination of eighteen films at the point of this one. Eighteen films, that is insane. Seventeen are out right now. Black Panther will be the 18th, and then boom, we're getting this **** cinematic history. So that's coming right after I do a little housekeeping, which is of",
            "start": 81.25
        },
        {
            "text": "films, that is insane. Seventeen are out right now. Black Panther will be the 18th, and then boom, we're getting this **** cinematic history. So that's coming right after I do a little housekeeping, which is of course, today's episode is brought to you by Dollar Shave Club. We'll read that ad later. We love Dollar Shave Club. I need it. You don't, you're cleaning your, oh, you're just so good for you. Of course, daily reminder, please go vote for Andrea, Google trending gamer. In the Google search, she'll come up. You just click the thick picture. If you have to switch accounts, that's where it gets complicated. I can't help you anymore. I'm sorry. We have Greg Miller asking about Google works. There you go. A couple PSX updates. We're happy to announce Greg will be interviewing Shuhei Yoshida on Friday night at the PlayStation Presents event for early bird ticket holders. So if you're one of those people, congratulations, you get to see that. You get to see, you get to live Greg Miller's life for a",
            "start": 125.38
        },
        {
            "text": "night at the PlayStation Presents event for early bird ticket holders. So if you're one of those people, congratulations, you get to see that. You get to see, you get to live Greg Miller's life for a second. If you're not an early bird tailor holder, well, I guess you're just SOL. Is that right, Greg? Right, announced what panels you're doing. Yeah, Greg will also be moderating the Uncharted anniversary panel at 5:00 p.m. on Sunday. That sounds **** awesome. Also, I'm kind of bitter. I'm not going to PSX. What are the details on that one, Greg? Because that sounds **** cool. You know, and I get if I'm gonna come back here and work over here, you should set up a little thing over there. It's me interviewing all the voice actors pretty much ever from Uncharted. It's the, you know, 10 year, it's the end of the Uncharted, at least Nate's story. They know that's what they keep saying. That's awesome. So it's Nolan North, it's Troy Baker, it's Emily Rose, it's Richard McGonagle, it's Claudia Black, it's the other people,",
            "start": 165.16
        },
        {
            "text": "at least Nate's story. They know that's what they keep saying. That's awesome. So it's Nolan North, it's Troy Baker, it's Emily Rose, it's Richard McGonagle, it's Claudia Black, it's the other people, Robin Atkin Downes. Now, can I ask a question? You sure came. Can I submit a script with all the characters in it where they have to do a scene including you sure of knowing nothing about Uncharted? Yeah, how any of that work? It sounds perfect. How does that sound? Yeah, it sounds great. It'll basically be like a pickle. That's the voice actor for Eddy gonna be there? Eddy? I don't know if Eddy's gonna be there. Say hi to me. Okay, well, yeah, well, excited about that, ladies, drama. That's pretty freaking cool. It does sound very, very cool. If you're going to PSX, please make sure to check out those two very important things. Of course, we'll read tips later, so keep your tips right now if you guys happen for us. And that's enough of me talking. Well, ladies and gentlemen, it's Avengers: Infinity War trailer time. I wish it",
            "start": 207.37
        },
        {
            "text": "of course, we'll read tips later, so keep your tips right now if you guys happen for us. And that's enough of me talking. Well, ladies and gentlemen, it's Avengers: Infinity War trailer time. I wish it were actually Avengers: Infinity War time, but it's not. Yellow more. The next step is Star Wars, but whatever. Let's watch this trailer. Who gets how? Hold on, before we do this, what's this thing doing? This, I already said it. Oh, did you? Yeah, I've done my bit for king and country, sirs and ma'ams. Denude. Let's make sure the volume's up on this TV, please. Let's do a test. Well, suppose I can be a little, I could be like 10 times louder. I need a bit more. If it's at 30, let's put it over here. That's gone. They're all really, yeah, time. It's great. Alright, ladies, gentlemen, tighten your seatbelts. It's gonna be a good ride. There was an idea to bring together a group of remarkable people to see if we could become something. Bubbly hot. Paul Bettany. So when they needed us, we could fight the battles that they never could.",
            "start": 249.22
        },
        {
            "text": "there was an idea to bring together a group of remarkable people to see if we could become something bubbly hot. Paul Bettany. So when they needed us, we could fight the battles that they never could. That's awesome. And a great accomplishment. Amen. In time, you will know what it's like to lose. To feel so desperately that you're ready yet to fail. Oh, tingly. I love it. Bobby's to us. We've hurt my side. Giant ring like that floating in space. He didn't seem long. He felt dusty. Still alive. The Patagonia vest. By all that. Evacuate the city and gates or defenses and get this man a shield. Man, dirty Captain America. Will dust about you. Fun isn't something one considers in balancing the universe with this. Does put a smiley face made about. Oh, ****. Orbitty backsliding about Winter Soldier. It was awesome. This guy, everyone. You guys don't like Chris Pratt's little mustache? They're gonna need, they're gonna CGI that out. I love it. No, I think they should. I think they should.",
            "start": 302.06
        },
        {
            "text": "Soldier. It was awesome. This guy, everyone. You guys don't like Chris Pratt's little mustache? They're gonna need, they're gonna CGI that out. I love it. No, I think they should. I think they should CGI everyone's upper lip. Okay, it works so well. Awesome. The whole time. I like that look. I like that he looks like a 70s porno. Yeah, it kind of makes sense. It just is great. Yeah, for them to have a **** dialogue facial hair. Do you think they're in the movie like a significant amount? Is this just at the end? No, I think they're gonna significant amount. Yeah, they fine for all right, right. Yeah, yeah, yeah. Loading on space or and then we saw Thor on Earth. I thought so. And I didn't. Yeah, he was, I don't know. So you're right. So yeah, that could have been. Yeah, huh. This is freaking rad though. The trailer's already 10 million views. Okay. Um, yes, I have questions. We want to go through order for the chair again. The IGN actually put protocol. It fits into images. Yes, let's go. Let's go image by image. Okay.",
            "start": 423.15
        },
        {
            "text": "already 10 million views. Okay. Um, yes, I have questions. We want to go through order for the chair again. The IGN actually put protocol. It fits into images. Yes, let's go. Let's go image by image. Okay. Thanks, IGN. This is, let's just click on the I go fullscreen. We have to assume was this Tony Stark provided serious Spider-Armor stuff? That's got a real spider. Not a fan. Not a fan. That's my thing is I likes Tom Holland in the suit and I have a feeling like halfway through his, she's not gonna be in it. But I get it. I mean, how's he gonna freaking fly it off against these like giant creatures without? Well, what's the point? Was like, hey, give Captain America a shield. My against Thanos. Yeah, he's got a tactical mind, Nick. That's what they need. He doesn't talk about. Yes, don't beard. And everyone knows that once you grow a beard, that is where the ultimate power lies. Mm-hmm. You didn't get it. Come on. All day, every day, today. Well, you didn't shave. Hey, so I told your life. I'm good. I'm horrible pain. Shave only I",
            "start": 488.23
        },
        {
            "text": "you grow a beard, that is where the ultimate power lies. Mm-hmm. You didn't get it. Come on. All day, every day, today. Well, you didn't shave. Hey, so I told your life. I'm good. I'm horrible pain. Shave only I don't like about this is it reminds me of the armor and the current run in the Spider-Man comics where it's all high-tech shape. I'm like, I don't like that. I like that though. I mean, it gives a little more dimension. ****. He's got these already got that. I denied his shooting on stuff. So it's like a natural. But this was this the suit at the end of Homecoming or was this a different suit? I think it was a different suit. It looks very similar. We didn't see it all lit up in ships. Yeah, no, I, I thought it was different. Different that it was like more yellowish. Well, the way this is really cool. Someone give us the side by side. Yeah, please get us a side-by-side. Yes, please. Dad, this seems to be a picture of Jupiter. No, it's the, it is different. Uh, actually go back. Let me see. Nope, same here. Is it exact same?",
            "start": 537.04
        },
        {
            "text": "the side by side. Yeah, please get us a side-by-side. Yes, please. Dad, this seems to be a picture of Jupiter. No, it's the, it is different. Uh, actually go back. Let me see. Nope, same here. Is it exact same suit? Yeah, yeah, no, that's the one. All right. It's like gold plating, but you see it there too. Yeah, I think it's the same suit, but it looks very similar. All right. It might be slightly different on the lighting. Looks different. So that isn't serious of givenness. You, if that's cool. What is this? Lamar's cool. Next, is this Earth? It might be Earth as you are. DJ doing what are DJ does best over Jupiter crying. He's a great actor. Oh, it's the whole sea of Mark Ruffalo. You bet. You brought up a good point earlier. Can go back. Uh, which was like, Jeremy, Mark Ruffalo gets tired to be a half naked lying in rubble because every movie he lights up like this. Every single his thumbnail is just what he does. But then I think to myself, now he's getting **** paid something. Hey, I really the coolest character in the",
            "start": 580.47
        },
        {
            "text": "because every movie he lights up like this. Every single his thumbnail is just what he does. But then I think to myself, now he's getting **** paid something. Hey, I really the coolest character in the **** Marvel Universe, the Hulk. It's also a favorite character. Sneaky, sneaky. That's worried. Yeah, I just always think, where's the little green one? That would be so great. It's pretty rad. Let's go to the next picture. Who ever seen that receives the Doctor Strange and his sidekick, whatever. They must belong. Next one. Now, this is interesting. This is Vision, but it's Paul Bettany. Yeah, he's probably best. Please don't put me in that **** red makeup and ****. Takes way too long. Paul Bettany. It's him trying to hide the stone. Not that he's doing a good job of it in this. Well, it's clearly glowing through his forehead. Well, when he gets turned on, it just glows. Oh, it's like a rhino horn. Yeah, rhino. I'm gonna mean how they cut him off and you can have sex with it or what? Grind it up, put it. That's",
            "start": 633.18
        },
        {
            "text": "through his forehead. Well, when he gets turned on, it just glows. Oh, it's like a rhino horn. Yeah, rhino. I'm gonna mean how they cut him off and you can have sex with it or what? Grind it up, put it. That's actually why Thanos is pulling it out. That's what it can't get hard. Now, here's my one. Let's keep going with this. I was gonna have criticism. Oh, little. Yeah, so this is more on the Guardian, other guy. What a Milano. Yeah, I love, you know why? Cause it's named after Alyssa Milano. Yeah, I also had a crush on it. Actually, it is named after Alyssa Milano. Max is going on. Moving on. Now, this is cool. Mark Ruffalo next to the Hulkbuster. So this is the first time that him and Black Widow have seen each other since, yeah, Avengers 2, right? That's true. So why it's first time anyone's seen him since Avengers 2, right? Except for Thor. Yeah, you know, it looks like Wakanda. Yeah, I'm guessing I haven't seen Black Panther yet, but I'm assuming a lot of this takes place in Wakanda, considering we saw that shot of all of",
            "start": 677.22
        },
        {
            "text": "for authorities. Yeah, you know, it looks like Wakanda. Yeah, I'm guessing I haven't seen Black Panther yet, but I'm assuming a lot of this takes place in Wakanda, considering we saw that shot of all of them running to each other. The one we haven't seen what assumes, all right, cause they're a high tech, yeah, we world. Well, like though he's got, you see any Black Panther? Then I would assume so. Oh, what color is Black Panther's like lights when his super powers on? Is it purple? Well, the bad guy's purple. So he's yelling. He is. Is he one? Is yo, one thing I think you see the madness. Let's go the next one. Now, I love this. This is Scarlett Johansson with the short hair. Big fan. Blonde hair. Big fan of the blonde shorty. First blonde she's been, she's done an all that in this. Love it. It's amazing. I like it. It's the most natural look she's had this entire time. Not the bleached red look or the blue, you know. So I think this looks great for her. Fantastic. I love the fact that holy like that Benedict Cumberbatch, Mark",
            "start": 722.96
        },
        {
            "text": "most natural look she's had this entire time. Not the bleached red look or the blue, you know. So I think this looks great for her. Fantastic. I love the fact that holy like that Benedict Cumberbatch, Mark Ruffalo, and RDJ are gonna share a scene together. Yeah, good. My, I don't know the actor's name, boys, about the hips. You know, he's there. Hulk's gonna crash through his house. Mm-hmm. Something's gonna fall from space through this. Am Jeff Goldblum. And here's what's gonna happen. You're that sees me. Hulk and Thor. Steve anytime together. It's like, hey, let's up with another ten million dollars. Now, we do we see the Spider-Sense? We don't know how. I see the Spider-Sense. That's pretty cool. But they've confirmed he has it. I think that's what this is. No, no, I know. I'm saying they had confirmed beforehand that he had it. We're seeing it, I think, for the first. I missed the Tobey Maguire Spider-Sense where he would look and it would zoom in on him real quick, kukuku, and then his hair. We're gonna be looking for",
            "start": 768.92
        },
        {
            "text": "he had it. We're seeing it, I think, for the first. I missed the Tobey Maguire Spider-Sense where he would look and it would zoom in on him real quick, kukuku, and then his hair. We're gonna be looking for. Next one, the O-ring in space. All ring in space. Yes, Greg pointed out it is in fact not floating in space and isn't floating in the space above a city, which is there for the sky. There for the sky. So just Stardust, my friend. We are all the elements. So Kevin, this is what I want to ask you about, cause you, you have most recently launched all the Marvel movies out of anyone here. It's sure he got rid of the arc reactor in his chest. Well, so a lot of controversy about this, cause at the end of the third one, he's like, I'm taking it out. All right. So he takes it out and then he's just back in the Iron Man suit. We don't see his chest. Destroy the Iron Man suit. Time travel. These guys can time travel. They're time travel and not the right Tony Stark. Do you think Tony Stark is dead? Quoting Stark, Chloe, George Clooney.",
            "start": 812.99
        },
        {
            "text": "don't see his chest. Destroy the Iron Man suit. Time travel. These guys can time travel. They're time travel and not the right Tony Stark. Do you think Tony Stark is dead? Quoting Stark, Chloe, George Clooney starring Clone Saga. Asking for more clothes is not a very good second. So yeah, I, why does he have it in his chest again? Who knows? Well, because he took it out in the last one, but in the movie before that, he made it so it wasn't poisoning him anymore. So you know, no one hoods suit doesn't make the man. Loki action. So you imagine beginning in the movie. Yes. Do you think he's giving that to Thor? I imagine the beginning of the movie is with the end of right where he's like, here's this thing, don't kill me. What exactly? And he goes smash and puts it in the ****. And my question, and then becomes, do you think that as soon as he gives him this, he's obviously bargaining. He's doing the Loki **** like, hey, I can be a guy, I can be helped you, Baba. If this is the opening the movie, does Loki give him the",
            "start": 858.58
        },
        {
            "text": "think that as soon as he gives him this, he's obviously bargaining. He's doing the Loki **** like, hey, I can be a guy, I can be helped you, Baba. If this is the opening the movie, does Loki give him the Tesseract and then Thanos immediately kill Loki? No, I think Loki gives him the Tesseract. It's a fake Tesseract. He takes the Tesseract back to Earth and that's what they're. No, no, he already had the stone. Here we have a blue stone. He was putting in the purple one, right? Well, he looks like he was tearing one out of Paul Bettany's forehead, which I, but I assume that's the one that they're after on Earth. Two stones. He might have someone in there. Is there someone when we get to it? Well, the way, do we think that Wakanda's high anyone or anything? Paul Bettany is the one he's after on Earth. Well, he's also after Wakanda. Okay, they just want else would they be in Wakanda so much? Cause it's cool. Cause the fun word to say, Wakanda, Honda. Moving forward. It's just like saying milk a nose. I think he looks stupid as ****. I",
            "start": 910.84
        },
        {
            "text": "don't, I don't love it. And I don't, and here's my, here's my problem with Thanos is the same that we had with Steppenwolf, which is that I don't like all CGI bad guys. I'm like, you got Josh Brolin. Not only do you got Josh Brolin, you got swole Josh pursue each make a major in purple. Make him bigger than everyone. You had that. Isn't it easier to be like, put an actor in a suit, making bigger and like put **** on his face and it is to do this? This looks fake as ****. It's not even a good render. It's like, oh, look, Mr. Pink underscore says Thanos looks like a thumb. It's like when you used to draw face on your thumb. Like when I shaved my beard, I also looked like. It's true. You should never do that again. Yeah, that was terrifying for me. It was a bad day and it wasn't a great reaction. I really enjoy that.",
            "start": 953.11
        },
        {
            "text": "your thumb. Like when I shaved my beard, I also looked like. It's true. You should never do that again. Yeah, that was terrifying for me. It was a bad day and it wasn't a great reaction. I really enjoy that reaction video. I wish he was wearing his helmet more. He's mostly explained it. I was reading interview at Comic-Con time that they're saying that like he doesn't even a warlord anymore because he is getting the stones like a spiritual journey for him. So he's like a shaman right now. That's stupid. You imagine Infinity War or whatever they have on the poster. We've seen that adds up all together. Shows him the cool blue outfit that we know him from the comics, right? He'll and open that. It was something similar to in Italy. He'll end up in that. Dark Knight 6678 says he looks like Steve Austin. This probably not worth clipping out. I'm gonna say what's that? Well, it's the only shot of the back we get. Who cares though? Turns out there's a backside. There's a backside. There's the front side. Kevin.",
            "start": 997.57
        },
        {
            "text": "probably not worth clipping out. I'm gonna say what's that? Well, it's the only shot of the back we get. Who cares though? Turns out there's a backside. There's a backside. There's the front side. Kevin. It's graphic question from the audience. Why do you hate fun? I first saw that question did not come from the audience. And second of all, I'm trying to keep us like going. Well, now that I'm over here getting Games Daily ready, but I want to be a part of this. And I'm sitting, I'm sitting next to you at a table. Like it feels like we're doing our own anytime. Kevin's never. And we're all his audience, guys. Just for a moment. We have the Spider-Man suit. I guess this is the first shot of the top of him. All right. That's all of the top of his hand, of his right hand. And willing, you can see his shoulder blade is in fact black and his eyes. Thank you. His lip is lips on L. A lot of wings. A lot of big ring things. Easy. We have any idea what the ring thing is? A porthole dimensions? Maybe. Here is my theory. My theory.",
            "start": 1039.96
        },
        {
            "text": "in fact black and his eyes. Thank you. His lip is lips on L. A lot of wings. A lot of big ring things. Easy. We have any idea what the ring thing is? A porthole dimensions? Maybe. Here is my theory. My theory. Thank you. Give us your theorem. Somehow, hypothesis. Somehow Thanos shot like a ring is on Earth. He's got a ring on the other side. He's trying to bridge space. Bridge space. Bridge. Mm-hmm-hmm. Rainbow Bridge. And Thor on the other side, prisoner of Thanos. Yeah, trying his hardest to make it so he doesn't turn it on. It goes through the thing. You understand? Yeah, War Thor. Yes. Well, he's in the middle of that. No, I see it Thor. But like, or, or, oh, ****. Thor is the battery to run the suit or to run the whole thing. He is old Mr. Electric. Yeah, man. He's chained in there. He's trying to break it. You don't know. Well, there's a shower. Looks like I was trying to turn it off. Turn off right there. You can see them the middle. Okay, alternatively, I'll provide you a third theorem. Uh-huh. Okay, see that's him try to turn it.",
            "start": 1090.54
        },
        {
            "text": "there's a shower. Looks like I was trying to turn it off. Turn off right there. You can see them the middle. Okay, alternatively, I'll provide you a third theorem. Uh-huh. Okay, see that's him try to turn it off. I think or trying to cheer on or that's really just how Thor works out. This is the 4 Hour Fitness for Asgard. Well, I like, love that similar this looks to Captain America in Civil War with the helicopter. Yeah, that was cool. Marshall has given us a lot of manly men doing manly things. **** work in this. **** biceps. Look at his like this, right? Yeah, working the bicep lay or you can work triceps like their triceps. You work both. You could. But if you did it the other way, that's how you get this. Well, you're doing wrong to be fair enough. Tip number one with the biceps like their tricep. There you go. There you go. I didn't know that. That's a hot take from Tim Gettys'. Thank you. The workout master. The workout king. Will they call me that? That is what they call him. CrossFit Thor says better house. That's",
            "start": 1154.59
        },
        {
            "text": "go there you go. I didn't know that. That's a hot take from Tim Gettys'. Thank you. The workout master. The workout king. Will they call me that? That is what they call him. CrossFit Thor says better house. That's fair. Next one. Who is that? Steppenwolf's face. That's **** friends. Yeah, friends. Is he one of the cannon fodder? That's what it is. But he's got a really cool name. What's his name? I can't remember it, but it's really cool. The chat will tell us in Proxima Midnight when they stop. That's Proxima Midnight. That's on the Saturday. It, that's **** dope. More prizes. The first shot of Proxima Midnight's weapon from the side. Mmm. This is Ebony Maw. I don't like this guy a lot. Now, is that a real beard? Because I feel like it's the way he's wearing on top of his head. And I feel like the way the beard looks weird. It looks like fake. Something tells me it's all his real hair. Yeah, no, it's not. I mean, Chris Evans is kinda that I like losing my hair. It's like if you look at the last few. Yeah, but later see it's",
            "start": 1196.86
        },
        {
            "text": "weird. It looks like fake. Something tells me it's all his real hair. Yeah, no, it's not. I mean, Chris Evans is kinda that I like losing my hair. It's like if you look at the last few. Yeah, but later see it's clearly a wig that he's wearing. Nick, you're saying that to all the time and you're not losing hair, right? I am taking the hair of young virgins. Okay. Just got his face, eyes closed face. **** douched. Know the Veronica suit. Oh god, this is back. You have to assume so. Did you assume that Tony Stark's like, my normal suit's not gonna work? So my sense, at least from what we've seen this trailer, there are no Wakanda right now. Yeah, from what we've seen how he starts not and we're gone. Well, I'm sure at some point I saw him get laid out by Thanos later on the trailer. Hulk's for sure in Wakanda. And we also saw Hulk with Tony Stark and **** magic guys, Doctor Strange. But that's all in New York. Well, I'm saying Doctor Strange, like they go to, they go to, yeah, they have a news thing really good. You walk out of",
            "start": 1250.15
        },
        {
            "text": "saw Hulk with Tony Stark and **** magic guys, Doctor Strange. But that's all in New York. Well, I'm saying Doctor Strange, like they go to, they go to, yeah, they have a news thing really good. You walk out of door, your own condo, they're gonna be, we'll see. But I think that he's in this suit because he knows the invasion's coming. I think, yes. Here says Bo, who's piloting it? Well, someone was saying earlier that Mighty Banner was piloting it. That is making sense to me. Maybe, or maybe he doesn't want to go home because in the last one, I feel like here's the deal, they doesn't poke already. I'm coming to take the world. You go, you know, if there's ever a time for Hulk, it's right now, not like he'll let's go knock out this giant **** fire monster. You know, it would be a really great scene in Thor. He's like, no, smash it. Slams him in the face. Yeah, I love it. What would be really cool in Avengers, I mean, just off the ante for the cool moments and **** is, yap, **** hole putting on armor. That's one of those cool",
            "start": 1300.85
        },
        {
            "text": "it slams him in the face. Yeah, I love it. What would be really cool in Avengers, I mean, just off the ante for the cool moments and **** is, yap, **** hole putting on armor. That's one of those cool things. You know, it'd be really cool, **** Bruce Banner putting on the armor, finding books. That's it. Is Kevin Coello hard? That's a poll. Okay, Black Widow again. But who's she stabbing? Looks like Black Panther. It looks like she's fighting Proxima Midnight. Looks like he's dropping his armor stick, his bow staff. Doctor Strange buildings coming out of him. No, these are pillars that look like they were shooting into the ground. Oh, imagine this helps with the teleporting. That is his beard. Okay, I can hear credit. You get good credit. Beard credit. Chris Evans, he's wearing a wig, I guess. I'm Frankenstein. You, where's the hairpiece? Who's in the background there in the red? That's Proxima Midnight's friend. Yeah, do you think it's Proxima Midnight's wife? Gino's. But you know, aren't those like Black Panther friend? That might be able",
            "start": 1351.21
        },
        {
            "text": "who's in the background there in the red? That's Proxima Midnight's friend. Yeah, do you think it's Proxima Midnight's wife? Gino's. But you know, aren't those like Black Panther friend? That might be able. Oh, yeah, we got that shot of like all the two armies meeting, which I can't stand. Let's not do this. Do we really need mysterious monster fodder? Like, come on. No, we do because they're coming from like, you understand the portal clearly turns on, everybody comes through. But Thanos already has two, like two of the gems. You should be able to just **** everyone up. And he can. But well, that's all about, and that's the next movie. That Spider-Man versus Thanos. I assume that's a big purple. Go ahead, grow a hand. It looks terrible. RDJ, do one already. Thanos' best blue. It looks like they go through the portal 'cause this looks like the what I died. It looks like someone dies in this. Yeah, I'm guessing Captain America isn't dead. I don't think it's Captain America. I think probably, uh, he's working. I think Rhodey",
            "start": 1413.38
        },
        {
            "text": "portal 'cause this looks like the what I died. It looks like someone dies in this. Yeah, I'm guessing Captain America isn't dead. I don't think it's Captain America. I think probably, uh, he's working. I think Rhodey probably just gets a **** done. He already got RDJ's eyes. Yeah, because remember that's a good point because he doesn't, he wouldn't cry. He wouldn't cry for no. You got to get over that by getting that or someone else. Nobody knows. Continuity doesn't matter in this universe. No, it does. What are you talking about? They broke up off-camera. They got back together off-camera. It's just whatever happens. Nobody likes me. Oh, he's got PTSD. Nobody cares about for clarification. Cool, right? Not a tomorrow. He himself from the room via the rolly chair that he's on right now. And this is by the way why these chairs don't have rollers. Here's, here's the scene. This is Vision getting his head carved off. He does not look like he's enjoying. He's not more of not feeling. Guys, that Loki's staff. Know what does",
            "start": 1461.98
        },
        {
            "text": "chairs don't have rollers. Here's, here's the scene. This is Vision getting his head carved off. He does not look like he's enjoying. He's not more of not feeling. Guys, that Loki's staff. Know what does that, it look similar to Loki's staff, which was given to him by what's-his-face. It's more like a finger. Yeah, he does like a little finger. Know which is fig. This is definitely some sort. Yeah, so he's doing some surgery on Vision's head right there. That'd be great problem. You're not enjoying that. Now, which stone is this? Rock Stone? Which one is that? Control. What does it say? Thanos already has a Power Stone in the Infinity Gauntlet. In here, we see him add in the Space Stone as well. Two down. So that means even watch jump around space. Yeah, well, I mean, he doesn't need that funny machines anymore. They don't really use them for the right leg. I'm feeling better. This is gonna be the one to really explain the stones for the first time properly. All of them and how they differ. Laser remotes of Space and",
            "start": 1521.8
        },
        {
            "text": "don't really use them for the right leg. I'm feeling better. This is gonna be the one to really explain the stones for the first time properly. All of them and how they differ. Laser remotes of Space and Power. And then above that, Cerakote Ross's Soul Stone equals yellow. You know, we all know that. None of that makes any sense to me though. What is also an orange? This shows a Soul Stone, gave Vision his soul. Okay, but then when you take it out of him, doesn't give that soul. And by doing that, does he go, hey guys, this is really **** up what I'm doing. I'm sorry. I'm sorry, guys. How about we out just thrown it out there? Euros again. What do you think? Think you guys want to get some **** falafel? They did explain that like it's basically a supercomputer. Remember when they were talking about the, they're like, no, make sense. It's similar to the AI we built, just a million times more complicated. So the scientists, we'll figure that out. I'm green equals time. Vision has the Mind Stone. Press left says",
            "start": 1569.17
        },
        {
            "text": "no, make sense. It's similar to the AI we built, just a million times more complicated. So the scientists, we'll figure that out. I'm green equals time. Vision has the Mind Stone. Press left says right question mark. But you know, you guys are no help. You know, no help on there. Let's keep going. The Power Stone was the, was in the hands of the Collector last, right? No, they gave it to the Nova Corps. Don't explain it. They will explain it. Let's Thanos against a girl. Let's go through these numbers. 0 more of these bad boys. Iron Man's old G-suit. Thanos with two down, three to go. I assume this one, there's two there and I guess there's one on the phone. I have to assume, right? Yeah, we got yellow, we got red, and we got green left. Those are the last colors in the rainbow. Guys, that's cool. This is when he lays **** Cap on her, Mister. Is that Spider-Man? Iron Man? Iron Man, is it? Yeah, I mean, it's got that cool 'cause minor asks, ooh, Octave design. Let me see. It's not gonna be this. I do love his",
            "start": 1609.93
        },
        {
            "text": "is when he lays **** Cap on her, Mister. Is that Spider-Man? Iron Man? Iron Man, is it? Yeah, I mean, it's got that cool 'cause minor asks, ooh, Octave design. Let me see. It's not gonna be this. I do love his little be fun to see when it rolls back in the flavor just woke him up. They did. They're like, get up, huh? Get out. There's a bad superpowers. You just got one strength. You got a **** little arm. That's Black Panther again. Thursday is cool. Army vs. army, which is gonna be the most boring part of the movie. You know, it's gonna be fun 'cause there's gonna be cool like choreograph. What's this guy doing? What's this guy doing? But it's didn't mean like so because it's a bunch of ****. Yeah, who cares? This is stupid. You are. We know that Black Panther's gonna lose like a friend and like we'll know him because they've built that up from the Black Panther movie. So will there ever be like, here we go, the money shot. Oh, and there's, that's the girl in the red outfit. Yeah, earlier the Black Panther friend. My family, a War",
            "start": 1654.5
        },
        {
            "text": "built that up from the Black Panther movie. So will there ever be like, here we go, the money shot. Oh, and there's, that's the girl in the red outfit. Yeah, earlier the Black Panther friend. My family, a War Machine up there. Maybe. Oh, I didn't see one of them. Okay, in fact, I don't get on the right ****. Yeah. Oh, this is Hulkbuster. He's busted out of his Hulkbuster. Oh my God, it's **** awesome. For more, sorry. Oh, there's the official logo. That's great. Let's screen cap that. That'll be the thumbnail. Chris Hemsworth looking Chris Hemsworth-esque. And yeah, there's a big reveal right there. And mustache in this whole escort. I love his hair. And that's perfect. A sideburns. Did you notice the sideburns? I did. I love the whole look. Come on. If you get sport. So, going back to RDJ looking all sad and yet, yeah, it must be Spider-Man based on its can array of what's going on. You gotta be 'cause War Machine's over on ****, not dead then. But you feel like he's everyone's eyes on this. Let's say it's just like the comic.",
            "start": 1702.0
        },
        {
            "text": "be Spider-Man based on its can array of what's going on. You gotta be 'cause War Machine's over on ****, not dead then. But you feel like he's everyone's eyes on this. Let's say it's just like the comic. Everyone dies on everything. I think that it could be anyone because they, I think that they all go over. Well, correct me if I'm wrong, but in the comic, didn't he kill like half of the life in the universe? Yes. I mean, it just like that. Yeah, I just started reading the comic. It looked, it looked right here. It's, there's somebody falls into Doctor Strange's house. It's the same shot, but it's Silver Surfer. But now it'll be Hulk and Hulk. Oh, warn them that hey, it's Thanos. There you go. Oh, hey, great. Good job. It wasn't Adam Warlock a big thing in the comics then? Yeah, huge thing. How are they gonna, how are they gonna get around that? They just, he was the one that put all of them together, right? I guess probably can be Doctor Strange. Yeah, it's gonna tell if he doesn't, I guess. And then",
            "start": 1753.62
        },
        {
            "text": "are they gonna, how are they gonna get around that? They just, he was the one that put all of them together, right? I guess probably can be Doctor Strange. Yeah, it's gonna tell if he doesn't, I guess. And then Adam Warlock, yeah, he was made on that gold planet. And yeah, so maybe he does come together. But like they said, he's not gonna be in it. So I think the second one. Buckle, Greg Miller, can you please help me? Orton needs some coffee. No, yes. Has there been a movie franchise that has as many sequels as the MCU that is in a continuity? Because James Bond, they're not constantly. The James Bond has done is during the 0s at this. But as James Bond actor, okay, yeah. As far as Kazuya, has it been any actors that like are supposed to be the same? Yeah, I mean, yeah, I mean, Roger Moore did I think the most James Bond movies. Gonna need like eight. No, but I mean like this is, was he a continuing story of Connery? Or I mean, yes, yes, he was because there were characters that that came over from their interest as the concept of",
            "start": 1795.71
        },
        {
            "text": "gonna need like eight. No, but I mean like this is, was he a continuing story of Connery? Or I mean, yes, yes, he was because there were characters that that came over from their interest as the concept of Spectre, which was the organization that came over that I believe was set up in the Connery-verse that went over to Roger Moore. But it's always weird because basically just resetting it, using some really want. Yeah, like it's Casino Royale hit. And it reset the entire, entire day, right? That was Casino. I was the very first book in a series. Nick, beforehand, that like the Pierce Brosnan movies weren't really connected to any of the other movie. GoldenEye was not a book. GoldenEye was based off of a short story, I think. And I think it was a really good, it's good. But it wasn't more continued Connery, okay, sure. But like what I'm saying is that at some point that chain broke. Yeah, well, at some point they just stopped referencing because Spectre, it's not being a thing. The biggest Blofeld was the, was",
            "start": 1851.39
        },
        {
            "text": "okay, sure. But like what I'm saying is that at some point that chain broke. Yeah, well, at some point they just stopped referencing because Spectre, it's not being a thing. The biggest Blofeld was the, was the, was the big bad guy. I believe he was a bad guy in Goldfinger, which was Doctor No. Yeah, why that was Connery. And then I think Roger Moore kills him in the very beginning of Roger Moore's first movie, which was what are you looking at? Pull it up. Pull this out. What are we, what? Oh, this is, this is a Kevin Coello spreadsheet of ever saw one franchise. Double-R movies. Barbie with the most at 31 domestic box-office zero. Come out. Yeah, so Dave, I'm sure they're not all, I mean, no, no one's done this. No one anything like this before. Clearly Marvel Cinematic Universe in first place. Batman again, it's not one continuity. Wait, Harry Potter has 1. These, no, these numbers aren't right. I think this is their numbers never even announced. Yeah, announced. So 3 is not, yeah, is gonna say Harry Potter has, I had",
            "start": 1893.72
        },
        {
            "text": "not one continuity. Wait, Harry Potter has 1. These, no, these numbers aren't right. I think this is their numbers never even announced. Yeah, announced. So 3 is not, yeah, is gonna say Harry Potter has, I had 1 movies yet. Yeah, then eight. And then we'll use a CBS. But they're only doing three. That, that's a little business until 11, right? Are they doing before that? They probably on before that. Let's see. That's what's going on here. This is fun numbers game. Oh, The-Numbers.com. If you guys want to follow along, fantastic. Be, he's just, you know, though they counted the IMAX marathon. That's ****. That is not Canada movie. That's not a movie. But they need to do it for money purposes. Like that does count to **** Warner Bros. But that's not what we're talking about. Go back. Let's see. Then we got the Star Wars is gonna end up with nine of the very least to actually know. But when you come to spin-offs, 'cause they are to spin out your canopy. Yeah, it still works. Yeah, I mean, of",
            "start": 1940.85
        },
        {
            "text": "let's see. Then we got the Star Wars is gonna end up with nine of the very least to actually know. But when you come to spin-offs, 'cause they are to spin out your canopy. Yeah, it still works. Yeah, I mean, of course that's Disney. So yeah, yeah, yes. It always is gonna get up there very quickly. Star Trek. Now Star Trek, and I know they interesting one where I don't think there could I get up there 'cause I just watched, I went back and watched Beyond again last night or two. I was like, no way. Throws like, you're writing a **** dirt bike or in Star Trek. What is happening? Yeah, the Fast and Furious has a lot too. But even, even with spin-offs, like, yeah, no, MCU's gonna be untouchable. I don't think. I mean, a wall, a wall because James Bond right now, who knows what's going on James Bond. There's another one happening. I guess they, okay, doing. Is anyone excited about that? We'll see. They've taken that franchise. We like sat back. I made years ago at this point. And they were like, alright guys, there's gonna be 20",
            "start": 1983.78
        },
        {
            "text": "I guess they, okay, doing. Is anyone excited about that? We'll see. They've taken that franchise. We like sat back. I made years ago at this point. And they were like, alright guys, there's gonna be 20 Marvel movies. And we're like, 20? Like, is anyone gonna give a **** about Ant-Man? Yeah, man. Or Doctor Strange or gone. I mean, that's the thing. We will look at that. We look at that shot where the two armies are waiting off for like another one of those. But guess what? It's gonna be fun. They're gonna find a way to make it fun. It's not gonna be like the last hour and a half of Justice League. We're like, they're just randomly punching these parody. That's Doctor Strange. Like, that's still. I don't know. I just want more from that type of ****. But whatever. We'll see. Tim, I know we're getting a lot along the tooth. We want to get to the deep dive topic today, which is gonna be Motor Crush comic books. Your required reading. Before we do that, I do want to get your take on this. Did you see that Disney has cast Mulan? It",
            "start": 2027.88
        },
        {
            "text": "want to get to the deep dive topic today, which is gonna be Motor Crush comic books. Your required reading. Before we do that, I do want to get your take on this. Did you see that Disney has cast Mulan? It did. Wonder what are your thoughts on this? Cool. Great. It's not Scarlett Johansson. So, so that's good. That's a weird. Nailed that forward. We'll see. I'm not familiar with this actress. And neither am I. So a service live-action action adaptation of Mulan now has its warrior princess. The title role we've played by Liu Yifei, also known as Crystal Liu, a Chinese actress previously seen in Hollywood fare like The Forbidden Kingdom and Outcast, two movies I'm not familiar with. Also, word of the casting comes to be in The Hollywood Reporter. It was also noted that Liu spent part of her youth, her younger years in Queens, New York. There's been some concern about the casting makeup of the live-action Mulan. It might look like, but putting Liu in the main role should ally some of those fears. I mean, if there's",
            "start": 2068.74
        },
        {
            "text": "in Queens, New York. There's been some concern about the casting makeup of the live-action Mulan. It might look like, but putting Liu in the main role should ally some of those fears. I mean, if there's not music, I am not really that interested in Mulan, if I'm being honest. They will see what happens. Again, like I said, I went back and watched Beauty and the Beast my wife. And of course, my wife is the keeper of whether or not a movie is good. Mm-hmm. And she has said, she went like, she did the **** and sees her thing. And she went thumbs down. So we keep. She didn't do the Miyamoto thing. It's like, no, no. I would love to get real better there. But it's not coming. So, so there you go. That's great. Lasting your story. Let's pull this up. I thought this was a fun little quip. Daisy really does not want to play Rey after Star Wars Episode IX. Whatever. This is such a stupid. No one cares. This isn't even a real thing. This is taken out of context without even reading article. Let me guess, someone asked her some ****",
            "start": 2112.21
        },
        {
            "text": "Star Wars Episode IX. Whatever. This is such a stupid. No one cares. This isn't even a real thing. This is taken out of context without even reading article. Let me guess, someone asked her some ****. And she was just like, you know, we will see. I feel like I learned a lot in these movies in blood, blood, blood. I'm Disney release monkey was nailing me, actually kneeling. Yeah, I know it's crazy. It's like, first thing, we're poor guys. And I open them. And I saw her. And funny your lawyers tell me to play Rey after Episode IX. Yeah, done. Yeah, it's happening. I guarantee it. Well, the quote is from an interview in Rolling Stone. She flat-out said she doesn't wanna play Rey. If you're like, hey, from a strike Episode IX. Here's the exchange. This isn't, this is, this misspoken by the way. Let's just read the exchange. Quote, no, she says flatly. For me, I didn't really want, I didn't really know what I was signing onto. I hadn't read the script. But from what I could tell, it was really nice people involved. So I was like, yeah, awesome.",
            "start": 2155.71
        },
        {
            "text": "says flatly. For me, I didn't really want, I didn't really know what I was signing onto. I hadn't read the script. But from what I could tell, it was really nice people involved. So I was like, yeah, awesome. Now I think I'm even luckier than I knew then to be part of something that feels so like coming home. Now I think the interviewer goes, but doesn't that sort of sound like yes? And she goes, no, she says again, smiling a little. No, no, no. I am really, really excited to do the third thing and round it out. But ultimately, what I was signing on to was three films. So in my head, it's three films. I think it will feel like the right time to round it out. Basically, she's saying, I'm not commenting on what's happening after this. I'm just gonna play through the three poems. That's what we're gonna get through. When these boilers, if they throw buckets of cash at her to play Rey in another movie, she'll probably consider it. Or if she becomes bad and then dies after the hand of BB-8. Right? It would be amazing. Be bada.",
            "start": 2198.07
        },
        {
            "text": "boilers if they throw buckets of cash at her to play Rey in another movie, she'll probably consider it. Or if she becomes bad and then dies after the hand of BB-8. Right? It would be amazing. Be bada. Was just left. He was the last survivor. Everyone else got **** decimated. It's like these rolls away. It's like, that's it. That's it for the news, ladies and gentlemen. Queue up your tips real quick. We'll read those actually, you guys want those after comics? Yeah, sure. Let's do that. So you should. That's fair. That's fair. Why don't you guys, I know that means they're required reading as well. No one thinks it's queer that she didn't know what she was signing up for. Well, she said she's doing the thing where she's trying not to sound like say anything controversial so Disney doesn't get pissed at her. That's all she was doing there in my opinion. Nelson Baker 88 is giving us our first ticket. Says, Nick, your personality is the reason I've kept listening to GoG. You have to be one of the funniest people on",
            "start": 2236.05
        },
        {
            "text": "all she was doing there in my opinion. Nelson Baker 88 is giving us our first ticket. Says, Nick, your personality is the reason I've kept listening to GoG. You have to be one of the funniest people on earth. Thank you for your hard work on the Morning Show. You fill the friends with laughter. It's a very nice compliment. It's true. I appreciate that. It's Ignacio Rojas says, because yesterday you guys talked about Jersey Shore. Here's a fun fact. Snooki is Chilean. No ****. Google it. Also, here's a fun clip. Starts at 40 seconds. Nobody cares about Chile. Stop talking about it. Dad, the Chile. You know, you guys got to bury the hatchet between Peru. Yeah, I'll be right in the back of his **** skull. God damn, Ignacio Rojas. It's Steven Jr. 1128 says, leave my birthday attacks from yesterday. Wasn't able to watch live. But thanks guys for everything you do. Love you all. Love you right back, Steven Jr. And Ray Diddit 0345 has given us our final tip for now. Says, paying my dues by leaving",
            "start": 2288.32
        },
        {
            "text": "to watch live. But thanks guys for everything you do. Love you all. Love you right back, Steven Jr. And Ray Diddit 0345 has given us our final tip for now. Says, paying my dues by leaving my birthday types. Help tax. Hope you gents have a great day because Disney sure has been good to me since yesterday and surprised me with his wonderful trailer today. Get or mother **** hides. I put that MFM is real. Is this the Queen? Yeah, I think so. Does she real? Are we hallucinating with our goods? Do you see the zebra? See the zebra? Oh, you know what this is? This is the like gonna compliment ya jaunt, and not John Stewart, John Oliver. John Oliver. Are we showing this or was your hunker? It's fun. Can you care a little? Yeah, I do. I mean, yes. Is that so fine? It's fine. Okay, let's show it. I don't know how long it is. Good like **** two minutes. I just go right there. Just play. I'm sure we'll get that. Yes, I've been there. My name. You really? Yeah, what's London? What's wrong? It's really pretty park right to",
            "start": 2330.11
        },
        {
            "text": "long it is. Good like **** two minutes. I just go right there. Just play. I'm sure we'll get that. Yes, I've been there. My name. You really? Yeah, what's London? What's wrong? It's really pretty park right to the right of its huge, huge, huge. Good little coffee stain right. Became names because there was there a few of them. But the sixties never meant like every slice game kind of composited initially. That was this thing. He did like five minutes. No, no, like 15 minutes of zebra doing **** on green screen. So that he can be composited in on videos. All right, between you guys. Thank you for that, guys. If you guys want to give some more tips, maybe we'll check back in afterward after, after these guys get a chance to talk about Motor Crush, which was the required reading this week. And I'm a little bummed I didn't read it because it sounds like it was fun. It is interesting to hear you guys do it. Maybe not. I read Green Valley last week. Green Valley's awesome. Really loved it. I loved that Max Landis basically",
            "start": 2377.72
        },
        {
            "text": "didn't read it because it sounds like it was fun. It is interesting to hear you guys do it. Maybe not. I read Green Valley last week. Green Valley's awesome. Really loved it. I loved that Max Landis basically writes comic books so that they can be immediately turned into movies. Dude, that's my favorite. It was that was very much for Tim to read it. Very like that. He, he takes these big. Well, I want to talk about that. You guys already talked about that. Ladies, gentlemen, please welcome for the first time everyone in Kinda Funny team or Morning Show, Mr. Greg Miller. And then I'm getting the **** outta. Yeah, that's me. Like this **** **** everybody. Let's say we, it's got they pass the last night or whatever you smoke in this. I'm soon as it's like, I, I'm not paying enough attention to it. Yeah, but as soon as we get super illegal, I really want to be on. I want to see you. Ganja God. We're calling it because would you get drunk putting a table out there and just having you guys sitting",
            "start": 2429.59
        },
        {
            "text": "yeah but as soon as we get super illegal I really want to be on I want to see you High Ganja God we're calling it because would you get drunk putting a table out there and just having you guys sitting there I would say we start the show out there with us just well it's not even start the show it's just it's footage of us smoking weed outside although you want further let me put a plate of brownies on the table Oh God one weed brownie in the middle of them what is the brownie like we're all eat one some Russian people don't handle marijuana well me literally all of you like Nick I don't think you've ever smoked weed so Greg yeah last week yeah or two weeks ago we're at a Green Valley we didn't we assign the new required reading yeah Motor Crush Volume One correct by the team that made Batgirl of Burnside Cameron, Brendan, Babs and we had to read it we had a week and a half or two weeks I guess sure with the Thanksgiving break right what did you think about it still don't like it",
            "start": 2483.28
        },
        {
            "text": "Batgirl of Burnside Cameron, Brendan, Babs and we had to read it we had a week and a half or two weeks I guess sure with the Thanksgiving break right what did you think about it still don't like it really it's just not a comment for Greg Miller I just don't enjoy the setting I love this team um I think they've made cool characters here I just don't care about this motorcycle world at all it's like set in you know a world where moto sports are the biggest thing going and I that's alright like that's such a bleep I don't give a **** about motorcycle racing at all racing in general so it's like all right and then you read through and I think there's cool things happening I wrote down names because that's always my biggest play yeah I liked all stuff with land the tech you know he in the first issue you required reading you should have read this you know he sees her with all the drugs or whatever like the N.O.S. or whatever is a jerk that was in that he gets pinched he gets killed like oh",
            "start": 2533.71
        },
        {
            "text": "issue you required reading you should have read this you know he sees her with all the drugs or whatever like the N.O.S. or whatever is a jerk that was in that he gets pinched he gets killed like oh wow what's happening what is this stuff they're putting in their cars then there's the twist that she needs it to live okay and for me it just took so long to get to the part of you she's like not she's like some experiment baby and that's why she's around and that's what's happening I think the cliffhangers cool I think it really cool when she takes it and runs super super fast and like disappears and comes back and spent two years yeah that's a **** cool cliffhanger what's the deal with it right now are we caught up now has the been more there's more no no okay yeah yeah I think Issue 9 is about to drop really yeah yeah yeah so there's some in another train there has been another volume got it they have gone beyond this in the books interview loved it I loved it for what it is yeah and",
            "start": 2580.33
        },
        {
            "text": "about to drop really yeah yeah yeah so there's some in another train there has been another volume got it they have gone beyond this in the books interview loved it I loved it for what it is yeah and that's my thing is like you say oh the world's not for you the world is entirely for me freaking just vibrant neon nonsense right well of all of that I love all of the the color palettes they use a lot of Blues a lot of Pink's it's very Kinda Funny Live I'm a big fan of that stuff also arts awesome hasn't always great something about uh racing like like not neck like not real NASCAR **** but there's something about like the F-Zero style thing there's something about obviously Fast & Furious yeah there's something too gotta um Speed Racer like really this this reminds me of a girl gang Speed Racer and I'm like **** yeah sign me up for that sure there's nothing like the attitude of the characters and the way that they're written it's very Mean Girls it's very millennial like high school",
            "start": 2622.68
        },
        {
            "text": "Racer and I'm like **** yeah sign me up for that sure there's nothing like the attitude of the characters and the way that they're written it's very Mean Girls it's very millennial like high school drama you type stuff so I'm all over that and there's just something that I just really enjoy about race cars fast and that's what we do and then having the N.O.S. that's drugs and it's like this is the most stereotypical nothing is original in this not a single thing yeah it doesn't matter to me there was a show called NASCAR 000 on the Fox Saturday morning cartoons that would come on after Digimon and let me **** tell you Greg it was fantastic it was essentially just F-Zero it's like these crazy-ass cars dad like there's a the Speed Racer movie yeah every week fighting crime but if they're us we got to get back to the race I there's something about that that I just it is like it's candy to me it's sweet sweet candy it reminds me just action figures and playing with my Legos and with",
            "start": 2663.03
        },
        {
            "text": "us we got to get back to the race I there's something about that that I just it is like it's candy to me it's sweet sweet candy it reminds me just action figures and playing with my Legos and with Transformers and **** and I I love it because they took that stuff and then just added all the the girl gang **** that like I can just get down with there was Snotgirl a lot see now you just nailed one of my problems with it is that I love Babs her artwork is amazing Hugh said the book is beautiful it's fun it's fun just to look at even though I didn't enjoy the story because I don't enjoy the world it's not invented but it's not even that like the characters are interesting and good and I enjoy your father Sully and the play off of Domino is and her ex coming into the picture and how they're gonna handle all that stuff super hot yeah she's a very attractive woman but when she's brought in she reminded me of Snotgirl which then reminded me man I wish I was reading more Snotgirl",
            "start": 2706.83
        },
        {
            "text": "how they're gonna handle all that stuff super hot yeah she's a very attractive woman but when she's brought in she reminded me of Snotgirl which then reminded me man I wish I was reading more Snotgirl because that's just a world I'm way more into than I am this yeah and so that's the thing where you tell me I mean the Mean Girl aspect of it it's the same thing where it's like man this feels in certain sections and certain relationships so much like Batgirl of Burnside man I wish I was reading Batgirl of Burnside you know what I mean like it was anything where it's I prefer this to that girl girls your **** II a lot of the characters I just like they did remind me of very similar archetypes and very similar like setups and stuff but I feel Batgirl of Burnside got a little bit convoluted because of all the horse the Joker storyline going on it even taking the events and all that out yeah just the storyline of Batgirl of Burnside like well how the villains came in and out and whatever",
            "start": 2746.05
        },
        {
            "text": "because of all the horse the Joker storyline going on it even taking the events and all that out yeah just the storyline of Batgirl of Burnside like well how the villains came in and out and whatever yeah the overarching plot was great yeah but I feel like they introduced too many ancillary characters sure that like the whole the The Black Canary and all that stuff is that cool great yeah and it kept going and kept going kept going kept going like what the **** is happening yeah yeah hey where's with this it was a small enough crew that I was like cool and then they did the thing where they introduced all the other people and that's another thing I really love about this is let's have stupid over-the-top characters I loved it so much in Speed Racer yeah and there's something about what this book does to me that I enjoy is it combines three of my favorite types of things the stupid like we're doing these racing worlds and Speed Racer type **** the Mean Girls style millennial",
            "start": 2785.83
        },
        {
            "text": "what this book does to me that I enjoy is it combines three of my favorite types of things the stupid like we're doing these racing worlds and Speed Racer type **** the Mean Girls style millennial dialogue and it focuses on a bunch of women that are just **** hot girls and then the third thing which is the Street Fighter idea that there's a bunch of characters each had their own unique name their own unique power and their own unique thing and yeah they do and it's just stupid because it's kind of like Twisted Metal sure this is like a happy Twisted Metal okay thank you I just I enjoy this up it's stupid dumb **** and it said to me that when people talk about popcorn movies or whatever that's what this is to me and I feel like they did a great job and that's totally fair and like to what you're saying I won Speed Racer came to theaters I was like nope no thank you did not want to see that movie no I didn't want to watch it in I don't watch it now so do you want to read this",
            "start": 2825.73
        },
        {
            "text": "to what you're saying I won Speed Racer came to theaters I was like nope no thank you did not want to see that movie no I didn't want to watch it in I don't watch it now so do you want to read this comic book before this week don't read it now you know and I mean that's what I'm saying Greg Miller knows what Greg Miller likes does Greg Miller like lick the table know so he doesn't do it is like you can't pass you though so yeah I think I mean it's the same thing I would have told you I think since we started Comics with Wednesday here on the Kinda Funny Morning Show people have been saying read Motor Crush read Motor Crush me to Motor Crush and I've been like since they started saying that I've been like I love the team love the art I didn't like Issue One I don't think it's a book for me it's not a book for me but it's very much if what we're talking about if you're like know all that sounds great then it's gonna be great if you're with me or just like yeah I don't give a ****",
            "start": 2871.45
        },
        {
            "text": "me it's not a book for me but it's very much if what we're talking about if you're like know all that sounds great then it's gonna be great if you're with me or just like yeah I don't give a **** about motorcycle the chats on my side when it comes to Speed Racer oh so if that's true you should read this books it's cool although I will say am i interested in going forward and read more nah I'm not yeah like I'm good and I kind of wish that it kind of just ended instead of like being an ongoing thing but like I don't know we'll see maybe I get back - you're not gonna get back - because the problem is it's not me Toni we're good populist yeah I just tell I didn't need a Speed Racer - and they didn't make a speech you know what sucks Kevin what we're never gonna get a 4K Ultra HD Speed Racer they deleted the files the effects were mastered in 1080 um those dumb **** **** you read anything else comic-wise this week no I didn't okay I read all much stuff and it was all good stuff",
            "start": 2914.89
        },
        {
            "text": "Racer they deleted the files the effects were mastered in 1080 um those dumb **** **** you read anything else comic-wise this week no I didn't okay I read all much stuff and it was all good stuff because what I did is huh you got that good **** I got that good **** I need to catch up I wanted to read Doomsday Clock and so if you're unaware Doomsday Clock the new DC Comics initiative New 52 issues number one just came out it's the idea of everything that's happened since New 52 including a Rebirth and all been tied into **** Dr. Manhattan coming over to this universe and wanted to play God and so that sounds really stupid and touching Watchmen of course sounds really stupid and I was like well that sounds really stupid but I need to read it all I didn't know what's happening and so I knew that before I read Doomsday Clock One I need to read all of Action Comics run that was the Oz Effect are you familiar that effect and then I need to read Detective Comics where they just brought",
            "start": 2952.96
        },
        {
            "text": "knew that before I read Doomsday Clock One I need to read all of Action Comics run that was the Oz Effect are you familiar that effect and then I need to read Detective Comics where they just brought Tim Drake back from the dead as well as effect is there's this guy Oz who's been **** around on the grace no no that's what they want you to think right too easy he's been **** around in the universe as well playing God talking to Jonathan Kent doing all those weird things occasionally confronting Superman than running away it's revealed that he's Jor-El Jor-El didn't die on Krypton that when Krypton exploded or whatever he watched everyone die around him right but something Dr. Manhattan saved him now again keep in mind Dr. Manhattan's whole thing here is that he can play the time so I don't think Jor-El has been alive forever but like he decide now that Dr. Manhattan came over here to start **** around he's gonna keep Jor-El alive and so they brought him over there and he's trying",
            "start": 3001.81
        },
        {
            "text": "think Jor-El has been alive forever but like he decide now that Dr. Manhattan came over here to start **** around he's gonna keep Jor-El alive and so they brought him over there and he's trying to get Clark and Lois and Jonathan to leave with them like this place is **** the heat is coming he's gonna wreck shop and ruin everything Superman's like I'm gonna stay and fight him then he's like you can't he's you know far beyond he's made all this other **** happen before Oz Effect whatever it wasn't that great but I knew I need to read it meanwhile I'm Detective Comics they got Jason Todd and I'm sorry Tim Drake back fish it's great Tim Drake's back he's reminding me why is the best Robin and he's talking to everybody he's reunited with Spoiler he's doing all this stuff c'est magnifique dabbed in Tim Drake and Spoiler reunited with Spoiler got it okay remember Spoiler the character lab Spoiler was this like not a chance imagine if she was when he when there was the Tim Drake Robin book they",
            "start": 3047.11
        },
        {
            "text": "in Tim Drake and Spoiler reunited with Spoiler got it okay remember Spoiler the character lab Spoiler was this like not a chance imagine if she was when he when there was the Tim Drake Robin book they introduced a Spoiler who was another vigilante but it also another teenage villain Lee they had a relationship because she's a cute blonde mmm-hmm they get reunited Spoiler's then I went and read Batman as well caught up on this because I'm they didn't hold what they did the **** cliffhanger like Image **** Bruce drops to one knee proposes the a Catwoman right mm-hmm says I want to marry you Selina Kyle yeah then they did however many issues of War of Jokes and Riddles which was a fine series all right cool it's like a you know a flashback to the first time Riddler and Joker are doing **** in Batman's a young Batman he's doing all this stuff they finally end that and then we're dropped back into continuity here of like alright cool cat Bruce just proposed a Catwoman where do we pick up we",
            "start": 3086.29
        },
        {
            "text": "Batman's a young Batman he's doing all this stuff they finally end that and then we're dropped back into continuity here of like alright cool cat Bruce just proposed a Catwoman where do we pick up we pick up in the **** desert Tim we pick up with Batman dressed like **** nightmare Batman from Batman v Superman don't let this sour you it's just to go under that's all I'm saying just a cool outfit cool but it's him and Catwoman riding out there and the horses maybe camels I forget it but they're riding out there in the desert nobody's 100% aware what's going on back and got and they're being all cute I love you I love you bats I love you cats it's really funny we flash back over to Gotham or at night flashback we just see what's happening Gotham Alfred's got gathered everybody up all the Jason Todd Dick that family the Bat-Family and he does the reveal that you know I have to bring you the other to tell you this Bruce is you know proposed the Catwoman they all freak out it's really",
            "start": 3129.37
        },
        {
            "text": "Jason Todd Dick that family the Bat-Family and he does the reveal that you know I have to bring you the other to tell you this Bruce is you know proposed the Catwoman they all freak out it's really funny but then it turns out what they're doing right is that they're going to Talia al Ghul's house pretty much okay because Talia is housing a woman that Catwoman covered for in Gotham that Catwoman in current continuity everything she's a murderer or whatever but she's really just covering for this one woman Talia is housing that woman so we go there and we have this **** awesome **** awesome fight scene between Talia Batman and Catwoman bat and Talia takes out Batman pretty quick right and he's like beat the **** he's all **** up and then Catwoman is Talia a fight or whatever and it's just as **** rad scene of that look cuz you know like Talia is like you know the beloved the Bruce whatever they have a son together Damian and all this different **** and there's this ****",
            "start": 3169.45
        },
        {
            "text": "just as **** rad scene of that look cuz you know like Talia is like you know the beloved the Bruce whatever they have a son together Damian and all this different **** and there's this **** they fight and it's **** awesome and great dialogue awesome fight scene Catwoman gets the one up gets away for a second Talia falls down to Bruce and his base leg so this is your fiance and he's like yeah she's like I really like her and then it runs out to fight it was like oh my god this is why comics are **** great it's like awesome like and it's awesome that that's happening in Detective Comics yeah that's happening in Batman right and then over in Detective Comics they're doing all the other stuff so I'm getting what I want it's the same way that right now Action Comics and Superman are different I don't think either are super strong and the Super Sons is different on top of that when I have all this stuff the reference in Conner Kent again then I finally went and read Doomsday Clock did you yeah would",
            "start": 3211.12
        },
        {
            "text": "either are super strong and the Super Sons is different on top of that when I have all this stuff the reference in Conner Kent again then I finally went and read Doomsday Clock did you yeah would you say again a tie-in to Watchmen in Dr. Manhattan Doomsday Clock **** awesome I'm super excited to see this my one downside to this is that I think it's monthly if I have a **** year of this like whenever a year of people drawing out this **** that doesn't sound right it sound good but I couldn't get it all couldn't get it 100% decided on the internet but I'm pretty sure us we're at but Doomsday Clock I expected to pick up and have it be if you remember Batman and Flash: The Button crossover can you remember this at all no when the The Comedian's button showed up in the Batcave and then I I'm just talking to you this got it these are just breadcrumbs forgot it ah Doomsday Clock picks up and it fixed up my thing is like 1990 but Americans remember Watchmen of course a period piece in the",
            "start": 3248.75
        },
        {
            "text": "just talking to you this got it these are just breadcrumbs forgot it ah Doomsday Clock picks up and it fixed up my thing is like 1990 but Americans remember Watchmen of course a period piece in the 80s mmm but it takes up in 1990 or 94 in the Watchmen universe so like here's everything just happened in that what's what has happened since the monster fell and like you know everything I want to ruin it for you it's really interesting read and then the final page is like final four pages are a Superman story or whatever where it all kind of gets tied in a little bit so you're it's like well I can't wait so I can't **** wait no but it'd be really dumb it wasn't I'm really excited to our egos **** yeah man hope you guys are excited when the chat same thing about looking at it seems like a lot of people are saying don't spoil all the Batman books but it's at home alright you should have read the back books many new Super Sons out today I'm excited about that also just Batman: Creature of",
            "start": 3285.05
        },
        {
            "text": "of people are saying don't spoil all the Batman books but it's at home alright you should have read the back books many new Super Sons out today I'm excited about that also just Batman: Creature of the Night and I've heard good things but I don't know much about it I'll get back to you about it thanks sweetie next Wednesday by the way I think required reading for next Wednesday yeah should be Infinity Gauntlet I love that idea because I forget who I was looking at online today's was put up a screen shot of it was making references somebody's like do I need to read it, no, he do you just read the trade of Infinity Gauntlet yeah can we find 16 I've never read it we need it cool all right shut up Nick God yeah I was like the poster though we've seen the Infinity War poster dance at the top really cool Infinity Gauntlet collection that's your required reading for next Wednesday for Comic Wednesday cool Nick you want to sell back in yeah hi Gary Whitta don't sound so excited we're in phase 3 of",
            "start": 3324.83
        },
        {
            "text": "cool Infinity Gauntlet collection that's your required reading for next Wednesday for Comic Wednesday cool Nick you want to sell back in yeah hi Gary Whitta don't sound so excited we're in phase 3 of our relationship with Gary Gary doesn't have tennis - Gary doesn't have to bring snacks anymore Gary just can come and hang out Gary if you have extra snacks he's gone so he when it's up to you please don't feel pressured in any way Kevin just a hungry boy Kevin we're gonna get you some lunch Lady Jaye let's check my kid on tips and see if anyone gives any more of those love in you we do have one more tip this comes from Top Tier Taco says check out this trailer for RoboDoc the creation of RoboCop documentary and any give us link there that's long you can skip through it but worth watching on your own time that sounds awesome I'll definitely get out RoboDoc, RoboDoc thank you for that I would love to see that I love hopefully you found the new RoboCop because if they did documentary",
            "start": 3379.76
        },
        {
            "text": "on your own time that sounds awesome I'll definitely get out RoboDoc, RoboDoc thank you for that I would love to see that I love hopefully you found the new RoboCop because if they did documentary about that new RoboCop no way that very good ladies and gentlemen the next section we like to call PS I Love You XOXO is right now it's happening now go - KindaFunny.com/bestfriend to nominate someone you feel as being just an awesome all-around human being just like Hack11 or just MaxDidHeWin30 follow the format he is shouting out G. Murphy G. Murphy and Adam Badge Adam Ball I'm Kinda Funny Destiny 2 clan he says thanks for helping me get through the Nightfall this weekend there this week getting the best clan out there some sweet sweet love you the best best friends that's awesome it's true now I don't understand any of that mm-hmm but do it that's part of the fun of being me not as far as that I never have to understand",
            "start": 3447.02
        },
        {
            "text": "sweet love you the best best friends that's awesome it's true now I don't understand any of that mm-hmm but do it that's part of the fun of being me not as far as that I never have to understand that I love me you make elephants every once in a while and I just realized that you either really get something or really don't get something it's equally satisfied to what I've done is I've just come to the conclusion that I'm gonna get some stuff and some stuff I'm just never gonna get it Destiny 2 definitely one of those things it's what's Nightfall is that a raid what's a raid I don't know doesn't matter really I've already got a bridge too far when you start talking about video games that take a long period of time I blink over what happens is I go over and then I just start thinking about the eight or nine Batman, Tim it's giveaway time what's that mean that means each and every day we reached on a little grab bag of codes and throw one out at one lucky winner it is totally random but",
            "start": 3494.6
        },
        {
            "text": "there are four ways that you can enter to win one you can go to KindaFunny.com/Patreon or Patreon.com/KindaFunnyGames inter supports the two dollar above level and you're entered to win that's fantastic you also get all the perks of 100 above level 3 nope I'm doing them out of order I don't know why I'm doing it really man 3 you can be in the chat for you can be a subscriber to us in our chat hey if you didn't know if you're watching this on YouTube you're like what is this chat of which you speak will you go to Twitch.tv/KindaFunnyGames and you can support us there via Amazon Prime to get one free Twitch Prime subscription this is your reminder your daily reminder to please go do that it actually does make a big difference",
            "start": 3534.07
        },
        {
            "text": "games and you can support us there via Amazon Prime to get one free Twitch Prime subscription. This is your reminder, your daily reminder, to please go do that. It actually does make a big difference for us. If you're not gonna do for us, give it to someone, otherwise you're just wasting it every month. I gave mine this month to Fran Mirabella because he's a beautiful human being, is with great hair. Fantastic. Have I ever watched him do a Twitch stream? No, I pop in all just, yeah, it's adorable. I'm missing out. So there you go, Tim. Before we get that way though, today's episode of Kinda Funny Morning Show and this giveaway is brought to you by Dollar Shave Club. Dollar, dollar, it is y'all. Holiday time. Mm-hmm. Dollar Shave Club is offering all sorts of fun goodies, not the least of which is a gift membership and e-cards that are available right now. You think that will help cover the names on your holiday shopping list, right? Dollar Shave Club makes products for your hair, face, skin, shower, and your bod, Charlie's.",
            "start": 3572.35
        },
        {
            "text": "e-cards that are available right now. You think that will help cover the names on your holiday shopping list, right? Dollar Shave Club makes products for your hair, face, skin, shower, and your bod, Charlie's. Probably the best thing you can do, right? It's everything you need to make a look, is to look and feel amazing. It's all their own original stuff. It's only, they only use the finest premium ingredients and they deliver it to you just like they do their razors. Tim is a big fan of the egg fan. You like the razors, you like the Dr. Carver's Shave Butter. I do. You and Kevin apparently, you're stealing all of these. Jesus, I'm not getting any of the perks with me sponsorships and I'm mad as hell. You got slow hands, you got them slow hands. But it's okay because if I wanted to take advantage of this, all I would is just go to DollarShaveClub.com/Morning and take advantage of this amazing deal. What is the deal, you ask Tim? You're like, what is the deal? What is it? I've never heard this sponsorship before.",
            "start": 3611.65
        },
        {
            "text": "is just go to DollarShaveClub.com/Morning and take advantage of this amazing deal. What is the deal, you ask Tim? You're like, what is the deal? What is it? I've never heard this sponsorship before. Well, they've arranged for all of us to try our first month of their razors along with the travel-sized version of shave butter, body cleanser, and yes, those sweet, sweet butt wipes just for five dollars. After that, replacement cartridges ship for just a few bucks a month. It's the Dollar Shave Club Starter Set. Get your five and get yours for just five dollars exclusively at DollarShaveClub.com/Morning. Again, that's DollarShaveClub.com/Morning. It's a perfect Christmas present if you're like, \"I don't even know what to get these people.\" Here, Dollar Shave Club. And if you happen to know Chris Pratt, maybe you could be like, \"Here's your Dollar Shave Club. I'm gonna get it for you so you can shave the stupid mustache.\" He's first off, again, the mustache is amazing. He needs to sculpt that **** right.",
            "start": 3650.65
        },
        {
            "text": "maybe you could be like, \"Here's your Dollar Shave Club. I'm gonna get it for you so you can shave the stupid mustache.\" He's first off, again, the mustache is amazing. He needs to sculpt that **** right. And for that mustache, she needs a precision instrument. What is that precision instrument? Dollar Shave Club. It's their razor. Boom, boom. It is. It's sculpted perfectly. Well, it's a little, it's a little scraggly between. He has that like, \"I just got off a porn set and I didn't feel like I'm in that part of my life where I realized doing porn is probably not the best thing for me.\" Moving on, ladies and gentlemen, your giveaway today is going to someone from B-buh-buh-buh-buh-buh, the Twitch chat. It's gonna get a Walk in the Dark on Xbox One. Congratulations, Steel Card 30. Steel Card 30, Dark on Xbox One. And now is the time on Sprockets when we dance. This is my favorite part. This is when we get to interact with you, the audience out there. Queue up them questions. You have the questions, comment, and concern.",
            "start": 3687.85
        },
        {
            "text": "Now is the time on Sprockets when we dance. This is my favorite part. This is when we get to interact with you, the audience out there. Queue up them questions. You have the questions, comment, and concern, insurance, compliments, cue cards, anything that starts with a C letter. Not cue card that starts with a Q. It doesn't matter. We're gonna take those from the norms and we're gonna go into the Q cards. The Q card absolutely starts with a Q. Thank you. I know is the core Netflix queue. It's course of the cleaners in your A. What's the game you fellas wish you had more time to play? Definitely Destiny 2, so I can make more fun of it. Game I wish I had more time to play, Nier: Automata. Oh wow, yeah, good job. Panzer- says, \"Walking the Dark sounds like an awesome biopic.\" But I think I have to read out the right way, \"Walking the Dock.\" Fine, that's awesome, epic. Do we want to talk about this because I think today is the second last day? Yeah, so I think I said no, this is our Fan Mail here and",
            "start": 3729.61
        },
        {
            "text": "to read out the right way, \"Walking the Dock.\" Fine, that's awesome, epic. Do we want to talk about this because I think today is the second last day? Yeah, so I think I said no, this is our Fan Mail here and you're gonna get a nice little Christmas card from us this month or the December holiday spirit. We're gonna sign it, do all those ring a little jingles. If you guys want to back us at that tier over at Patreon.com/KindaFunny, you will get this fun holiday card and it's probably gonna say something completely inappropriate written by yours truly. It's true, Tim will just write Tim with a little heart. Patreon.com/KindaFunny, get yours today. Shot in Japan to Moscow. We've been having a lot of fun of these books, Daniels. We killed it. I'm gonna be honest, yeah, last month was the aprons, of course. This month is this. We got a lot of fun stuff planned for 2018 as well. Honey Boo Boo says, \"Nick, have you ever seen The Neon Demon?\" I have. It's a, it's a Nicolas Winding Refn's latest film. It's",
            "start": 3782.77
        },
        {
            "text": "course this month is this. We got a lot of fun stuff planned for 2018 as well. Honey Boo Boo says, \"Nick, have you ever seen The Neon Demon?\" I have. It's a, it's a Nicolas Winding Refn's latest film. It's on Amazon Prime right now, I believe. And it's a self-anointed Amazon Studios movie, right? It is. It is actually an Amazon Studios movie. What a wild movie that. It's a ****hole. I liked it. I liked it too. Is Morgan S. one of those things? Paula fell asleep midway through 'cause she was super tired. Hey kid, to me, end up here like, \"Well, what is happening?\" I was with your friend Nicole. Yeah, you know Nicole, maybe. Sure. Anyways, Paula wakes up and she's like, \"What happened?\" And we're both like freaking out, like just kind of like, \"What?\" And I explained what happened and she's like, \"There's, you're just making **** up.\" Because sometimes I do that, I'll just make up. Okay, yeah, preaching to the choir. Yeah, and Paula was like, \"You did not believe me.\" And Nicole looked over and there's like, \"Anna, was it?\" Yeah, it's **** weird. It's",
            "start": 3820.45
        },
        {
            "text": "sometimes I do that, I'll just make up. Okay, yeah, preaching to the choir. Yeah, and Paula was like, \"You did not believe me.\" And Nicole looked over and there's like, \"Anna, was it?\" Yeah, it's **** weird. It's definitely worth a watch. It's beautifully shot, but it's weird as ****. Ah, Sarkin says, \"Tim, have you seen The Hey Arnold! Jungle Movie yet?\" No, I did not. I need to get on that though. I heard good things about it. What is it? The Hey Arnold! movie they just put on Nickelodeon. Grand Champ Zero One says, \"How close do you think the Avengers: Infinity War movie will stay to the actual Gauntlet comic?\" Stay exactly as close as Civil War did to Civil. Yeah, I don't, it's gonna stay. I mean, based off of what I've seen so far, I don't think it's gonna be very close to the comic. At least the thing, Civil War in the Marvel Cinematic Universe, excellent, better than the comics, been an undeniable. But it was a different beast. It was a different, better beast. Okay, that's new, an opinion. It's a fact, actually. Sure, you ask me if",
            "start": 3865.99
        },
        {
            "text": "Cinematic Universe, excellent, better than the comics, been an undeniable. But it was a different beast. It was a different, better beast. Okay, that's new, an opinion. It's a fact, actually. Sure, you ask me if you have too much naked. Tim, have you heard that Warner Bros. is just making a Scooby-Doo live-action spin-off about Velma and Daphne as high school students trying to investigate students disappearing? Sounds like a Tim Gettys movie. I, I did hear about this. We'll see. I need more information. They're gonna have to get me super hyped for it. Uh, they're ****ing Scooby-Doo-ers. I don't, has nothing to do with the other Scooby-Doo movies. Well, how you do Scooby-Doo? That's cool. The Scooby-Doo movies are great. Great's a lot like everything. You're not that bad. Yeah, well, I still, it's too long ago. Real quick, Titan Matrix, that's a nationalist, not a racist, so you sound like an idiot. Wow, ladies and gentlemen, we are now in sub-only mode. If you're new to the show and you don't know what that is, well, they're the",
            "start": 3910.02
        },
        {
            "text": "cooler people, your children feel the chosen feel because they've chosen to be cool. Astronaut Evan Teen says, \"Tim, have you tried all the LaCroix yet?\" No, I have not yet had the NiCola one, but I found all the other flavors that. Cola. Panzer- says, \"Linda Cardellini is Velma, please.\" I think she might be a little beyond of a high school range at this point. Interacting career, if they believe they will succeed, that's true. New flashes. Nick just said that. Uh, sorry, wrong one, wrong. And he's responding someone else. Oh, Trevor Jones. Trevor Jones says, \"Opinion on hamsters?\" The question mark. Hamsters. Uh, the weirdest ****. Yeah, that's crazy. Hamster Dance. That was a song that happened for a while. I had friends that were into smaller, rodent-like creatures as pets growing up and I always thought a little weird like,",
            "start": 3956.34
        },
        {
            "text": "****, yeah, that's crazy. Hamster Dance. That was a song that happened for a while. I had friends that were into smaller, rodent-like creatures as pets growing up and I always thought a little weird like, shouldn't we have killed this thing for the inside? This is a fun little tie back to the beginning on this episode earlier. We started this episode with the Cha-Cha-Cha Chia. Yeah, I told you, kid, I went to school with a Michael Chiha. Michael Chiha got bit by his pet hamster on his face, scarred for life. No ****. Yeah, that's why you don't let **** small rodents into your face. If they get into your face, you take him by the neck, you squeeze him real hard, the head pops up. I just don't really have next days. My brother did get bit by a hamster, his own hamster that he named after Kevin's mom. Weird. And on that note, ladies and gentlemen, that was your Kinda Funny Morning Show for today. Thank you so much for joining us. Tim, thank you for the Q. I'm glad you liked Motor Crush. I'm bummed that Greg doesn't sound like",
            "start": 4014.96
        },
        {
            "text": "he likes you so much. But let us know what you guys thought about that in the comments below. Of course, let us know what you guys think about the Infinity War trailer. Do we get stuff right? Do we get stuff wrong? Are we talking out of our ass, spoilers? Yes, but we're all very excited for it. I will see you all tomorrow. I can't remember who's hosting with me, but I do know that coming up right now is Greg and Gary Whitta talk some games.",
            "start": 4057.24
        }
    ]
}