{
    "id": 3185,
    "video_id": "N3d57b5aWFs",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Andy Cortez"
    ],
    "title": "Knowledge Is Power - Kinda Funny Plays",
    "description": "Sponsored by PlayStation\n\nCheck out PlayLink here!: https://www.playstation.com/en-us/games/playlink-ps4\n\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\n\n\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1511888404,
    "duration": 1739,
    "transcript_chunks": [
        {
            "text": "What's up everybody, welcome to a sponsored Let's Play here on YouTube.com/KindaFunnyGames. I'm one of your hosts, Greg Miller, alongside the producer slash the new Sir Dicks R. PLO, the Hispanic heartthrob, Andy Cortez. I mean, I mean more than that right now. Bring it up, Twelve. Thank you very much. Over there, the pure one, that's Tim Gettys, lead team host. And we are playing Knowledge Is Power, a PlayStation game you play with your phones. Again, sponsored by PlayStation, take with a grain of salt, but we love trivia here and we love getting trophies, so we're all about that. You play with your phones, it's 20 bucks. If you want to know more about it, it's down below, click the link in the description. For now though, as somebody who clown folks out of Buzz! Trivia on PlayStation all the time, I'm taking you to task and you task at me, everybody. Well, that's why I chose on you. I always more of it. I saw that character like, that's a new character. Tim's real age, the fanny packs. I'm really into like a",
            "start": 0.03
        },
        {
            "text": "you the task and you task at me, everybody. Well, that's why I chose on you. I always more of it. I saw that character like, that's a new character. Tim's real age, the fanny packs. I'm really into like a bad guy in a Despicable Me. Okay, that's gonna be R. That's that is nickname to that. I think that I'm always looking a little under the cameras, off-putting it nicely. There we go. I don't know why I have wings. I wish I knew you in high school because it's boy, he's exactly that. Here we have news, Jimmy Neutron here. Home, Jimmy Neutron. Jim's anything for third poor kid. Hold on, senior. I'm Jeff Jimmy Neutron. Kevin, give me a look. I don't know what we going into the knowledge hole. I love going in the knowledge hole. It's not mine. I've chosen. I chose hobbies. I'll tell you, I choose hobbies. I chose music. They told me those music, horrible jerks. Look at me, Andy. This is a bully because it was random and we won 'cause we're the roundest. How the best you guys play ball there. Who is ready for the very first",
            "start": 40.47
        },
        {
            "text": "they told me those music, horrible jerks. Look at me, Andy. This is a bully because it was random and we won 'cause we're the roundest. How the best you guys play ball there. Who is ready for the very first question of a guy claiming because we coming in hold you have and remember that quickie wants more points. You'll be given that quicker. One car manufacturer makes the RAV4. That's why you ****. You shouldn't have a power of it. You didn't know what it. Do you mean around for just five? So much screen, so I did it. Yeah, so I think it's to change it, but you won already. Yeah, I know. I'm telling ya, it didn't make sense, dum-dum. Animation studio made Spirited Away and Ponyo. See, G.G. - easy does. Oh man, Studio Ghibli. I was glooped in frozen inside to wipe away the glue to see the answer and then I had a tap to break the ice, slowing me down, not giving me an assumed to get as many points. That's needle dangerous. Don't **** want to see my",
            "start": 115.48
        },
        {
            "text": "inside to wipe away the glue to see the answer and then I had a tap to break the ice, slowing me down, not giving me an assumed to get as many points. That's needle dangerous. Don't **** want to see my character just do a little victory action. It was fun. I'm not having a good game. Thank you, Spanky, period. You're like in the games in general. I think I'm just your over any in general. I understand their sex life. That's fair. You know, Nene, that's bad. You like you. Thanks. We all know there's one answer to this. Actually, I guess there's there's two answers. Please, no more that are various. Then even pull or four shows you Joss. We gonna talk about keyframes there. Yeah, man. I want to talk about some facts. CC per hour 2016. How do you make a Venetian blind effects? You know, I meant to pick Andy for this, but I don't know. I did it. I just something about I got happy. I like you little the bottom area here. Is that some nibblers, Greg? We're gonna eat the letters away. Crazy. Are you chilly over there? Oh",
            "start": 299.48
        },
        {
            "text": "this, but I don't know. I did it. I just something about I got happy. I like you little the bottom area here. Is that some nibblers, Greg? We're gonna eat the letters away. Crazy. Are you chilly over there? Oh ****, we got gloop up there. Once enjoyed gloop and your fastener and never be able to survive just like we did the gloop. Yet it's terrible. Oh no, avoid the bombs. What the heck? Gosh darn it. It's definitely out of Jedi. You don't know that, dude. Tim, you picked The Bulletproof Monk. Never saw her. That was a ones. Jack Black, the others Chow Yun-Fat and Seann William Scott. Bulletproof Monk. Yeah, I believe he is The Bulletproof Monk. He is. Yeah. Oh, look how hard they fall. Stupid. You are into you. I'm gonna bomb you. You should bomb people. Sounds really messed over. Damn. What did it do? Yeah, we now have a report about and if you tap in the blob, we know your time wants to bomb somebody. I'm going to bomb Greg Miller. Damn, dude. Linking. Okay, just oh Jesus God. By the animals. ****. I wish my phone went bigger.",
            "start": 356.75
        },
        {
            "text": "and if you tap in the blob, we know your time wants to bomb somebody. I'm going to bomb Greg Miller. Damn, dude. Linking. Okay, just oh Jesus God. By the animals. ****. I wish my phone went bigger. About about uh, I like ideas. If I like this, doo doo doo doo doo doo ba ba ba doo. Do you know that one? It's all okay. What man? I'm very lost. What? Just do something you do. Okay. But yeah, that was cool for a second. Oh, way you have to wait. So what it was shown us like, you know, the America and then bald eagle where I didn't have other things in there. We're gonna do it 'cause they're not seem. Let's go with I'll go martial arts. Going everyone. Let's go my farts. Oh, you're so lonely. I got it. Would've been like, how do you do? What do people karate chop through boards? Got it. Me or bricks. The Facebook group has already caught on to Andy. What happened? Oh no, Andy with award. Tim dies immediately and smashing one of them, one of the games. And he goes, oh no, Tim, what happened? Dump what you do. I bet go get it.",
            "start": 441.8
        },
        {
            "text": "has already caught on to Andy. What happened? Oh no, Andy with award. Tim dies immediately and smashing one of them, one of the games. And he goes, oh no, Tim, what happened? Dump what you do. I bet go get it right. And then bet on you because I know it's gonna be his daddy's home question. Bigger wish. Nice home to this weekend. I'm in Maryland. Love you. Watch Whitney. Will call fine. I'm good. I hate you all. Well, you're waiting on it. What happened? Oh no, double bomb bomb. Double bombs. You know what? And enjoy bomb and frozen thing. Oh, you ****. Did you do? Well, I've got a little trouble. Yeah, come on ahead. Badass. What? That's good. He did not always suffer from amnesia. **** crushed that one. Did you got any other? But I have these stupid bombs. I don't think I did it. I think I did. You've been on me. Yes. Oh, I don't know how much I bet on you. You know, that was kind of a tough question. That was hard because you had to read all for them at first and they're also like, you relive the same thing. So I'm like, similar it",
            "start": 552.75
        },
        {
            "text": "know how much I bet on you. You know, that was kind of a tough question. That was hard because you had to read all for them at first and they're also like, you relive the same thing. So I'm like, similar it was. Well, I'm gonna say there's anything for that. I just don't. Jody, you could take the ****. Bite your chance to do this. 15 or 10 bucks. Bashing up that sound. These is just a topic there. Now ****. Now, how do I bet on people? It's one of the things I'll pop out. I did for me at least coming up. Oh, you've passed. What you're gonna do? Jump. Oh man, good. Yeah, water. That's my brother. Blue your water. I'm get bombed. Bomb dog. Now we can keep going to France. Damn busy. That's why the bombs are so cute. We all know in our village and she come like this, gives ice and bombs on that one. I want you guys to know it sucks to be a channel. Oh yeah, I'll take it. Are you gonna crack under the pressure? So winners, you didn't. I awesome zone. Not me is now beating everyone. You phone. That's why it's so far so big. I'm gonna",
            "start": 627.08
        },
        {
            "text": "sucks to be a channel. Oh yeah, I'll take it. Are you gonna crack under the pressure? So winners, you didn't. I awesome zone. Not me is now beating everyone. You phone. That's why it's so far so big. I'm gonna is a famous line more. Yeah, guys, I got it. I got a story for Lou. Ah, damn it. Go with that spin, man. And a man, how they use that to like try to that tuition. You were too busy. Always powerful. Damn it. Give me call them Blackberries for me. Then Blackberry tasty. If I win this game, I wouldn't be expecting for my grades. You 'bout to get Double Trouble, Greg. Why, man? Bluefish. Because everyone knows that you are a cheat. Damn. My story is double fries. No, nobody's afraid of them. Wow. Tim's lot in terminating Andy. Scrubs or abandon it while you're at it. You know, is the dimmer. These are the key. All the words aren't there. All the letters are gone. And he's trying to find more. God, you guys would be ****. Goddamn ****. Skank. Loopy. Oh, get newbie to speak and off. Thanks, man. Oh man, pretty sweet, sweet. Thanks.",
            "start": 739.55
        },
        {
            "text": "there all the letters are gone and he's trying to find more. God, you guys would be ****. Goddamn ****. Skank. Loopy. Oh, get newbie to speak and off. Thanks, man. Oh man, pretty sweet, sweet. Thanks. British guy. Thanks, British dude. I would have been anyway faster, but is so bad, so fearless. I guess it's a no be fast for a boy. I'm tight and laugh with Greg. You guys are all just beating up on me. Mmm, because you know I've been here. We go. Going to the doors, the different doors. You're gonna looks like Nigel Thornberry. Nigel Thornberry like back in his hippie days. Ya know, the animation on the outside. **** man. Who are we supposed to know this? You guys are idiots. I love it that it's working for me. I don't know, man. I don't know. Gosh, dude. I've been so terribly. Britney songs. I would have any grace. I just thought wasn't marijuana really? No, that's gotta be Willie Nelson. Give me the Blackberries, guys. Give me their Blackberries. That's enough. Come in last place. Maybe you want water. Is that how",
            "start": 823.32
        },
        {
            "text": "grace. I just thought wasn't marijuana really? No, that's gotta be Willie Nelson. Give me the Blackberries, guys. Give me their Blackberries. That's enough. Come in last place. Maybe you want water. Is that how it's not water the ticket? Yeah, I'll take the one. Don't take the champion. Is you're not the chance everyone. Yeah, that's um, we're gonna get all right. You booty slip a hit on films. Yeah, get crime. Happy day. It should roll and have like a higher chance of it. Yeah, I think so too. Like it should be 134. Then sorry, my dear cleaning. No, what is it? This is a democracy. I hope that it keeps not me to look at the TV. Yeah, I keep it look. I keep expecting to look up and see Kevin half-naked in front of me. Yes. All right, guys. No, that one. That one was been aggressive. Was nibbling. All right. I have no answer left. Insulted by that. Are happy by that that you guys don't think that I am how about that big of a threat to you? I was stupid. Tim wasn't just Greg. Really? Wait, maybe two people give me Superman, Lex",
            "start": 947.17
        },
        {
            "text": "left insulted by that. Are happy by that that you guys don't think that I am how about that big of a threat to you? I was stupid. Tim wasn't just Greg. Really? Wait, maybe two people give me Superman, Lex Luthor. It's pick laws of physics next time. Hank against me. Stacking the deck against me. I still get second on that. How's that feel? Cut the stupid gloop is dumb. What is it? What's the tens mean? I'm going for it. Just a figure that happened in the tens decade. Deal with it. We're not calling it the tens where I am. Sorry, but the roaring 0s are coming up soon too. I'll be ready. It goes like 2000, 2010s. There's just like Batman v Superman. Really upsets me. Power Clinton. This reality star became famous. Let me stop me. He's close to winning, beating me. You should have. He'll stop. Most likely to know what happened in 2010. You have to, Tim. That's true. You were let's be honest. Him is a monster, but he's not as big of a monster. Vegas. True. It's true. The bylaws of Kinda Funny, which are friends forever.",
            "start": 1018.99
        },
        {
            "text": "what happened in 2010. You have to, Tim. That's true. You were let's be honest. Him is a monster, but he's not as big of a monster. Vegas. True. It's true. The bylaws of Kinda Funny, which are friends forever. Yeah, number two, have a good time. Number number three, don't don't with me. And there's a depression really always coming for them. How do ba me get that fast? I nailed it. Okay, maybe right there. Oh, now we got to go. Now is that reframed it? Same like I told you to me. Who's afraid of the big bad wolf? You know what I mean? What the hell was that? Let's go for insects, guys. Yeah. Oh yeah, it's like bugs. You guys really bug me. Haha. Stop. Nothing like Beetle Bailey. No, I don't know what I did, but I fix me. Call the point party. What it's for a multi Pokémon multiply. It's not fair at all. A lot of points. What good guys can't even read with these other. Here's the thing. I see Greg moving his finger way before mine even popped up while trying to get the gloop off. I know the gloop's gonna be able to give you a house.",
            "start": 1116.1
        },
        {
            "text": "can't even read with these other. Here's the thing. I see Greg moving his finger way before mine even popped up while trying to get the gloop off. I know the gloop's gonna be able to give you a house. I'm just ready to go. Scoops. We got it right. Spider spider. What? All right. Home. So I get a point. Double points for that. It's interesting. Well, that sucks. What? That was not okay. We retired it because it was double if you had a hundred over. You know, he's a baby. Yes. I think it's that is wrong. Finale wrongs done. You will be a victim in two steps. Oh, me to nuke your one and then choose who's best to target. Great. So the biggest threat, guys, playing this game. That's why I'll lose if your party's too out. What units will the cops measure the sounding? Oh God, I hate you people. You all suck. It means a yellow star. **** me. I thought maybe I was gonna answer fast. You know. Oh, you guys rested by me. Which discipline makes up the final leg of a triathlon? Oh, come on. They can",
            "start": 1224.79
        },
        {
            "text": "means a yellow star. **** me. I thought maybe I was gonna answer fast. You know. Oh, you guys rested by me. Which discipline makes up the final leg of a triathlon? Oh, come on. They can always step. Told you. ****. I think I made this wrong. I **** up. I've heard from Swell Valliere, laughs, ovens, fingers. Right, right. Is it driving in? So no one **** up. Literally. No, no. I'm on top of the thing. I hit two of the other ones. Like you're wrong. Oh, you pick. So you get the right answer. Yeah. Does it do it? Does it count you down or something? Now at this point, I should pick someone else. Why? Because serious one can evaluate to which other marine creatures are dolphins most closely related to. I'm happy the answer. I thought it was really. I was pixie cucumber. Just want everyone's now. Oh, I got that last **** boy. This is tense, guys. Knowing that. Oh, you gotta live. You got got. Just is the next question. In which sport would you drive down the fairway? Phrasing. Spirits.",
            "start": 1385.14
        },
        {
            "text": "got that last **** boy. This is tense, guys. Knowing that. Oh, you gotta live. You got got. Just is the next question. In which sport would you drive down the fairway? Phrasing. Spirits. Oh, no idea. I was goofy. I see you say this now. Now don't just go to Andy. No, it's all players. Why do they have to show the animation as we get it? Because, guys, it's heightened. I have to pick one pretty. Oh, really? Mind everyone. Yeah, might say there's no emotions. Oh my God. Jesus. Networks. Do McDonald's give to their children's meal? Knowledge Is Power. And the knowledgeable. Even the Blackberries. Really, Greg? I need you to ask the Blackberries. I've never gotten. Well, I guess for men, it's the innocent one the whole time. Nobody really was really threatened. Bob just kind of lurking in the shadows. I hope you learned your lesson, guys. Don't team up on me for no reason. You know, I'm bummed that I lost. I'm happy Greg losses. Yeah, me too. If I woulda lost, some Greg wouldn't wanna never heard the end of",
            "start": 1474.29
        },
        {
            "text": "you learned your lesson, guys. Don't team up on me for no reason. You know, I'm bummed that I lost. I'm happy Greg losses. Yeah, me too. If I woulda lost, some Greg wouldn't wanna never heard the end of it. So considerations, Andy. Thanks, man. Every game we play, but I don't bring it up all that often. Andy might be the best gamer here. Either for sure. The minutes out, dude. Definitely feel so powerful right now. Let me write that 'cause I got second place. So strong. Did not baby. Okay, ladies, and Knowledge Is Power. We're Kinda Funny. This was brought to you by PlayStation. Remember, Knowledge Is Power does the PlayStation game. You play with your phones. It's 20 bucks. Down in the description, there's a link you can click on and go do it to have trivia and get really mad at your friends because they gang up on you for no reason just because they're threatened. And then clearly, when the tides are turned, they don't stop for some reason, but they think that's very enjoyable. That's why we like to act. What do I get",
            "start": 1591.4
        },
        {
            "text": "for no reason just because they're threatened. And then clearly, when the tides are turned, they don't stop for some reason, but they think that's very enjoyable. That's why we like to act. What do I get my first place medal at? No, absolutely. In the most powerful. It's in the form of a giant belt. Tim's got it. Until next time. I'm like, subscribe, share. Gonna get got got got. Get a guy. I can I can get a guy. Cut cut cut. This should be here right here. This is the video, guys. I got got got got got got a nice watch. Kevin, this is goal. Yeah.",
            "start": 1631.06
        }
    ]
}