{
    "id": 3162,
    "video_id": "nv_blGBqugY",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Portillo"
    ],
    "title": "The End of Battlefront II Drama (For Now) - Kinda Funny Games Daily 11.17.17",
    "description": "Tim and Greg detail DICE removing microtransactions and if this was a win for gamers.\n\n00:04:20 - Housekeeping\nVote for Andrea right now. We’re going to. Google “trending gamer vote.”\nAndy Serkis vid is up on patreon.com/kindafunnygames\nThe Roper Report   -\n00:05:30 - Battlefront II Drops Microtransactions\n00:17:30 - NPD in for October 2017, via IGN\n00:18:30 - Ubisoft safe from Vivendi for now, via Reuters\n00:24:30 - London’s Golden Joysticks got some winners\n00:28:00 - The official list of upcoming games\n Reader mail   -\n00:32:15 - Why isn't anyone talking about the Star Wars Campaign? - Javier Bonet-Ruiz\n00:34:30 - With Ni No Kuni 2 coming out January 19th, what are some reasons the company would decide not to put the first game out on new gen consoles? - Jeffy Jeff jeff\n00:36:35 - Digital vs physical games - Eric K\n00:48:50 - What gets you to play a mobile game? - Danny V\n00:51:30 -  Do you think that this could mean that we'll see the long rumoured TMNT title from Rocksteady in the near future? - Anthony\n00:53:30 - Squad Up Nick PC:AwesomeNick#1458 (Discord)\n00:54:18 - Greg’s Pie in the sky platinum\n00:55:15 - You‘re Wrong\nTomorrow’s host: Tim (Also, only Monday and Tuesday shows next week)\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1510955612,
    "duration": 3599,
    "transcript_chunks": [
        {
            "text": "what's up everybody welcome to Kinda Funny Games Daily for Friday, yes you made it, November 17, 2017. I'm one of your hosts, Greg Miller, alongside Portillo the wiener dog and the pure one, Tim Gettys. \"Let's him host,\" they said. \"That there's never been three hosts on Kinda Funny Games Daily before today.\" That changes. How they can shove it up their ass. Everybody wake up Guinness World Records, we got one set, we got one. Yahoo's gonna be Tim. How the hell are you? I am very, very... What are you gonna play this fine weekend? I cannot wait for this weekend to play some games. Jen, I'm not talking to you all week long or weekend long, just playing games. Yeah, I want to play a bit of the Battlefront multiplayer because I didn't really get to jump into that. Out boilers, that's gonna be in the news. Yeah, oh really? From your thoughts and impressions, come on. Yeah, I want to play a bit more of that and then obviously, you know, a little bit more of that Mario. Gotta get them moons on a merciless ember, the moons.",
            "start": 1.81
        },
        {
            "text": "from your thoughts and impressions, come on. Yeah, I want to play a bit more of that and then obviously, you know, a little bit more of that Mario. Gotta get them moons on a merciless ember, the moons. That's cool. We have forever, man. We do. We do forever together. Yes, I like a lot about it. I'm gonna play Destiny. I got a... it's double XP weekend with the clan, so I can nyan, I can knock that Warlock trophy out, no bit, no problem. Yes, way doing that, racist. I want to put more into Call of Duty. I think that's... that is where I'm gonna put it. But I do, I want to talk about Battlefront in terms of the fact that I wanted to play the single-player up until we recorded the Gamescast. Rocket League, that's what I want. A Pop Rocks, which, yes, I lease, which haven't touched it yet. Thanks for cutting me off. Sorry. That's what I was thinking. My son, my Battlefront conundrum will come up later when we're talking with single-player campaign later and the questions. But for now, it's my duty to remind you this is the Kinda Funny Games Daily show.",
            "start": 51.64
        },
        {
            "text": "what I was thinking. My son, my Battlefront conundrum will come up later when we're talking with single-player campaign later and the questions. But for now, it's my duty to remind you this is the Kinda Funny Games Daily show. Nothing here. I'll tell you what you wanna know. The thought process on that one, a burp was right around here and it was like, \"Do I have time to get it up and burp quietly? Do I have time to struggle through it?\" Struggle through it. But then it just started it through the switches all wrong in the head. This is Kinda Funny Games Daily each and every week. Dan, a variety of platforms. We run you through the nerdy video news you need to know about before giving you perspective, answer your questions, reading a bad PSN names and having a good time with you, the Kinda Funny Best Friends. If you like that, please head over to Patreon.com/KindaFunnyGames. Toss us a few bucks, tell us we're doing a good job. Also, remember you can watch it live on Twitch.tv/KindaFunnyGames.",
            "start": 104.89
        },
        {
            "text": "if you like that, please head over to Patreon.com/KindaFunnyGames. Toss us a few bucks, tell us we're doing a good job. Also, remember you can watch it live on Twitch.tv/KindaFunnyGames. If you're watching it live, it's your job to keep us honest by going to KindaFunny.com/You'reWrong. There, give us the facts we screw up so at the end of the show we can set the record straight for everyone listening later on YouTube.com/KindaFunnyGames or podcast services around the globe. If you want to be part of the show, it's super simple. KindaFunny.com/KFGD. That's where you send your questions, your comments, your concerns. Just the facts, ma'am. I'm KindaFunny.com/You'reWrong. I don't want your editorializing. Go there, read capitalist pigs information and that's how you should do it. I'm a little distracted right now, Greg. Yes, you got some fancy pants now. Now, here's where we need to get out in front of it right away. This is not an ad. This is our lives are...",
            "start": 144.72
        },
        {
            "text": "how you should do it. I'm a little distracted right now, Greg. Yes, you got some fancy pants now. Now, here's where we need to get out in front of it right away. This is not an ad. This is our lives are complicated because whatever plays we did, you have a sponsorship from Stitch Fix and we told you to go to StitchFix.com/Greggy, which I believe still works and gets you whatever the discount. Laws, Lee, who knows? They gave me the free try. They gave me the one free package and I liked it so much, I signed up and stuck around. What say I was saying Imagine Dragons song? I don't really, I don't know that it well enough to help you. So I'm wearing now, I'm... this isn't... I paid for this out of my own pocket. Mhm. At no point was I... was this is not a sponsorship thing. But yeah, I'm what I'm wearing now. Your pockets are even fancier than they used to be when you're wearing these red baby's red pants, almost suede pants. Burn. Oh, he's a holy. He's right. These are Bernard Hopam, the powerplay pants for the 99% of...",
            "start": 184.26
        },
        {
            "text": "are even fancier than they used to be when you're wearing these red baby's red pants, almost suede pants. Burn. Oh, he's a holy. He's right. These are Bernard Hopam, the powerplay pants for the 99% of you who don't remember Bernard, who used to run IGN video like business operations. Fake a boss. It's a fun Friday show. Sorry, guys. Housekeeping for you, of course. Remember right now over on Patreon.com/KindaFunnyGames, you can get my interview with Andy Serkis, Planet of the Apes: Last Frontier. You can get it, of course, for free next week Tuesday. I'm gonna put that one up on YouTube.com/KindaFunnyGames. Also, remember that it's your duty right now to help us bring home the victory for Andrea Renee. I need you all to Google \"trending online trending gamer vote.\" \"Trending gamer vote.\" You can vote once every 24 hours. I'm doing mine right there. Submit vote. BAM! I voted for Andrea for today. I didn't do that each and every day. Please, let's win it for her like you did for us. I can't tell you how much...",
            "start": 226.44
        },
        {
            "text": "every 24 hours. I'm doing mine right there. Submit vote. BAM! I voted for Andrea for today. I didn't do that each and every day. Please, let's win it for her like you did for us. I can't tell you how much winning Trending Gamer of the Year 2015 meant for me. On top of being a professional athlete, I never, ever thought I would get. I definitely put Kinda Funny on the map in a way that really end cap put a great exclamation point on what an amazing year 2015 was for Kinda Funny. And I'd like to do that for her and What's Good Games, let alone just Andrea's career that involves working with us, which is cool. And I definitely think it's possible. A test. I took him off your lap. He wants to be back on. Thank you very much. Next. Sorry, Portillo problems. I think we can do this because we can vote once a day. I think if everyone out there voted once a day, you just do it with us each and every day. You already voted today, right? Yes, I did. There you go. By every morning I wake up. BAM! And it do it on the show every...",
            "start": 281.57
        },
        {
            "text": "if everyone out there voted once a day, you just do it with us each and every day. You already voted today, right? Yes, I did. There you go. By every morning I wake up. BAM! And it do it on the show every morning to remind people on housekeeping to really make this a segment annoying. Anyways, let's begin the show with what is and forever will be the Roper Report. Four items on the Roper Report. A baker's dozen. I gotta say, he's only been gone a couple hours. Mm-hmm. But I missed the fact that the other day he came in, he played the Roper Report jingle on his guitar. Did ya? Into the microphone. It's pretty dope. He's so cool. No, it's not. Well, how do you think I feel? And Rian Gary did one show without me. Nobody's on the red. It's like, \"Oh man, Andrea should host every day.\" It's like, \"All right, guys, they know we're here.\" You know what, humans? To Kevin. You know, mom and dad got divorced. Mama humans. This is a Friday fun talk. First story is Battlefront II has dropped microtransactions, at least momentarily.",
            "start": 320.48
        },
        {
            "text": "know we're here. You know what, humans? To Kevin. You know, mom and dad got divorced. Mama humans. This is a Friday fun talk. First story is Battlefront II has dropped microtransactions, at least momentarily. They put out this statement. This is from the general manager at DICE, who's... I respect enough not to even try. You know, I can get this. Oskar. Oskar, how we'd say it. Gabrielson. Gabrielson. Anyways, Oskar, maybe just Oscar says, \"As we approach the worldwide launch, it's clear that many of you feel there are still challenges in the design. We've heard the concerns about potentially giving players unfair advantages and we've heard that this is overshadowing an otherwise great game. This was never our intention. Sorry we didn't get this right. We hear you loud and clear, so we're turning off all in-game purchases. We will now spend more time listening, adjusting, balancing, and tuning. This means that the option to purchase crystals in the game is now offline and all progression will be earned through gameplay.\"",
            "start": 364.1
        },
        {
            "text": "we will now spend more time listening, adjusting, balancing, and tuning. This means that the option to purchase crystals in the game is now offline and all progression will be earned through gameplay. The ability to purchase crystals in-game will become available at a later date, only after we've made changes to the game. We'll share more details as we work through this. Oskar Gabrielson, general manager at DICE. Tim, thoughts? I think that this is a very complicated, layered situation. The end of it is a very onion-like situation and ordeal. At the end of the day, great. This is awesome. They've listened. Where the problems and layers come in is the bullying aspects and the death threats and this and that. And I feel where this gets complicated is the fact that you can't boil it down into there's EA and then the people. The people represent so many different groups and so many people handle things very differently. The conversations we have on this show, the conversations we that you guys have in the...",
            "start": 416.61
        },
        {
            "text": "then the people. The people represent so many different groups and so many people handle things very differently. The conversations we have on this show, the conversations we that you guys have in the different Facebook groups and comment sections on on Reddit, on Star Wars forums and all that stuff. That stuff is good. That stuff tells them, \"Hey, there's a problem with the business plan in this game.\" Death threats and all that stuff, totally inappropriate. I feel like really muddy the message and mess everything up going forward for these type of things because like those people didn't win. I'd hope not, you know, right? No, I hear you. At the end of the day, awesome. Star Wars Battlefront II should have the the best chance it has to succeed and all this. They got it wrong. They effed it up and they are admitting they effed it up. Yeah, were they forced to do it? Yeah, no pun intended. Yeah, yeah, they did it. Here, look, I've seen this too as well. I'm looking through as I go 'cause I have two questions here. Yeah, let's start. I'm...",
            "start": 464.85
        },
        {
            "text": "they effed it up. Yeah, were they forced to do it? Yeah, no pun intended. Yeah, yeah, they did it. Here, look, I've seen this too as well. I'm looking through as I go 'cause I have two questions here. Yeah, let's start. I'm gonna toss it to Josh, who wrote into Kinda Funny Games Daily, who piggybacks off of what you said, Tim. \"Hey, Greg and Tim, so as most everyone is celebrating the removal of real money purchases in Battlefront II, I find myself more cautiously concerned. Are we now in an age where you stir up big stink about something a company will cave? We already saw this with the ending for Mass Effect 3 and EA caved there. I've already seen this invigorating people to rouse other people to their internet mob to push for change in other games. I'm a firm believer in capitalism and people voting with their wallet and companies making monetary changes based on a monetary figure of sales and the such. I guess I'm just concerned that this is inspiring people to continue these attack tactics on devs and publishers to...",
            "start": 510.18
        },
        {
            "text": "companies making monetary changes based on a monetary figure of sales and the such. I guess I'm just concerned that this is inspiring people to continue these attack tactics on devs and publishers to force change, parenthesis, bullying, instead of informing people of what's happening and seeing money from sales dictate company decisions. Thoughts?\" Josh, here's my take on it because I've seen this kicked around a lot. Any of like, \"Oh, great, congratulations, that bullies, you've won. You've gotten what you wanted.\" Bubble-wah. Internet tough guys, internet bullies will exist for the rest of the internet and will exist for every decision made. And I understand that for them, this is... they think they did it with their death threats. Maybe I'd like to imagine they're not that stupid that they really think that's what got them these, you know, that they're being to people and being really mean. It is the intelligent conversation that's happened on this show, that's happened out a million different forms, on a million...",
            "start": 552.66
        },
        {
            "text": "got them these, you know, that they're being to people and being really mean. It is the intelligent conversation that's happened on this show, that's happened out a million different forms, on a million different shows, in a million different forums. That's what changed it here. And I understand that these bullies will take this as a win or whatever, but forever they, when they bully you about everything else on the internet and lose their... I think there's a trade-off here. And I don't think everyone at large is gonna believe that it was the bad guys that made this happen. This is a win in terms of, hey, discourse in gaming does matter. And the fact that if we get out there and something appears to be wrong that much, that's the one thing I still have with this is that all the facts I've heard and read and everything else about it sounds like this was a shitty ass system and a stupid idea. I do believe DICE's heart was in the right place. I want to, I want you to, we want you to play this game for hours and...",
            "start": 599.4
        },
        {
            "text": "everything else about it sounds like this was a shitty ass system and a stupid idea. I do believe DICE's heart was in the right place. I want to, I want you to, we want you to play this game for hours and hours and hours. We want you to feel rewarded. We want you to feel like you're grinding towards something important. Clearly it was wrong. I wish you could have gotten into live hands and to the actual community that wants to play it more than anybody and seen if it mattered. Now, I'm not saying that in early access and all this stuff, people who are the hardest of the hardcore weren't playing and saying there was a problem. All that doesn't matter. This came out. Everyone said this was wrong and this wasn't for them. This wasn't one where, I mean, what even people who wrote in to this show being like that, \"I want a grind. I want to be rewarded.\" They were few and far between. And I feel like that's representative of the industry in gaming, in the community at large, to where this was clearly a misstep and...",
            "start": 643.98
        },
        {
            "text": "I want a grind. I want to be rewarded. They were few and far between. And I feel like that's representative of the industry in gaming, in the community at large, to where this was clearly a misstep. And I'm glad they listened as well. But I don't, I don't think people are gonna take away from this the fact that if we're complete and do these horrible things. I mean, it's the same thing with Mass Effect 3. Mass Effect 3's ending doesn't change because of the people who were being rude to the writers and stuff online. It changes because the hardest of the hardcore Mass Effect fans who had been there for the better part of a decade were like, \"This is not a great ending. This is not what we were going for.\" Mm-hmm. That's what I take. Yeah, I think it's all factors playing into it at once. And unfortunately, that does give the the bullies, for lack of a better term, a false sense of accomplishment. Yeah, but you're right, they will forever exist. There's no getting rid of that. And so I think that it is important to...",
            "start": 680.52
        },
        {
            "text": "does give the the bullies, for lack of a better term, a false sense of accomplishment. Yeah, but you're right, they will forever exist. There's no getting rid of that. And so I think that it is important to look at the more positive aspects of this than the negative because while the negative are very loud and hurtful, it is the positive that at the end of the day will overcome it all because going forward when different devs and publishers are making games, they're gonna look at this and be like, \"We can't get that wrong.\" And that's good. Great. Let's move toward a better future where next fall we're not gonna have this microtransaction problem to this extent. Hopefully this will be like, let's shine all the way back to the other extreme and baby step, baby step, baby step. And then there'll be someone else that gets punched out for going too far. Well, let me, let me bring in George. George writes into KindaFunny.com/KFGD, just like you can, and says, \"Hi, Greg. Short question. In your time covering...",
            "start": 722.67
        },
        {
            "text": "games, do you recall fan backlash hitting any particular game as resoundingly as Battlefront has been hit over the past few days on such a huge scale? There seems to be a story, there seems to be, there seems to be a story along these lines every few years. No Man's Sky instantly comes to mind, but I can't think of anything that rivals the publishers of a huge triple-A game backtracking on such an integral part of the game night, the night before the worldwide launch.\" No, George, I can't think of anything this crazy. Like No Man's Sky, good example. But No Man's Sky was, we got the game and everybody's like, \"This wasn't what we were promised.\" Yeah, is going to be. You have Mass Effect 3's ending. There was a huge outcry about that and they eventually went back. But like what you're talking about, right? Like I...",
            "start": 764.4
        },
        {
            "text": "wasn't what we were promised. Yeah, is going to be. You have Mass Effect 3's ending. There was a huge outcry about that and they eventually went back. But like what you're talking about, right? Like I can't think of anything that's been is something as big as EA, a franchise, a property, an intellectual property as big as Star Wars. And then, yeah, the night before it's supposed to go worldwide for everybody, they're like, \"It, we're ripping it all out.\" Yeah, that is crazy. And it shows where we're at with video games in the way that I think it shows we're at with social media. I think it shows we're at with the where there are, I mean, there's it's been this way for a while with those communities and every video game has so many different places you can go to discuss the game. But now with things like Twitter and Instagram, Facebook and all this, and the ability to share things, it's every year there's just more people using these platforms. And when one verified user gets retweeted and then a bunch of...",
            "start": 806.76
        },
        {
            "text": "and Instagram, Facebook and all this, and the ability to share things, it's every year there's just more people using these platforms. And when one verified user gets retweeted and then a bunch of other people that are like, \"Oh, that seems kind of shitty,\" even if they're not involved at all. And next thing you know, it has a hundred thousand retweets. That is being seen by so many people. And that that is more powerful marketing than any type of product placement could ever get you. Sure. And that's what's been interesting with the shifting sands of all this is the fact that for years we've talked about voting with your wallet. And when this originally came up, right, there was a debate on this show of like, \"Well, is that you don't buy Battlefront or is that you buy Battlefront but never buy a loot crate or never spend real money on anything? How do you send the message?\" And the argument was, \"Well, like all the social media post in the world aren't necessarily going to get the message across where is this?\"",
            "start": 842.58
        },
        {
            "text": "one. I think the fact that every other day it seemed like there was worse news about this, right? Where it was, \"It's pay to win.\" All right, no, we're looking at it. No, it still is. This is happening. Loot crates here. All right, well, now you have to play for 800 hours or whatever it is. Here's loot. Here's every day there was another thing. I'm like, \"Holy, how they effed up this badly?\" And it wasn't just, \"I'm tweeting and I'm outraged. This is bad.\" It's the tweets that were like yesterday's one where it was a developer who makes microtransactions and being like, \"There is a way to do this. I make these things for mobile games. Here's how I do it and what my philosophy is and what most people's philosophy is. And this is where EA went wrong with this.\" And the fact that we are seeing the industry pull back that curtain.",
            "start": 880.41
        },
        {
            "text": "games. Here's how I do it and what my philosophy is and what most people's philosophy is. And this is where EA went wrong with this. And the fact that we are seeing the industry pull back that curtain. We're seeing devs openly talk about that and not critique but explain best practices. Stuff that usually save for a GDC talk for a few hundred people unless you wanna watch it on the vault later. That's what's been fascinating about this. And the fact that it's got, it was three facts that there somebody hit me up again today like, \"Oh, you did look 50 in the first.\" I'm like, \"I try. Maze a lot of thoughts. I try. There's a lot of facts here. Facts change.\" This cool, Greg, was it? Mm-hmm. I think this was a great move not only obviously for EA, but I mean, for us in terms of an industry of being able to listen to each other. And yeah, the outcry is terrible. And I know people on the show, we're sick of hearing about and microtransactions and loot crates and all this stuff. But the reason to George's question here...",
            "start": 920.73
        },
        {
            "text": "each other. And yeah, the outcry is terrible. And I know people on the show, we're sick of hearing about and microtransactions and loot crates and all this stuff. But the reason to George's question here, that this is such a crazy event, is that we've been running to 2017 being this tipping point this entire time where it has been Star Wars was for a while. But we're talking about in other games and Shadow of War. And there's been this, yeah, it's okay. Exactly. There's been this track laid for what's a good microtransaction, what's a bad microtransaction, what is a loot crate that works, what isn't a loot crate that works. And it what I thought we're gonna walk away from this year learning from our mistakes in a way of like, \"Okay, well, NBA 2K effed it up bad. Shadow of War people kept bitching about beforehand.\" But I really haven't heard anybody talk about his sins. Battlefront's is nightmare. 2018 games when we get to the fall won't be like that for triple-A. They'll figure that out when clearly we already have...",
            "start": 960.26
        },
        {
            "text": "really haven't heard anybody talk about his sins. Battlefront's is nightmare. 2018 games when we get to the fall won't be like that for triple-A. They'll figure that out when clearly we already have resolution of, \"Cool, we over, we overextended here and we don't understand what's happening.\" And yes, I saw some people this morning headlines going up being like, \"Oh, they took it down for now.\" And I know I introduced that, but I mean, they're they're definitely doing the twirl the mustache thing, I think. Yeah, microtransactions will be back in Battlefront because clearly again, they want to make money off of this. They want to sustain. But I think it's going to come back in a way that is not egregious and cool. Here's a system that makes sense and it's probably all gonna be cosmetic and you don't have to worry about it. Mm-hmm. It's been a fascinating year for gaming. Yep. Uh, yeah, our second Roper Report story over on that. They're NPD. They released October 2017 top ten games. I'm quoting from IGN. Are...",
            "start": 1005.11
        },
        {
            "text": "to worry about it. Mm-hmm. It's been a fascinating year for gaming. Yep. Uh, yeah, our second Roper Report story over on that. They're NPD. They released October 2017 top ten games. I'm quoting from IGN. Are you ready, Tim? I am very ready. Number one, Middle-earth: Shadow of War. Now, you at home might say, \"Wait, what the Greg Miller? Yesterday Nintendo put out a thing saying Mario Odyssey was the best game.\" Now they drop down here in the IGN article. \"Super Mario Odyssey's numbers didn't include digital sales on NPD, something that may account for a Nintendo statement about it being October's number one seller only be available for days.\" Exactly. Regardless, the impressive because it's at number three. Number two was Assassin's Creed Origins. Number three of Super Mario Odyssey. Number four, South Park: The Fractured But Whole. Number five, NBA 2K18. Seems like people didn't care about this microtransactions. Number six, FIFA 18. Number seven, WWE 2K18. Eight, Madden NFL 18. Nine, Destiny 2. In number...",
            "start": 1043.3
        },
        {
            "text": "Number five, NBA 2K18. Seems like people didn't care about this microtransactions. Number six, FIFA 18. Number seven, WWE 2K18. Eight, Madden NFL 18. Nine, Destiny 2. And number ten, Forza Motorsport 7. Interesting to point out, says the NPD, Destiny 2 was the best-selling game of 2017 and the second best-selling game of the last 12 months. It confused me for a second, but do I got it? But what's number one then? What was the best-selling game of the fall last year? KindaFunny.com/You'reWrong. We gotta sing about it. I'm gonna give us just guess. Best-selling game of the fall 2016. What big, what crazy game came out last year, 2016, end of the year? Uncharted was already out. Is that one count? And that's, I know, I'm sorry, just let me work through the problem. Don't come and mouth right away. God, Tim, it's a funny piece of garbage. There wasn't Assassin's Creed. I remember Call of Duty being us being a down. Dealers are down here. Yeah, yeah. Battlefield 1. Well, but I don't",
            "start": 1089.5
        },
        {
            "text": "and mouth right away. God, Tim, it's a funny piece of garbage. There wasn't Assassin's Creed. I remember Call of Duty being us being a down. Dealers are down here. Yeah, yeah. Battlefield 1. Well, but I don't think it sold that well. Well, we, let's all prop GTA. No, Watch Dogs, definitely. Yeah. All right, you quiet down over. Um, anything about the numbers say not to you other than the fact that Mario killed it for being on sale for so now this all totally makes sense. And even that makes sense, you know, totally adds up to what you'd expect for how the attach rates been for Switch games. Happy to see South Park: The Fractured But Whole chart so well. Yeah, great. Yeah, I think I feel like that's that is a huge win for Ubisoft San Francisco, it being their first, yeah, major game like that. I, congrats to them. Critically acclaimed and selling well. It's a good, right recipe for success there. And obviously a great news for Ubisoft having number two, Assassin's Creed Origins, and number four, South Park right there to",
            "start": 1148.75
        },
        {
            "text": "acclaimed and selling well. It's a good, right recipe for success there. And obviously a great news for Ubisoft having number two, Assassin's Creed Origins, and number four, South Park right there. Two Ubisoft games in the top five, that's great. Speaking of which, Greg, way number three, Ubisoft is safe from Vivendi for now. Hip hip hooray! This comes from Reuters. Reuters says acquisition of much, I've never even heard of right there, taking acquisition and putting the 'eve' on their acquisition, that positive acquisitive, whatever. French media conglomerate Vivendi missed analysts estimates in third quarter earnings and ruled out a hostile takeover of Ubisoft for the next six months after the video games maker beat forecasts, pushing its shares to record high. Vivendi, however, I jumped a whole bunch of stuff that didn't matter. Vivendi, however, kept its 2017 outlook for revenue to increase more than five percent and for a rise of around twenty five percent in its EBITDA, whichever the that means we should",
            "start": 1199.27
        },
        {
            "text": "that didn't matter. Vivendi, however, kept its 2017 outlook for revenue to increase more than five percent and for a rise of around twenty five percent in its EBITDA, whichever the that means we should have been adults at some point, but I'm talking about no prior to its integration of the Havas business. The group also said it would not launch a takeover bid in the next six months for French video game group Ubisoft, in which it has a 26% stake. Reuters data shows Ubisoft, in which Vivendi owns 26%, is up 96 percent since January and jumped to a record high after beating its second quarter sales target. I mean, following up, following up on the sales, retama out for the NPD. Yeah, Ubisoft has been killing it. I feel like the the two big stories we talked about in terms of sales this year have been Nintendo and Ubisoft. I feel like Ubisoft always kind of gets the the weird shaft in it because it's not, it does have a new system and it's not like, you know, one of the big three, but you look back on it",
            "start": 1241.73
        },
        {
            "text": "and Ubisoft. I feel like Ubisoft always kind of gets the the weird shaft in it because it's not, it does have a new system and it's not like, you know, one of the big three, but you look back on it, there's so many games that going, looking at when before they came out, you're like, all right, like, cool, Ghost Recon Wildlands, For Honor. And yet they're games that sell month after month after super high. And then things like Rabbids coming out, it's just like, yeah, Ubisoft said, I think, killer year. You know, don't, you can correct me if I know this is a technical 'You're Wrong' or ever, but I remember when we read it on this show, the fact that Ubisoft sales for the year, Mario + Rabbids, kind of like 17% or something, which is not, yeah, when when you do the math on how well all the other games have been selling. Yeah, this is, you know, I talked about it on Gamescast, I think recently, not, and I think it was the one you missed actually, the fact that, you know, people call me a PlayStation fanboy all the time, and that's",
            "start": 1288.26
        },
        {
            "text": "this is, you know, I talked about it on Gamescast, I think recently, not, and I think it was the one you missed actually, the fact that, you know, people call me a PlayStation fanboy all the time, and that's fine, that's fair. And I'm in the community. I think it's that I covered it for the beat for so long, I just know it so well. When I think it's actually interesting that I feel like I cheer for Microsoft to do well more than I ever want, you know, PlayStation to do all right. And it's the same thing with Ubisoft, I feel, where ever since Ubisoft really was like, you know what, no, no, we're gonna come out of the shadows in a way. Vivendi forced, when they started all this stuff, like Ubisoft and Yves Guillemot started being like, you know what, we got to put a face to this band. We have to be more communicative. We have the, what is a Ubisoft game? I think when you said, 'Oh, it's a Ubisoft game,' before that usually meant, 'All right, cool, it's open-world, how stars know stuff.' And that's still the case, but",
            "start": 1332.99
        },
        {
            "text": "we have the, what is a Ubisoft game? I think when you said, 'Oh, it's a Ubisoft game,' before that usually meant, 'All right, cool, it's open-world, how stars know stuff.' And that's still the case, but now it also means that it's a online progressive world we're all playing in together and doing something with a community based, right? And that's why it sounds stupid, and I don't, get me wrong, at no point do I want you to think I'm defending the Ubisoft Club or whatever the it's called, Uplay Club, the Club, whatever the hell that Uplay, no, it's not Uplay, where it's something else, whatever Uplay turned into now, which I think it's Ubi Club. But like, we're playing Wheel of Fortune yesterday at my desk, and it was a Ubisoft game, and I popped some of those Uplay points or whatever the they are now, and it was one of those things like, 'Oh, that's cool,' because I those things stack up, stack up, stack up. And then when I got South Park, I logged on, I was like, 'Oh, I have'",
            "start": 1372.26
        },
        {
            "text": "or whatever the they are now. And it was one of those things like, 'Oh, that's cool,' because I those things stack up, stack up, stack up. And then when I got South Park, I logged on, I was like, 'Oh, I have all these points and there's costumes here to unlock with that.' That's the nice little microtransaction way of, right, I'm doing things in, yeah, Ubisoft ecosystem. And I did in The Division all the time, wearing, 'Oh, I did a Uplay action, so now I have,' and I can go spend it and get this different gun or this different skin or whatever the hell it was. Like, that's cool, a neat little network thing to be like, 'Oh, I associate good vibes with this brand.' And as we've watched, I thought they were dead in the water. I thought Vivendi had them dead to rights. And Vivendi came in and poked them with a cattle prod, and they got this, they snapped to and turned in to read about the Rabbids, get the Rabbids emergency break glasses, Rabbids. Poor either. Yeah, yeah. I'm, I cheer for Ubisoft as well, so I'm glad to see them do",
            "start": 1416.03
        },
        {
            "text": "they got this, they snapped to and turned in to read about the Rabbids, get the Rabbids emergency break glasses, Rabbids. Poor either. Yeah, yeah. I'm, I cheer for Ubisoft as well, so I'm glad to see them do it, especially when they make games like Watch Dogs 2. Watch Dogs 2. Now, come E3 2018, give me The Division 2. Give me The Division 2: Long Division. That's a terrible name, but I would, I would have made it. Ah, Tim, yes. Closing out The Roper Report. London last night held their Golden Joystick Awards. You familiar with these? I am. Good. I'm not. I was like, 'What the hell is?' I don't know. I don't remember. I thought it was Game Rant, GamesRadar's Golden Joysticks at first. It's not. No. Oh, it's a separate Golden Joystick. Yeah, totally. Anyways, they did this whole thing. I thought I like running down where other people fall so we can start to worry. We're doing Gamescast next week, it's gonna be going through The Game Awards, The Game Awards, the Geoff Keighley Game Awards, and try to figure out where we think that's. But here you",
            "start": 1452.48
        },
        {
            "text": "so we can start to worry. We're doing Gamescast next week, it's gonna be going through The Game Awards, The Game Awards, the Geoff Keighley Game Awards, and try to figure out where we think that's. But here you go for London's Golden Joysticks. Best Storytelling: Horizon Zero Dawn. Best Visual Design: Cuphead. Best Audio: The Legend of Zelda: Breath of the Wild. Weird pick, right? I have thoughts. No, yeah, that's that's a weird pick. The first two, I'm like, 'Cool, nailed it.' Daily Best Audio: Zeldin opera, Link, Link, 'The Blood Moon arises.' All right. Best Gaming Performance: Ashly Burch, Halo, and Horizon Zero Dawn. Best Indie Game: Friday the 13th: The Game. My God, Randy, developers must have flipped the table and ran out of the room. But you, you kind of deserve it. Just make your game run better and be stable. Best Multiplayer Game: PlayerUnknown's Battlegrounds. Studio of the Year: Nintendo EPD. Best VR Game: Resident Evil 7. Nintendo Game of the Year: The Legend of Zelda: Breath of the Wild. PlayStation's, Mario Odyssey up for these Game of",
            "start": 1506.03
        },
        {
            "text": "PlayerUnknown's Battlegrounds. Studio of the Year: Nintendo EPD. Best VR Game: Resident Evil 7. Nintendo Game of the Year: The Legend of Zelda: Breath of the Wild. PlayStation's, Mario Odyssey up for these Game of the Years. Don't know. It's interesting words just came out of the blue. I don't know. They might, it might have been the cutoff. Yeah, it seems like it was 'cause it's not here anywhere. PlayStation Game of the Year: Horizon Zero Dawn. Xbox Game of the Year: Cuphead. Hell yes! Hell yes! I love Cuphead win and everything. It's great. I'm not trying to take anything away, but I've been getting to tell. I mean, Cuphead is an awesome game, I guess, right? What was the competition for Xbox Game of the Year? And are we only dealing with exclusives? So it's Forza. Um, there was Halo Wars 2 in February. Greg, there was rank or about that, no more. There was PC Game of the Year: PlayerUnknown's Battlegrounds. The Critics Choice Award: The Legend of Zelda: Breath of the Wild. Breakthrough Award: Ashly Burch. An Ultimate Game of the Year. Well, I love",
            "start": 1555.83
        },
        {
            "text": "there was PC Game of the Year: PlayerUnknown's Battlegrounds. The Critics Choice Award: The Legend of Zelda: Breath of the Wild. Breakthrough Award: Ashly Burch. An Ultimate Game of the Year. Well, I love this, the unified championship of all the platforms: The Legend of Zelda: Breath of the Wild. Very cool. Yeah, yeah. Your, you, so outside of Best Audio, where I'll care with these picks, yeah, yeah, I think the audio definitely is not right. Breakthrough Award, I'd like to know what the definition of that is. But yeah, otherwise, yeah, this all checks out. You assume, yeah, its performance of the year kind of in, but I understand Best Gaming Performance already one up there. Mm-hmm. So I wouldn't call her a breakthrough. I mean, I, this is definitely a huge jump for her career. Yeah, but she's been killing it for years. Sure, sure. Tiny Tina. Hey, asked what you're playing. You ever watch that? Yeah, one of the comments loved it. YouTube Internet video series of all time. Really? Oh, yeah. Okay. There's not bad episode. Well, that's so good.",
            "start": 1603.47
        },
        {
            "text": "Tiny Tina. Hey, asked what you're playing. You ever watch that? Yeah, one of the comments loved it. YouTube Internet video series of all time. Really? Oh, yeah. Okay. There's not bad episode. Well, that's so good. I want to know. Go watch it. Well, after the show, don't, don't stop. They should go watch it. Tim, yes. If I were, no, I came to the mom and drop digital shops. You're not the kind of person who knows voices. You, I'm not. And I was touching my eye and my voice went high a little bit. I'm just gonna restrain with him. Oh, man, that was, it hurt. It was disturbing. Don't do it again. Get in and get in and get on those LaCroix. All right. First one I'm gonna start with isn't out today slash upcoming dates because IGN shoved them all together here for Middle-earth: Shadow of War. It'll receive free, I'm sorry, it will receive five free content updates before the end of 2017. The first three updates, Endless Siege, Rebellion, and Enhanced Photo Mode, arrive on November 21st. WB Games today, Online Fight Pits, a new mode that allows you to pit",
            "start": 1649.1
        },
        {
            "text": "content updates before the end of 2017. The first three updates, Endless Siege, Rebellion, and Enhanced Photo Mode, arrive on November 21st. WB Games today, Online Fight Pits, a new mode that allows you to pit your Orc followers against those of another player. We released in December 5th. Lastly, a new difficulty that's even more challenging, the Nemesis with No Last Chances, will be added on December 12th. Now, you might say, 'Greg, hmm, none of those were today's dates. Those were all upcoming.' And to which I would say, 'You are correct, and I misread the information I put it there.' So also out today though, MXGP3, The Official Motocross Games, which Pokémon Ultra Sun and Ultra Moon 3DS, School Girl/Zombie Hunter PlayStation 4. All right. Star Wars Battlefront II, Xbox One, PS4, PC. The Elder Scrolls V: Skyrim on Switch. The Sims 4 on Xbox One and PS4. RIVE Ultimate Edition on Switch. VVVVVV on Switch. The other, oh, Skyrim V, no, The Elder Scrolls V: Skyrim PlayStation VR. This now I'm doubling up. Goddamn, Kotaku, I don't",
            "start": 1699.86
        },
        {
            "text": "actually have to proofread your work. Your toy Xbox will shut us. School Girl/Zombie Hunter again. Sims again. Katamari Damacy. Turtle Racing on Xbox One. That's what you've been waiting for. And Xenoraid on Switch. Meanwhile, new dates for you. This is from PlayStation Blog. I'm going to read Uncharted 10th Anniversary PlayStation 4 system theme and profile avatar will be available for free for 48 hours from Sunday, November 19th at 8 a.m. Pacific time until 8 a.m. Pacific time, Tuesday, November 21st. During this period, other select Uncharted PS4 system themes and avatars will also be free. Visit the PlayStation Store and look for Uncharted 10th Anniversary Bundle. Don't miss it. Cool. Then a PSX date for you. We'll wrap up the Uncharted 10th Anniversary celebrations at PSX with event activities including a special",
            "start": 1750.56
        },
        {
            "text": "and look for Uncharted 10th Anniversary Bundle. Don't miss it. Cool. Then a PSX date for you. We'll wrap up the Uncharted 10th Anniversary celebrations at PSX with event activities including a special retrospective panel featuring members of the cast of Uncharted and a show floor puzzle room experience set and a life-size recreation of Nate's attic. We'll also have new Uncharted 10th Anniversary merchandise available. The PlayStation Gear Store. Be sure to tune in for the panel on Saturday, December 9th at 5 p.m. Pacific on live.playstation.com and follow Naughty Dog. Blah, blah, blah, blah. Now you may, what you do there at Nate's attic? I love everything about this, but the Nate's attic thing, it's a, it's a step too far for me. Why? I think it's just funnest. You know, it's not, here's the thing, there's all the puzzle rooms. I get that. That's the craze right now. And whatever, it works for some things and it doesn't work for others. Uncharted doesn't have like a definitive like, 'This is an arena that if'",
            "start": 1804.29
        },
        {
            "text": "all the puzzle rooms. I get that. That's the craze right now. And whatever, it works for some things and it doesn't work for others. Uncharted doesn't have like a definitive like, 'This is an arena that if you're in it, you're like, 'Oh, man, I'm in this place.' Nate's attic, are you kidding me? Now, dumb idea. Fire whoever came up with it. We all know it from Uncharted 4 though. All the references, the other games. We'll shoot the things. We'll see. I'm shocked. We tweet me pictures too. Even pictures. Are you having so much fun in Nate's attic? And now you're gonna get a full fledged remote from me. And please do. I mean, oh, we'll learn how to use the camera. Fill me. Run around there. Shoot. And we'll see what you, who's laughing then. Until we will be me, Joey, and Amy having fun at PSX. Remember, there's a lot of PSX activities coming up for us. Yeah, Joey, I like to hear Joey, where do I send people to look at all the PlayStation Experience stuff we're doing? Pin post on every social thing we do. So the forums and the Reddit and",
            "start": 1845.49
        },
        {
            "text": "coming up for us. Yeah, Joey, I like to hear Joey, where do I send people to look at all the PlayStation Experience stuff we're doing? Pin post on every social thing we do. So the forums and the Reddit and the whatnot. There's a whole bunch of stuff going on. We'll be at PSX. Details that we can tell you firmly coming soon. Mainly though, Portillo's meet-and-greet Sunday night. Yeah. Then we go, then we're all driving to San Diego and doing a Christmas party, white elephant gift exchange. We're ugly sweaters on Monday at Polite Provisions, Eric Castro's bar. So be there. And then finally, your last new date, Soma is coming to Xbox One on December 1st. Meanwhile, deals of the day. PSN is already putting up its Black Friday deals. Some of them now for PlayStation Plus members. So get in there if you want to earn, save a few bucks. Get high. I said earn a few bucks. You're not really gonna earn any money looking or buying stuff. Time for Reader Mail, Tim. Let's get to that. I want to find one for you right off the bat. You",
            "start": 1889.98
        },
        {
            "text": "a few bucks. Get high. I said earn a few bucks. You're not really gonna earn any money looking or buying stuff. Time for Reader Mail, Tim. Let's get to that. I want to find one for you right off the bat. You know, I want to give you something to choose, one to shine, because it's just, you know, I hear, we know good. Well, here we go. Our friend Xavier Wright writes in. I mean, Monareh, of course, he writes in every show. You know this. But it's Xavier, and he wrote into KindaFunny.com/KFGD, just like you can, to be a regular on the show and says, 'Hey, Greg and Tim, why isn't anyone talking about the Star Wars Battlefront II campaign? All this mess with microtransactions is overshadowing the rest of the game. Battlefront II isn't just multiplayer. I'm in the minority here, but I'm only playing the game for the campaign. I might play the multiplayer with friends if they have, if they, if they do, but that's it. Have you guys played the campaign? If so, what are your thoughts? Spoiler-free, of course. Greetings'",
            "start": 1931.53
        },
        {
            "text": "the campaign. I might play the multiplayer with friends if they have, if they, if they do, but that's it. Have you guys played the campaign? If so, what are your thoughts? Spoiler-free, of course. Greetings from Florida.' Real quick, Xavier, right now the Kinda Funny Gamescast is up on Patreon.com/KindaFunnyGames. You go there, you can hear Tim's expansive thoughts on it, including spoilers when you've beaten, there you don't care anymore. It'll also be up Monday for YouTube.com/KindaFunnyGames. But Tim, what is the elevator pitch? The campaign's really bad, and it sucks because it's like, I wanted it to be good. I was going into it, I was like, 'I understand like what the max we're gonna get from this.' Yeah, all right. But I think from pretty much every angle, it was a failure. Like, from a gameplay perspective, from a story perspective. The one thing that they they got right was character. I think a lot of the new characters they added were really cool and unique and fresh and well written. But there's",
            "start": 1973.92
        },
        {
            "text": "from a story perspective. The one thing that they they got right was character. I think a lot of the new characters they added were really cool and unique and fresh and well written. But there's too many cooks in the kitchen, you can totally tell. And it didn't feel like a full featured story, a campaign from, I, I'm very, very upset about it. It's probably my biggest disappointment of 2017. Yeah, it's very short, four hours. Because I, so I was like, 'Oh, four hours, should I play it just to you?' Like, no, my thing is, I like what I said on Gamescast is, four hours, I don't think you should play it. I do think Nick should play it just because Nick cares about Star Wars. Sure. Like, if you care about Star, Janina, and I care about Wall, and I care about Mitch. Yeah, I don't, I mean, there's spoilers on that. But Geoff, no, I'm sorry. I, that already. Jeffy Jeff Jeff writes in to KindaFunny.com/KFGD and says, 'Hey, game with Ni no Kuni II coming out January 19th, what are some reasons the company would decide to not put the'",
            "start": 2018.89
        },
        {
            "text": "sorry. I, that already. Jeffy Jeff Jeff writes in to KindaFunny.com/KFGD and says, 'Hey, game with Ni no Kuni II coming out January 19th, what are some reasons the company would decide to not put the first game out on new gen consoles? Yes, it's on PS Now, but that's not the same. I would think if they did port the first game, it would draw in a few new fans and make a lot more money. Seems like a no-brainer to me. Just curious what you all thought.' The problem you have here is, think about it this way. People are hungry for a new Ni no Kuni. If you miss the original Ni no Kuni, you've heard people talk about it and be, and you know that was a game that was important, popular, and a lot of people really loved it. Now the sequel's coming out. You don't need to have played the first one. It's gonna be better, it's gonna be prettier. You're gonna drive people to play that. If you were to put out a remastered digital-only edition or whatever you want to put out for the original Ni no Kuni, people are gonna",
            "start": 2066.8
        },
        {
            "text": "gonna be prettier. You're gonna drive people to play that. If you were to put out a remastered digital-only edition or whatever you want to put out for the original Ni no Kuni, people are gonna buy that and then feel like they've got their fill. It's, it's, you know, big a game. Exactly. And it's, you want people to be starving for your game when it gets there. I mean, think about, and this is not apples to apples at all, but think about Red Dead, where we're all like, 'Jesus, just give us another Red Dead. Oh my God, I can't wait. We're finally getting Red Dead.' It's because we haven't had a million cowboy games or a million games on the level of Red Dead since then. And so similar here, the reason Persona 5 was a big deal was the fact that the Persona games are awesome and we haven't had one in quite a while. And you want that hunger to build up. And so right now it's what we was talked about where there's word-of-mouth for the franchise of Ni no Kuni. And so, you know, people are gonna go out and buy that",
            "start": 2117.77
        },
        {
            "text": "and you want that hunger to build up. And so right now it's what we was talked about where there's word-of-mouth for the franchise of Ni no Kuni. And so, you know, people are gonna go out and buy that, not having to play the first one, but understanding that it was great, so they've heard a lot of things. My friend really loved it. They're gonna get on this one. It's a little flame right now. You don't over fan it and put it out. And that's the big thing. You want to drive all the sales to the new game, the new version. So coming out and putting out another one that is a bajillion hours, people are gonna be awed and finish it. So I can't, I'm gonna finish that before I buy the next one and so on and so forth. Yep. Eric K writes in there. Eric K, to KindaFunny.com/KFGD and says, 'This is long, so edit when you choose to.' I did. 'Hey, Greg and Tim, this is kind of a deals of the day, but really want to use this opportunity to talk digital versus physical games. And a warning, this is long. So Timmy Tim, crack",
            "start": 2158.36
        },
        {
            "text": "you choose to.' I did. 'Hey, Greg and Tim, this is kind of a deals of the day, but really want to use this opportunity to talk digital versus physical games. And a warning, this is long. So Timmy Tim, crack open a LaCroix. PlayStation's Black Friday early access deals went live today. South Park and Assassin's Creed Origins are both forty two dollars, which is a pretty good deal. However, most retailers are offering these two games for thirty to thirty five dollars on Black Friday. This brings me to my question/comment. I really don't understand why you guys are convinced two games will be considerably cheaper when we move to the inevitable all digital future. First, there's the microtransaction-a-palooza of 2017 has shown that devs may be looking for ways to raise prices as opposed to lowering them. Second, I always wait to buy games physically when they're always at least ten or twenty dollars cheaper. I'm the digital version that plus early adopter discounts",
            "start": 2200.72
        },
        {
            "text": "raise prices as a point lowering them. Second, I always wait to buy games physically when they're always at least ten or twenty dollars cheaper than the digital version. That plus early adopter discounts from Best Buy/Amazon make physical copies cheaper than digital. So how is it gonna happen where it's gonna be cheaper? XOXO Eric. The problem we have and what we're talking about, Eric, of digital only being one day cheaper is the fact that you're talking about shopping at brick-and-mortar. You're talking about shopping at Amazon and Best Buy and GameStop. It's the fact that they still exist in the form that they do. It's the same thing we talk about with Vita games all the time where when Vita games originally came out, now regular games that are out and then digital, the same thing as they go into a store. You can't undercut the stores yet because if you were to go in there, be like, \"Alright, cool. Everything on PSN at, you know, it's $60 in Walmart, but it's $50 on PSN on launch day,\" you would",
            "start": 2243.83
        },
        {
            "text": "into a store. You can't undercut the stores yet because if you were to go in there, be like, \"Alright, cool. Everything on PSN at, you know, it's $60 in Walmart, but it's $50 on PSN on launch day,\" you would piss off Walmart, you would piss off GameStop. They would stop selling your consoles and then or stop carrying your games and start favoring Xbox or PlayStation or whoever the one who pissed them off is, right? The idea here that all digital one day or the digital landscape winning out in the end will be better for gamers is all referenced by Steam in the way that Steam, if you look at that, right? They have no competitors there. People really aren't selling physical PC games anymore. So you get games out on there, you get them in bundles, you get them at these crazy discounts. People can put up a flash sale really quick, put them down really quick, do whatever the hell they want to do to make Steam be the premier platform for people to go to. And the argument would be that if that was able to happen, if",
            "start": 2285.86
        },
        {
            "text": "really quick, put them down really quick, do whatever the hell they want to do to make Steam be the premier platform for people to go to. And the argument would be that if that was able to happen, if you don't have to worry about Amazon, thank you for not screwing you over, taking off this GameStop, not putting you on shelves. I don't know this thing as, I guess, I don't even when Amazon having a digital marketplace, I don't know how much they really factor into it because they don't have to worry about, \"Hey, we're not gonna sell your thing here.\" The argument here is the fact that you cut out the middleman, you cut off the stores, you cut out the trucks. Games should come down in price and just be easier to sell. You're wrong. I mean, I think it's complicated because, you know, we've hit the, we've talked about it so often where it comes down to that we can't have a digital only presence because we don't have the infrastructure for that yet, America, and all that stuff. But I think it gets complicated",
            "start": 2329.24
        },
        {
            "text": "of us so often where it comes down to that we can't have a digital only presence because we don't have the infrastructure for that yet, America, and all that stuff. But I think it gets complicated when a lot of things you're talking about have been evolving over time where, yeah, Amazon might not have a digital marketplace now in place for games, but it kind of do. You can, I can, but I've bought my digital codes there and everything else. But it's like, it's not where it's at with Amazon's music side, for example, right? Where for a long time iTunes was the only way and then Amazon slowly over time figured it out working with deals with different record labels. They they're now huge and a lot of people buy their music digitally on Amazon. Yeah, and that took time, you know. It wasn't always the digital sold more than physical for music. Eventually at that point that it does. Looking at the NPD now of even Mario Odyssey, right? Like it's number two because that doesn't include those number three",
            "start": 2370.34
        },
        {
            "text": "sold more than physical for music eventually at that point that it does. Looking at the NPD now of even Mario Odyssey, right? Like it's number two because that doesn't include those number three because it doesn't include digital sales. Yeah, so it's selling very well physically, right? Like we can't undermine the fact that the games physically still take up the majority of the high. I understand. So I don't know in terms of the cost of the games, I don't think that we'll really ever see the price of games go down just because it's cutting out the the middleman of the the storefronts and and all that stuff. Well, the argument would be not just the fact of the middleman, all the stuff. It's the argument that we set this and some people have toyed with it so far, but I think we set this arbitrary games cost $60. And so it's what I always come back to with Titanfall and even looking at LawBreakers, right? Of the fact that LawBreakers was like, \"Hey, we're not a triple-A game. We like to think of we are.",
            "start": 2412.06
        },
        {
            "text": "cost $60. And so it's what I always come back to with Titanfall and even looking at LawBreakers, right? Of the fact that LawBreakers was like, \"Hey, we're not a triple-A game. We like to think of we are. We're trying really hard. We're only multiplayer. So we're gonna put it out at what was it, $39.99?\" I think it was $39.99. And that's awesome. But there still is that stigma attached to, \"You're not, if you're less than $60 on your first day, you're not a full-fledged game.\" It's the same thing, half of the Ratchet & Clank. When Ratchet & Clank came out for PlayStation 4 and, well, you're like, \"Oh, it's 40 bucks. This ain't a real Ratchet & Clank game.\" And you played it and it wasn't real original in the game. It was awesome. And it is a stigma. And if we were to blow up brick-and-mortar or at least shake it up where digital's the thing, I feel like it's what Colin always say, you'd see people explore that scale. I feel like that scale, I think we're already there. Like, I feel like that stigma isn't, I mean, it's still",
            "start": 2457.69
        },
        {
            "text": "the thing. I feel like it's what Colin always say, you'd see people explore that scale. I feel like that scale, I think we're already there. Like, I feel like that stigma isn't, I mean, it's still there to an extent, but I think even stigma is too strong of a word. Yeah, I feel like they're they have that, there's been a lot of games that explore the the scale a bit more. Even see with like Crash, like the Ratchet going into it. Yeah, a lot of people like, \"Oh, this is a movie tie-in.\" Sure, right? So there was a lot of other factors going into that. The game still sold very well and it was critically acclaimed. Yeah, and then Crash Bandicoot being another example, $40. And it was one of the bestsellers of the year. And there's a bunch of other ones too. But like seeing things where it's like, it's weird now where it's like Cuphead, it's an indie game, but it's also an Xbox like exclusive and it is a big title for them. And in that being $15 or $20 or whatever it was. And then what are you talking about things",
            "start": 2496.09
        },
        {
            "text": "where it's like Cuphead, it's an indie game, but it's also an Xbox like exclusive and it is a big title for them. And in that being $15 or $20 or whatever it was. And then what are you talking about things like LawBreakers and whatever. I just think that there is a certain level of game that no matter how slim the offerings are content-wise, there's still a level of triple-A-ness that cost money. Alright, so we'll never see like Star Wars Battlefront when it came out and everyone's like, \"$60 for this dot dot game.\" It's never gonna come out at $40. It's never gonna come out at $30 with a bunch of microtransactions being the thing. It'll come out with 60 with those things or not in the case of Battlefront II. You know, I don't I mean, yes, in the foreseeable future, in the next few years, yes. But I see a future where no, they would be. I think I think they would. They would have made more money and had more goodwill if it was, \"Hey, it's 30 bucks. That gets you the single player and the multiplayer.\" And then there",
            "start": 2535.45
        },
        {
            "text": "where no, they would be. I think I think they would. They would have made more money and had more goodwill if it was, \"Hey, it's 30 bucks. That gets you the single player and the multiplayer.\" And then there are loot crates in that because that was them the heart of most the people's problem with it on the surface was, \"Hey, this is a $60 game and I'm still getting nickeled and dimed and I'm still working my ass off to try to get this.\" And then it was, \"I'm never gonna really be able to unlock this without paying you real money.\" Like it all built up, right? Wouldn't you people start playing with the models and doing this, bringing in free-to-play, putting out a discounted game? Maybe there's and we're not there yet by all, but I think it would have been a goodwill win. I we're not there now. I honestly don't believe we ever will be. I think we're $30 Star Wars. Yeah, yeah, okay. Because I just think that the market in the way that consoles work, yeah, I don't know that we'll ever be able to ship so far",
            "start": 2581.74
        },
        {
            "text": "don't believe we ever will be. I think we're $30 Star Wars. Yeah, yeah, okay. Because I just think that the market in the way that consoles work, yeah, I don't know that we'll ever be able to shift so far from that that it makes sense in a different way. Anything an example that is looking at mobile where an argument was made so often, \"I'll just put out a game that cost more money that's more complete.\" They did that with Super Mario Run and it didn't work. Yeah, what did work? Fire Emblem Heroes. You know, like that is totally there. A Pokémon Go and I want inevitably Animal Crossing. Yeah, we of course coming up. I can't wait for the Eric K. I mean, is also not wrong, you know. I mean, I very much talk about this in a, \"Hey, we hypothesize and do this.\" And that's right, you're right. Money, our companies want to make money. It's very I mean, and and also monopolies are bad. So if it was that, yeah, GameStop closes up and Amazon closes or not gaming like you said. I don't mean Amazon. GameStop closes up, Best Buy closes up, Walmart",
            "start": 2620.92
        },
        {
            "text": "very I mean, and and also monopolies are bad. So if it was that, yeah, GameStop closes up and Amazon closes or not gaming like you said. I don't mean Amazon. GameStop closes up, Best Buy closes up, Walmart closes up. We have to worry about how you're getting your console on the shelf anymore. And then you're going to PSN and Xbox and Steam. Maybe there isn't a counter-argument, you know. If $60 is what games cost, they're gonna go on sale occasionally, but you're not gonna get a discount like you get with Gamers Club. You're not gonna get your Prime discount. You're not gonna have those options. That's real. Let alone the fact that you can no longer trade stuff in. I'm not I'm not trying to say that this is the only way. I just think it's always this argument that in a vacuum you're you would assume that this would drive down the cost. Digital would drive down the cost because when you sit down and actually spell out why games cost what they cost, you would imagine that's the fact. But if we're all sitting",
            "start": 2665.65
        },
        {
            "text": "would drive down the cost. Digital would drive down the cost because when you sit down and actually spell out why games cost what they cost, you would imagine that's the fact. But if we're all sitting there accepting $60 the price point, no matter how you get it, it's gonna be sixty dollars is the price point. Yeah, so it's one of those we have to sit there and wait and see. But I think if anything shown as you're talking about it, like a digital, all digital features quite a ways off. Mm-hmm. It's not the real thing. And they're just down to people like me who just don't want clutter and all these other things. But buy games how you won't get your deals. I appreciate that PlayStation Black Friday season sales are at least they're branded. Yeah, they're not as much as Best Buy or whatever. But but I mean, though that and that is it's things like that that I think are the hints at what's to come digital. But it is that shows how not far we are right from that that the with all that stuff because in years we're",
            "start": 2705.79
        },
        {
            "text": "that and that is it's things like that that I think are the hints at what's to come digital. But it is that shows how not far we are right from that that the with all that stuff because in years we're only getting these small little incremental deals on digital games because they they know that they can't just slash the prices of the way physical games can. Yeah, but physical games also need to slash the prices to get room on their shelves for they're trying to give away the goddamn Tom Nook amiibo. Well, I mean, this is literally what we're talking about with competition, right? Where I was talking about EA, right? You only seen a $30 EA Star Wars game. What would motivate EA to make that $30 Star Wars game, right? Would be the fact that number one, something there's the most realistic would be if there was a competitor. But since they have the Star Wars license, there's not gonna be competitor. And this for me comes up with 2K, right? When they were going up against EA with Madden. EA had Madden,",
            "start": 2741.34
        },
        {
            "text": "be if there was a competitor. But since they have the Star Wars license, there's not gonna be competitor. And this for me comes up with 2K, right? When they were going up against EA with Madden, a terrible football game, right? And they started selling that what was it, $30? I think it is. And it was a better game. And that's when EA was like, \"Oh,\" and they snatched up a license so that that wouldn't be there anymore. Competition breeds this stuff. So in the same way, if there's no competition for PSN, then there's no thing. What's fascinating is that there's no competition for PSN. Then, yeah, maybe they don't ever lower their prices. And the whole reason physical games are cheaper via Best Buy and Walmart or whatever is because digital is the competition putting their feet to the fire. And that's why they want you to join the game, right? Probably go in there, buy all this stuff off. Yeah, it's a fascinating thing as everybody races and it's better for the consumer. So there is the argument",
            "start": 2785.42
        },
        {
            "text": "that's why they want you to join the game, right? Probably go in there, buy all this stuff off. Yeah, it's a fascinating thing as everybody races and it's better for the consumer. So there is the argument that, yeah, if you could only get, I would think that Amazon or somebody like that would rise up and have to be able to sell digital codes as well. And maybe that's the competitor. Well, I mean, Amazon thing is a very interesting wrinkle because I foresee this holiday being a disaster when it comes to video games on Amazon from everything I've heard. Dude, what is happening? I know. It's it's all of this. It's all of this stuff lives of everyone trying to be have the biggest dick in the room and own a sector. And it's it's gonna cause a lot of problems. We've seen it year after year where you can't buy a 3DS because Amazon had such limited quantities because Nintendo and Amazon didn't play nice. Yeah, right now EA and Amazon are not playing nice. EA like that. It's crazy. You could not go on, you could",
            "start": 2824.15
        },
        {
            "text": "a 3DS because Amazon had such limited quantities because Nintendo and Amazon didn't play nice. Yeah, right now EA and Amazon are not playing nice. EA like that. It's crazy. You could not go on, you could not go on Amazon and pre-order Battlefront II. You can only pre-buy. So they're like, there's weird deals where EA is trying to limit Amazon selling physically. And it's like, it's all a bunch of business stuff. It's just all this behind-the-scenes. So that's why there are things like Gamers Club Unlocked and whatever the Walmart has and stuff like that. And also Amazon Prime stuff because they need that to be relevant as much as possible. Fascinating. Amazon missing out on sales now and the SNES stuff. And also there's a reason for that stuff. It's because they were getting their part of the pie is being limited artificially from all these the developers and or publishers limiting them because they want to have more control over how their game is being sold and when it's being sold. Dan EVD",
            "start": 2862.94
        },
        {
            "text": "being limited artificially from all these the developers and or publishers limiting them because they want to have more control over how their game is being sold and when it's being sold. Dan EVD writes in and says, \"Hey guys, with Animal Crossing: Pocket Camp releasing to the rest of the world later this month, parentheses, I've been playing the Australian version for about a week now and it's my absolute favorite. What does it take for a mobile game to make it to the first screen on your phone? Thanks.\" What gets you to play a mobile game, I guess, is the real question. People telling me it's good. Yeah, I feel like every every mobile game I've actually invested in, not just like booted up for a second, has been someone that I respect being like, \"Oh, you'll like this for this reason.\" Yeah, and then I started playing on my God. And most the time that's been true. There are a lot of mobile games that I've gotten straight-up addicted to. I always talk about Peggle Blast and Jetpack Joyride.",
            "start": 2915.05
        },
        {
            "text": "playing on my God. And most the time that's been true. There are a lot of mobile games that I've gotten straight-up addicted to. I always talk about Peggle Blast and Jetpack Joyride. Good one. Nah, my brother, Shadowgun. Now I played that. That's nice. That's not good. But no other there are there have been a bunch of different games. Kingdom Rush comes to mind that are fantastic. But it's all been because someone's like, \"Hey, this is really good for, oh, you like Fire Emblem, you'll like this.\" Sure. They're like things like that or Rayman Jungle Run. Yes, to run that the two of them. It was just like, \"Oh, man, if you like platformers and rhythm games, you're gonna love this.\" And I absolutely did. Yeah, I mean, for me, I rarely play mobile games, but it is the fact somebody tells me I can't miss it. I mean, Animal Crossing is a great example of something that's making me not I can't I'm not gonna miss this game because on paper it sounds so great. It's what I want out of Animal Crossing. I want the 15",
            "start": 2962.69
        },
        {
            "text": "Animal Crossing is a great example of something that's making me not I can't I'm not gonna miss this game because on paper it sounds so great. It's what I want out of Animal Crossing. I want the 15 minutes an hour, right? Lunch to be able to farm whatever the hell it is and see what's going on and get out and keep coming back and, \"Oh, yeah, I did that this morning and I never I need to go back and see what's grown.\" Like that sounds like a great time. Like that sounds like what I want from Animal Crossing that doesn't require a giant TV and does I don't want to carry another device for if it's just me popping in. Look for it. I wish they put a real release date on it. Yeah, that's word. They've always been weird with the release dates for these mobile games. I wonder why. I think it's because they want to and we've seen this with the Nintendo eShop as well. They're like down to the wire where they want to get it out as soon as possible once it's ready. Yeah, so they don't put the data out there because",
            "start": 3008.59
        },
        {
            "text": "and we've seen this with the Nintendo eShop as well. They're like down to the wire where they want to get it out as soon as possible once it's ready. Yeah, so they don't put the data out there because they're just like, \"Oh, it's ready now. Let's let's go.\" And they have the ability to have those marketing pushes because we saw with Fire Emblem Heroes, it was like a weird release schedule where it came out on Android first and then iOS later. But that wasn't ever really a date for iOS. It just kind of happened. Yeah, Super Mario Run was the opposite way where it did have a date, but then no one knew when the Android was coming. It's weird. We'll see. It's got to come soon. They say November. We're almost out of time. I hope it would be before Thanksgiving. But that'd be next week, which is impossible. Not impossible because it's mobile. We should output holy get up. I hope they do. Um, where do I want to end? I know this. I'm trying to decide if I want Bipartisan Gamer or Anthony. Oh, I want Anthony. You want to get me? Alright.",
            "start": 3042.82
        },
        {
            "text": "it's mobile. We should output holy get up. I hope they do. Um, where do I want to end? I know this. I'm trying to decide if I want Bipartisan Gamer or Anthony. Oh, I want Anthony. You want to get me? Alright. Anthony wrote into KindaFunny.com/KFGD and says, \"Hi guys, with the announcement earlier this week that TMNT will be included as DLC for Injustice 2, surely this means the WB now holds the license to the heroes in a half-shell. Therefore, do you think that this could mean we'll see the long rumored TMNT title from Rocksteady in the near future? Rumors surfaced about the game in 2010 and again in 2014, but haven't been discussed since. We'd love to hear your thoughts. Thanks, Anthony.\" I would give anything for that. Looking anything, it's not happening. No, I'm the exact same way. That would be awesome and amazing. I I you know, I love I grew up the Turtles. Turtles are awesome. I'd love to see Rocksteady's take on that and have it be like Arkham and have it all that fanservice and all those characters and",
            "start": 3079.03
        },
        {
            "text": "amazing. I I you know, I love I grew up the Turtles. Turtles are awesome. I'd love to see Rocksteady's take on that and have it be like Arkham and have it all that fanservice and all those characters and not and not like gritty, like horrible, but like a dark, you know, like the comics, like a grounded, darker, yeah, Turtles. I think you're reaching a bit on that. Yeah, surely WB holds the license. Yeah, they license the Turtles for Injustice 2, but that's not a blank check from Nickelodeon to go do whatever the hell you want with the Turtles. Like that's a very specific deal. Yeah, and I don't any even if they did, I don't think that now means that let's say with Nickelodeon gives them license do whatever you want the video games with Turtles, then you're looking at another four years, three years before you'd ever hear from this Rocksteady game. I'm playing this Rocksteady game. That's not what's happening. Rocksteady's been working quietly on something. Rumors always seem to be something else in the Batman universe.",
            "start": 3126.28
        },
        {
            "text": "hear from this Rocksteady game. I'm playing this Rocksteady game. That's not what's happening. Rocksteady's been working quietly on something. Rumors always seem to be something else in the Batman universe. Yeah, it's gonna be the it's gonna be Game Awards. No, but I just tempered my expectations all the time now. Yeah, like I'm sick of having my heart Lord more reveals and announcements than ever before. Yeah, exciting and prepare to be surprised, excited. Yeah, that's the thing. I'm like, I know when we talk about anything we're announcing, we say the same stuff and it's true. But I mean, people on The Game Awards all the time and I'm like, I don't know why you're on him in terms of reveals. There's been some huge reveals there. Last it was, yeah, The Last of Us. Yeah, it's like music. Cranky Kong and Donkey Kong Country: Tropical Freeze. Time to Squad Up. This is where one of you writes in to KindaFunny.com/KFGD. Give me your name, username, platform of choice and why you need help in video games. I read here the",
            "start": 3163.42
        },
        {
            "text": "Best Friends come and find you. Everyone plays games together and becomes the best community on the internet. This comes from Nick. He's on PC. His Discord is AwesomeNick#1458. AwesomeNick#1458 on Discord. I'm looking to run the raid blind in Destiny 2 on Sunday around noon Pacific. If any Best Friends want to join, have avoided raid spoilers and are ready for the challenge, add me on Discord. You know, it's a number, son, right? Yeah, okay, cool. But it's just not you nowadays holding to the kids. Yeah, you know what I mean? Yeah, in my day, it used to be called the pound sign and a pound sign. Alright, AwesomeNick#1458. New segment for you. Oh my God. Call the Greg's Pie-in-the-Sky Platinum. Matthew Ballina writes in to KindaFunny.com and",
            "start": 3204.4
        },
        {
            "text": "sign and a pound sign. Alright, AwesomeNick#1458. New segment for you. Oh my God. Call the Greg's Pie-in-the-Sky Platinum. Matthew Ballina writes in to KindaFunny.com and says, \"Greg, with Marvel Heroes shutting down at the end of December, do you plan to try to Platinum it? I just realized I only have a few more trophies left and want to get it before it leaves forever. Love everything you guys do. Thanks.\" I would love to do that. And I want to imagine there's a universe where I chip away at Marvel Heroes as I did as I have for years and years. Every so often, pop in, spend a weekend there, as a Saturday there playing. I haven't Jen make fun of the bad VO and I get the Platinum. But I'm not gonna have that kind of time dedicate over the next month to getting this thing before that closes out. I would need to get, I think it's another for now. Yeah, maybe might even be another five characters to level 60. Then I'd have to prestige one of them. I try to cheat it with",
            "start": 3249.58
        },
        {
            "text": "thing before that closes out I would need to get I think it's another for now yeah maybe might even be another five characters to level 60 then I'd have to prestige one of them I try to cheat it with the Omega prestige didn't work then of course there's raid content all sorts crazy all the loot boxes or not all the all the treasure chests it's too much can't do it Tim won't do it but I wish you well in your quest sir Tim yes it's time for KindaFunny.com/you're wrong it is what it better toriel eyes you today but I don't mean to allow it because I agree with the statement um oh I disagree and I want to tell you you're wrong K Babs says Ubisoft Club U B gives you challenges to complete neva subtitles for in-game reward badges Club XP like with PSN Profiles and discounts Ubisoft Store and also says I don't think Portillo has the insight expertise and integrity to be coast of Kinda Funny Games Daily he's also a dog you're also a Kebab so nobody's listen damn and then and the",
            "start": 3289.57
        },
        {
            "text": "and also says I don't think Portillo has the insight expertise and integrity to be coast of Kinda Funny Games Daily he's also a dog you're also a Kebab so nobody's listen damn and then and the K Babs says feels wrong correcting lyrics but Tim saying are we human or are we dancers the correct lyric is actually are we human or are we dancer singular it makes no sense grammatically but if we can't respect the works of The Killers what can we respect all right that's a great point see was that last sentence that because I'm here we go in here um wow oh wow Greg number one NPD this comes from Graffiti Pad for the last 1 months of last year yeah oh yeah what's Call of Duty: Infinite Warfare Wow shocking yeah people have that Call of Duty you put it on toast and people would eat it I had toast someone it's realizing this no it's a lot of people correcting us on the same things which I appreciate I mean I appreciate it but you can read the thread you'd see what other people were",
            "start": 3333.66
        },
        {
            "text": "I had toast someone it's realizing this no it's a lot of people correcting us on the same things which I appreciate I mean I appreciate it but you can read the thread you'd see what other people were corrected us on Oh Chappell Zero this is important you're wrong the Golden Joysticks you mentioned and said we're not GamesRadar Golden Joysticks are a hundred percent GamesRadar Golden Joysticks why I think is GamesRadar than the in London isn't it I always there's an office in San Francisco and we made it Susurrus One I pretty sure GamesRadar is based over there Mario 3D says you missed one thing from the NPD because we didn't go this far down how the to Bethesda titles performed in their debut month Evil Within number 13, Wolfenstein number 14 does not include digital yeah we didn't yeah it was down there I think the fact they weren't in there shows you Cuphead was $10 Refugee fans do we say was more than I said 15 okay okay NFL 2K5 launched at $0 and yes it was a better game",
            "start": 3386.22
        },
        {
            "text": "yeah it was down there I think the fact they weren't in there shows you Cuphead was $10 Refugee fans do we say was more than I said 15 okay okay NFL 2K5 launched at $0 and yes it was a better game than Madden 05 we're going with second page here oh my god we up this show it's all over it's all done wrap it up folks the dark side of them and I'm with you Kev oh you mean a Mario yeah or what are you to the Challenge Tower yeah let me know what got spoil game for you cool that's it how many times have you tried the Challenge Tower are you going in there with three hearts or six uh-huh do you know where to get it I'm gonna give you some live FAQ it's like he was called a Nintendo helpline you ready this isn't spoiler 90 five five three seven zero zero one eight hundred Kars4Kids when you when you respawn on your next death and you start outside throw your hat on all the stone like stems off the the stone apples and and like I think it's the top one gives you another one of them big",
            "start": 3448.8
        },
        {
            "text": "when you respawn on your next death and you start outside throw your hat on all the stone like stems off the the stone apples and and like I think it's the top one gives you another one of them big hearts and you get six and you go in there and if you can't beat with six hearts I want you to sell your Switch and never come back you know gentlemen this has been Kinda Funny Games Daily each and every week to enter variety platforms we run you through the nerdy video game news need to know about we have a good time Twitch.tv/KindaFunnyGames YouTube.com/KindaFunnyGames podcast services around the globe thank you as always for your support next week on Monday Tim joins me I do also worth noting only two shows next week Monday and Tuesday so be thankful it's Thanksgiving here in America so Wednesday through Friday we off we play in games y'all we have Saint the owns me lair can't get away from me Bobby's playing games to don't talk to me or don't do the oh you did the sexy",
            "start": 3508.52
        },
        {
            "text": "in America so Wednesday through Friday we off we play in games y'all we have Saint the owns me lair can't get away from me Bobby's playing games to don't talk to me or don't do the oh you did the sexy eyebrows and cool guys I gotta go I gotta go it's been a pleasure serving you",
            "start": 3550.46
        }
    ]
}