{
    "id": 3194,
    "video_id": "RN_pxlzERPc",
    "show_name": "Vlog",
    "hosts": [
        "Tim Gettys",
        "Nick Scarpino"
    ],
    "title": "We Starred In A Disney Commercial! - KF VLOGS",
    "description": "Check out Disney Emoji Blitz here! https://smart.link/5a0117eb99cd3 \n#DisneyEmojiBlitz #Ad\n\nCheck it out at https://smart.link/5a0117eb99cd3\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids",
    "published_at": 1512061202,
    "duration": 894,
    "transcript_chunks": [
        {
            "text": "What's up, guys? I'm Tim Gettys. This is the producer/seducer, Nick Scarpino. Yes, Disney hired us. They did. They hired me and you, yes, to be the stars of the Disney Emoji Blitz commercial. We decided we're gonna make a little vlog of our adventure down to LA. Yeah, we wanted to show a little bit of the process of what it, what goes into making a commercial of that magnitude. And it was really, really fun. We spent two days down there. One day was just wardrobe fitting and trying. Yeah, it wasn't a day early to actually do the wardrobe fitting, kind of pick which, which character was gonna wear what. We went down there, the director was, the other producers were there, the agency was there, the client was there, and everyone got to look at us in various different color combinations, which I thought was fun. Yeah, it's like I walked into the wardrobe room, right? And I was like, there was like 50 different colors of the same thing, and I'm like, this is heaven. This is how, this is what I want my wardrobe, my actual closet",
            "start": 0.06
        },
        {
            "text": "It's like I walked into the wardrobe room, right? And I was like, there was like 50 different colors of the same thing, and I'm like, this is heaven. This is how, this is what I want my wardrobe, my actual closet to look. I want to live in this rainbow. So, so yeah, we went down in the, the idea of the commercial is that I am the Disney Emoji Blitz champion, right? And you are the Challenger, which makes sense because you're, you are a current Kinda Funny champion, right? True spoilers. And I am what a lot of people are saying, the number one contender, the challenge. A lot of people are saying that I should probably have the belt. So we started our whole adventure off by going to the airport, obviously, to beautiful SFO. Went from SFO to Burbank on Southwest Airlines, which as everyone knows, is pandemonium. It was just that you just go on and you don't get a seat assignment, and it's just like first-come, first-serve. Yeah, the thing about Southwest that people don't know if you don't fly a lot is most normal airlines",
            "start": 40.08
        },
        {
            "text": "that you just go on and you don't get a seat assignment, and it's just like first-come, first-serve. Yeah, the thing about Southwest that people don't know if you don't fly a lot is most normal airlines give you a seat assignment. Southwest gives you a spot in a line, and once you go through that line, they take your ticket, and it is every person for themselves. It is Thunderdome. It started off playing. We had a pretty good experience though, because it is so early in the morning that there was no one there. So half of the plane, it was, you know, not, it was the opposite of Slim Pickens. Yes, there's Pickens left and right. Yeah. And then when we landed, we got to do that cool thing where we got off like rockstars about where it lands. It's like, what's it called? The tarmac. Yeah, we land on the tarmac, and you actually get off the plane, hit the stairs down, and you feel just like James Bond, like the midway through Casino Royale. Yeah, he walks off and he like fixes cufflinks, except we don't have or wear now.",
            "start": 82.71
        },
        {
            "text": "actually get off the plane, hit the stairs down, and you feel just like James Bond, like the midway through Casino Royale. Yeah, he walks off and he like fixes cufflinks, except we don't have or wear now. And then from there, we bird straight from, so we landed in Burbank, right? The Bob Hope Airport. Yeah. Then I've always thought that was a joke. No, that's actually what it's called. I love the Bob Hope Airport because in Burbank, the Burbank Airport, people don't call Bob Hope, they call Burbank. But I like the Burbank Airport because it feels like a set from a TV show. Like there have been times when I've gone through the, the security there where it's been me, two other people, a line about as long as this table of like a stanchion, and then one security guy that looks like it came straight from Central Casting. Yeah, and I loved it. And then you just threw it in five seconds. Well, and also that, that's the funny thing is like everyone in LA is in production somehow. Our Uber driver, of course, he's like, oh yeah,",
            "start": 121.14
        },
        {
            "text": "yeah, and I loved it. And then you just threw it in five seconds. Well, and also that, that's the funny thing is like everyone in LA is in production somehow. Our Uber driver, of course, he's like, oh yeah, no, I do post-production, edit things. There's just like, of course you do. Every driver I've ever had in LA has been in the business. And so we, so we Ubered over to where the studio was. And in typical LA fashion, you get out and you're like, what is this? If we look like we're in the middle of nowhere, there's just a bunch of alleys everywhere. And then we see this place where I echo, we go in, and then it's just this beautiful studio. Yeah, it was that beautiful Geo's Mellon set in a place called Stage This, which I'm sure you're seeing beer all over right now. And yeah, it was the studio that they've shot Katy Perry music videos, Britney Spears music videos, and now a commercial featuring Tim Gettys and Nick Scarpino. So what you're basically saying, Tim, is aside from being a Disney kids, mm-hm, which we are already,",
            "start": 161.93
        },
        {
            "text": "Perry music videos, Britney Spears music videos, and now a commercial featuring Tim Gettys and Nick Scarpino. So what you're basically saying, Tim, is aside from being a Disney kids, mm-hm, which we are already, actually, uh, we're also on the same level as Katy Perry and Britney Spears. Yeah, yeah, that is, that is very true. I think that's a fair assumption and fair giant jump to make. So we get there in day one's for wardrobe, but we thought it was gonna take an hour because, you know, that's what they said, right? But you always need to understand that what is said and what reality is a production are two very different things, right? We ended up being there for like six hours trying on a bunch of clothes. And, you know, a lot of people would complain about that, but not me and you. You know, we just do it. We wanted to make sure it was right. The best part about it was the wardrobe person that you, wardrobe people that were there were very nice and handed us both dance belts. You don't know what a dance belt is? Google explain",
            "start": 197.54
        },
        {
            "text": "it was right. The best part about it was the wardrobe person that you, wardrobe people that were there were very nice and handed us both dance belts. You don't know what a dance belt is? Google explain it for the people. Nick, a dance belt is essentially a device that is very small as an undergarment that's very small, and it is designed to keep everything right where it needs to be looking at a lot of site. So if you were in spandex, you're not, nothing too more keeping G-rated, so to speak, right? Because we're wearing spandex. We were wearing thin shorts over the spandex, but still, you know, you don't want there to be any opportunity for anyone to catch a glimpse of something that they don't necessarily need to be looking at. But pretty much we put on the dance belts, and then we tried on a bunch of different outfits, and then we'd have to go strut in front of all the big execs and stuff. And our friend Nicole, who is a longtime friend of yours, long in front of married, then I married her and her",
            "start": 239.93
        },
        {
            "text": "of different outfits, and then we'd have to go strut in front of all the big execs and stuff. And our friend Nicole, who is a longtime friend of yours, long in front of married, then I married her and her husband Anthony. We've worked together at IGN, and so this is said, we got to hook up through that. A few reached out and said, hey, I'd love to work with you guys on this. People here like, you guys have stuff, you, you know, you have a certain vibe that we're looking for, which was great. And so we agreed to it. Yeah. And so she was there, and she was basically, she's always the one in life, period, that I want to impress. Mm-mm. Even if I'm not around her or doing anything, I think to myself, what would Nicole do? Yeah, I actually rather, I think what would Nicole like? Yeah. And then I showed her everything. We came out in different outfits, and they're like, we don't like this. Nuts. Make it a competition again. You came out three times. I came out twice. Three, and I nailed my outfit on the second time. True. I didn't have",
            "start": 281.42
        },
        {
            "text": "in different outfits, and they're like, we don't like this. Nuts. Make it a competition again. You came out three times. I came out twice. Three, and I nailed my outfit on the second time. True. I didn't have anything to say, 'cause trust me, I would have worn blue at the other. I'll tell you what, they put you got in blue, and I'm so jealous. Even blue, because they know, uh, then I'm the champ, the true champ. Mm. And they put me also in a pullover sort of windbreaker, which I think my uncle Lou in Jersey owns. Well, I'm almost 100 years old, probably. Point. And he owned one of those. I don't like every iteration of that pullover. You know, the pullover hoodie with like a little bit of zipper. It's like, come on, it's going zip. No one's a banana. You ended up looking like a true 80s villain, so I appreciate that. Light. We eventually finished the wardrobe, and what cool, let's go get lunch. Where did we go to be conformist anyway? Would something, oh, Wood Ranch. Wood Ranch. Yeah. But when's Wood Ranch for lunch? Because my wife",
            "start": 319.49
        },
        {
            "text": "eventually finished the wardrobe, and what cool, let's go get lunch. Where did we go to be conformist anyway? Would something, oh, Wood Ranch. Wood Ranch. Yeah. But when's Wood Ranch for lunch? Because my wife loves this sweet potato mash they have there. And every year when we used to go down for Thanksgiving, we would stop by Wood Ranch or Wood Ranch and get a giant tub of sweet potato mash. And we deserved that. Those phones mean you hanging out with Tim and Nick things. Then we're like, let's go check into the hotel. Where we check in, check Genet. Well, we didn't have a hotel at first. So the trip came about so quickly that I was, we were at Wood Ranch, and look, we should probably tell, we had driven past a Holiday Inn like business. And I'm like, well, that's a walkable distance. And I like it talkative. And there's a Starbucks way, and it starts in the way. So I was like, this makes sense. It checks out. Who booked that? It was great. Smells a little like it's a little too old, like maybe they need to clean some",
            "start": 356.24
        },
        {
            "text": "a Starbucks way, and it starts in the way. So I was like, this makes sense. It checks out. Who booked that? It was great. Smells a little like it's a little too old, like maybe they need to clean some stuff. But I'm not complaining. Part of the experience is part of the experience. You wanted tactility to it. But then so we were just hanging out. We're like, you know, we have a really early call time tomorrow. We had to be there. Yeah, we had to be there really early. But we're like, you know what? There's a lot of good comedy here. You've always talked about this, the Comedy Store. Yes, that was part of the fun was like, we, we got there at, I think we were wrapped by like four. We were able to grab some food. And then, you know, we were talking about who we want to hang out with. And I was like, well, you know, they have great lineups. The Comedy Store. I like, let's do it. And so went over to the Comedy Store. I just booked a ticket, which random. I had to think he could, but was a Tuesday night. So we were able to get a",
            "start": 392.54
        },
        {
            "text": "great lineups. The Comedy Store. I like, let's do it. And so went over to the Comedy Store. I just booked a ticket, which random. I had to think he could, but was a Tuesday night. So we were able to get a seat and saw three just hanging out. And in the front of it for a while, if you don't know the Comedy Store, there's the bar. It looks, it's actually on Sunset. So you can walk from this like right off the street into the bar, second outdoor patio. And Tim and I were out there having a cocktail. And who do we see? Audrey Shaco. Hey, Shaco. Just hanging out like right there. Knows like, hey. And he's like, hey, man. And that's it. That was it. A good time. Then we watched the, the showcase. And it was a lot more heavy-hitters than I like. Chris D'Elia, Bobby Lee, Ali Wong, Erik Griffin, Theo Von, or Theo Von, excuse me. And not Theo Von. He say his name. It was great. I had other people. I forgot who. I had a blast. It was super funny. It was, it was fun hanging out there there with you. Then we went home, got some of",
            "start": 428.81
        },
        {
            "text": "me and not Theo Von. He say his name. It was great. I had other people. I forgot who. I had a blast. It was super funny. It was, it was fun hanging out there there with you. Then we went home, got some of that quality shut-eye. You know what I mean? I felt sleep. Had to wake up so early. We had, I think we had to be at set at 7:00 A.M. Was a call site, which is early. Then we just, we shot the scenes with you first, 'cause you're just at the end of the, yeah, I am the butt of the joke. Like I'm the pun. I'm what a lot of people consider the best part of the commercial. True. So we did what would happen was they had about a hundred extras there. They were all checking in when we arrived. And a hundred extras, by the way. Yeah. So they had, they had this whole stadium set up, kind of like filled with bleachers around this podium where all the action was supposed to happen. And so they had arranged the shoot day rightly so to get the extras out as quickly as possible because sitting there for 10 hours is not",
            "start": 472.16
        },
        {
            "text": "especially a little grueling, especially when you're dealing with a bunch of extras that don't have anything to focus on other than like what they're supposed to be doing. So I think the director and the producers made a strong call there between them, bring all them. And first, my scenes happen with them. And so as the commercial ends, you see me. I, we did all those. I think conservatively, I knocked him out of the park first take every single time. But they did five, six, seven, one takes. Yeah, after that anyway. I think just for safety. So you got, you were wrapped at around like noon-ish. I was wrapped. Yeah, I think I went from, yeah, I think I was about four or five hours. Yeah, it was a original of, they had told me the prior day, hey, maybe I'll probably wrapped around 10. I was wrapped. It took a couple of hours longer.",
            "start": 513.11
        },
        {
            "text": "I went from, yeah, I think I was about four or five hours. Yeah, it was a original of, they had told me the prior day, hey, maybe I'll probably wrapped around 10. I was wrapped. It took a couple of hours longer, of course, 'cause that's just what happens. Because I was wrapped, I got out of my dance belt, wanted to burn the thing I don't have been wearing for four hours. I wanted to take it and just slingshot it into, I mean, it had to be, it was rank, I think is a good word. Mine, that means mine was pleasant. No, I'm speaking about mine. It was, we skip something, Nick. It's something that's very key, which was makeup. I, there's, there's nothing that makes you feel fancier than when you're sitting in a room and someone comes up to you, and it's one of those just a bunch of mirrors and a bunch of those like light bulb looking things. I'm like, this is so Hollywood. It's so Hollywood. And now they just do a bunch of stuff, this powder. So I don't really know what they're doing. Every once a while, they tell me to look up or close",
            "start": 553.97
        },
        {
            "text": "things. I'm like, this is so Hollywood. It's so Hollywood. And now they just do a bunch of stuff, this powder. So I don't really know what they're doing. Every once a while, they tell me to look up or close my eyes. I'm like, all right, I have no idea what. Yeah, but you really do feel special when throughout the entire day there are multiple people. Like there was two wardrobe people and one makeup person who after they did their job in the beginning, their sole job was to sit through the whole day and look at you watching and make sure that everything is right. Yeah, so people just like walk up to me and like move my little, yeah, you know, or like, like touch them to make them like, wow, this is insane. And we do not deserve this. No, no, not every time I happen, I giggle to myself. I'm like, if this is the last time this happens for us, it's, it's, it was worth it. Totally worth, really worth it. Then so you got to leave. I had to stay all day. Yeah, I believe I had a runner. A couple actually got a chance to run",
            "start": 594.95
        },
        {
            "text": "time this happens for us, it's, it's, it was worth it. Totally worth, really worth it. Then so you got to leave. I had to stay all day. Yeah, I believe I had a runner. A couple actually got a chance to run a couple errands in LA that I had to be doing anyway, which is great. And I came back, I think around 7:00. So we just finished the first seven hours of the day. We're about to take a one-hour lunch and then get right back to it. I'll get right back in the costume and then we do another five hours. We'll see how this goes. So I left at around 1:00. I ate dinner with our, sorry, ate lunch with the crew. Mm-hmm. I love all you guys. And then I left. Then I came back. Now I'd meant to come back five, but the traffic took so long coming back from what I had to do that it, it was so meanwhile, while you're doing all that, I'm in the studio doing a bunch of shoots. It's kind of the getting ready segment of the commercial. Yeah, I get my own chair. Didn't have LaCroix, but they do have this talking brain. Let's see what",
            "start": 631.88
        },
        {
            "text": "that I'm in the studio doing a bunch of shoots. It's kind of the getting ready segment of the commercial. Yeah, I get my own chair. Didn't have LaCroix, but they do have this talking brain. Let's see what this is all about. So to be suiting up for the championship, it's very, very Edgar Wright. The commercial, what it's done, is gonna be a lot of like, oops. Yeah, that was a lot of the direction where everything was a nightclub, a lot of like really jumpy and cut emotions. But it was just random things. Like there's one point I'm popping balloons or like turning lights, which is on really fast. I'm shuffling cups around. And so totally balls the busy spinner. The theme was everything in threes, right? That's how, that's how the game works. Like you collect, like you have to match three. So nice. Yeah, it's a match three games. So, so the theme was, let's embrace that and let's do, let's shoot the champ nailing matching three. And they did a lot of really cool stuff, especially with some of the effects work. Most of it",
            "start": 682.57
        },
        {
            "text": "games. So, so the theme was, let's embrace that and let's do, let's shoot the champ nailing matching three. And they did a lot of really cool stuff, especially with some of the effects work. Most of it was like, well, yeah, yeah. So I can't wait to see the actual commercial now. Should be in early December. Yeah, I was shot on an Arri, which is a beautiful camp for an Arri Mini. And the lens was insane. It was like bigger than Gia. Yeah, I have a picture that I can't remember what lens system that used. I want to say it was a Panavision lenses, Tim. But they were using a zoom lens because that's how you get those snap zooms. They can do by hand. But it was actually like, was, what was cool about it was the pro setups are really awesome. They took, they have two servo mounts for it. One for focus pulling, which the focus puller sat, actually don't even notice that. Another, he was sitting in video village all day, actually pulling focus. We'd have to be by the camera. And then they had another servo on her for the zoom. But they",
            "start": 723.31
        },
        {
            "text": "sat, actually don't even notice that. Another, he was sitting in video village all day, actually pulling focus. We'd have to be by the camera. And then they had another servo on her for the zoom. But they took that off. So the DP, Dallas, name is Dallas, could, could slam those, those snap zooms. What was really cool too is there was one time they did an effect where I crashed staring at the camera home and on my glasses, and I jolted off. And as they did it, they did the same effect that they used in Jaws where the camera is physically dollying towards you while they're zooming by pulling out. They're pulling out and zooming away. So it creates this really uneasy feeling of you being in focus and everything looks like it's going like that. Yeah, and it's super cool. I can't wait to see this, man. The project was a lot of fun. I think it's gonna be super great. My favorite thing is I'm now officially a Disney kid, and they asked me personally to do the Disney wand thing. I'm Tim Gettys, and you're watching Disney.",
            "start": 762.88
        },
        {
            "text": "a lot of fun. I think it's gonna be super great. My favorite thing is I'm now officially a Disney kid, and they asked me personally to do the Disney wand thing. I'm Tim Gettys, and you're watching Disney. So I did that. They did not ask you. I asked. It was actually not a part of the, the terms that we had agreed upon. You said Nick five times that day. You're like, we have to do this. We did it one time. It didn't work as the whole set was bathed in red light. Yeah. And you look like the bad guy from Tron. Mm-hmm. But then we got, we do, we finally actually putting that out that anyone ever hurt. All right. Well, that's gonna be in this. And then after that, we went, you know, got back on the plane. It got delayed. That wasn't so much fun. But then when we got back here, we still had to do a let's play. So we did that. And that was a great time. That was just like a normal day in the life of us with nothing makes sense. And this is just a new challenge every five minutes. But it was a lot of fun. I'm stay tuned for the",
            "start": 803.38
        },
        {
            "text": "and that was a great time. That was just like a normal day in the life of us with nothing makes sense. And this is just a new challenge every five minutes. But it was a lot of fun. I'm stay tuned for the commercial. Like I said, early December, we're gonna be doing some cool things too where we're going to do a commentary track over the videos. Yeah, so let's break it down a little bit more. I think it'll be fun. Mm-hmm. Yeah, yeah. So then if you like these type of vlogs and stuff of us kind of documenting our different adventures, let us know in the comments below. We want to do more of them. We're trying out a bunch of different styles. So yeah, let us know what you like about this, what you don't like. And until next time, I love you. Lets him host.",
            "start": 852.57
        }
    ]
}