{
    "id": 3160,
    "video_id": "TIEhgshLy_s",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Andy Cortez",
        "Jack Pattillo"
    ],
    "title": "Justice League Review - Kinda Funny Reacts",
    "description": "The boys . . .  well you'll see.\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1510900408,
    "duration": 2115,
    "transcript_chunks": [
        {
            "text": "What is up everybody, welcome to Kinda Funny. This is the Reacts for Justice League. I'm Nick Scarpino. This is GameOverGreggy, Greg Miller. Hold it, save it. This is Jack Pattillo from Rooster Teeth joining us all day. It was fantastic. Glad to hear your perspective on this. And rounding out the team, Mr. Tim Gettys, the most like always. We'll be doing a spoiler-free impression for the first probably, I have to imagine, two minutes on this one. Spoiler warning, we're gonna spoil. Just we will go into the spoiler warning and spoiler if a portion of it. So gentlemen, no holding back. Starting off, what are your what are your spoiler-free impressions of this film? Greg, let's go with you first. I enjoyed it. It's hard to talk about what I liked the most without spoiling it. Okay. I feel like the end of the movie ends at the end of the movie is the what the DC Universe film should have been from the beginning. Okay. And so like the I like I I feel like throughout the first what would you call that the forepart",
            "start": 0.03
        },
        {
            "text": "ends at the end of the movie is the what the DC Universe film should have been from the beginning. Okay. And so like the I like I I feel like throughout the first what would you call that the forepart of the movie? Yeah, you don't mean really? Yeah, I guess like I would say last 15 probably. I like the one of the very last things you see. No, I'm talking about a very specific point from then on and we'll get to that. But it doesn't matter from that before then. It's like, alright, this is a fun enjoyable action film or whatever. Like it's just doing its thing. It's it's definitely it's what I would stick with me. It's what I'd always be like, there's a boilerplate comic book movie. And I don't say I don't think a comic book movie is a Marvel movie. Like when I'm like, oh, it's a boilerplate Marvel movie. I'm so like Marvel movies are pure comic movies down here where they're trying to shoehorn in lines that don't really fit. And like it's the same problem you expect from the DC Cinematic Universe on film of like",
            "start": 46.59
        },
        {
            "text": "Marvel movies are pure comic movies down here where they're trying to shoehorn in lines that don't really fit. And like it's the same problem you expect from the DC Cinematic Universe on film of like, hey, here's Cyborg, Aquaman, Flash, and you don't really know shit about any of them. But like you here they are and they're being funny. And it's like we already care about Wonder Woman because of her flick. You already care about Batman because he's Batman and you know Batman's story so well. Flash, I thought was funny and interesting at times, but so many of his jokes fell flat and just weren't presented well. Like but I liked what they were driving at with him. I liked what they were driving at with Aquaman, even though he's totally as one-note as he wasn't the trailer. Mama, I know it's hot, baby. You can stop saying it, Jen. Yeah, I Jack, what are your thoughts? Elements, the music of this movie were fun and I enjoyed certain parts, but like the cake as a whole didn't work. Like the certain",
            "start": 90.21
        },
        {
            "text": "hot, baby. You can stop saying it, Jen. Yeah, I Jack, what are your thoughts? Elements, the music of this movie were fun and I enjoyed certain parts, but like the cake as a whole didn't work. Like the certain certain bits of it were good. Some of there's certain things like, oh, that was that's kind of cool to see that on screen for the first time ever. But those those parts weren't enough to make the whole movie a solid thing. You know, it was that that's what had for me is like you have it seems like such a softball. Like this is something that like so many people wanted to see for so long. How can you mess it up? You know, how could you mess it up as bad as this? Lightly Greg was saying like there's characters. It's like, oh, we're gonna drop in three brand new characters that you've never really interacted with at all. And oh yeah, by the way, just you're supposed to care for them. It's like, but I'm not, you know, or something like you like Avengers, we had seen, you know, many of these elements like already",
            "start": 131.37
        },
        {
            "text": "with it all. And oh yeah, by the way, just you're supposed to care for them. It's like, but I'm not, you know, or something like you like Avengers, we had seen, you know, many of these elements like already. There's like a lot of these characters to any other film. Yes. Yeah, it's like this is a movie that would have worked better two or three movies further than where it is now. Maybe if assuming they got some of the other ones right, which is a big ask right now. Again, it would be the problem the fact that I mean, at least in my opinion, is a DC fanboy. They end where they should have begun. Yeah, if the DC Cinematic Universe was what the final 15 minutes, we'll say, of the movie are, right? If that's where we started in even the final closing shots of that movie, I'd be like, yes, fuck yeah. Then I can get down and enjoy solo movies about these people. But of course, it's the problem they've had with this where Marvel was going the bright comic-book route, we'll go the dark route. Okay, well, you'll see, you'll believe",
            "start": 173.64
        },
        {
            "text": "solo movies about these people. But of course, it's the problem they've had with this where Marvel was going the bright comic-book route, we'll go the dark route. Okay, well, you'll see, you'll believe us after Batman v Superman. Fuck, they don't like that. Fuck, they didn't like Suicide Squad. Fuck, pull up, pull up, pull up. And it's like, but it's funny that the person I liked the most were the most Marvel-esque parts. Oh yeah, probably because they were the Joss Whedon. Yeah, percent. But like it like at one point, you see, you know, the five of them all lined up and they're all like in these colorful suits. Like, oh yeah, that isn't interesting to know. Like it was a decided difference between like kind of the beginning elements of the film and by the end. Like that's a blue to those blue. That means blue. But it's like, yeah, seem like, wow, I like seeing Flash and I got gonna stick. They all are in there. Like they're geared up. It's like, oh damn, that's that is pretty cool. That's what you want to see on",
            "start": 211.08
        },
        {
            "text": "but it's like, yeah, seem like, wow, I like seeing Flash and I got gonna stick. They all are in there. Like they're geared up. It's like, oh damn, that's that is pretty cool. That's what you want to see on the screen. And like you said, it takes takes a long damn time to get to those points. Yeah, Tim, I'm I enjoyed that. The we you look like you were enjoy. I did not enjoy the movie. Okay. It's about the movie that I did enjoy. I enjoyed that it was standalone. Yeah, I felt like that all the stuff that they did throughout you like Cyborg and Flash or whatever. They did a good enough job of at least putting them into the world. We know at least half the team at this point. Actually like Cyborg, which I thought was interesting. Like, man, I mean, cuz just based on comics, I've never enjoyed Cyborg at all. But this one was like, okay, therefore, you can't go that. I like Cyborg and I like Aquaman a lot more than I thought I was going to. Character I thought Cyborg I was gonna absolutely hate and I thought Aquaman I",
            "start": 248.13
        },
        {
            "text": "was like, okay, therefore, you can't go that. I like Cyborg and I like Aquaman a lot more than I thought I was going to. Character I thought Cyborg I was gonna absolutely hate and I thought Aquaman I was gonna be like, here's another example of why Jen and Joey should stop caring about Jason Momoa. But those two characters, I was like, okay, again, nothing to call home about necessarily. But Jason Momoa, like I was I was all the underwater stuff. I'm like, this is actually kind of cool. I could actually see maybe potentially there being some fun in an Aquaman movie. But like whereas Batman v Superman, I feel just was trying to set up universe and I trying to like get a bunch of movies going. This one was like, you know what, the elements are here. We're gonna do this. And of course, there are some things like and the post-credit stuff that like sets shit up. But like this itself was just it had a story and it told that story. It wasn't a good story at all. But I appreciate that at least they had the",
            "start": 292.63
        },
        {
            "text": "like and the post-credit stuff that like sets shit up. But like this itself was just it had a story and it told that story. It wasn't a good story at all. But I appreciate that at least they had the ability to not blow their load all over the place, which they've done every other single time with the exception of Wonder Woman, I guess, right? And I also enjoyed the the score. A little dramatic, but thank you. Danny Elfman was fantastic. Dude, when he was there. Yeah, I you know, when they when they reported back on that about a few weeks ago where they were talking about how Danny Elfman was gonna actually reincorporate some of the themes from the '89 Batman and from '78 Superman. Thank you. I was very I was like, I don't know if that's gonna be a good idea. But I will tell you seeing Batman on screen, seeing Gotham City at night, hearing the 1989 Batman when he shows up on the fucking rooftop with Gordon. I mean, the first time he's in the Batmobile, just was gratuitous in a good way, in a great way. It",
            "start": 328.84
        },
        {
            "text": "seeing Gotham City at night, hearing the 1989 Batman when he shows up on the fucking rooftop with Gordon. I mean, the first time he's in the Batmobile, just was gratuitous in a good way, in a great way. It was just like it made it feel right. And that this movie is at its best when it was full comic book, full we don't give a shit in some way. But the Marvel movies have they're getting better at, but they've never nailed is having iconic themes for its character. And I feel like the DC Universe has it a really good job of doing that. Wonder Woman, you know her theme song. You know his theme song. Batman, you didn't know his theme song. So I'm happy that gave him his original one that you do know him by. But then it's weird that Superman didn't have his Man of Steel theme at all. And it was random asked little hints of the original. Yeah, I feel like where they did Batman a lot of good service. I feel like they let Superman down a lot because it his score was not used while I don't get well well, I'm sure",
            "start": 371.56
        },
        {
            "text": "hints of the original. Yeah, I feel like they did Batman a lot of good service. I feel like they let Superman down a lot because it his score was not used while I don't get well well, I'm sure we'll get into Superman. Yeah, in a second. Real quick before moving to spoiler territory. Well, I was gonna say, how does this rank in your guys's brain versus Batman v Superman? Yeah, that's what I want to know for you because you don't like this movie at all and you didn't like that Superman at all. I want to know what's worse. I am shocked at how bad this movie is. And I is it worse than Batman v Superman? I almost think that's a worthless question because because with this, it's like there's I I had my expectations were so much higher for this. Really? Yeah, because it's like Wonder Woman, I enjoyed a lot. I knew that this movie it's best is, oh, fuck, this has gone the scripts, massive reshoots and Henry Cavill's fucking face. Oh my god. Like all these like weird issues and Danny Elfman's just on the score.",
            "start": 414.35
        },
        {
            "text": "I knew that this movie it's best is, oh, fuck, this has gone the scripts, massive reshoots and Henry Cavill's fucking face. Oh my god. Like all these like weird issues and Danny Elfman's just on the score. Kinda there's other people doing parts of it. It's like there's so much random shit that it doesn't sound like there's any consistent vision. So I was like, yeah, that's bad. But it's I guess seeing these characters together, there's so much opportunity for awesome things and it didn't happen. And that's why I'm surprised how bad I think this movie is. Yeah, this is something that I, you know, ten years ago, maybe maybe maybe a little longer than that. They would have I imagine after, you know, after uh what's-his-name, Zack Snyder left and then Joss Whedon came in. They'd have been like, we're gonna take an extra year on this thing. Sure. And really polish shit because right now it is this is not going right. But they're in a situation now. I was like, oh, we have the next ten movies lined up when we",
            "start": 455.33
        },
        {
            "text": "an extra year on this thing. Sure. And really polish shit because right now it is this is not going right. But they're in a situation now. I was like, oh, we have the next ten movies lined up when we have to put stuff. Do they don't hold your breath, everybody. Don't hold your guess. Really though, what's sad to me is there are moments in this movie where you see it's not even the like, oh, it's too dark or whatever because there's dark scenes at work. It's just it's the the same shit that we've seen so many times where it's CG bad guys, so many CG things flying around. It seems like all the rules are inconsistent of like, so Aquaman just jumping all around like nimbly bimbly and such. And just like, let me see. It just feels so inconsequential and so just like it's the mess. It's just an explosion of brown colors. Then a couple really colorful things in the mod. There's no danger, no danger, no danger at all. And it's just like I would like to see these guys actually team up and use their separate",
            "start": 500.96
        },
        {
            "text": "of brown colors. Then a couple really colorful things in the mod. There's no danger, no danger, no danger at all. And it's just like I would like to see these guys actually team up and use their separate abilities together to accomplish something. But once again, this is another DC movie where it's let's punch harder. Yeah, Greg, what's your thought on it? In what respect? Sorry, did you already win? I'm Batman v Superman versus this one. No, I guess no, I don't know. I I mean, what does anyone care? Like for a full transparency, I wouldn't do this video if Jack wasn't it. Cuz like the movie ended and I was like, like here's the best way I think to describe Justice League for me personally, right? Is the fact and this is I'm totally stealing from Anthony Carboni. Anthony Carboni talks about of him. Yeah, I know he's a nobody. It talked about with Rebirth, right? For DC Comics. Like, you know, there was New 52. Nobody really liked it. Rebirth came around. They tried to tie up loose ends and get us to where we needed to be.",
            "start": 541.28
        },
        {
            "text": "when we get to the end of Superman story at the end. But like to catch Superman up in this continuity of Rebirth, right? A whole bunch of weird stupid shit happens to reset the clock and have it be, yep, this is Lois and Clark. They're the he's the only Superman. They have a kid. Everyone knows they live in Metropolis. They work at the planet. Everybody's good. It's definite return happen. There was no Conner Kent yet. I do. I'm in the weeds. This movie is that where you're going? You're like, alright, cool. This is whatever it is. But and then for me at the end of it, it's reset and where to where I wanted to be in Man of Steel. Okay. And so that's the thing of like the whole universe is such a weird thing of one continuous blind message with the app in my opinion, the outside lot, the outlier of Suicide Squad.",
            "start": 585.77
        },
        {
            "text": "to be in Man of Steel. Okay. And so that's the thing of like the whole universe is such a weird thing of one continuous blind message with the app in my opinion, the outside lot, the outlier of Suicide Squad, which is just an awful awful film. I don't know. Yeah, I enjoyed this. Like I enjoyed Batman v Superman. I was way more motivated to go see Batman v Superman a million more times. I'm way more motivated to watch the end of this movie. One, we'll get to spoilers. Like there's a turning point where I'd love to see that over and over again, right? But like chemistry these people had all this stuff. Ben Affleck, I don't say this about acting or anything. I don't myself like a film buff like you would. Yeah, you are. You did just make your debut though on Lazer Team 2 in theaters. Snap. Boom. Ben Affleck, like to me, is seems like he doesn't want to be in this film. Like he's just not enjoying any of this. And it's like, ah, fuck, dude. Yeah, I mean, like everything you're delivering is like super like, oh, man.",
            "start": 625.49
        },
        {
            "text": "to me is seems like he doesn't want to be in this film. Like he's just not enjoying any of this. And it's like, ah, fuck, dude. Yeah, I mean, like everything you're delivering is like super like, oh, man. Slash Bruce's motivations in this or like in like the logic leaps of uh no. On the flip of that, it seems like Ezra Miller, how'd it go, dude? Ezra Miller seemed like you had a great time. And again, like that's what sucks is that I feel like the jokes didn't hit, but they cut. I can see where they would. Yeah. Yeah, I liked his character a lot. And especially where I'm talking about at the end, like being joined. Let's go into spoiler territory here, you guys. That that's our that's our spoiler-free impression. Let's get actually sure. Before before again, spoiler-free. The last thing I want to say is in comparison to Batman v Superman, I feel like Batman v Superman had more moments that made me go, yes, than this did. And I feel like Justice League should have had more, you know, like Avengers has that moment.",
            "start": 667.06
        },
        {
            "text": "to Batman v Superman. I feel like Batman v Superman had more moments that made me go, yes, than this did. And I feel like Justice League should have had more, you know, like Avengers has that moment where you're like, yes, it has multiple moments where you do. Sure. And that's compared this to Marvel. Like but to compare this to DC, I do feel like there was things that happened in Batman v Superman, but I was like, I can't believe we're seeing this on the the big screen, right? And this there wasn't a single moment that I was like, that was fucking rad. That was super like that's something only the Justice League can do. There's no scene of like Hulk and Thor riding the back of a flying thing and then like Hulk punching Thor. You know, nothing like that in this movie that's like, oh, Jesus, that's cool to see. Like, holy fuck, that's cool to see. Really aside from seeing them all together, literally all together in one shots. Like, oh, that's cool. No, percent correct. And I think it's I mean, we knew this coming into this",
            "start": 707.68
        },
        {
            "text": "shit that's cool to see. Really aside from seeing them all together, literally all together in one shots. Like, oh, that's cool. No, percent correct. And I think it's I mean, we knew this coming into this movie. But I mean, coming off of the back of Thor: Ragnarok, yeah, we're like, I'm watching the fight scenes early in this movie with Batman. It was like, yeah, I don't think these look great. And I fuck at no point in Thor was like, this doesn't look great. Going into spoilers, get out. There were a lot of there's a lot of movie that I actually liked. There were there were moments of it. Now I like about an hour and I was like, okay, I understand what this is gonna be, right? This is gonna be a buffet where I like some of the stuff and some of the stuff I don't like. And I'm just gonna take the ones I want, but might remember those and hope the rest of it doesn't give you the squirts. So like seeing Batman, Gotham City, first time that first shot, the first time we see it, but the guy looks over. Yeah, he's just",
            "start": 745.6
        },
        {
            "text": "fucking like perched perched there like a waiting for the guy. And then he right like seeing him in action, hearing the '89 theme. I'm like, yes, this is fucking awesome. How about we do a whole movie of this? Wouldn't that be great? So there were moments that I really really really liked. And then there's just things that just didn't come together. And and I think you can start you can see. I think you can see where they started to shoot and steer the ship a little bit more toward the right direction with a lot of the dies of the first scene with the Superman making the video on the Hey, Murray, can a podcast? What the hell was that? And where are children? And the CGI face. I think that really that really cool experience for me that really killed it for me was the reshoots. Man, they really have really",
            "start": 784.9
        },
        {
            "text": "can a podcast? What the hell was that? And where are children? And the CGI face. I think that really that really cool experience for me that really killed it for me was the reshoots. Man, they really have really fucked seen with Superman. And I was like, oh my god, that upper lip is killing me. Like and I could put it together first. I was like, why does he look so fucking wet? And then I remembered he had a stupid mustache they had to paint out. Eye dude, as soon as they show him in that opening scene of that movie, you're like, what the fuck? And I was like, cool, it's just one scene. Yeah, which by the way, they probably got a shot like last week and thrown in the movie. There's gotta be some way to work that around. Decision that was to start to move. I liked the idea of it, right? Like I but it is the total thing of like, you look terrible. Why are these kids eight years old? Why is it being shot with a very steady camera? Felt like what? That's a montage scene. You get that. You see a bunch of different thing right from",
            "start": 829.25
        },
        {
            "text": "of like, you look terrible. Why are these kids eight years old? Why is it being shot with a very steady camera? Felt like what? That's a montage scene. You get that. You see a bunch of different thing right from different perspectives to like understand like the world misses him. The world no, that was just like, here's a couple fucking kids. Yeah, it was totally it was that thing. It was that thing of like, yeah, they put it in there, right? To establish the fact that now Superman smiles and he talks to people when he saves them. He's not just the brooding fuck you saw in these other movie. Just to jump to the end, another fucking city in the middle of nowhere just to make course no collateral damage. Damn, they're what collateral damage. But the Flash pushed the one family out of the way. No, no, it was except for the other civilians we never saw in the building. That was awesome. That was that was a really funny scene. Goddamn thing where's like, oh, there's this family in this house. Like, oh, we got to save this. There's",
            "start": 869.42
        },
        {
            "text": "civilians we never saw in the building. That was awesome. That was that was a really funny scene. Goddamn thing where's like, oh, there's this family in this house. Like, oh, we got to save this. There's one new group. Okay, okay, get out of house. We can finally get out. And then there's 50 other fuck people running. I thought was like the whole thing was like this one family crap. Don't say, oh no, there's a whole crowd of people also. Yeah, that made no sense to me. I wasn't yeah, I also was not a huge fan of the villain in general. I don't really fuck stupid thing. But again, it's because, hey, we're gonna do in Justice League 1 and Justice League Part 2. So Justice League 1 will be Darkseid's minions, Steppenwolf. No Darkseid. No, she Darkseid. Show them the crest. No, no, show up in credits. Get out. Totally away from Darkseid. Nobody wants Darkseid. Go, go, go. And this is my big fear with Infinity War, which is that like, I don't like a villain that is fully CG.",
            "start": 909.2
        },
        {
            "text": "I'm not sure. I just can't I get into it. The second he came out on screen, I was like, okay. The second that the Parademon was shown in the first five-minute Batman, that awesome scene you were talking about. I like this. No, it was demon came up like hugs what? Oh, he's been hunting them for a while. Yeah, they're for your fear. But when he comes back, he's like, and then he's like to Alfred, he's like, yeah, we found one. Yeah, you found one is the first one you've ever fought. But you knew what they were after. You're expecting to bring it back and have it be like thirty of them here. Yeah, what the fuck is that one? Get that one actor that like the duty guy was so he might be dead on that rooftop for me. It's possible that he just passed out there dehydration being he was looking. He's like, oh, you know, like are they",
            "start": 947.49
        },
        {
            "text": "here because of Superman? It was like, we can't be tied up like this. Yeah, no, not tied up like this. Okay, one positive. In other words, spoiler territory. One positive that I get out of this. I told him already. J.K. Simmons as Gordon. Yeah, he was in three scenes. Yeah. And because of that, I have faith now that he's gonna be back as J. Jonah Jameson in the MCU. That's all I care about. No, guys, we talked about this earlier. It's like, I want I want J. Jonah Jameson. I want J.K. Simmons, J. Jonah Jameson in the MCU. I was afraid that Gordon was gonna have a much bigger role, such a small role. Oh yeah, absolutely. I thought it was like one of those things. I mean, I'm a sucker for J.K. Simmons. So know we're on. But like when he was downstairs in without the cap on, I was like, man, you look a lot like Jim Gordon. Like a vision.",
            "start": 991.71
        },
        {
            "text": "it was like one of those things I mean I'm a sucker for J.K. Simmons so know we're on but like when he was downstairs in without the cap on I was like man you look a lot like Jim Gordon like a vision of Jim Gordon and winning the cap all we've seen of him before I was like looks like J.K. Simmons with the mustache but like when it was out of like oh man okay your commission he's like you saw him super ripped and he's wearing these these giant jackets and stuff overcoat over a jacket man that's the first ten minutes of that movie and anything that happened in Gotham City makes me really really excited for the matter the next movie the Matt Reeves is directing I whether or not Ben Affleck's in it which it sounds like he's not right yeah is that gonna be think it doesn't matter I feel like he's putting a team together that may actually make the first relatively great movie since Wonder Woman I mean you take that team you put that 89 theme **** man here you see War for the Planet of the Apes",
            "start": 1046.53
        },
        {
            "text": "a team together that may actually make the first relatively great movie since Wonder Woman I mean you take that team you put that 89 theme **** man here you see War for the Planet of the Apes no I saw they're good yeah so I wonder think if I'm just shrinking in this chair by the way whatever go delicate Cicely doesn't matter so I'm excited about that and I'm really I do want to see that and that's every single time there was something cool every time I saw Batman come **** toward me with the cape out or jump off a building or do me any that stuff yeah thanks Joey **** 300 don't blame Joey for that she was drunk I when she was she might've been drunk tonight two out of our we don't know we don't talk about it anymore cuz I'm not allowed to HR told me stuff every time I saw that I was like this is good that this Batman movie could be **** awesome and it could be something that we've never seen before which is a true honest to god like superhero Batman movie right so that's good",
            "start": 1085.05
        },
        {
            "text": "like this is good that this Batman movie could be **** awesome and it could be something that we've never seen before which is a true honest to god like superhero Batman movie right so that's good that is the upside of this the downside is unfortunately every part of this movie that had Superman it was ruined and it was sad because there was the best part of the movie to me was when Steppenwolf goes finally the truth and you just hear off-screen I believe the truth is no big fan of Justice come on holy **** likes was it to be like oh the worst line in Batman v Superman was uh do you bleed yeah yeah but you don't understand the context of more right I don't I really for a second there I I'm in my own head I made the joke though of like when he had a Martha but the owner see when she was like you know he's gonna be mad at you and I'm like why would he be mad at you you like teamed up at the end were bros thinking bro doubts okay I honestly forget how did how did Batman v Superman",
            "start": 1127.95
        },
        {
            "text": "was like you know he's gonna be mad at you and I'm like why would he be mad at you you like teamed up at the end were bros thinking bro doubts okay I honestly forget how did how did Batman v Superman ended watch through the heart no II to make no gasping and then Superman stab Superman flew in with the Kryptonite spear drove in the Doomsday's chest one room had already cut off Doomsday's hand but he made another spike and jammed into Superman's chest so it's similar to the double punch-out from Superman 75 okay except it was one stat it was two stabs okay now a lot of people why why in Christ's name would he take that instead of Wonder Woman right who was completely unaffected by that yeah we don't ask that question me to stop asking that question no I never I'm very much they bring that up is one of my points with the stupid schmuck now here's my but here's my thing that again falls into the bucket of both Batman v Superman and Justice League it's a comic book movie and again that's",
            "start": 1184.88
        },
        {
            "text": "up is one of my points with the stupid schmuck now here's my but here's my thing that again falls into the bucket of both Batman v Superman and Justice League it's a comic book movie and again that's not the Marvel standard I'm giving you but like it is totally there's so many things in this of just like yeah then again this is Greg Miller who's read so many shitty DC Comics and great DC Comics whereas just like oh no no no don't take away from this that I'm like **** nailed at everybody blah blah I'm like no I I would **** I'm it sucks you think it's been a fun year and a half having defend that I enjoy Batman v Superman to every **** on the internet no like no it hasn't been I wish we deserve better they deserve better but I mean I stand by the statement I'm just saying it's always really fun to have that be something people want to talk to me about this is not Lair, Uncharted 3 anymore you know that's fair that's fair you moved on I made another bad decision yeah I mean",
            "start": 1224.09
        },
        {
            "text": "always really fun to have that be something people want to talk to me about this is not Lair, Uncharted 3 anymore you know that's fair that's fair you moved on I made another bad decision yeah I mean that's my thing is there were moments in this where I'm like I'm I am enjoying this moment and there were moments where it was like like it did the one thing that I needed it to which was it was enjoyable enough for me not to be like huh what time is it what time is it right that's not accurate at all that is a lie Nick there was a moment where you go hey it's Twix time and left I did not leave I have a Twix in my pocket plant first off how dare you sir together okay we bought bite-sized Twix and he said you bring him out what are you ready big cat ready for these **** Twix that need something sugar yeah but again the report there I'll I enjoyed this movie overall like they're the the last third of it I'm like alright we're gonna find a bunch of T is gonna be C do you think guys",
            "start": 1268.88
        },
        {
            "text": "something sugar yeah but again the report there I'll I enjoyed this movie overall like they're the the last third of it I'm like alright we're gonna find a bunch of T is gonna be C do you think guys look so whatever the last third this movie was the whole movie was it the first hour it was fine much CG random **** fights I love the team all 3D **** it up too cuz 3D makes everything is place people are standing in front of a green screen and that drives me **** crazy I don't like 3D already because I wear glasses but then on top of that it's like it literally makes everyone play in front of a green screen I can't stand it so are you right Kevin he's broke it's been awesome it is awful 3D so bad it's the worst gone it's not her fault I've done this I bought I booked you Thor: Ragnarok 3D seats cuz that's all it's available actually I'm not gonna lie this scenery goes the tunnel for me I mean like like I'm saying like again the rest of the movie was fine you don't I mean I'm like",
            "start": 1308.61
        },
        {
            "text": "3D seats cuz that's all it's available actually I'm not gonna lie this scenery goes the tunnel for me I mean like like I'm saying like again the rest of the movie was fine you don't I mean I'm like it was I'm watching and I was like yeah this isn't great I'm but I'm enjoying it enough it's cool seeing it whatever I don't like how Batman's being played Aquaman from the trailers never clicked with me is not clicking here Flash I like but they're still start and stop problems but yeah once Superman arrived it was for me like oh **** thank God and it was like this is awesome I thought it was like you want to talk about like what's wrong with this movie like just the jump from like oh we can dig up his body and do this I'm like that this is a weird **** turn right now nobody's it seems that we're like super **** darker like they're all sitting there first off Steppenwolf by just killing the random yeah that was really violent I mean the scene of with Wonder Woman when the first",
            "start": 1350.1
        },
        {
            "text": "that we're like super **** darker like they're all sitting there first off Steppenwolf by just killing the random yeah that was really violent I mean the scene of with Wonder Woman when the first seemed she's in there's a bunch of people lined up any of them yeah I like this **** cool yeah wow this is really dark and it's not that I have a problem with that I'm totally up for that but commit to that or commit to the that like the Flash vs. Superman scene at the end that's what I thought you were talking about earlier yeah well it's like that is awesome commit to that vision and yeah go all the way well that's what I'm talking I'm sorry the Danny Elfman's core stuff I feel enhanced the movie so much what's one scene which was the Wonder Woman and of course the Batman himself it's **** rad as hell but Danny Elfman's take on the Wonder Woman theme song when she's doing all that like blocking up gunshots up I'm like this feels like a good comic book movie yeah this there's her scepter",
            "start": 1395.13
        },
        {
            "text": "as hell but Danny Elfman's take on the Wonder Woman theme song when she's doing all that like blocking up gunshots up I'm like this feels like a good comic book movie yeah this there's her scepter here there's like levity to it but there's also she's protecting people like there's something at stake here but then they punctuate it with with the I'm a believer oh god it was like these lines are awarded them the writings up was so insulting yeah so often so freaking awkward yeah there was there was stuff like that would be like oh that was a cool thing oh why did you say that oh god damn it and uh yeah I mean anyway that was Lois and Clark together yeah so I couldn't like I would not tell you one thing they said because I couldn't stop focusing on the fact this **** upper lip was having a conniption fit the entire time and it was going ape **** it wasn't working so what scenes weren't reshoots I don't know I see that's the thing as Andy Cortez the problem is we were all maybe some",
            "start": 1434.52
        },
        {
            "text": "ready for it especially after the first one when the first one I mean literally opening shot movie like he looks like he's got mumps so then every time he was on stage I would look at it at stage on screen I'd look at his face to try to figure out and I which it was distracting but then I don't think every we're talking like every scene he's in it was more than I think it wasn't really yeah I really do like I'm I am cuz Andy was next to me - and Andy kept going like this weird thing was tuned that first scene when the camera started on his face I was like that dude looks just like James Williams like it drove me nuts nobody's got big like cheekbones he does have eyes so bastard going back to like them digging Batman and Superman literally digging up Superman I thought one of two things is",
            "start": 1481.23
        },
        {
            "text": "like it drove me nuts nobody's got big like cheekbones he does have eyes so bastard going back to like them digging Batman and Superman literally digging up Superman I thought one of two things is gonna happen I think they're gonna get out get into the the you know the Krypton thing over and he wasn't gonna be in there yeah I was that was that would be cool and then it was like or he was gonna go bad and was gonna take oh the villain of this movies goddamn see right man **** but when they first did it in the boom well what looked to be a Boom Tube open well I said no it didn't the light blew up his eye went up anyway was it because the nobody came in at that point yeah you know I mean like he shot up anyways I thought that was Darkseid ripping him up and bringing them back to Apokolips and then we're gonna have him come back as you know agent of Darkseid kind of think yeah and then when it didn't know like oh okay but it was it was such a weird this is the Carboni argument of like",
            "start": 1524.4
        },
        {
            "text": "I like where we got I don't like how we got there but it was like I'm glad there was a scene of Flash and Cyborg being like this is **** up huh yeah we're taking up a **** body right now what do you like I'm a little unclear about what you like about where we're at now the fact that that ends with the most accurate comic-book interpretation it for me least of the DC Comics Universe Wonder Woman taking photos with these kids the suits blew him and Flash are having fun and gonna be fun people them's going out there and celebrating as a team being there as they've just gotten through Superman having the line of yet I believe in truth I'm also a big fan of Justice Wow smiling sit the Flash pushing the truck and then him bringing the house all that stuff of it finally being like for",
            "start": 1564.49
        },
        {
            "text": "having the line of yet I believe in truth I'm also a big fan of Justice Wow smiling sit the Flash pushing the truck and then him bringing the house all that stuff of it finally being like for it is that this that Superman showing up and saying I believe the truth and then turning around is that's Rebirth from there on the universe is different at least from what we've seen I'm sure they'll **** this up some even worse than they already have but for me that's the turning point of like oh **** why didn't Man of Steel start here why didn't we start with this guy this hopeful smiling guy not the guy you **** had to digitally worm in his face to make sure make your room remind you Superman's about hope reminds you he's not just about is he gonna **** leave everybody at the Capitol is he gonna go on some soldier to the top of **** Mount Everest yeah well there this yeah well guys real quick I want to say Billy Crudup was in it as well yeah he wasn't credited at all in",
            "start": 1605.89
        },
        {
            "text": "Capitol is he gonna go on some soldier to the top of **** Mount Everest yeah well there this yeah well guys real quick I want to say Billy Crudup was in it as well yeah he wasn't credited at all in there yeah I'll look it up was like because it wasn't in the credits and was like he's literally uncredited that seems like a big role see kid right no Billy Crudup is what was a Dr. Manhattan good I know Alan right yeah yeah all right there it is there yeah but I wonder if that means he's coming back for Flashpoint or something or like he's gonna I mean if we get to Flash well yeah I mean every single line that you said to Flash had some type of fast reference in it yeah I get it I'm big fan of stupid dumb puns and **** but like that didn't fit those seeds oh yeah the P.S. I mean the P.S. after the credits like it was like like Luthor's like okay yeah shocking Luthor got out none you know but then Deathstroke shows up and it's like how the **** do you you didn't took down a god when",
            "start": 1645.43
        },
        {
            "text": "after the credits like it was like like Luthor's like okay yeah shocking Luthor got out none you know but then Deathstroke shows up and it's like how the **** do you you didn't took down a god when it's like here I go I got soldiers ooh where's is that I looked at that I looked at him I was like okay a couple things off but this one he's just on a boat in his costume okay - did they borrow that costume from the CW set from the set of Arrow gia thing didn't they were just like hey we can we borrow that real quick like let's better it looked a little better but it was so out of **** play my god I'm like what point the deal were they like let's just put the scene together real quick like you know again I mean it's the Rebirth a moment like yeah they just took down a god that's every comic book story yeah Superman's come back from the dead why would you rob a bank in Metropolis what are you **** fitting on a meme like so what it is very weird I don't know yeah I don't know I know",
            "start": 1697.57
        },
        {
            "text": "book story yeah Superman's come back from the dead why would you rob a bank in Metropolis what are you **** fitting on a meme like so what it is very weird I don't know yeah I don't know I know it'll be interesting if we get any of the Legion of Doom going are they gonna get this Deathstroke movie off the ground Ben Affleck's out are they gonna do the Matt Reeves thing Yeah right Andy hold your breath on that one here go ahead and we'll see if we get you back we will do good still I think gonna keep making the same thing cuz it's kind of working yeah the best part this movie was this there was a family sitting in the same row as I like in the far side and I was like he was choose a little girl a little boy add added Kevin and it's all just super excited about everything Kevin what did you think sorry I wasn't prepared I'm, bro I really enjoyed the movie and it you know man wrong color right whatever I really enjoyed the movie and I thought Kevin's opinion it's all **** up",
            "start": 1741.7
        },
        {
            "text": "think sorry I wasn't prepared I'm, bro I really enjoyed the movie and it you know man wrong color right whatever I really enjoyed the movie and I thought Kevin's opinion it's all **** up cuz earlier doesn't matter I enjoyed the movie and I really liked everything like after Superman came in it was like holy **** this is the Superman I've always wanted to so you always want it yep it was when he **** turns on the street and takes the glasses off and does the thing and also maybe at the end when he's like oh hey he's wearing blue I didn't know that yeah that's great yeah that's really **** great nod yeah like they're **** like when they're back on the farm and like him and Bruce have a little exchange like how did you get it back to the bank I bought it **** Lois Lane reading the goddamned the the darkness comes from whatever never have a **** voice anyway that's like the cheapest movie trick ever it's like oh we need to get exposition let's start saying metaphors",
            "start": 1786.7
        },
        {
            "text": "the goddamned the the darkness comes from whatever never have a **** voice anyway that's like the cheapest movie trick ever it's like oh we need to get exposition let's start saying metaphors literally read them out and all in all but all it is is about hope right yeah these people and they were there all along and everybody smiling now and everybody's colorful and it's finally the **** DC Universe it should have been forever **** Clark Kent's back like he died that was I was waiting to see how they wanted to handle that and I do think even it'll be interesting if they make another one how they handle it because like it's gonna be like Beerfest it was his twin brother yeah yeah not even that like I mean I think and I mean don't get me wrong you we all saw the same movie in the way the DC Extended Universe writes itself of like I remember watching Man of Steel and being like oh **** he's never gonna have a secret identity you know any mean like he's like yeah everyone in",
            "start": 1839.98
        },
        {
            "text": "Smallville knows he has powers you know he saved Pete and the kids and everybody knows this and then he's brawling through the streets there and people know and at one point if you remember Lois shows up in a cop car driven by and like Superman's hugging like yeah people would put it together pretty quick right and so yeah I was like when it came back this time and they were moving Martha back into the house and he didn't have glasses on I was like oh we're back there now he's just gonna do the whole thing of like no and then but then Lois went to work I'm like wait and then he's on the streets in the glasses I kind of like all right yeah I mean but again it gave me I don't care how we got there we're there now but that's the biggest problem with all this Greg and I don't want to break",
            "start": 1883.1
        },
        {
            "text": "in the glasses I kind of like all right yeah I mean but again it gave me I don't care how we got there we're there now but that's the biggest problem with all this Greg and I don't want to break your heart we were there for the end of this movie we're not gonna be there for the next one oh no no yeah again I don't have hold out much hope that we see this universe continue in any meaningful way to him but is the thing of like when it even once he once he came back and this is a very Donald Trump thing but like this is the movie where Henry Cavill finally became Superman and like I'm talking about even when he came just back from the dead and like we had a cool interaction of him fighting people and like actually having like physicality to cool I was like I really want to do my movie now like when he did one thing and when he **** bomb somebody is like this is the day he became president like there was all this truth this is the movie the wall they built around one of the best moments",
            "start": 1918.02
        },
        {
            "text": "when he did one thing and when he **** bomb somebody is like this is the day he became president like there was all this truth this is the movie the wall they built around one of the best moments and I think the Flash had two of the best moments right yeah the moat where he pushes the sword back there yeah I'm gonna get him I'm gonna get him and it's super just Flash to me at some that like pretty much the best sees the movie like I think I'm going Easter I hope this is yeah yeah yeah and then at the end of the movie that kind of reference it again is like alright specific and he's like yeah I enjoyed it I do by no means is it an amazing movie but I enjoyed it I think I would I think I would watch this again over Batman v Superman just cuz of the sheer mass spectacles yeah if you like the stuff at the end like Batman v Superman is you know two and a half hours this was two hours but it's like it seems like the set pieces were like oh that was a cool thing you know where's like",
            "start": 1955.54
        },
        {
            "text": "the stuff at the end like Batman v Superman is you know two and a half hours this was two hours but it's like it seems like the set pieces were like oh that was a cool thing you know where's like Batman v Superman it's like you have the car chase scene where Batman its motors everyone you know and then Superman shows up let's all the bad guys get away and fight something like talks to Batman it's like I don't know so I don't I I enjoyed this more than Batman v Superman but that's within the DC Universe that's not saying yeah so but I would go see Thor: Ragnarok or Spider-Man: Homecoming come on there you go guys there is your review of the Justice League I think we're all universally decided that either go watch Thor or the 1989 Batman is what I'm as well instead of this movie know it was a was enjoyable but it was enjoyable you go that's how much we got for it let us know what she think she watch this I got nothing guys sorry disposed nautical I could bite let us",
            "start": 2018.78
        },
        {
            "text": "this movie know it was a was enjoyable but it was enjoyable you go that's how much we got for it let us know what she think she watch this I got nothing guys sorry disposed nautical I could bite let us know what you think the comments below of course like this video share with a friend subscribe it and be nice to us because until then we're gonna check in on Andy bye can we check in Andy Batman **** grapple and Flash's foot while he's like bending space-time not your mouth also why did he do that yeah like cuz you know Flash is like stumbling right he's like falling down that little thing whatever but then he grapples his foot how did he **** I mean they note if they got a superhuman powers in Justice League thanks for having me",
            "start": 2056.58
        }
    ]
}