{
    "id": 2909,
    "video_id": "fmHSI-mw7Vo",
    "show_name": "Animated",
    "hosts": [
        "Greg Miller",
        "Nick Scarpino",
        "Andy Cortez",
        "Zacq Wenzel"
    ],
    "title": "Greg Miller's Worst Story Ever - Kinda Funny Doodles",
    "description": "Subscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1502819098,
    "duration": 81,
    "transcript_chunks": [
        {
            "text": "it I'll set the stage for you all right set it up but it is a Wednesday it is a win all right in the suburbs of Chicago okay big ol Greg mother picked up a little old Greg Miller from I assume high school sure good we go to the comic book shop I get my pole list out dad pays for what he does I'm going through what I got out on my pull list in the store I get to an issue of Superman or Action Comics doesn't matter for this protest ory but on the cover is Superman fighting metallo we go home I'm looking through all the comics I got Superman versus metallic red alright great put the books down but eventually I come back to read all these books that issue is gone now you might just say maybe some apartment nobody borrows and I'm an only child no one borrowed this it's cosmic vanish sandy they're just gone there's no way where could it have gone anything I will literally one day meet whoever God is or whatever [ __ ] higher-power there is and this will be the number one question of where",
            "start": 0.0
        },
        {
            "text": "just gone there's no way where could it have gone anything I will literally one day meet whoever God is or whatever [ __ ] higher-power there is and this will be the number one question of where did this Superman metallo but the whole JFK thing oh yeah don't ever say everything about that the heart of this we got a lot I'm just saying it unfortunately is there's a pile in here there's an episode of stranger things on the Forensic Files",
            "start": 49.89
        }
    ]
}