{
    "id": 13799,
    "video_id": "FPHe9gVnH2g",
    "show_name": "Highlights",
    "hosts": [
        "Blessing Adeoye Jr.",
        "Roger Pokorny"
    ],
    "title": "PlayStation Needs Smaller Games",
    "description": "From KFGD: https://www.youtube.com/watch?v=F_dBzBYiMGQ&list=PLy3mMHt2i7RIl9pkdvrA98kN-RD4yoRhv&index=1 \n\nGo to http://get.stash.com/KINDAFUNNY to see how you can receive $25 towards your first stock purchase and to view important disclosures.\n\nFOLLOW US ON EVERYWHERE!\n---------------------------------------------------  \nYouTube: Youtube.com/KindaFunnyGames\nTwitch: https://www.twitch.tv/kindafunnygames\nPatreon: https://www.patreon.com/kindafunny/\nTwitter: https://twitter.com/KindaFunnyVids\nInstagram: https://www.instagram.com/kindafunnyvids/\nTikTok:  https://www.tiktok.com/@kindafunnygames?lang=en",
    "published_at": 1743033265,
    "duration": 765,
    "transcript_chunks": [
        {
            "text": "Story number two, Intergalactic the Heretic Profit reportedly won't make 2026 is from Wesley Ian Pull over at IGN. With the wait for The Witcher 4 set to head into 2027, it's a similar story for Naughty Dogs recently announced Intergalactic. The heretic heretic prophet I always mix whatever heretic prophet hereditary. Yeah, hereditary. I was I always want to say heretic project. Yeah, I don't know what I'm doing. I don't know. I always say intergalactic cuz the kid cuddy. It's messed me up every single time. Yeah. Yeah. I don't like it. Uh intergalactic the heretic prophet. Uh Bloom Bloomberg reporter Jason Shrier took to reset era to say neither the Witcher 4 nor intergalactic will be out next year. That means like The Witcher 4 Intergalactic will be released in 2027 at the earliest. And like the Witcher and like The Witcher 4 Intergalactic will face questions about around whether or not it's targeting the PlayStation 5 or the inevitable PlayStation 6 or perhaps most likely is a",
            "start": 0.08
        },
        {
            "text": "And like the Witcher and like The Witcher 4 Intergalactic will face questions about around whether or not it's targeting the PlayStation 5 or the inevitable PlayStation 6 or perhaps most likely is a crossgen game. If Intergalactic heads straight to PS6, Naughty Dog faces the pro prospect of having skipped the PS5 generation in terms of brand new games. That is a crazy thought to think about. Uh that's me saying that, not not the reporter. Uh, so far the studio has released ports, rebasters, and remakes on Sony's current gen console, including The Last of Us Part Two, Uncharted Legacy of Thieves Collection, The Last of Us Part One, and The Last of Us Part Two Remastered. Assuming Intergalactic releases in 2027, and taking into account Duckman's comments about it being in development for 4 years so far, by the time the game comes out, it will have been in the works for 6 years. Yeah, that makes sense. It's like, no, none of the none of this surprised me. Does it surprise you at all? Um,",
            "start": 48.88
        },
        {
            "text": "so far, by the time the game comes out, it will have been in the works for 6 years. Yeah, that makes sense. It's like, no, none of the none of this surprised me. Does it surprise you at all? Um, no. I think I was a little bit hoping for 2026, but I think when they first announced it, immediately I'm like, \"Oh, we're going to it's going to be quite a few years before we see that thing.\" I think that's just the base assumption you had to make when you whenever we're being whenever a game of this nature is being revealed. Like, I would think the same thing if it was like a Sony Santa Monica game or any of like those top tier like, \"Oh man, I've been waiting a while for this studio to to reveal their game.\" Yeah. I always always bump up a few years from the announcement of when we're actually going to get that. So 2027 doesn't sound crazy to me. I do think that the crazy part of it is the fact that yeah, are you then talking about crossgen? Are we talking about an entire generation maybe",
            "start": 98.16
        },
        {
            "text": "going to get that. So 2027 doesn't sound crazy to me. I do think that the crazy part of it is the fact that yeah, are you then talking about crossgen? Are we talking about an entire generation maybe not getting a Naughty Dog game, right? Like I think that's where it gets into Oh man. I think no matter what though, if I think once this game comes out, I would imagine that it's coming out on PS5 either way. Oh yeah. Unless we get into like heavy delay territory. Yeah. Yeah, unless we get to like Last Guardian territory, but even then, I mean, we forget that Ragnarok came out on PS5, PS4, like we're going to we're going to get it on both. I I think this is going to be a last of a Last of Us 2 situation, right? Where it just comes out on the I guess last generation hardware by that time, right? PS5 and then eventually comes to PS6 in a remastered form or an update or something like that, right? Um yeah, this isn't going to surprise me. Again, I I I'm with you. I wanted I wanted the reveal",
            "start": 138.56
        },
        {
            "text": "PS5 and then eventually comes to PS6 in a remastered form or an update or something like that, right? Um yeah, this isn't going to surprise me. Again, I I I'm with you. I wanted I wanted the reveal of like oh [ __ ] like maybe they were cooking so hard that this is ready to go like ASAP. But uh this is this is not surprising and just I'm excited to see whatever they do do next. I'm not I'm not like freaking out or like oh my gosh they haven't released the game in so long because it has been so many remasters and you know re-releases of the same games and I just replayed Uncharted 4 and that game is [ __ ] incredible. So, like I'm I'm I'm fine with Naughty Dog taking as much time as possible. But yeah, it just speaks to how long these uh these cycles of development are going and and we are going to get to the point where maybe the next, you know, Naughty Dog game doesn't make an entire generation of consoles. Like we're going to get to that point where one of these studios just misses",
            "start": 178.64
        },
        {
            "text": "going to get to the point where maybe the next, you know, Naughty Dog game doesn't make an entire generation of consoles. Like we're going to get to that point where one of these studios just misses an entire generation because that's how long these games are taking. Unless we unless there is that shift of, hey, we are scaling down a bit like and I in the video game industry. Yeah, that's the tough thing is, you know, we were having I think it was me and Tim that were having this conversation as far as um the God of War Greek game that's rumored for later this year and like do you think it could be another third person action adventure or do you think it's going to be something way smaller like you know a 2D thing or like a you know I I start off saying a Facebook um uh like um website game um or Facebook browser game mainly because they've done that before like for God 2018 there was like a prequel Facebook browser game that led into it. And so like when I read a side story God of",
            "start": 219.52
        },
        {
            "text": "game um or Facebook browser game mainly because they've done that before like for God 2018 there was like a prequel Facebook browser game that led into it. And so like when I read a side story God of War thing, I'm like, \"All right, what's No one said game.\" No one said game. And then finally Jeff Grub did confirm he's like, \"Oh, it's a game.\" Um, but I was like, \"All right, what's the what's the lowest tier that I could pitch where I'm like, I believe this.\" That way, like when they do reveal it, I can be like, \"Oh, that's wild that they're going to do this thing, right?\" Yeah. This podcast is brought to you in part by Stash. Are you still putting off saving and investing because you'll get to it someday? Stash turns someday into today. Stash isn't just an investing app. It's a registered investment advisor that combines automated investing with dependable financial strategies to help you reach your goals faster. They'll provide you with personalized advice on what to invest in based",
            "start": 254.16
        },
        {
            "text": "investment advisor that combines automated investing with dependable financial strategies to help you reach your goals faster. They'll provide you with personalized advice on what to invest in based on your goals. Or if you want to just sit back and watch your money go to work, you can opt into their awardwinning expert managed portfolio that picks stocks for you. Stash has helped millions of Americans reach their financial goals and starts at just $3 per month. Don't let your savings sit around. Make it work harder for you. Go to get.stach.com/kindafoney to see how you can receive $25 towards your first stock purchase and to view important disclosures. That's get.stach.com/kindafoney. Paid non-client endorsement, not representative of all clients and not a guarantee. Investment advisory services offered by Stash Investments LLC, an SEC registered investment of adviser. Investing involves risk and investments may lose value. Offer subject to TNC's. Um, but even in the conversation me",
            "start": 297.6
        },
        {
            "text": "services offered by Stash Investments LLC, an SEC registered investment of adviser. Investing involves risk and investments may lose value. Offer subject to TNC's. Um, but even in the conversation me and Tim were having about that, it was a thing of I think Tim also being of the mind of, hey, I think you at PlayStation and these big studios might have to scale down at some point or might have to figure out how to put things out at a more uh uh decent pace and like figure out how to refine that, right? And I kind of go back and forth on it because I think there are some studios that, you know, can be the prestige. We're going to put out one game a generation and it's going to be the game that is the critical darling, the game that is the flagship. This is the game of our generation kind of thing versus an insomniac or a team of Soie. Not to say that in Spider-Man isn't going to be one of the games in generation, right? But like Spider-Man, you're at least at the very least you're able",
            "start": 344.8
        },
        {
            "text": "thing versus an insomniac or a team of Soie. Not to say that in Spider-Man isn't going to be one of the games in generation, right? But like Spider-Man, you're at least at the very least you're able to put out multiple of them in one console generation along with a ratchet, along with probably a Wolverine, right? Like Insomniac has a level of um refinement that they have within their studio of we know how to put out games. We know how to make things quick and they don't need to be 11 out of 10 games. You know what I mean? They don't need to be these 10 10 out of 10. But I mean they're extremely impressive. Yeah, they're extremely impressive. I it I think it speaks to going back to my conversation on uh Friday with Sam Lake and Mikuel over at Remedy talking about how they went from going to from one uh project at a time to multiple projects now, right? And like that's a tough thing to do. And I I know that Naughty Dog, they were working on one project for a while and then they started",
            "start": 387.28
        },
        {
            "text": "from one uh project at a time to multiple projects now, right? And like that's a tough thing to do. And I I know that Naughty Dog, they were working on one project for a while and then they started doing multiple potentially. Like you you got to scale those things up, right? You got to scale those things up in order to get to a point where you are insomniac and you're making all these you have all these different teams working on all this different stuff. Uh so yeah, that I think that's the dream. I don't think anything's going to get smaller. And I I look to if I wanted the the perfect world for a smaller type experience where you can continuously have that AAA but then also have those smaller experiences is what Ninja Giden's doing right now which is kind of perfect right they have the Ninja Giden 2 uh Black remake that came out this year they have Ragebound which is a different studio that is making like a 2D smaller thing and then they have Ninja Gaiden 4 right like that that to",
            "start": 426.56
        },
        {
            "text": "Ninja Giden 2 uh Black remake that came out this year they have Ragebound which is a different studio that is making like a 2D smaller thing and then they have Ninja Gaiden 4 right like that that to me is like the perfect middle ground of all this right you have a remake you have a smaller game that's a side team and then you have the AAA thing I just don't think we're going to get that for PlayStation I don't think PlayStation wants that even they don't I well I don't think they want that for a game like um the games that Naughty Dog do, right? Maybe Uncharted. That's the thing is I think when you're when you give the Ninja Giden example, I think it's fascinating because you have um something that is going to be a third person action game, but then you have like a 2D thing, right? That is a different genre that has a different pipeline, all that stuff. I mean, if you wanted to go that route, right, it would be all right, we're going to make a last 2D survival thing. Yeah. Metroid",
            "start": 462.24
        },
        {
            "text": "is a different genre that has a different pipeline, all that stuff. I mean, if you wanted to go that route, right, it would be all right, we're going to make a last 2D survival thing. Yeah. Metroid Vania type deal. Yeah. And like, but does that fit the IP? It can be. It just it could. Yeah. But they want it to be they want I think the thing with PlayStation that PlayStation wants all of their big IP like that to be synonymous with the AAA of it all, right? Like they don't want the smaller experience. That's why I'm interested in this God of War thing where it's like is that a smaller experience in terms of like scope and scale but it still has the same graphical fidelity and it's just like it is like a Miles Morales type deal or is it like a fully like hey no this is a different type of video game and we're trying something different. I if I were a betting person I would be like this is a Miles Morales type thing which is a smaller experience but it still feels AAA cuz it is AAA. I",
            "start": 495.84
        },
        {
            "text": "video game and we're trying something different. I if I were a betting person I would be like this is a Miles Morales type thing which is a smaller experience but it still feels AAA cuz it is AAA. I and I still think I think God of War is one of those franchises that would fit if you wanted to do a 2D thing. If you wanted to do like a different genre thing, right? I think when I'm looking at Naughty Dog, when I say scale back, right, I'm talking about the fact that Last of Us 2 was a 25 26-hour game. I'm like, what if it was what if your next big game was 13 hours? Like, that's what I'm talking about as far as getting your games out the door a little bit quicker. But then that's the thing is that you kind of dig yourself in that hole a little bit, right? Where it's like people are expecting that longer experiences for $70, right? If as PlayStation you keep developing to people's expectations currently like you're not going to be able to keep up with it. You've done you've I agree with",
            "start": 537.52
        },
        {
            "text": "that longer experiences for $70, right? If as PlayStation you keep developing to people's expectations currently like you're not going to be able to keep up with it. You've done you've I agree with you. You ruined from the years of 2016 to 2020 you ruined people. You ballooned people's expectations to an unreasonable amount. And now like if you're not continuing to do that, yeah, people are going to get upset. But guess what? I think people get over it cuz nobody I don't think anybody's going to be able to to sustain that if your name is not Rockstar. and Rockstar is putting out a game every eight years or something like that. And so, yeah, that's true. Yeah, I know. You got I think you kind of just have to figure out how to scale or I guess scale to scale to what you want it to be. Like Naughty Dog, I don't think Naughty Dog has to be the guys that put out a game every 3 or four years as long as the one game you're putting out every six years is [ __ ] a 10 out of 10, sells 30",
            "start": 572.16
        },
        {
            "text": "Like Naughty Dog, I don't think Naughty Dog has to be the guys that put out a game every 3 or four years as long as the one game you're putting out every six years is [ __ ] a 10 out of 10, sells 30 million. Like as long as you're doing that and then you have the other studios to help prop you up and you have that synergistic all right we got Naughty Dog for the prestige we got Insomniac to help us make money or whatever right like team of Soie to help you know sustain the library and all that stuff. I think you could have a relationship there between studios that works but it does put Naughty Dog in a very lofty place especially if one of those fails potentially. Exactly. If you miss Oh man that's a problem. That's a big one. Yeah. and and then you have to lean on the other studios to prop you up and then studios start shutting down and things start things start falling apart. Like you're totally right. I agree with you. I just don't I just don't know if that's what PlayStation wants",
            "start": 614.12
        },
        {
            "text": "you up and then studios start shutting down and things start things start falling apart. Like you're totally right. I agree with you. I just don't I just don't know if that's what PlayStation wants right now. And I'm interested to see that side project because that side project, if that's real for God of War, I think is going to say a lot about the future of PlayStation. And if it is just another Miles Morales thing, then cool. Yeah, whatever. But if it's something radically different and smaller, we could be cooking. We could be cooking with different and we they might be listening to the critiques that we've had over the years of hey let's just make smaller games at a faster 2027 if we get Witcher 4 and Intergalactic out in the year 2027 what do you think ends up being game of the year between those two Witcher 4 for sure I hope we see that like I hope I hope we see both those games going on the same year because I miss the years where it's like oh [ __ ] I really don't know what's",
            "start": 657.92
        },
        {
            "text": "between those two Witcher 4 for sure I hope we see that like I hope I hope we see both those games going on the same year because I miss the years where it's like oh [ __ ] I really don't know what's the years recently have been kind of pred either predictable or like there haven't And I I'll bring us back to 2013 where it was GTA 5 simpler time versus Last of Us. Much simpler time of like, all right, which who you got? And we all and we argued into the ground. What type of guy are you? Yeah. Are you a GTA sicko or are you a Last of Us? Bring me back to God of War 2018 versus Red Dead 2. You know, that was a good year. Elden Ring versus God of War. God of War Ragnarok. I think in in theory was one of those. Even though for me I was like I was so like oh man's Elder Ring. It's not even a question for me. But you know kind of funny different types of I want to Yeah. I want a year where it's like two not similar games but two games that have like almost complete overlap. You know what I",
            "start": 693.52
        },
        {
            "text": "for me. But you know kind of funny different types of I want to Yeah. I want a year where it's like two not similar games but two games that have like almost complete overlap. You know what I mean? Like Elder Ring and and and God of War don't really have as much overlap. You know what I mean? If you're Elder Ring person, you're ringing person. If you're not, you're just not. So I want one. Yeah. I think Last of Us and GTA is kind of similar cuz people that play Last of Us totally will play GTA. People play GTA probably play Last of Us. Yeah. stuff and I'm",
            "start": 741.28
        }
    ]
}