{
    "id": 13784,
    "video_id": "j-nVUVKUxs8",
    "show_name": "In Review",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Andy Cortez"
    ],
    "title": "Aliens Vs. Predator Requiem In Review - Every Alien and Predator Movie Ranked",
    "description": "Go to http://get.stash.com/KINDAFUNNY to see how you can receive $25 towards your\nfirst stock purchase and to view important disclosures.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1743112950,
    "duration": 5040,
    "transcript_chunks": [
        {
            "text": "[Music] What's up and welcome back to Kind of Funnies Alien and Predator in review. That's right. We are ranking, reviewing, and recapping every Alien, Predator, and Alien verse Predator movie possible. Uh they love changing the names up for this one. I don't know if you guys noticed, uh last week it was AP. Alien vers Predator. This time it's Aliens versus Predator. And then what's with the poster? This is a fan-made poster. Aliens versus Predator 2. That's not what they called this movie. That's not How do you feel about the curting and like just overall spacing of this? Look at that two. Ah, it's so annoying. That's a Destiny 2. Like that's that's a Destiny 2 font. Oh my lord. Uh we've been on a amazing journey here uh with the Alien and Predator movies the last couple weeks. Uh we really stopped just dressing up and giving a [ __ ] right? And it kind of reflects the the movies. It reflects the effort they're putting in 100%. You know, however, the quality of our interviews has not",
            "start": 0.11
        },
        {
            "text": "stopped just dressing up and giving a [ __ ] right? And it kind of reflects the the movies. It reflects the effort they're putting in 100%. You know, however, the quality of our interviews has not dipped at all. The last couple have been absolute bangers. If you haven't watched AP and review, go back and check it out cuz it was uh it was a a lot of fun for me to do and I'm sure a lot of fun to listen to. Um, Greg, do you have something? No, no. I was I'm enjoying it. I was I you know, for some reason, no matter how much time we have out here, I can't get an Instagram [ __ ] story live until we're live. I'm just trying to say we're live. Come watch the show. It's like I'm uploading. Hold on. It's a thumbnail. Taking me a long time. Everybody JPEG. If you love what we do, please support us with the kind of funny membership on Patreon or YouTube or Spotify or Apple podcast gets you the shows ad free and a daily exclusive. Gregway um and also you can be super cool like a Patreon producer",
            "start": 66.24
        },
        {
            "text": "with the kind of funny membership on Patreon or YouTube or Spotify or Apple podcast gets you the shows ad free and a daily exclusive. Gregway um and also you can be super cool like a Patreon producer like James Hastings, Casey Andrew, Casey Kern, Carl Jacobs or Omega Buster. Thank you all so much for your support. Um today we're brought to you by Stash, but of course we'll tell you about that later. Little housekeeping for you. Um, we're continuing our Alien verse Predator run. The goal is for us to just continue through to the end for this franchise. Uh, originally we were going to like jump off and take some gaps and whatever, but it seems like things have worked out that, uh, we will just continue on the next couple weeks, uh, which is very exciting. So, how many I don't how many movies are there in this? I I'm just We're This is a rarity. I feel like at least on the in reviews I'm in where I like we'll talk about in this one, but this movie opened and I was like, whoa, really?",
            "start": 108.08
        },
        {
            "text": "are there in this? I I'm just We're This is a rarity. I feel like at least on the in reviews I'm in where I like we'll talk about in this one, but this movie opened and I was like, whoa, really? Like I didn't I don't know. And like now I'm just like I know Prometheus is out there. I know. I got I think there's a Predators as well. We have Predators, the Predator, Prey, we have Covenant, and we have Prometheus. So in order, we have Predators, Prometheus, Alien, Covenant, the Predator. Where's Adrien Brody? Which one's the one where Shane Black was like, \"Ah, there's a pedophile. Let's put him in the movie.\" That was the Predator. Okay, which is no future spoilers, man. Man, I I could have sworn the next one is Predators. That's the one with Adrian. Here's one thing that I need to admit from last week. I don't think I ever came clean and said that like I never saw this one in theaters. The last one. Why'd you lie to us? Because I thought I did. I thought it was one that I saw in",
            "start": 150.56
        },
        {
            "text": "from last week. I don't think I ever came clean and said that like I never saw this one in theaters. The last one. Why'd you lie to us? Because I thought I did. I thought it was one that I saw in theaters. Yeah. And then I was like, it's probably this one. It wasn't. It was the Adrien Brody one. Oh, okay. But I could have sworn he was in an Alien versus Predator. No. [ __ ] Well, no. No spoilers, everybody. I'm taking this [ __ ] seriously. Okay. Spoilers. I like not knowing. Oh, I Yeah, I want to know what's going on. But, uh, yeah. So, we have Predators, Prometheus, Alien Covenant, the Predator. Then we do take one break for Thunderbolts in theaters. Thunder Thunderbolts and then Prey and then Alien Romulus. I'm ready. Let's go. Just give me give me I'll sing about it. Thunderbolts coming. The Thunderbolts coming. You got Sebastian Stain. you got and the rest. Uh, and then that'll get us all set up for later in the year in November when Predator Badlands comes out. The latest uh",
            "start": 191.28
        },
        {
            "text": "The Thunderbolts coming. You got Sebastian Stain. you got and the rest. Uh, and then that'll get us all set up for later in the year in November when Predator Badlands comes out. The latest uh Predator movie. Yeah, I think it's from the same guy that made Prey. Jacksonber. Yeah, I think so. A good one. Yeah, that's the alien TV show with them on Earth that I thought was I thought was very neat. Oh, they never been to Earth. canon. They're [ __ ] They're not They're not Yeah, they're not canon. Yeah. What? The AP movies, they were like, \"We This is bullshit.\" I don't apply that. I don't think it perfectly. Time for You're right. You're right. You're right. Forget everything, you know, everybody. Um the one thing though, we've been doing Daredevil's uh reactions every single week. Uh we just yesterday did a screencast uh that if you're on the podcast feed for review, you've probably seen it already. It's Daredevil 5 and 6 and also our reactions to all of the Avengers Doomsday casting",
            "start": 241.0
        },
        {
            "text": "yesterday did a screencast uh that if you're on the podcast feed for review, you've probably seen it already. It's Daredevil 5 and 6 and also our reactions to all of the Avengers Doomsday casting stuff. So, check that out. Um, due to Nintendo Insanity next week, we will not be doing a Daredevil review next week. Um, but then the following week, we'll catch up and review both of the episodes that we see. Um, but enough about all that stuff. We got to get into it. Aliens versus Predator Reququum stylized as AVPR. A lot of emphasis on the R. Why, Nick? Are you ready? Was rated R. OB1, not rated R. And it's like, did this solve the problem? The fans wanted it. Gratuitous violence that no one could see. Uh, released on December 25th, 2007. Joey's birthday and Christmas. Happy birthday, Joe. Happy birthday. Run time of Do you know? Does anyone here not know how long this movie was? I I pretty sure it was 140. It was 134, which blows my mind cuz that is It did feel very, very, very long. But",
            "start": 290.72
        },
        {
            "text": "birthday. Run time of Do you know? Does anyone here not know how long this movie was? I I pretty sure it was 140. It was 134, which blows my mind cuz that is It did feel very, very, very long. But 134, that's like when I saw that going into this, I'm like, \"Oh, thank you. Thank you, Alien versus Predator gods. This is exactly what I want.\" But man, a quick brisk Je. I'm also really proud of myself personally. if everybody can kind of congratulate me here cuz yesterday after the stream I started you know I ended my stream then I just started playing some embargoed stuff and just kind of like was playing games hopping here and ran I was like I wonder if we have an interview tomorrow check the calendar interview tomorrow Tim what what movie are we watching tomorrow he said Alien versus Predator I was like backto-back showdowns wow this is kind of exciting did you not believe the calendar uh well no I need to know what movie it was cuz the calendar just said alien. It just said interview.",
            "start": 341.92
        },
        {
            "text": "I was like backto-back showdowns wow this is kind of exciting did you not believe the calendar uh well no I need to know what movie it was cuz the calendar just said alien. It just said interview. Got it. Got it. Got it. Uh and you know, I could have checked the other calendar, but you know, Tim got back to me pretty quickly. He texted me back and uh and I was like, \"Wow, I'm in for a hell of a night after last year's fun or last week's fun adventure.\" And uh Yeah. And here we are. Yeah. Uh directed by Greg and Colin Strauss, known professionally as the brother Strauss. The Brother St. When it ended that popped up as the credit, I was like, \"Okay, now here's the thing, Andy. Don't [ __ ] talk [ __ ] about them, okay? because this was their directorial debut. All right, they tried their best. Um, but they also won uh they did a bunch of music videos, including the Red Hot Chili Peppers, California Cation, Lincoln Parks Crawling, and a whole bunch of other things like that. So, I'm",
            "start": 389.84
        },
        {
            "text": "best. Um, but they also won uh they did a bunch of music videos, including the Red Hot Chili Peppers, California Cation, Lincoln Parks Crawling, and a whole bunch of other things like that. So, I'm like, you know what? I'm not going to hate you for those things. And they also did all the VFX for the iceberg in in Titanic. No, they didn't. They did. They did. The Strauss Brothers. All they did was the Titanic ice. They're VFX people. Okay. Yeah, man. Oh, you could have fooled me with this Titanic. This iceberg is a big deal. We got to get the Strauss brothers on it. Mhm. They were like, \"How long is this going to take?\" Probably 15 minutes to make an iceberg. Really not that hard. Most most of us underwater. The music was done by Brian Tyler, who does all the Fast and Furious music, did the Mario movie, Avengers Age of Voltron? No, I was just looking up the iceberg scene from Titanic. God, what a scene. I've been begging for Titanic in review and Pearl Harbor in review. You really made",
            "start": 432.24
        },
        {
            "text": "Mario movie, Avengers Age of Voltron? No, I was just looking up the iceberg scene from Titanic. God, what a scene. I've been begging for Titanic in review and Pearl Harbor in review. You really made Gre Tim think that some [ __ ] was going on. I have the Pavlovian response. It's called PTSD is what it's called. Oh my god, dude. I literally I was like, what's he doing now? I thought it was only going to be once a day. He's [ __ ] with Greg was a little confused about that, too, cuz like am I doing something like I thought is finally blowing back on me? Is him doing something? Was that Greg from a different universe? We all loved your reactions uh to the fake out during the Nintendo Switch Direct today, but none of us were prepared for you to then as soon as it end for you to go, \"Was Patapon real?\" We all died out there. Oh my god, we never even thought about that. A repercussion of what we were doing. Um this one, so this is where this gets a little interesting. Like we're going to",
            "start": 470.64
        },
        {
            "text": "real?\" We all died out there. Oh my god, we never even thought about that. A repercussion of what we were doing. Um this one, so this is where this gets a little interesting. Like we're going to talk about this movie a lot. This movie had a budget of $40 million. Wow. Which is nothing. Yeah. And uh the return was 130.3 million. like they saw this as a success, but uh $40 million for this and that's just very very very interesting. Lights are expensive, but they didn't buy any for this one. You're just recording a dark room. Not a whole lot of rendering. I want to actually read a little bit from the directors uh saying like on on paper, Alien versus Predator Reco sounds like a fun, interesting movie. You know, take these guys, put them on Earth. It's going to be a good time. Um but there's a a reason that people didn't like this movie so much. It was dark. They couldn't see what the hell was going on. If people haven't seen this movie, it's very very very very dark. That might be one",
            "start": 516.08
        },
        {
            "text": "a a reason that people didn't like this movie so much. It was dark. They couldn't see what the hell was going on. If people haven't seen this movie, it's very very very very dark. That might be one of the the first things you hear when people bring up this movie. It's like it was dark, right? Um so apparently this was a choice. Um they're like, \"Hey, we have a small budget, so we need to work with that budget and we can't let people see that they're just guys in suits fighting because they're just guys in suits fighting.\" And so it was a choice by them. They're like, um, one of the first things in our pitch, we said, \"The movie's got to take place and power's got to get knocked out and it's got to be raining the whole night. uh seeing an alien broad daylight or just plain view is going to look stupid no matter what you do. The reason it worked in all the other movies is you were in a dark spaceship. You add flashing blinking lights, steam jets, you had all these great elements to",
            "start": 556.48
        },
        {
            "text": "to look stupid no matter what you do. The reason it worked in all the other movies is you were in a dark spaceship. You add flashing blinking lights, steam jets, you had all these great elements to cover them up, basically. And if you don't do that, they're going to look like guys in suits. On one hand, this logic makes a lot of sense. Uh but while the movie was always intended to look dark, the Strauss brothers ended up teetering too far in the wrong direction, leaving a muddled mess in their wake. Audiences weren't the only ones frustrated by that approach. Even some of the crew members were annoyed with not being able to see enough on set. As seen in the behind the scenes clip from the movie that circulated in 2016, the cinematographer Daniel Pearl was seen getting frustrated trying to shoot a scene because he couldn't get it bright enough. Uh, one of the trickier things too was when you got things like all the geeky fans who know everything about the movie, they go, \"Oh, I know",
            "start": 594.48
        },
        {
            "text": "to shoot a scene because he couldn't get it bright enough. Uh, one of the trickier things too was when you got things like all the geeky fans who know everything about the movie, they go, \"Oh, I know that's obviously a warrior alien. I know that's the pre alien.\" The biggest issue we had with the design is because we're going so dark with the movie and there's a lot of rain and atmosphere and everything. Is a normal person watching the movie going to be able to tell the difference? I'm gonna stop reading there. The answer is no. Yeah. I just want to start off real quick. I was so hyped last week when we end with the Pred Alien and I'm like, are we gonna get this [ __ ] Pred Alien? And when this movie starts off with that, I was I I was like I literally was like audly, holy [ __ ] they're doing it. I did not think we were doing this for sure. Yeah. And I was like, this is going to be awesome. And then watching the movie 90% of the time I had to be like, is that the predator? Is that",
            "start": 628.32
        },
        {
            "text": "doing it. I did not think we were doing this for sure. Yeah. And I was like, this is going to be awesome. And then watching the movie 90% of the time I had to be like, is that the predator? Is that the predator? Is that the other alien that pushes out of the way all the time? He runs with a dumb alien that he just pushes out of the way. Dude, this the editing of this movie was atrocious. There was some scenes where you had like 20 camera cuts in a 4se secondond span. It was real real bad [ __ ] It was very very hard to understand what is going on at any given moment. I mean, that's like indie film book 101, right? It's like everything's shot. I think I read another piece of trivia that DP was like, you know, Alien versus Predator was shot very wide. Um, it was shot, you know, you you can see the the the aliens and the predators fighting on on a wider scale and we just didn't have the budget for that. So, they shot everything handheld. They shot it close up and they obviously try to",
            "start": 662.4
        },
        {
            "text": "see the the the aliens and the predators fighting on on a wider scale and we just didn't have the budget for that. So, they shot everything handheld. They shot it close up and they obviously try to make it dark. But, I do want to point out that there's a difference between making an image look dark and making it look too contrasty. And so, that's what I actually responded to where you can't see any details anywhere in the shadows. And so, like that's what to me drew me out of the out of the movie cuz you can shoot a movie dark. You can have a movie where it's like, you know, the skin tones are, you know, 15 or whatever, but there's a way to light for that so that you can still have some tension, but see what the heck's going on. But there's like literally a sequence where he and the brother Dallas and the and the kid from who I think is Cam Giggit from Never Back Down, but it's not him. It's a different kid that looks like him. They're in the car and I'm like, I can't see either of",
            "start": 700.24
        },
        {
            "text": "Dallas and the and the kid from who I think is Cam Giggit from Never Back Down, but it's not him. It's a different kid that looks like him. They're in the car and I'm like, I can't see either of these people in this [ __ ] car. I can just see like a little bit of light in one of their eyes and a little backlight and that's it. It just really really takes you out of the movie, dude. the scenes that weren't in darkness where the movie starts off with uh like I I audibly told myself like this is one of the ugliest movies I've ever seen where it's all crushed. I think when the first guy, you know, gets off the room was like, \"What did you say?\" When he walks over to the to the police car, whatever, he's like, \"Get in the car, whatever.\" Like it I was like, \"It looks green screen, but I but it's not. It can't be.\" But this movie, something about the the what they were doing with color grading, it just looks so bad to look at. It was really unpleasing to visualize. It It definitely is. And",
            "start": 737.52
        },
        {
            "text": "not. It can't be.\" But this movie, something about the the what they were doing with color grading, it just looks so bad to look at. It was really unpleasing to visualize. It It definitely is. And it's funny cuz last week uh I was saying a lot that the the Alien versus Predator, the first one, felt like the comic book sequel then got an actual film adaptation and that made me enjoy it kind of more. This feels like if you just take a video game and turn it into a movie. And I don't mean that in a positive way. Like there's so many connections to plot beats from Resident Evil, including them nuking the freaking town at the end, which is an insane call for them to make. Um, but I don't hate this movie. Like, I didn't hate watching it. I didn't like it. But I do feel like if you think about this as an Alien Predator, Alien versus Predator movie. It doesn't work. But this movie is just a it's a horror movie kind of shitty like uh suburban town horror movie, right? It's Halloween and it's",
            "start": 775.36
        },
        {
            "text": "this as an Alien Predator, Alien versus Predator movie. It doesn't work. But this movie is just a it's a horror movie kind of shitty like uh suburban town horror movie, right? It's Halloween and it's it's like slasher movie specifically, not just horror. Like this is just an excuse to get cool kills from like unexpected in unexpected ways and whatever. And when that girl gets [ __ ] smashed, you know what I mean? It's like, all right, this is this is that type of movie. The problem is it's not a good version of that type of movie. I enjoy those type of movies. Um I don't think this is the worst example of one I've ever seen. Like I as this was going I was like, \"All right, I don't hate this. It's going to be over eventually. I can't believe it's as short as it is.\" Cuz it did feel a lot longer. Um I would compare my viewing experience a lot to Craven the Hunter. Hated 99% of it. And when there was some silly violent kills, I'm like, \"Oh, cool. That's kind of neat. That's, you know,",
            "start": 821.44
        },
        {
            "text": "longer. Um I would compare my viewing experience a lot to Craven the Hunter. Hated 99% of it. And when there was some silly violent kills, I'm like, \"Oh, cool. That's kind of neat. That's, you know, we're seeing blood in weird ways that I wasn't expecting to.\" And kind of shocking dudes getting their heads blown off. Of course, I It makes a lot more sense that it's rated R now. I I think once I saw the dude's two heads like explode, you know, both of them next to each other. Oh, yeah. This is like definitely a lot more violent and this is definitely got to be rated R. But that's kind of really all I got from it. This movie's cast in the worst way possible reminded me so much of a Saw movie later on. Like when Saw 3D mainly. Mhm. When it's this franchise that we've loved because it's goofy and so stupid, but there's way too many people in this movie. I lost track of who was who and what the relationships were. And I just I could not have given a lesser [ __ ] about so much of this. And",
            "start": 863.44
        },
        {
            "text": "and so stupid, but there's way too many people in this movie. I lost track of who was who and what the relationships were. And I just I could not have given a lesser [ __ ] about so much of this. And I was so sad cuz last week was kind of awesome. Yeah. Yeah. And it just again like last week I kept saying this movie delivers on Alien versus Predator. This movie just does not deliver on Alien versus Predator and that's really upsetting especially when you have a [ __ ] PR alien and you're on Earth like there's so many technically it does deliver about midway through the second act. I but I don't think it does. I I feel like it a baby joke. I feel I gota gotcha. I I just think that like in terms of the the action and choreography and stuff like the last movie had at least some creativity and just seeing them together and in the enclosed spaces and stuff worked when it is just a one-on-one fight between these things. They need to have different enough attributes to make it interesting to",
            "start": 909.2
        },
        {
            "text": "just seeing them together and in the enclosed spaces and stuff worked when it is just a one-on-one fight between these things. They need to have different enough attributes to make it interesting to watch, especially if it's dark and hard to understand. But when they're both about the same speed and about the same size and have very similar kind of like weaponry and whatever, it just takes away anything cool. Like there's not like the glamour shots are like the face hugger slow-mo jump from the last one and all that. Like it just kind of feels like um the bad versions of Michael Myers and the bad versions of like Freddy and Jason and stuff like from the worst of those movies. What if we put them together and they kind of hit each other, you know? Didn't like that stuff. So Zando has a great comment here. It Hollister ass dude bros. Yeah. What a time. What a what a place. Greg, what did you think? I loved this bad movie. Like for real. Like I it's you're mentioning it. It's being",
            "start": 949.92
        },
        {
            "text": "a great comment here. It Hollister ass dude bros. Yeah. What a time. What a what a place. Greg, what did you think? I loved this bad movie. Like for real. Like I it's you're mentioning it. It's being mentioned out there. You're doing callbacks. Like everybody knows uh you know if I have to sit down if I'm going to sit down and watch something right I want to watch a horror movie and I want to watch a zombie movie. And this was a zombie movie. Not a great zombie movie by any stretch to imagine. It's funny you bring up Resident Evil when in fact nuking the town is I think most known in my lines from Return of the Living Dead 85, right? Where it is like they [ __ ] this entire town and they just blow it up at the end, right? Which then causes more drama, let me tell you. But when they call the Colonel and we just get like oh this is literally right out of Return of the Living Dead. This is an exact conversation. So it obviously we said that we know that. Whatever. I enjoyed it the entire",
            "start": 987.92
        },
        {
            "text": "Colonel and we just get like oh this is literally right out of Return of the Living Dead. This is an exact conversation. So it obviously we said that we know that. Whatever. I enjoyed it the entire time. Yeah. It's way too dark. You can't see [ __ ] from it. But the ludicrous jumps in logic. The just we're introducing all these characters and they're all going to die. Like as soon as they kill the dad and the kid, you're like, \"Oh, okay.\" Like we're we're all in on this movie. We're going to kill kids. We're going to kill surprising amount of children death. Yeah. We're going to Usually that's something we don't show. This movie is a from the jump. Like we're doing that. I was like, \"All right, you're setting the stam from True Blood shows up.\" And I'm like, \"All right, he there's no he gets smashed to the window and kills him.\" I'm like, \"All right.\" Yeah, that's what this is every game on like Yeah. when Jesse gets glathed to the wall. I was like, \"All right, this is what Yeah. The",
            "start": 1025.44
        },
        {
            "text": "smashed to the window and kills him.\" I'm like, \"All right.\" Yeah, that's what this is every game on like Yeah. when Jesse gets glathed to the wall. I was like, \"All right, this is what Yeah. The [ __ ] PR alien grabs this pregnant woman and and then she [ __ ] they all they're all watching and tear and then they all get it and they all explode. I like this is [ __ ] gruesome ass horror [ __ ] And I was like I'm I'm in. This is I enjoyed this the most out of the bad Alien versus Predator movies we've watched. When that guy walks up to the car and sees the blood on the window and the alien like pops out, how did how did that happen? the the aliens and the predators and again I was I'm browning out as I watch this like you know what I mean at times but it's like they're just hopping around all over the [ __ ] place. I was like I don't I I'm like I don't feel like I fell asleep here for real but I must have missed something and then so you watch the movie. No, that's just how the movie",
            "start": 1061.28
        },
        {
            "text": "all over the [ __ ] place. I was like I don't I I'm like I don't feel like I fell asleep here for real but I must have missed something and then so you watch the movie. No, that's just how the movie is. They're just doing whatever. How does [ __ ] dude bro know to that Jesse's going to go [ __ ] him at the pool? She He just does. I'm like all right whatever. How does the alien get to the school to get in the pool? He just does. All right, whatever. You know what I mean? Of course, the aliens got to go to the school and then to see them and come in the it's like all right. Aliens like to have a swim occasionally. It's just so funny. Like it's like in Gremlins like you can there's so many different movies. It doesn't matter. It's just again the nonsensical leaps that this movie does over and over and over. Just the [ __ ] mom coming home from war. And like they're dropping so many human beings in this movie. None of them like I'm not even going to try to give any of these people [ __ ]",
            "start": 1102.08
        },
        {
            "text": "over and over. Just the [ __ ] mom coming home from war. And like they're dropping so many human beings in this movie. None of them like I'm not even going to try to give any of these people [ __ ] names. You know what I mean? I'm shocked you said Jesse. I was like what the [ __ ] He says Jesse enough that I'm like Jess, right? And you said Dallas and that's the older brother. Older brother just shows up, sits down with the cop like I can't believe you kept I had to come back bro there's a like okay cool the brother what he's got a crush on a girl just get [ __ ] beaten by Hollister guy down the sewer and he has to go down the block cuz he doesn't want to get caught. What a [ __ ] hilarious I came home. I didn't want to see me covered in [ __ ] God man. Nick, what did you think? Uh, I I remember watching this movie in theaters and being kind of like pleasantly surprised by it because I think the setup is interesting. We hadn't seen something in a small town. It's basically, you hit",
            "start": 1136.48
        },
        {
            "text": "remember watching this movie in theaters and being kind of like pleasantly surprised by it because I think the setup is interesting. We hadn't seen something in a small town. It's basically, you hit the nail on the head. It's a small town horror movie, right? Uh, you watch it now and obviously we've talked about the visuals. Um, they really don't lend themselves well uh to anything other than just confusion. Uh, I think they trade any sort of like tension for gore, which is fine. Again, can't do the same thing over and over again. I think it's fine. The guy gets his arm melted off and all these things. cuz you're like, \"Okay, well, I guess that's where we're at right now.\" The two main things that I don't like about the film is that there's a complete and total lack of protagonist. You You think when uh the actor's name is Rico Ellsworth comes home from war, you're like, \"Cool, we've got our we've got our protagonist. This is going to be our Ripley character, right? She's a badass. We",
            "start": 1178.72
        },
        {
            "text": "think when uh the actor's name is Rico Ellsworth comes home from war, you're like, \"Cool, we've got our we've got our protagonist. This is going to be our Ripley character, right? She's a badass. We we have one visual thing that all we need to do is this ladyy's coming home from war. She's a soldier. That's it. That's all I need to know. She can handle herself.\" And then we don't see her for 20 more minutes. And then she really doesn't do that much beyond this. Here's night vision goggles, honey. Okay, these are going to come in and play. Yeah, these are going to play. Cool. Oh, she doesn't want you to read the book to her. Dad wants to read. And it's like, okay. Um, and then so, so there's no real protagonist in this. They try to make I guess Allison's brother, the brother and Jesse, all those things, but you don't really end up giving a [ __ ] about any of these people. And I think it the movie would have been a lot better if they had focused it a little bit more on that dichotomy,",
            "start": 1211.48
        },
        {
            "text": "those things, but you don't really end up giving a [ __ ] about any of these people. And I think it the movie would have been a lot better if they had focused it a little bit more on that dichotomy, that duality of do we go to the center like the the the couple people that want to go to the center of the town and then the people who the lady who should have been like, \"Hey, I'm in the military.\" They wouldn't put you in the center of the town. They'd be on the outskirts of the town if they wanted everyone to go there cuz like that puts you in the middle. That would that that would have worked, I think, a lot better. Killer setup. Like that's a great plot there. Cool plot. We've seen it multiple times. We saw it in the mist where they're like, \"Do we leave the store? Do we not leave the store? We don't know. It's it's all for nothing.\" Yeah. Yeah. Uh, it's a Sophie's choice basically, right? So, they they fundamentally fumbled the football with that one. Uh, second, if you're doing",
            "start": 1248.72
        },
        {
            "text": "store? We don't know. It's it's all for nothing.\" Yeah. Yeah. Uh, it's a Sophie's choice basically, right? So, they they fundamentally fumbled the football with that one. Uh, second, if you're doing small town, do not show me an aerial view of this town and have it look like [ __ ] Sacramento. This place is huge. And it totally dis I'm like, to Greg's point, how the [ __ ] do the aliens get from point A to point B? We're supposed to think there's a [ __ ] ton of them now to the point where we have to nuke. But by the point where they're they're moving around the town, it's like, what are they [ __ ] teleporting to these places? How are they? Right. Alien. He's all over the place. Yeah, he's all over the place. So, so I think that, you know, when you've got a town like um that's happening in like Halloween, right? The threat Hatenfield. Hatenfield, right? Is that what it's called? Hatenfield. Uh the threat of Michael Myers is is out there. It's looming because you never know. You never",
            "start": 1277.6
        },
        {
            "text": "like Halloween, right? The threat Hatenfield. Hatenfield, right? Is that what it's called? Hatenfield. Uh the threat of Michael Myers is is out there. It's looming because you never know. You never know what might be around the corner, right? But in this one, I don't know. There's two aliens hunting this thing. This place is a like 80 500 square miles of of this forest. It doesn't make any sense. It's like being in Denver for Christ's sake. So, I think they could have they could have done something a little bit more there. Maybe saving a little budget by shooting it someplace smaller. But overall, I I do the thing I like about it is the main alien who Chris Anka actually uh sent me a text and he was saying, \"Hey, the the the crew called it the wolf and they based it off of Harvey Kitel's character from Pulp Fiction, which I don't think you've seen yet, Tim, but he's a cleaner basically comes in as a clean.\" I'm like, \"That's a fun concept.\" Um, could we have given him more creative",
            "start": 1316.24
        },
        {
            "text": "character from Pulp Fiction, which I don't think you've seen yet, Tim, but he's a cleaner basically comes in as a clean.\" I'm like, \"That's a fun concept.\" Um, could we have given him more creative ways to do that other than the the blue goo that just just disintegrates everything? Also an awesome favorite moment where Yeah, exactly. But like Jen looked up for refresh like why is he dissolving things and I paused it and I'm like well there's two schools of thoughts and I did not remember at all this conversation that it's been confirmed AP is not part of the universe. Was it designed when they were making them that it wasn't it was it own? Well, I mean it just doesn't add up at all. It does totally. As I explained to her, I'm like, number one, we need to believe that when in 500 years or whatever it is for Ripley, aliens have never been here. So, there can be no evidence of that. Number two, they escape this proving temple where, you know, if something went wrong, they would have",
            "start": 1354.88
        },
        {
            "text": "or whatever it is for Ripley, aliens have never been here. So, there can be no evidence of that. Number two, they escape this proving temple where, you know, if something went wrong, they would have nuked everything and there wouldn't be any same reasoning. And she just looks at me, goes, I'm going to bed. Like, all right, bye. Yeah. Um, but overall, you know, slightly enjoyable movie from the action sequences. It just it is too short and it just really doesn't have any characters that you want to root for. I wanted it to be the military lady and then but then you have her kid too who's just kind of there not really scared the whole time. I don't know. It's kind of a mess. Mommy, are the monsters gone? Yeah. Yeah. It just would have been not that these military people aren't about to [ __ ] assassinate us and kill us. We're going to get killed. I just like was fantasizing and imagining a movie that was just a like a movie where it only like I guess you're just the Predator in this",
            "start": 1391.28
        },
        {
            "text": "assassinate us and kill us. We're going to get killed. I just like was fantasizing and imagining a movie that was just a like a movie where it only like I guess you're just the Predator in this movie. It's just like kind of a almost a slice of life, but you're you're just it's just focused on him and you're you want a Disney Plus Predator show. I I just want him to be the main guy. I wanted I would have loved if it was all just from his perspective, he's going like even if there's no dialogue, just how fascinating it would have been to be like I got to go to Earth and take care of some [ __ ] And I would have loved to have seen him the protagonist. And I would have loved to have seen more of it, you know, like visually, but to imagine a dude having to deal with fighting all these things and seeing the action that they could have done, it's just Yeah. You have to be careful though. You start getting into like Godzilla territory where when you've got this two things beating the [ __ ]",
            "start": 1429.28
        },
        {
            "text": "and seeing the action that they could have done, it's just Yeah. You have to be careful though. You start getting into like Godzilla territory where when you've got this two things beating the [ __ ] out of each other for like two hours. At some point someone's like, \"We should have a human that someone cares about in this,\" which is what they try to do. What are you up to? But I think we would care about the Predator in this case. Like I like I think they could have done that. I just don't think that when you're tasked with making an Alien versus Predator movie, you should say you're only giving us how much? 40 million. 40. At that point, you say that's not possible. I'm sorry. Like, you want us to make some We could do something else with 40 million. But if you want two really iconic things fighting on the screen for a lot of it, that's just not possible with this. You're right. I mean, you you you you're absolutely right. Right. If you're going to make an alien movie, you can do",
            "start": 1474.08
        },
        {
            "text": "things fighting on the screen for a lot of it, that's just not possible with this. You're right. I mean, you you you you're absolutely right. Right. If you're going to make an alien movie, you can do that maybe for 40 million. A Predator movie, maybe for 40 million. You can't sandwich them together. You got to have 80. 80. That's real bad. 80 for Brady. All right, we're going to get into the plot after. Word from our sponsors. This podcast is brought to you in part by Stash. Are you still putting off saving and investing because you'll get to it someday? Stash turns someday into today. Stash isn't just an investing app. It's a registered investment advisor that combines automated investing with dependable financial strategies to help you reach your goals faster. They'll provide you with personalized advice on what to invest in based on your goals. Or if you want to just sit back and watch your money go to work, you can opt into their awardwinning expert managed portfolio that picks",
            "start": 1515.28
        },
        {
            "text": "personalized advice on what to invest in based on your goals. Or if you want to just sit back and watch your money go to work, you can opt into their awardwinning expert managed portfolio that picks stocks for you. Stash has helped millions of Americans reach their financial goals and starts at just $3 per month. Don't let your savings sit around. Make it work harder for you. Go to get.stache.com/kindafoney to see how you can receive $25 towards your first stock purchase and to view important disclosures. That's get.stach.com/kindfunny. Paid non-client endorsement not representative of all clients and not a guarantee. Investment advisory services offered by Stash Investments LLC and SEC registered investment of adviser. Investing involves risk and investments may lose value. Offer subject to TNC's. This movie is so shitty. It always gets me. Is it going to go long or no? I thought that one had too short or a little too long. At least a verse. Never just right. I I do love uh Gav in",
            "start": 1561.68
        },
        {
            "text": "to TNC's. This movie is so shitty. It always gets me. Is it going to go long or no? I thought that one had too short or a little too long. At least a verse. Never just right. I I do love uh Gav in the chat saying it should have been called AVB. Alien verse budget. Greg hit me with the What's up everybody? Welcome to Aliens versus Predator Reququum. For a dream or a nightmare, uh, we begin exactly where we [ __ ] left. Well, actually, we start with another terrible title treatment. Yeah. 20th Century Fox logo hot as always. And then I was like, Re, this is hideous. Hate this. Take it back. Shockingly again. I literally went, \"Holy shit.\" Jen's like, \"What?\" I'm like, \"They're picking up right where they left off. I did not see this coming.\" It is a bunch of dumbass predators on their ship. You got the You got the regular Predator that died over there in front of the Earth. Uh the FA the alien pops out of the PR alien pops out of him, right? And then grows extremely fast. That's what",
            "start": 1609.36
        },
        {
            "text": "You got the You got the regular Predator that died over there in front of the Earth. Uh the FA the alien pops out of the PR alien pops out of him, right? And then grows extremely fast. That's what they do. We don't question that. Cuz that was my thing. He popped out and then I was like, \"Oh, okay. It's going to be a while.\" And then no, he was pretty big right away. Or did we stay in orbit, we think? Do we have anybody got head cannon or what have you? I mean, you imagine it's exactly like the first movie where he like pops out and he's skulking around a little bit and they can't find him or whatever. They weren't even looking for him yet. Well, yeah, it was like cuz I mean it starts with [ __ ] the Predators like are working [ __ ] He's doing [ __ ] over there doing sciency things. I don't I thought this was a weird opening but again this is a weird movie with a lot of different hopes and dreams in it that don't plan out. But I'm excited in these moments. I'm like so Predator is just",
            "start": 1662.88
        },
        {
            "text": "I thought this was a weird opening but again this is a weird movie with a lot of different hopes and dreams in it that don't plan out. But I'm excited in these moments. I'm like so Predator is just working and then the alien that just got born or maybe they've been orbiting for a while is big now and he walks over and he kills the one working and that guy is like oh [ __ ] And then one of the other predators looks over and goes and sees him, but he's the PR alien with the thing in the outline and he runs away. Shoots him blast and kills him like all the Yeah. Uh they start [ __ ] fighting, right? Uh the ship starts going down. They Oh, they had a whole bunch of face huggers, by the way. Tubes when they walked in there, right? Uh thing goes down. There's a dad and son down there. They're hunting, you know, some good I thought they described this as a Midwest activity, but we're over in Colorado. I don't count that. Uh, and so they're out there ready to kill some [ __ ] thing. Well,",
            "start": 1700.64
        },
        {
            "text": "hunting, you know, some good I thought they described this as a Midwest activity, but we're over in Colorado. I don't count that. Uh, and so they're out there ready to kill some [ __ ] thing. Well, guess what? They're going to be killed because this giant [ __ ] spaceship crash is like, \"Dad, what was that? I don't know, son. Let's go check.\" And they go over there. We go back inside the ship. We see that the face huggers uh containment units have been cracked, right? One predator there uses his thing to do. I'm like, \"Oh, smart. He's already blowing it up.\" He's not. He's not. Which is what they're like they're trained to do. He sees the face huggers escaping. Could set off his nuke right there. End the goddamn movie. You know what I mean? Kill these people. Well, who cares? Follow protocol for Christ sake. You know what I mean? I don't like it when I'm like I'm more predator than this predator. You know what I mean? Like I know more about your culture than you do. You've been in",
            "start": 1740.64
        },
        {
            "text": "for Christ sake. You know what I mean? I don't like it when I'm like I'm more predator than this predator. You know what I mean? Like I know more about your culture than you do. You've been in Tim's car. I've been in Tim's car. I'm the ultimate predator. I want to um I forget who said in the chat a while back, but I want to give a shout out to this this the kid in this who played the young Sean Spencer in the Psych series. One of the young Sean Spencers. I think they're awesome. I like that. I like that a lot. Uh so anyways, he radio he phones home this alien while the other alien face huggers get out. Dad and son get there. dad goes glunk on the ship or whatever. Like we should report this to the sheriff. And then here's a little bit of skittering, but enough to be like run. Like, you know what, Dad? Smart enough call, I guess, as you go, right? So, they run for a little bit, and then they get stopped in the woods around a tree stump. There's a lot of tree stumps. And uh more",
            "start": 1775.92
        },
        {
            "text": "you know what, Dad? Smart enough call, I guess, as you go, right? So, they run for a little bit, and then they get stopped in the woods around a tree stump. There's a lot of tree stumps. And uh more skittering, more skittering, skittering. And then up over the thing, this face hugger comes and dad shoots it in the air. And then it's got acid blood and it goes w and it hits his arm. And it's like, this is where we get the R rating. Everybody immediately melts the dude his arm off and it just flops on the ground. The kid's like, \"Dad and dad's like the face sucker grabs him on the [ __ ] face and the kids scream and one comes in.\" Kid hides like a coward first off. Well, yeah, but I mean a kid. You know what I mean? Save your dad. Jesus. You know what I mean? This is why every day I tell Ben, \"We don't negotiate with terrorists.\" Okay. If we're in a situation like this or anything, you run at that terrorist. All right, Ben. That's what you got to do. Have a great day at kindergarten.",
            "start": 1810.8
        },
        {
            "text": "Ben, \"We don't negotiate with terrorists.\" Okay. If we're in a situation like this or anything, you run at that terrorist. All right, Ben. That's what you got to do. Have a great day at kindergarten. And also remember, we don't negotiate with terrorists. Um this then uh my dad always said we don't negotiate with terrorists. Uh this uh pings back on Predator home world where our boy is sitting there on you know the 911 station. He gets Yeah. What do you think his role was here? Just this. So this is like a watchtower and he's just ditch dispatch and he just goes across. Like they really care about our planet a lot. I mean in this version of the universe they they do. They love it. world. Yeah, that's the whole thing, right? Like their whole deal is like they use it. It's an outpost for them. You would think though they were like, \"Let him [ __ ] let him breathe a little.\" I just I just picture him like leaving the office like putting the little like he's got a little [ __ ] what are",
            "start": 1847.36
        },
        {
            "text": "You would think though they were like, \"Let him [ __ ] let him breathe a little.\" I just I just picture him like leaving the office like putting the little like he's got a little [ __ ] what are those little the detective hats? Yeah. Put on one of the little fedora and the wife's like, \"Honey, we're it's my birthday tonight.\" He's like, \"I got to [ __ ] go to Earth again.\" [ __ ] trench coat. Exactly. Damn it, Barbara. When I took the I told you I got to work the desk for 3 months more and then I can get upgraded. You knew I'll be a sergeant predator and I won't be on call anymore. You knew this was what the life you signed for this. You're the one who wanted to move to the move to the suburbs and get his [ __ ] mortgage. All right. The door. Barbara cries. Pours a glass pour a glass of wine. And we just stay with her. We just stay with her. Give me Barbara the predator story. What's happening over there? Barbara and Nancy are sitting drinking wine together. He's a good man, Nancy.",
            "start": 1895.28
        },
        {
            "text": "wine. And we just stay with her. We just stay with her. Give me Barbara the predator story. What's happening over there? Barbara and Nancy are sitting drinking wine together. He's a good man, Nancy. But he just doesn't care about me anymore. It's all work, work, work, Earth. Why do we care? Let the bugs run over the planet. Who cares? Earth doesn't have faster than light travel. They're never getting off. I digress. They care about Earth so much. You're right. It's I mean, again, this was where they came to hunt. It's kind of like how we feel about Taho. You see AP. Uh at this point, uh Big Bro shows up. The bus rolls into town. He gets off in his leather jacket. You're like, \"Oh man, this guy's bad news. Tough.\" He's from Crest Butt. Anyways, uh he comes in and then he gets in the cop's car from Colorado and he's like, \"I can't believe they made you a cop.\" And he's like, \"They almost didn't, but I can't believe you're back.\" And they're old friends, but they don't really seem like",
            "start": 1936.6
        },
        {
            "text": "car from Colorado and he's like, \"I can't believe they made you a cop.\" And he's like, \"They almost didn't, but I can't believe you're back.\" And they're old friends, but they don't really seem like old friends, but they gave you enough here that they were old. Maybe they were old like druggies. Maybe they smoked pot a lot in high school together. They weren't that close of friends. You know what I mean? Maybe they did all their elicit drug stim. Yeah. people watching or listening, I urge you, it's not worth it, but I urge you to spend the $4 or whatever it is to rent this just cuz I want you to watch these opening sequences in the daytime cuz I again like it is some of the it is some of the ugliest [ __ ] I can't It reminds me a bit of the way like sort of the the dusk like going into sunset period uh looked in in the Transformers movies like early on. There's just something about the coloring in this movie that looks so bad. It looks like a Xbox 360 game. Yes. You know, Bloom, just",
            "start": 1982.24
        },
        {
            "text": "period uh looked in in the Transformers movies like early on. There's just something about the coloring in this movie that looks so bad. It looks like a Xbox 360 game. Yes. You know, Bloom, just brown. And it it it kind of again, it looks like so much of it is green screen even though it's not. It I It's awful. It's It is interesting that they shot during the day and it's still somehow too [ __ ] dark, dude. It's awful. You see the screen? Like, what are you doing? Uh, what do we got here? Oh, you're showing how it is. Oh, it's a free on Hulu. People are saying it's on Hulu. Free on Disney Plus. Damn, I rented it on if you have Hulu. Oh, really? Yeah, I watch Hulu. Oddly enough, though, and this is this is going to sound like the most nick thing ever. I watched it on I started watching on Hulu. I was like, \"Oh, man. Hulu's compression is [ __ ] terrible.\" I'm going to pay for this. And I was cuz I'm very like, you know, I'm a little sensitive to that. I was like, \"Oh, man.\" I'm like,",
            "start": 2025.92
        },
        {
            "text": "Hulu. I was like, \"Oh, man. Hulu's compression is [ __ ] terrible.\" I'm going to pay for this. And I was cuz I'm very like, you know, I'm a little sensitive to that. I was like, \"Oh, man.\" I'm like, \"D, do you mind if we just pay for this?\" Like, I I can't watch it on here. It's way too dark. And then I fire it up on Amazon Prime. I'm like, \"Well, [ __ ] me. I just wasted $3.79. It is bad.\" Yeah. Too dark. Uh, so in the car, you know, I'm this and that and we used to do bad stuff back in the day, but now I'm a cop and maybe you could be a cop one day and blah blah blah. And then uh he's like, \"And how's my brother?\" \"Oh, he's even worse than you.\" And like, \"Oh, [ __ ] This guy's really into some hard shit.\" You know what I mean? He's just delivering pizzas. He works at a [ __ ] pizza place and he doesn't want to wear the hat. This poor guy just doesn't want to wear the hat. Which also I don't get. Get in the car and take off the hat. It's very easy. I feel like this the pizza kid is",
            "start": 2065.84
        },
        {
            "text": "and he doesn't want to wear the hat. This poor guy just doesn't want to wear the hat. Which also I don't get. Get in the car and take off the hat. It's very easy. I feel like this the pizza kid is like the lead of this movie. He kind of he's one of them. They share it. You know what I mean? When they when they all got booked, they were like, \"We don't none of us want to be the lead. We're an ensemble.\" Yeah. And I just feel like I don't care about him. From the first couple moments, I'm like, I kind of again back to Nick's point and I agree that that's the problem with one of the problems with this movie is you don't care about anybody. I care. But I mean, that's also then I'm just like, \"All right, cool.\" But I the other problem is I don't care about the Predator the Predator or the PR alien. You know what I mean? I'm just watching [ __ ] go sideways. The only real tension in this movie is like, \"Hey, is this guy going to bang this girl before her boyfriend beats him to [ __ ]",
            "start": 2103.76
        },
        {
            "text": "PR alien. You know what I mean? I'm just watching [ __ ] go sideways. The only real tension in this movie is like, \"Hey, is this guy going to bang this girl before her boyfriend beats him to [ __ ] death?\" That's where she gets [ __ ] claved into the wall. And I'll tell you, I'm sitting there and I'm getting teased by Jesse. All right. She's like, \"I couldn't decide what swimsuit to wear.\" And I was like, \"Oh, so you're not going to.\" And like, \"Oh, you wore a mismatched swimsuit.\" That's [ __ ] dumb, Jesse. That's the worst conclusion. That's the one. We're the one that's skimpiest. You know what I mean? I would have thought you just, you know, this was a spur of the moment sex, not like you really planned it to this level. Ladies, gentlemen, NB's watching. Like, don't do that. Don't mix and match the swimsuits. You know what I mean? Mix and match swimsuits. Pick a pick a lane. Pick a lane. Pick a lane. Anyways, though, we're still with uh Pizza Boy here. He has a big fight. He's",
            "start": 2134.32
        },
        {
            "text": "mix and match the swimsuits. You know what I mean? Mix and match swimsuits. Pick a pick a lane. Pick a lane. Pick a lane. Anyways, though, we're still with uh Pizza Boy here. He has a big fight. He's like, I only his boss like, I only gave you this job because, you know, I forget what your guidance me or whatever the [ __ ] right? The guidance counselor came to Pizza Hut and was like, \"Please give this kid get a [ __ ] job.\" No, this whole town again, this is a very tiny town, so everyone knows everyone. Yeah. Until you again until we see the aerial view town. I hear you. And it's [ __ ] Los Angeles. Metropolis. He's like, \"You got to go to 1506 Water Crest Lane.\" And the guy's like, \"There's no way I can't go there. I can't go.\" And I'm like, \"Oh, the reason he's in trouble is like a soccer charge or something like that.\" Is that the fun or he broke into that place? No, it's of course it's Jesse's house. We'll get to that in a second because instead uh we go uh to a just dank sewer",
            "start": 2176.64
        },
        {
            "text": "charge or something like that.\" Is that the fun or he broke into that place? No, it's of course it's Jesse's house. We'll get to that in a second because instead uh we go uh to a just dank sewer hole where a a cop walks in there and then this man comes out and it's supposed to be a scare, but guess what? It's just Butch. He's like, \"Hey, Butch, I told you guys you can't hang out here.\" And he's like, \"All right, I'll get out of here. Let me just call old Mudsy.\" He's like, \"Yeah, buty.\" And this dog runs over. Whose dog is Butch? I don't [ __ ] care. Have you ever watched it in review? We're making it up as we go. All right. Msy, the dog who is canonically named Mutsy Mutzy shows up with the D. Oh, he wasn't just saying it twice. His name is Mudsy Mutzy. The dog shows up full name with the [ __ ] uh guy's arm and it's it's bloated and disgusting and I'm like, \"Oh, time's passed. They've been they've been out there for weeks cuz that looks No, we as we'll get to them in a second. We'll",
            "start": 2218.88
        },
        {
            "text": "[ __ ] uh guy's arm and it's it's bloated and disgusting and I'm like, \"Oh, time's passed. They've been they've been out there for weeks cuz that looks No, we as we'll get to them in a second. We'll get back to that.\" when he drops like, \"Oh my god, sheriff, there's a [ __ ] arm here down by Msy Bush.\" You know, Mutzy and he's like, \"Wait, is My the dog and Bush is another dog?\" Cuz there's a dog and he's like, \"My Anyways, see this is a great one to recap.\" Tim was like, \"We should skip this one.\" I said, \"No, I just don't skip it.\" I said, \"Be got to get some mudsy every baby, Tim. We're not skipping. You're such a good baby.\" Uh, so then he pulls up at Jesse's house who comes out to get trash or whatever on her. She's doing something in her car and like, \"Okay.\" Again, I was like, \"I'm right. Stalker charge, you know what I mean?\" Takes off his hat, fusses with his hair, goes up to the door, knocks in. She's like, \"Oh, hey, [ __ ] pizza guy.\" And he's like, \"Hey.\" Yeah. Or she uses",
            "start": 2267.44
        },
        {
            "text": "right. Stalker charge, you know what I mean?\" Takes off his hat, fusses with his hair, goes up to the door, knocks in. She's like, \"Oh, hey, [ __ ] pizza guy.\" And he's like, \"Hey.\" Yeah. Or she uses his name. I don't remember. Uh, and he's like, \"Oh, you know each other.\" It's a great movie. Jamie, maybe his name is Ricky. I think it's Jamie now. Is it really? And also, you know, it's the hallmark of a good movie where none of these people have last names. You never even bother to flesh them out beyond the generic ass first name once. And so they, you know, she's like, \"Oh, I left my wallet in here. Come on inside of this snake's [ __ ] viper pit of my friends and my boyfriend and whatever.\" The dialogue here is utterly insane. Yeah. And no wonder you guys ordered a sausage lover. It's like, damn, Dor talking about homophobia, too. Come on now, Ricky. Get it together. But also, let's take a let's let's take a second, right? Because I guess we're supposed to care about Jesse, right?",
            "start": 2311.2
        },
        {
            "text": "like, damn, Dor talking about homophobia, too. Come on now, Ricky. Get it together. But also, let's take a let's let's take a second, right? Because I guess we're supposed to care about Jesse, right? Yeah. The the blonde would be girlfriend in this. Why is she not cooler and more aware of the fact that these guys she's dating are going to [ __ ] murder this kid when he walks to the house? That makes me not like this character, which makes me not care about whether or not she gets stuck to a wall in the third act. Yeah, I'm with you. It's the It's the traditional I mean, this movie relies heavily on all the stereotypes, right? So, it is that Yeah, she's a abusive boyfriend. And I'm going to break up with him. Whatever. I'm going to fire I think I'm thinking about firing him when she talks to him in the other room. Right. Guys even [ __ ] here. Yeah. Wait, just get out of it. You saw how mean he was right to me for I'm just trying to earn a living here cuz my guidance counselor said to",
            "start": 2352.64
        },
        {
            "text": "to him in the other room. Right. Guys even [ __ ] here. Yeah. Wait, just get out of it. You saw how mean he was right to me for I'm just trying to earn a living here cuz my guidance counselor said to because I stalked you. Are you still in high school though? Or is the guidance counselor just kind of biting into my life? Mid 20s. One of those things where you got to sit here and go, man, we made some choices as this country. You know what I mean? And we can all point back to Obama and blame him. But it's 5259 for four pizzas. I'd [ __ ] give up all three of you right now to get that economy back there. I understand we live in San Francisco or whatever, but come the [ __ ] on. Ben orders a side of fruit. Well, I got to mortgage the house. I don't know what's going on. No, Ben. But let's let's go over what we don't like. Okay. No terrorists, no fruit, and don't mismatch bathing suits. Oh, Ben, if you mismatch a bathing suit, you know what I mean? Uh, he gets the money, he goes outside,",
            "start": 2390.4
        },
        {
            "text": "go over what we don't like. Okay. No terrorists, no fruit, and don't mismatch bathing suits. Oh, Ben, if you mismatch a bathing suit, you know what I mean? Uh, he gets the money, he goes outside, and as he's getting to his [ __ ] truck, Dale comes out, just whoops his kid's ass, right? Mickey little sausage lover joke now. You know what I mean? I got two dads. I'm like, \"Oh, whoa. Now, now the paradigm shifted. Whose side am I on?\" Ricky is in that's [ __ ] up. He is [ __ ] up. I'm with the bully. That's the keys in the sewer. And then he goes, \"I I hope you can get it in 30 minutes or less.\" I'm just like, delivery joke. There you Hey, good delivery joke, man. Like his friends in the back. And then it's the same thing where Jesse comes out like, \"Leave him alone.\" You're like, \"Let's go, Jesse.\" And she listens and goes inside. I'm like, \"Not I'm going to call the cops cuz you just committed or break up with you right here. I'm going to invite you back into my palia Colorado house.\"",
            "start": 2428.72
        },
        {
            "text": "Jesse.\" And she listens and goes inside. I'm like, \"Not I'm going to call the cops cuz you just committed or break up with you right here. I'm going to invite you back into my palia Colorado house.\" Yeah, it's a great house. Uh then we go back to the cops who are back at the forest. Uh they fight. I wrote it down. Buddy Benson's truck. That's right. It's Buddy Benson's truck. He goes out hunting with his son. Oh no. What are we gonna do? We cut back into the woods, right? And guess what? Everybody's waking up. I forget. And the kid wakes up first and he's like, \"Oh, oh, dad.\" And then dad wakes up. He's like, \"Oh, I don't This is cauterized, I guess, cuz the acid.\" Still though, whatever arm, whatever. I know. Dad gets up and he's like, \"Well, it's going to be immediately.\" And here's the thing. I'm so happy it happened fast. I was like, \"I don't need to keep cutting back to these guys like dealing with them.\" And I was just like, \"No, these things are about to burst out.\" Did not",
            "start": 2477.52
        },
        {
            "text": "the thing. I'm so happy it happened fast. I was like, \"I don't need to keep cutting back to these guys like dealing with them.\" And I was just like, \"No, these things are about to burst out.\" Did not expect the kids to get burst though that soon. I thought that was going to be a bigger like, let's build to it. The CG of that was so bad. Yeah. Compared to the last several movies of like how impressed I was with like, man, this is dated, but it still looks pretty good for its age. The CG of this like cuz they didn't want to show they didn't want to get too violent. This is already kind of [ __ ] up that we're killing a kid right here. We don't want to show a chess burst out of a kid. So they like immediately zoom in so we don't see any reaction of the kid. But that looked real terrible. Good stuff. Uh from there, good stuff. From there then, uh this is where you're like, \"Wow, that was that's crazy. I can't wait to see what happens next.\" We jump to it's O'Brien. Soldier O'Brien is back",
            "start": 2520.08
        },
        {
            "text": "stuff. Uh from there, good stuff. From there then, uh this is where you're like, \"Wow, that was that's crazy. I can't wait to see what happens next.\" We jump to it's O'Brien. Soldier O'Brien is back from the war and she gets out of her cab. Wow. Go I'll tell you right now, everybody, just go pick up. These people gave up their time for our country. Go pick them up at the airport. Get her from the airport. I've seen the thing where they got to get tapped or whatever. I know this isn't the exact same thing, but they get him in a bus. Go get O'Brien. You know what I mean? Sam, get off your ass. Getting out of prison for Christ's sake. You ever seen this? No, I don't. I forget which armed force it is. When you graduate, it might be all of them, but when you graduate, you stand at attention till somebody comes and like taps you. Like your family comes out of the stands when you leave boot camp. I'm probably getting some of that wrong, but I'm sure we have many people just people arguing",
            "start": 2560.32
        },
        {
            "text": "till somebody comes and like taps you. Like your family comes out of the stands when you leave boot camp. I'm probably getting some of that wrong, but I'm sure we have many people just people arguing about pizza prices right now. But anyway, um Oh, anyways, she shows up. Kid's excited to see her again. And this kid's just like my kid. What did you bring me? She's like, \"Well, I brought you night vision goggles.\" She's like, \"Oh, okay. These are whatever. I don't care.\" Whatever. Sam from True Blood comes out. I'm like, \"Hey, Sam from True Blood.\" Love Sam from True Blood. Have you watched True Blood? We know this. I got to Google a relationship with Janina in the show, not in real life. So, Janina's character in the show. Mhm. Spoilers. He was a shape shifter and so was she. But one of them was just like one of them was a werewolf. He was a werewolf. He was a werewolf and she was a shape shifter. They had werewolves in that show. And they had titties everywhere. You know what I mean?",
            "start": 2597.04
        },
        {
            "text": "was just like one of them was a werewolf. He was a werewolf. He was a werewolf and she was a shape shifter. They had werewolves in that show. And they had titties everywhere. You know what I mean? Wow. We see any dinkers. Do we see doinks? I think we see um scars. It was good. Yeah, it was good. Well, am I thinking of that or uh Big Little Lies? Remember when he he gets a tennis racket on the PP there? Oh, doctor. Let's do Scarsgard Dick in review. You know what I mean? Every time he makes an appearance. I think Stellin's got his dick out a couple times, too. I think Stellin Scarsgard has put his his dick out on the phone. He's the older one, but you know, whatever. Yeah, he was in that Oace movie. You ever seen the Oface movie? Also, Nasaratu. Sorry, Kevin. And how is this related to the movie? I I I lost the plot. Oh, Kevin, it's adorable that you've never watched in review before. When we do in review, we enter the space between spaces. All right. We become cinema. And when that",
            "start": 2631.76
        },
        {
            "text": "movie? I I I lost the plot. Oh, Kevin, it's adorable that you've never watched in review before. When we do in review, we enter the space between spaces. All right. We become cinema. And when that happens, you can jump to any movie you want. All right. But as soon's over, you get it back on track. All right. Similar to how Kevin maniac.cu That's Olympic, huh? Kevin jumped from Love Actually to The Fifth Element very seamlessly. Very seamlessly. That was an interview move there. Kevin ridiculous thing that you guys can't drop. Uh Ricky comes home. Ricky comes home, goes through his window, his brother in the leather jacket sitting there. Ricky goes and gets a baseball bat and says he's he Why did you Why is your face beat up? I got punched by Hollister, bro. I'm gonna go [ __ ] beat him to death with a baseball bat. And his brother's like, \"We're not gonna do that. I'm not gonna let you do that because you're a bad seed. You got to work at a pizza place because you're a counselor.\"",
            "start": 2675.68
        },
        {
            "text": "to death with a baseball bat. And his brother's like, \"We're not gonna do that. I'm not gonna let you do that because you're a bad seed. You got to work at a pizza place because you're a counselor.\" Instead now, uh, I will go with you back there to get your keys. He's like, uh, meanwhile, we jump back to, uh, Butch, who is the man in my world. All right. He is the man in this story for me. Okay. My Butch is the man. He's homeless. He's chilling with another homeless guy and they're just having a great time in the sewers cuz that's where they live. And then what happens, right? Boom. Face huggers. We got face huggers. One jumps on face. Face him. Face hug him. Face them. Face hug them. Face them. Face them. Face them. Face them. Uh, welcome to the podcast within the podcast. Face hug them or face [ __ ] them. Of course, if this is your first time here, welcome. I'm glad you came in. No need. I'll tell you what. I don't know where you're keyboard broken. You got to get out of this",
            "start": 2724.16
        },
        {
            "text": "them or face [ __ ] them. Of course, if this is your first time here, welcome. I'm glad you came in. No need. I'll tell you what. I don't know where you're keyboard broken. You got to get out of this podcast. What we do in this segment is decide for the face huggers in this movie. Did we like them and we want to face hug them or do we say they suck? Face [ __ ] them. Get out of here. You dropped your phone in between the center console and you're driving on the highway. You're like, I don't want to watch this anymore. Spotify, stop recommending this. Uh I I'm going to say [ __ ] them. And uh that's the one I don't like them, right? Yeah. I always get confused. Um so yeah, I don't like them. And it's a tough one for me because I it's not necessarily the face huggers here and I know that's what we're talking about. This scene though, which is their scene, I think is bad. I think that the way that they they idea of it of the homeless people in the under the sewers and stuff like that",
            "start": 2776.72
        },
        {
            "text": "what we're talking about. This scene though, which is their scene, I think is bad. I think that the way that they they idea of it of the homeless people in the under the sewers and stuff like that could be cool. It's not. The dog being there could be cool. It's not. when the xenomorph comes and and starts killing people. Like that was the first movie which is right here. That was the first part of this movie that I was like, \"This is horrible.\" Like this this is really really really bad. And because that was in the face hugger scene, I'm going to say [ __ ] him. I'm kind of with you. And it's a hug man. They kill the kid, they kill the dad, they crawl out, they're they burn the dude's arm off. And again, just to in a movie that looks bad, in a movie that's too dark, it was great when little Billy Joe Bob or whatever was sitting there hiding and he came up and it was like over the stump. That was [ __ ] cool. Don't forget also though, are we also including the fact that the PR alien is",
            "start": 2821.2
        },
        {
            "text": "Billy Joe Bob or whatever was sitting there hiding and he came up and it was like over the stump. That was [ __ ] cool. Don't forget also though, are we also including the fact that the PR alien is a face hugger cuz he he goes, \"Don't do that. Don't do that.\" into the ladies. Do that. Do you want to enact it on me? I think you get some of that birthday cake from yesterday. I just spit it down your gum. I was so [ __ ] It went on way too long. Eye contact, too. I Andy, I couldn't look away to cut cameras. There was seven more thrusts in there. Throat thrust than there needed to be. That's how it was. In the beginning of the movie, remember all of the little vials where the face huggers were in and that one face hugger gets up against a glass and it's like shooting its face hugger dick out at the glass. You know, it reminded me of like I remember doing that being in a hotel against the uh like a shower. Why do I with just like a glass like a shower and like you know sometimes you just",
            "start": 2861.04
        },
        {
            "text": "at the glass. You know, it reminded me of like I remember doing that being in a hotel against the uh like a shower. Why do I with just like a glass like a shower and like you know sometimes you just like it was like oh imagine like my dick was just against this. That's what it reminded me of like when the face hookers like spitting out at the glass. You're going to say you did that to I was with an ex-girlfriend at the time. Did you do it to her? I was just like Yeah. Here's my naked body. Got it. Okay. This is starting to make more sense. Yeah. I mean Yeah. I say f face hug them. I love these ones. These were good guys. Yeah, I don't like them. I I think just the fact that they are just everywhere. I'll give them a face hug. Oh, really? They just want to be How many are there? Who cares how all these aliens come back? Doesn't matter. And they basically just exist to get a couple soldiers out and then we get to you know, just pumping it into those ladies ties. That was so gross. Why",
            "start": 2910.32
        },
        {
            "text": "how all these aliens come back? Doesn't matter. And they basically just exist to get a couple soldiers out and then we get to you know, just pumping it into those ladies ties. That was so gross. Why do they need to be pregnant? Was that You know what I mean? Oh, we'll get to that cuz it popped out like 30 aliens. They need to be pregnant. We'll get to it. Well, they got a womb that's ready to get. We'll get to it. All right. was pregnant with quadruplets. All right, so that's going to be then a face. Uh, hug him. We liked him. Damn. Two to two. Yeah, but by Tim's old vote, remember that? Makes sense. Got to get a fight there. All right, moving on with your plot, everybody. It's a fun show today. I mean, we're having a great time. Um, so then, yeah. Okay. So, they get on the the homeless guys. Then we get to see uh the uh face uh the predator alien how dominant he is and how he's like pushing he's like he's working with the aliens that came from the baby from the boy and the dad or",
            "start": 2948.72
        },
        {
            "text": "guys. Then we get to see uh the uh face uh the predator alien how dominant he is and how he's like pushing he's like he's working with the aliens that came from the baby from the boy and the dad or whatever. He's like [ __ ] in charge of them. Like they tried to be scary for a second. He like push them. Get out of you [ __ ] [ __ ] I'm in charge whatever. Um it was I I'll say this P alien it just looked the head was too big. Too big. Like I I understand what they but I I don't know. It just it was too many elements of things going on. Like it it it looked more like a what a fan would do instead of like a professional [ __ ] concept artist. Yeah. Also difficult to be more menacing than the xenomorph as a from a design point of view. Very very difficult to do that because those are already very very scary. So you're like when they be put too many of those elements on screen together kind of this scene for me was a little goofy where it's like hey man my kill move over stupid. Yeah.",
            "start": 2995.84
        },
        {
            "text": "very very scary. So you're like when they be put too many of those elements on screen together kind of this scene for me was a little goofy where it's like hey man my kill move over stupid. Yeah. Yeah. Yeah. He's like, \"What are we doing here?\" Um, meanwhile, the Predator arrives. He goes to uh where his friend is dead. And this is in complete opposition to what I just said. This scene, I was like, \"This is kind of awesome. It's bad movie.\" Awesome. Realizes him, touches his helmet. He's like, \"Oh, my [ __ ] boys are dead. This [ __ ] sucks. But now I'm going to take all their weapons. I'm going to blow up the ship and walk away from the explosion.\" Stupid as hell. But I'm like, I'm I'm down for this tone more than what we've been getting. It's definitely one of those things where you watch it and you see your friend doing something and you want to be like, \"Hey, do it in the different different order so that it doesn't spoil the avocado before you make the like don't cut the avocado",
            "start": 3044.0
        },
        {
            "text": "it and you see your friend doing something and you want to be like, \"Hey, do it in the different different order so that it doesn't spoil the avocado before you make the like don't cut the avocado open before you make the eggs cuz then you get the avocado on the eggs going to be brown, right?\" This guy is barely barely collecting his friend's gun and he starts he just starts the [ __ ] nuke and I'm like, \"Bro, that's the last thing you should do is start the nuke.\" It played with it. I finished some [ __ ] Get more guns, dude. Avocado like analogy was perfect, but it's just so weird. I hit avocado earlier. I was good with you. You cut it too early. No. Well, I was Yeah, it was a little brown. Uh, all right. So, he blows up the ship, runs away from like talking about it. Then we jump to uh O'Brien, her kid, and Sam from True Blood. Uh, they're in this kid's room. Another pet. This is the least kid. This is the most This is somebody thinks I I put a [ __ ] drawing on the wall and it's a",
            "start": 3079.6
        },
        {
            "text": "O'Brien, her kid, and Sam from True Blood. Uh, they're in this kid's room. Another pet. This is the least kid. This is the most This is somebody thinks I I put a [ __ ] drawing on the wall and it's a kid's room. This could be a grandmother's guest room and I would give you that. This kid does not live in this room. Yeah. Back to these people don't feel like a family at all. Yeah. We have no tender moment with them. No moment. We have one moment where the kid's like, \"I don't really like my mom that much cuz she's been gone.\" Which is great. We're setting that up. You would think that there's a moment where she goes, \"Oh, I had a nightmare or whatever.\" And the mom comes back in. We have, I guess, we have a second she like, I want dad to read me the story or whatever. But we need that like little bit of reconciliation in the story before the action kickoff because then I just don't give a [ __ ] about this kid at all. In fact, the more you put a kid in in a horror movie like this, the",
            "start": 3124.56
        },
        {
            "text": "little bit of reconciliation in the story before the action kickoff because then I just don't give a [ __ ] about this kid at all. In fact, the more you put a kid in in a horror movie like this, the less I like the movie as it goes on. Part of me was like, \"This thing's going to kill this kid. It's going to be great.\" Beautiful. Beautiful. Nick got a few plot points in there. Yeah. She doesn't want mommy to read the story. Just daddy. Daddy says, \"Of course.\" Remember when mommy's been gone for like the 19 months she's been gone? Cuz she's like, \"You're so big. You know, we should probably You can tell her that you miss her or whatever.\" She's like, \"Oh, okay.\" Uh, from there we jump to the brothers who are now in the sewer. They're now in the sewers. And at first I'm like, \"You're right. They pop the thing open. Why didn't you do this? Well, I didn't want to be crawled down there and be covered in [ __ ] in front of Jesse.\" Uh, and I was like, \"Okay, but like then why are we looking",
            "start": 3157.84
        },
        {
            "text": "They pop the thing open. Why didn't you do this? Well, I didn't want to be crawled down there and be covered in [ __ ] in front of Jesse.\" Uh, and I was like, \"Okay, but like then why are we looking for keys?\" Oh, we're entering down the block. Okay. You again, it's a small town. We got Butch. We got na na his dog down there. Na ne, I forget his name. Whatever. My, we got Mussy. I understand that everyone in this town has been in these sewers, so I guess it makes sense for them. But for me, it would be a little bit hard for me to be like, \"Okay, it's up and around the corner, so I'll open this great and come down here. Hope they connect.\" Luckily, the addresses are spray painted. Is that a real sewer thing? I'm sure it is. I don't know. I never I never saw the Ninja Turtles deal. I've been in many like active sewers in my life, and I I was so distracted by that fact watching this where I'm just like, I would never do this. Like the car is gone. Yeah, I would have it reed somewhere.",
            "start": 3194.16
        },
        {
            "text": "in many like active sewers in my life, and I I was so distracted by that fact watching this where I'm just like, I would never do this. Like the car is gone. Yeah, I would have it reed somewhere. Have it reed, man. It's an old truck. This that was that was wild to me. And like then they end up being like the who's the girl? Like there has to be a girl. Why would you do this stuff? But even I'm like I don't know that Jesse's worth it, man. Like when they're sloshing their hands around in that stuff, I'm just like Jess was worth it. Jesse was pretty good looking. You know, if you were a high school kid and that girl was like mismatch bathing suit. Mismatch. That's true. You know what I mean? It's a mismatch. I just want to put Greg in that scene for a second where she's like, I don't know which one where. So, I wore both and Greg's like, Larry Davis. That's what you decide. Choice. That's what you decide. All right. And I think they also look like underwear. They don't look like Oh,",
            "start": 3234.88
        },
        {
            "text": "which one where. So, I wore both and Greg's like, Larry Davis. That's what you decide. Choice. That's what you decide. All right. And I think they also look like underwear. They don't look like Oh, this doesn't look like a nice I'd be like, \"Hey, remember when you like played a part in getting my ass beat?\" You know? Yeah. Lost the keys in my car. The rifle through [ __ ] Yeah. You'd be a little bit angry about that, right? hands still smell like Kiki. Uh instead though, yeah, like we said, they go in there, there's this, the rats are running out of it. Never a good sign. Uh also, there's a line there. They go down to the sewer and it's like, I can think of worse places. And it's like prison where prison. He came from prison. He's Dallas. He's tough. That's just like such bad dialogue. It's as bad as the sausage pizza [ __ ] Like, what do we do? You don't understand. They put him in a leather jacket for a reason. This guy's tough. He's seen some [ __ ] Now he's in it. True. Again,",
            "start": 3276.08
        },
        {
            "text": "It's as bad as the sausage pizza [ __ ] Like, what do we do? You don't understand. They put him in a leather jacket for a reason. This guy's tough. He's seen some [ __ ] Now he's in it. True. Again, we've covered all this. They eventually find the keys by reaching in the muck. The older brother wouldn't do it. Younger brother sees uh an alien newborn from the homeless people. Uh I missed it too at some point, right? Where the homeless people uh another homeless lady came in there and saw them down and she immediately got iced by a alien. Um they do that. They get the keys. All is well there. Uh, from there we're back to the search party that is combing the woods going, \"Buddy Benson, Billy Bob, we're looking for you.\" There's a moment, I don't think I don't remember if we passed it or not, but it's the the lady uh the mom of Buddy comes up to the cop. Yeah. And comes up to every But but there's a moment where she's she's putting the um flyers out. Yeah. And she tries to hand a flyer",
            "start": 3318.64
        },
        {
            "text": "but it's the the lady uh the mom of Buddy comes up to the cop. Yeah. And comes up to every But but there's a moment where she's she's putting the um flyers out. Yeah. And she tries to hand a flyer to people and they're like, \"Get the [ __ ] out of here later. I don't know who you are.\" Which is like That's later. But it's Yeah. It's And back to the whole thing of like small town. I was like, \"All right.\" Yeah. Which is weird to me. Yeah. Cuz I'm like, you just handed a flyer of your missing child and kid in this small town to two people and they don't know who you are. That's not a small town at that point, right? We're not that's that's a way to tell me that this town is not small enough. Yeah. Like Tahoe. If you were in Truckucky right now, everyone would [ __ ] know that Tim was missing. We we all everyone would know about it. We'd be obsessed with it. Yeah. And so they like, \"We're going to call it off for the night.\" And this where the mom has the conversation of just like, \"But",
            "start": 3362.0
        },
        {
            "text": "We we all everyone would know about it. We'd be obsessed with it. Yeah. And so they like, \"We're going to call it off for the night.\" And this where the mom has the conversation of just like, \"But he wouldn't do it. He wouldn't leave. if he wouldn't he would he they'd stay out here for me and it takes one more line from the cop of like go home you'll need your strength like all right and meanwhile the the cop's partner or whatever his [ __ ] name is going to keep searching for a little bit longer or whatever so he's off doing his thing as he goes through what does he [ __ ] find the [ __ ] predator right the predator's out there predator does the thing where he's covering up the bodies of the the people who the the buddy Benson and his son Billy Bob he uses the stuff that looks like uh bordello of blood tails from the [ __ ] bordello of blood is that right I mean that's not my touch for it my special is remember Beast Master remember that movie Mark Singer where they pour it on the",
            "start": 3397.84
        },
        {
            "text": "bordello of blood tails from the [ __ ] bordello of blood is that right I mean that's not my touch for it my special is remember Beast Master remember that movie Mark Singer where they pour it on the the king and the queen's neck and it paralyzes him from the waist down that always traumatized me when I was a kid the predator got on the other side of him so fast he's big uh the guy's like oh and then the thing walks off like hey don't look out for predators and buddy medicine and the predator [ __ ] now I like the way the cloaking looked right there sick where the predator like hears a noise turns around and and The eyes of the last thing. It's just it looked awesome. We've we've perfected it at this point. Yeah. Now we can we should be able to use this a little bit more liberally in those movies cuz it looks so cool. Uh again, uh he's dead. We don't know right away, but you you assume that, right? Uh we then jump to uh the next day at the diner cuz it's a small town. There's just one",
            "start": 3432.4
        },
        {
            "text": "movies cuz it looks so cool. Uh again, uh he's dead. We don't know right away, but you you assume that, right? Uh we then jump to uh the next day at the diner cuz it's a small town. There's just one place to eat. Um the cop comes in and sees the brother sitting there. Yeah. And comes and sits down with the brother and goes and like Cheryl or whatever her [ __ ] name is doing something else. He's like, \"Hey, Shock, can I get more coffee?\" And Sher's like, \"Oh, yeah. Come over.\" Oh, man. You guys went all night long. Yeah, we called it off about 2:00. She's like, \"What? The [ __ ] guy who just got iced by the predator, it turns out, is my lover and he never came home and he always comes home. I'm sure some He always calls. Oh my god, something's [ __ ] going on out there.\" We're like, \"Oh, that ain't good.\" You know what I mean? So, now they go back to the woods with another search party. They go there and what do they find? Stuff on the ground. They look up. Oh my god, it's Ray. The",
            "start": 3474.56
        },
        {
            "text": "that ain't good.\" You know what I mean? So, now they go back to the woods with another search party. They go there and what do they find? Stuff on the ground. They look up. Oh my god, it's Ray. The guy's name was Ray. I wrote it down here. He was skinned. He was skinned alive. Now, I don't want to question or or or call attention to how this this predator goes about doing his work, but if your whole [ __ ] job is to clean a scene, why would you clean the scene of one body and then leave other bodies that are up there? That's a warning. He's here to erase the aliens work, not him. So, he doesn't give a [ __ ] if they know he's alive. If they know he's alive. Yeah. It's not Predator versus human. It's very weird. This is a weird vibe for me because you would think you'd be like, I killed her and [ __ ] and then it's that cascading. Someone else sees I just think the predator thinking the whole time like ah they we cannot let them know that xenomorphs exist. However, me and my race",
            "start": 3512.08
        },
        {
            "text": "her and [ __ ] and then it's that cascading. Someone else sees I just think the predator thinking the whole time like ah they we cannot let them know that xenomorphs exist. However, me and my race totally fine. Yeah. Well, he's just going to assume he's not going to assume that it's oh, he'll think another hunter. I I all kidding aside, I'd read this as like once you've killed someone, he has to like he's like compelled to take a trophy of some sort, right? TL fam says old habit die hard. Yeah, I guess. He's just like, \"God damn it. Got to go back to the old me.\" Uh, this is Jesse sees Pizza Boy, waves him down. I was like, \"I I I fired him. Do you want to go swimming tonight?\" Like we And Pizza Boy is like, \"Like like we used to.\" So, they've got a relationship there that existed before this, which is interesting. Nick, will you bring me a napkin so I blow my nose? Can you come back? Thank you. Um, see you tonight for swimming or whatever. Wink wink. Uh, Predator melts the homeless",
            "start": 3553.36
        },
        {
            "text": "this, which is interesting. Nick, will you bring me a napkin so I blow my nose? Can you come back? Thank you. Um, see you tonight for swimming or whatever. Wink wink. Uh, Predator melts the homeless guys who were alien babies in the sewers. Uh, hated this. It looked so bad. And I I hated it because every other movie we see Predator in, like there it feels like there's an alien in a place that he's not used to. This feels like a man in a suit walking through water in the sewers. And it's like even just like a little bit of trying to understand the functions of where he is. And I don't know, there's something about this was like lazy as hell. They got history books. Yeah. Yeah. And they can see everything from their visors. They upload all the data when they go. How did his visor not see the alien on this on the ceiling? Get better visors, man. Yeah, exactly. That is the big problem with it. Um, okay. So, now the Predator is down there. He's deleted those bodies. Thanks, Andy. Tell",
            "start": 3596.32
        },
        {
            "text": "the alien on this on the ceiling? Get better visors, man. Yeah, exactly. That is the big problem with it. Um, okay. So, now the Predator is down there. He's deleted those bodies. Thanks, Andy. Tell everybody your favorite bagel. My favorite bagel? Um, let's see. Everything, man. Couldn't think of the word bagel that one time. Bagel. Even bagal. Uh, answer is egg. Thank you. Uh, oh, do you like egg, too? I love a good egg bagel. I'm going to tell Joey cuz she's going to have to add one more. It's just a color and a moistness. Of course, the the most pretentious of bagels. What? The egg bagel. Oh my god. The egg bagel is the children's bagel. It's my favorite bagel. Wow. I was in the minority over here. Okay. Uh maybe I got to try an egg bagel again. Predator sets up a million [ __ ] little things. Of course, they're going to turn out to be a trap, everybody. Yes, it is. It's a laser trap. He comes in, he like claps his hands. Uh all the aliens start coming and they just get nice by",
            "start": 3639.28
        },
        {
            "text": "things. Of course, they're going to turn out to be a trap, everybody. Yes, it is. It's a laser trap. He comes in, he like claps his hands. Uh all the aliens start coming and they just get nice by these lasers. But again, he's walk He walks right underneath one, man. Like, you're the ultimate hunting machine. He makes a mistake. How the [ __ ] But you know what you're dealing with. He wasn't in the proving ground. Yeah, but Andy, you're really good. You're really perceptive about stuff. Close your eyes right now. Is there a dog in this room right now? Oh, man. You don't know. Damn. What's But your visor like I know he's got technology. It pissed me off. Especially when you see it and it's super dark and he goes and they glow green like it's right there. But it's also I think it's I I was so impressed and blown away by the way the earlier movies the way the first two movies showcase that [ __ ] where enemy you know or protagonist in the foreground and the background you think it's just",
            "start": 3684.88
        },
        {
            "text": "impressed and blown away by the way the earlier movies the way the first two movies showcase that [ __ ] where enemy you know or protagonist in the foreground and the background you think it's just background noise and you see something moving you're like oh [ __ ] that was part oh man. And like when I saw it here I was like you didn't you don't deserve that. You don't deserve that thing. You don't deserve having this movie. You don't. That happens though. But then the alien and the Predator surface then, right? There's like a punch through the thing or whatever and there's a big hole in the I was like, \"Oh man, they're coming out like EA or whatever.\" And they get out there and Predator goes invisible, but he catches the alien scurrying over a truck and going that way. You're like, \"Okay, cool.\" Um, this is where we then go. Remember the woman whose lover Ry was uh [ __ ] skid alive? Her night's going to get worse. She's in the the restaurant on her friend Adena and she's like, \"Hey,",
            "start": 3730.48
        },
        {
            "text": "cool.\" Um, this is where we then go. Remember the woman whose lover Ry was uh [ __ ] skid alive? Her night's going to get worse. She's in the the restaurant on her friend Adena and she's like, \"Hey, Dena. Okay, I'm glad you're coming over tonight.\" She pregnant people in this town, by the way. Was she pregnant? I noticed. Yeah. Uh the I mean something in the water, you know what I mean? Uh the big old cook there is like, \"You could come stay with me and my wife.\" No, I'm going to go to Dena's. All right, that's great. Thanks. You're a lovely friend. Goodbye. She no sooner walks out the swinging doors and he goes, \"Ah.\" And she comes back in. There's an alien feasting on his [ __ ] body. Right. Then she tries to leave. Another alien's there. It like chases her, stomps her back. like, \"Oh, is she going to get out of this jam?\" No, she gets [ __ ] iced right away. Ma'am, ma'am, these aliens are just killing everybody. You know what I mean? Oh, god. We're not there yet. We're not there",
            "start": 3767.84
        },
        {
            "text": "is she going to get out of this jam?\" No, she gets [ __ ] iced right away. Ma'am, ma'am, these aliens are just killing everybody. You know what I mean? Oh, god. We're not there yet. We're not there yet. That was also really weird. Like, I didn't I Oh, that's why she's pregnant. And that's why he went for her because then she burst a bunch of babies. I think they show her stomach, too, and they're like, \"Oh, I missed that.\" It's like burst out. Oh, good call. I was so confused by this old man being like, \"Are you okay?\" Yeah. I was like, \"Are you coming out?\" He seemed creepy. Yeah. He's like, \"Why don't you come sleep with me and me and Betty tonight? Betty's been out of town for a couple days. We got a big bed. He was sleeping the bed with me. What is that? That sucked. I don't uh from there we then go. That sucked. It is swimming time as we were talking about. All right, this is where the mismatch bathing suit comes up. Huge turn off for me. You know what I mean? Huge turn off. Not",
            "start": 3805.76
        },
        {
            "text": "we then go. That sucked. It is swimming time as we were talking about. All right, this is where the mismatch bathing suit comes up. Huge turn off for me. You know what I mean? Huge turn off. Not a great one. Uh then I it might I might be merging them together, but yeah, Dale shows up with his friends and kicks the [ __ ] out of the guy again. Then they fight into the pool. Uh then for no reason really whatsoever other than they're combing this very small giant city. An alien walks in and then gets in the pool and chases them and grabs one of their friends and kills him and oh the power went out in the middle of this uh the alien the alien and the predator uh will go and fight at like an iron works facility or some [ __ ] Maybe it was the power plant. The power plant yeah alien gets uh impaled. Predator gets impaled like Joel in Last of Us, right? He gets up and does the whole healing eventually. Whatever. That's cool. Whatever. Uh, a little girl wakes up in the middle of the power",
            "start": 3838.48
        },
        {
            "text": "impaled. Predator gets impaled like Joel in Last of Us, right? He gets up and does the whole healing eventually. Whatever. That's cool. Whatever. Uh, a little girl wakes up in the middle of the power outage. My daddy and she wakes up, immediately puts on the night vision goggles, looks out the window, and then daddy has a monster. Look, he goes, \"Look, no, she's [ __ ] Sam's dead from true blood.\" Great. Yeah, I do like that. One of the teenagers like try, you know, they're all escaping through that window or whatever, and the one of them gets pulled back in. Yeah. Yeah. Blood splatter on the screen. If And if I'm the main guy, I'm like one less guy I got to deal with. Exactly. I like that a lot, too. Right. Uh when the power plant starts to go pungent sorry I'm hungry. The power plant starts to go and that's when they're gonna evacuate the town. So they're trying to get everybody out. So it's just anarchy, right? There's [ __ ] [ __ ] all over. Well, at this point and I think again I",
            "start": 3878.6
        },
        {
            "text": "to go and that's when they're gonna evacuate the town. So they're trying to get everybody out. So it's just anarchy, right? There's [ __ ] [ __ ] all over. Well, at this point and I think again I think we needed like a beat here where like something comes over the radio like hey there's something out there. The escalation here goes from it's a couple people have died to this town's being overrun by aliens and everyone's like we're just in. Todd's got to be. I'll tell you what I hated so much was the one guy going, \"We need we need like [ __ ] assistance now.\" The National Guard, his National Guard's coming in and he goes, \"That'll take too long.\" It's like, \"How do you know?\" Again, we have the sheriff, but then we already established we have a woman who's in the [ __ ] military, right? She should have been the one making these calls. Like, hey, I've seen these things. We can't handle this. Call the But she's just kind They just kind of like, \"You're okay. Just go over there for now.",
            "start": 3921.6
        },
        {
            "text": "should have been the one making these calls. Like, hey, I've seen these things. We can't handle this. Call the But she's just kind They just kind of like, \"You're okay. Just go over there for now. We need you to eventually fly a helicopter. Yeah. Um, the Predator does the first aid thing which I [ __ ] love a lot. That's really cool. Call back to, you know, we did it against Schwarzenegger and all that jazz. Um, they go to a gun shop. Our new group of young people who have met up with other people. I forget if we've met the mom and the kid at this point. There's a great line in here. You're too you're too you're too stupid to talk, Dale. Like, yeah, tell Dale [ __ ] we hate him. Stupid Dale. National Guard does show up. Hey, good news, everybody. National Guard gets owned by all the [ __ ] aliens. again. Very uh Return of the Living Dead 10 more paramedics and like great movie. Um this is when we go we're in the hospital where you know they go to the hospital which makes sense cuz",
            "start": 3961.04
        },
        {
            "text": "aliens. again. Very uh Return of the Living Dead 10 more paramedics and like great movie. Um this is when we go we're in the hospital where you know they go to the hospital which makes sense cuz people are getting [ __ ] up but then the PR alien knew to go to the hospital right and he's just stomping [ __ ] around there or whatever. And then like we get the scene of him looking in on all the babies in the nursery. It's pretty good. Is he about to eat all the [ __ ] babies? Holy [ __ ] Or they show they cut away that be insane. They go instead to, \"Oh, now this woman's about to give birth. She's here. She's doing the whole thing or whatever.\" She's like, \"Is the power on?\" They're like, \"Ah, the backups are fine.\" Oh, no. My water just broke. And then, well, now you got a bigger [ __ ] problem. Cuz as I say, what the [ __ ] The Predien pump [ __ ] in a pregnant lady. Just throating. Like a cat throwing up. You know what I mean? And just send all seen her esophagus like, \"Fuck, man.\"",
            "start": 3997.44
        },
        {
            "text": "Cuz as I say, what the [ __ ] The Predien pump [ __ ] in a pregnant lady. Just throating. Like a cat throwing up. You know what I mean? And just send all seen her esophagus like, \"Fuck, man.\" And then all the other pregnant lady who are stacked up are screaming over there, too. Yeah, cuz they know it's coming. Horrifying. They know it's coming. But I didn't I I still don't understand. And they're all strapped to their beds for some reason. None of them can run away. I I still don't understand cuz like the typical Colorado pregnancy. They got to have it. So So face huggers are like one and done, right? They lay they give an egg and they take give a penny, take a penny. It's like a bee, right? They circle of life. So predalen can just pump until the [ __ ] cows come. Pred is a Yeah, it's a hybrid queen and be I don't know. May there it's not really ever explained. This was a big issue people had with the film. They were like, \"This is really kind of stupid that it can just keep pumping",
            "start": 4036.0
        },
        {
            "text": "hybrid queen and be I don't know. May there it's not really ever explained. This was a big issue people had with the film. They were like, \"This is really kind of stupid that it can just keep pumping in [ __ ] aliens to all these people cuz they burst out of her belly and they come out like a litter of puppies. So many in there.\" You know what I mean? Meanwhile, the one little [ __ ] kid's like, \"Excuse me, I was here.\" The kids like, \"Ah, trying to act like he's a They raise him as his own. Like they know he's not an alien, but they're like, \"We'll treat you. You've been with us since birth.\" It's like that one little boy in Avatar, too. The little Na'vi kid. Uh, the Predator arrives at the gun shop. Uh, there's a bunch of [ __ ] kills happening here. He uses the one guy's bait to get an alien. Uh, I tell you what I hate right here. Are you guys stoned? I hate these dudes where their heads get blown off, right? I hate these dudes walking up to the gun case and be like, \"We need",
            "start": 4079.44
        },
        {
            "text": "an alien. Uh, I tell you what I hate right here. Are you guys stoned? I hate these dudes where their heads get blown off, right? I hate these dudes walking up to the gun case and be like, \"We need weapons, right?\" And they just grab shotguns and throwing them like they're in the It's like, you don't [ __ ] handle Colorado. They hunt all the time. You miss they miss it though. Like they walk in and everyone's like, \"Fuck, where are the guns in this place?\" And the lady's like, \"I know where they are.\" And they walk three feet over to the back wall where all the guns are displayed in plain sight for anyone that could have possibly been in there. I'm like, \"God damn it, this movie sucks.\" Um, actually, I'm sorry, Greg. We got to ask you this, too. Do you at some point get turned on by the the pregnant alien thing? Yeah. No, that's not where I was going to go with it. I'm sorry. Have you ever like doom fantasized about having to go like break into a gun store to like raid the guns? Of",
            "start": 4119.44
        },
        {
            "text": "the pregnant alien thing? Yeah. No, that's not where I was going to go with it. I'm sorry. Have you ever like doom fantasized about having to go like break into a gun store to like raid the guns? Of course. Doom fantasized. This is just a fantasy. I mean, that's like that's like a go. That's the number one podcast topic that's ever been talked about. I just mean like you're like what would you go for first? What would I augur or the [ __ ] the badass like 12? I'll go for a famas. I want handguns. H I have to learn how to use a handgun, too, but it's no big deal. Uh Dale gets melted. The mom has the alien litters. Uh they call the colonel, who clearly isn't a colonel because of the way they frame it of just his mouth here. Again, very much Return of the Living Dead. Just I was expecting him to scroll up and him to have like an alien nose or something like I didn't know what they were trying to show. The fact a lot of noses get blown off in this too. Oh yeah. The way they shoot a lot of",
            "start": 4160.4
        },
        {
            "text": "to scroll up and him to have like an alien nose or something like I didn't know what they were trying to show. The fact a lot of noses get blown off in this too. Oh yeah. The way they shoot a lot of the like people head shots is their nose goes away first like to a distressing amount. Um this I think I read a piece of that said it was supposed to be Adam Baldwin from Predator 2. Uh but they just couldn't get him for some reason. What he maybe he was doing Firefly at the time. I'm not sure. But like he had some scheduling issues. Yeah, they he was going to be like a colonel now and leading this group of people like that. Too bad that didn't happen. Uh Predator decides to take all the Predator shoulder cannon [ __ ] off and make a gun. This was a plot point that I found interesting. Like a shotgun just goes and makes a gun out of all his other guns. Like okay do something that wasn't just kill modular. Yeah. Uh anyways, then this is where I a whole bunch of [ __ ] happens here. I wrote",
            "start": 4202.64
        },
        {
            "text": "shotgun just goes and makes a gun out of all his other guns. Like okay do something that wasn't just kill modular. Yeah. Uh anyways, then this is where I a whole bunch of [ __ ] happens here. I wrote Jesse is impaled by the Predator Glaive. Ricky shoots at the Predator. The Predator uh tackles uh or the Pred alien tackles the Predator into an elevator shaft. Ricky picks up the Predator's gun and the alien stabs him with his tail like an obscene crazy all of a sudden like what is going on thing. And it's like cool Jesse just died which was unexpected I thought. And then I was like well now Jess uh Ricky's dead too. No Ricky's just wounded and we'll need medical attention eventually. And it was an arid one too. It was just like that, you know, [ __ ] Predator threw him at the aliens and they get sliced up. You're like, \"Oh, that's cool.\" And she just said, \"Was it the crossfire?\" I mean, we're just we're just collateral damage. I like um they played around with scale here a little bit",
            "start": 4240.16
        },
        {
            "text": "get sliced up. You're like, \"Oh, that's cool.\" And she just said, \"Was it the crossfire?\" I mean, we're just we're just collateral damage. I like um they played around with scale here a little bit cuz when the when the Predator is holding the clave, it doesn't look that big. When it pins her to the wall, it looks the size of like a bicycle tire. So, I was like, that's a [ __ ] great visual effect. Uh we get another shot of the colonel and he's like, \"God, help us all.\" And this guy, man, just like, are you evil or not? Could we Could we not have like paid someone's day rate, someone notable to play this guy? This guy is just so generic and has zero screen presence or command. We're making it to the chopper, right? Cuz we've done the whole thing of we have to divide in half. Where are we going? Get to the chopper line. Go [ __ ] yourself. Get to the chopper. At least they didn't do the ugly [ __ ] like one more time. Yeah. Uh Big Bro has a standoff with the Predator weapon. He",
            "start": 4284.32
        },
        {
            "text": "are we going? Get to the chopper line. Go [ __ ] yourself. Get to the chopper. At least they didn't do the ugly [ __ ] like one more time. Yeah. Uh Big Bro has a standoff with the Predator weapon. He eventually does make it to the chopper. Uh he gets no uh acid fall on him. Yeah. Yeah. I hate that [ __ ] Alien looks right over him. He just blasts him with that thing and like Yeah. No acid on. I don't think he I don't think we even he gets hit with the acid at all on this, right? Yeah. It was in his contract. And if it I'll do I'll do this movie, but I'm not getting any acid on me. I'm not getting acid on me again. She gave me pink eye last time. Oh, the Predator then strips down to fight the PR alien cuz this needs to be mono emano. You know what I mean? dumb. This should have been cool, but it's like why? They brawl for a while. Eventually, he tears off the Pred alien's tongue and then stabs him in the tongue or the head, but then the PR alien whips his tail around and stabs him. So,",
            "start": 4322.72
        },
        {
            "text": "it's like why? They brawl for a while. Eventually, he tears off the Pred alien's tongue and then stabs him in the tongue or the head, but then the PR alien whips his tail around and stabs him. So, they both die there, which of course leads us to our segment. Please hit the song. No, no, no, no, no. This one. This one. It's always this one. They need the award show music. Oh, yeah. I forgot about this. [Laughter] I don't have the instrumentation for this. You're killing it. You're killing it. This is perfect. Everyone, welcome back to the Chris Hansen Award. Of course, this is the award given out for every time we catch a Predator. Uh, this would be the only Predator in the film. Why? You know, there was whatever the guy's in the front. We're not counting that. The main Predator. This is AP Reququiam's Chris Hansen Award to the Predator Impaled by a tail. We won't forget your sacrifices. I think we will a couple movies from now. Uh they get out of there, but this the town gets bombed.",
            "start": 4366.96
        },
        {
            "text": "Reququiam's Chris Hansen Award to the Predator Impaled by a tail. We won't forget your sacrifices. I think we will a couple movies from now. Uh they get out of there, but this the town gets bombed. There's all, you know, the hell breaks loose in the helicopter like but they land it. Uh and then they're surrounded by mil the Marines or whatever who are like and like you [ __ ] suck. You blew up the town like we were just following orders and then just just this is baffling. Just a left turn like mommy are the monsters gone. Yeah. And then she looks to the sky cuz she knows man nothing's ever gone. There's uh deleted scenes that are alternate endings and the military just kills Maul right there. Yeah, as it should have been. Yeah, that Yeah, very much. I think that's that would have been better. Yeah, thousand%. Uh instead though, we then get a a a stinger, not a post credits, but I'm putting calling a stinger. Uh where the Predator's homemade gun uh has been retrieved from uh the",
            "start": 4409.92
        },
        {
            "text": "better. Yeah, thousand%. Uh instead though, we then get a a a stinger, not a post credits, but I'm putting calling a stinger. Uh where the Predator's homemade gun uh has been retrieved from uh the brother whom probably dropped it. I forgot. Uh and it is given to Utani, of course, the other half of Whan Utani. Again proving once again these are canonical. The for whatever reason this scene reminded me of X-Men Origins Wolverine. I don't know why. It just has that vibe of like, wow, we really missed the mark on this scene. It's just really so [ __ ] weird. It's like, oh sequel. I don't want a sequel. Yeah, I don't want it. I don't want it. Yeah, it's kind of the opposite of AP's end where AP ended. My I want to say Ragu Bagu. What's up everybody? Welcome back to the podcast within a podcast that started it all. Rad guys talk bad guys aka Ragu Bagu AP where we rank all the villains of the AP universe. Currently our list looks like this. Number one is the aliens and the Burke and the",
            "start": 4458.0
        },
        {
            "text": "that started it all. Rad guys talk bad guys aka Ragu Bagu AP where we rank all the villains of the AP universe. Currently our list looks like this. Number one is the aliens and the Burke and the queen from Aliens. Number two is the Predator from Predator. Number three is the Xenomorph, the face hugger and Ash from Alien. Number four are the aliens face hugger and the bug bad queen. I probably meant big bad queen from Alien versus Predator. Number five is Predator, King Willie and Gary Buucy in Predator 2. Number six is the baby queen and the military in Alien Resurrection. And number seven is 20th Century Fox/ the alien in Alien 3. Where do we want to put the PR alien and his minions? Dang, man. This is either last or second to last. Yeah. And I'm gonna say second to last because I really really hated the one from three. Mhm. Whereas this I'm just like it's just so nothing like I don't have thoughts. See, here's my thing is I would put it dead last because this one had the most like",
            "start": 4510.16
        },
        {
            "text": "really hated the one from three. Mhm. Whereas this I'm just like it's just so nothing like I don't have thoughts. See, here's my thing is I would put it dead last because this one had the most like whoa this what a cool idea. Especially if we would have watched AP and it would have been like hey this thing hatched and the next movie is about him [ __ ] [ __ ] up. Oh [ __ ] Okay, that sounds awesome. Oh yeah. Oh, and he can [ __ ] he can impregnate people. Like the the the idea that they fumbled that that like this mixture of Predator alien and like when it is visible on screen, no matter how dark or bright it is. Yeah. It just doesn't look cool. No. And I wanted it to look cool. Yeah. That's another one why I put it last. Yeah. I just really don't like Alien 3. Second to last for me. What do you want to say? Last. I'm saying last. Uh I will go second to last with Tim. Okay. Looks like we win. No, I learned a great How did we rank movies before? No one knows. It doesn't make any sense",
            "start": 4557.04
        },
        {
            "text": "do you want to say? Last. I'm saying last. Uh I will go second to last with Tim. Okay. Looks like we win. No, I learned a great How did we rank movies before? No one knows. It doesn't make any sense how it goes. A welcome to Alien versus Predator Preferred Partner, where we rank our preferred partner in the Alien versus Predator movie we happen to be watching. It's not a rank list. It goes like this, though. In Alien, it was Jonesy. In Aliens, it was N. In Predator, it was Mac. In Predator 2, it was Danny Boy. In Alien 3, it was Charles S. Dutton. In Alien Resurrection, it was Winona Ryder. In AP, it was Alexa. In AP Reququum, who's our preferred partner? I mean, I'm going Jesse. I'm gonna remember her death forever. Yeah, Tim's not really. You know what I mean? It's like she seems to be the only character in this movie at all. You take out Jesse, this whole movie crumbles. It falls apart. I mean, she is the lynch pin to it. Yeah. Okay. I'm not I will Okay, I will say Jesse 90%. What",
            "start": 4599.84
        },
        {
            "text": "the only character in this movie at all. You take out Jesse, this whole movie crumbles. It falls apart. I mean, she is the lynch pin to it. Yeah. Okay. I'm not I will Okay, I will say Jesse 90%. What about Mugsy Mugsy or whatever the mudsy? I'll give you 90% Jesse, 10% Mutsy Mutsy. Thank you. man's best friend. [Music] AP Tim, explain to me how to vote after this. Uh, the rankings for Alien and Predator movies have now been updated. But Kevin, before you put it out there, I want to say where all of our rankings are. I love this. All right. for Alien versus Predator Reququum. Both me and Nick have it second to last with only Alien 3 behind it. Andy Cortez has it dead last. Greg Miller. No. Number one has it at number four. What? Let me throw before we throw up the final one. I'm trying to find the thing I sent to Tim. It's always so hard. Greg has predator then alien then aliens then and then I feel like once we get out of aliens thank you very much you get into all right we these",
            "start": 4661.12
        },
        {
            "text": "to find the thing I sent to Tim. It's always so hard. Greg has predator then alien then aliens then and then I feel like once we get out of aliens thank you very much you get into all right we these aren't good movies we don't like these movies or whatever and out of the ones we've watched so far my personal ranking yeah I put AP recreum followed by AP followed by Alien Resurrection followed by Predator 2 followed by Aliens 3 Alien 3 like I I mean again it's like what we talk about like the stratas of the MCU list where it's like I'm not arguing that this is a good movie by any stretch of the imagination. This was the most enjoyable of the bad movies we've watched. Again, I didn't hate this movie, but um you and I both put it above Alien 3. I did. Which is interesting. Why did you put it above Alien 3? I really don't like Alien 3. Like I think Alien 3 is like they they [ __ ] up the best thing going. Like they had Alien and then Aliens and then they do that. Like uh I really do. So",
            "start": 4728.4
        },
        {
            "text": "above Alien 3? I really don't like Alien 3. Like I think Alien 3 is like they they [ __ ] up the best thing going. Like they had Alien and then Aliens and then they do that. Like uh I really do. So you're doing the insult to injury argument, but also I hated that movie. Like I like the being in the same hallways over and over, the plans that they had for that movie, the like weird Planet of Criminals and stuff like I just feel it was so overproduced and undercooked. Agreed. And yeah, it just didn't didn't work for me. Whereas this is like it's action figures fighting and it just was a pretty bad version of that. But from a mid2000s horror slasher small town thing, I'm like I appreciate what they did here. I don't appreciate it. I take that back. I didn't hate what they did here. You didn't hate it as much as Alien 3. Yeah. Yeah. Like I actively dislike alien and this is scary place for me to be because in the chat that's right Greg is right says snowike Mike and I go uh oh but then a",
            "start": 4773.44
        },
        {
            "text": "hate it as much as Alien 3. Yeah. Yeah. Like I actively dislike alien and this is scary place for me to be because in the chat that's right Greg is right says snowike Mike and I go uh oh but then a text from me goes me handshaking you AVP ranking that's Chris Anka so it's like I got the angel and the devil on my shoulder here you know how it goes sometimesy you have a dead last yeah I I just I I found no joy in this at all I I really didn't it bummed me the hell out because I had already gotten to the point mentally where I thought to myself, okay, I am past the point of expecting good. Now I just hope I get like silly bad. And this just I don't know, man. The last one did that for me. This one was just not there. The last one had cooler moments with cooler shots between these things fighting. And here it's like the two things that you came here to see, you can barely see any of it anyway. Yeah. Just so the rankings are now for us overall. Number one, aliens. Number two, Predator.",
            "start": 4814.48
        },
        {
            "text": "And here it's like the two things that you came here to see, you can barely see any of it anyway. Yeah. Just so the rankings are now for us overall. Number one, aliens. Number two, Predator. Number three, Alien. Number four, AVP, Alien versus Predator. Number five, Predator 2. Number six, Alien Resurrection. Number seven, AP Alien versus Predator Requum. And number eight, Alien 3. Next week, we are doing Predators. Adding a little plural to that one for the first. Who's in this one? Which one? Sorry, the right one. Is this the one you might be Adrian Brody? Adrian Brody. Oh, so everyone doesn't watch the wrong one. I also just before we leave I want to just throw a you if anyone knows the Strauss brother Strauss maybe check in on them a little bit cuz I'm looking at the what they're doing now and they did skyline then they did Skylines and then I'm looking at hydraulics which is their their the visual effects company and all the links are broken and then I went to their official",
            "start": 4864.08
        },
        {
            "text": "doing now and they did skyline then they did Skylines and then I'm looking at hydraulics which is their their the visual effects company and all the links are broken and then I went to their official website and this is what it looks like. Oh no. Oh Maha 4D they got real hacked. That's hacked. That's I have never seen something look quite like I'm pretty sure I have a virus now. You might. Oh, well everyone, that was Alien versus Predator in review for this week. Next week, Predators, get hyped. Watch that. We don't have too many more of these to go. Hopefully, they get good again. And I will impregnate you with my mouth. I'll put the babies in your belly with my mouth. And can watch or he can cry and watch. I don't care. I don't care. From both sides.",
            "start": 4908.16
        }
    ]
}