{
    "id": 13846,
    "video_id": "oqC9XBDluaY",
    "show_name": "Highlights",
    "hosts": [
        "Greg Miller",
        "Blessing Adeoye Jr."
    ],
    "title": "Ghost of Yōtei Seems AWESOME!",
    "description": "From KFGD: https://www.youtube.com/watch?v=oeCbBRNvqkY Wishlist Lost Skies today: https://kindafunny.com/lostskies\nWishlist Monaco 2 today:\nhttp://kindafunny.com/monaco2\nGo to http://rocketmoney.com/kindafunny to cancel your unwanted subscriptions with Rocket Money.\n\nFOLLOW US ON EVERYWHERE!\n---------------------------------------------------  \nYouTube: Youtube.com/KindaFunnyGames\nTwitch: https://www.twitch.tv/kindafunnygames\nPatreon: https://www.patreon.com/kindafunny/\nTwitter: https://twitter.com/KindaFunnyVids\nInstagram: https://www.instagram.com/kindafunnyvids/\nTikTok:  https://www.tiktok.com/@kindafunnygames?lang=en",
    "published_at": 1743460206,
    "duration": 966,
    "transcript_chunks": [
        {
            "text": "And we're back. Number two on the roper report. PlayStation 5 exclusive Ghost of Yote gets new story info commits to 2025 release date. Man, have you heard this story before? This is Wesley Yinpool at IGN.com and the super chat question begins. Are you more excited for GTA 6 or Ghost of Yotay? Tell me why. Uh, back to Wesley. Uh, we haven't heard much about Ghost of Yotay in recent months, but after fans spotted a morsel of new story information published to the game's website, they're having fun speculating about how Sucker Punch's hotly anticipated PlayStation 5 exclusive will actually play. The official website includes the following story snippet. 300 years after the events of Ghost of Tsushima, a new warrior, Atsu, arises from the ashes of her homestead. Filled with fury and determination, Atsu will hunt down those responsible for the death of her family and exact her revenge. Every odd job and bounty will provide the coin she needs for her journey. But how she fights, survives,",
            "start": 0.32
        },
        {
            "text": "Atsu will hunt down those responsible for the death of her family and exact her revenge. Every odd job and bounty will provide the coin she needs for her journey. But how she fights, survives, and evolves the legend of the ghost will be up to you.\" End quote. We already knew Ghost of Yote is setting uh is and the time period and that Atsu will be on a revenge mission of some kind. But what we didn't know was that she's hunting down those responsible for the death of her family after her homestead is destroyed. Fans speculating that Ghost of Yotay will have bounty hunting mechanic in which Atsu takes on jobs to earn money needed for other things in the game. There's the potential here then for an actual in-game economy where Sushima didn't really have any sort of money mechanic. If true, this taps into Sucker Punch's stated goal of giving players more control over Atsu's story. Creative director Jason Connell has said that one of the changes compared to Ghost of Tsushima will be a less",
            "start": 49.52
        },
        {
            "text": "taps into Sucker Punch's stated goal of giving players more control over Atsu's story. Creative director Jason Connell has said that one of the changes compared to Ghost of Tsushima will be a less repetitive open world. Quote, \"One challenge that comes with making an open world game is the repetitive nature of doing the same thing over again. We wanted to balance against uh that and find unique experiences end quotes end quote.\" Elsewhere, the website retreads old ground, mentioning new weapon types, quote, \"massive uh sight lines that let you look far across the environment, skies of twinkling stars and auroras, and vegetation that sways believably in the wind.\" End quote. And enhanced performance and visuals on the PlayStation 5 Pro. And here's the crucial part. The website lists 2025 as the release window for Ghost of Yote. There's been much talk about Sony may be waiting for Rockstar to announce GTA 6's release date so it can make sure Ghost of Yote doesn't clash. GTA 6 is",
            "start": 94.48
        },
        {
            "text": "2025 as the release window for Ghost of Yote. There's been much talk about Sony may be waiting for Rockstar to announce GTA 6's release date so it can make sure Ghost of Yote doesn't clash. GTA 6 is currently set for a vague fall 2025 launch, but some are wondering if parent company Take 2 will delay the game into the winter or potentially beyond beyond. Uh, with that in mind, perhaps Ghost of Yote will release this summer. Blessing, Adoay Jr. Greg Miller, are you more excited for GTA 6 or Ghost of Yote? Who do you think would win in a battle between a hydrogen bomb and a coughing baby? GTA 6. But also like I don't know, it's a tough thing where I'm excited for all these games, right? Whether it be 3D Mario, Goiote, like GTA, whatever it is, like these all speak to me. Um, and like honestly, I'm down for whatever shuffle of them come out this year versus next year. I'm with Huber as far as like man, I'm I'd actually be excited if something got delayed to next year because then I'll",
            "start": 137.92
        },
        {
            "text": "I'm down for whatever shuffle of them come out this year versus next year. I'm with Huber as far as like man, I'm I'd actually be excited if something got delayed to next year because then I'll just play next year, right? was excited, but like I would be down for GTA 6 to move into next year or Ghost of Yote for that matter to move into next year cuz I feel like the rest of 2025 is already going to be busy with different things happening, right? We got Metal Gear Solid Delta coming out in August. We got Hell's Us coming out later in the year, right? We got Borderlands 4. Like there's so many game excited for Borderlands 4. I'm excited, but I mean you're going to play it. Of course excited for Borderlands. You're getting into like Here's You know what? That's fair. I Borderlands 4 right now has not diff differentiated itself from Borderlands 3 where like Borderlands 3 I ate so much of and had so much and played all the DLCs to where I'm just like all right like I don't I'm not I for",
            "start": 188.0
        },
        {
            "text": "now has not diff differentiated itself from Borderlands 3 where like Borderlands 3 I ate so much of and had so much and played all the DLCs to where I'm just like all right like I don't I'm not I for between Borderlands 2 and 3 I had so much time to anticipate and now here I am like all right well I think the problem with Borderlands 4 is that it's not releasing right now because I think right now is a much better hey here's the thing and guess what it's out in two months. Yeah, exactly right. And I think right now is one of those times where I can kind of look around a little bit and be like, \"All right, what do I want to play?\" And I think right now for a AAA game that is going to be about people putting time into it and it being that game that is, all right, I got I got nothing else to play. Let me put on some Borderlands 4 and just shoot [ __ ] right? Loot [ __ ] Um, that I think would work in the same way that Outr Rididers worked a few years ago, right, where it came out the",
            "start": 226.88
        },
        {
            "text": "to play. Let me put on some Borderlands 4 and just shoot [ __ ] right? Loot [ __ ] Um, that I think would work in the same way that Outr Rididers worked a few years ago, right, where it came out the right place, the right time. That's a great point. I think it coming out in the fall, I'm a little bit like, all right, like it's it's crowded. It's Borderlands and Borderlands has the the IP power and the name recognition and all all that stuff. But if it comes out alongside whatever Nintendo and whatever like Ghost of Yote and whatever like these big companies have going on, they're not going to release it alongside GTA 6. This is an interesting even keeping Borderlands in the conversation. For me, I'm saying right away like for me to get hype about Borderlands 4, I'm going to need a Vault Hunter I really like. I feel like Borderlands 3, I never loved any of the Vault Hunters I was able to play as. That was just never my thing, right? I I did uh the [ __ ] the robot guy, whatever his",
            "start": 266.64
        },
        {
            "text": "Hunter I really like. I feel like Borderlands 3, I never loved any of the Vault Hunters I was able to play as. That was just never my thing, right? I I did uh the [ __ ] the robot guy, whatever his name was. Uh it doesn't matter. He was cool. He was cool. Yeah. Right. He was fine, but it was like whatever. So like I think for a four I need a character I look at, oh I want to be that kind of like in pre-sequel. Yeah. Pre-sequel where I could be like the Wonder Woman clone with the shield and stuff. That was great. What I'm saying though and where I'm going with this conversation is I think I'm more excited for Ghost of Yotay than I am GTA 6. Not because I don't love GTA, not because I'm not excited for GTA 6, just because they're giving me something. I understand what the game of Yot is going to be. Obviously, I love Erica Isishi. Like, I'm ready to get in there. I'm ready to play this. I I know. Like, I look at this, I'm like, \"Yes, I can see me doing this.\" And especially personally",
            "start": 302.96
        },
        {
            "text": "to be. Obviously, I love Erica Isishi. Like, I'm ready to get in there. I'm ready to play this. I I know. Like, I look at this, I'm like, \"Yes, I can see me doing this.\" And especially personally being disappointed with Assassin's Creed Shadows, this I expect to hit on all the levels Sushima did and hopefully exceed that, right? And I look at that, I'm like, \"Yeah, I want all of that. The monetary system sounds interesting.\" Whereas GTA 6 is more GTA, better looking GTA, better systems, da da da da. But until I'm really seeing what that game is and what my moment to moment gameplay is going to be, it's like, okay, well, I've done GTA a lot. This episode's brought to you by Lost Skies. What would you do if you woke up and the world around you was now floating high in the clouds? Lost Skies is the new openw world survival like that puts the power of exploration and choice in your hands. Use the physics-based grappling hook, glider, and your own custom airship to traverse the remains of",
            "start": 339.04
        },
        {
            "text": "is the new openw world survival like that puts the power of exploration and choice in your hands. Use the physics-based grappling hook, glider, and your own custom airship to traverse the remains of this fractured world and uncover its mysteries. You and up to five friends will harness the power of ancient technology to survive the hostile islands that scatter the horizon and the threats that lurk in the sky itself. The battles are intense, so it's up to you to build a sky ship to shelter you in fierce storms and take the battle to gigantic monsters. Want to take a break from fighting in the skies? Use the intuitive island creator and share your builds with the community. Head over to Steam and Wishlist Lost Skies today and discover what's lurking beyond the horizon. This episode's brought to you by Monaco 2. Gather your crew, plan your heist, and let the chaos unfold in Monaco 2. Return to Monaco, a city teameming with excellent scores and gullible marks right for getting parted from",
            "start": 378.64
        },
        {
            "text": "to you by Monaco 2. Gather your crew, plan your heist, and let the chaos unfold in Monaco 2. Return to Monaco, a city teameming with excellent scores and gullible marks right for getting parted from their prized possessions. Go it alone or tackle heist as a team of four with online and local co-op. Just remember, even the best laid plans can blow up in your face, so you'll have to stay on your toes. Monaco 2 is the sequel to the cult classic Monaco. What's yours is mine that expands on every aspect of the game. New characters bring unique abilities and play styles to help you escape the heat. And with new modes and procedurally generated levels, every run is full of surprises. The heist is on when Monaco 2 arrives on Steam, Xbox, and PlayStation on April 10th. Y'all know how important it is to wishlist these games. It helps the developers so much. So, please wishlist Lost Skies and Monaco 2. This episode is brought to you by Rocket Money. You sign up for something, forget about it",
            "start": 422.0
        },
        {
            "text": "it is to wishlist these games. It helps the developers so much. So, please wishlist Lost Skies and Monaco 2. This episode is brought to you by Rocket Money. You sign up for something, forget about it after the trial period ends, and then you're charged month after month after month. The subscriptions are there, but you're not using them. In fact, 85% of people have at least one paid subscription going unused each month. Thanks to Rocket Money, you can see all of your subscriptions in one place and cancel the ones you're not using anymore and save more money. Rocket Money has helped multiple members of Kind of Funny learn that they're still paying for things they totally didn't even realize. You know who I'm talking about. Rocket Money is a personal finance app that helps find and cancel your unwanted subscriptions, monitors your spending, and helps lower your bills so you can grow your savings. Rocket Money has over 5 million users and has saved a total of 500 million in canceled",
            "start": 470.88
        },
        {
            "text": "your unwanted subscriptions, monitors your spending, and helps lower your bills so you can grow your savings. Rocket Money has over 5 million users and has saved a total of 500 million in canceled subscriptions, saving members up to $740 a year when using all the apps premium features. Cancel your unwanted subscriptions and reach your financial goals faster with RocketMoney. Go to rocketmoney.com/kindfunn today. That's rocketmoney.com/kindaffoney. I think right now in the marketing cycle for both these games, Ghost of Yote, I think just feels more tangible and feasible and we're getting bits about it, right, that I think is important. Again, like, yeah, them talking about this being more of a revenge tale. I'm always down for a revenge tale. Them talking about how they, you know, they want to tackle that repetition and figure out how to not make it as repetitive as open worlds tend to be, I'm down with that. Even though every open world at some point is going to get repetitive, but",
            "start": 515.12
        },
        {
            "text": "to tackle that repetition and figure out how to not make it as repetitive as open worlds tend to be, I'm down with that. Even though every open world at some point is going to get repetitive, but like I look at games like uh like Zelda, Tears of the Kingdom or Elder Ring as far as all right, we have repetition, but how do we even make those repetitive things feel special in every iteration? And I think both those games are great examples. I think Ghost of Tsushima already, even with within its repetition, was already still fun. I liked the things that I was doing. So, if it is the thing of all right, we're taking what worked with Ghost of Sushima and just building in more excitement from the moment to moment, finding the next I was going to say tower. Go Sushima. I don't think it had towers, right? But like finding whatever that thing is, the next sauna, the next sauna, right? And like figuring out how how are we going to twist it this time to make it a thing that is a unique",
            "start": 562.08
        },
        {
            "text": "had towers, right? But like finding whatever that thing is, the next sauna, the next sauna, right? And like figuring out how how are we going to twist it this time to make it a thing that is a unique experience? How do we find our repetitive bits and make them into unique experiences for the players? That I'm really down for. Raj and I were having a conversation that became a conversation out there. where we're talking about video games and what games we like and games we don't like and things we didn't like in one game and things we didn't like in another game. And one of the things I was talking about is like well eventually in every open world game, right? You get to the point of like I've got to go do X. It's the big most important thing in my life, but I'm also going to go sink this tower and I'm also going to go find this guy's cat and I'm also like there's that juxosition for it, right? I do find this very interesting of every odd job in Bounty will provide the coin she needs",
            "start": 597.04
        },
        {
            "text": "tower and I'm also going to go find this guy's cat and I'm also like there's that juxosition for it, right? I do find this very interesting of every odd job in Bounty will provide the coin she needs on her journey period. Right? if they really do lean into that from a story perspective of of being like listen Atsu is on this revenge tale but everything costs money so you actually need to earn money and I know like bounties are nothing new in an Assassin's Creed but it also is like I do them and it was it's very rare that I do them in those kind of games and I'm like I'm doing this specifically I need to get X Y and Z. I mean it's the same way that Breath of the Wild I think did such a great job of having a main quest but you you need to do the side stuff so you can be in a powerful enough position to complete that main quest. I was I see Ghost of Yote possibly doing the same thing as far as hey, we have this bounty hunting system, but also you have these main targets that are the",
            "start": 628.16
        },
        {
            "text": "position to complete that main quest. I was I see Ghost of Yote possibly doing the same thing as far as hey, we have this bounty hunting system, but also you have these main targets that are the targets of the game. Like, let's say there are four big assassin assassination targets that are the one the people that you're going after who murdered your homestead, right? And you have all these bounty targets that are beneath them. Like, taking down the smaller bounty targets are going to get you closer and closer to those bigger ones to complete the story. I think that sounds [ __ ] awesome. Especially if you can if you can tackle that [ __ ] in any order you want. I hope that that is kind of the direction we're going going with towards this. And again, back to where it just doesn't feel like churn, right? Assassin's Creed always has like all the different people, right? That you go through and you X out and you meet up to the bigger guy, right? But if it is like I'm I would rather not",
            "start": 664.48
        },
        {
            "text": "churn, right? Assassin's Creed always has like all the different people, right? That you go through and you X out and you meet up to the bigger guy, right? But if it is like I'm I would rather not even be that. I would rather I go to the menu and I know that I'm going for guy Y and gal Z. That kills my family, right? But to get to them, I need to travel. I need better gear. I need all this stuff. and there I have to take these bounties and odd jobs to actually earn the coin to actually make that work. I think that'd be interesting. Now, if how do you think this shakes out with GTA 6, right? That's kind of where the story leads into uh from who wrote this is IGN, right? IGN brings in the GTA 6 of it all of hey, like this game is sent for a fall launch, right? And it seems like Sony might be trying to play their cards close to their chest to figure out, all right, is this thing going to land? Do we need to push Jose around this? Do you think if GTA 6 is announced, let's say in the next",
            "start": 700.64
        },
        {
            "text": "trying to play their cards close to their chest to figure out, all right, is this thing going to land? Do we need to push Jose around this? Do you think if GTA 6 is announced, let's say in the next couple months for an October release date, do you think OC gets kicked in 2026? No, I think it would go earlier. I think I think Sony wants it out this year. I I would imagine Sucker Punch is confident in being able to deliver. I would hope there to maybe even just bug uh fixing and polishing right now and just waiting in the wings to get this guy out. And so my hope would be you get it out before GTA 6. I do think that's what they're waiting for. I do think that Ghost is not Mario where you would not want to go toe-to-toe with that. you would want to give people room for and I think it really only benefit the biggest benefit would be getting out before it because for so many people GTA will be a forever game. I do hope it's ready for that. I think I am I am of the mind of like I don't know",
            "start": 740.88
        },
        {
            "text": "benefit the biggest benefit would be getting out before it because for so many people GTA will be a forever game. I do hope it's ready for that. I think I am I am of the mind of like I don't know I've been I as I've been thinking about it more I've been thinking about it more as a fall game just for the sense of like is this will this game be prepared for summer if this feels like a great September game. I I agree with that. Yeah, I know. The last Ghost of Sushima came out in in July and like I think that was great for it for what it was weird because of co where it was like Last of Us then Ghost and like Last of Us got delayed which I think then delayed Ghost. It was a whole weird thing, right? But I think this time around I think Ghost of Sushima or Ghost of Yote deserves that fall spot but also like I just hope if it gets pushed up because of whatever G whenever GTA comes out I just hope it's ready for it. I hope it's 100%. Oh man, you know, performance is weird, frames are bad,",
            "start": 778.56
        },
        {
            "text": "but also like I just hope if it gets pushed up because of whatever G whenever GTA comes out I just hope it's ready for it. I hope it's 100%. Oh man, you know, performance is weird, frames are bad, buggy, whatever it is. I can't have that. Uh, in the super chat, I asked if you're more excited for Ghost Your GTA. Parks View says, \"Ghost of Yoteay is more my speed over GTA 6.\" Uh, Dexter said, \"Look at me. I'm Greg Miller and I got to steal Tim's Getty Stars to be a real gamer.\" Also, I'm more excited for Ghost because I love that time period. Love you. I love you, too. And you will buy the t-shirt, most successful game shout out shirt, and it'll be it'll all be forgiven. Don't worry about that. Um, Those are the ones answering the question I asked. The Street Shadow wants to evolve the question. Evolve it. Honest question. Why are we so down on games releasing in 2025 when we have seen Sony and other companies more focused on closer to releasing marketing like Death Stranger 2 and",
            "start": 816.0
        },
        {
            "text": "question. Evolve it. Honest question. Why are we so down on games releasing in 2025 when we have seen Sony and other companies more focused on closer to releasing marketing like Death Stranger 2 and Astrobot? I think it's more the fact that we're down on games saying generally 2025 because so many games get delayed all the time. I feel like games get delayed all the [ __ ] time and so you don't believe anybody anymore till they actually give you a full date and you're playing it on that date. Yeah. I I think games as we've gone on, games have gotten more complex and more big and like more difficult to actually release, right? Because things just balloon up and up and like, you know, that requires more polish, that requires, you know, figuring out how to scale things, that requires like a lot to get things out the door. Um, and so we've seen more and more AAA stuff just missed the year because that's where we're at in video game development, right? and and and how that stuff comes",
            "start": 859.76
        },
        {
            "text": "a lot to get things out the door. Um, and so we've seen more and more AAA stuff just missed the year because that's where we're at in video game development, right? and and and how that stuff comes down. I I'm not down on Ghost coming out this year. I believe that's going to come out this year. I'm mainly down on GTA 6 again just cuz what the streets have told me, right? But again, like I can't I don't know if that's going if that's 100%. Things can change like obviously, but that's really the only game that I'm looking at where I'm like I don't know if this is going to release this year. I think everything else every other big game we're talking about I think is going to release this year that has like a 2025 thing. I'm trying to think anything, but it's hard to. Uh, in the super chats, guess who's back? Christopher Bernett, and he's coming for Barrett. Actually, Rockstar Games release on a Tuesday. Every GTA from GTA 3, Vice City, San Andreas, GTA 4, GTA 5, all released on a",
            "start": 899.2
        },
        {
            "text": "chats, guess who's back? Christopher Bernett, and he's coming for Barrett. Actually, Rockstar Games release on a Tuesday. Every GTA from GTA 3, Vice City, San Andreas, GTA 4, GTA 5, all released on a Tuesday. I fact checked the dates. I'm sticking with October 28th. Yeah, I looked at the GTA 5 uh release date. I was uh wrong there, but I was right on Red Dead 2. I'm sticking with that. That released on a Friday. You're talking about 2013 where everybody was was releasing on Tuesdays. The Friday transition happened. And I feel like somewhere early PS4 era.",
            "start": 937.28
        }
    ]
}