{
    "id": 13789,
    "video_id": "qqpFn--e7eU",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Mike Howard"
    ],
    "title": "Final Fantasy X According To SnowBikeMike  - Kinda Funny Gamescast",
    "description": "Go to http://get.stash.com/KINDAFUNNY to see how you can receive $25 towards your\nfirst stock purchase and to view important disclosures.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1743018556,
    "duration": 4737,
    "transcript_chunks": [
        {
            "text": "[Music] What's up and welcome back to the kind of funny games cast live for Wednesday, March 26th, 2025. I'm your host Tim Gettys and I am joined today by a very excited snow bike. Mike, Tim, I've been holding it back. I told you today, don't look at me. Don't look at me. Big things happened last night that I wanted to tell you about and you said, \"Mike, how about I just give you a podcast and you can tell me all about it.\" Every day for the last week or so, you've come into this office and uh no matter how busy I've been, stressed I've been, you bring a smile to my face because you are taking part on your first journey into Final Fantasy 10. One of the most beautiful love stories in video games. an amazing narrative about the intersection between religion and technology and what time can do to that and the relationships between people and how powerful love can be through time and you feeling it for the first time sacrifice I got a sacrifice dam dude it's too real and so the energy and",
            "start": 5.08
        },
        {
            "text": "to that and the relationships between people and how powerful love can be through time and you feeling it for the first time sacrifice I got a sacrifice dam dude it's too real and so the energy and excitement from you I'm like I can't I can't be selfish I can't keep this to myself I need to share this with the people because I know that Final Fantasy 10 doesn't just mean a lot to me. It means a lot to many, many, many people out there. I would say that it is one of the jump on points of the franchise. It being the first PlayStation 2 uh entry, um the first one with voice acting, uh I think that it the timing of it coming out, there's a lot of people like me that played Pokemon, fell in love, and were like, \"What is this turnbased stuff? What is this RPG?\" Okay. And then Final Fantasy 10 kind of being that like, \"All right, cool. Let's play a little Let's do some big boy stuff, you know. And now, Mike, you're a big boy now. And I can't wait to hear all about it. There's some big boys",
            "start": 55.28
        },
        {
            "text": "kind of being that like, \"All right, cool. Let's play a little Let's do some big boy stuff, you know. And now, Mike, you're a big boy now. And I can't wait to hear all about it. There's some big boys and there's some deep V's, Tim. Okay. There's some deep V's and we got to talk about it, Tim. Yes. Uh, so let me set the stage for everybody out there watching. This isn't a review. This is two best friends gathered around the water cooler telling stories, kind of recapping the plot, and just getting lost in the sauce that is Final Fantasy 10. I'll talk about the things that I like and I don't like, but like I just wanted to come to Tim and tell him about my journey so far. I am 24 hours in I from what I can tell you're about halfway through. It's been a long time since I played through the entirety of this game. Um, every couple years I'll dabble and I'll like play for a bit, but I always end up dropping off, you know, but I watch a lot of the videos over and over, specifically the",
            "start": 104.96
        },
        {
            "text": "the entirety of this game. Um, every couple years I'll dabble and I'll like play for a bit, but I always end up dropping off, you know, but I watch a lot of the videos over and over, specifically the ending. Can't wait till you get there. Um, but yeah, you seem to be about halfway through. So, I I'm very very excited to hear your thoughts. I stopped the wedding a couple of times. I thought I stopped the wedding once and you were like, \"Oh, did this happen?\" That didn't happen. Then I finally stopped the real wedding. We're going to talk about this wedding dress. Tim, that wedding dress that should be everywhere. Everybody wearing that wedding dress. That's how beautiful. You're looking good. Here's the thing, everyone. Clearly, because this is Mike doing his lore drop. He's going to go through his journey, his story so far. Listen to his story. It might be his last chance. Good. Real good. That's a Final Fantasy 10 reference for you. Uh this will be full of spoilers for up to where",
            "start": 144.24
        },
        {
            "text": "through his journey, his story so far. Listen to his story. It might be his last chance. Good. Real good. That's a Final Fantasy 10 reference for you. Uh this will be full of spoilers for up to where Mike is. We will not spoil past that. Um and I will ve very much try my best not to spoil anything. So um I this is more about hearing you talk about all of this, Mike. But before we get into that, I need to let you know this is the kind of funny games cast. Each and every weekday we get together to talk about the biggest reviews, previews, and topics in video games live on YouTube, Twitch, and podcast services around the globe. If you love what we do, please support us with the Kind Funny membership on Patreon. YouTube, Spotify or Apple Podcast to get all of our shows ad free, watch us record them live and get a daily exclusive show. For Jans be part of this show though, if you have any thoughts on Final Fantasy 10, any questions for Mike, anything, please super chat them in and we will",
            "start": 181.28
        },
        {
            "text": "them live and get a daily exclusive show. For Jans be part of this show though, if you have any thoughts on Final Fantasy 10, any questions for Mike, anything, please super chat them in and we will get to those as we go. Just like Foxy Steve did when he said, \"When FFX came out, my parents let me take over the new big screen TV in the living room and just play it.\" Such a special game. Damn, that's a cool moment. That's sick. I love I remember I got it on uh I think it was Christmas when I first got it if I remember correctly. Um or maybe there if I didn't get it on Christmas. I uh had it and uh when I first started playing it, I loved it, but it was a little much for me. Like there was a lot. It was a little slow. I was like a little 10-year-old, you know what I mean? Um and I remember taking my PS2 and it to Kevin's house on Christmas and just sitting there playing it and having a great time. So yeah, great Christmas memories for even though I don't think it was right then. Um, but",
            "start": 224.0
        },
        {
            "text": "my PS2 and it to Kevin's house on Christmas and just sitting there playing it and having a great time. So yeah, great Christmas memories for even though I don't think it was right then. Um, but anyway, yeah, please super chat about Final Fantasy 10 and we'll get to those. Little housekeeping for you. We're an 11 person business all about live talk shows. You already got kind of funny games daily breaking down the news of a Nintendo Direct happening tomorrow. What? Uh, after this, we got Daredevil Screencast for episodes five and six. Can't wait to talk about all that stuff. Then after that, the stream will be more Pokemon Nuzlocke. Uh, tomorrow, Nintendo has thrown our world into anarchy with its early morning direct. So, we'll be live reacting on a delay to the Nintendo Direct tomorrow at 10:00 a.m. Pacific. That's the usual games daily time slot, but we won't have watched the Direct until we watch it live with you. We'll have the chat off so we're not spoiled. We'll not be on the",
            "start": 266.08
        },
        {
            "text": "at 10:00 a.m. Pacific. That's the usual games daily time slot, but we won't have watched the Direct until we watch it live with you. We'll have the chat off so we're not spoiled. We'll not be on the internet before then. This is us just going in to react to the Nintendo Direct. I I appreciate the 10 a.m. uh delay, Timmy, just because we're already getting up early next week, and I was like, damn, I don't know if I want to do two weeks in a row of waking up at [ __ ] like 6:00 a.m. to get here, maybe. I get it. I know. It was up to me, but it's about Nintendo here. I [ __ ] Nintendo, baby. I know. I'll deal with it. Give me one quick prediction right now. No explanation. Go for tomorrow. For tomorrow? Yes. Oh, man. Just because you're asking. Zelda porch, baby. All right, let's go. Zelda Porch. Um, no, but I think it's probably going to be more. I think UFO 50 is going to come to Switch. That's my prediction. That's a good win. Is it not already there? It's not already there. It's",
            "start": 306.96
        },
        {
            "text": "Porch. Um, no, but I think it's probably going to be more. I think UFO 50 is going to come to Switch. That's my prediction. That's a good win. Is it not already there? It's not already there. It's coming to Switch. Okay. And it'll be there tomorrow. That's my official one. Um anyway, then after that we're going to roll into games daily and then in review for Alien versus Predator Reququum. You know they added an S for that one. Alien verse Predator 1 AP just Alien vers Predator that it's Aliens versus Predator Reququum. Did you watch that one yet? I watched it. Hard to see. Oh, turn the brightness up on your TV. I tell you, I took the screen. I put it like this to my face. Uh and then immediately following the reaction tomorrow, we're going to be doing the Games Cast, breaking all that stuff down. uh if you're a kind of funny member, a bunch of cool stuff for you. Uh today's Gregways 24 minutes about review embargos. And later today, we are doing the kind of funny happy hour. Uh if",
            "start": 348.96
        },
        {
            "text": "stuff down. uh if you're a kind of funny member, a bunch of cool stuff for you. Uh today's Gregways 24 minutes about review embargos. And later today, we are doing the kind of funny happy hour. Uh if you are a $25 or above member of Patreon, you can uh hang out, actually call in and talk to us. So, that's all exciting. Thank you to our Patreon producers, Delaney Twin, Carl Jacobs, and Omega Buster. Today, we're brought to you by Stash, but we'll tell you all about that later. For now, start with the topic of the show. Tots, dots, dots, dots, dots. All right, Mike, enough enough jibbering and jabbering. Enough of that. Tim, we're going to jump all over the place and I'm going to get us to the beginning, but I just want to talk about what I saw last night. All right, cuz that's hot in my mind. It's fresh and it's wild. Okay, the wedding sequence, the music as me and the crew roll up on this goddamn spaceship. We jump out. We're grinding rails. [ __ ] Seymour's looking up at us and he's",
            "start": 390.4
        },
        {
            "text": "It's fresh and it's wild. Okay, the wedding sequence, the music as me and the crew roll up on this goddamn spaceship. We jump out. We're grinding rails. [ __ ] Seymour's looking up at us and he's like, \"A [ __ ] it's about to go down.\" And the music kicks, Tim, man, who's on the track because this game has got some great music. Yeah, it's not who you would expect either. Nouatsu, uh, who would the guy that you would expect if you if you knew Mike, uh, the the iconic Final Fantasy composer, only did a handful of songs for 10, uh, including Tuzan and Sutani, which are like the two big main ones. But, um, otherwise, uh, I always forget uh, his name. It starts with an M, but uh, I I'll have to look that up. But yeah, no, he pops pops off. And uh that scene, the wedding scene, I must have watched that 10,000 times when I was when I was a kid. I made a separate save file just so I could rewatch that cut scene over and over cuz this is back when cut scenes were a big deal. Tim, the cutscenes",
            "start": 432.88
        },
        {
            "text": "that 10,000 times when I was when I was a kid. I made a separate save file just so I could rewatch that cut scene over and over cuz this is back when cut scenes were a big deal. Tim, the cutscenes in this game are unbelievable. I I've always I've never I've never played Final Fantasy 10. I once saw Dylan French's older brother, Spencer, or something. He played blitz ball in front of me once and that's the only reason why I knew what blitz ball was but I had never seen any cut scenes and I'll tell you what these cutscenes are baller these cutscenes [ __ ] every time the game goes into out of gameplay in the cut scene you get up in your chair and then sometimes they'll tease you they'll go back to gameplay but then right back in the cut scene you're like what are you doing it's so good bro uh Mashi Hamau and Junior Nakano are the the two composers and yeah they pop off love the battle theme in this game So, we're battling through Tim. We're we're at the altar, okay, of Bevel. And we're",
            "start": 479.28
        },
        {
            "text": "uh Mashi Hamau and Junior Nakano are the the two composers and yeah they pop off love the battle theme in this game So, we're battling through Tim. We're we're at the altar, okay, of Bevel. And we're [ __ ] pushing through people. We're screaming, \"Stop this wedding.\" You know what I mean? And Seymour knows he's got to pull the kiss off quick because we're not going to let him do that. And oh my, there's guns firing off. We're [ __ ] pushing through. So cool, Tim. Little different gameplay without my girl Una to heal the squad. I'll tell you what, a little different game of a struggle point there. Yeah. But you know who fills in? Well, my girl Ricky. Oh, Riku. Riku. Riku fills in well cuz she's got that L bed potions. And I'll tell you what, green eyes, you hit them with that, everybody gets plus a thousand, everybody loses all the status effects, buffs off the team. Like, I needed that. So, I know we're bouncing all around here, but uh you're you're talking about uh the battles a",
            "start": 521.96
        },
        {
            "text": "gets plus a thousand, everybody loses all the status effects, buffs off the team. Like, I needed that. So, I know we're bouncing all around here, but uh you're you're talking about uh the battles a little bit. I I want your thoughts on the battle system because again I was saying Final Fantasy 10 I think is a very good My first Final Fantasy for people that first RPGs was Pokémon because it is turn-based and unlike the majority of Final Fantasies, it's not active turnbased. It is if you don't touch the controller, nothing happens, right? Yeah, you have the little like the turn chart in the upper right and you need to care about using things like haste or slow and all that way more than I ever have in a different in a Final Fantasy. I was slapping that dragon on top of the airship with slow and it felt so good to you see them slow down slow down then they move they lose the turn. Tim, I really like the battles. Uh I'm not the biggest turnbased guy but I can put up with it. Uh there's",
            "start": 566.32
        },
        {
            "text": "and it felt so good to you see them slow down slow down then they move they lose the turn. Tim, I really like the battles. Uh I'm not the biggest turnbased guy but I can put up with it. Uh there's something about this where it might not be active turn base like you say, but it's active to me because I am being aware of the turn uh base up there or what do we call that? The turn styles. What do you call that? Turn rotation. Team rotation. The call battle system or something like that. But just so you know, Mike, when I say active, like the the actual name of the battle system in like Final Fantasy 7 stuff is active time battle, which is you have that little bar that goes down and then you can attack. So it's like, you know what I'm talking about? No, I never looked at that. That's [ __ ] crazy. Yeah. Well, you mainly the old funnel pass the original. I'll tell you what, I'm I'm getting active with it because I'm so invested, right? And so for me, it is now I'm I'm strategizing. What am",
            "start": 608.64
        },
        {
            "text": "Yeah. Well, you mainly the old funnel pass the original. I'll tell you what, I'm I'm getting active with it because I'm so invested, right? And so for me, it is now I'm I'm strategizing. What am I doing? How am I using that team rotation up at the top right to play to my advantage, right? Am I using a dark attack to put a little dark cloud over one of the the opposite team members for three turns? Am I going to absorb and landlot [ __ ] some move so my man Kamari could learn a new move which is sick. Okay. He's got a lot of dope moves. Okay. And I'm also making sure everybody gets a little touch of the ball because I want everybody with XP. So I'm I'm rotating seven people throughout every single battle. Oh wow. There's probably been I bet you the chat can tell you cuz I've been live streaming it. The chat has probably seen maybe five battles total that I haven't actively got all seven people in there to touch it. That's that's good for you, man. That's going to pay off in the in the",
            "start": 649.2
        },
        {
            "text": "it. The chat has probably seen maybe five battles total that I haven't actively got all seven people in there to touch it. That's that's good for you, man. That's going to pay off in the in the later game cuz like there's some grindy sections in this game if you don't have the right people. I love I love the quick swap of like you can swap someone and it doesn't cancel the turn, right? I swap somebody, I can look at them and go, is Lulu the right choice for this right now? No. You know what? Let me put in Waka. Okay, Waka can still get the turn off. I love that. Right. And we're still playing with the rotation up top on the top right. And yeah, my mind is just working overtime of who's gone, who hasn't, what's the best moves for this? Am I calling in a summon? Oh, snap. Are we getting the overdrive bar filled up? Am I using that? Am I saving that? What overdrive ability do they have? Is it where they get hit? Is it where they have to hit? Is it where they watch other homies hit? It's",
            "start": 694.24
        },
        {
            "text": "overdrive bar filled up? Am I using that? Am I saving that? What overdrive ability do they have? Is it where they get hit? Is it where they have to hit? Is it where they watch other homies hit? It's crazy stuff, Tim. And so, I'm playing a lot of mind games with them, Tim. I like to save the overdrives, except for Tetus. You got to use his all the time, okay? But I saved the rest of them for the big time ones. Lulu's. Lulu's can go to hell. Okay. Rotating the sticks. [ __ ] Okay. Cuz I'm spinning those sticks, Tim. I'm spinning those sticks. You have to do like the the quick commands. Sometimes I get crazy. That [ __ ] does get a little crazy. Tetus. Tetus always gets me on the first try cuz his is just a simple bar and click A in the middle. And I always miss it on the first one. And then I panic a little bit. I tighten up like, \"Oh [ __ ] you [ __ ] that up, Mike.\" But I always get it. You know what I And then the rest of the crew doesn't have any, which is crazy. Like why",
            "start": 736.96
        },
        {
            "text": "And then I panic a little bit. I tighten up like, \"Oh [ __ ] you [ __ ] that up, Mike.\" But I always get it. You know what I And then the rest of the crew doesn't have any, which is crazy. Like why overdrives? Uh, no. They have over drives, but they don't have like crazy moments in that. Yeah. It's very odd of like, oh, those guys are the only ones. And then everybody else is like, hey, you know what? Oh, has a slot machine. Yeah, [ __ ] that slot machine. Okay. But like also like, shout out to that slot machine. It's very generous. You know what I mean? But like Kamari doesn't. He just jumps on his stick and kills him. Yeah. It's It's so cool. Tim, I love the battle system. I'm loving it and I'm making sure everybody gets a touch because I'm I'm thinking see I'm thinking past the battle system, Tim. I'm already thinking about myself on the grid and I love Dude, I love the grid. Now, how cool is it that you don't level up in this game? Like most RPGs, it's like I'm level one and now",
            "start": 776.48
        },
        {
            "text": "system, Tim. I'm already thinking about myself on the grid and I love Dude, I love the grid. Now, how cool is it that you don't level up in this game? Like most RPGs, it's like I'm level one and now I'm level five or whatever. You there's no actual level. You just you just have different I'll tell you what, I didn't even think of that, Tim. I didn't I didn't even think of that. Got to use the grid. I'll tell you what. Shout out to kind of funny best friend, Krabby Patty. So there I was night one. The grid's intimidating. The grid if you [ __ ] up on the move and you go over one and you you all of a sudden you can't hit that but you got to go back to go get that. You're like, \"What's happening?\" Krabby Patty calls in. Get him on the Discord call. I go, \"What the [ __ ] is happening?\" He's like, \"All right, Mike, you got to move two.\" See how you're in the middle of all three of these? Now you can get all three at once, but if you move too far, you'll miss that. Then you got to go back",
            "start": 816.48
        },
        {
            "text": "like, \"All right, Mike, you got to move two.\" See how you're in the middle of all three of these? Now you can get all three at once, but if you move too far, you'll miss that. Then you got to go back to get the node, right? And then he was like, \"Watch this. [ __ ] hit select.\" And then you pull it back. And he's like, It's a giant grid and you realize everyone's on the same freaking grid and I'm working Lulu. I'm working Lulu to get over there to get the double cast. So like she's on the move right now. I got Kamari's leveling up so much. He's on hot on the heels of Waka already, right? And I'm like I'm thinking I'm like what do I want out of these guys? Like is Kamari going to be more magic based? I'm like no he's my strong guy. He's my tank cuz he's a strong man, strong soul. I love I mean, that's the thing is like uh they designed it so that each character kind of starts at a different place on the sphere grid and can kind of uh you know get into RKU is more of the thief and uh",
            "start": 854.64
        },
        {
            "text": "I mean, that's the thing is like uh they designed it so that each character kind of starts at a different place on the sphere grid and can kind of uh you know get into RKU is more of the thief and uh Waka obviously is more Oh my god, no dude. We're talking about stuff that I love and care about. Mike cares about this. Oh yeah, it's my farewell tour. This is it. I asked for this. I guess I didn't be clear at all. You asked to hear Mike talk about Final Fantasy 10. We were delivering that. The amount of people that tweeted at me saying, \"When are you gonna do this?\" And I was like, \"Guess what? We're doing it tomorrow.\" It's one guy. Shout out to you. [Music] Sorry to interrupt, Mike. No problem at all, Greg. I don't know if you heard. It's the Tim Getty's farewell tour. One week from today, day one, they reveal the Nintendo Switch 2. But more importantly during that presentation, I am cashing in stars in the bank and taking Tim's three stars. Three stars. Thank you, Carl Jacobs. And",
            "start": 891.68
        },
        {
            "text": "day one, they reveal the Nintendo Switch 2. But more importantly during that presentation, I am cashing in stars in the bank and taking Tim's three stars. Three stars. Thank you, Carl Jacobs. And what I said yesterday was that for the next week, it would be the Tim Gettys farewell tour. And every day I would have a surprise for Tim to honor him. You know what I mean? You have so many stars. It's something to be proud of. And so I'm not I'm not happy that I have to take them. And I know it's going to hurt. I know you've built your entire [ __ ] personality around having these three stars. All right. But I need more than three, but these three are the important ones. Okay. So to soften the blow Mhm. I'm going to do something every day that's nice. Okay. Every day something nice for you, Tim. Yeah. To really celebrate you. Mhm. to celebrate what you've done here. All right. Okay. So, let's just real quick close that like that. Just you know, you can just focus on me, everybody. And so,",
            "start": 947.84
        },
        {
            "text": "Yeah. To really celebrate you. Mhm. to celebrate what you've done here. All right. Okay. So, let's just real quick close that like that. Just you know, you can just focus on me, everybody. And so, Tim, your first gift on the farewell tour. Is this cake? Oh. Oh my god. Oh, now I wrote dye on it, but I put three stars in it as well. So, you can see the three stars. They melted a bit there. I thought it said die. Happy birthday. Happy birthday. Happy birthday to you. Do you trust me? I am so scared right now where I'm like there's no Oh my god. You don't need to do this. You really don't need I need to be nice to you. I don't think I need to. I want to be nice. I don't need it. I don't need it. Take a little bite. Take a bite. I just want to be nice. Oh, the cake will help. Eat out of my hand. Don't you want to eat out of the winning team blue hand? No. You know, we're going to be three peak champs cuz you're three stars. That's a big deal. Have a bite. Just a little bite. Look. Look. Is",
            "start": 1002.88
        },
        {
            "text": "Don't you want to eat out of the winning team blue hand? No. You know, we're going to be three peak champs cuz you're three stars. That's a big deal. Have a bite. Just a little bite. Look. Look. Is that what you're scared of? Oh my god. Mike, you don't I don't need the cake. I don't need it. I don't need it for you. All right. I'm doing nice things. They said be nice. They said I'm too mean on the internet. I'm being nice. Now take over the cake. I'll lose the cake. Which means is it the hand? Is it the hand or the briefcase? No. No. This is so stressful. And the birthday songs. Do me a favor, Mike. In my right ass cheek, I put forks. Give me one of them forks. Come here now. Get a little bite. Get a little bite. This has been in my trunk. It's so good. You're a good one. It's a good cake. Leave it here. Will you eat more? No. No. You can leave it, but I'm not going to eat more. Yeah. He just threw the cake in the briefcase. Oh my god damn. Now, now this song is going to torment my",
            "start": 1065.84
        },
        {
            "text": "Leave it here. Will you eat more? No. No. You can leave it, but I'm not going to eat more. Yeah. He just threw the cake in the briefcase. Oh my god damn. Now, now this song is going to torment my dreams. Yum. I have another week in this. Mike, I know nothing but nice things. This is day one. Really nice things, huh? I was hoping you'd bring like a Lulu statue or something for me. Yeah, that'd be nice. Shout out to Lulu. What are your thoughts on Lulu? Let's show me the characters. Tim, let's let's I mean, we've been distracted enough. Let's talk about the world and the story and just get lost in it. Okay. My boy Tetus. Okay. Titus. Tetus. I don't know. I don't really care. My problem, man. Big T is a good way to go. It's Tetus. But you know, I hate it, too. Don't worry. And there we go. Tim, we start this world off and man oh man, it's got that hint of blue that I know you love. It's futuristic. It's sci-fi. [ __ ] the city's looking at one man. Who's that man? It's Big T. Okay. It's",
            "start": 1136.16
        },
        {
            "text": "we start this world off and man oh man, it's got that hint of blue that I know you love. It's futuristic. It's sci-fi. [ __ ] the city's looking at one man. Who's that man? It's Big T. Okay. It's the hottest blitz ball player this side of the Mississippi. And he's [ __ ] ready to play, bro. So much fun. I love this guy. My I I've told you this and I've told the audience this before, too, but the reason that I love chains is Tetus. Back back in middle school, uh my my best friend Curran who loved Final Fantasy 8, he bought the the Lion Heart from like eight necklace and I bought Tetus' necklace. It was a definitely a shitty janky like uh fake stainless steel or whatever. So it definitely like would you know give me some rashes sometimes. Oh man, when your neck turn green, you know what I mean? But it's all worth it. It's all worth it from Big T out there. He arrives on the scene. Little kids be screaming, \"Sign my blitz ball. Sign my blitz ball.\" Couple of cuties are like, \"Yo, we're",
            "start": 1189.84
        },
        {
            "text": "mean? But it's all worth it. It's all worth it from Big T out there. He arrives on the scene. Little kids be screaming, \"Sign my blitz ball. Sign my blitz ball.\" Couple of cuties are like, \"Yo, we're going to be in section three. Seats 48 and 45.\" And he's like, \"When I score tonight, I'm going to throw this up for you.\" And he puts up the double L's for you. you're watching live right now on the chat. Can I get some double L's in the chat? And it's like we set the tone early that this blonde baby blue-eyed man might be the dude. Okay, my man Ted is letting him know early that he's going to go out there and score a goal. Then we see the sphere. Blitz ball is on and popping and we get one of the coolest cutscenes of all time because first off, this man's wet. He's so wet. He's makes sense. It's literally underwater. So wet, Tim. And then we got the girl with the braids and the braids are [ __ ] braiding. All that [ __ ] was crazy in the cut scene. And he comes out of the water, Tim.",
            "start": 1238.32
        },
        {
            "text": "It's literally underwater. So wet, Tim. And then we got the girl with the braids and the braids are [ __ ] braiding. All that [ __ ] was crazy in the cut scene. And he comes out of the water, Tim. You're like, \"Oh my god, this is crazy.\" The music's playing. The music's playing. He looks out and some stuff happened between this, right? We got some crazy narration from maybe older Tetus. I don't I don't know. It's crazy. It's crazy. There's a small ghost child out there. There's a ghost child. There's a ghost child. We'll talk about the ghost child. He also saw a billboard of a man that could be his daddy, might not be his daddy, could be a hero. You know what I mean? And then shows up and you pop off. I pop I'm like, \"Oh my god, orange's your boy.\" That guy's from Kingdom Hearts is what I said. That shit's crazy, y'all. And man, oh man, is he so cool. Has there ever been a cooler character design? The answer is no. Giant samurai sword arm in the sling just kind of hanging. He's got",
            "start": 1279.36
        },
        {
            "text": "I said. That shit's crazy, y'all. And man, oh man, is he so cool. Has there ever been a cooler character design? The answer is no. Giant samurai sword arm in the sling just kind of hanging. He's got the bottle of whiskey on his waist. You know what I mean? He's got the cool super turtle, dope ass glasses, sick ass haircut. Nick wishes he was this guy. Wishes he was this guy. So orange up on top of the city cuz he sees something coming in. And as Tetus jumps out the water, he's doing the back flip because what is he doing, Tim? The jack shot. He's doing he's doing the jack shot. Mark three. It's not a mark one or two. He kept saying that because he wanted people to keep coming back so they would hope to see the one and two. This guy gets it. This guy gets it. His daddy gets it. We'll talk about his daddy in a little bit. But then he sees something massive coming and it starts shooting rockets out at the city and it's on and popping. It's mayhem, right? Aren comes, he grabs Tetus and",
            "start": 1325.52
        },
        {
            "text": "about his daddy in a little bit. But then he sees something massive coming and it starts shooting rockets out at the city and it's on and popping. It's mayhem, right? Aren comes, he grabs Tetus and he's like, \"Yo, we got to scadaddle, big dog. Like, you got to step up. Here's a sword. Learn how to fight.\" And the kid's like, \"I just played blitz ball, bro. Bro, and he's like, you're gonna do a lot more.\" And then he hits him with this. We get sucked into sin. Okay, we learn about the sin. We get sucked into sin. And the final thing he says to him is, \"This is your story.\" And bang. What a opening to a video game. Damn. What an insane opening. Slows down significantly after this point. What are you talking about? I mean, I love We wake up in the ocean. We're saved by this girl. What's her name? Riku. It's Ricky from Kingdom Hearts. Are you kidding me? It is one of the most bizarre things Square has done. and square known for weird name choices. Uh but to within years of each other have",
            "start": 1371.84
        },
        {
            "text": "Riku. It's Ricky from Kingdom Hearts. Are you kidding me? It is one of the most bizarre things Square has done. and square known for weird name choices. Uh but to within years of each other have two characters named Riku that are like main characters in Kingdom Hearts in uh Final Fantasy 10. Kind of kind of weird. Different amount of K's. Of course. Of course. Of course. Different vibes. Of course. Of course. Uh but RKU has saved Tetus out in the ocean. She has pulled him on board. Everybody's speaking a different language. He has no idea. He's telling her, \"I got to get back to Big Zan anarchin.\" And she's like, \"Homie, that was gone a thousand years ago.\" And your mind explodes of like, \"Oh [ __ ] did we just time travel or she just lost?\" And she's like, \"Hey dude, just so you know, like you don't want to be running around talking about that place. Like keep it on the lolo.\" But like bad [ __ ] happened there. You're not there anymore. And he's like, \"What are you talking about?\"",
            "start": 1414.08
        },
        {
            "text": "you don't want to be running around talking about that place. Like keep it on the lolo.\" But like bad [ __ ] happened there. You're not there anymore. And he's like, \"What are you talking about?\" The people on the ship, they're speaking a different language, yelling at him, and they're like, \"If you want to be with us, you got to go to work. Start swimming.\" And he swims down. And we're working on something. I don't know what it is, but we're plugging things in with Ricky to help her out. And then we go topside and my man Tus is like, \"Ah man, I got to get back home.\" Like maybe if I get sucked up by the sin again, I they'll spit me back out. Boom. Sin comes back and now we're on a tropical island. And Tim, I swear to God, because I've only played Kingdom Hearts, I thought for sure we were on the island of Kingdom Hearts. I thought Well, what's funny is Tus is on the island on Destiny Island in the beginning of Kingdom Hearts 1. Waka is definitely on the island cuz I'm calling him",
            "start": 1459.84
        },
        {
            "text": "were on the island of Kingdom Hearts. I thought Well, what's funny is Tus is on the island on Destiny Island in the beginning of Kingdom Hearts 1. Waka is definitely on the island cuz I'm calling him Chad all the time. He was like, \"Oh [ __ ] we're on the island.\" You know, and what happens? Hitting the head with a blitz ball. It's walking the boys. Walking the boys ballers, bro. That's what I callers. The ballers. Yeah. Uh the bet ballers. They're looking for a homie because they just lose all the time. And Walker's like, \"Damn, you know how to kick a blitz ball. You're on the team now.\" And he puts them in this headlock and you're like, \"Are these two going to be bros?\" Like, \"Are these guys going to be our bros?\" It's clear. We're going to learn a little bit more about Waka where we kind of give him the look a couple of times, but like right now we're just going to pretend like they're bros cuz they are bros. Two bros in the sun. I I had a feeling you're going to like Waka. I I",
            "start": 1499.84
        },
        {
            "text": "kind of give him the look a couple of times, but like right now we're just going to pretend like they're bros cuz they are bros. Two bros in the sun. I I had a feeling you're going to like Waka. I I liked Waka and then then Waka took a step racist, right? Yeah. He got real racist. He took a step to the line. It's like Waka, it's time to open up your heart and start learning about others and like really becoming a human being on this planet or like you got overstep the line and we can't love you anymore, Waka. He's slowly learning right now, but he's he's he's tough to come around. Yeah, but like we'll talk about that later on. You know his voice actor. Bender is what they've been saying. Bender from Futurama. John Deaggio. That's crazy. Pretty damn cool. Tus voice actor. Ratchet from Ratchet and Clank. That's crazy, too. And Obi-Wan Kenobi. Yep. In Clone Wars. Yeah. Damn. So, now we're on an island and of course we bring up Xanarchin for a moment and Waka starts doing the look. He",
            "start": 1537.92
        },
        {
            "text": "and Clank. That's crazy, too. And Obi-Wan Kenobi. Yep. In Clone Wars. Yeah. Damn. So, now we're on an island and of course we bring up Xanarchin for a moment and Waka starts doing the look. He starts tweaking a little bit. He's really religious. He's got a lot going on. He's got a lot that we're going to talk about as we learn. But he starts giving the look and Tus quickly goes, \"Maybe I shouldn't tell him about that. I'll keep that to myself.\" And he's like, \"I'm just lost, bro. I need a little help.\" And he's like, \"If you need help, I need help. You're going to join my Blitz Ball team. We've never won a game. Never once have won a game in 25 years of playing. This is my life. I've never won. You're on the team now. You're going to help us win.\" And so then he takes us up to the top side of the island where we get introduced to the squad. The whole team is there, Tim. I mean, and it's a beautiful moment. Oh yeah. Lady Yuna comes out. She's given her all inside the temple and she's",
            "start": 1579.04
        },
        {
            "text": "of the island where we get introduced to the squad. The whole team is there, Tim. I mean, and it's a beautiful moment. Oh yeah. Lady Yuna comes out. She's given her all inside the temple and she's learned to summon because she's going to be high summoner. She is the daughter of a high summoner. High summoner Brasa. Lord Brasa. Lord Brasa. And let me tell you what, this story as well, Chad, a lot about daddies, okay? And lots of daddies. Lot of daddies involved. Oh yeah. Oh yeah. Okay. And so we got Lord Brasa. We got Jack out there. So just remember these names cuz they're all going to start intertwining here in a minute. And it gets pretty [ __ ] wild. It gets pretty lit. It's pretty lit. It gets pretty lit. And so she calls down this beautiful bird as a summon. And everybody in the island's going crazy like, \"Oh [ __ ] the daughter of the the daughter of the father that is Albby. She's got it y'all. She's going to do it. She's got the stuff.\" Now let's talk about this scene. Talk",
            "start": 1620.4
        },
        {
            "text": "going crazy like, \"Oh [ __ ] the daughter of the the daughter of the father that is Albby. She's got it y'all. She's going to do it. She's got the stuff.\" Now let's talk about this scene. Talk about it with me, Tim. One of the most gorgeous, beautiful things I've ever seen. Her walking on literally walking on water doing the summoner dance. A thing of beauty. Beautiful dance. You know who else does that dance? Aith. Aith. Seven rebirth. She does the dance, too. She does a very similar dance when they're in the vision of the Temple of the Ancients. Yep. Think about it, man. And I was popping off seeing that [ __ ] Crazy stuff. Looking at Magic cards. I might have to rewatch that. That's crazy. That's crazy cuz this is beautiful. And the whole team is there. We got Lulu, Kamari, the Catman, which is like, wo, that guy is so cool, right? And then there's Waka, right? And then we're going to add ourselves to that. We'll add Ricky. We'll add uh Aurin becomes seven. But like, you see the",
            "start": 1666.56
        },
        {
            "text": "which is like, wo, that guy is so cool, right? And then there's Waka, right? And then we're going to add ourselves to that. We'll add Ricky. We'll add uh Aurin becomes seven. But like, you see the squad and Lulu. Yeah. Yeah. And Lulu. Oh my god. Lulu. What do you have to say about Lulu, Mike? Lulu's got a heart of gold. She's the perfect character of like you fall in love with her and you know that like she's brash and she's straightforward and she just wants to get the job done, but she's also there to protect her family and friends and she loves her her family and friends. She's also going through a tough time. She lost somebody. Yeah. And I texted you I texted you like three things total throughout this like 24 hours and one of them was a line that will always stick with me and that's Chipu. That's Waka's brother was dating Lulu and we learned that he went and signed up. He enlisted and he died. Yeah. He gave his life to fight back the sin for one reason and that was Lulu. That",
            "start": 1710.64
        },
        {
            "text": "Chipu. That's Waka's brother was dating Lulu and we learned that he went and signed up. He enlisted and he died. Yeah. He gave his life to fight back the sin for one reason and that was Lulu. That [ __ ] was Tim when he was like being with your girl's great, but you know what's even better? Fighting back sin to protect your girl. And I was like, \"Oh [ __ ] this [ __ ] right here. He's good, man. That's it. It's it man. This guy right.\" So, she's going through some loss right now. She's going through it. She's feeling it. Walker's feeling it as well, cuz he's looking at me. He's like, \"Hey, Big T, you kind of look like my brother. I'm getting some brotherly vibes from you. I'm going to give you my brother's sword.\" And oh my god, sick ass sword. Tim, I'm coming hot off of Kingdom Hearts with Keyblades, which are some of the coolest swords of all time. You look at this thing. This thing might take the cake. I love it. Buster sword be damned. This blue sword, the Brotherhood sword, is so",
            "start": 1756.32
        },
        {
            "text": "Keyblades, which are some of the coolest swords of all time. You look at this thing. This thing might take the cake. I love it. Buster sword be damned. This blue sword, the Brotherhood sword, is so sick. Tim, we haven't even talked about you can eventually customize your weapons. I'm out here adding Tim. I'm so lost in the menus. You wouldn't even be You wouldn't even know I'm so lost in the menus. So then we're on a journey. She's going to start her pilgrimage because a high summoner's duty is to go to all of the temples, learn the aons, aka the summons, and then she'll get to the final summon where they will be able to fight back sin. That's the goal. So good. That's the goal, Tim. And so, you know, she has the two different colored eyes. I didn't pick up on that early. I I saw him and I did I didn't like I just looked at it. I was like, \"Okay, I see that.\" But didn't pick up on It's good stuff, man. I mean, let's just talk about it. She represents a lot. You know, and again, I",
            "start": 1803.52
        },
        {
            "text": "and I did I didn't like I just looked at it. I was like, \"Okay, I see that.\" But didn't pick up on It's good stuff, man. I mean, let's just talk about it. She represents a lot. You know, and again, I don't remember all the things, so I don't want to spoil anything, but mother's brother is Aled, so she she's got both going on, which is why she has the eye, cuz the aled have the spiral eyes like that. And it's like, oh [ __ ] And they have their own language, which is a full language. They made a full language for this game, like the letters correlate with with letters for every single thing, and you could like learn the language and like decode. I will go collect every single goddamn book there is in this game to figure out this language. I've missed maybe one or two, but I have devoted myself. I've put myself in bad situations to get these books because I am obsessed with decoding the language and figuring it all out. It's very cool of like if you play this the second time, all the",
            "start": 1852.4
        },
        {
            "text": "myself. I've put myself in bad situations to get these books because I am obsessed with decoding the language and figuring it all out. It's very cool of like if you play this the second time, all the books that you found the first time, you can upload them so you can quickly get the language going and then you can find the ones you missed or you can already have it. And it's cool because when you start doing it, there's puzzles that play into it. There's also freaking when they speak, you start to actually see the you see in the subtitles. So cool. So smart. Damn. And so yeah, she's got a lot going on. She's got a big dad who's like gave his life cuz he's not around anymore. And she's also she's got Albed blood as well. So she's got a mix of stuff going on that's going to play big into this cuz there's three groups here. There's the Albed, there is the Yeanites, and there is the Guados. There's the Guados. Guados. Yes. And so there's like three groups here going on. And of course the",
            "start": 1892.24
        },
        {
            "text": "cuz there's three groups here. There's the Albed, there is the Yeanites, and there is the Guados. There's the Guados. Guados. Yes. And so there's like three groups here going on. And of course the al the Yevanites believe in Yevan, which is like, hey, we don't mess with machines. The Albology known for the machines and technology and they don't [ __ ] with that, Tim. Even though they got a giant Blitz Ball stadium in the next place. What you're going to talk about, you know, it's like we're cool with Blitz Ball though and that giant stadium. But it's it's water powered. It's not machine powered. It's true, Tim. It's true, Tim. So we go on this journey with her and the only way you're allowed in the temples is if you're a high summoner or her guardians. And her guardians are her guardian dies. And so we sign up. We we join because there's an instant connection. They look at each other from across the way as she's summoning that beautiful bird. And you can just feel it. It's like, oh",
            "start": 1933.84
        },
        {
            "text": "dies. And so we sign up. We we join because there's an instant connection. They look at each other from across the way as she's summoning that beautiful bird. And you can just feel it. It's like, oh [ __ ] there's love in the air. These two, they're meant to be together. Okay, there's there's a bigger thing going on here. And so we sign up. We're like, we'll be your guardian. We'll go with you. And so we go to Kilica. That's the next island we want to go to, which has the next giant, the big blitz ball arena as well, right? That one is in Luca. Oh, okay. Yeah. So, I got confused cuz I was like, \"Oh, shoot. What's this crazy island that we go to gets absolutely destroyed by sin cuz we get on the boat, sin comes up, we latch on to the whale tail of it, and we're riding this thing, and we're fighting off sin spawn. This shit's crazy.\" And this sin rips through Kilica, destroys the island, right? We arrive, we're here to help. Then we leave like 5 minutes later. We like we're like, we got",
            "start": 1977.76
        },
        {
            "text": "fighting off sin spawn. This shit's crazy.\" And this sin rips through Kilica, destroys the island, right? We arrive, we're here to help. Then we leave like 5 minutes later. We like we're like, we got what we needed. See you. They're out here banging together 2x4s just trying to get a house again. We didn't really help them out. I apologize to Kilica. And so we leave Kilica after getting another summon. What was that summon? If Yeah. Valfor Yeah. Cool that I'm allowed to name all of them, too, cuz I named him Roger. So what did you name your Val for? The bird. the coups after cos from Pokemon. Uh, you know, any birds will be the coups. Can we talk about the coups? Just tight abs. Like why does this bird just got washboard abs? My thing is I like this was my first Final Fantasy. So this is like how I learned about the summons. And like I feel like Valfor never gets any love. Like gets replaced with Phoenix all the time, which which makes sense. Like like Yeah. Like Valfor's is not in",
            "start": 2021.12
        },
        {
            "text": "like how I learned about the summons. And like I feel like Valfor never gets any love. Like gets replaced with Phoenix all the time, which which makes sense. Like like Yeah. Like Valfor's is not in any of the more recent ones. That's crazy. Yeah. It's very interesting of how fast you get replaced by Ifrit because we immediately go for the second one. So you're like Roger. I love Roger. Roger has come through in the clutch. I have some incredible battles with Roger of like once you start to learn that certain things can heal your characters if they're using that. And Roger can be healed off of fire spells. clutch moments with Roger of like and how cool is it that the way that it works is the different elemental aons uh if they get attacked with that elemental element they heal themselves. I was like you dumb stupid idiot. I got you. You know what I mean? It felt so good Tim. And so we go to Kilica. We go to the temple first temple right that you experience technically I guess second",
            "start": 2068.56
        },
        {
            "text": "I was like you dumb stupid idiot. I got you. You know what I mean? It felt so good Tim. And so we go to Kilica. We go to the temple first temple right that you experience technically I guess second cuz the first one I kind of missed my first time but like this is the real temple of like go find the destru destruction sphere. figure out how to get through the temple. Tim, if I was 12 years old, there's no way I'm getting through this. That shit's crazy. Pull spheres off the wall. Put them into these awkwardly not very well displayed areas. Shove them in the wall. You'll get through it. Some of the later ones are nuts, Tim. I mean, I'm in the Bevel Temple and we're on a [ __ ] escalator going up and down. I'm trying to time it so I can either go left, right, or center. And I'm freaking out with the button pads. How' they make these temples and why are people getting through them? That [ __ ] was crazy, man. I would have put that [ __ ] down. You're a bigger better man. I got the chat",
            "start": 2110.72
        },
        {
            "text": "with the button pads. How' they make these temples and why are people getting through them? That [ __ ] was crazy, man. I would have put that [ __ ] down. You're a bigger better man. I got the chat helping me. You know what I mean? I got I literally watched I had to watch the YouTube video of Bevel at the same time as I'm playing. And so this guy's like two steps ahead of me and I'm freaking out trying to follow him cuz it's so difficult. And everybody's yelling you got to get the destruction spheres, but I don't know what those are. Like I don't know how that's helping me. They're like you got to get the destruction sphere which gets you the extra chest, but I don't know what it gets me. Okay. Yeah. What is it? I don't know. Just better items, better weapons, and things like that. And then they were like, \"Oh, Mike, you got to get Lulu's ultimate weapon, step up to the lightning bolt, and dodge it a 100 times.\" And I'm like, \"Oh, that.\" See, that's the thing. I grinded. I got all the",
            "start": 2152.64
        },
        {
            "text": "they were like, \"Oh, Mike, you got to get Lulu's ultimate weapon, step up to the lightning bolt, and dodge it a 100 times.\" And I'm like, \"Oh, that.\" See, that's the thing. I grinded. I got all the legendary weapons in this game. And yeah, having to dodge the lightning 100 times is that one of those gamer moments that uh it's a make or break, but no one's made. Everyone's broken. Tim, I dodged the first two. Everyone in the chat popped off as I'm like, \"Watch this. I got it. Boom. Banged on by the third one. I immediately say, \"We're not doing that.\" And I just walked away from that. That is an insane task to do. 200 200 cuz at one point you you hear it right. There's like this weird clock ticking down and you can kind of see it on the screen and you're like, \"Oh, I got that.\" And then the moment you're not on rhythm with that, it's over. You'll never catch the rhythm again. You'll never see it. It's over. So good. Uh, Mike, I really want to keep talking about this, but we need to",
            "start": 2191.12
        },
        {
            "text": "the moment you're not on rhythm with that, it's over. You'll never catch the rhythm again. You'll never see it. It's over. So good. Uh, Mike, I really want to keep talking about this, but we need to take a quick ad break. We'll be right back. This podcast is brought to you in part by Stash. Are you still putting off saving and investing because you'll get to it someday? Stash turns someday into today. Stash isn't just an investing app. It's registered investment advisor that combines automated investing with dependable financial strategies to help you reach your goals faster. They'll provide you with personalized advice on what to invest in based on your goals. Or if you want to just sit back and watch your money go to work, you can opt into their awardwinning expert managed portfolio that picks stocks for you. Stash has helped millions of Americans reach their financial goals and starts at just $3 per month. Don't let your savings sit around. Make it work harder for you. Go to",
            "start": 2233.68
        },
        {
            "text": "that picks stocks for you. Stash has helped millions of Americans reach their financial goals and starts at just $3 per month. Don't let your savings sit around. Make it work harder for you. Go to get.stache.com/kindafoney to see how you can receive $25 towards your first stock purchase. and to view important disclosures. That's get.stach.com/kindfunny. Paid non-client endorsement not representative of all clients and not a guarantee. Investment advisory services offered by Stash Investments LLC and SEC registered investment of advisor. Investing involves risk and investments may lose value. Offer subject to TNC's. We got some super chats. Krabby Patty says, \"This game's part of who I am. great memories of watching my brother play this and even my mom loved loves this game. Getting to relive this with Mike and everyone's been giving me such an amazing time. I love it. That's that's so great. Shout out to you, Krabby. I totally get it. There's a um I don't know how much of this I'm",
            "start": 2278.88
        },
        {
            "text": "relive this with Mike and everyone's been giving me such an amazing time. I love it. That's that's so great. Shout out to you, Krabby. I totally get it. There's a um I don't know how much of this I'm allowed to say, but I I should be fine. There's a uh Lost in Colt, who make amazing like video game magazines and like books and stuff. Um they're putting out a big Final Fantasy retrospective um sometime, I want to say this year. um they've been working on it for a while and uh they reached out to me to which is very very nice of them to choose a Final Fantasy and like write about it. Uh and so I wrote a whole thing about uh 10 and like how the religion and technology and all that stuff kind of like connects and like inspires the world and all that stuff and uh can't wait for it to come out because it should be pretty cool. But damn, that's beautiful. CJ Splitz on says uh Final Fantasy 10 hype killed Final Fantasy 9 which is why I can't love it. I totally get it, man. like it's like what",
            "start": 2328.0
        },
        {
            "text": "it should be pretty cool. But damn, that's beautiful. CJ Splitz on says uh Final Fantasy 10 hype killed Final Fantasy 9 which is why I can't love it. I totally get it, man. like it's like what do you mean? Let me read a couple more and then I'll explain it. Um and then uh Momo says, \"Tim, we got to talk about the run Square had with Final Fantasy 9, 10, and 11. What an unbelievable run for those three games.\" But basically from 6 to 11 all the way through they were crushing it. Yeah. I don't know why you started where you did there because I mean I would even say like seven, eight, nine, like all them back toback like Mike they were popping these things out almost annually. Really? Yeah. Final Fantasy 7, 8, 9, 10, all came out like within like 5 years and that was on the PS1 era. PS1 and then this was PS2 in the PS2 era. Yeah. So, it just came out very close to Final Fantasy 9 on PS1. So, it kind of just overshadowed it because like by the time we got there, it was the third Final",
            "start": 2370.08
        },
        {
            "text": "then this was PS2 in the PS2 era. Yeah. So, it just came out very close to Final Fantasy 9 on PS1. So, it kind of just overshadowed it because like by the time we got there, it was the third Final Fantasy on PS1. Everyone was waiting for the next gen, but nine's amazing, too. So, okay. Um, couple more here. CB Patty says, \"Greg, you play Blitz Ball?\" Greg doesn't know [ __ ] about Blitz Ball. I'm walking up to everybody asking them to play blitz ball with me. The moment that I was allowed to start recruiting, I was asking everybody and I'm paying max contracts. If you want to play with me and the bet ballers, I'm paying max contracts. Uh, we got at least who tried gaming says, \"What would you list Final Fantasy 10 of games of all time for you, Mike?\" So far, very early to say, but like is this an alltimer for you? This is an alltimer. No question about it, Tim. This is all This is one of those of like the oh wow moments you experience when you've never experienced the game or maybe a",
            "start": 2412.8
        },
        {
            "text": "this an alltimer for you? This is an alltimer. No question about it, Tim. This is all This is one of those of like the oh wow moments you experience when you've never experienced the game or maybe a movie or some album and it really speaks to you and hits you in a special way. This is going to be something that sticks with me. Hell yes. This is a special one. Um Yangfam says, \"It warms my heart. Mike's playing through all my favorite JRPGs from my childhood. Feels like Mike's going through a Namora run of games. We need to have Titsuya Namora games in review. That'd be wild. Come hang out with me. Let's talk.\" Um and yeah, there we go. So Mike, back to you. Okay. So then we leave Kilica. Okay. In just absolute destruction, you know, if the High Summoner came to my island and we Yeah, we just we left them. We said, \"We got to go play Blitz Ball Deuce. Double L's double L's deuces.\" So then we pull up to Luca and it's a grand [ __ ] stage. Giant Blitz Ball arena. The whole city's packed",
            "start": 2454.32
        },
        {
            "text": "we left them. We said, \"We got to go play Blitz Ball Deuce. Double L's double L's deuces.\" So then we pull up to Luca and it's a grand [ __ ] stage. Giant Blitz Ball arena. The whole city's packed and excited because everybody's coming for this blitz ball tournament. Every island around has come. Every city has come to play blitz ball. Everybody, you know, is there. And the bet ballers have never won a game. But there's something different this time because Tetus has got them feeling some different way. We're not here to play and have fun. No, no, we're here for victory. He tells them, \"We're here to win.\" And he inspired them because he got off that boat and they were like, \"The bet ballers.\" And everybody was like, \"Boo, nobody wants to see them.\" And this man grabbed a megaphone on the docks, grabbed you and said, \"The bet said ballers are here to win. You better keep an eye on us, ladies and gentlemen, and they were like, \"You suck.\" It's crazy. They're so awesome, right? And so",
            "start": 2496.88
        },
        {
            "text": "docks, grabbed you and said, \"The bet said ballers are here to win. You better keep an eye on us, ladies and gentlemen, and they were like, \"You suck.\" It's crazy. They're so awesome, right? And so now we see this beautiful city, like one of the larger cities. Don't know if you know, Tim, future spoilers. Sin attracted to the cities, okay? It's coming. Sin is coming. And so as we arrive, we start to gear up and get ready for our first blitz ball game. I'm excited because I had yet to see Blitz Ball. Hold up. Quick rewind. On the boat between Kilica and Luca, there's a ball on the boat. You learn the jet shot in a very crazy way. Yeah, weird little mini game thing. Crazy mini game. You also learn about uh Chapu a little bit and Lulu. It was a beautiful moment with Lulu and Waka talking about Chapu and you overhearing it and it's like, \"Oh [ __ ] that guy lost a brother and that girl lost like her man.\" Like, that's tough stuff right there. Beautiful moment. And then you learn the move,",
            "start": 2541.36
        },
        {
            "text": "Chapu and you overhearing it and it's like, \"Oh [ __ ] that guy lost a brother and that girl lost like her man.\" Like, that's tough stuff right there. Beautiful moment. And then you learn the move, right? So I'm I'm itching to hit the jack shot. Okay. Mark three. Not mark one or two. Mark three. And so I'm dying to do it. So I play my first game. Okay. First half, of course. Why is Tetus not allowed? Or Tetus not Tetus is allowed in the game, but he doesn't use the jet shot until you equipped it in the second half. So I never get to use the jet shot. [ __ ] They teased me. Yeah. They know I wanted it, right? Yeah. And so then that's like an exped or expedition game to just get you loosened up, get you ready. But at the same time, something going on, Tim, you hear it. The Abed have arrived and they're our first game. But for some reason, they have kidnapped Yuna. And now before game one of the tournament, the official tournament, we have to go save Yuna from the Albed who are on a ship",
            "start": 2588.56
        },
        {
            "text": "and they're our first game. But for some reason, they have kidnapped Yuna. And now before game one of the tournament, the official tournament, we have to go save Yuna from the Albed who are on a ship ready to leave the island trying to distract Big T and Waka from their first Blitz Ball tournament game. Not today. And so we hatch a plan. We're like, \"Yo, Waka, you play. Stall him out. We'll go get Yuna. We'll pop a flare to let you know we've saved her. Then you can play.\" Because the plan was Waka was just going to lose. He was going to wrap it up. They were going to give us back Yuna. baby and we're going to call it good. You know what I mean? No, none of that. We go out, we get on the boat, we save Yuna. Okay. Also, Albed, why are you kidnapping Yuna? We don't know yet. We don't know yet, but like kind of weird vibes right now. Why are you kidnapping people? We don't know what's going on. Great story with that. Can't wait to get to that in just a little bit. I don't even remember",
            "start": 2634.8
        },
        {
            "text": "yet, but like kind of weird vibes right now. Why are you kidnapping people? We don't know what's going on. Great story with that. Can't wait to get to that in just a little bit. I don't even remember that part, Tim. They're kidnapping high summoners because they don't want the summoners to fully commit to the to the pilgrimage because they have to die. They have to kill. That's my sacrifice. And he's like, I can't let this girl do that. That's the [ __ ] high summoner, Lord Bratza's daughter. I'm not going to let her give herself like that. We can find another way is what the Albed's saying. Like, we can come together and figure this out. We got this machina. Like, let's use this. Let's not do that. And so, they're kidnapping all the summoners to try to keep them away from completing the pilgrimage because they don't want them to sacrifice themselves. Crazy [ __ ] When Waka hears that, his whole mind explodes. Okay, this man is battling with every inner demon he's ever had in his",
            "start": 2681.68
        },
        {
            "text": "the pilgrimage because they don't want them to sacrifice themselves. Crazy [ __ ] When Waka hears that, his whole mind explodes. Okay, this man is battling with every inner demon he's ever had in his entire life. Okay, racism. He's about to [ __ ] give that [ __ ] up right now cuz he now learned it. Beautiful moment later on. He's almost there. He's not there, y'all. I can't commit to walking yet. Okay, but we pop the flare. We save Yuna. He completes the game and wins, which means we get to play game two. At the same time, before game two comes out, what happens? We get introduced to the straight up Kingdom Heart of Kingdom Hearts characters, Seymour. See more guad guad guad guadato. He comes out in the deepest V. Tim. I mean this V is touching his thrust bucket. Yeah. Okay. And it's a sexy body. Two parts coming out on the pecs. Hair hair not at the titties but below the titties. And it's got a hot hair. It's like that it's like that stomach hair that you kind of want on your abs.",
            "start": 2719.36
        },
        {
            "text": "sexy body. Two parts coming out on the pecs. Hair hair not at the titties but below the titties. And it's got a hot hair. It's like that it's like that stomach hair that you kind of want on your abs. And this guy this guy is so hot it's unbelievable. And he's followed up by Maester Micah. Okay, we got a couple maesters out there. Maesters, that's right. Don't forget about the maesters, right? And Maester Micah and Lord Seymour are there. Seymour's there to enjoy blitz ball. He's here to hang out. And boom, we go into the locker room and Waka's like, \"Boys, I'm hanging it up. We got our first win ever, but I'm hanging it up.\" And you're like, \"What the [ __ ] Waka? Like, we're about to win this tournament right now. What do you mean you're retiring after this game?\" He's like, \"Boys, I'm done. I've given it my all. I'm not playing anymore. So, I get to play my first official official blitz ball game ever. First half, you have Tetus. He doesn't have jet shot because you can't equipp it,",
            "start": 2768.0
        },
        {
            "text": "I've given it my all. I'm not playing anymore. So, I get to play my first official official blitz ball game ever. First half, you have Tetus. He doesn't have jet shot because you can't equipp it, right? So, the first half I'm battling for five minutes. I'm out here. I'm swimming around. I'm passing the ball. I'm hoping to get a shot off, but I'm playing defense. I'm playing big defense. I I hold it zero zero. It's a draw going into halftime. And I'm like, \"Yes, I'm gonna get Jet Shot on Tetus. Nobody can stop me because Jet Shot goes through two defenders and then gives you the ultimate kick. Well, guess what? Titus sits your ass down because Waka's playing. [ __ ] Okay. It's his last game and he's got to put on for a city. I get it. So, Waka is the center. Okay. Waka, lety [ __ ] Jabroni boy over on the left. These guys suck. They can barely get a pass off. Barely get a shot. I'm fighting for my life. But you know who's holding it down? Keep in the background. Keepa Kea's my dude.",
            "start": 2810.96
        },
        {
            "text": "boy over on the left. These guys suck. They can barely get a pass off. Barely get a shot. I'm fighting for my life. But you know who's holding it down? Keep in the background. Keepa Kea's my dude. I've signed him to a multi-year contract. Okay, Tim, it's five seconds left and they start to drive and I'm like, \"Oh [ __ ] they're gonna score a goal before this game is over. We're going to lose the tournament.\" And it goes bing. Game is over. And I go, \"Ah, we got a draw.\" Like, that sucks. They go, \"No, overtime. Overtime, baby.\" And I go, \"Oh [ __ ] it's overtime time. What can I do?\" And I put Walker in the center. I do this. I go, \"Walka, you're not on the side anymore. You got the best shot in the game. I need you in the center. I need you to win this blitz ball tip off. I need you to grab the ball, take four swims up, and just let this thing rip. And sure as [ __ ] Tim, just as I drew it up, he swims, grabs the puck. He takes four dribbles up, and he lets this thing ride. Do we",
            "start": 2859.92
        },
        {
            "text": "grab the ball, take four swims up, and just let this thing rip. And sure as [ __ ] Tim, just as I drew it up, he swims, grabs the puck. He takes four dribbles up, and he lets this thing ride. Do we have the video? I put the toxic shot up. Oh, Bear. Yeah, that that we don't have the video, but Tim, I'll tell you what, it's the greatest moment of my video game career. I let I look at it. I'm about 40 yards out from the goal. And if you've played blitz ball, you know that there's a shot meter. Let's say it's 11. Okay, the goalkeeper has eight. So, you have to beat you have to get to the goalkeeper with nine or above to get past the goalkeeper cuz he has eight, which will stop that. But every time it travels, it starts to tick down. 11 10 nine. So, you got to be kind of close to the goal. And I'm adding it up in my head. I'm like, [ __ ] 11 eight. He's far away. It's not going to add up. What do I do? Toxic shot. I I don't even know what toxic shot does, but I just let it rip, right? And",
            "start": 2899.44
        },
        {
            "text": "I'm adding it up in my head. I'm like, [ __ ] 11 eight. He's far away. It's not going to add up. What do I do? Toxic shot. I I don't even know what toxic shot does, but I just let it rip, right? And it's like 20 and he [ __ ] kicks this thing from half court and it flies and it's flying and it's come nine eight and it hits the goalkeeper and goes past him to score and win. Tim and I'm out here celebrating. I'm up. I'm jazzed up. I'm screaming for Waka and the Bayside ballers. Okay, we did it. But get this. We can't celebrate, Tim. Oh, here's the play. We got to see this. We got to see this. Can we get audio? Come on, get there. Oh, that's halftime. That's not it. You know what? For a team that's He's going to get there. He's We're almost there. We're almost there. No time to celebrate cuz Sid has arrived. Oh, of course. And it's breaking loose. It's freaking out. And guess who showed up, Tim? Aren has showed up after 10 years of being away. Here it is. [ __ ] it. This is it. 8 seconds",
            "start": 2941.92
        },
        {
            "text": "Sid has arrived. Oh, of course. And it's breaking loose. It's freaking out. And guess who showed up, Tim? Aren has showed up after 10 years of being away. Here it is. [ __ ] it. This is it. 8 seconds into overtime. Hit the shot. 13. Goalkeeper's got eight. Venom shot gives me 20. Let it rip from half. Here it comes. Look at the shot counter on that. Oh my god. From half [ __ ] court. I'm so proud of you, Mike. I'm throwing up the double L's. Oh my god, man. I believe in Blitzfall now. I believe in it. I'm addicted to Blitz Ball. And so now all [ __ ] has hit the fan. Sin has invaded the city of Luca. Seymour is up there casting the most insane summon you've ever seen. That [ __ ] blinking all of these monsters out of existence, right? And at the same time, Aaron has arrived and he's helping the squad. And Tus is like, \"Arin, what are you doing here?\" Was the summon anemma? The big demon looking mummy thing. Yeah. Okay. Okay. That thing is so cool, bro. And so Arin's there and he's",
            "start": 2996.56
        },
        {
            "text": "the squad. And Tus is like, \"Arin, what are you doing here?\" Was the summon anemma? The big demon looking mummy thing. Yeah. Okay. Okay. That thing is so cool, bro. And so Arin's there and he's like, \"T's like, we got to get you back. We got to talk about this stuff.\" And then we've we [ __ ] saved the world. And Arin's like, \"I'm gonna come with y'all. I'm gonna help you out. I'm going to become a guardian.\" But at the same time, Maester Micah is like, \"You've been gone for 10 years. What's your deal, bro?\" It's like 10 years, homie. We fast forwarded a thousand years. What What are you doing, homie? What are you doing? Little hint of like, \"What's up? What's up with Orin?\" Chad, put a little put a little note next to him. Like, what's his deal? But his deal is is he's gonna join the crew. And this guy is that guy. Like I'll take him all day every day. So now our group becomes six. We haven't got Ricky Ricky on the squad yet. So we're six now instead of five. It's building up. You",
            "start": 3057.12
        },
        {
            "text": "And this guy is that guy. Like I'll take him all day every day. So now our group becomes six. We haven't got Ricky Ricky on the squad yet. So we're six now instead of five. It's building up. You got there's three people on the battlefield. Tim, I got six bodies to get through. That's a lot of lot of lot of movement there to get XP. Okay. Then after that, Tim, we go on our pilgrimage. Okay. We've committed and we before we start this pilgrimage have one of the most beautiful scenes in video games that a lot of people don't understand when they first see it. It's the laugh. Okay. Yuna talks about her journey cuz she knows she knows inside what's has to happen. But she hasn't told Tetus. He hasn't really figured it out. The rest of the crew knows, but Tetus doesn't know. And she talks about like this journey is going to be hard. And I try my best to keep a smile on my face. And you should too. you should learn how to smile and laugh. And he's like, I can't smile and laugh. And they have",
            "start": 3095.6
        },
        {
            "text": "like this journey is going to be hard. And I try my best to keep a smile on my face. And you should too. you should learn how to smile and laugh. And he's like, I can't smile and laugh. And they have this fun moment. And it gave me goosebumps because I I realized it, right? You know, I know it's a meme. I know we laugh, but like that [ __ ] was good. Out of context, people are like, \"Look, video game voice acting is bad.\" It's like, \"No, in context, it's one of the most beautiful moments I've ever seen.\" Beautiful, Tim. And so, at the same time, he teaches her how to whistle. He says, \"If you're ever in trouble, you don't forget this part. I'll be there. I will be there.\" Right. And so, she's learning how to whistle. It's some of the cutest [ __ ] ever. We leave Luca and we're on the path and we're on the road. Okay. We leave there and we meet this lady Shelinda. I don't know if you know Shelinda. Small character. I always say hello to Shelinda. She's like a priestess that's heals you",
            "start": 3140.16
        },
        {
            "text": "and we're on the road. Okay. We leave there and we meet this lady Shelinda. I don't know if you know Shelinda. Small character. I always say hello to Shelinda. She's like a priestess that's heals you on the road. She's everywhere. I don't know what her deal is. She's everywhere. A little girl in green. You'll know who she is. I promise you. You look her up, you'll know who she is. She's always there. That's right. She be in every city, everywhere. Okay. Yeah. Yeah. Yeah. Yeah. Yeah. And then after that, we go back. Operation Mihen, sit on the beach. Oh no. Tim, can you believe that this game gasses you up that fast that you journey out of Luca? And we then travel up north cuz we're heading north. North is the pilgrimage. You always go north, right? We head up north. We meet some cool people. The captain of the Chocoo Riders, she's got two other jabronies with her. That lady is incredible. Right. We start to head up to Operation Mihen. And I'm telling you what, man. All of a sudden,",
            "start": 3176.08
        },
        {
            "text": "The captain of the Chocoo Riders, she's got two other jabronies with her. That lady is incredible. Right. We start to head up to Operation Mihen. And I'm telling you what, man. All of a sudden, the tone has shifted. We went from winning the Blitz Ball Cup. We went from welcoming Aren on to the team. We went from, \"Hey, Sin might be your daddy.\" Okay, we didn't really talk about that, but Aron was like, \"Yo, Sin might be your daddy. Don't tell anybody.\" He's like, \"What do you mean my dad?\" He's like, \"Sin might be your dad. Okay, just be ready for this. Okay, keep it in your back pocket.\" We go to the operation on the beach, Tim, and it's all out war. Okay. They're like, \"Yo, if you go past this point, just know that this this is going down.\" And we go in there and the squad is all set up. We have now teamed up with the Albed. We have said, \"Let's use Machina. We don't use this stuff, but we're going to use it here.\" And we've lined the shoreline with cannons, every Machina you can",
            "start": 3223.04
        },
        {
            "text": "up. We have now teamed up with the Albed. We have said, \"Let's use Machina. We don't use this stuff, but we're going to use it here.\" And we've lined the shoreline with cannons, every Machina you can imagine. We got Chocoo Riders. We got the Yevanites. We got the Albed Chocoo with the like armor on. Armor on. We're going to fight sin. We're going to draw sin to us, right? You know what sin's really drawn to? Tus. Okay. The hymn, dude. The hymn. The hymn of the faith. The [ __ ] You hear the hymn of the faith. And you know it's going down, Tim. And so we draw sin because we've captured a sin spawner. We put this thing in a trap and we're telling it, \"Come into the cove.\" Okay? And [ __ ] all out war starts. Okay? The sin spawner gets out the cage. We fight that thing back. Boom. All of a sudden, sin, this giant whale sea creature comes out of nowhere. City on its back. I got some thoughts on the city on its back. We'll talk about in just a second. But it comes out and we're blasting it",
            "start": 3267.84
        },
        {
            "text": "sin, this giant whale sea creature comes out of nowhere. City on its back. I got some thoughts on the city on its back. We'll talk about in just a second. But it comes out and we're blasting it with everything we got and it's got this force field and it retracts the force field and shows its fleshy face and then boom, shoots this giant cannon and everything blows up. I mean, if you thought Thanos snapped the world, this thing snapped the goddamn universe. That [ __ ] was crazy, man. This [ __ ] was wild, too. Never seen anything like this when I saw it for the first time as a kid. Like them getting wiped out scared me. It was so cool, Tim. It was It was scary. It was It was horrifying because at the same time, he snaps everybody. Yuna teams up with Seymour to fight back the sin spawner one final time. And all of a sudden, we wake up on the beach, everyone gone. And Tetus, he hears the call. He's like, \"Is that my dad?\" And he starts swimming after this thing. And I mean, he's",
            "start": 3318.16
        },
        {
            "text": "one final time. And all of a sudden, we wake up on the beach, everyone gone. And Tetus, he hears the call. He's like, \"Is that my dad?\" And he starts swimming after this thing. And I mean, he's swimming, Tim. He gets so close to sin and we're next to the city and he feels the presence of his father and you're like, \"Oh [ __ ] sin is his daddy. This is crazy.\" And he believes it. He's like, \"I felt something that day and I know. I know I felt it.\" And you're like, \"Oh my god, this shit's crazy.\" Right. And so, of course, he can't keep up with S. He goes back to the beach and we got to kind of pick ourselves up. We're like, \"Oh [ __ ] this is crazy.\" So, we head up to Josie, the Josie temple. I like to call it the Josie, but Josie Temple. And that's where we meet some other summoners along the path. Donna and my main man. Donna, baby. Oh, Donna. Shout out to Donna. Oh, Donna. Oh, Donna, you're incredible. Donna's there. She's talking trash as usual. Donna wants to be it. Okay. Donna",
            "start": 3362.08
        },
        {
            "text": "the path. Donna and my main man. Donna, baby. Oh, Donna. Shout out to Donna. Oh, Donna. Oh, Donna, you're incredible. Donna's there. She's talking trash as usual. Donna wants to be it. Okay. Donna wants to complete it. She wants to be it. Donna's got a beautiful story. Okay, just so you know, we eventually get on the ship after all this is said and done. And Donna looks at Tetus and she's like, \"You know what? I don't want to do this anymore. I would actually prefer to take a break. Maybe sit a sit a nice my sip of my Thai sit on the beach. Me and Bartolo, we could hang out. And you know what I told her? I was like, \"That's fine, Donna. You don't got to do this.\" Okay, cuz I think Donna realizes she's putting her life on the line and she might not want to do that anymore. But before that, Donna's a badass. Okay, Donna's a super badass, which I absolutely love. So, we get another uh summon out in Josie, which is great. We get the the thunder goat which I named LeBron Ixion. The leg",
            "start": 3408.0
        },
        {
            "text": "Donna's a badass. Okay, Donna's a super badass, which I absolutely love. So, we get another uh summon out in Josie, which is great. We get the the thunder goat which I named LeBron Ixion. The leg goat. Ixion is right. We have a beautiful moment after Josie where we pull up to the banks of the Moonglow River Tim and like there's this beautiful scene, perfect lighting, fun like 2000s, you know, HD cut scene. It just makes you smile. But there's this moment where they all gather around and they go right here is going to be the last time we ever have just this moment. They will never be the same. like we're moving forward and we're going to hit some [ __ ] Like as much as you wish we could just sit here forever, enjoy this moment because it's over and you're like, \"Oh man, this is some heavy shit.\" You know, is this the moment in like the blue forest? Uh this is like on the river side. No, you think Blue Forest is a little bit further on. That's where we get the sphere. We get introduced",
            "start": 3450.24
        },
        {
            "text": "shit.\" You know, is this the moment in like the blue forest? Uh this is like on the river side. No, you think Blue Forest is a little bit further on. That's where we get the sphere. We get introduced to the sphere and I'll tell you all about that in a second. So, we're on the side of the river and then we get a great little side story about your dad because we get introduced to what takes you across the river, Tim. The shoe shoos don't eat the giant elephant creatures that you ride across the canal, right? And we get this beautiful story of like before Tetus and his father had a very tumultuous relationship. His father was drinking a lot at the time, wasn't the best dad to Tetus. Also might not have known how to have been a dad. He was struggling. He was having a lot of tough times, right? And Tetus resented his dad a lot because of that and always wanted him to stop drinking. He would be like, \"Stop drinking.\" He's like, \"I'll stop tomorrow.\" He's like, \"Well, then why don't you do",
            "start": 3495.52
        },
        {
            "text": "And Tetus resented his dad a lot because of that and always wanted him to stop drinking. He would be like, \"Stop drinking.\" He's like, \"I'll stop tomorrow.\" He's like, \"Well, then why don't you do it?\" He didn't do it. You know what I mean? But then boom, we get introduced to the shoe poof. The shoe poof. And we get this beautiful story that Art tells of like your father was so shook up by seeing this monster in the dark. He didn't know what it was. Thought it was a fiend. Swiped at it. It still has the scar to this day. And that was the day your dad stopped drinking. And it was like, \"Oh [ __ ] I just got chills. Dad might be trying to change his ways on this journey that he's on. What do you mean you were traveling with my dad? What do you mean? What do you mean? What do you mean? Why would you be doing that?\" Arin, what is going on right now? And so you get introduced to this beautiful creature. Maybe some of the crew have already been there, right? Kamari says, \"I remember when",
            "start": 3540.56
        },
        {
            "text": "would you be doing that?\" Arin, what is going on right now? And so you get introduced to this beautiful creature. Maybe some of the crew have already been there, right? Kamari says, \"I remember when Yuna fell off the shoe and you you fell off a couple more times cuz she was jumping in, having fun, just swimming around, having a blast. It's this beautiful moment of like bringing the team together, but knowing once we cross this canal, it's on. Like there's no backseats here. We're going forward. And so we leave that and we head to Guad Salam because Seymour wants to see us. Seymour has a request. He wants us there in his private chambers because he wants to ask us something. And so we travel to Guad Salam, this beautiful giant tree city, and we head into the the depths of it all. And we meet Seymour. And we're seeing some family paintings. It's odd. Where's Seymour's dad? Where's his daddy at, Tim? And so we talk to Seymour. And Barrett, if you'll bring this up, there's two scenes of",
            "start": 3578.08
        },
        {
            "text": "Seymour. And we're seeing some family paintings. It's odd. Where's Seymour's dad? Where's his daddy at, Tim? And so we talk to Seymour. And Barrett, if you'll bring this up, there's two scenes of Seymour and Yuna. You'll see in a second. Tim, if a man ever walks up to your girl and whispers something in her ear, and she does this reaction. I need you to know, Tim, that you might not ever see her again. Okay? Because at this moment, Seymour leans in and whispers to Uda, \"I want you to marry me.\" Now, Seymour has some diabolical plans. We don't know that Seymour's evil quite yet. We think he still might be on the level, right? And so, he whispers to Yuna, \"Let's get married.\" We come back and Yuna goes, \"He wants me to marry him because he wants to bring us together. He wants to bring Spirit together. And because of this, the whole world will rally behind our marriage, right? The the typical religious thing of like, let's bring these two groups of people together. Let's marry them.",
            "start": 3624.96
        },
        {
            "text": "together. And because of this, the whole world will rally behind our marriage, right? The the typical religious thing of like, let's bring these two groups of people together. Let's marry them. They'll be together, right? And we're going to celebrate that. But at the same time, we're like, whoa, whoa, whoa. You know, you know, like you, you and Tus are meant to be. This doesn't feel right. Yeah, we all [ __ ] know. And as we spend more time in Guad Salam, Seymour says, \"Take all the time you need. You go meet me up in Macarena. I'll see you soon.\" said mal malana macalana. Yeah, malana. Yeah, that's good. So, they do make a Macarena joke, which is great. And so, Se was like, \"Don't worry, take your time. I'll see you up there.\" We do a little exploring and Unifi's a sphere. These spheres record almost like R2-D2 putting up the hologram. The memories. The memories, right? And she might have found a memory sphere of Seymour's father who said, \"Yo, there might be some foul play here.",
            "start": 3674.88
        },
        {
            "text": "record almost like R2-D2 putting up the hologram. The memories. The memories, right? And she might have found a memory sphere of Seymour's father who said, \"Yo, there might be some foul play here. [ __ ] Seymour killed me. Okay, Seymour killed me. Don't believe anything he says. Pretty damning. And so as we're here in Guad Salam, we have this beautiful moment of going to the far plane. Summoners are tasked with the job of passing a soul onto the afterlife. It is Yuna's goal here anytime someone dies to help them pass the right way and move forward. And so here in the far plane, we get this beautiful moment of seeing memories and people of the past when we transcend and we have this awkward moment of Aurin is like I'm not going in there. You're like, \"What do you mean, Arin? Like, get up in here. Everybody else is going in there.\" It's like, \"I'm not going there.\" And you're like, \"That's weird.\" Seymour's father comes through and Arin's like, \"Fucking put that spirit back in the jar",
            "start": 3720.24
        },
        {
            "text": "in here. Everybody else is going in there.\" It's like, \"I'm not going there.\" And you're like, \"That's weird.\" Seymour's father comes through and Arin's like, \"Fucking put that spirit back in the jar right now.\" And she's like, \"He's in pain. He's not right.\" And he's like, \"No, put that spirit back in the jar.\" We go through and we have this beautiful moment. There's Chapu and [ __ ] Waka. And Lulu's watching from afar. And you have this beautiful moment of Lulu going, I have to put the past behind me and I I might need to move forward. And like I'm I'm not ready for that, but I'm ready for that. And you're like, damn, Lulu, you're ready for love. Like Chapu and you I thought had the moment. It's like that was a long time ago. Like I'm a new, you know, I've moved on. And [ __ ] Waka's having this beautiful touching moment where he's like, I'm with this guy now and he reminds me of you, bro. I gave him your sword. You're like, oh [ __ ] Like that's crazy. And then you see Chapu and",
            "start": 3770.24
        },
        {
            "text": "having this beautiful touching moment where he's like, I'm with this guy now and he reminds me of you, bro. I gave him your sword. You're like, oh [ __ ] Like that's crazy. And then you see Chapu and you're like Chapu's that dude you know Waka is the brother not quite there. Chapu that's that guy bro. Chapu gave his all for that beautiful girl Lulu. And then we see a nice moment with of course Lord Brasa and his wife and L uh Yuna. And they have this great moment and Tina she's like call to your dad. And he hasn't told her yet because Ar's like don't tell Yuna about your father being sin cuz it will throw her off her game. Don't [ __ ] do it. and he goes, \"I'm not I'm not calling my dad.\" She's like, \"Just call your dad.\" And his mom shows up and he has this beautiful moment of the mom and it's this awesome shot of these two overlooking the city. It's Jet and his wife and Tetus is in the background yelling, \"Daddy, play with me.\" He's like, \"Not right now, son.\" Cuz they're trying to",
            "start": 3806.88
        },
        {
            "text": "it's this awesome shot of these two overlooking the city. It's Jet and his wife and Tetus is in the background yelling, \"Daddy, play with me.\" He's like, \"Not right now, son.\" Cuz they're trying to have this moment. And like you forget there's so many family dynamics, right? and this man and his wife were just trying to have moments together and they had this beautiful child and they were trying to figure out the right stir of the pot of everyone getting time together and these two weren't getting a lot of time together and it's this beautiful thing and it's like oh [ __ ] Tus is like oh [ __ ] maybe I didn't understand all that I thought I knew and you're like [ __ ] Tus deep bro this some deep [ __ ] Tus deep [ __ ] this some deep [ __ ] Tus and so you're like damn the far plane is so dope right and so we we move past the spirits. We move past that and we move towards going to the Macarena temple. Okay. And in that journey, we go through this beautiful lush jungle where we fight",
            "start": 3852.08
        },
        {
            "text": "dope right and so we we move past the spirits. We move past that and we move towards going to the Macarena temple. Okay. And in that journey, we go through this beautiful lush jungle where we fight this crazy [ __ ] water creature that switches different elemental. What color is the jungle? Uh like green and blue. Okay. Yeah. Green, blue type vibes. It's before you hit the snowy mountains because that's where Macarena is. And so in this we find another sphere, a jet sphere. And Jet went on a journey with [ __ ] the high priestess, Lord Brasa, and Aarin. And these three jabronies went on his pilgrimage. The reveal. What? They had a pilgrimage. What? They went on their own pilgrimage. And Jet's like or like, \"Yeah, dude. Your dad and I and Lord Brasa, we set off, bro. And your dad had these moments of realizing, oh [ __ ] I got to be a better [ __ ] father.\" So he puts down the bottle. He starts recording this message to his son. He's like, \"You might not watch these. Like, you might",
            "start": 3895.6
        },
        {
            "text": "moments of realizing, oh [ __ ] I got to be a better [ __ ] father.\" So he puts down the bottle. He starts recording this message to his son. He's like, \"You might not watch these. Like, you might hate me, but like I got to tell a little bit of my story and why I'm doing this, bro.\" And you start to connect. You're like, \"Oh [ __ ] [ __ ] Jet, bro.\" And now Jet and Lord Brasa and Arn are up in the snow cap mountain. How sick is that? Filming like it's a vlog, dude. It's Dude, what a squad that's got to be. They should make a video game about that. They've talked about that for 30 years now, Mike. I'm like, \"Give us the prequel, man. Let us play that.\" We get this beautiful moment and it's just like, oh [ __ ] Like Tetus is now learning things about his dad. He's learning things about the journey. Like he is really growing as a character, but he hasn't learned one thing yet. And we talked about it at the top of the show. He hasn't learned about the sacrifice. And the sacrifice is going",
            "start": 3947.28
        },
        {
            "text": "Like he is really growing as a character, but he hasn't learned one thing yet. And we talked about it at the top of the show. He hasn't learned about the sacrifice. And the sacrifice is going to blow his mind because man oh man, it's been gumdrops and lollipops until he learns about that and everything changes. So then we head to Macarena. We stop. Shout out to the all bed uh man Rise Ren Ren who owns all the shops and then there's the merchant outside who's like I buy from their shops and then I sell you at a double price. Have you met Riku's dad? Jet. No. Riku's dad. Yes. Named Sid. Sid baby. Sid never. We'll talk about dad in a second. So then we go past that. We go to the Macarena temple. Insane temple puzzle. You're pushing pedestals down the ice cliffs. You're [ __ ] banging into ice things. So much fun. Very Pokemon Gold. Very, very cool, right? And that's of course where I think we fight Seymour. We fight Seymour here. Okay. Yeah. Seymour wants to battle us cuz we're like, we",
            "start": 3988.48
        },
        {
            "text": "things. So much fun. Very Pokemon Gold. Very, very cool, right? And that's of course where I think we fight Seymour. We fight Seymour here. Okay. Yeah. Seymour wants to battle us cuz we're like, we object to this wedding. He's like, you're not objecting to [ __ ] And we fight him. And that's when he calls forth the summon. And the chat was popping off of me like, \"Don't let this summon fill up the bar, Mike. If you let this guy fill up the bar, you're dead.\" And thankfully, Roger Roger carried me through. He came through. Roger carried me through that fight. I battled him. You unlocked the next summon, which is Shiva. Shiva, dude, she's looking good in this game. Maybe my favorite design of her, dude. I love when she get summons and she does or when her attack and she snaps and it like breaks all the ice stuff. So cool, man. And so we battle Seymour. We kill Seymour. And Aren literally goes, \"Pass his soul now. Send that [ __ ] to the bottle right now.\" And everybody's panicking,",
            "start": 4043.28
        },
        {
            "text": "breaks all the ice stuff. So cool, man. And so we battle Seymour. We kill Seymour. And Aren literally goes, \"Pass his soul now. Send that [ __ ] to the bottle right now.\" And everybody's panicking, freaking out. And his homies show up and his crew grabs him and runs out the door. And you're like, \"Oh [ __ ] we killed him, right? You thought, [ __ ] you thought.\" Okay, we'll talk about that in a minute. But we we kill Seymour and you think, \"Okay, that's crazy.\" We leave the Macarena temple and what happens, Tim? Ice troll, [ __ ] cave troll, send us to the bottom of the temple. Now we're in this like hazy dark area, right? We're [ __ ] like, \"Oh [ __ ] is everybody okay?\" And Yuna's laying up on a rock like it's Titanic. She's like, \"Let me just rest a little bit longer. I'm so tired.\" You know what I mean? She just fell like 100 feet in the ground. And we're like, we're like, \"Oh shit.\" Like, \"What's that noise?\" You hear it? The him, dude. [ __ ] Sin has arrived. Sin teleports us to",
            "start": 4088.24
        },
        {
            "text": "know what I mean? She just fell like 100 feet in the ground. And we're like, we're like, \"Oh shit.\" Like, \"What's that noise?\" You hear it? The him, dude. [ __ ] Sin has arrived. Sin teleports us to the desert and we have the ultimate anime moment where the whole crew is now cast out and we have to piece everybody back together. So, I'm in this desert. I'm in the oasis. I have no idea where I'm at and I [ __ ] I start grabbing people, right? And at this time, just so you know, Chad, I've I've kind of cruised past. We got Ricky in the party. Ricky also stop tried to stop the Abed from kidnapping Yuna again on top of the ice where we got a six snowmobile shot. And so then Ricky was part of the group. Great stuff. She the outbed came and she's like, \"Don't do it.\" And they're like, \"We got to do it.\" They they must have by now. But have they Do you know the uh relationship between Riku and another character? That doesn't happen till the plane. And that is Riku and Yuna are cousins. Yes.",
            "start": 4138.0
        },
        {
            "text": "do it.\" They they must have by now. But have they Do you know the uh relationship between Riku and another character? That doesn't happen till the plane. And that is Riku and Yuna are cousins. Yes. Yes. That will happen on the plane. We'll learn all about that because Spear or Yuna is part Alb Ben. And so we get teleported to the oasis. We start gathering our team together and we're like, \"Where the [ __ ] is Yuna?\" And Ricky goes, \"Oh [ __ ] we're home. She's back there. We got to go.\" And so we find the home city of the Albed. That's right. And it's this [ __ ] desert badass temple oasis called home, right? And [ __ ] has hit the fan. The alarm is going off. The most annoying alarm in video game history is going. You remember this thing? No. You remember this chat? What's the noise? The the alarm is making the most grading unreal noise you've ever heard in your life. And it doesn't stop. You can go to the grid sphere, doesn't stop. You be in a fight, it doesn't stop, bro. This",
            "start": 4180.64
        },
        {
            "text": "The the alarm is making the most grading unreal noise you've ever heard in your life. And it doesn't stop. You can go to the grid sphere, doesn't stop. You be in a fight, it doesn't stop, bro. This [ __ ] is crazy, Tim. And so it's hitting the fan. The guados are straight up invading home to try to take Yuna from the Albed who has captured Yuna to try to protect her as we know, right? And so we get there, we [ __ ] battle through monsters in Albed. An annoying thought. An annoying thought. Yes. All dude, all day with that noise, Tim. And so we battle through all of that. We're like, we're like, Ricky, where would they keep Yuna? And she's like, they keep the high they keep the high summoners in the basement. That's where we got to go. And so we battle to get down there. She's not there. It's [ __ ] mayhem. And it's like, where is she? Donna's on the ground [ __ ] the other jabron another jaboni that's a high summoner's like bro you ain't it okay you and your brothers you should get",
            "start": 4233.12
        },
        {
            "text": "It's [ __ ] mayhem. And it's like, where is she? Donna's on the ground [ __ ] the other jabron another jaboni that's a high summoner's like bro you ain't it okay you and your brothers you should get out of here quick you don't want to give up your life for this right and that's when walker's really battling he's seeing the albed he's learning about the albed that like the albed everybody was tight and then the yeanites were like yo if you're using those machines you're out of here and they [ __ ] outcasted all the albed all around the c all around the globe and they came back to meet in the oasis at home that's where they made the little homeland and we're [ __ ] there and shit's hitting the fan. You can see Ricky's she's not happy at all. Waka's like [ __ ] Like what is happening right now? Like my mind is blowing because everything I thought is not not for real anymore. But clearly my people were really wrong. Kicking y'all all out. You're losing your home right now. And they're",
            "start": 4284.64
        },
        {
            "text": "now? Like my mind is blowing because everything I thought is not not for real anymore. But clearly my people were really wrong. Kicking y'all all out. You're losing your home right now. And they're like, \"Everybody, we got a plan.\" And all of a sudden, Tim, we get in this [ __ ] spaceship and Sid's like, \"Get on board cuz it's going down.\" And we get up in the air and this spaceship is the most beautiful thing you've ever seen. Okay? And it's flying and [ __ ] goes, \"We can only do one thing. We have to destroy our home.\" And they're like, \"What?\" And he's like, \"We have to destroy our [ __ ] home right now.\" And they uturn this thing, Tim, and he [ __ ] flies this jet directly at their homeland and blows that [ __ ] up. Riku's crying. Waku is just battling every inner demon he's ever had. [ __ ] is like, \"We've done the right thing. We have to go find Yuna.\" And at this time, this is when all the reveals come through, right? The Aed have been kidnapping all these high summoners",
            "start": 4326.48
        },
        {
            "text": "had. [ __ ] is like, \"We've done the right thing. We have to go find Yuna.\" And at this time, this is when all the reveals come through, right? The Aed have been kidnapping all these high summoners because they don't want them to complete the pilgrimage because they don't believe in them giving up their life to fight back sin, right? We find out that Yuna and Riku are definitely related. They are cousins because Yuna's mother was Aled and she married Lord Brasa. They had Yuna. Riku, she's connected with all them. They're connected. Waka's having a midlife crisis. Lulu's like, \"Yo, we got to find Yuna.\" [ __ ] my man Kamari, which we haven't talked a lot about. He's just there. He's like, \"We're going to go get her, right? We're on the ship. It's mayhem.\" And while this is all happening, I'm recruiting everybody to play Blitzfall. I'm like, \"Yo, you play blitz ball. You play blitz ball.\" He's like, \"Don't worry if the alarm's going off. We just blew up your home world. We're going to",
            "start": 4374.8
        },
        {
            "text": "I'm recruiting everybody to play Blitzfall. I'm like, \"Yo, you play blitz ball. You play blitz ball.\" He's like, \"Don't worry if the alarm's going off. We just blew up your home world. We're going to play Blitz Ball together.\" Right? That's when you meet Donna. Donna's like, \"I'm good on this.\" Like, \"I don't want to do this no more.\" I'm like, \"Donna, go take a seat. You don't got to do this.\" Right? And we're we're scrambling the [ __ ] locator. We're like, \"Where is she?\" And he's like, \"We got her. She's in Bevel.\" And we see this [ __ ] video screen pop up. And she's in the baddest wedding dress you've ever seen. Seymour has ditched the deep V. He's got the [ __ ] tux on and they're going to be married. And he said, \"Hold on. We gunning this thing.\" And that leads us to one of the most hype moments ever, Tim. Like we brought up at the top of the show, we have the music playing. We're running up to grinding down the rails, jumping back and forth. It's like, what are we watching",
            "start": 4421.92
        },
        {
            "text": "most hype moments ever, Tim. Like we brought up at the top of the show, we have the music playing. We're running up to grinding down the rails, jumping back and forth. It's like, what are we watching right now? We said absolutely not. And then as we get up there, the Mr. Micah starts to [ __ ] say the words and oh my god, what a reveal this is, right? So, get ready. Mr. Micah starts to say the words to put these two together. She pulls out the wand and she's going to start passing him right there. And he looks at her with those eyes and he says, \"You wouldn't do that on our wedding day. You know that. You wouldn't do this in front of your friends. It's either them or you and I.\" And she looks at him and you're like, \"Pass this [ __ ] right now.\" And she puts the staff down and you're like, \"No, don't do it.\" And they just start making out. I mean, this man's V is so deep. And it's like, \"Oh [ __ ] she ain't never coming back, y'all.\" And they start making out. And Tetus is tweaking.",
            "start": 4462.32
        },
        {
            "text": "\"No, don't do it.\" And they just start making out. I mean, this man's V is so deep. And it's like, \"Oh [ __ ] she ain't never coming back, y'all.\" And they start making out. And Tetus is tweaking. He's like, \"This is [ __ ] Stop this shit.\" Right. And so then we have this beautiful reveal that it's [ __ ] a spiral. The death spiral, bro. Life, death, sin, and everybody. And what's the name of the the continent we're on? Spir spiral. Tim, it all comes to life that these [ __ ] are dead, Tim. They're dead. These spirits have come back cuz they never pass. And they have been living for generations. We have let the dead run a muck and these guys are not giving up their power. And they're like, \"No, no, this is the spiral, bro. We're not stopping sin. We're just living.\" And you're like, \"No, that's not how this [ __ ] is going.\" And everybody's mind is [ __ ] exploding. We even got a guy who the catman who's like, \"You're dead.\" And he he wasn't too happy about that. He was like, \"A",
            "start": 4512.68
        },
        {
            "text": "\"No, that's not how this [ __ ] is going.\" And everybody's mind is [ __ ] exploding. We even got a guy who the catman who's like, \"You're dead.\" And he he wasn't too happy about that. He was like, \"A [ __ ] Master Micah might be doing some stuff. I'm a judge. I got to stop this shit.\" Like this [ __ ] is insane right now. So now we definitely know Aaron is definitely dead. He's a spirit that somehow has not passed. We know that Seymour is clearly a spirit that hasn't passed. Master Micah, who's up to no good, he's not a spirit that's passed. It's crazy, right? I don't know how much they straight up tell you, but I'm pretty proud of you for seemingly catching on to some of this stuff. It's all happening in front of you. And then at the same time, she stands up and she says, \"No, we ain't doing this.\" And you're like, \"What are you doing? And she says, \"I'm not doing this.\" And she takes four steps back and he looks at her and he goes, \"Don't you do it.\" And she goes, \"I'mma do it.\" And",
            "start": 4565.92
        },
        {
            "text": "this.\" And you're like, \"What are you doing? And she says, \"I'm not doing this.\" And she takes four steps back and he looks at her and he goes, \"Don't you do it.\" And she goes, \"I'mma do it.\" And Tina's like, \"Don't do it.\" And I thought I was like, \"Oh [ __ ] this is going to be some crazy stuff right now.\" And she falls. She says, \"I'm out of this thing.\" And you're like, \"Oh my god.\" And then cut to the most incredible cut scene of her falling, hands up, and you're like, \"Oh my god.\" And what happens? the [ __ ] bird [ __ ] comes and catches her and you're like, \"Oh my god, bro. This is crazy, Tim.\" And then we get surrounded by guns and they're like, \"You're going to you're going on trial.\" And Orange's like, \"You mean you're going to kill us?\" And we've been thrown in jail. And that is my Final Fantasy 10 story so far. So far so halfway there. Mike, you got to do this again. We got to do a part two. Let's try to get the rest of the game in there because this was incredible. Thank",
            "start": 4607.2
        },
        {
            "text": "my Final Fantasy 10 story so far. So far so halfway there. Mike, you got to do this again. We got to do a part two. Let's try to get the rest of the game in there because this was incredible. Thank you so much for that. I'm so happy you're enjoying this game. Uh what's your plan for continuing playing it, Tim? I played this game every single day. I'm going to play it every single day until it's done. I love that. I can't stop playing this game. That is amazing. Well, stay tuned everybody. Watch Mike streams and then of course stay tuned to the Kind of Funny Games cast for us to do this again. Let us know in the comments below how much you love Final Fantasy 10. Uh we do have a couple super chats I want to get to before we leave. Um, Jake Britain says, \"Tim, are you seeing the Doomsday Cast announcement stream? This is going to be stacked.\" Uh, I have been watching it all throughout the day. We're about to do our Daredevil screencast. I will update the boys about where we're at",
            "start": 4657.12
        },
        {
            "text": "Cast announcement stream? This is going to be stacked.\" Uh, I have been watching it all throughout the day. We're about to do our Daredevil screencast. I will update the boys about where we're at currently. Uh, even though it's feels like we have hours left of this, but uh, very exciting. And then Key says, \"I have to donate to celebrate Mike's incredible Final Fantasy 10 run. This content's amazing.\" Thank you. Thank you so much for your support. Uh, well, until next time. If you're on Twitch, stay right where you are. If you're on YouTube, make the jump over to the Daredevil screencast episode. Until next time, love y'all. Goodbye.",
            "start": 4697.36
        }
    ]
}