{
    "id": 13751,
    "video_id": "RFm8q-MikMU",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Greg Miller",
        "Barrett Courtney",
        "Blessing Adeoye Jr.",
        "Jared Petty"
    ],
    "title": "Nintendo Switch 2 Rumors Ramp Up - Kinda Funny Games Daily 03.20.25",
    "description": "Go to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\n\nGo to http://meundies.com/kindafunny and use code kindafunny to get 20% off your first order, plus free shipping on orders of $75 or more.\n\nGo to http://factormeals.com/factorpodcast and use code FACTORPODCAST to\nget 50% off your first box plus free shipping.\n\nWe’re here to talk about video game news!\n\nToday after, KFGD, you’ll get:\nGAMESCAST - Every Mario game ranked w/ Bless and Tim\nThen the STREAM is more Pokemon Nicklocke\nIf you’re a Kinda Funny Member:\nToday’s Gregway is 25 minutes about the behind the scenes of the Elder Scrolls Online Podcast - a kinda funny game.\nBIG NEWS: Tomorrow brew some coffee because Sam Lake and Mikael Kasurinen from Remedy are coming through for a Gamescast interview with Greg and Roger. Starting at a special time 10am PT followed by KFGD with Tim & Ben Starr! GET HYPED!\nThank you to our Patreon Producers: Delaney Twining, Karl Jacobs, & OmegaBuster\n\n00:00:00 - Start\n00:05:00 - Housekeeping\nThe Roper Report   -\n00:09:15 - Xenoblade Chronicles X Appears to Have a 'Hidden' 60 FPS Mode, Sparking Nintendo Switch 2 Speculation - Eric Van Allen @ IGN\n00:18:02 - Nintendo Expands Its Seattle Mariners Partnership To Put Logo on Jerseys - Eric Van Allen @ IGN\n00:26:45 - Ken Kutaragi has a Nintendo PlayStation in his closet, it’s emerged - Chris Scullion @ VGC\n00:30:52 - Ad  \n00:37:00 - The GDC Awards’ 2025 Game of the Year winners are in - Matt Patches @ Polygon\n00:43:35 - A Persona 4 Remake could get revealed soon - Zuhaad Ali @ The Game Post\n00:45:54 - Microsoft Gaming Boss Phil Spencer Says Xbox Fans Will See More Movie and TV Show Adaptations, Despite the Failure of Halo - Wesley Yin-Poole @ IGN\n00:50:40 - Wee News!\n00:53:40 - SuperChats\n00:59:30 - You‘re Wrong\n\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1742494357,
    "duration": 3844,
    "transcript_chunks": [
        {
            "text": "[Music] Today's stories include a bunch of Nintendo news, including Switch 2 speculation. Bellantro wins big at the GDC awards and Persona 4 remake could get revealed soon. We have all this and more because this is kind of funny games [Music] daily. Yo, what's up? Welcome to Kind of Funny Games Daily for Thursday, March 20th, 2025. I'm one of your hosts, Blessing Addie OA Jr. Joining me is WWE legend Greg Miller. Hello, Bless. How are you? I'm doing well, Greg. How are you doing? Is that the legend? I could be better. I could be better. I forgot my coffee. Can you Can you bring my coffee? It's right there. The other cup. Thank you. Don't spit in it. I don't want to spit in this. You just have somebody in the back waiting to bring your coffee for you. This is an intern. This is an intern here. Come on in here. He's trying out. He's He's seeing if he We didn't have money to hire interns anymore. Wait, I'm one of those unpaid interns. I was going to say unpaid. I was going to say, who",
            "start": 2.12
        },
        {
            "text": "here. Come on in here. He's trying out. He's He's seeing if he We didn't have money to hire interns anymore. Wait, I'm one of those unpaid interns. I was going to say unpaid. I was going to say, who said we were paying? The one, the only, the Reverend Jared Penny. Hey everybody. How you doing? I'm great. Jared, how are you? I missed you. How's GDC going? Uh GDC is wonderful. It's GDC is like video game summer camp. It's an opportunity to see all the people that you love most in the world. I'm here kind of like like speed dating all of you at once today. Dropped in the office just to see everybody, all the old friends that, you know, made my life and career what it is. Sure. Thank you for that, by the way. Again, how's that going? Uh, yeah. Oh, yeah. I just got laid off. Laid off. You know what I mean? Yep. Man, it's almost like it's a bad idea to ever leave. Kind of funny, isn't it? Get it, you know. Bad idea to get a trivia show, a game show, and then leave. Huh? Don't ever don't get",
            "start": 56.32
        },
        {
            "text": "what I mean? Yep. Man, it's almost like it's a bad idea to ever leave. Kind of funny, isn't it? Get it, you know. Bad idea to get a trivia show, a game show, and then leave. Huh? Don't ever don't get any ideas, bless. This could be you. I could be bringing me my coffee, bless. I'm just saying, you know, I I'll come back for what you were paying me before. That's still not going to help. So, what's the next So, what are next steps? What's going on? You are you you're taking meetings. You're doing the thing. I'm doing the thing. I'm here at GDC looking for a job, which is what a lot of people do at GDC. I don't know if folks outside here know that, but GDC is also largely about job networking. Unfortunately, you know, right now there are no jobs in video games at all. Trouble. That's trouble for you. People are Yeah. So, I'm I'm doing my best. People are trying to help me. Kind people helping one another. I mean, once a long time ago, you gave me a job and I threw it in your face and",
            "start": 91.2
        },
        {
            "text": "for you. People are Yeah. So, I'm I'm doing my best. People are trying to help me. Kind people helping one another. I mean, once a long time ago, you gave me a job and I threw it in your face and left. So, Exactly. Exactly. And that's that's what we do. That's But yeah, thank you for asking, Greg. How are you, man? I'm good. Tired. It's been a big week. Yeah, I know you're tired. I'm tired. Everyone's tired. Cole Beans is back here. He's tired. He's been pooping nonstop. Yeah, you This is like the third mention of poop this morning. I I'm on my way here this morning and Greg like sends me a text. He's like, \"Hey, uh I was hoping to see you a little before the show, but you know, Ben was like, \"Oh, I got to poop.\" So, we were I was making it was the first day this week of, you know, doing the solo dad morning of like, \"I'm gonna make it. I'm gonna get out of here on time.\" And it was, \"All right, Ben, put on your shoes. I got to poop.\" Well, Jared, I'm gonna be there when I'm there.",
            "start": 128.4
        },
        {
            "text": "the solo dad morning of like, \"I'm gonna make it. I'm gonna get out of here on time.\" And it was, \"All right, Ben, put on your shoes. I got to poop.\" Well, Jared, I'm gonna be there when I'm there. Yeah, I feel him. Listen, I came in this morning. I was like, I thought I pooped before I left. Why am I I'm prepping KFGD. I got to go. Wait, do you need to poop right now? I mean, that's too much. That's TMI for the audience. TMI for the audience. I do need to poop right now. Tell you right now, he refuses to poop at the office. I don't like pooping in the office bathroom. Whoa. Is it cuz everybody like smells your stank or? No, it's just like a level of comfort thing. I like being at home. Oh, really? Okay. Some people really just like to poop at home and only at home. Yeah. I don't know. It's always been a thing for me. public bathrooms. I mean, I try to avoid it, too, but like like I can't go a whole day at work without pooping if I've like had like, you know, the wrong thing the day",
            "start": 163.92
        },
        {
            "text": "always been a thing for me. public bathrooms. I mean, I try to avoid it, too, but like like I can't go a whole day at work without pooping if I've like had like, you know, the wrong thing the day before. So, well, the thing that's nice for me is that my body has like, you know, adjusted to the schedule of either before I go to work or once I get home from work. The body knows if I'm at work, my body's like, \"No.\" But today's is one of those days. I think it's cuz my schedule it's been a whole week. GDC, it's been tiring me out. I also got a hot take about GDC. I mean, hold on. He's got a hot take. What's the hot take about GDC? Listen, I love GDC. It's great. Why is it a week? Why? Why? Why can't it be a GDC weekend? Well, why is everybody still in town? Go for it. This is the normal thing, right? Where the expo does didn't open till Tuesday. Wednesday. Yeah. The expo floor open Wednesday. Yeah. So, it's like it's like it's in it's like old E3 where it's like you get there on Friday.",
            "start": 200.88
        },
        {
            "text": "right? Where the expo does didn't open till Tuesday. Wednesday. Yeah. The expo floor open Wednesday. Yeah. So, it's like it's like it's in it's like old E3 where it's like you get there on Friday. You're doing all this stuff and then the show doesn't start till Tuesday after. God damn it. I do need the time. Like I've been here like this is my third day and I think I'm going to have like 30 meetings alto together in the three days. So, you need that time. You got to cram it in there. You do. But It's crammed in there right now. It is crammed in there right now. Oh, is it crammed in there right now? Man, there's a lot more scatological discussion than I expected. Jared, we can turn it around right now. Beer. Thank you. We love you. Thank you very much. I love you, too. I'm going to go poop y'all. Jesus. Have fun. I'm going to live vicariously through you. Let's talk about some video games. Y'all remember this is kind of funny games daily. Each and every weekday, we run you through the",
            "start": 235.76
        },
        {
            "text": "y'all. Jesus. Have fun. I'm going to live vicariously through you. Let's talk about some video games. Y'all remember this is kind of funny games daily. Each and every weekday, we run you through the nerdy news you need to know about live on YouTube, Twitch, and on podcast services around the globe. If you love what we do, support us with the kind of funny membership on Patreon, YouTube, and now Spotify and Apple podcast to get all of our shows ad free. Watch us record them live and get a daily exclusive show. For a chance to be a part of the show, some of your thoughts and opinions as YouTube super chats as we go. Housekeeping for you. We're in 11 business all about live talk shows. So, today after KFGD, you're going to get Games Cast, which is me and Tim talking about every Mario game. It's going to be a I was about to woo and then Kevin sneezed in the middle of it. I was muted and I unmuted. I thought I was muting myself. I'm sorry. I'm sorry about that folks. You guys heard the",
            "start": 274.32
        },
        {
            "text": "It's going to be a I was about to woo and then Kevin sneezed in the middle of it. I was muted and I unmuted. I thought I was muting myself. I'm sorry. I'm sorry about that folks. You guys heard the full 10 [ __ ] years. He's the longest running employee here. Here's the thing. There's no way he sneezes like that in private, right? No, that's that can't that can't be a nobody's around. I've said this many times. I sneeze so hard sometimes it cuts the back of my throat. You should get that checked. What are they going to say? I don't know, man. Maybe that sounds like a thing that's not supposed to happen. The air from your back. It's a force. It's a force. Dear lord. Uh, of course, after Games Cast is going to be the stream, which is going to be more of that Pokemon Nick Lock. If you're a Kind of funny member, you can get today's Gregway, which is 25 minutes about the behind the scenes of The Elder Scrolls Online podcast, a kind of funny games cast limited series. Do you want to talk",
            "start": 312.88
        },
        {
            "text": "Kind of funny member, you can get today's Gregway, which is 25 minutes about the behind the scenes of The Elder Scrolls Online podcast, a kind of funny games cast limited series. Do you want to talk about that? Uh, we started filming the Elder Scrolls Online uh podcast yesterday, and so we did we got two episodes in the can, two more to go today. So, I talked a bit about how it's going, the success of it. There's other stuff in there, too. You know what I mean? Talking talking about Apple increasing the prices of Patreon pledges. You see this? No, wait. Who? Apple. Yeah. So, if you subscribe through the Patreon app, they just all of a sudden the our our subscription in quotes jumped to like 14 bucks because now they're 30% on there. So, if that happened to you, of course, remember you can just go to patreon.com/kindfunns subscribe there and then you could log into the app and you'd be fine. But if you purchase through the app, the price went up. But there was like weird Gregway",
            "start": 357.76
        },
        {
            "text": "can just go to patreon.com/kindfunns subscribe there and then you could log into the app and you'd be fine. But if you purchase through the app, the price went up. But there was like weird Gregway questions a couple days ago of like why price go up. Like what the [ __ ] you talking about? I didn't even I was like this isn't even what they don't. Uh I got a super chat here from Kyle Labou who writes in says bless the question we all want to know. Did Greg fill in the info for Gregway? I don't know if you know this. You're on strike too. Well well yes today you did good today. You did good today. I didn't get it yesterday or and then it was what the day before that. Two days before. It was like yeah the time I hosted before that. It's that thing where this GDC is just me with the too many limes thing where I got to drop some limes and that's the lime that's been getting dropped. I apologize. I told you I wanted to be better about it and you said, \"Hey, I don't believe in you.\" I've",
            "start": 395.36
        },
        {
            "text": "limes thing where I got to drop some limes and that's the lime that's been getting dropped. I apologize. I told you I wanted to be better about it and you said, \"Hey, I don't believe in you.\" I've given you no reason to believe in me, but I'm trying, buddy. Hey, I believe you. Thank you. I love you. Uh, of course, if you're a kind of funny member, like I said, you can get today's Greg Way. Also, big news tomorrow. Brew some coffee because Sam Lake and Male Caserin is that I don't know, Male, but yeah, I would assume so. Yeah, the crew from Revity, uh, they're coming through for a Games Cast interview with Greg and Roger. Starting at a special time that is happening at 10 a.m. Pacific, followed by KFGD with Tim and Ben Star. Get hyped for that. Big GC day. Big GC day tomorrow. So, we're flipping games, casting games daily. Sam link and the other remedy fellow male coming in to talk about Alan Wake too. Get you talk about a whole bunch of different things. Control to Let's get into it.",
            "start": 425.76
        },
        {
            "text": "games, casting games daily. Sam link and the other remedy fellow male coming in to talk about Alan Wake too. Get you talk about a whole bunch of different things. Control to Let's get into it. Let's see what the [ __ ] going on. You know what I mean? And then drink the coffee and do the thing. And then, yeah, Ben Star. Wait, actually it's not Tim Benstar. Probably I think it's me and Ben Star on KFC now I think about it. We switched that during the meeting yesterday. Oh, great. Cool. Yeah. So, that's going to be a fun time hanging out with Ben Star. I've always wanted I like that guy. He's cool. Thank our Patreon producers Delenny Twining, Carl Jacobs, and Omega Buster. Today, we're brought to you by Shady Rays, MeUndies, and Factor, but we'll tell you about that later. For now, let's begin with what is and forever will be the Roper Report. D. It's time for some news. news. We have seven stories today. A baker's [Applause] [Music] starting with our number one. What are you looking at?",
            "start": 462.8
        },
        {
            "text": "with what is and forever will be the Roper Report. D. It's time for some news. news. We have seven stories today. A baker's [Applause] [Music] starting with our number one. What are you looking at? What happened? This I've thought about it before, but I've never watched Cole's reaction to the smoke and I don't think you like that. Oh, yeah. No, he has this look in his eyes. It's okay. It's just part of the show. Don't worry. Yeah, that's unfortunate positioning for him. He's like right between the two smoke machines. He's just look He's like He's staring at it now. He's like, \"What's that?\" It's just he's not to that point yet of how old Porty was where he would just sit on the thing. He sit up here. You know what I mean? Like we tried it and he gets over there. He's fine. It's just that I want to check that out. I was thinking about making him a bed in the Stars in the Bank briefcase. Oh, that'd be fun. I like that. Yeah. Yeah, he's fine. Uh our first few stories are all Nintendo",
            "start": 499.68
        },
        {
            "text": "I want to check that out. I was thinking about making him a bed in the Stars in the Bank briefcase. Oh, that'd be fun. I like that. Yeah. Yeah, he's fine. Uh our first few stories are all Nintendo stories. Oh, good. We're huge Nintendo fans. I mean, I'm a huge Nintendo fan. In fact, I hope I'm a big fan of Xenolade Chronicles X because that's what story number one is. Xenolade Chronicles X appears to have hidden a 60fps mode uh or appears to have hidden a 60 fps mode sparking Nintendo Switch 2 speculation. This is Eric Van Allen at IGN. Xenolade Chronicles X Definitive Edition is out today for Nintendo Switch consoles and some players are already digging it into its data to learn more about it. One discovery seems to reveal a hidden mode enabling 60 frames per second which has certainly caused for curiosity and speculation about what it could mean for the Switch 2. Over on X Twitter via WCCF Tech, modder Masa Masa Grado R uh dug into the ex executable of Xenolade Chronicles X",
            "start": 544.32
        },
        {
            "text": "caused for curiosity and speculation about what it could mean for the Switch 2. Over on X Twitter via WCCF Tech, modder Masa Masa Grado R uh dug into the ex executable of Xenolade Chronicles X Definitive Edition and found what they called a hidden 60fps mode. The modder said it seems to be implemented only partially since enabling it causes weird issues. While it's not implemented in the game proper, the existence of the setting does spark some interesting questions. If it's not available, why is it in there? So, what an interesting question. While some stray leftover code could be one answer, some speculation about what this could mean for the Switch 2 and existing Switch games is also easy to understand. Nintendo has confirmed that the Switch 2 will most will be mostly backwards compatible. The official reveal of its next console said that the console will play Nintendo Switch 2 exclusive games as well as Nintendo Switch games with an asterisk that certain Switch games may not be",
            "start": 586.64
        },
        {
            "text": "The official reveal of its next console said that the console will play Nintendo Switch 2 exclusive games as well as Nintendo Switch games with an asterisk that certain Switch games may not be supported on or fully compatible with the Nintendo Switch 2. It's hard to imagine Xenolade Chronicles X would be one of those asterisk games, but there's a question over whether existing Switch games would get enhanced on the nextG console. There's no proof of that yet, but speculation over the usual trends of backwards compatibility. It certainly makes the Switch 2 all the more interesting for existing Switch owners, though. We'll hopefully learn more in a few weeks when Nintendo airs its Switch 2 Direct on April 2nd, 2025. There we'll learn more about the upcoming console and Nintendo's plans for it. Greg Miller, Nintendo Switch 2. Yeah, backwards compatibility. We know what's happening. What's your expectation? Does this get you excited for the idea of we're going to get our games boosted?",
            "start": 635.36
        },
        {
            "text": "it. Greg Miller, Nintendo Switch 2. Yeah, backwards compatibility. We know what's happening. What's your expectation? Does this get you excited for the idea of we're going to get our games boosted? 1,000%. Yeah, this is a big thing, you know, from uh me the other week, month, whatever, where Ben was tinkering with the Switch and then moved on to the PlayStation and I I was I was like, \"Okay.\" And I picked it up. like, you know, I've wanted to play the new Zelda game. No, the newest one, the Echo of Wisdom. Thank you so much. But, you know, I'm like I and I jumped in with cuz Ben wanted to see it and I was like, you know what? I do want to play this, but I still haven't played Link to the Past. No, no, the what? The Gears of the Kingdom. No, no. Oh, Link Between Worlds. No, no. Uh, Link's Awakening, the one that was in the same style. I never I never played the Yes, that's what I meant. And so, I booted that up and I started playing it and Ben was watching, having a great time. And",
            "start": 676.24
        },
        {
            "text": "Awakening, the one that was in the same style. I never I never played the Yes, that's what I meant. And so, I booted that up and I started playing it and Ben was watching, having a great time. And then I was like, \"Holy [ __ ] this runs like trash.\" Mhm. And I was like, uh, it's like enough where I'm like, I don't want to keep doing this right now. Even echoes of wisdom, like playing it. It's a very charming art style, but there's a frame rate there that just doesn't hit for me. Just Yeah. It just doesn't gel, right? And so the idea that uh the Switch 2 could fix that. I was complaining to Tim about it. He's like, \"Well, hold on.\" You know, I mean, don't do this. And of course, I still want to go back theoretically I'm still I have a hunger right now. I have a burning desire to go back to Pokemon Scarlet, which I think I'm just gonna let cook until the new Zah comes out and just jump into Zah and forget about Scarlet because whatever. I I beat all the gyms. I need to go, you know,",
            "start": 716.0
        },
        {
            "text": "to Pokemon Scarlet, which I think I'm just gonna let cook until the new Zah comes out and just jump into Zah and forget about Scarlet because whatever. I I beat all the gyms. I need to go, you know, fight the elite whoever or whatever, but it doesn't matter. Just go in, have the Switch 2, have it run, look better, knock on wood. Hope it hopefully it looks great there, right? Um, so that's the idea here is that there are a lot of Nintendo games that I didn't tinker enough with on Switch and so that I have. And so if it was the idea that, hey, switch 2's here and it's making them look better, it's making them run better, it's shortening these load times, I think of Animal Crossing, be like, oh yeah, I'd love to tinker more with this. Is there like a like um hierarchy of requests that you have as far as that, right? Is it FPS? Is it just load times? Is it wanting better resolution? Is it, you know, are you looking Man, you said everything I'd want. Are you looking for rate tracing? Like",
            "start": 751.36
        },
        {
            "text": "as far as that, right? Is it FPS? Is it just load times? Is it wanting better resolution? Is it, you know, are you looking Man, you said everything I'd want. Are you looking for rate tracing? Like No, I don't I don't need to I don't need to go crazy. It's just more to the fact that like when you reviewed Pokemon Scarlet and we, you know, you see the video the video of the legs kicking and looking just awful. Like I just don't want these games to look like trash. Nintendo has such a great art style and I'm very broad here. A great art style for most of their beloved games and franchises, right? That those should look and run excellent, right? And I think it's, you know, Imran Khan, the dawn, uh I think the number one Nintendo takedown artist out there. Not in a bad way, but of the way of like they put I think it it might have been Zah. They put up screenshots and it was barren or whatever and he's like, \"Look at Xenolade Chronicles. Like, this is the same system. Why doesn't your game",
            "start": 788.16
        },
        {
            "text": "they put I think it it might have been Zah. They put up screenshots and it was barren or whatever and he's like, \"Look at Xenolade Chronicles. Like, this is the same system. Why doesn't your game look why, you know, you can make things look great on this system?\" And that's what I'd want out of these things is, yeah, visual bump for what I already have. Performance bump. If I had to go in order, I mean, frame rate would be at the top. Yes. Let's just be consistent. I'm not even asking for 60. I'm just saying be consistent. Don't make it drop. Then I would say load times. Yeah. Yeah. I'm I mean, I'm an FPS person, right? like I'm always playing performance mode, so I'm always looking for a like better boosted frame rate. I'm hoping for a 60 fps out of a lot of these games. What is interesting about this to me, and again, as you know, uh there's only so much I can keep in the noggin. So much I can focus on. And when we have you and Tim to be the Nintendo guys, I get to just be a",
            "start": 825.76
        },
        {
            "text": "about this to me, and again, as you know, uh there's only so much I can keep in the noggin. So much I can focus on. And when we have you and Tim to be the Nintendo guys, I get to just be a Nintendo provocator. You know what I mean? I get to be a voyer and watch what they're doing from a distance and be excited for it, but not have to know everything. What gives me pause here would be the fact that like it's a mode inside of this. My hope would be, and I'm probably impossible, but my hope would be that the Switch 2 would be like, \"Hey, we're downloading your old Switch games if you want to, and we're doing something in the back end to make them great on their own. It doesn't need to be a mode that we need.\" So, I need am I going to need an Animal Crossing, a Pokemon or somebody else to go back to their old games and add these modes in? Oh, you want 60 frame things like this. I think yes, this implies that it is going to be a thing that you have to turn on or a thing that developers",
            "start": 862.08
        },
        {
            "text": "go back to their old games and add these modes in? Oh, you want 60 frame things like this. I think yes, this implies that it is going to be a thing that you have to turn on or a thing that developers will have to update manually for each game. They'll have to go in and actually push that as opposed to which isn't outrageous, right? I guess that's how it is on when you get like the fancy PlayStation and Xbox versions. Yeah. Yeah. PlayStation 4. PlayStation 5 does some stuff where it's like boost PlayStation 4 and Xbox has done that too where it is like you download. It's not like you're turning on a mode. Just games just happen to run. But but I guess maybe that'll be the thing where it's like, all right, the processing power of the Switch 2, this is all just [ __ ] and we're hypothesizing, the processing power alone will make games load faster and make a more consistent frame rate, but to get something like 60 frames, to get something spectacular, you would need to put the mode in.",
            "start": 902.4
        },
        {
            "text": "the processing power alone will make games load faster and make a more consistent frame rate, but to get something like 60 frames, to get something spectacular, you would need to put the mode in. And I wonder if I mean, I wonder if we're going to get the thing of getting the choice of all right, do you want performance or do you want fidelity? It's funny cuz I don't I still don't associate Nintendo with that. Like I would be surprised if the Switch 2 is a thing where they're trying to push one or the other, especially for Nintendo who are this is we're we are creating art. We are creating a thing and this is how you're going to play it. I don't see them giving you the choice as far as how that presentation goes when it is they want to be so dialed in as far as you know how their games look like. But yeah, like I guess yeah, if you're going back and um if it's a thing where the technology of the Switch 2 itself doesn't automatically give you that jumped up experience, you got to give",
            "start": 936.88
        },
        {
            "text": "like. But yeah, like I guess yeah, if you're going back and um if it's a thing where the technology of the Switch 2 itself doesn't automatically give you that jumped up experience, you got to give us something. I do. I mean, I think the simple fact of most of the worthwhile experiences that you're getting out of the Switch One library are Nintendo games. And so, I think that for Nintendo, like they have control over, oh, we'll just push updates to all those games. Like, we don't have to do it on the hardware side because we have the control of having our studios push all those things on the software side. And so, it's probably just easier that way. Yeah. Yeah. You'd hope so. What's your hierarchy of Switch to uh backwards compatibility boosts? Yeah. 60 fps. Okay. Or not even 60 fps. Frame rate. Good frame rate. I want things to look smooth. Yeah. Um it's the thing where I've talked about this with Tim and Andy as far as what are realistic expectations as far as what you can expect out",
            "start": 974.4
        },
        {
            "text": "rate. Good frame rate. I want things to look smooth. Yeah. Um it's the thing where I've talked about this with Tim and Andy as far as what are realistic expectations as far as what you can expect out of the Switch, right? And I'm not sitting here being like we're going to get RA tracing, we're going to get like we were talking about whether or not we're going to see HDR in this thing, right? Like that's how that's how that's how like low my expectations are for the technological side of the Switch 2. But I don't know, man. I just wanted I I want the games to be pretty. I want to get rid of like some of the like anti-aliasing we see on the characters as far as like I hate seeing the Jaggies. I hate I hate even even for some of the for some Nintendo first party games, you'll look closely at some of these characters and like it just won't be as crisp as you want it to. And Nintendo does such a good job good job with art style where it usually isn't an issue. But I want to see that",
            "start": 1016.24
        },
        {
            "text": "at some of these characters and like it just won't be as crisp as you want it to. And Nintendo does such a good job good job with art style where it usually isn't an issue. But I want to see that smoothed over even more. And so that for sure, I mean 4K is a big one which I think we'll get connected to the TV. And then from there it's like I don't know just makes the games look good. Okay. I think those are my biggest complaints honestly. Yeah. Right. Let's talk more about Nintendo with story number two. Nintendo expands its Seattle Mariners partnership to put logo on the jerseys. Uh this is from Eric Van Allen at IGN. Nintendo has announced it's expanding its partnership with baseball team the Seattle Mariners. Just ahead of opening day 2025, Nintendo has confirmed that every Mariners jersey will have the Nintendo logo on on it this season. The expanded collaboration can be seen in a new promo video released today where Seattle Mariners When I thought it was just a screenshot of the",
            "start": 1057.44
        },
        {
            "text": "will have the Nintendo logo on on it this season. The expanded collaboration can be seen in a new promo video released today where Seattle Mariners When I thought it was just a screenshot of the hat, I was like, \"Good job, Kevin. Good b-roll pull.\" Where Seattle Mariners centerfielder Julio Rodriguez shows off the bright red logo on the jersey sleeve. Per Nintendo's announcement, the console and Game Maker will be will be on jersey sleeves this season, starting with opening day 2025 on March 27th when the Mariners host the Athletics. This is small news that I'm looping into the Nintendo conversation uh just cuz it fits, but then also because I it's happening, right? Like the fact that we're in Nintendo Switch 2 season. Yeah. Yeah. Yeah. Yeah. Yeah. And like we're getting more tidbits of that of like, oh yeah, they're gearing up for that promotion, right? like they're like ramping up that that partnership with the with the Mariners to like, you know, get Nintendo like get the Nintendo",
            "start": 1100.72
        },
        {
            "text": "of like, oh yeah, they're gearing up for that promotion, right? like they're like ramping up that that partnership with the with the Mariners to like, you know, get Nintendo like get the Nintendo name, get get the Nintendo branding out there in front of people's eyes a bit more to like build up this hype. I'm all about it. How do you feel about and I know you're not a baseball guy, but you you like sports, you like soccer, so I guess this is actually an interesting take for you then. How do you feel about the logos on jerseys? I [ __ ] with it. I so before I lived here, I lived in Seattle and I remember in my first few months of living in Seattle, I had a moment where I was like, man, a lot of Xbox fans here cuz I would see like a lot of people walking around with like Xbox logos on their chest and they're wearing like a jersey that says Xbox. And I'm like I'm like, oh man, a lot of I guess Microsoft Microsoft's in Redmond like you know, I guess a lot of Microsoft fans here. Until I",
            "start": 1144.72
        },
        {
            "text": "chest and they're wearing like a jersey that says Xbox. And I'm like I'm like, oh man, a lot of I guess Microsoft Microsoft's in Redmond like you know, I guess a lot of Microsoft fans here. Until I realized I was like, \"Oh, this is for the Seattle Sounders.\" Like Xbox sponsors the Seattle Sounders, right? At least they did while I was there. Um, I honestly think Seattle's pretty [ __ ] dope for having it be a thing of, yeah, Xbox sponsors this, Nintendo, you know, sponsors the Mariners. Like, just to have your sports teams being carried by these video game companies, I think it's [ __ ] awesome. And I mean, coming from like a bit of a soccer background, right? Like, you're used to seeing plenty of logos on I'm used to seeing logos on every single jersey. Like, I associated the Arsenal the the soccer team with Fly Emirates for like the longest time, right? Super chats, I want to know, do you? Number one, well, number one, what's your hierarchy of needs for the Switch 2 in terms of",
            "start": 1181.28
        },
        {
            "text": "the the soccer team with Fly Emirates for like the longest time, right? Super chats, I want to know, do you? Number one, well, number one, what's your hierarchy of needs for the Switch 2 in terms of frame rate, in terms of power and etc. And then two, do we care about jerseys having logos on them? I don't I I don't have I mean, I'm not a baseball guy. And then it's also the fact of Here's what I'll say, Kevin, if you can throw it back up. What I hate about this the same video this just just where we can see the pause. Perfect. What I hate about this is how uninspired and yes, it catches your eye, but I think it's ugly. Like I I would have been like, \"Hey, we we're doing this sponsorship. We want the Nintendo logo on the jersey.\" Of course, you're Seattle. We love Nintendo. And they sent this, I'd be like, \"Cool. Can we take out all can I go in there and take out all of the red, make it the Nintendo pill and blow that up?\" Like, I think if you did that and they give it a red a border",
            "start": 1215.84
        },
        {
            "text": "this, I'd be like, \"Cool. Can we take out all can I go in there and take out all of the red, make it the Nintendo pill and blow that up?\" Like, I think if you did that and they give it a red a border around the Nintendo white border, right? So that you it's not just white on white, but like the it's just so uninspired to toss a giant red patch on there. And I get, of course, the point is to advertise to see it. But you could still, if you blew the Nintendo logo up, put the red around there. You'd be like, \"Okay, cool. I like that better.\" I I see that just lazy. I feel like I think I And you look at this, too. I'm sorry. I keep talking over you. You guys try to get going. You Kevin's showing even closer ups of it. Like you can just see how it's like not It's not even like And I know it's cuz it's a brand new patch. They wear them throughout the season. It'll get better or whatever, but like it's just not it's just so [ __ ] on it. It's just on it. It's laying on top of it. It's like",
            "start": 1259.2
        },
        {
            "text": "cuz it's a brand new patch. They wear them throughout the season. It'll get better or whatever, but like it's just not it's just so [ __ ] on it. It's just on it. It's laying on top of it. It's like ah I agree with that. I think a few things, right? One, I wonder how long this this goes for as far as like this promotion. Like, is this going to be a thing of for the next entire next season, for the next few years, or is this going to be a thing that that lasts through the Switch 2 launch and then by July they're switching it or whatever? I don't know. Um, that's one thing I I wonder about. Another thing is Oh, Justin says in the super chat, the away jersey looks worse with the Switch 2 patch. Can you get me the Aager? Oh, yeah. I guess cuz it would be the full color. you instead of it being on white, it's going to be that teal with a giant red patch on it. Yeah, I think with this one, the Nintendo's history with the Mariners, I think, gives for me gives it a little bit of a of a pass",
            "start": 1297.44
        },
        {
            "text": "on white, it's going to be that teal with a giant red patch on it. Yeah, I think with this one, the Nintendo's history with the Mariners, I think, gives for me gives it a little bit of a of a pass where I think at one point, chat, correct me if I'm wrong, Nintendo owned the Mariners, I think like in like the 90s. Oh jeez. Somebody Kevin found it on Oh no. No. Oh no. If you're an audio listener, pull over and look at this. Oh no. It's even bigger and more red. I take it all back. It's the Switch. It's the Switch JoyCons. The two next to it. Nintendo Switch underneath it. Whoa. Jesus. Oh, no. No. I don't like that one. You're going to show off a new jersey. It's just like they're just in a No wonder they didn't use this one in the [ __ ] video. Man, when you said that about this one, I was like, \"No, it it may like this. I'm not mad at this patch is like kind of iconic, but like this Jesus [ __ ] Like this gross. This makes me think they didn't try on either of them.\" And that Greg is",
            "start": 1334.48
        },
        {
            "text": "like, \"No, it it may like this. I'm not mad at this patch is like kind of iconic, but like this Jesus [ __ ] Like this gross. This makes me think they didn't try on either of them.\" And that Greg is totally right. And it's just off with the They just showed up. They're like, \"Oh, [ __ ] We got to put these on there.\" Do you have that PNG? Well, we've got the one with the two in it. Yeah, it's perfect. Yeah. Why' they do that? Uh, but I definitely feel what you're saying as far as how to stylize it. I think Yeah, if it was just a pill, if it was just like just put the Nintendo logo on the on the jersey. Like, I think it would have been as easy as that without it being a patch, especially this big old patch. But when you're when you're walking around the store, you're going to recognize the the like side of the box that looks just like this, you know? Oh yeah, those are the ones who ruined my jersey. Cuz I was going to say before we actually saw Broadway Images, I was going to say if",
            "start": 1381.92
        },
        {
            "text": "the like side of the box that looks just like this, you know? Oh yeah, those are the ones who ruined my jersey. Cuz I was going to say before we actually saw Broadway Images, I was going to say if they like launched some like like a CM Punk shirt with a PlayStation logo on the back, you'd be all over it. You'd buy five five of those. I mean, well, first off, no. Okay, look, I like I here's one here's something I'll say and it breaks my heart. All right, lots of WWE merch is just ugly as [ __ ] I mean, you're right. I bought that first CM puncture because it was just classic sure and every CM puncture they put out since you're just getting worse. You're just getting more and more into looking like I'm wearing affliction knockoff clothes. Like I'm good. I'm fine. Listen, I feel it. Uh hopping into the super chats a little bit. Uh zombies Keegan writes in and says, \"Do we think Switch 2 will be PPPC compatible?\" Now he's working them in. Now he's weaving them in. I don't know if it'll be",
            "start": 1417.12
        },
        {
            "text": "into the super chats a little bit. Uh zombies Keegan writes in and says, \"Do we think Switch 2 will be PPPC compatible?\" Now he's working them in. Now he's weaving them in. I don't know if it'll be compatible with PP poo poo kaka. Uh, Yangfam says, \"Switch to uh 1080p 8 in screen, better battery.\" Oh, if we're talking about overall features, cuz I guess I was just thinking about the performance aspect. Yeah. Oh, yeah. Make the battery last longer. Not that the battery is bad in the Switch one, but I'm always down for a better battery just in general. Well, yeah, once they did that sec that first revision of the Switch and they put that bigger battery. Yeah, it was great. I've never had a problem since then, but again, I'm not Mr. Switch, Mr. Steam Deck, Mr. Portal. And yeah, J was the one that said it looks worse in in the away. Uh, kebab says performance and then HDR. I don't think it'll do 4K. Yeah, I wouldn't hold for 4K, but you hope. Connect it to the TV. Just saying. It better",
            "start": 1459.76
        },
        {
            "text": "that said it looks worse in in the away. Uh, kebab says performance and then HDR. I don't think it'll do 4K. Yeah, I wouldn't hold for 4K, but you hope. Connect it to the TV. Just saying. It better do 4K. It's got to do 4K. Just saying. I'd take 4K over HDR. Okay, great. Do you really not think it's not going to Do you think it's not going to do 4K? Here's my thing. Be serious, bro. Uh, I Nothing WDs, throw them up in chat. Nothing would surprise me. Yeah, if they came out like, \"By the way, it's black and white.\" I'm like, \"A guess Nintendo.\" All right. If they came out and they're like, \"It's 8K.\" 16 bit. We saw the play date, so we're putting two cranks on ours. Like, yeah, I don't [ __ ] know what the [ __ ] they're doing over there. Uh, Street Shadow, right? Says, \"You guys should look up the Dodgers and Pokemon uh intro/colab.\" Uh, they did they collab they did for the Dodgers. Kevin's already got it cuz he's on it today. Oh, this is cool. throwing out the first Pokéball. Are",
            "start": 1503.36
        },
        {
            "text": "look up the Dodgers and Pokemon uh intro/colab.\" Uh, they did they collab they did for the Dodgers. Kevin's already got it cuz he's on it today. Oh, this is cool. throwing out the first Pokéball. Are these the Cubs? There's the Dodgers, too. All right. Now, now these I don't like the tail in there. It's like he's hard and he's trying to hide. Jesus. Yes, I No, I know exactly me when you tuck in the waistband there. What are you got to go up to class and ride on the board? I get it. I get it. What I usually do is wiggle my fingers and toes. Send the blood away. Is this the blood? This is it. This is what you wanted to show us. They walked out there. What am I watching? See, I think about national tragedy when I need to send the blood away. See, that's the opposite for me. What's your favorite national tragedy? We're not answering that question on air. I'll tell you I'll tell you during the ad break. Story number three. Ken Kuraragi has a Nintendo PlayStation in his closet. It's",
            "start": 1550.08
        },
        {
            "text": "favorite national tragedy? We're not answering that question on air. I'll tell you I'll tell you during the ad break. Story number three. Ken Kuraragi has a Nintendo PlayStation in his closet. It's emerged. That's awesome. This is Chris Skolian at Video Games Chronicle. PlayStation co-creator Ken Kur Kuragi still owns one of the fabled Nintendo PlayStation prototypes. It has emerged. Photographer Julian Demansky met Kuraragi earlier this month and revealed that he got to hold his Nintendo PlayStation posting a series of photos on X showing it in detail as spotted by Time Extension. Quote, \"Let's look at the photos.\" Yeah, I never thought I'd see something so rare, but today I actually I actually got to fondle a Nintendo PlayStation. Don't say like wrote, he's like, \"I lick the cart slot.\" Jesus Christ. The last one in existence was believed to have sold at an auction for $300,000. Turns out the ex CEO of Sony C of Sony CEA has one in his closet. Kang Kuraragi top bloke. End quote.",
            "start": 1598.8
        },
        {
            "text": "Jesus Christ. The last one in existence was believed to have sold at an auction for $300,000. Turns out the ex CEO of Sony C of Sony CEA has one in his closet. Kang Kuraragi top bloke. End quote. That's awesome. That's great. Uh it said that around 200 units were made of the Nintendo PlayStation, the prototype console created in the early 1990s as a planned partnership between Sony and Nintendo. The PlayStation was originally envisioned as a CD add-on for the Super Nintendo, which would boost Nintendo's console with significant processing power and speed. However, Sony's partnership with Nintendo fell through, which led to Sony further developing the PlayStation as a standalone system and entering the console market alone. I love a piece of history. Yeah. Yeah. Real cool. It's fun. It's just colle collecting dust in his closet. But I guess that it's to be expected. Yeah. Yeah. What else is he going to do with it? Cuz it was funny. I went to dinner with Shu when he visited and we were",
            "start": 1640.48
        },
        {
            "text": "colle collecting dust in his closet. But I guess that it's to be expected. Yeah. Yeah. What else is he going to do with it? Cuz it was funny. I went to dinner with Shu when he visited and we were talking about the stuff that was in his office and on his desk and all the stuff they dig. He has like five of these. Like can you imagine like if I'm Ken Kuragi and I have this I also just wouldn't know what to do with it. Yeah. Like I get cuz I'm not going to sell it. Yep. I'm not going to like I'm not going to give it away. Like donate it to Yeah. the video game history History Foundation. Yeah, you could do that, right? Or give it back to the company or whatever, but like No, I'm not that company. [ __ ] them. Maybe the company already has like hundred of these just in stock somewhere. But yeah, just sitting in his closet. Yeah. I think about it often, you know, even to take it to like our side of the industry. Like every so often Jeff Gersman will go get something from his garage and he",
            "start": 1684.4
        },
        {
            "text": "just sitting in his closet. Yeah. I think about it often, you know, even to take it to like our side of the industry. Like every so often Jeff Gersman will go get something from his garage and he shows these photos like, \"Oh man, that's [ __ ] crazy.\" Cuz I remember getting that at IGN, but you know, leaving it at IGN or even us the amount of stuff that comes in that I give away or let it go and then the rare thing that I keep in my house where it's like, \"Oh yeah, I still have that kicking around.\" That's like just random like PR package stuff. Yeah. Yeah. Yeah. That or like you know the even the anniversary PlayStations, right? They just sit on the shelf the 20 the 20th and now the 30th or whatever. I use the units which I know sacrilege. What's the coolest thing that you own as far as video game merchandise? See, I would say that the coole I don't not much because I gave so much away and then when we were at IGN it was very much like that was the company stuff. I didn't ever like",
            "start": 1716.96
        },
        {
            "text": "video game merchandise? See, I would say that the coole I don't not much because I gave so much away and then when we were at IGN it was very much like that was the company stuff. I didn't ever like do that. My favorite thing I ever got that I left at IGN because of course it was theirs. I was just an employee of IGN would have been the Uncharted 2 collector's edition. Do you remember it came in the gigantic book and then inside was the the the dagger of Shambala, the key that opened everything. And what was even cooler is when they sent it to us, it was signed by everybody who worked on Uncharted 2. Oh, that's cool. So, it was like this. It was like the collector's edition alone was awesome, but then it was all these things. But, of course, it sat on my desk forever and then got put into the glass case uh when they rethemed the new office and then Yeah, there it is. And then, God only knows what's happened since they moved everything around and shut things down and work from home and",
            "start": 1752.88
        },
        {
            "text": "the glass case uh when they rethemed the new office and then Yeah, there it is. And then, God only knows what's happened since they moved everything around and shut things down and work from home and yada yada yada. Oh, this is so that's one that I was like, damn, I wish I could have held on to that. like not. But again, I say that and here's what I I'll say. I say that it would just be in a closet or on a shelf downstairs in my house or whatever, but I wonder where it is now. I hope it has a good home wherever it went through following it. Somebody's fondling it in Paris Schneider's closet, right? I bet you got thrown away. What? I bet you got thrown away. Yeah. You think so? [ __ ] It was in a dumpster somewhere. And that's that's a heartbreaker, right, of that kind of [ __ ] You should have just taken it. Yeah. Well, remember it was a rougher breakup. wasn't. Me and Me and Nick stole a sandbag. That was enough. We did that. That's what we needed. Uh Greg, we're going to switch off",
            "start": 1792.72
        },
        {
            "text": "have just taken it. Yeah. Well, remember it was a rougher breakup. wasn't. Me and Me and Nick stole a sandbag. That was enough. We did that. That's what we needed. Uh Greg, we're going to switch off of Nintendo news. We're going to talk about the GDC awards. But before we get there, I want to talk to you about patreon.com/kindopfunn and youtube.com/confunname where you can go and get the kind of funny membership, which allows you to get shows adree. And speaking of ads, let us tell you about our sponsors. This episode's brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized shades that won't break the bank. Shady Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people. Plus, if your shades ever go missing or an unexpected hit happens, you know, don't sweat it. They have the most insane protection in all of eyewear. Every",
            "start": 1829.28
        },
        {
            "text": "rated five stars by over 300,000 people. Plus, if your shades ever go missing or an unexpected hit happens, you know, don't sweat it. They have the most insane protection in all of eyewear. Every pair is backed by lost or broken replacements. If you don't love your shades, exchange for a new pair or return worry-free within 30 days. Y'all know I've been outside in the sun a lot playing Pokémon Go, and it's such a great experience wearing Shady Rays when I'm out and about looking dope. Exclusively for you, Shady Rays is giving out their best deal. Head to shady.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. Again, go to shadyrays.com. Use code funny to get 35% off polarized sunglasses. This episode is brought to you by Factor. Ready to optimize your nutrition this year? Factor has chefade gourmet meals that make eating well easy. They're dietitian approved and ready to heat and eat in 2 minutes so you can",
            "start": 1873.44
        },
        {
            "text": "to you by Factor. Ready to optimize your nutrition this year? Factor has chefade gourmet meals that make eating well easy. They're dietitian approved and ready to heat and eat in 2 minutes so you can fuel right and feel great no matter what life throws at you. Greg Miller has been loving how simple it is to enjoy his Factor meals as he's rushing between shows each day here at Kind of Funny. Factor arrives fresh and fully prepared, perfect for any active, busy lifestyle. With 40 options across eight dietary preferences on the menu each week, it's easy to pick meals tailored to your goals. Choose from preferences like calorie smart, protein plus, or keto. Eat smart with Factor. Get started at factormeals.com/factorpodcast and use codef factorpodcast to get 50% off your first box plus free shipping. That's code factor at factormeals.com/factorpodcast to get 50% off plus free shipping on your first box. This episode's brought to you by MeUndies. For years, I've been telling you all about",
            "start": 1923.04
        },
        {
            "text": "That's code factor at factormeals.com/factorpodcast to get 50% off plus free shipping on your first box. This episode's brought to you by MeUndies. For years, I've been telling you all about how much I love MeUndies. Real talk, I haven't worn a pair of underwear or socks that weren't MeUndies in over half a decade. And that's because I just love how premium they are, how great they look, and awesome they feel. Even my loungewear at home is MeUndies. And I cannot recommend their various shirts enough. MeUndies just gets it. From the all black classics to fun expressive prints, MeUndies has a look for everyone. Plus, they come in sizes XS to 4XL. So, there's something here for all of you. Its breathable, stretchy, and oh so comfy fabric make it ideal for all day wear. And they use sustainably sourced materials and work with partners that care for their workers. Brad, good things come in big packages at MeUndies. Get 20% off your first order, plus free shipping on orders of $75 or more",
            "start": 1973.76
        },
        {
            "text": "sourced materials and work with partners that care for their workers. Brad, good things come in big packages at MeUndies. Get 20% off your first order, plus free shipping on orders of $75 or more at meundies.com/kindfunny. Enter code kind of funny. That's meundies.com/kindfunny. Code kind of funny for 20% off. MeUndies, comfort from the outside in. And it's time for story number four. The GDC Awards 2025 Game of the Year winners are in. I'm pulling from Matt Patches at Polygon. While the scale of December's The Game Awards has given the trailer heavy show the glow of the gaming industry's Oscar equivalent, the annual GDC Awards and Independent Game Festival Awards held together each year at GDC are closer to an Academy Awards-like event. Voted on by artists and crafts people who make games. Uh the GDC awards represents a different perspective on game of the year even when even if the winners often align with the TGA's. On Wednesday, devs from around the world congregated at the GDC",
            "start": 2023.2
        },
        {
            "text": "Uh the GDC awards represents a different perspective on game of the year even when even if the winners often align with the TGA's. On Wednesday, devs from around the world congregated at the GDC main stage in San Francisco to celebrate the full swath of 2024 games from indie to AAA. Here are the categories for both the GDC awards and the IGF awards, the full slate of nominees and winners. I just listed the the uh categories and the winners. Uh so they go like this. For game of the year, you got Bellatro. For best audio, you got Astrobot. Best debut, Bolatro. Best design, Bellatro. Innovation award, Bolro. Best narrative, you got Metaphor Refantasio. Best techn. Can you imagine? Best narrative, Bellatro. Best technology, Astrobot. Best visual art, Blackmth, Wukong. In social impact, you got Life is Strange, double exposure. That those are just the GDC awards. Uh, I also got the IGF awards here. Uh, excellence in audio. You got Despote. I believe these are for Are these for upcoming",
            "start": 2072.24
        },
        {
            "text": "got Life is Strange, double exposure. That those are just the GDC awards. Uh, I also got the IGF awards here. Uh, excellence in audio. You got Despote. I believe these are for Are these for upcoming games? I actually didn't look into the IGF awards as much. No. No. IGF awards because Despot isn't out yet. Yeah, but I think they submit early. So, I think you can't submit early. You're right. Last year I I that's where I learned about Crit Master. Gotcha. Yeah. And I'm seeing that all these other like thank goodness you're here is just nominated angerfoot. So, these games are out as well. Excellence in design. You have tactical breach wizards. Excellence in narrative. You got Caves of Quud. Q U D. Caves of Quud. You were confident and then you weren't. Uh, you got excellence in visual art. Haunty. Um, New Yeah, that's one that you put me on. Yeah, I booted up on that guy. Newovo Award, Consume Me. Uh, you got, let's see, the Sumis McNal grand prize goes to also goes to Consume Me. Uh,",
            "start": 2123.92
        },
        {
            "text": "Haunty. Um, New Yeah, that's one that you put me on. Yeah, I booted up on that guy. Newovo Award, Consume Me. Uh, you got, let's see, the Sumis McNal grand prize goes to also goes to Consume Me. Uh, Wings Award. Actually, I do. I'm trying to see if they explain what some of these are because I don't know what the Wings Award is, but that one also was won by Consume Me. Uh, best student game uh was won by slot waste. Uh, Reb Valentine said it. Uh, but I als she I blue skyed, but I say it all the time as well. This is a great chance for you to go back and look at all those nominees in wish list by fine because there's always great stuff. Uh, consume me. I sounded familiar and I know why because it's that one that I thought looked cute off that one thing where where you're feeding food to the baby or whatever and doing all this different stuff. Is that out yet? No, this is still a wish list coming soon. All right. Polygon's website needs a little like clean up on this cuz when you click",
            "start": 2163.92
        },
        {
            "text": "baby or whatever and doing all this different stuff. Is that out yet? No, this is still a wish list coming soon. All right. Polygon's website needs a little like clean up on this cuz when you click into it Yeah. It's like it just takes you to a page that's this caves of quud cud. I think it's cud. I attempted to go to the GDC awards last night. Did they not let you in? They did not. So this So this is what happened is I Do you know who I am? It almost got to that point. I was like but I'm blessing from kind of funny. Why can't I come in? I have a VIP seat. Um no. What happened was I so obviously we're here in San Francisco. This is where we work out of, right? GDC is in SF. But for most of the most of GDC, we have no reason really to get badges. We go we go to mixers, we go to things, but like usually when we go to the Xbox mixer or we go when we go to day of the devs, we don't have to pick up badges for those things. And so I never had I never got my GDC badge, but I knew that I",
            "start": 2206.96
        },
        {
            "text": "but like usually when we go to the Xbox mixer or we go when we go to day of the devs, we don't have to pick up badges for those things. And so I never had I never got my GDC badge, but I knew that I wanted to go to G the GDC awards. And so my plan was after our meeting here, our team meeting to end off the day, get after 5:00 p.m. I was like, \"Oh, I'll go home. I'll take a shower. I'll dress up and then I'll uh I'll go to the awards. I'm going to miss the IGF awards sadly because I'm going to get there too late, but I'll be there for the GDC awards. I'll get my badge, you know, get the wristband and then be able to watson waltz in toward the beginning of it. I So the Moscone Center where GDC happens at is separated into multiple different like centers. Yeah. Yeah. The one where they have the GDC awards were open. The other ones had just closed by the time I got there. And that's where you get your badge. And that's where I get my badge. So I try to go in. I was like, \"Oh, okay. Well,",
            "start": 2254.56
        },
        {
            "text": "the GDC awards were open. The other ones had just closed by the time I got there. And that's where you get your badge. And that's where I get my badge. So I try to go in. I was like, \"Oh, okay. Well, I can't go in here. I wonder if I can get my badge at the GDC awards one.\" So I go there and you at the door. They're like, \"Hey, you need a badge to get in here.\" And I'm like, \"Okay, well, I mean, I have a QR code and an email.\" And they're like, \"All right, I guess show that show that to the people at the door. Walk to the people at the door.\" And I'm like, and they're like, \"You need a badge.\" I'm like, \"Oh, I I was told I got this QR code. It's my thing. And they're like, \"Yeah, no, we can't let you in because if we don't know if you gave away your badge.\" And I'm like, \"I've not even gotten my badge.\" And they're like, \"Still, we need to verify that I have a badge.\" And I'm like, \"Ah, okay. I see what's happening here. That's fair. Can I talk to somebody like is there can I manager?",
            "start": 2295.68
        },
        {
            "text": "my badge.\" And they're like, \"Still, we need to verify that I have a badge.\" And I'm like, \"Ah, okay. I see what's happening here. That's fair. Can I talk to somebody like is there can I manager? Is there somebody cuz I have a PR contact who'll verify me? Like how far can I run this up?\" And I've never I'm so not a Karen person. Like I'm so nervous and I'm so like anxiety driven when it comes to trying to be assertive in any sort of way. So, like my go-to was just like, \"Hey, is there somebody else I can talk to?\" And so, like that happens about three times of they go back, they bring the they bring like the head of like the security for just like that event. And I'm like, \"Sweet. I have this guy that I'm emailing right now who's probably his phone's probably off cuz he's in the awards. He's at the awards that he's invited me to to sit at a VIP.\" I'm like, \"I have a VIP seat. I like can I find somebody who's like part of the event and see if they like I can make this connection and",
            "start": 2330.64
        },
        {
            "text": "He's at the awards that he's invited me to to sit at a VIP.\" I'm like, \"I have a VIP seat. I like can I find somebody who's like part of the event and see if they like I can make this connection and like kudos to them. They keep they were very nice about it and very helpful about it to the extent that they can be of like hey yeah sorry like this is just how it is like they go back and they bring somebody else out and it got to the point once we get got to the second person I was like hey I'm ready to give up I don't need to we don't need to make this happen um but they're like no we want to make it happen for you God bless them so yeah they bring up like finally I get to the final boss and she's just like yeah there's nothing I I can do and so I'm just standing out there I'm like damn I'm dressed up to go to the awards all my friends are in there I'm like I pull up I pull it up on Twitch just so I can do the Squidward meme of like seeing all the fun that people are having in there",
            "start": 2369.36
        },
        {
            "text": "I'm dressed up to go to the awards all my friends are in there I'm like I pull up I pull it up on Twitch just so I can do the Squidward meme of like seeing all the fun that people are having in there while I'm just standing outside not able to get in and then I just got drinks with my friend Meg. Gotcha. Yeah. So, I didn't get to go to the GDC awards. One day I'll make it in cuz this is the second year in a row where I thought about going to the GDC awards. Got real close this time. Got real close this time. I was outside the door hearing everybody cheering inside. Man, you're a better man than me. Cuz I wouldn't have been like, \"Do you know who I am?\" kind of thing. I would have eventually pulled up like Games Ali and been like, I'm not going to do this. But of course, they like you got banned from E3 and Yeah. What? So then what I would do is then be like, \"All right, cool.\" I would have walked away from the door, gone outside. Mhm. Looked around, made eye contact with any",
            "start": 2407.12
        },
        {
            "text": "you got banned from E3 and Yeah. What? So then what I would do is then be like, \"All right, cool.\" I would have walked away from the door, gone outside. Mhm. Looked around, made eye contact with any developer, explained the situation, borrowed their badge, gone in. If that That's how I actually get banned. If I that didn't work, what I would have done is gone, \"Okay, cool.\" Walked away. I'm assuming there's multiple entry doors, right? Yeah. Walk away from whoever knows that you're blessing, whatever. Gone and texted your friend, be like, \"Whoever's next to you, grab their badge, come out here, give it to me, and we'll walk back in together.\" Yeah. Yeah. That would have been the one. But yeah, they're cool. the for the record the GDC awards uh staff and security is always cool would have been probably what 2019 the year before everything shut down and changed and whatever where we went to the awards and it was the first awards where they no longer gave out wine and I was like this is",
            "start": 2437.2
        },
        {
            "text": "been probably what 2019 the year before everything shut down and changed and whatever where we went to the awards and it was the first awards where they no longer gave out wine and I was like this is [ __ ] So I left the awards and I went to the liquor store across and I bought like a case of wine in bags and I asked everybody as I was leaving I was like I found this you know different security people because I was going to take the same path. I was like hey is there going to be a problem if I go buy wine? Like I don't think so. Cool. Okay, cool. And it did it and then I went bought like I'm clanging and clanging and I came back into the awards through the exact same thing. Put them started handing bottles out. I was texting Jeff Key. I'm like, \"Do you want a bottle of wine?\" He's like, \"Yeah, there you go.\" My favorite was as I'm like interfacing with security trying to get in. Like everyone who everybody like Spencer, it's literally Josh Sawyer, the lead developer of Fallout New",
            "start": 2473.44
        },
        {
            "text": "\"Yeah, there you go.\" My favorite was as I'm like interfacing with security trying to get in. Like everyone who everybody like Spencer, it's literally Josh Sawyer, the lead developer of Fallout New Vegas, like walks by and like sees it and it's like, \"Oh, hey, Blessed.\" I'm like, \"Oh, hey, Josh.\" And then he's like, \"Are you having trouble getting in?\" I'm like, \"Uh, yeah, but I'll make it in. Don't worry. I'll meet you in there.\" I never met him in there. like I can help. No, no, no. I got this. Like, no, I got this. Josh Sawyer, but I appreciate it. And I And yeah, never made it in sadly. Everybody looked like they were having fun though. I saw Mahim taking pics with everybody. Yeah, the clips look great. Of course, uh I think it's the IGF ones were hosted by Alexa Ray Korea and Ben Star was out there. I saw they were all being as well was doing a lot of hosting there. Um so, shout out to the GDC awards and the IGF awards. Always a fun time out there. One day I'll make it in. Number",
            "start": 2506.48
        },
        {
            "text": "was out there. I saw they were all being as well was doing a lot of hosting there. Um so, shout out to the GDC awards and the IGF awards. Always a fun time out there. One day I'll make it in. Number five, you know. What was that? Stella was inside. Stella was in there. Everybody was there. like you know Tam Lucy everybody looked nice to and I was like man you learned a lesson get your badge I' I've been there every year as well like last year I went it was the exact same thing of wrap up here shoot down when's press closed do this thing yeah it's a sucky thing of like or not sucky but I guess there the happen stance of we still work throughout the week I know and so it's like I don't have any time to get my badge cuz like I could leave in the middle of work but like we're we live far enough away from where the awards are happening where it would be a hassle to be like all right I'll get my badge and then be back in an hour and a half like I don't feel like doing that. Sure. I mean,",
            "start": 2541.44
        },
        {
            "text": "away from where the awards are happening where it would be a hassle to be like all right I'll get my badge and then be back in an hour and a half like I don't feel like doing that. Sure. I mean, there's always, you know, you can always just plan ahead a little bit, you know, just a little bit. Well, now I know I got to plan ahead. I'm like looking at like the schedule on Tuesday when you were downtown for GDC, you know. I'm like, yeah, you finished the Games Cast at 12:30. Then I look at your schedule. You're not at the Xbox event till 2. Yeah, but like seems like there would time to get there. You know what? You know what? I'll just leave Game Showdown unreprepped every week from now on. How's that? I mean, I would love that. I [ __ ] suck at that show. I would much rather off the dome kind of feudy questions. All right, story number five. A Persona 4 remake could get revealed soon. I'm going from Zahad Ali at the game post. A new website domain was just registered, hinting at a",
            "start": 2575.04
        },
        {
            "text": "kind of feudy questions. All right, story number five. A Persona 4 remake could get revealed soon. I'm going from Zahad Ali at the game post. A new website domain was just registered, hinting at a possible Persona 4 remake. For Persona fans, this might be deja vu. A new website domain, P4RE.jp, was just registered today, March 20th, and it's already fueling speculation that a Persona 4 remake could be on the way. A new website domain was just registered, hinting at a possible Am I reading the same thing? I am reading the same thing over again. Uh this was spotted by Twitter scrambled faz who pointed out uh that two years ago a similar domain P3RE.jp was just registered. 3 months later Atlas officially announced Persona 3 Reload. Now with P4RE.jp popping up, fans are connecting the dots and wondering if history is about to repeat itself. Quote, \"P4RE.jp was just registered a few hours ago.\" The expost reads, \"Two years ago, P3RE.jp JP was was registered. 3 months later, Persona 3",
            "start": 2610.48
        },
        {
            "text": "and wondering if history is about to repeat itself. Quote, \"P4RE.jp was just registered a few hours ago.\" The expost reads, \"Two years ago, P3RE.jp JP was was registered. 3 months later, Persona 3 Reload was revealed. End quote. That was the tweet. The P4RE domain uh was registered under GMO Internet Group, Inc., a company based in Tokyo, Japan. Unfortunately, the registrance identity is hidden. So, there's no official confirmation that Atlas or Sega is behind it. That being said, the P3RE domain followed the exact same pattern before Persona 3 Reloads reveal. So, it wouldn't be a stretch to think this could be for Persona 4 remake. I need this to be true. It seems like it's all there. I Why do you need it? Cuz I love Persona 4. Okay. Yeah. Persona 4 is like probably my top five g favorite games of all time. Great game. Great game. So, I would love just a chance to replay it and like, you know, give a new coat of paint. Sure. Just reexperience it. Sure. Okay. um would be hilarious",
            "start": 2660.16
        },
        {
            "text": "games of all time. Great game. Great game. So, I would love just a chance to replay it and like, you know, give a new coat of paint. Sure. Just reexperience it. Sure. Okay. um would be hilarious slash not hilarious would be if this was just some random dude that was like I'm gonna [ __ ] with you [ __ ] with everybody and get this do register this domain in the exact same way as they did for Persona 3 Reloaded. Don't do that. Don't be an idiot. I don't think they I don't think they did. Maybe they're going to camp on the address though. Yeah, maybe. Yeah, I mean this would point to Summer Game Fest. Yeah, chat. Was it Xbox E3 the or Xbox the Xbox showcase where we got Persona 3 Reload? Because I would think it would probably happen the same way again. Why not? If everything was lining up, it leaked. I remember it leaking real bad. That was the problem. Yeah. Oh, yeah, it did. It was because they uploaded everything to Instagram. You hate to see it. Yeah. Story number six. Microsoft",
            "start": 2708.88
        },
        {
            "text": "it leaked. I remember it leaking real bad. That was the problem. Yeah. Oh, yeah, it did. It was because they uploaded everything to Instagram. You hate to see it. Yeah. Story number six. Microsoft gaming boss Phil Spencer says Xbox fans will see more movie and TV show adaptations despite the failure of Halo. This is Wesley at this isn't an Xbox knock. Just in general. I'm just Everybody's If you're going to make them, make them. Got the showrunner saying he didn't play God of War. Like I don't What are we talking about? Are you not excited for the God of War TV show by the guy who who didn't play God of War who doesn't like games. The failure of the TV adaptation of Halo certainly hasn't put Microsoft off more adaptations of its video games. That's according to Microsoft gaming chief Phil Spencer who said fans can expect more in the future. Spencer spoke to Variety ahead of the launch of a Minecraft movie the uh the big screen Jack Black starring adaptation of the Microsoft owned",
            "start": 2748.24
        },
        {
            "text": "Phil Spencer who said fans can expect more in the future. Spencer spoke to Variety ahead of the launch of a Minecraft movie the uh the big screen Jack Black starring adaptation of the Microsoft owned sandbox video game Minecraft. Big things are expected of it and if it does well it could spawn sequels. It's the latest Microsoft video game to get either a movie or TV show and follows the phenomenally successful Fallout Prime video series. But the the TV adaptation of Microsoft's flagship Xbox game Halo failed, suffering a cancellation. Variety, all right, the blood suffering a cancellation after two big budget se uh seasons were poorly received. Uh Microsoft has learned from Halo, Spencer told Variety and is gaining confidence in the space and so expect more to come. Quote, \"We're learning and growing through this process, which is giving us more confidence that we should do more.\" Spencer said, \"Quote, we learned from doing Halo. We learned from doing Fallout. So, all of these build",
            "start": 2783.36
        },
        {
            "text": "and growing through this process, which is giving us more confidence that we should do more.\" Spencer said, \"Quote, we learned from doing Halo. We learned from doing Fallout. So, all of these build on themselves, and obviously, we'll have a couple that miss. But what I'd say to the Xbox community that likes this work is quote, you're going to see more because we're gaining confidence and we're learning through this.\" End quote. That does that give you confidence? Yeah. I mean, I think they understand. Again, I don't it's the usual conversation of how much uh how much influence and power in this uh dynamic and this relationship does Phil and the team at Xbox have, right? That's the issue, right? And it's why Fallout's so great is that of course they brought on people who understood Fallout and then they worked so closely with Todd and his team to be like, \"All right, cool. We're doing the thing. It's the same reason what Last of Us works on such an outrageous thing, right, of bringing",
            "start": 2829.36
        },
        {
            "text": "and then they worked so closely with Todd and his team to be like, \"All right, cool. We're doing the thing. It's the same reason what Last of Us works on such an outrageous thing, right, of bringing in Neil the way they did.\" and to have Halo be this one list. Tim knows way more about it and talked about it last games daily I was on with him right of like not giving fans what they want by the time they did making it too late like you just gota realize that you can make a video game adaptation that is very close to the video game and it'll bring in the mainstream everybody tries to mainstream up what they're doing and that's where they fall apart I think. Yeah, I think Phil talking about it in this way is interesting to me just in the sense of I don't get the sense that like the like the Xbox team's hand is on the wheel as far as like how these movie projects projects go, right? Not even in a bad way, but like when Fallout becomes a successful Amazon TV show, I more so view it from the",
            "start": 2870.64
        },
        {
            "text": "team's hand is on the wheel as far as like how these movie projects projects go, right? Not even in a bad way, but like when Fallout becomes a successful Amazon TV show, I more so view it from the okay, Bethesda and Todd Howard licensed out the the Fallout franchise for Amazon to do and like they did a good job with it. in the same way that like I don't connect that to Halo which and I don't connect that to Minecraft either. I know it's all technically owned by Microsoft but they feel like separate enough. It's not like a PlayStation Productions type situation, right? Or even a Nintendo situation where it feels like there's a bit more of an intentionality with how they're approaching their movie stuff. Not that like well PlayStation went and made PlayStation Studios, right? Productions productions. Thank you so much. Uh you know, for the Mario movie, right? Like Miiamoto was so involved on that. He was like the mouthpiece of it, let alone how much he did for it. And then you see that",
            "start": 2909.44
        },
        {
            "text": "Thank you so much. Uh you know, for the Mario movie, right? Like Miiamoto was so involved on that. He was like the mouthpiece of it, let alone how much he did for it. And then you see that in the fruits of the labor, right? Where we that movie is a not even a love letter to Mario, which it is, but it's more of just like a museum of Easter eggs and references and sound bites and all these different things. Like there's having the creators involved means so much. And so for Minecraft, you're like, \"All right, like Minecraft like it's a look, right?\" Yeah. Cuz I mean there's things you have to have in there of, you know, Jack Black eating a pork chop or whatever and making a pickaxe. Like I get it, but it's not like we're trying to there's some sacred story we're trying to protect with Minecraft. Yeah. And I'm not even saying like even one route is better than the other, right? Because like obviously PlayStation Productions like not it's not like they're just putting out masterpiece",
            "start": 2949.52
        },
        {
            "text": "Yeah. And I'm not even saying like even one route is better than the other, right? Because like obviously PlayStation Productions like not it's not like they're just putting out masterpiece after masterpiece. You know, they had the Uncharted movie and the Gran Turismo movie. Both okay. Yeah. Um and they have Last of Us which is [ __ ] fantastic, right? In the same way that on the Xbox side, Fallout, the Amazon show is probably my favorite video game adaptation yet as far as how TV goes, right? But I don't look at that and go, \"Oh man, are they gonna learn from this and make a better Halo?\" It's like I don't It doesn't feel as, you know, together in that way as like when I look at Nintendo or PlayStation. But as long as as long as whatever comes out is good, then I don't really care. Yeah, of course. Like if you're going to make a Gears movie or if you're going to make a Wolfenstein movie or whatever, whatever it is, hey, as long as you give it to the right people and they do and they",
            "start": 2986.4
        },
        {
            "text": "of course. Like if you're going to make a Gears movie or if you're going to make a Wolfenstein movie or whatever, whatever it is, hey, as long as you give it to the right people and they do and they do right by it and yeah, like have the creators involved probably or people that know what they're doing. Yeah, I'm excited for whatever it is for sure. Uh, if we could get a new Wolverstein movie, I think that'd be big. Be huge news. That'd be huge. But if I wanted something smaller, say the tiniest news I needed to know about, where would I go? You'd go to our last story, the Wii News Channel, where we cover all the small news items you need to know about. Story number seven is Wii News. Starting from Noble, according to Sana, Monster Hunter Wilds is the bestselling video game of February 2025 and 2025 in general so far, with more than half of its sales coming from Steam. From VGC, a new website has been launched to make finding created wrestlers in WWE 2K25 much easier. WWE 2K Tools is",
            "start": 3021.92
        },
        {
            "text": "and 2025 in general so far, with more than half of its sales coming from Steam. From VGC, a new website has been launched to make finding created wrestlers in WWE 2K25 much easier. WWE 2K Tools is the work of GINX TV and is described as a brand new dedicated platform designed to enhance the WWE 2K gaming experience by providing players with a dedicated hub for discovering and sharing community creations. First off, once again, congratulations to another person who wants to be on this show. James Wright from Jinx TV sent me this with the headline we news WWE. It's not hard to get in here everybody in the video game industry. I appreciate this and I'm very I have not I was uh driving saw this sent it to you for inclusion. Very interested to jump into this and see how this website works cuz it's even beyond beyond uh just talking about creation stuff. Like I was reading through it. It's like they have a univer universe mode planner, a streamlined way to organize WWE 2K universe shows,",
            "start": 3063.2
        },
        {
            "text": "it's even beyond beyond uh just talking about creation stuff. Like I was reading through it. It's like they have a univer universe mode planner, a streamlined way to organize WWE 2K universe shows, storylines, rivalries without this, a draft simulator. Like WWE's creation 2K's creation suite's always been very impressive but cumbersome. And of course, breaking it up by a platform sucks in order to so to see how this creator wrestler database is working. See what they have here. I'm very interested. It warms my heart to see that this is the thing that still happens cuz I remember back in 2007 2008 going to Gamefax. Going to No, not even GameFax. It was there was a dedicated website. I forget the exact name of the website, but it was something CAW, right? Something CA, right? And you would go on there and you would have uh different um like categories of create a wrestler, create a move set, create an entrance, and they would have formulas for if you want to make Tajiri or like Oh yeah,",
            "start": 3117.28
        },
        {
            "text": "on there and you would have uh different um like categories of create a wrestler, create a move set, create an entrance, and they would have formulas for if you want to make Tajiri or like Oh yeah, let's make Tajiri. Yeah, because he wasn't in the game. I'm like, oh yeah, I like that wrestler. I want to make that wrestler. And they would like you could create pitch perfect the Japanese copies. Oh my god, spin people's face. Tajiri. Oh, you so And funny enough, like a lot of the uh those wrestling games would have their move sets like verbatim. And so you would go in and be like, \"Oh, Tajiri is basically in the game without being in the game.\" And so you would just like take that like whatever formula they have. So the same way it is to this day. You want Joe Hendry, here's 9,000 of them. Go to the most upvoted one. Exactly. I said his name. Will he ever appear? I love that they do that. Me, too. Fan and Brave the lost hero launches April 24th on PC and then itilier Yumia cross Tekken",
            "start": 3156.4
        },
        {
            "text": "Go to the most upvoted one. Exactly. I said his name. Will he ever appear? I love that they do that. Me, too. Fan and Brave the lost hero launches April 24th on PC and then itilier Yumia cross Tekken 8 collaboration has been announced. A free item will be available in Tekken 8 season 2. And that is it for Wii news. You did show up there. Hey. All right. Cool. I like that. I'll take it. Uh let's hop into some super chats. No Man Skywalker writes in and says No Man Skywalker birthday tax. Thanks for all the great content. You guys rock. Thank you so much. Happy birthday No Man Skywalker. Joey Rat Joey Ratzorson says Persona 4 rerun which I like a lot. I think that's got to be it. Barrett I think me Barrett has talked a lot about like what they would name it and yeah you have to go with like some either rewatch or rerun feels like the best. It feels like the best one. That's the best one I've heard. It's a good title. Ve Karma writes in and says huge random shout out to Heroes of Hammer",
            "start": 3196.8
        },
        {
            "text": "some either rewatch or rerun feels like the best. It feels like the best one. That's the best one I've heard. It's a good title. Ve Karma writes in and says huge random shout out to Heroes of Hammer watch 2. Just picked it up today and already have five plus hours. Fantastic arcade retro rog light ARPG. Love you guys. Heroes of Hammerwatch 2. Heroes of Hammerwatch 2 is what it's called. I'm going to I'm going to it. I'm going to it. Um yeah, Kevin, if we can get like a a lookup of Heroes of Hammer 2. Heroes of Hammerwatch 2. Lowkill Plays writes in and says, \"It's big of Greg to bury his rivalry with CM Punk and support his merch. Way to be the bigger guy.\" Thank you. That means a lot to me. A rogike action RPG that offers extensive persistent progression. build your town, upgrade, and equip your heroes before taking on the everchanging Dark Citadel, either solo or with a new team of friends. Um, Opponent Prime writes in and says, \"A a Persona 4 domain was registered, and they wrote",
            "start": 3244.88
        },
        {
            "text": "your heroes before taking on the everchanging Dark Citadel, either solo or with a new team of friends. Um, Opponent Prime writes in and says, \"A a Persona 4 domain was registered, and they wrote in with this before we even got to the story. A Persona 4 domain was registered uh very similar to P3's remake, which was unveiled 3 months later. SGF reveal with Q1 2026 for P4 Rewatched.\" I like this a lot. All right. Now, Kevin is showing uh the Heroes of Hammer Watch. Neat. Is this doing something for you? Yeah. You know, I like You know, I like a good robot. You know, I like a good RPG. That's a fun pixel art style here. It's a really nice little art style. Multiplayer. This looks fun. Yeah. Okay. Yeah, I'm getting this. All right. Cool. [ __ ] with it. Thank you very much. Who was set in? Uh, that was Oh, I can't scroll it down anymore. I lost it. I lost it. You're going to look it up. Um, look up. No. Is the problem where like, you know, have you done the thing where you've gone through",
            "start": 3290.0
        },
        {
            "text": "that was Oh, I can't scroll it down anymore. I lost it. I lost it. You're going to look it up. Um, look up. No. Is the problem where like, you know, have you done the thing where you've gone through super chats on the YouTube page like this? Yeah. Break them out. Slow cuz like if I try to do that and then slow. Well, that's your mouse. That's your stupid It's not my mouth. It's not mine. When I break my mouth break out that way. After this is done, you should come. We should talk and then set you up with recent events on uh Streamlabs. It's better. Sick. I appreciate it. Um, no, but you have to do that. You have to. It's Veil of Karma. There you go. Veil of Karma. Did that donated Veil of Karma. Everybody toss up the the Kevin Gold Stars. He gets one. Um, well, I'm giving it to Kevin, you are the gold star, but we're giving it to him. Kevin, you get a gold star. Just being amazing. My mind is your mine. Remember, we you're killing the My mind is your mind. My mind is your mind. Yeah,",
            "start": 3343.84
        },
        {
            "text": "are the gold star, but we're giving it to him. Kevin, you get a gold star. Just being amazing. My mind is your mine. Remember, we you're killing the My mind is your mind. My mind is your mind. Yeah, I can see this open as prime, right? You want to code this? You want to code for this? Uh, no. I'm good. Okay. Um, not my kind of game, but it looks cool. Fine. Fair. Live your life. When you say SGF reveal, I'm thinking, yeah, SGF season. I can't I don't know if I expect to see it more at Jeff's thing or Xbox's thing. I think I lean more toward Xbox's thing because the history. Um, but I mean, I would even love for it to come out this fall. That might be hoping for too much for the fact that we got both Metaphor and Persona 3 Reload last year, but yeah, like I Q1 2026, I could see too for following that exact same cadence, but man, I I want it sooner sooner than later. [Music] Curado is cool. Says writes in and says, \"Boss makes a dollar, I make a dime. That's why I poop on company time.\"",
            "start": 3386.96
        },
        {
            "text": "that exact same cadence, but man, I I want it sooner sooner than later. [Music] Curado is cool. Says writes in and says, \"Boss makes a dollar, I make a dime. That's why I poop on company time.\" Good. I like that. Um, and then Kyle Bond writes in writes in and says, \"Hey, Bless. It was great to run into you last night. You're a super cool dude.\" Uh, this again comes back to the story of walking in with the champagne like, \"Oh, hello. You can't get in. Pleasure seeing you. Bye.\" No, this was after I gave up and was like, I'm just going to go grab drinks with my friend Me. So, I hung out with Meg and then like on our way like walking back um we're like we're done for the night. We just run into a dude and like way like far away from where the convention center is at and [ __ ] is happening, right? Like we're just on a random street in San Francisco and like we're in like not a great area. It's one of those things where my guard is up like our guard our guard is up, right? We're like,",
            "start": 3426.56
        },
        {
            "text": "right? Like we're just on a random street in San Francisco and like we're in like not a great area. It's one of those things where my guard is up like our guard our guard is up, right? We're like, \"All right, like anything could happen, you know, [ __ ] the dangerous streets of San Francisco.\" And I just hear, \"Hey, blessing.\" And I was like, \"What the [ __ ] Who who's going to throw hands?\" just swung me up. Yeah. I'm like, \"Who wants to fight?\" And I'm like, \"Oh.\" And he's like, \"Oh, dude, I love the show. This I I Man, that's why that's one of the reasons I do love this week, even though I'm fighting against the whole week for GDC.\" You know, it's relegated to weekend. I hear you. But it is nice to have it happen more than often of people just randomly in San Francisco, you know, saying what's up or saying they love the show or saying that they watch. Shout out to everybody who's introduced themselves to me and the crew because it it is always fantastic uh whenever that happens. It",
            "start": 3469.92
        },
        {
            "text": "what's up or saying they love the show or saying that they watch. Shout out to everybody who's introduced themselves to me and the crew because it it is always fantastic uh whenever that happens. It lightens up my day. Uh and then Jeremy Manon writes in and says, \"Quick question. When is the next AVP in review? Uh, you will be getting Alien versus Predator dash every Alien and Predator movie interview reviewed. Uh, tomorrow. We're doing AP tomorrow. The actual AVP tomorrow. So, it's a jam-packed day tomorrow. Sam Lake Benstar game showdown Alien versus Predator review. And but I, as I was talking about in today's Greg Way, you know, my work is kind of done after Sam Lake. So, I'm probably going to start drinking beers at 11:30. Oo. Am I You want to join me? I mean, I got to host game showdown. I'll already be drinking that, too. All we need to do is go, \"Hey, Tim, have a beer.\" And he'll go, \"Yeah.\" And then Andy will have just woken up, so he won't. But, you know, it's one of those",
            "start": 3502.88
        },
        {
            "text": "I'll already be drinking that, too. All we need to do is go, \"Hey, Tim, have a beer.\" And he'll go, \"Yeah.\" And then Andy will have just woken up, so he won't. But, you know, it's one of those shows I want to be sharp for. But, I guess, you know, it's You ever watch the show? Yeah. But, but I got to be sharp as the host. Okay. Okay. Cuz I'm already not as sharp as I like to be all the time. Um, let's hop into kind of.com/you wrong, where you write in, let us know what we got wrong, as we got wrong, so we can correct it. For those watching later on YouTube and listening later on podcast services around the globe, we have a couple. Uh, we have one from Onion Ducky who writes in and says, um, Sheamus is pronounced Sheamus. So that's s eu mas. Uh, it's pronounced Sheamus. It's Gaelic, I think. The Sheamus McNalio grand prize is the name of the game of the year award at IGF. There you go. It was named after their first ever grand prize winner, Sheamus McNal, who passed of cancer shortly",
            "start": 3544.72
        },
        {
            "text": "The Sheamus McNalio grand prize is the name of the game of the year award at IGF. There you go. It was named after their first ever grand prize winner, Sheamus McNal, who passed of cancer shortly afterwards. All right, there you go. I appreciate that you're wrong. And Timmy buddy writes in and says, \"The site for WWE cause uh blessing was thinking about was cause.ws.\" Makes sense. I appreciate it. That makes sense. I appreciate it. I appreciate that. And then Sal writes in and says, \"Samasu here. What's up?\" Anyway, just a note regarding the P4RE.jp domain. Anyone can register a JP domain with Oname, the registar used to register the domain. A surprising number of Atlas related domains are easily grabbable by anyone like P2RE.jp for example. Historically, we haven't really seen random users register domain names to pull pull one over on fans when it comes to Atlas related stuff, but just thought I'd bring up a possibility, albeit an off one since there's no definitive uh whis",
            "start": 3580.48
        },
        {
            "text": "users register domain names to pull pull one over on fans when it comes to Atlas related stuff, but just thought I'd bring up a possibility, albeit an off one since there's no definitive uh whis information tying Atlas or Sega to the registration, which I appreciate that. And yeah, that's definitely a thing to keep in mind. Turning nine back on, Kevin. Nine is I almost wore the shirt. What's up? Oh, you uh Oh, we could have been matching today. Check one two. Am I uh Am I on? Am I on? Um you are. I just really wanted to come out here. What do you prefer? If this is real, rewind or rerun? Rerun. Reerun cuz it's TV based. Remember, there's a lot of TV stuff in Persona 4. Rewind's the same thing, though. That's a VHS tape. That's different. This is the Midnight Channel. This is the Midnight Video Store. Rerun is such a slam dunk. Yeah. Yeah. What about you? Remake. You like the remake? Reload. Uh I like both. I I I I could [ __ ] with any of them. I think it'd be funny it would be if",
            "start": 3626.24
        },
        {
            "text": "Video Store. Rerun is such a slam dunk. Yeah. Yeah. What about you? Remake. You like the remake? Reload. Uh I like both. I I I I could [ __ ] with any of them. I think it'd be funny it would be if they just went with Remake, though. I do think there's an interesting conversation, though, of like, is there a negative connotation to Rerun? Remake sounds new. Rerun does sound, oh, I've seen this before kind of. I don't know if you'd want to double down on a video game title that way. Yeah. Even though it makes sense to fans like us. And I do think Persona Sickos aren't going to care. Yeah, that's true. I think you also like maybe make the TVs prominent on the box art maybe to like drive it home of Yeah, this is what this is. Yeah, this is the whole bit. This is the whole theme. Yeah. Retellivvised. Rewatch. I don't hate that one. OMGX. But my my the thing that I don't love about even rewatch or retell is that like that is rerun is such a term that is baked in of we know what a re like",
            "start": 3670.96
        },
        {
            "text": "Rewatch. I don't hate that one. OMGX. But my my the thing that I don't love about even rewatch or retell is that like that is rerun is such a term that is baked in of we know what a re like rerun is like a word in the dictionary. Rewatch obviously probably also a word in the dictionary, but that it gets to a point where we're just adding re to other verbs. You know what I mean? Where rerun is a word. rerun is a thing that we regular that we regularly say and refer to. Now, do you think, Greg, just because I know you uh love or you both love Persona 4 Golden, do you think in this uh remake will they cut out the golden content for the remake and then add it later? They can't [ __ ] do that. Don't do that. Don't do that. I don't know. Especially cuz let me tell you Mhm. the twist or No, I guess I guess the golden stuff didn't factor into the I was going to say cuz the golden I've only played Golden so I actually don't know what's Golden versus what's just regular Persona 4. Um not that",
            "start": 3716.56
        },
        {
            "text": "I guess the golden stuff didn't factor into the I was going to say cuz the golden I've only played Golden so I actually don't know what's Golden versus what's just regular Persona 4. Um not that we should spoil it here. Let's not just in vagities. Do you remember is her Maria? Marie Marie Marie. Yes. All of the stuff with her is from what I remember that's like the stuff. Get ready for DLC episode Marie. Are you kidding me? How do you solve a problem like Marie? Yep. Oh yeah. Thank you, Barrett. I appreciate that. And thank you, Greg, for joining me on this episode. No problem. Kind of funny games daily. Remember, each and every weekday we run you through the nerdy news you need to know about live on YouTube, Twitch, and on podcast services around the globe. If you love what we do, support us with the kind of funny membership on Patreon or YouTube to get all of our shows ad free. Watch them live and get a daily exclusive show. Enjoy the games cast next and the stream after. But until",
            "start": 3764.4
        },
        {
            "text": "us with the kind of funny membership on Patreon or YouTube to get all of our shows ad free. Watch them live and get a daily exclusive show. Enjoy the games cast next and the stream after. But until next time, game daily. Heat. Heat. [Music]",
            "start": 3806.16
        }
    ]
}