{
    "id": 1827,
    "video_id": "nNtnAPaobmE",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Tim Is Useless - The GameOverGreggy Show Ep. 132 (Pt. 1)",
    "description": "http://www.casper.com/kindafunny\n\nThank you to Casper for supporting our channel! Get $50 off toward any mattress purchase by clicking the link above and using promo code “kindafunny.”\n\nTim complains about being sick.\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1465801200,
    "duration": 1366,
    "transcript_chunks": [
        {
            "text": "This topic is brought to you by Casper. Now, did you guys know mattresses cost a whole bunch of money? I didn't know. And then Christine went to buy a mattress once and I said, \"That's a lot of money for a mattress.\" But Casper's mattresses aren't that expensive. In fact, you can get a twin XL mattress for $500 or a king size for $950. And if you go to casper.com/kindafunny and enter the offer code kinda funny, you get $50 off. Now, you might say, \"What am I getting $50 off of?\" To which I would say, \"A mattress, of course.\" But then I'd remind you that there's two types of amazing technologies in a Casper mattress. There's memory foam, there's latex foam, and they come together like this. And then they go and they become one amazing foam that you sleep on at a good cheap price and get a good night's sleep. That is awesome. And wouldn't you like a good night's sleep? Go to casper.com/kindafunny. Enter the offer code kinda funny and you will sleep better on your Casper mattress,",
            "start": 0.08
        },
        {
            "text": "get a good night's sleep. That is awesome. And wouldn't you like a good night's sleep? Go to casper.com/kindafunny. Enter the offer code kinda funny and you will sleep better on your Casper mattress, guaranteed. And if not, Kevin will come choke you out and put you on that mattress. What's up everybody? Welcome to The GameOverGreggy Show. I am one of your hosts, Greg Miller. Along the Hi, Greg. Hey, how you doing, Nick? Good. Good to see you. Good to see you, too. Do you ever think about dipping the foam part of your mic into your coffee? No. God, that sounds awful. It sounds much like you you melted into Masters of Terra. What is that? You just said that. Master Terracai, dude. PS1 era classic Star Wars fighting game. Oh my. I'm so sorry. I didn't know. Did they have the medical PlayStation? Did they have W there? Now you know how 70% of the time. Did they fight with lightsabers? Some of them did. Well, that seems like an unfair fight right there. Boba Fett was in it.",
            "start": 38.48
        },
        {
            "text": "PlayStation? Did they have Wii there? Now you know how 70% of the time. Did they fight with lightsabers? Some of them did. Well, that seems like an unfair fight right there. Boba Fett was in it. Did he just die like a **** in every match? Little Anakin always popped up on the ground and he fell in. Help me. You know, I got I got my daddy. Who is my clue? I got to be honest with you is that I was watching Jedi recently and he really does go out like a **** Like like I got to just admit that that Boba Fett really does. But it's because he's so used to not being challenged that he wasn't even ready for anything that was happening on the scale. Everything had atrophied. He wasn't ready. He Well, that's what I'm saying is like he's he's on the the star the super star destroyer Executor with a big dick with Darth Vader and the other five bounty hunters. No one's saying anything to him. He goes to Bespin in the Cloud City go like Darth Vader is getting shot at by Han Solo puts his hand up and",
            "start": 94.96
        },
        {
            "text": "big dick with Darth Vader and the other five bounty hunters. No one's saying anything to him. He goes to Bespin in Cloud City like Darth Vader is getting shot at by Han Solo puts his hand up and stops the blaster bolts and Boba Fett just walks out from the side like not afraid of anything. And then he goes to Jabba's Palace to collect and he's just there to party. Yeah. And yeah. And and and then and then all this stuff goes down. He's hung over. He's probably got a wicked hangover. So I think that like in he's like cuz you can see him on the skin. He's like what the hell is going on? Like I haven't had to fight anyone in years. Oh no. He's on massive amounts of cocaine on that on that stuff on Jabba's like amazing sail yacht that he had. He was blowing lines before the stuff went down. He was just like I don't even care about that singing thing with the big ass nose. Yeah. Yeah. Yeah. Dude, they were getting what was the Sullustan noodles? What's",
            "start": 139.6
        },
        {
            "text": "was blowing lines before **** went down. He was just like I don't even know that **** singing thing with the big ass nose. Yeah. Yeah. Yeah. Dude, they were getting What was the Slime noodles? What's the Is that sliced noodles or size noodles? Something like that. Is that noodles? I'm going to look that up. This is the Long Island Comic Con. Hello. That's the pure one Tim Gettys. Now, what was the Muppet though? There was a Muppet right on Jabba's Palace. Yeah, that was like uh Well, that's what I'm I thought he was talking about with the lips. Salacious Crumb. That's right. He that guy was getting mouth **** by Boba Fett for sure. Everyone's **** He was hung over. He was on drugs and he was deprived of all his fluids. That salacious crumb sucked out of him. Suck dry. Okay. Did he have a weird nose? How the **** did I know that size noodles? How do I remember that? Cuz you're a huge **** dork. I mean, are you talking about the I'm talking about the the the CG abomination they",
            "start": 173.04
        },
        {
            "text": "a weird nose? How the **** did I know that size noodles? How do I remember that? Cuz you're a huge **** dork. I mean, are you talking about the I'm talking about the the the CG abomination they added the singing thing. The singing thing that looked like the kissy thing, right? Like Nicki Minaj kind of. Hold on a second. I'm looking a little bit. I'm looking. Okay. I'm looking at the Wikipedia. The Wikipedia. Yeah. Sci-Fi Snoodles. Wikipedia. It's uh God, how do I remember that? Sci-Fi Snoodles was a female Powwow singer and lead vocalist for the Max Rebo band. She was also the former lover of Zero the Hutt and was his killer. She was also a spy for Grand Hutt Council's leader, Jabba. It says her gender is female, her height is 1.65 meters. And her skin color is yellow in parenthesis with blue spots. Good. Thank you, Wikipedia. Do you ever see the old I think it was I don't remember what website it would do where it was like uh I think we talked about this in the past like a long time",
            "start": 211.92
        },
        {
            "text": "Blue spots. Good. Thank you, Wikipedia. Do you ever see the old I think it was I don't remember what website it would do where it was like uh I think we talked about this in the past like a long time ago, the Wikipedia articles for something fake and the Wikipedia articles for something real. So it's like the real Wikipedia article for like a scientific term and then the real Wikipedia article for a fake scientific term from sci-fi. And that one's way more fleshed out and and like and like twice as long. It's the best. I love that. Such a funny idea, nerds. Yep. Noodles was This is The Game Over Greggy Show. Each and every week, four, sometimes five best friends gather around this table. Each bring a random topic discussion for your amusement. If you like that, head over to patreon.com/kindafunny. We get the shows early along with a bunch of exclusive goodies. A lot of people like all the exclusives we've been putting up lately. I'm proud of that. I'm glad they're enjoying the",
            "start": 257.04
        },
        {
            "text": "We get the shows early along with a bunch of exclusive goodies. A lot of people like all the exclusives we've been putting up lately. I'm proud of that. I'm glad they're enjoying the exclusive content. Nick, good. If you have no money to toss, don't worry about it. Head to youtube.com/kindafunny where we post the entire show topic by topic day by day until the entire thing posts the following Friday as one big MP3 and video. How's everybody doing? Good. What was the what was the story that Lucas said about Boba Fett? Like he was supposed to be the main villain of when it Lucas didn't say that. Other people were saying that. Yeah. What was that? Some other old guy. It came out like a month or two ago. They were talking about was it was it um how Fett was supposed to be like the main villain and then got downgraded or something like that when he decided I saw something about that circulating but I did not read it. It could have been from what's his name? The screenwriter. Um, two",
            "start": 295.32
        },
        {
            "text": "villain and then got downgraded or something like that when he decided I saw something about that circulating but I did not read it. It could have been from what's his name? The screenwriter. Um, two trilogies. Where they were going to make two trilogies. Oh, that's right. And and Boba Fett was supposed to be the main bad guy of the first one and then when he decided to not make the next three. I guess they were like, you got to go out like a star So, go blow lines and die for a while. It's weird that they killed him at all. It would have been better if Mystique had been way better. It would have been cooler if he fell into the Sarlacc pit and then jetpacked out or something like that. Isn't that what they did in the EU? In in the books, he does he does they he falls out. I think he causes some sort of explosion or something. I think it's in Tales from the Bounty Hunters, I think, cuz there was there was great short story book called Tales of the Bounty Hunters, Tales of the Empire",
            "start": 330.4
        },
        {
            "text": "some sort of explosion or something. I think it's in Tales from the Bounty Hunters, I think, cuz there was there was great short story books called Tales of the Bounty Hunters, Tales of the Empire, Tales from Java's Palace, Tales from Mos Eisley Cantina. It was like all the stories of all these random Tales. Watto's Great Halls' Tales of Sul's house. Tales from Sabacc's house, which was uh which was written but not actually published. Right. Right. Would have been too good. Would have put everything else pale in comparison to that. Now, if you're done talking about your dumb clones and stuff I asked how everybody's doing. Everybody said good and then Tim said bad. I'm not good. What's wrong? I'm sick. Think I'm dying. Oh. Uh earlier we were talking about what topics we're doing. I was like, I want to talk about sickness and sick stories. Yeah. And you're like, have we done that before? I'm like, I don't think so. Yeah. And I did some research on it. We have, but none of us were part of",
            "start": 360.8
        },
        {
            "text": "I want to talk about sickness and sick stories. Yeah. And you're like, have we done that before? I'm like, I don't think so. Yeah. And I did some research on it. We have, but none of us were part of the damn show because we were all sick. Oh, this is when I was like last man standing. Maybe it would be maybe it would be uh you know this this sweet space jacket that you're wearing. I was going to say he does look like he's from the future, right? This does look like a Back to the Future. Helium 3 trader. Full disclosure for this this jacket. Yeah, I bought it back from a gas giant. I bought it for Kinda Funny Live. It was going to be my entrance jacket and I was going to get the smiley embroidered on. Ran out of time to get it embroidered because we're working on a whole bunch of other stuff like Pikachu costumes and whatnot. Then I found the sparkly light up one. I'm like, well, forget this piece of crap. So, it's a cheap jacket. I don't really like it, but I was like, I",
            "start": 395.28
        },
        {
            "text": "other **** like Pikachu costumes and whatnot. Then I found the sparkly light up one. I'm like, well, **** this piece of **** So, it's a cheap jacket. I don't really like it, but I was like, I have it now. And then I haven't done laundry for a while cuz Gia, I've been here. Um, so I'm like, you know what? I I didn't want to debut my E3 outfits because it ain't E3 yet. Sure. Damn well know I got some E3 outfits to **** debut on y'all **** ass. So, let me tell you. So, I wore this instead. So, you were born in the asteroid belt. Mhm. Uh in the year 2352. Yep. And you and your family traveled to Saturn specifically um topped. No, Enceladus. We're going to say you lived on Enceladus, the moon and for a while my girl. Yep. And then you were became a helium 3 trader and you are often shuttling between the moons of Saturn and uh Earth to uh let off the payload of helium 3 and other payloads as well. Yeah. Now, can I name him? Can I I'm going to just pull a random name. Never heard",
            "start": 431.2
        },
        {
            "text": "shuttling between the moons of Saturn and uh Earth to uh let off the payload of helium 3 and other payloads as well. Yeah. Now, can I name him? Can I I'm going to just pull a random name. Never heard this before. Let's call him Mace Wu. Okay. I feel like I can rock it. The gas giant trainer. The thing about it is that you guys kind of look like a tag team cuz you're in the same color palette for sure today. Like you're very much like your color coordinator. race starts **** any second knock us out kind of promo by the way I see you voted I did vote feel burn we all vote do we all vote today I have not voted that's why I want to leave you're going to go vote Kevin you voted you're going to vote Kevin you're going to vote for Donald Trump I assume you're going to vote for Hillary Clinton and you're going to vote for Bernie Sanders Greg you voted for Bernie Sanders I voted for I felt the burn Nicki you'll vote for Hillary Clinton I assume no I'll probably vote for Kasich as well John",
            "start": 479.28
        },
        {
            "text": "and you're going to vote for Bernie Sanders Greg you voted for Bernie Sanders I voted for I felt the burn Nicki you'll vote for Hillary Clinton I assume no I'll probably vote for Kasich as well John Kasich I voted for John Kasich as a protest vote yeah protest it doesn't really matter thank you Okay, I'm registered as an independent, so my vote doesn't **** matter at all, so it doesn't matter. Now, let me Now, let me just say this real quick. It doesn't interesting, and it has nothing to do with anything we're going to talk about today, but interesting story run by Political magazine last week talks about Zachary Taylor in the 1840s Thomas. Just Zachary Taylor, the general, man, and how he ran as a Whig and he won. And he was like this no nothing like never wasn't political. Changed his mind constantly. Still won, a flip-flopper as we call it. Still, but still won. destroyed the Whig party and then the Republicans obviously came out of the ashes of that. A lot of interesting",
            "start": 522.64
        },
        {
            "text": "His mind constantly. Still won, a flip-flopper as we call it. Still, but still won. Destroyed the wig party and then the Republicans obviously came out of the ashes of that. A lot of interesting parallels there. Very interesting story about Zachary Taylor in political magazine. People should go read and check out. You're drawing a parallel between him and obviously Hillary Clinton. Exactly. Yes. Because, as I was telling Kevin at lunch, uh, the Republican party first ran a presidential candidate in 1856. John Fremont, the Pathfinder, lost to Franklin Pierce of New Hampshire. The only nickname for Franklin Pierce was \"the man from New.\" He was considered a northerner with southern sensibilities. What is that term? It's like something with dough. John Doe. Judy's dough. Pizza bread. Anyway, it was something people say in the comments. Anyway, in 1856, Franklin Pierce beat him.\n\nNote: I corrected phonetic mistakes (e.g., \"flipflopper\" to \"flip-flopper\"), spelling errors (e.g., \"northerner with southern sensibilities\" is a real phrase), and capitalized proper nouns like names (Zachary Taylor, Hillary Clinton) and places (New Hampshire).",
            "start": 558.24
        },
        {
            "text": "with dough. Tim Gettys. Judy's dough. Pizza bread. Judy's **** Judy's fine dough. Anyway, it was something. It was something people say in the comments. Anyway, in 1856, Franklin Pierce beat him. But then in 1860, Abraham Lincoln won, second Republican ever to run and win and then cause a civil war, of course. But shout out to Abraham and shout out to Civil War. But what I'm saying is that the party can collapse very quickly because of Trump and then rise back up. But there's a lot of parallels between Zachary Taylor, I think 1848, no, 1846. I This makes so much sense cuz I've always heard these southern people say, \"We will rise again.\" And they're talking about the Republican party. No, the Democrats were actually the Southerners um and the racists and the slaveholders. Just a little piece of just a little piece of, you know, history. Of course, the Republicans were the ones that were anti-slavery and the Republicans ones were ones, of course, were the northerners that fought. And",
            "start": 595.12
        },
        {
            "text": "of just a little piece of, you know, history. Of course, the Republicans were the ones that were anti-slavery and the Republicans were one's who were the northerners that fought. And when did you guys when did the good guys become the bad guys and the bad guys become the good guys? When did that change? Somewhere around season 4. Everything just **** flip-flopped on that. When do we start liking Jamie Lannister? I don't know, but we did. Yeah, it's a great point. It's true. That's a good one. Um Tim, you're dying. I am dying. I'm convinced I'm dying. I, you know, exaggerate a lot, but I think this is it. I I really do think you seem like you're holding this together. I don't think I'm going to make it to E3. My big problem here last time for sake was the PAX pause. We all go or none of us go. The PAX the PAX plague. You're a shame to me. You're not getting away. I'm telling none of us. When we when we were at PAX, it was like day two or something. And then all of a",
            "start": 634.56
        },
        {
            "text": "go or none of us go. The PAX the PAX plague. You're a shame to me. You're not getting away. I'm telling none of us. When we when we were at PAX, it was like day two or something. And then all of a sudden me and Kevin just got hit **** hard. Yeah. Yeah. Cuz you hang out with Kevin. I know. It sucked. We were We It was bad. And you got hit too. Mhm. So then And I never get punched by the sickness. Me neither. We So that was the last time I've been sick. And uh then that left you guys You guys did the show and power. We never get sick. What the **** is wrong? Um so So now we're, you know, after coming off a kind of funny lie. Yeah. You're tired, exhausted. I treated my body like utter **** for at least two weeks. You treat it like Kevin treats his normal body normally. Yeah. And I don't have the resistance that Kevin has built up over the the, you know, 26 years of his life. Kevin only gets sick every 3 weeks. So yeah. So yeah, Kevin, you're used to being sick all the time. But no",
            "start": 669.36
        },
        {
            "text": "have the resistance that Kevin has built up over the 26 years of his life. Kevin only gets sick every 3 weeks. So yeah. So yeah, Kevin, you're used to being sick all the time. But no, so I haven't been sick since this past. He's the opposite. Clement always got sick cuz he was too clean. He had no antibodies. Kevin will drop a sandwich in a gutter and pick it back up and eat it. Then wipe his hands on his pants, wear the pants the next four weeks. Well, that Yeah, the last part. Yeah, true. Anyways, I'm really not doing well. Like right after Are you getting better? So So about 2 days after Kinda Funny Live, I realized that I was like, \"Oh, **** I'm getting sick. I can feel it.\" You know that shitty feeling. Then I wake up one day and I'm like, \"I can't go to work.\" Like I had to I had to miss GamesCast or whatever that it was that day. I'm like, \"Shit, I just really can't do this.\" Cuz I just my head felt like there was water in it. You know what I",
            "start": 711.44
        },
        {
            "text": "to work.\" Like I had to I had to miss Game Over Greggy or whatever that it was that day. I'm like, \"Shit, I just really can't do this.\" Cuz I just my head felt like there was water in it. You know what I mean? It was that whole thing. I was like, \"I just need to sleep this off.\" Slept the entire day. Wake up the next day with a sore throat. The head feeling's gone, but now I got a sore throat. Wake up the next day with an ear ache. I haven't had an earache since I was like four years old. And like, do you guys remember being here? I'm contagious. I think I'm past that at this point. But hopefully we'll get sick and not have to go to E3. When's the last time you guys had eggs, Nick? How does it go? How does it go? It's You do what? No. Damn it. You do what the other person's doing. There you go. Thank you. When was the last time I had an earache? Yeah. I don't know if I've ever had an earache. Oh, really? Yeah, man. I don't I mean I don't Oh, you've had an earache.",
            "start": 750.64
        },
        {
            "text": "There you go. Thank you. When was the last time I had an earache? Yeah. I don't know if I've ever had an earache. Oh, really? Yeah, man. I don't I mean I don't Oh, you've had an earache. Have I? I'm sure you've had an earache. We'll call big old Jamie K. It sounds like you have a sinus infection. So So the problem was I haven't had an earache since I was like four and I remember them being the most traumatic experiences I've ever had because I'm a dumb little kid. So as I grew up, I was like, \"Oh, I was a dumb little kid. Like I must have been bitching about nothing.\" And then let's see what big old Jamie Kennedy has to say. cuz I had a lot of ailments growing up. I don't remember earaches being one of them. Oh, you you sure did have a lot of ailments growing up, didn't you? I got them all written down. That was great. Hey, Mom. You're on the Game Over Greg Show. How are you? Good. How am I good? Hey, in all my, you know, litany of sicknesses and whatever, did I ever did I",
            "start": 789.36
        },
        {
            "text": "got them all written down. That was great. Hey, Mom. You're on the GameOverGreggy Show. How are you? Good. How am I good? Hey, in all my, you know, litany of sicknesses and whatever, did I ever did I suffer from earaches? No, you never had earaches, but you had uh throat problems all the time. That's why you had your tonsils removed and had adenoids taken out. Yeah, throat problems were I had a big throat problem. Still do. Yeah. It's too awesome. Yeah, but I'm sorry. Should have been all taken care of when we took out those organs. Yeah, well, they probably left one in. All right. Thanks, Mom. Love you. Love you, too. Bye. I don't know if it was taking out the organ putting an organ into his mouth over. My mother was just on the phone. I always had to wait till he was Tim Gettys coming in my mouth. No, that could have been anything. It could have been a big hot dog. It was a  It was definitely a  Well, okay, whatever. ear infections or earaches suck. And",
            "start": 826.64
        },
        {
            "text": "coming in his mouth. No, that could have been anything. It could have been a big hot dog. It was a **** It was definitely a **** Well, okay, whatever. ear infections or earaches **** suck. And uh I haven't had one since I was very young. And then all of a sudden I woke up at like 3:00 a.m. and I'm like, \"What the **** is this pain?\" It's It was the worst pain I've ever experienced in my entire life. It did not go away for like 6 hours. Couldn't go back to sleep. Just ringing pain. Like no nothing made it feel more comfortable or anything. I was just like, \"Fuck, I want to die. This is not worth living.\" Sure. Had some ibuprofen eventually and then it eventually went down a little bit. Since then, my ears have just had a constant ringing for the last couple days. Yeah. It's just all I hear is ringing now. And it's like this I can handle. This is just like, you know, baby stuff. When are you going to go to the doctor? I don't know. When am I? You have tonsillitis. Am I going to do it",
            "start": 871.92
        },
        {
            "text": "I hear it's ringing now. And it's like this, I can handle. This is just like, you know, baby stuff. When are you going to go to the doctor? I don't know. When am I? You have tonsillitis. Am I going to do it before E3? Yeah, you could easily do that before E3. I don't think I can. It's too much to do before E3. No, there really is. And then there's Let's Play Live. Those are after E3. I'm worried about this, Greg. Nick, do call Greg live on Friday. Okay. Okay. There you go. You got the morning off. You can go well, do that. I'm going to guess Tim. There's a lot, there's a few setup things he has to do before cuz I don't think he's been to a doctor in probably a few years. That's the problem. So, he probably doesn't have a primary care physician. I got a good one. I'll send you. There's so much, so much issues with my life. My life is so hard. And I don't like it. I really, really, really don't like it. The the the ear the ear infection thing was like the worst part cuz that was like",
            "start": 910.48
        },
        {
            "text": "so much so much issues with my life. My life is so hard. And I don't like it. I really really really don't like it. The the the ear infection thing was like the worst part cuz that was like that was the pain. And then after that, the last couple days have just been me just kind of like dealing with it. But it's just not going away. Like I felt like I was on the decline of it and then all of a sudden now it's like still here and I'm worried because it's been a whole week. Yeah. And I've been like just down in my bed sleeping a lot. Yeah. Like I mean you might have you might have an actual sinus infection. Now I'm worried I have an actual infection. Antibiotics are probably at Walgreens too. They got stuff. Did you go there? They got they got to have ear drops. And I feel like my throat's getting a little scratchy though. That's just my Don't worry. I'll make sure that you get to LA water buddy. I'm on the opposite end. I want to be good for E3. I can't",
            "start": 946.8
        },
        {
            "text": "And I feel like my throat's getting a little scratchy though. That's just my Don't worry. I'll make sure that you get to LA water buddy. I'm on the opposite end. I want to be good for E3. I can't wait for E3. I mean, if you're going to get sick, this is a great time. Right now, you got you got to wait. You got to stretch it out. I won't know till Saturday, Sunday. Why not? I want to poke you right there. Why on my vote sticker button? The thing you'll never have. Why not? You're not going to make it to I just have a string of them on my shelf that I put I put one on a PSP once. That was my I loved it. I loved it. That was my thing. Yeah. So, go to the doctor. I don't know, man. Why don't you go to the doctor, dude? Because it's going to be a lot of It's honestly it's a time thing. I mean, I don't have anything. Don't have that **** Like, I don't know the **** Just go to the **** doctor. Go to urgent care by uh Oh, no. You're going to Yeah. It'll cost you an arm and leg. No, it",
            "start": 982.56
        },
        {
            "text": "I don't have anything. Don't have that stuff. Like, I don't know what's going on. Just go to the doctor. Go to urgent care by uh Oh, no. You're going to Yeah. It'll cost you an arm and a leg. No, it won't. You've got most likely 100 bucks. Yeah. Go to urgent care. Yeah. They take about an hour to get in. Like, I've had this thing forever. They'll just give you a prescription for antibiotics and you'll take Yeah, you need like uh if he has anything. I don't think he does. And make sure you're not coughing in your own mouth Friday night or Saturday night. My mouth with my mouth will do right around Friday. All any of you who want to get sick, it's super simple. Just accept bare food from Kevin. Ask for whatever. Hey, can I have one of those chicken wings? Can I have that cookie? I don't eat bear. So, is that a joke or That was a joke. Okay. You don't eat bear. That was You're a piece of crap Kevin. Really is. No, I mean I'm mostly I want to go to the doctor. My problem is",
            "start": 1024.4
        },
        {
            "text": "I don't eat bear. So, is that a joke or That was a joke. Okay. You don't eat bear. That was You're a piece of **** Kevin. Really is. No, I mean I'm mostly I want to go to the doctor. My problem is that we're running out of time here. There's a lot of **** that has to get done. Friday. Friday. I got **** to do Friday. You don't have **** to do. You got to get passports and stuff Friday. Jesus Christ. Oh my god, I forgot you don't have a passport. You can do that at the same time. Go to urgent care. There's Walgreens across the street, dude. Make no make an appointment for a post office and just go get it all taken care of. Rob a bank. When I got my passport, it was like it was dealing with the federal government nightmare issues always cuz federal government sucks. Uh but the uh getting my passport was like the easiest thing I'd ever done in my life. I was like I was shocked. It was almost like the story I told when I when I set um set up Erin's internet with Comcast and it was",
            "start": 1062.0
        },
        {
            "text": "my passport was like the easiest thing I'd ever done in my life. I was like I was shocked. It was almost like the story I told when I when I set up Erin's internet with Comcast and it was like I was like really that's it. That is every once in a while like you know that's the opposite I experience I had renewing my passport which was the most inept experience of my entire life cuz the guy that was working at the post office and maybe it was his silent protest but he just refused to answer any more than one question at a time before going and helping someone else. So I I brought the form up to him and it's the form doesn't make any sense. No, you have to give them your passport, which is terrifying cuz you're like, if they if this gets lost, then I just don't have a passport and I'll never be able to renew it. And I was like, so is this what am I supposed to do here? And the guy's like, \"Oh yeah, yeah, that's probably where your birthday goes. Excuse me one second.\" And then we",
            "start": 1102.16
        },
        {
            "text": "never be able to renew it. And I was like, so is this what am I supposed to do here? And the guy's like, \"Oh yeah, yeah, that's probably where your birthday goes. Excuse me one second.\" And then we like, \"Go away and help someone else.\" I'm like, \"Jesus Christ, this is the worst.\" You need to make sure you don't have to fast track it, though. Yeah, you're going to have to I'm screwed. I'm very screwed when it comes to all this **** You're going to have to go to an outside agency to do that. See, the problem is you just keep putting all this off, though. Mhm. You got to you got to tackle one of them. You got to tackle two of them. Yeah. The passport needs to happen. And the the the scariest thing for me about when I got my passport was you actually have to give them your birth certificate. See, that's just And then they just take it and then they mail it back. Well, you don't have a birth certificate. I do. It's lost in your mom's house. Completely unobtainable. Well, you",
            "start": 1139.84
        },
        {
            "text": "See, that's just And then they just take it and then they mail it back. Well, you don't have a birth certificate. I do. It's lost in your mom's house. Completely unobtainable. Well, you It's not passport then. Yeah. Cuz I need to go get the birth certificate and then I can get the passport. Yeah. Yeah. Without the I know the process. I just need to do it. This is a quest. It is. It is. It's a multi-part quest just like The Witcher 3. Here's what I'm going to propose. Good. Good. It's going to sound like a lot of work cuz it is, but it'll be worth it in the end. We're doing another GameOverGreggy show tomorrow. Let's do it in the car. Driving around doing errands for Tim. It's a great idea. You take the whole setup into urgent care. Just sit there talking. I love that idea. I love that idea. That doesn't infringe on anyone's privacy at the medical office. No, not at all. Uh I will say that uh you know, I've been to Europe three times, been to Asia twice. You're not really missing",
            "start": 1170.64
        },
        {
            "text": "That doesn't infringe on anyone's privacy at the medical office. No, not at all. Uh I will say that uh you know, I've been to Europe three times, been to Asia twice. You're not really missing You're not really missing anything. So, I can tell you about it. Okay. It's uh uh tell me about Asia. Asia is an interesting place. I've been to Japan twice. It's a very nice country. Very clean. The people are very nice there. The food's very good. So Mario basically already set. Oh, yeah. They love video games. You already know Mario. So you're they video games. So you're pretty much okay with Japan. Uh Europe. Uh some people speak English, some people don't. The food's okay. Uh the there's a lot of terrain, different kinds of terrain. Ge the geography is a little different. And there's a lot of countries very close together and you can go in between them very easily because of the EU. And basically that's all you're missing. So you can probably just stay in the United States and be totally",
            "start": 1206.96
        },
        {
            "text": "countries very close together and you can go in between them very easily because of the EU. And basically that's all you're missing. So you can probably just stay in the United States and be totally fine. I'm I'm good. Ham sandwiches are big in France. I like ham. Putting that out there. That's the thing. They call it jambon. Jambon. I like the little accents. They they do that well. In any train station when you do that. They'll bring you the same sandwich. Whenever I say bone, I'm looking at you or at least thinking about you. Good bone. Uh, no, but you you should get So, when I got my passport, um, I was at IGN and I actually just charged your first time. Yeah. I actually charged IGN for uh the fast track because I needed to. So, you it's not that expensive. I think it's like $100 and the State Department will do it in like a month instead of like two or three. Yeah. No, I looked into it recently to try cuz I was trying to figure all this out before we got, you know, screwed",
            "start": 1245.04
        },
        {
            "text": "The State Department will do it in like a month instead of like two or three. Yeah. No, I looked into it recently to try cuz I was trying to figure all this out before we got, you know, screwed and we just constantly get screwed because we just do so much **** So, I know what we need to do. I feel like the pressure should be coming off you, right? In a way. Kinda Funny Live was the pressure cooker killing you and then I took the baton for E3. He's killing me planning it. But like that doesn't mean everything else isn't happening. No. No. He's got three or four Kinda Funny exclusives happening. There won't be exclusives. That sucks. I don't want to go. Actually, there will be. You know, it looks like these Lego Dimensions. Green Arrow. Super. They look **** real. I cannot wait. Was it Green Arrow? I thought it was just the arrow. His name was the Arrow. No, that's on the show was called Arrow. And then eventually he became Green Arrow there, too. But it was always Green Arrow.",
            "start": 1285.92
        },
        {
            "text": "It Green Arrow? I thought it was just the arrow. His name was the arrow. No, that's on the show was called Arrow. And then eventually he became Green Arrow there, too. But it was always Green Arrow. Now he's Green Arrow there, too. It's cool. He came back when he had the armor that went around his tricep. He does have He does have some tricep. Is that This is a bicep though, right? Well, it kind of curled around this way. It was weird. I don't like the costumes on Arrow, but we don't get into that now. I don't I don't mind. You should go to Urgent Care. What's going on with John D? I didn't watch the season. **** weird ass helmet. Oh, that's been two seasons from now and it looks weird. Yeah, this the Cuz I watched last season. The Spartan helmet. Yeah, the visor and **** Terrible. That was this season. I thought it was last season. I haven't watched at all this season. So, leading into Legends of Tomorrow, you got that. It's I didn't like it at all. We'll save it. We'll save it.",
            "start": 1318.96
        },
        {
            "text": "was this season. I thought it was last season. I haven't watched at all this season. So, leading into Legends of Tomorrow, you got that. It's I didn't like it at all. We'll save it. We'll save it. Save it. We'll save it. We should have an Arrow at all.",
            "start": 1350.48
        }
    ]
}