{
    "id": 1800,
    "video_id": "r5srOX0_vkA",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "Lego Dimensions Year 2 E3 2016 Trailer - Kinda Funny Reacts",
    "description": "Subscribe for all your E3 2016 updates! https://www.youtube.com/c/kindafunnygames?sub_confirmation=1\n\nGreg and Tim breakdown the Lego Dimensions Year 2 E3 2016 Trailer!\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy",
    "published_at": 1465767000,
    "duration": 398,
    "transcript_chunks": [
        {
            "text": "E3 2016 is happening. Kind of Funny is going all out with let's plays and reaction videos all week long. Subscribe now at youtube.com/kindafunnygames to not miss a thing. What's up guys? I'm Tim Gettys. This is Greg Miller. Today we're talking about a game with cartoon violence and crude humor. You know that means what does it mean? Lego Dimensions. No, not two. Lego Dimensions Year Two where they're actually rolling out and doing all this stuff. Now you want sound at all. Do you care about the sound? It doesn't matter to me. No, we're going to knock it a bit. Worried about some. Now, you know that in terms of breakout hits in terms of Greg Miller's favorite games from 2015, right at the top, Lego Dimensions. I love this game. I have all these toolboxes in my room now filled with all these Legos. Great conversation starters when you bring girls home. Let me tell you, they want to know all about why you have all these plastic toys over there. So, obviously, these were the guys from",
            "start": 0.09
        },
        {
            "text": "Legos. Great conversation starters when you bring girls home. Let me tell you, they want to know all about why you have all these plastic toys over there. So, obviously, these were the guys from our original adventure set. Slimer's already been put out. Uh, but if you go through, they reveal, of course, now the female Ghostbusters in there. Give me a pause. What's interesting about the female Ghostbusters is that they are going to be the first story pack for Lego Dimensions. We've had, of course, level packs, like your Portal one, you jump in, you have a Portal level. The fun packs, which are just here's some characters to play around with. No new levels except maybe they access a world you couldn't get to before. And then team packs, which are like Joker and Harley, where here's two characters in one box. A story pack for the Ghostbusters is going to tell the new Ghostbusters movie in six levels. It also gives you a new thing to put over your Dimension portal. So the whole movie",
            "start": 45.68
        },
        {
            "text": "in one box. A story pack for The Ghostbusters is going to tell the new Ghostbusters movie in six levels. It also gives you a new thing to put over your Dimension portal. So the whole movie like it's so it's pretty much like acting as if it's a Lego game. Correct. But six levels of don't get your, you know, hopes super high, but six levels of it. I in my head I think that what's interesting is um you know I don't know if you know this about me. Not many people on the internet know this. I like trophies a lot. Yeah. So whenever I talk to TT Games about Lego Dimensions, I bust their balls about trophies saying if you really want just people to keep playing this game, play it again. Just you already have all this content in there. Put more trophies on there. Well, they can't because this that and the other. I think story packs might be a way around it to put in more like put in like a real not a real but like more of a Lego system you're used to with your Lego Marvel games where",
            "start": 77.84
        },
        {
            "text": "this that and the other. I think story packs might be a way around it to put in more like put in like a real not a real but like more of a Lego system you're used to with your Lego Marvel games where there's more to do and things like that. Um but it'll let you revamp the portal yourself and do all these different things. Make it look like the Chinese uh restaurant they work out of. Cool. Interesting move see I wonder if they made that deal long before everybody's like I hate the new Ghostbusters and then everybody had to fight Harry Potter. Now there he is. Now the upset the boy who lives Harry Potter. No, the thing about Harry Potter, which is upsetting, of course, is that he's a fun pack right now. Meaning that you get him and I believe Voldemort is going to show up later in the trailer. I believe maybe they're a team pack. I don't know if I have it on you. But what I don't like about it is that I know that they're not a level. Yeah, hold on. They're a fun pack. Harry Potter is",
            "start": 112.4
        },
        {
            "text": "I believe maybe they're a team pack. I don't know if I have it on you. But what I don't like about it is that I know that they're not a level. Yeah, hold on. They're a fun pack. Harry Potter is a team. I'm sorry. Harry Potter is a team pack. A team is a fun pack. Harry Potter being team pack means you'll get Voldemort, but you don't get a new level. Got it. Upsetting except for in this trailer they teased the Fantastic Beasts and where to find them. That in the press release which kind of got buried in some of the news stories is the latter half. This is basically the trailer is showing you content that'll be coming out until next year. Next year this time some Oh, so all of year two. Yeah, exactly. But then they announced a bunch of stuff they don't even show here. Fantastic Beasts and Where to Find Them is going to be another story pack similar to Ghostbusters. I assume that's timed out for Yeah. Powerpuff Girls was announced, but it's not in the Exactly. Exactly. setting. So",
            "start": 147.12
        },
        {
            "text": "Where to Find Them is going to be another story pack similar to Ghostbusters. I assume that's timed out for Yeah. Powerpuff Girls was announced, but it's not in the Exactly. Exactly. setting. So here you go. Bigger characters. We got the Ghostbusters. We got this. Yeah, they they just ran through their Chinese restaurant here when come out all these guys. Voldemort part of the team pack with Harry. You'll get him. This is an excellent trailer, by the way. Oh, yeah. We were talking about it on Calling All Cars Live. I love the transitions and segues that they do. It's It's really good. They do a great job. They understand their thing. Mission Impossible announcement. Everyone's most requested character. Tom Cruise from Mission Impossible. I like that it's a level pack. I I made a You know, I only I try not to buy everything for Lego Dimensions. I buy every level pack cuz level packs are fun. They come with a bunch of trophies which I like. But the level I'll be getting this one even though",
            "start": 182.48
        },
        {
            "text": "I try not to buy everything for Lego Dimensions. I buy every level pack cuz level packs are fun. They come with a bunch of trophies which I like. But the level I'll be getting this one even though I don't even think I ever saw the original Mission Impossible. Here we go. E.T. E.T. the extraterrestrial. You might have heard of him trying to phone home. There he is. He is trying to phone home. Hogwarts down there. You think it's more serious? No, it's Goonies. Everybody most requested. Don't be a hater. You know people that got excited for it. Now these Adventure Time, guys. That's a big one. People like another level pack. This it's going to be interesting because they're similar to me in the Doctor Who way. I had never watched an episode of Doctor Who, but I bought the level pack for Doctor Who. Enjoyed it and watched an episode. A team, here they come. They're coming out later. Ba Barackus. There we go. Here we go. Now, this is the exciting one. Gremlins. Yeah. You goddamn kidding",
            "start": 217.92
        },
        {
            "text": "Who enjoyed it and watched an episode. A team, here they come. They're coming out later. Ba Barackus. There we go. Here we go. Now, this is the exciting one. Gremlins. Yeah. You goddamn kidding me with the Gremlins? Come on. Everything we love. I really like that. They're the Everything we love. Everything we love, Colin. The A and Gremlins. Everything we love. There's something for everybody in this game. I I do like that they boy getting everybody in this. Like even people that aren't actual Lego properties properly has been Lego Gremlins, you know what I mean? But they're like, \"Let's do this shit.\" Super excited to see Beast Boy cuz it is a Teen Titans Go thing. There's your Fantastic Beast guy. Over on their Instagram, they've shown images of Raven, which got me super excited. I'm super excited to have all the Teen Titan Goes, the guy there. That's Lego Dimensions year 2. They showed Golem here. And then here we go. Here's the big one. Colin, you ready for this? You ready for",
            "start": 252.96
        },
        {
            "text": "super excited to have all the Teen Titans Go, the guy there. That's Lego Dimensions year 2. They showed Gollum here. And then here we go. Here's the big one. Colin, you ready for this? You ready for this? In the debut of what would be the best Sonic game since any Sonic game ever. Sonic now and Lego Dimensions. Did Sonic just take the Master Emerald? The one true Master Emerald? He took a ring. He took a ring. He took the ring. Lego Dimensions is about mixing everything up. Hedgehog 2016. It's the comeback year. So, what I want to do here is run down this cuz it's very confusing. All right. Lego Dimensions pack based on 16 new entertainment properties will begin launching on September 27th, 2016 with the Ghostbusters story pack, Adventure Time, and Mission Impossible level packs, Harry Potter and Adventure Time team packs, The A-Team Fun Pack, additional expansion packs based on other highly anticipated films, Fantastic Beasts and Where to Find Them, and The Lego Batman Movie and wildly popular",
            "start": 292.72
        },
        {
            "text": "Time Team Packs, the A-Team Fun Pack, additional expansion packs based on other highly anticipated films, Fantastic Beasts and Where to Find Them, and The Lego Batman Movie and wildly popular properties, The Goonies, Sonic the Hedgehog, Teen Titans GO!, Lego City Undercover, Knight Rider, The Powerpuff Girls, Gremlins, Beetlejuice, and E.T. the Extra-Terrestrial will be released in product waves stretching into summer of next year. All expansion packs will provide players with continued compatibility. Very exciting stuff. Now, as if this wasn't enough to get your dick rock hard, we're going to E3. Yes. And there's been all these rumors. Hubba. Hallelujah over on Brick and Mortar.com about these leaked little images, leaked let's plays, leaked whatever of a Green Arrow and a Supergirl Lego Dimensions character and they're in little poly bags. The rumor is at E3 they're gonna be giving these out and I will be getting them people. Oh doctor, will I be getting them? I can't wait. We're all",
            "start": 329.92
        },
        {
            "text": "Character and they're in little poly bags. The rumor is at E3 they're gonna be giving these out and I will be getting them people. Oh Doctor, will I be getting them? I can't wait. We're all excited for GameOverGreggy. Let us know in the comments how excited for him. Best E3 ever. We'll see you later.",
            "start": 377.68
        }
    ]
}