{
    "id": 1858,
    "video_id": "txdHJI_9g4M",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "We Played The Last Guardian - Kinda Funny Reacts E3 2016",
    "description": "Subscribe for all your E3 2016 updates! https://www.youtube.com/c/kindafunnygames?sub_confirmation=1\n\nTim and Colin FINALLY play The Last Guardian at E3 2016.\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy",
    "published_at": 1466110801,
    "duration": 558,
    "transcript_chunks": [
        {
            "text": "We Played The Last Guardian - Kinda Funny Reacts E3 2016 is happening. Kinda Funny is going all out with let's plays and reaction videos all week long. Subscribe now at youtube.com/kindafunnygames to not miss a thing. What's up everybody? Welcome to another Kinda Funny Reactions from E3 2016. I'm one of your hosts Greg Miller alongside the other host Tim Gettys. Let Tim host. And Tim, Mhm. I couldn't believe it. You've touched the ethereal plane. You've played The Last Guardian. I played The Last Guardian. And let's stop and think about that for a second. That's a statement. That is not a joke. That is not a lie. That is a fact. That is something that happened. And I couldn't believe it. I waited a damn long time to play. 45-minute demo. So you had to sit through a bunch of people for 45 minutes playing. So 45-minute demo and I was like five people back. It was rough. But was it worth it? You'd already waited so long at that point. Exactly. That's the thing, is it's like what's another year of waiting in line, you know, like",
            "start": 0.12
        },
        {
            "text": "Five people back. It was it was rough. But was it worth it? You'd already waited so long at that point. Exactly. That's the thing - is it like what's another year of waiting in line, you know, like whatever. Um it was it was worth the wait for sure. Like I I'm happy I did it. Yeah. Um, The immediate thing is this is not getting one of my game of the year nods. It was a contender. It was a contender, but it didn't wow me in that way. Okay. Very excited to play this game. Okay. So, it it wasn't bad. Oh, no, no, no, no. It's definitely not bad, but it it was this demo at least. And honestly, it might have been that it was too long. Like, I think that I I might have got too much of the game with also not getting enough of it, you know? So, it was kind of leaving me in a in a weird place. It's like the demo didn't really end in like a a way that would make me want to play The Last Guardian now in October. It's kind of like all right, you know, it's the beginning of the game. You",
            "start": 42.4
        },
        {
            "text": "like the demo didn't really end in a way that prepared me to play The Last Guardian in October. It's kind of like all right, you know, it's the beginning of the game. You've only seen the first 45 minutes and it's definitely like the tutorial. I will say it's really good for being a tutorial of a game. Okay. Like it's they handled it really well and like the way you kind of learn how the controls work and the climbing and interacting with Trico and all that stuff. Yeah, it was very very very well done. Um I think the game is not that pretty. It has a lot of graphical issues. Okay. Um like what because they're doing an art style to it, right? I mean it's or is that they're going for it. It's funny that it really really really is similar to my discussion about The Legend of Zelda that we were talking about where it's like it looks like a last gen game and clearly clearly and it's it is you know the art style though does make up for it. It's it's a beautiful game in that sense, but",
            "start": 86.24
        },
        {
            "text": "talking about where it's like it looks like it's a last gen game, clearly, and it is you know the art style though does make up for it. It's a beautiful game in that sense, but uh there's a lot of just graphical issues like there's a lot of um glitchy things or things like his shield kept popping away randomly and it's like he'd go to grab it and it like just would disappear before it came to his hand or he gets on the ladder. It just the animations just kind of looked off and it wasn't consistent. I think that was the bigger thing and a lot of weird random tearing everywhere enough for it to be distracting. I usually don't really care about that stuff. But I will say to turn that into a positive, the game really did feel like a throwback to like the PS2 generation overall. You know, like we had ICO and Shadow of the Colossus back then and those games are amazing and beautiful. This feels a bit more like ICO than Shadow of the Colossus. Okay. Which is more what",
            "start": 130.4
        },
        {
            "text": "We played The Last Guardian at E3 2016. You know, like we had Eco and Shadow of the Colossus back then and those games are amazing and beautiful. This feels a bit more like Eco than Shadow of the Colossus. Okay. Which is more what exploratory wandering environments. A little bit more. At least what we played um is a little more confined, you know, and it's just you and the bird dog. Yeah, bird dog. Uh, trio and it's, you know, obviously just like Eco had you and whatever, but Shuttle Claus is a little bit more open. You know, you had the horse and you're going around, but it was just like with this specifically, a lot of the climbing the ladders, climbing on the trio and all that stuff. It felt very much like Eco, which is a good thing, but it just felt Is it something you want to play more of? Yes, 100%. 100%. It's impossible for this game not to be underwhelming when you play a demo of it, right? I think that's about emotional connection and telling a story and knowing all these",
            "start": 168.72
        },
        {
            "text": "More of? Yes, 100%. 100%. It's impossible for this game not to be underwhelming when you play a demo of it, right? I think that's about emotional connection and telling a story and knowing all these characters. So, the thing there though is that it the game made me feel and I think that that's why I want to keep playing it and that's why I think that it's going to be well-received when it comes out. I don't think it's going to be as well-received as Shadow of Colossus based on a little bit I played. That's the tough part. Yeah. Yeah. U because obviously you're right like you can't really judge this game. It's going to be really hard to review this game. Sure. I think because it is going to be it's it's very similar to me uh like a flower um or a Journey but I think it's even more like the Flower side than the Journey. Journey was a little bit more fleshed out and Journey had a point of making you feel emotional. You know it's like it was building toward it was telling a story.\n\nI corrected the following errors:\n\n* \"100%. 100%\" -> kept as is (no change needed)\n* \"underwhelming\" -> no change needed\n* \"Shadow of Colossus\" -> capitalized proper noun\n* \"well-received\" -> added hyphen for correct spelling\n* \"Journey\" -> capitalized proper noun and corrected to match the show's title case style\n* \"Flower\" -> capitalized proper noun",
            "start": 214.08
        },
        {
            "text": "like the flower side than the journey. Journey was a little bit more fleshed out and Journey had a point of making you feel emotional. You know it's like it was building toward it was telling a story that was pretty obvious. You know what I mean? Like it's there's an obvious destination. You obviously doing something. Flower is a bit more open-ended where like you feel emotions from it, but it's kind of what you put into it. And that's definitely this interacting the it's a game about the relationship between him and the and it's kind of like you and a pet, you know, but what's interesting about it is it the feelings it gets you aren't necessarily like, oh, it's loving, it's a loving relationship. Kind of fear in a lot of ways. You're afraid of the bird dog. Yeah. Like cuz the bird dog um so in the demo it it it's hungry. It's it's it's like kind of like locked up. It's been shot. It's wounded. Okay. There's arrows in it and stuff. You're pulling the arrows out and it's freaking out",
            "start": 251.2
        },
        {
            "text": "so in the demo it's hungry, it's locked up, it's been shot, it's wounded, okay, there's arrows in it and stuff, you're pulling the arrows out and it's freaking out like an animal would, you know, even if it's a pet that's your pet and you love it, if it's injured and you're doing stuff to it, it's going to be like \"ah\" and growl and stuff, um so but it's a giant thing, so the growling is really scary, and its eyes kind of change colors based on how uh it's feeling and its emotions and stuff, and through that there's a lot of storytelling, I think that's where this game excels is that it's non-verbal, lots of non-verbal communication going on, and that's it's fun because it it really it's very engrossing the entire time, I'm just like constantly aware of where he was and I wanted to be near him, I didn't want to see I didn't want him to do anything, yeah but but that's the thing is it's it's like with with dogs it's like you miss them",
            "start": 293.2
        },
        {
            "text": "aware of where he was and I wanted to be near him. I didn't want to see I didn't want him to do anything. Yeah. But but that's the thing is it's it's like with with dogs it's like you miss them and like you want to know what they're up to. I do. Portillo, right? I miss him right now. What's he What's he doing? But like um and the it acts really animal-like and uh like pet-like specifically in a way that it's like just it doesn't it's not like an intelligent being of run being able to run off on its own. You can't trust it. Yeah. Exactly. So it's it's doing all this stuff. So when I was in like other rooms and stuff, I was constantly like what's up? I'd go back and it was doing something else. Right. Eating out of trash. Um and it's like it's like scared of water cuz it has this like electric tail thing. So it didn't want to go in the water and stuff. So it's kind of like even though it's it's really hungry. That's the thing. So you have to you have to try to feed it, but it doesn't want",
            "start": 333.92
        },
        {
            "text": "So it didn't want to go in the water and stuff. So it's kind of like even though it's really hungry, That's the thing. So you have to try to feed it, but it doesn't want to eat if you're handing it to it. So you have to put it down in front of it. And it's just like it's all these little things that are super trivial. Interesting. But it just it adds up to being really connecting with the character. But again, I got weirdly scared of the whole situation and but I like that though because it's like that fear then turned into like a mutual respect between us, you know? By the end of it, Tim respected my boy. Um but it's I think they're going to play with that a lot. And like seeing in the trailer there's two of them. It's like there's a lot of questions like where what's the point of this? Where are we going with this? And I think that we'll get those answers. The game plays fine. Like it's",
            "start": 371.12
        },
        {
            "text": "of them. It's like there's a lot of questions like where what's the point of this? Where are we going with this? And I think that we'll get those answers. Um, the game plays fine. Like it's not that fluid controlling. I felt a little bit like it's not one of those games where you play and you're like, \"Man, everything I wanted it to do, it did.\" It was more like, \"Why aren't you grabbing that thing?\" or \"All right, the jump is not getting me where I need to go.\" I feel like it should be like that type of stuff. So, the game got in its own way a lot with the controls and the kind of mechanics. A lot of the puzzles are very simple. It was at the beginning of the game, so I can't blame it for that. Imagine it getting harder, but I also don't really see it getting that rewarding. And I think that's kind of the biggest worry for me because Shadow of the Colossus was so awesome in that sense. The Trico has like a shield thing that could emanate light and uh this",
            "start": 404.72
        },
        {
            "text": "We Played The Last Guardian - Kinda Funny Reacts E3 2016 was so awesome in that sense. This the he has like a shield thing that could like emanate light and uh this the moment you start doing that the electric tail of the trio starts shooting so you can kind of like break down barriers to get through and you're interacting stuff but it was very kind of by the books like color by numbers where you're like all right I know exactly what I need to do in this room to proceed and then it becomes about just getting that thing done and that's the part that wasn't fun okay so that's the part that I was like ah like I wish I wish it played a little bit better I wish it like graphically didn't have as many issues but again it did remind me of a PS2 game and there's something novel about that that I enjoy. So, I'm still I'm high on the game. It sounds like I'm being really negative. You're definitely making me feel like this is like what I predicted with The Last Guardian",
            "start": 441.92
        },
        {
            "text": "novel about that that I enjoy. So, I'm still I'm high on the game. It sounds like I'm being really negative. You're definitely making me feel like this is like what I predicted with The Last Guardian that it's just going to be this thing that is not going to live up to expectations. It's going to feel like it's last gen. I think that uh that that stuff like you just you got to put it aside. Like you need to not think about it taking this long to come out. Just enjoy it for what it is. Sure. Because if you do that, if you don't think about the hype and whatever, this is a great game. It's really seemingly very beautiful artistic vision and like there's de they're doing something this it's different. It's definitely different you know and I think that they're they're committing to the vision that they have and I think that they are succeeding in that. It's just is that vision worth 10 years and all the hype of will it be at this press conference? Oh my god it is release stage this.",
            "start": 480.64
        },
        {
            "text": "that they have and I think that they are succeeding in that. It's just is that vision worth 10 years and all the hype of will it be at this press conference? Oh my god it is release stage this. No, it's not. It's definitely not but it couldn't have been. So I think that uh the I think it's going to be a good game at worst. Okay ladies and gentlemen, what do you think of what you've seen of The Last Guardian? Let us know in the comments. Then share this video with your friends. Of course, subscribe to youtube.com/kindafunnygames cuz we're at E3 and we're putting up all sorts of crazy videos. Kevin's over there working his little heart out. How you holding up, Kev? Real good. Real good. He says he's lying through his teeth. Ladies and gentlemen, until next time, it's been our pleasure to serve you. Tim's dying. Dead. Tim. I don't like this man. Shouldn't have gotten sick.",
            "start": 514.96
        }
    ]
}