{
    "id": 333,
    "video_id": "012iMiuNlc4",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty"
    ],
    "title": "Girlfriend Porn, World Cup, and a Mystery Box - The GameOverGreggy Show Ep. 30",
    "description": "Full Episode Friday! Get it EARLY here! http://gameovergreggy.bandcamp.com\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1404457201,
    "duration": 6221,
    "transcript_chunks": [
        {
            "text": "what's up Jasper Indians it's me Greg Miller and this is the GameOverGreggy Show this week I'm joined by the pride of Long Island Colin Moriarty go USA the producer Nick Scarpino I'll back that go USA why not and the pure one Tim Gettys I'm rooting for Barcelona oh good lord everybody if you didn't know the GameOverGreggy Show is a weekly podcast where four sometimes five best friends gather around this table each bringing a random topic of discussion to enjoy with you if you like that make sure you get the new episode as an MP3 every Friday over at gameovergreggy.bandcamp.com I was close and scre went uh over there we charge you $1 and it goes up every Friday and you have a great time if you don't think we're worth the dollar you go to youtube.com/gameovergreggy and each and every topic is broken out day by day as a video Until the whole show posts on Friday is one big video but then you should probably go to B camp and get the MP3 over there the new one yeah yeah",
            "start": 1.1
        },
        {
            "text": "and every topic is broken out day by day as a video Until the whole show posts on Friday is one big video but then you should probably go to Bandcamp and get the MP3 over there, the new one, yeah, yeah, that's how it works. Uh, you can also go to districtlines.com gameovergreggy t-shirt, we got a lot of those, got a ton of them, we got a few more coming, new ones, yeah, when do you think they'll be up? Uh, by the time this post probably, by the time this post I would imagine. How you get to go to that District lines.com, I know if I knew when they were, I would, I would tease them right now. Oh, we're probably gonna have the Team Fat U up shortly, so if you a member of Team Fat or if you just want to be Fat again, as I always say is a lifestyle, it's a mindset, it's not about your actual size, it's about that. I'm done with this burrito, no wait, I'm going to finish it, I'm I'm I'm going to power this last half and eat, yes, it's not necessarily a weight thing, it's more not it's pretty much a weight thing though it",
            "start": 46.64
        },
        {
            "text": "done with this burrito no wait I'm going to finish it I'm I'm I'm going to power through this last half and eat yes it's not necessarily a weight thing it's more of a weight thing though it becomes a weight thing but the thing about Team Fat also is like it's not like other teams where you have to like try out and like try hard Team Fat we bring yeah we're accepting we bring everyone into Team Fat no I like the original idea for the Team Fat shirt though which is that we were only going to have it available in large and above only going to be 2X and above was the original idea I'm sorry 2X and above so you can prove it yeah but I'm a I'm I'm not only part of Team Fat I'm I'm one of the co-captains of Team Fat sure I'll give that and uh and I I wear a medium on a bad day I wear a large wait on Team Fat do we have goalies CU would you be the goalie I I would elect you the goalie sure I assume we have positions let's assume it's like a soccer",
            "start": 85.92
        },
        {
            "text": "wear a medium on a bad day I wear a large wait on Team Fat. Do we have goalies? CU, you would be the goalie. I, I would elect you the goalie. Sure, I assume we have positions. Let's assume it's like soccer, yeah, what, what, what am I, Nick, what are you, yeah, you be the guy with the the guy with the clipboard, that's everyone. What's going on? I'm just going to bring everyone from one fat place to another fat. That's fine. You can be the bus driver. That's fine. Works for me. Um, Colin, yes, you're doing the normal thing about to pour yourself some BBS as we call it here, yeah. I've been there's been a longstanding thing I've been meaning to do in this show and I keep forgetting and it's putting a silver bullet on ice now before you start this I saw I saw you try to sneak this in on me earlier I want to tell you right now you're you're already doing it wrong what did I do wrong you're going to are you going to pour it into this cup yeah no what do I need it needs to be the biggest cup you can find so when it",
            "start": 122.96
        },
        {
            "text": "right now you're you're already doing it wrong what did I do wrong you're going to are you going to pour it into this cup yeah no what do I need it needs to be the biggest cup you can find so when it froths over you can just put ice it needs to be that cup here let's do this okay but I gave you the little glass too yeah okay well I'm going to get another glass I'll chug the water I'll chug the water chug the water I'll chug the water too oh Jesus Oh My this is gonna be a mess I'm just mad that I have to listen to Greg swallow for **** next oh it's like this is like my seventh layer of you're just screaming trying to get out of the room keep it away from me your coties I'm not so now do I need little ice cubes or big ice cubes well I would just put I would I would do little ones cuz you you have to get the ones that like oh you got both you have to uh you have to make sure they melt a little bit so they just kind of float to the top yeah you you want this sounds like a production",
            "start": 161.44
        },
        {
            "text": "you have to get the ones that like oh you got both you have to uh you have to make sure they melt a little bit so they just kind of float to the top yeah you you want this sounds like a production I'll do it let me do it you talk you're the moderator of this panel hey everybody The GameOverGreggy Show about to do this have you tuned out yet a long time ago Nick went to some what was that Bachelorette part a bachelor party and you were all dehydrated and somebody put their Coors Light On Ice yeah no what happened was we were yeah we were dehydrated we wanted one more alcoholic beverage uh for the day but we were too tired to actually go get anything sure so someone had Coors Light cans okay that we were able to acquire and they were warm now pour the way you want it poured oh no you just got you got a cannonball it right there Cannonball don't even bother I me this score is light don't even bother with it well that's the cool thing about the ice is with it the ice you just kind of it just",
            "start": 198.36
        },
        {
            "text": "got a Cannonball it right there Cannonball don't even bother I me this score is light don't even bother with it well that's the cool thing about the ice is with it the ice you just kind of it just kind of go that's the roughest beer Bo I've ever seen in my life fast and right to the bottom what you what are you trying to make a big deal what are you trying to prove here what you right there see boom now what I like about it is you get a little froth yeah I see it yeah we're CH wait I don't know what you want me to do make it cold make it cold just get a little make it cold it's already cold a Silver Bullet commercials people you're not see the thing is you're going to take a sip it's going to taste like you're going to be fine with it wait few minutes then take another sip that's when it's going to hit you he Winks at me when you yeah I like the wink cheers again it does taste like Coors light it's Coors Light fantastic that's great you're enjoying it aren't you well there's not I mean",
            "start": 232.96
        },
        {
            "text": "going to hit you he winks at me when you yeah I like the wink cheers again it does taste like Korbel light it's Cor Light fantastic that's great you're enjoying it aren't you well there's not I mean it's a more watered down Korbel light it tastes even less like Korbel light it's like more filtered than it already is it's the Cadillac of beers oh wow bold the Cadillac of beers it's the E.T. of beers by the way I was just thinking about this real quick there's an A logo an Oakland Athletics logo live in San Francisco which is weird you think we'd have a giant one but I like how token it is like this is such crap like it's just an A logo over a baseball yeah it could be any and then an A and then just a green bar so you know that they're just like they're manufacturing these for the Rockies and the Blue Jays and all this there's nothing unique about this also did your corner store did they go over to Oakland to get those cuz they're cheaper there like probably that's probably exactly what happened I mean",
            "start": 270.6
        },
        {
            "text": "and all this there's nothing unique about this also did your corner store did they go over to Oakland to get those cuz they're cheaper there like probably that's probably exactly what happened I mean our Corner Store who knows where they get on they're good the booze is cheap that's all I and they got the big the big bottle Coke brought back they little tiny ones for a while well again they probably it literally is just coming down at tasting like nothing that's it's just negating all the points why would you drink this against beer it's like water with alcohol take I want to Coors Light with ice is the offense against beer but not just Coors Light itself no I understand that no I went back to Missouri this weekend for a Wet Dog a lot of we drank a lot no we had a lot of there was some Bush in there oh drank some Bush drank some Natty Light natural light I haven't had Natural Ice since I was like 16 years here's the thing about it is like it it didn't occur to me",
            "start": 317.44
        },
        {
            "text": "in there oh drank some Busch drank some Natty Light, I haven't had Natural Light since a Natural Ice since I was like 16 years old. Here's the thing about it is like it it didn't occur to me until we were coming home and I was thinking a bit about it I hadn't taken a beer out of like an ice cooler and so long and has like that rim of ice in the you know the can it was so weird to do that after not having done it for so so long you know what I mean. And then but then yeah we were out there shotgunning some beers in the parking lot of the wedding at The Missouri Antler, how was The Wedding by the way it was awesome fantastic I killed it with the best man speech everybody loved it did you yeah last past man speech I gave wasn't there was a few right you didn't crush it blew them out of the water so yours was yours was the best my God you kidding me they had you should have selected the best man I was selected to go last in the speeches because they already knew I'd",
            "start": 359.96
        },
        {
            "text": "Blew them out of the water, so yours was yours was the best, my God, you kidding me? They had you should have selected the best man. I was selected to go last in the speeches because they already knew I'd probably be bringing the thunder, and when he handed me the mic, first off, the DJ goes into the mic, he's like, \"There's...I'll run give you the scenario here of what's happening right yeah there were three best men at this wedding. So then for the speeches, there were two bridesmaids between us, so boy girl boy girl, and so tell wait stop right there and just talk us about the two bridesmaids that were in between you don't stop, continue. I'm sorry, thank you. Um, and so we're coming into this, I had already made claims to my groom, My Le, that I'm like, \"Oh man, these your other two best men are...like really? I speak for a living; you think they're going to be\" and he's like, \"No, I know they blah blah BL blah,\" and so I asked them in the hotel room how long their speeches were, and one guy said it was one God, it's",
            "start": 400.32
        },
        {
            "text": "like really I speak for a living you think they're going to be and he's like no I know they blah blah BL blah and so I asked them in the hotel room how long their speeches were and like one God it's like 2 minutes the other guys I know there's three of us it's short and sweet real sweet and I'm like all right great mine's like five like cuz it's just in my head again I don't rehearse things but Greg Miller 5 minutes could be 5 minutes could be 35 minutes you don't know you know many and up at noon Nick I got this joke I'm just going to rant I'm like oh God that's all it goes it is it's over no it's not over it's going to keep going then you do the think you're like this it's just here's God damn it you know that's what I'm talking about and then you look at me and I'm like oh we're over okay clapping but no this one was going to be a real five I knew what I was doing but yeah I got I beforehand I had my whole speech revolved around a lab coat and so I brought a lab coat to give to the",
            "start": 441.32
        },
        {
            "text": "clapping but no this one was going to be a real five I knew what I was doing but yeah I got I beforehand I had my whole speech revolved around a lab coat and so I brought a lab coat to give to the bride at the end of my speech so beforehand I'd gone up what is she a chemist no no it's a long story about my my my groom My Le and I gave it to the DJ before I went up there of course and said hey I'm going to use this y y y so when he got to me he does a little introduction for everybody he's like all right next is Greg Miller and I have a feeling this guy's he's got a crazy bag of tricks and everyone laughed cuz like most people there know me or whatever and I'm like I don't even know what you're talking about and I took the mic and try to go what's up everybody and like boom like silence a pin could drop in that room and you'd hear it and everybody was on me for the entire five minutes I I had him laughing had him crying it awesome nailed it and then what happened with the lab coat",
            "start": 476.92
        },
        {
            "text": "Pin could drop in that room and you'd hear it, and everybody was on me for the entire five minutes I had him laughing; had him crying. It was awesome, nailed it. And then what happened with the laugh coat? I gave it to the bride, and it was a touching moment for everyone. I don't want you to explain why; just let it go - that's a personal story. One day, you know maybe the groom will be on the podcast, and we can tell it in his own words. Who is the groom? Kyle Hayes, all right. So Kyle Hayes, I met him. Yeah, he was here. You met his bride-to-be or his now wife; I met him. I want you to show Kyle this video. I think it's really important that he sees it because... yeah, there it is. Can I stop now? No, yeah, stop mixing it. It's not doing anything; it makes me feel good. Now I want you to show Kyle Hayes' video real quick because I really feel like this was an indecisive move - having three best men, now two best men; still not a decisive move. You've got to have one best man, but three best...",
            "start": 513.88
        },
        {
            "text": "show Kyle Hayes's video real quick because I really feel like this was an indecisive move to have three best men now two best men still not a decisive move you got to have one best man but three best men here's my thing no I'm I'm sorry it's not acceptable because now it's putting now it's putting you guys all in an awkward position when you get married it wasn't at all no it wasn't at all cuz here's the thing is that I thought what I I was touching how's going to be your best man right well I've been married before and Kyle Hayes was my best man oh okay yeah so he how you get around this yeah exactly just keep getting married rather than get married and have three best men I'll get married three times and have individual best men but I thought it was a good way he did it because it was a way to honor all of us because he said it one at a point in time it wasn't like we were three friends it was his brother who obviously grew up with him his friend from high school who grew up with him and",
            "start": 549.36
        },
        {
            "text": "Honor all of us because he said it one at a point in time it wasn't like we were three friends it was his brother who obviously grew up with him, his friend from high school who grew up with him, and then me, who grew up with him at college, and then into adulthood. That's nice; that was his thing of doing it right. Still, you got to pick; you got to pick. I mean, it's going to be... It's I, I love, I love you; you'll be in my wedding party. Yeah, I know it; my best man is already in my head: Ramon, me, and my brother will be my best men. Here's the thing about weddings: that's a bunch of nonsense. All right, like, and I knew that before this wedding and before I was asked, I never thought I'd be somebody's best man because all my real close friends have brothers, pretty much you know what I mean? So it's like, well, there you go; that's the end of it for me. So true story though: the last wedding I was at where I was best man, the maid of Honor was not one of the hosts.",
            "start": 586.56
        },
        {
            "text": "pretty much you know what I mean so it's like well there you go that's the end of it for me so true story though the last wedding I was at, where I was best man, the uh maid of Honor was not one of the sisters and the reason why was because she had sort of asked her sister out of you know nepotism and saying yeah you're my eldest sister and we're closest I guess in the family will you be my Maid of Honor and the sister said no and it wasn't a no as in I'm slandering you, I don't I don't want to support your marriage she said your best friend is this other person, I appreciate that we have a great bond, I love you, you're my sister forever but this is your wedding, who do you really want and she's like well I kind of want my other friend, friend. She's like that's good sister done, I like that it was awesome I was my brother's best man and I was 17 drunk yeah gave that speech did you destroy it oh it was awesome it's on video somewhere I should find it and put we can put it up as a video",
            "start": 624.6
        },
        {
            "text": "awesome I was my brother's best man and I was 17 drunk yeah gave that speech did you destroy it oh it was awesome it's on video somewhere I should find it and put we can put it up as a video I crushed my brother's best man speech oh my God I that sounds like a good time but I I I didn't the last one I gave was it the last wedding I went to I was actually best man and I gave a really heartfelt speech that had I gone first would have been amazing but the maid of honor we had this back and forth we were planning we were planning this thing where we were going to talk trash to each other and then I sort of forgot but she did not so when she came up to bat she had like five pages of just blast she blasted me in front of the entire room for like a good 10 minutes like because we had this back and forth I was like oh no I'm responsible for them getting together and she was like no I'm responsible for which clearly she was but I was like this is fun we should do this and then when it",
            "start": 663.04
        },
        {
            "text": "back and forth I was like oh no I'm responsible for them getting together and she was like no I'm responsible for which clearly she was but I was like this is fun we should do this and then when it got to me everyone was like oh Nick's going to light her up and I didn't everyone's like oh it was a good speech but she won she won straight up people came up to me they were like you you tried real hard you tried real harded tried it was nasty I'm GNA I'm going to leave you with this thought real quick because I thought this was a kind of a clever move we're talking about the wedding parties and the configuration of the parties and the best men and the bridesmaids of honor and stuff I was really really close it's getting so bad now yeah it's good you're interrupting me that's how the show goes no I never interrupt anyone on the show I bet you bet you never noticed that I know I noticed because people like hey Colin never literally in comments for the first 10",
            "start": 706.44
        },
        {
            "text": "me that's how the show goes no I never interrupt anyone on the show I bet you bet you never noticed that I know I noticed because people like hey Colin never literally in comments for the first 10 episodes Scarpino stop interrupting Colin he never interrupts anyone uh I was just going to say that I was friends with we don't talk much anymore which makes me really sad but I was I was really good friends with this girl in college just hang out all the time was totally platonic and uh she was just a good friend of mine we used to talk about um we like used to take we took a bunch of freshman class together just became really close and we just hang out all the time and uh we always talked about how it would be cool if I got married to my girlfriend at the time that we she would actually be in my wedding party and then she would wear a dress that was like matching somewhat the Gucci suits and then my girlfriend of the time would have a guy like in her party I've never seen anything like that",
            "start": 742.84
        },
        {
            "text": "in my wedding party and then she would wear a dress that was like matching somewhat the G.U. suits and then my girlfriend at the time would have a guy like in her party I've never seen anything like that where there's like some crossover in gender I'd like to do something like that I feel like it needs to be more inclusive, it's too rigid just men or just women you know in a traditional straight marriage um you know it differs obviously you know if you're LGBTQ+ it could be all men or all women obviously but uh you know so I wanted to throw that out there cuz I think it's a good idea and even though I'll probably never do it cuz I'm really not close to any girls like that anymore someone out there should take that idea I'm definitely planning on having one possibly two girls in that party where's Nick how deep is Nick in the rotation so here's the thing like this you were saying earlier about there's a lot of weird stuff",
            "start": 776.04
        },
        {
            "text": "two girls that are definitely going to be in that party I where's Nick how Nick how deep is Nick in the rotation so here's the thing like this you were saying earlier about there's a lot of a weird thing where there's the schools and then there's the after school what I'm best man straight up oh well see that's the thing that makes it really hard because Nick is the best best man ever just let me throw the bachelor party I don't care if I'm I don't even have to go to the wedding that's thing I want you to throw the bachelor party spoilers too remember last week on the show we were talking about being a best man or whatever Nick's the best he should be hired there should be a movie about it Kevin Hart is making that movie it's coming out in 2015 I know some people tweet I'm so disappointed that's a good idea Kevin Hart My too he's really funny but the the best man kind of things are trick you know trickling down a little bit because I was my brother's best man and that's probably going",
            "start": 818.2
        },
        {
            "text": "that's a good idea Kevin Hart My too he's really funny but the best man kind of things are trickling down a little bit because I was my brother's best man and that's probably going to be it I would assume uh I was in my friend Doug's wedding party was in Nate's wedding party uh my assumption is I'll be in Greg's wedding party when he gets married if he gets married again I'll be in my friend Mike's wedding party and Ramon's wedding party Ramon has a brother all these guys have brothers so it's just it's kind of a precarious situation because my wedding party would be uh Nick would officiate the wedding first of all Tim would be the ring bearer yes and then my best man would be my brother and then I'd have Greg, Ramone, Mike, and Nate would probably be my groomsmen and uh wait is he really going to officiate your wedding yeah I won we we don't want a religious wedding well you're not going to get it if you get can we live stream the entire thing including the reception",
            "start": 852.56
        },
        {
            "text": "he really going to officiate your wedding yeah I won we we don't want on a religious wedding well you're not going to get it if you get can we live stream the entire thing including the reception I will literally start off by singing a Queen song A cappella the entire song I don't think I ever told you guys this is what we want to do Charl doesn't like to be the center of attention at all neither do I think weddings are awkward personally like I I like going to them but they're awkward like if that was me I wouldn't want that so like what I want is Charl and I going to do is we're just going to take $10,000 just go to Montauk on Long Island which is like a really like the eastern most town on Long Island beautiful place you have to drive all the way out there it's in the middle of nowhere rent a huge beach house and just say everyone come for like a weekend and just 40 or 50 people just everyone just get trash you can stay if you want if not go off you can come for",
            "start": 894.68
        },
        {
            "text": "rent a huge beach house and just say everyone come for like a weekend and just 40 or 50 people just everyone just get **** trash you can stay if you want if not go **** off you can come for a day you can come for all three days I'm coming for all three days and I just I just decided and the Queen's on when she's coming down the aisle I'm G to ask everyone everyone please stand she's going to come down to stand Greg will be passed out on the ground with like a chicken wing hang out of his mouth like someone roll him over before he chokes to death um and then I will sing the theme song from Highlander it'll be amazing she comes Acappella no instrumentation needed because I have the voice of a cherub be beautiful no it's going to be great I'm looking forward it the sad thing is we've been going for 17 minutes we still haven't gotten in our first GameOverGreggy show is all about conversations with friends five best friends yes four best friends I didn't actually have anyone I didn't",
            "start": 929.92
        },
        {
            "text": "going for 17 minutes we still haven't gotten in our first game over GameOverGreggy show is all about conversations with friends five best friends yes four best friends I didn't actually have anyone I didn't have best man anything it's just me and my wife was oh you went to the courthouse well cuz how are you going to be your own best man that doesn't make sense good point if anyone was going to be their own best man that would be you well my brother my brother was basically def facto my best man but I should bridal party inen we probably are going down that road all I want is is I just I want just a blowout drag down knockout **** party that's it yeah but I mean we're going to have that but that's the thing the best man's duties is just to throw the bash to party beyond that he's done you got to give a speech Beyond sorry but uh you said beyond you don't have to say Beyond but you didn't really say it you kind of muttered it out through a like Coors Light Haze do you enjoy this is all no",
            "start": 967.88
        },
        {
            "text": "to give a speech Beyond sorry but uh you said beyond you don't have to say Beyond but you didn't really say it you kind of muttered it out through a like Coors Light Haze do you enjoy this is all no it's terrible thank you okay it's terrible it looks terrible by the way Greg I you can't let good beer go to waste we want to do your to we should just do my topic first because we're already cut in then yours can can go go well do we want to just do what we just did as the fifth topic that can just be in its own top we just did a topic without trying but we went for 15 minutes do we want all them to be unbalanced we can talk we talked about how terrible this beer is Tim I leave it up to you you're the expert this is a good topic I like this this is definitely its own topic okay so that's done so we're going to have five videos oh yeah do you like extra videos a lot of people seem to be happy we were posting more stuff on Saturday I was asking them not you five minutes I think we",
            "start": 1007.52
        },
        {
            "text": "Done, so we're going to have five videos. Oh yeah, do you like extra videos a lot of people seem to be happy we were posting more stuff on Saturday. I was asking them not you five minutes, I think we should post fewer videos because of scarcity principle then they'll really look forward so we go from four topics a week to one and a half, four topics a year. How many times have you been best man? That's it once. Oh this is the first time yeah probably my my one and only. I bet cuz again all this family stuff all these families screwing me over Greg if I get married again you can be my best man thank you cool I like that I'm not doing any of this co-best man crap okay it was crap it was sweet I like has to make a decision if he gets married again and 50% chance he will sadly. I'm sorry I'm but there seriously there's a 50% chance you might get married again, it's true uh he's got to make a decisive decision and I want it to be so decisive that it's none of the people that",
            "start": 1044.28
        },
        {
            "text": "I'm sorry, but there seriously there's a 50% chance you might get married again; it's true. Uh, he's got to make a decisive decision, and I want it to be so decisive that it's none of the people that were already... I agree with that 100%. Too, I feel like you do have to decide, and that sucks because, like for me, I have a lot of really close friends, and I feel like I'm going to have to... I feel like I already decided. I think I just said it such a long time ago that my friend Caran is... I'm like, sorry, everyone else that likes wants me as the best man is probably going to have me as the best man; Caran's my best man, but I still love you all. It doesn't matter how good you treat him at the bachelor parties half the time anyway, and the bachelor parties can get rowdy and they can get runchy nasty; they can get real nasty, think get a little nasty, real nasty, yeah, yeah, in a good way, yeah, in a damp real good way, yeah. They get all dank and damp, jeez. The Dank and damp, all right. My topic... I hate.",
            "start": 1085.08
        },
        {
            "text": "get real nasty think get a little nasty real nasty yeah yeah in a good way yeah in a damp real good way yeah they get all dank and damp jeez the Dank and damp all right my topic I hate the World Cup and like I there's so many there are so many caveats to this so let's just get have you always hated this or is it just this world stick with me cuz we got to just boil this down to the minute details Ence I don't the the sport of soccer yes I said soccer when I tweet about soccer don't correct me to football I don't care I don't enjoy this sport I don't participate or watch it now here oh don't even get in the way right now cuz that's like we're not even to the we're on the the outer crust of my argument trying to get to the core went for like 45 minutes in a meeting today the thing about soccer right is that I am an American and I call it soccer I understand the rest of the world does not I respect that I respect that Europe spells colour with a u i don't correct them",
            "start": 1121.56
        },
        {
            "text": "the thing about soccer right is that I am an American and I call it soccer I understand the rest of the world does not I respect that I respect that Europe spells color with a u I don't correct them every **** time so back the **** up on the soccer business so that's on the first part of this whenever I tweet about I we I tweeted the video when the World Cup started right of like what's the best sport or one of our previous topics first off I guess I jokingly said in there soccer is the worst sport ever or something again I have nothing against the sport of soccer I don't enjoy watching it or playing it that's fine for me here's what's starting to get under me about this World Cup is no one will shut the **** up about it here's the next subtopic on this thing I understand that it's happening and it's a big deal for the whole world that's fine if you have tweeted about soccer before and you are a soccer fan more **** power to you tweet your goddamn balls off Darren Hardy go",
            "start": 1165.44
        },
        {
            "text": "Happening and it's a big deal for the whole world that's fine if you have tweeted about soccer before and you are a soccer fan more power to you tweet your goddamn balls off Darren Hardy go nuts CRA Baron CRA Baron Ty root you guys talk about soccer a lot you own jerseys cool I'm glad I know what I'm signed up for on that front this would be akin to me yelling at Colin for tweeting about the Jets someone yelling at me about Mizzou you understand that we're more than just one thing so if you're a soccer fan that's great what's driving me crazy about the World Cup is all these people who have never ever ever spoken about soccer before suddenly tweeting their goddamn face off about soccer shut up I know you don't there's people in my Twitter feed like oh that was a dynamite pass you've never talked about soccer I know you don't care about sports shut the **** up and so just back off about like you don't need to be talking about soccer this much I don't",
            "start": 1206.48
        },
        {
            "text": "dynamite pass you've never talked about soccer I know you don't care about sports shut the up and so just back up about like you don't need to be talking about soccer this much I don't understand why this the global Fascination you're suddenly like well I'll tweet about it now and act like I'm in like you care about it and this all goes back to the whole like the thing we always have to talk about with gamer girls right you're a fake gamer you're a fake I'm doing the same thing this is another reason I'm so mad about the world cup is the fact that they are making me be the people I hate during the Super Bowl we are nerds we get that we have nerd friends but Colin and I enjoy football so on you know Super Bowl Sunday we tweet about the Super Bowl people are oh sports ball for some reason whenever sport you the sports are on and people care the people who don't care about sports and our video game nerds like us suddenly have to regress and suddenly forget",
            "start": 1255.88
        },
        {
            "text": "ball for some reason whenever sport you the **** sports are on and people care the people who don't care about sports and our video game nerds like us suddenly have to regress and suddenly forget what a touchdown is or how to get into a stadium they're like wo a football how do they get in the seats I don't know I've never been I don't like sports is the Game Over Greggy Show over yet shut the **** up but see by then doing this by then bringing out this hate of the World Cup in me and in them they're making me feel like it but this is the problem is that I'm not mad about you Tweeting about soccer sports fans I get it I totally I'm fine with that I want you to enjoy your shows and go watch it I'm mad at all these Fairweather fans flooding my feed and then making it so I can't tell them to shut the **** up because if I do that if I say that I then become a hypocrite for the Super Bowl Sunday tweets I hate but mind you this World Cup goes on July 13th shoot me in the **** face Tim I don't want",
            "start": 1297.12
        },
        {
            "text": "up because if I do that, if I say that, I then become a hypocrite for the Super Bowl Sunday tweets. I hate but mind you, this World Cup goes on July 13th; shoot me in the face, Tim. I don't want to see this anymore, and so it keeps going this way. And here's the other rub to it, the other layer kick to this world: are we in the mantle now? We're past the man; we're the bubbling hot core over here. You know, I saw today a Variety tweet that the World Cup game between the US and Germany was the highest ratings ESPN had ever had for a World Cup game. I'm sorry, thank you much, thank you. That's coming up right, coming up, thank you, thank you. I'm sorry, everybody. I've never been in this: what's a soccer ball? Football? I don't know. Highest ratings ever for a ESPN World Cup match; **** you, **** you. That proves you're all fair-weather fans too. Well, America's in it now; we got to care. Well, Jimmy Jiler, what's happening people originally tweeting about how much they hate the clock then suddenly trying to",
            "start": 1341.4
        },
        {
            "text": "Proves you're all fair-weather fans too well, America's in it now, we got to care. Well, Jimmy Jillian, what's happening people? Originally tweeting about how much they hate the clock then suddenly trying to explain it to me that it matters and then I retweet Marty who's like all these fake people are tweeting about soccer all of a sudden and Marty puts at the top of his Twitter feed, \"You know, like, oh hey anybody have any strong opinions about soccer?\" To Mo you and I retweet it to mock you, and then real soccer fans feel that they need to tweet me and correct me that it's football and actually start explaining why the game offends them. I don't care; I am mocking you. Everyone shut up about the World Cup and leave me out of it except real people who care if you put in the work, and you are a soccer fan, go nuts. Everybody else, I hope USA loses soon so you'll all shut up. It's called football. How long were you waiting? There's a lot there; there's a lot to unpack. Yeah, know there's a lot.",
            "start": 1389.04
        },
        {
            "text": "fan goes nuts everybody else I **** hope USA loses so soon so you'll all shut up it's called football how long were you waiting there's a lot there's a lot to unpack there yeah know there's a lot you got you got a lot I just I hate that they make me into the the Super Bowl guy you know what I mean I don't want to be that guy on Super Bowl Sunday tweeting about it and that's why I haven't tweeted anything about it no negative feedback about the World Cup in my Twitter feed because 140 characters is not enough to express why I'm angry I'm not foring exactly I'm not mad I hope the comments are with me on I'm not mad at you liking soccer more power to well I think the soccer fans will understand what you're saying the real soccer fans the one thing you said that resonated with me the most and this is one of the things that bothers me a lot because I tweet a lot about hockey and football real football not soccer real American football uh is that feel like I",
            "start": 1434.4
        },
        {
            "text": "and this is one of the things that bothers me a lot because I tweet a lot about hockey and football, real football not soccer, as an American. Real football uh is that feel like I should lift something? Yeah let's go lift and we'll throw a touchdown real quick yeah it's going to be great pig skin uh up uh is uh that I hate I too hate when people are like oh the sports ball and all this kind of stuff it's like why are you proud of being ignorant of sports like that doesn't make any sense to me like you're being ignorant like when they're like stick to gaming or whatever it's like no I'm a modern-day Renaissance Man bro and I'm gonna tweet about whatever the hell I want to tweet about so sometimes I'm going to Tweet about history and sometimes I'm going to Tweet about Resogun and sometimes I tweet about Joe Namath, Greg and sometimes I'm going to Tweet about French Revolution and sometimes I'm going to Tweet about chemistry",
            "start": 1480.64
        },
        {
            "text": "sometimes I'm going to tweet about Resogun and sometimes I tweet about Joe Namath, Greg, and sometimes I'm going to tweet about French Revolution and sometimes I'm going to tweet about chemistry and sometimes I'm a tweet about planet Jupiter yeah head but see this what I'm talking about is that for you all that makes sense I've set the idea that if you follow me on Twitter Ghostbusters and comics and games and beer and pizza and wings and Missouri and you get all that right and so this is something I was thinking about when I was getting all amped up about it you this year have been talking more about soccer than ever however you're doing it in a way as your friend that I'm watching your feed I see the progression right you started off the first we I ever saw about it recently was you not understanding the clock but that this could be a sport that would grow on you and then your tweet during the American game I think was that you the picture with you in a meatball sub from Tony's Ristorante",
            "start": 1519.84
        },
        {
            "text": "the clock but that this could be a sport that would grow on you and then your tweet during the American game I think was that you the picture with you in a meatball sub from Tony's and it's like I get all that I see you coming to the sport and I know you're a sports guy it is the people that I know have don't give two shits about sports that are suddenly tweeting the flag logos off so I feel like I should address this topic a little bit and here's why I am that guy I'm the you're talking you doing this so the other day I went out to get a haircut this very same haircut it looked good one thank you I like the sides um yeah it's a little short a little where did you go you go you go twos you go I don't even know she does it with scissors so she can justify the exorbitant uh cost of the haircut fair enough she's like you don't want clippers you want scissors and I'm like it looks exactly the same I'm not going to get into that so on my way I knew that the USA was playing",
            "start": 1558.24
        },
        {
            "text": "cost of the haircut fair enough she's like you don't want Clippers you want scissors and I'm like it looks exactly the same I'm not going to get into that so on my way I knew that the USA was playing Portugal, that was yeah they played on Sunday it was on Sunday right I knew the USA was playing Portugal was Portugal I just didn't want to get it wrong I knew this game was happening because I saw it all over Twitter and I was like ah this I mean football great it's the biggest sport in the world I wish I was into it I'm not um on the way from my house to get a coffee first then my haircut I got into it because I heard the rage like the excitement from the bar when we scored when we tied the game and I was like oh wow that's really interesting I looked in and then all of a sudden got caught up in the World Cup guys and I was trying to get people in the salon to like tell me what was going on and then I heard everyone like yell scream when I guess they tied it again cuz I went 2 to 1 it was 2 to 1 and then it",
            "start": 1601.44
        },
        {
            "text": "and I was trying to get people in the salon to like tell me what the score was and then I heard everyone like yell scream when I guess they tied it again cuz I went 2 to 1, it was 2 to 1 and then it was like oh we're winning and then it was we lost like 10 seconds which was and everyone was like oh it's horrible then I went to bed and I didn't think about it again until Greg brought it up today or until I saw the 40 people watching World Cup in our office today while they were pretending to do work see and those people I get cuz it was like Darren and Pablo and people I know are into soccer, Shawn is totally legit in soccer he also likes hiking he does a lot loves hiking can't get enough of it and that all makes sense I get that it's just the people who are popping up and also I wouldn't like you're being honest about it when I was working in the Tribune in Colombia and that was last time I think there was the World Cup, you were thinking in 2006 is that right that was two times ago yeah that's",
            "start": 1644.12
        },
        {
            "text": "being honest about it when I was working at The Tribune in Colombia and that was last time I think there was a World Cup you were thinking of in 2006 is that right that was two times ago yeah that's when you were probably at the Tribune that makes sense actually good job with the math uh I went to cover some World Cup party people were throwing and watching in the middle of the day and getting bombed and I'm interviewing these kids who are like 23 and they're like yeah we don't care if there are the people hosting it knew something and they were cheering but then they basically just broke up into whatever cheer for whoever and they were there to get drunk and they admitted that and it was like more power to you if you're at a party just get drunk great don't go on Twitter and act like you can recite the entire roster of Portugal or America all right so here lies the issue right here lies the issue 2006 was the first World Cup that I actually paid",
            "start": 1681.52
        },
        {
            "text": "like you can recite the entire roster of Portugal, you know what I mean or American all right so here in lies the issue right here in lies the issue 2006 was the first World Cup that I actually paid attention to I used to go to the bar I was at Northeastern the time I used to go to the bar with my friends and watch the game we we did okay I don't we didn't get out of the group I don't think but we like tied Italy or something that was like our big victory that was and I was like I've always been interested in it as an like in a national way like we're not good at this game we're getting better I'm desperate for us to do well in it because I know it's going to infuriate everyone in the world that is literally like why I started watching it now I remember the 94 Olympics when it was here and remember the little dog guy it was like a big deal that was like I I still think um it was like a little dog, the dog guy it was like a little person I'm sure I know what I'm talking about it was",
            "start": 1711.52
        },
        {
            "text": "\"Remember the little dog guy, it was like a big deal that was like I I still think um it was like a little dog's - the dog guy, it was like a little people I'm sure I know what I'm talking about it was like a little dog cartoon that was like the mascot for the '94 World Cup when it was in the United States and that was like the first time you know the if you if it's in your country you will automatically have a bid and the US did okay there or whatever and then the US has just made it every you know four years since then I think that Twitter is part of the reason why this seems bigger than ever, and it is bigger than ever because people are obviously watching it but I think soccer might be turning the corner now there's a few there's a few things that I I think I am in complete agreement with you on this the people tweeting at us and saying like it's football it's football like we said before in the United States it will never be football I'm going to tell you why because the biggest sport\"",
            "start": 1749.36
        },
        {
            "text": "on this the people tweeting at us and saying like it's football it's football like we said before in the United States it will never be football I'm going to tell you why because the biggest sport in the United States is American football and no one is ever going to stop calling that football and we can't have two of them and I'm going to tell you something else Nick that I didn't realize the original name for association football was actually soccer and guess where it was invented in Europe so people should go look at their history and stop telling us that we call it soccer and we're a bunch of idiots when actually the English were calling it soccer first and we adopted that name that's number one I don't know why I believe you you don't have to tell me that number two I looked it up I looked it up I was like there's no way like there's got to be more I like calling it socer because it reminds me of when I used to be in AYSO when I picked daisies out as a fullback cuz they put me back",
            "start": 1783.76
        },
        {
            "text": "it up I was like there's no way like there's got to be more I like calling it soccer because it reminds me of when I used to be in AYSO, when I picked daisies out as a fullback cuz they put me back there cuz American Youth Soccer Organization is AO, I used to sit there when I was like 12 we'd go get donuts first then I'd sit out there I literally at some point would like sit down on the field cuz I was like I don't want to run anymore and the ball's way over there so I'll get up this girl I used to be with she used to play soccer when she was a little kid and she just loved her quote unquote soccer legs she's like yeah it's cuz I got them soccer legs, soccer legs are the best we we can all agree whether you like soccer or not Greg which sounds like you hate it but see this is what I'm saying I don't hate the sport I don't enjoy it it's not I it's one of those things in in a very casual way if I wanted this is what I was talking about with the the pie chart of your time right if I",
            "start": 1819.28
        },
        {
            "text": "saying I don't hate the sport, I don't enjoy it; it's not I, it's one of those things in a very casual way. If I wanted this is what I was talking about with the pie chart of your time right. If I wanted to commit and actually sit down and learn the rules of soccer, I'm sure I could get into it, you know what I mean, especially what you're talking about - like I, I know what you're talking about, the cheering and like the rise and fall of that's different; like you don't make like that doesn't make you that guy, you're not the guy making the sports ball jokes, you're the guy walking down the street getting excited 'cause people are excited. People are excited, you get caught up in the World Cup guys, and it is something I look at it from a positive perspective right where it's another point of pride for America if we do well in this, and it really is the final frontier for us because we - if we get if we get great in soccer then we're across the board; there's nothing next that's it, we're already like amazingly",
            "start": 1856.2
        },
        {
            "text": "if we do well in this and it really is the Final Frontier for us because we if we get if we get great in soccer then we're across the board there's nothing next that's it we're already like amazingly dominant for a very long time we've lost that but we were we we had that you know as far as we're really good we're really good in virtually every every meaningful Sport and I don't mean I don't mean The Spar sports that are small or whatever saying I don't know if we play cricket probably not no but I mean like might be a us cricket team basketball Hockey baseball obviously American football we're getting there in soccer like all these big sports that actually transcend Globally like you know National League we're really good at them that's the thing for me that's why I think it's such an important that's why I'm happy that we're getting bigger as and by the way it is a one-to-one uh connection that you know the United States is doing well so everyone in the United States is getting into it it's it",
            "start": 1887.52
        },
        {
            "text": "why I'm happy that we're getting bigger as and by the way it is a one-to-one uh connection that you know the United States is doing well so everyone in the United States is getting into it it's it drives crazy traffic for every sport site it does I mean it's a cultural phenomenon so of course you're going to get that multiplier effect where everyone's tweeting about it so we're going to put more tweets out about it we heard it the other day too someone actually said in a meeting they were like should we do something for this and we're like oh let's let's back off that cuz we're video games but no we did it I know I was trying to be nice to everyone but yeah I know we did it what why would be nice to who a good point like I mean it's what you're talking about it's the proof of what you're Point how can we relate our world that traditionally doesn't do much with it to it fair enough so I mean that's what everyone is experiencing right now and it's somewhat capitalistic but it's also from",
            "start": 1928.84
        },
        {
            "text": "how can we relate our world that traditionally doesn't do much with it to it fair enough, so I mean that's what everyone is experiencing right now and it's somewhat capitalistic but it's also from my perspective it's again it's just one more thing I can say my country does well yeah which is cool having said that you know you guys know my thoughts on when people claim the well we're doing really well in the World Cup, when they say \"we did well today\" you said the Wii, I know and I don't I don't like that, I said the Wii, I don't even like it, I mean I I that's my one my only big beef with sports fans is they always say like well we did well today we played well today and all this stuff and I know that that's just a way of explaining that unifies all the fans all the \"we\" got into this but at the same time I do want people to remember that there are a certain amount of people on that field and we're not one of them, so you do have to take a step back and be like it is just a",
            "start": 1965.44
        },
        {
            "text": "but at the same time I do want people to remember that there are a certain amount of people on that field and we're not one of them and so you do have to take a step back and be like it is just a game enjoy it for what it is I get that and I think that's also something that everything you just said is some it has goes back to maybe what the core of this offense is to me you know what I mean is like when I say we about the Chicago Bears or about the Missouri Tigers I'm say I can site back to all these things that I've been a part of for that franchise or for you know for that team or this Brad Smith touchdown or this horrible time we lost or you know fifth down or whatever I there's something there you know what I mean like when you you're like oh yeah it's a point of Pride for you is America that we're doing something really good again it's like coming from Chicago when the white sox started winning and people be like man your socks are tearing up I'm like nope don't know anything",
            "start": 2009.48
        },
        {
            "text": "that we're doing something really good again it's like coming from Chicago when the White Sox started winning and people be like man your socks are tearing up I'm like nope don't know anything about them don't you know I mean like I go out of my way same thing when we talk about football in general right like Colin and Mike Mitchell are fans of respectively the Jets and the 49ers in a way I am not a fan of the Bears you know what I mean I never want I'm never going to fake what I am and I'm not when it comes to sports because that's the kind of thing that will eat you alive right like you guys monitor your trade the waivers and the wires and what's happening uh in the offseason yeah and I'm I usually come into that first Bears game like all right who's the team this year and I start learning from there you know what I mean I just don't have the time in that pie chart of time to keep up with it in the same way like missou football I watch every game try to at least depending on",
            "start": 2047.56
        },
        {
            "text": "learning from there, you know what I mean, I just don't have the time in that pie chart of time to keep up with it in the same way, like Missou football, I watch every game try to at least depending on travel but like basketball, like people talk to me about, oh man, Pre's doing great, I'm like, I don't, I I haven't caught a game in a few weeks even when I did it was a Patriots GL so that's I think another thing of like when somebody's coming at it honestly hey I'm watching the World Cup this is cool I'm learning who it is BL blah great when all of sudden oh man that that was a tight play, oh I can't believe he had it off what are you saying yeah I mean this is the the thing that I realize is that you know again I think that soccer fans have been a little you know we talking about the whole football to soccer correction whatever again the atmosphere of soccer is British and we were calling it its old name, we still call it that name so please stop because it's just like a nuance",
            "start": 2080.56
        },
        {
            "text": "the whole football to soccer correction whatever again the atmosphere of soccer is British U and we were calling it its old name we still call it that name so please stop because it's just like a not a name Americans made up but regardless um you know I've been trying to tweet honestly about it by saying like you know the clock doesn't make any sense in soccer I understand that the clock doesn't stop I understand what stoppage time is and all this kind of stuff people are explaining to me like I don't understand that it doesn't make sense I don't care like just look at the Portugal US game where there was all these injuries and and just flagrant **** time taken out of the game and they put 2 minutes on the clock at the end and then there was like much less time in the second half taken off and they put 5 minutes on the end of the clock which lost the **** game don't they arbitrarily just decide how much time they're it's supposed to be based on like injury time it's like",
            "start": 2119.08
        },
        {
            "text": "and they put 5 minutes on the end of the clock which lost the World Cup game don't they arbitrarily just decide how much time they're it's supposed to be based on like injury time it's like it's like this whole point timing thing right like suppos the guy has the ref has a clock have technology so he actually physically times it apparently but but the technology might let you stop the clock when the ball goes out of bounds for instance or someone's rising in pain on the ground for five minutes I want to stop the clock I mean that's just an idea I don't know like every other sport in the world nonetheless uh what I've been seems like every other sport figured out a way around this I'm done with this by the way n nonetheless what I what I've been trying to honestly tweet about is that I become to really honestly appreciate the sport as I've watched because I've been watching other games phenomenal sport it's amazing incredible athleticism it's an interesting game it's a very athletic",
            "start": 2153.96
        },
        {
            "text": "to really honestly appreciate the sport as I've watched because I've been watching other games phenomenal sport it's amazing incredible athleticism it's an interesting game it's a very athletic Sport and I what I've really come to appreciate is the drama of the sport it has drama very similar to the NFL it's a very similar kind of drama I've really learned to appreciate now soccer is never going to be this thing where I'm going to like pay have a team maybe I'll root a little bit and pay like it's like I root for the Brooklyn Nets and passing you know I don't pretend I'm a Brooklyn Nets fan I don't watch basketball usually during the year during the NBA during the NBA play I love watching basketball playoffs and and you can ask Greg for the few years I watch Like constantly watch basketball players because I just like the playoffs because every game is consequential and heavy but like like Greg was saying I have to give it to the people that really like and watch basketball that's",
            "start": 2190.48
        },
        {
            "text": "players because I just like the playoffs because every game is consequential and heavy but like like Greg was saying I have to give it to the people that really like and watch basketball that's their time and so I try to keep the tweets to a minimum and I'm doing the same thing with soccer so I tweet things like I'm really coming to appreciate the sport or man that loss was really unfortunate or meatball sub or look at this meatball sub and no wonder I'm I look like I'm pregnant you know like so I I can appreciate the authenticity because I don't often deal with that with my sports because football really does have a passionate fan base of people that tweet about it and so like that hockey less so if you're tweeting about hockey you really obviously do care about the sport a lot and people do have some meaningful things to tweet about so I'm trying to respect",
            "start": 2226.8
        },
        {
            "text": "people do have some meaningful things to tweet about so i'm tweeting about hockey i can understand i can understand what Greg's saying because i feel that for the people that i've been trying to respect actively the people that really are in the soccer like Greg was saying by not getting you know getting going over bounds with it uh i've been watching the last two games with Craig Baratoni and Tyler and and sin who are real they're big soccer fans and i like i actually said out loud the other day i was like it looks like this guy isn't this guy and and i like and i literally said like in the middle of my comment i'm like i really shouldn't be making a comment about this i don't like i don't i don't understand the game well enough to understand why he's not pressing and i'm looking at it like hockey and it's not an angular sport like that and you know like it's a spatial Sport and uh so i'm starting to learn how to appreciate now maybe next time around i understand the sport a little bit",
            "start": 2258.72
        },
        {
            "text": "hockey and it's not an angular sport like that and you know like it's a spatial Sport and uh so I'm starting to learn how to appreciate now maybe next time around I understand the sport a little bit better maybe I start to pay attention to Major League Soccer a little bit more give it get give it a little more time happen maybe it will maybe it won't it's like Lexi Lawless went down it's all been I know it's been all **** up uh so yeah I I agree with a lot of what Greg's saying I I do agree that the things that bother me most about the Twitter feed are not necessarily the people that are tweeting about football or soccer rather um because the people that do tweet about soccer I don't follow many people like um our friend James Stevenson and Insomniac he is a soccer fan 12% not on my list you know uh Jeff Rubenstein he is a soccer fan so like those are the only guys I'm really seeing tweet about it see this is one of those things I follow too many people exactly",
            "start": 2293.2
        },
        {
            "text": "my list you know uh Jeff Rubenstein he is a soccer fan so like those are the only guys I'm really seeing tweet about it see this is one of those things I follow too many people exactly and so you're following a bunch of and this is the whole thing now that it happened and I've lost respect for you if I see it again gone so if I start tweeting tomorrow about it first off i' just be excited you were tweeting because it's so R all the time I just respond to people's tweets follow me on Twitter _ but the two things the two things that Greg said that I think resonate the most is Americans are going to call football what you call football in Europe and South America, everyone else calls it soccer, that's what we're going to call it, we're going to call it that forever, so just let it go, number one, and and I know that's probably offensive to some of you, we have football here and that's going to be our sport, spell color with a \"u\" and yeah and we don't degrade football by having to preface it",
            "start": 2328.0
        },
        {
            "text": "and and I know that's probably offensive to some of you we have football here and that's going to be our sport, spell color with a \"U\" and yeah and we don't degrade football by having to preface it with American football but I know that's what they call it, hand egg, I don't understand because the ball isn't it doesn't even make any sense just call it foot. The other thing that bothers me is again what Greg was saying and it really does bother me is like open your mind up a little bit if someone's tweeting about something that you don't necessarily like about they're not tweeting in excess or whatever and and open your mind up like I hate when people say like I follow you for games or whatever it's like I don't owe you anything on Twitter I'm going to tweet about whatever I want and I hope that you enjoy the fact that I have a broad range of of of things that I want to say I certainly enjoy that when people that I follow tweet about different things I I like that it makes",
            "start": 2363.04
        },
        {
            "text": "I hope that you enjoy the fact that I have a broad range of things that I want to say. I certainly enjoy that when people I follow tweet about different things, I like that it makes it not monochrome, you know what I mean? Where it's like, \"Yeah, I don't want to just hear about games; I'm sick of it.\" Like I want to hear about other things, you know. And I like when people are kind of tweeting a little bit about politics, tweeting a little about history or science. You know, our friend Eric Monachello at Naughty Dog is always tweeting about space and science, and I really like that; I click on his links because it opens your mind up. So, like, stop with that because that's not only offensive that you think people owe you something on Twitter, but also offensive in the sense that we're people who have many interests and we try to tweet those things so that's what I took away from",
            "start": 2399.76
        },
        {
            "text": "think that people owe you something on Twitter but also offensive in the sense that like we're people who have many interests and we try to tweet those things so that's what I took away from your epic rant about the World Cup with that said we're going all the way, Greg - oh my God, Team USA! You one! Final Pin this. The thing that people have tweeted me a few times when they see I'll tweet the soccer thing and I apparently said I hate soccer or whatever in that sport thing uh they tweet this have you seen this image? They tweet of like American football coaches and then uh International World Cup coaches and all the World Cup coaches are in like nice suits and then the American coaches they've picked for American football are all giant fat slobs. The problem I have with this number one is that Rex Ryan's there he's the only NFL coach in that image and he's lost a ton of weight and the rest are collegiate coaches you don't know what **** talking about here's the other thing here's the",
            "start": 2435.88
        },
        {
            "text": "that Rex Ryan's there, he's the only NFL coach in that image and he's lost a ton of weight and the rest are collegiate coaches. You don't know what I'm talking about here. Here's the other thing: for all the ignorant people that are tweeting about these guys and nice suits - whatever you're not allowed to wear suits on the sideline of NFL games anymore, or they would. People might remember that there was a coach, it was Mike Nolan, I think his name was, of the Niners. He wanted to wear a suit like an old-school suit and a hat, and Reebok had to make the suit because they have a deal where the coaches have to wear their paraphernalia. Yeah, so like the reason that people in American NFL coaches don't dress in suits like they used to anymore is it's because they're not allowed; they have to wear their team colors and like the things that are branded with those names or whatever. So that's also shows a little bit of ignorance. Speaking of all this, though, soccer players are really",
            "start": 2471.8
        },
        {
            "text": "they have to wear their team colors and like the things that are branded those names or whatever so that's also shows a little bit of ignorance speaking of all this though soccer players are really pretty oh God pry raldo Ronaldo I was undressing with my eyes ridiculous on the molded from clay yeah they are super athletic I was reading something like the average soccer player runs like like 10 miles a game or something that like holy **** it really is an athletic sport now I'm going to say I was watching a documentary about the US men's team uh Jurgen Klinsmann's the the coach he played for West Germany and he was the coach for Germany for a while won a World Cup with West Germany in 1990 I think and he was saying I always see soccer players are babies right like they're always has their hands up whenever they get touched they're always like strategy it is but here's the thing apparently Klinsmann was people were doing it in practice they practiced at Stanford and Clint Dempsey was doing that",
            "start": 2505.0
        },
        {
            "text": "hands up whenever they get touched they're always like \"strategy\" it is but here's the thing apparently CINEMAN was people were doing it in practice they practiced at Stanford and Clint was doing that people were like doing it at practice and he like blew the whistle and he's like yo like everyone stop I don't want to see any of that and if you watch the American team they don't do that very often like there's a discipline to it I think I think that I mean that's one thing I would get against the sport is if I saw an American doing that he's done he's he's dead you would let him back in the country no You'd be done the Border it's not what this country is about it's not about faking an injury it's about giving your brain getting a concussion yeah suing everyone who had anything to do with it not being able to remember your daughter's name because you got hit too many times in football damn speak into a Mega Man soccer on the Super Nintendo I had that game yeah it's a good game it was a great",
            "start": 2546.28
        },
        {
            "text": "being able to remember your daughter's name because you got hit too many times in football damn speak into a Mega Man Soccer on the Super Nintendo I had that game yeah it's a good game it was a great game I like that put Gemini Man in the net Nick yeah what's your topic as I'm unlocking my phone my topic comes from Twitter remember everyone if you have a nice topic for are a fun topic or an interesting topic follow me on Twitter @Nick_Scarpino and uh tweet me your questions like nope I've been scrolling nope not this guy _ RJ says uh discussion of the day if your wife told you she did a pornographic film uh way before she met you would that affect your relationship so that's my question to you guys if you found out that your wife or significant other was in a risqué uh video that other people could find on the internet po she in the pornography she's in she's in the porno uh is it hardcore or is it like skinx for the sake of argument I would say it's probably it's it's hard it's not",
            "start": 2587.28
        },
        {
            "text": "could find on the internet po she in the pornography she's in she's in the porno uh is it hardcore or is it like skinx for the sake of argument I would say it's probably it's it's hard it's not like fetish or anything like that but it's it's enough to let everyone know what's going on yeah you know what I mean yeah yeah I hear you I feel like undoubtedly would affect the relationship that doesn't necessarily and it doesn't mean in a good way or a bad CU it could be a good married you're already married yeah I'm just saying for the argument yeah yeah I I think it it would affect it definitely like it's definitely a conversation to have and it's it's no matter what I don't think that's a good thing I don't think anyone's going to be like yeah I was hoping for this one you know I think I'd only be disappointed if I if I cuz you'd have to watch it right well that's the thing if you knew it existed would you watch it yeah I feel like I'd have to i' have to I'd be I'd obsessed about it I'd",
            "start": 2634.72
        },
        {
            "text": "be disappointed if I had to watch it, well that's the thing if you knew it existed would you watch it yeah I feel like I'd have to watch it I'd be obsessed about it I'd have to watch and that's the worst part though is like this whole people refer to it as with Colin in which case I would absolutely watch it are you already watched it I would have seen it I would have known about it I would have tweeted it then I would have tweeted boom bam calling my wife making that money but you it's one of those things where people always act like they don't want to know about the history of their partner but it's like you really do and it's like even if you don't there's something that you're just like you always ask these questions this is what I want to rewind to about it would it affect the relationship of course anything like this I think affects the relationship but like I I don't care what you are you clean right now are you not going to infect me with",
            "start": 2674.68
        },
        {
            "text": "to about it would it affect the relationship of course anything like this I think affects the relationship but like I I don't care what you are you clean right now are you not going to infect me with anything and you know Screw Up Our Lives sure just let me know one day please uh then I'm fine with it but like this is like that little that step outside of that realm right like I don't need to know everything you ever done with another guy or how many guys blah blah blah blah I don't care about that as long as everything's checking out now everything's flying fine great don't worry about it but then you get to this and it would more be I would this would be something I would have just wanted to be briefed on that come TR is the biggest part and it's crazy your you know your daughter your wife used to blah blah blah and be like what now what yeah exactly and if you had talked to her beforehand and we like hey did you ever get involved in a por*nographic video necessarily come up in a lot",
            "start": 2709.6
        },
        {
            "text": "used to blah blah blah and be like what now what yeah exactly and if you had talked to her beforehand and we like hey did you ever get involved in a pornographic video necessarily come up in a lot of conversations I know say it did like say no I feel like that that does come up maybe not that specifically but it's just like porno no not not that but it's just like have they ever taken photos of you have they exactly is there and if they're like no there is definitely nothing and then you later find out there is that's not good yeah I guess that's true I've never asked that question though but because I guess that's just I mean I guess this ask my wife that question when I go home to this is like that next step out of it all I don't know but like see like if if if it turned out that she had posed for cell phone photos or sent those out to somebody and then they popped up on the internet again in like one of those compilation videos that we none of us have ever seen they make compilations",
            "start": 2747.32
        },
        {
            "text": "for cell phone photos or sent those out to somebody and then they popped up on the internet again in like one of those compilation videos that we none of us have ever seen they make compilations videos on oh yeah not on YouTube Can't on YouTube YouTube doesn't put that stuff out there are other sites that post video content on the internet of just photos just tum I know what a compilation is I I watch compilations compilations like compilations of something oh but I'm I'm talking about I'm talking about like selfies and photos you send your girl yeah they'll do them they'll do them if it's like you know but they usually bucket them into some sort of like category that that would be such less I mean unless I'd asked that question that then I really those wouldn't even offend me either Ive all done dumb stuff you know what I mean that's the thing exactly it's just like you can't judge them based on that stuff I think you can and here's why have you guys ever seen I'm going come down the",
            "start": 2786.24
        },
        {
            "text": "done dumb stuff you know what I mean that's the thing exactly it's just like you can't judge them based on that stuff I think you can and here's why have you guys ever seen I'm going come down the rabbit hole with me I'm come close and come down in the there was a movie that was made called Jade do you remember this movie at all I don't movie starring Linda Fiorentino and Chaz Palminteri, about a woman who was married to a guy C.H. is like a district attorney I think um and finds out that his wife has been masquerading the entire time as like this like I thought that was going to end differently no crazy um like exotic sex worker SL like dominatrix right and he finds this out about her and it turns out that she, spoilers kills a guy the whole thing's a murder mystery they're trying to figure out whether or not she did it hot off the heels of Basic Instinct you know they were trying to get another movie out like that didn't really catch on I don't I don't I don't believe but",
            "start": 2833.96
        },
        {
            "text": "trying to figure out whether or not she did it hot off the Tales of Basic Instinct, you know they were trying to get another movie out like that, didn't really catch I don't I don't I don't believe but at the end of the movie he knows his wife did it so he covers it up for her oh but then he goes at the very last scene it's kind of an abusive relationship she doesn't want being it's a it's it's a weird psychological Thriller kind of thing but he tells her at the end of it he's like hey and the next time we're together in that way like I want to see Jade, and that was like her moniker when she went out there, the point I'm driving at is if I saw it and it was like out of this world amazing I would be like hey what happened why did I get what like what happened that's job they're like but like I don't know I'm like can you can you bring can some of that transition over yeah you know I don't know I'd be a little disappointed that she would like had that showmanship there but didn't feel the",
            "start": 2875.92
        },
        {
            "text": "know I'm like can you bring some of that transition over yeah you know I don't know I'd be a little disappointed that she would have had Showmanship there but didn't feel the need to bring that into our little um you know happy home I guess I think my first reaction would be that I'd be like what and you didn't tell me but then I'd eventually come down and just the fact that well I never asked and why do you need to tell me that like you lived a life you know what I mean like I get there in the end I think you want to know that that's that's up there with I used to do hardcore drugs for a while I think see I guess and this is the other thing about this argument is again it wouldn't even be so much oh you did porn you're gross it would be so much like we've been together conceivably X number of years we're married we've been married a little bit maybe even a short bit but like we were in a committed relationship we talked about our lives and this at",
            "start": 2913.68
        },
        {
            "text": "been together conceivably X number of years we're married we've been married a little bit maybe even a short bit but like we were in a committed relationship we talked about our lives and this at no point in your timeline of events was this something you wanted to bring up to me like why like I understand it's embarrassing but we tell each other everything and maybe I'm just a guy who talks about crap in a bush in front of his best friend on the internet so like everybody just thinks I don't have anything I don't or someone who just enrages soccer fans we're missing the essential question fake soccer fans the essential question is what kind of porn is it and also the other question is can we hold people that are in our lives to account for things that we were not there for that they were not doing to us no I don't think we can the answer to that is I don't think we can for the sake of argument though let's run through the mill hardcore but not like crazy the kind of stuff you type into",
            "start": 2951.08
        },
        {
            "text": "not doing to us no I don't think we can the answer to that is I don't think we can for the sake of argument though let's run through the ill hardcore but not like crazy the kind of stuff you type in is it a porn or is it a sex tape that he his tweet does not uh it's a porn it's a description I'm saying I need I needed money I wanted to do this thing it's a I got paid to do this job is sex tape no sex tape was step down from terms of like offenses like I was saying right like Photo yeah whatever sex tape sex tap is on to me sex tape is completely completely in a different category like if if if my wife and or significant other uh were to come to me and say hey there's this is out there it's floating around I'd be like I mean good for you you you did it you knew what the ramifications but that probably built into the sort of hotness of it in the moment it's different than saying like I have an agent my agent called me and now I'm going to go to this shoot I've never met this guy before and got it",
            "start": 2989.12
        },
        {
            "text": "built into the sort of hotness of it in the moment it's different than saying like I have an agent my agent called me and now I'm going to go to this shoot I've never met this guy before and got it Nick Nails it cuz again this is I'm talking about the timeline of your life Nick's wife nailed it not your real KN your hypothetical wife yeah well at some time in the I had asked this question I'm going to go home tonight and see what she says at some point in the timeline have you done porno at some point in the timeline if you're a professional pornography star actress whatever that Starlet, thank you that comes up in conversation I think otherwise you're covering up I would imagine years of your life a year more what you did for you know and you're talking about your life and what we've done a sex tape no way because that goes back to the whole photos of somebody somebody takes photos of you while you guys are having like that's the problem you can't really me on that cuz let's",
            "start": 3037.92
        },
        {
            "text": "done a sex tape no way because that goes back to the whole photos of somebody somebody takes photos of you while you guys are having like that's the problem you can't really me on that cuz let's guess what chances are if you get married like 5 10 years from now they all have sex tapes out there someone at some point has probably filmed them and I think the big difference there is the internet though I my watch for the annual calendar like 10 years from now five years from now look at this like back in the day sex tapes and porn were different things it was just like I'm literally the only person that can see the sex tape but nowadays it's like if you go to a porn website which now are just not like before there was a lot of them now it's just it's YouTube like you just upload something and it's just like it's the sex tapes are right next to the porn it's almost like yeah but then they do the thing where they're like it's a sex sex tape and you're like you click on it and you",
            "start": 3077.24
        },
        {
            "text": "and it's just like the sex tapes are right next to the porn, it's almost like yeah but then they do the thing where they're like it's a sex tape and you're like you click on it and you look at it's lit and it's a it's a porn star and you're like that's not a gang bus, there's a lot of sex tapes on YouTube, there's no new YouTube, you said YouTube or did you say Reddit, no the YouTube style is like YouTube has million channels of people having sex now let me let me boil it down even further to its essence this all comes back to I think a really important point in relationships which is um don't ask questions you don't want the answers to M and this was a conversation I've had with women in the past where it's like you know like I am not a jealous person at all like like there was a time when I was younger when I was and you learn lessons from that because it's like you kind of obsess over this stupid **** and like what are they doing and who are they with it's like who",
            "start": 3112.04
        },
        {
            "text": "was a time when I was younger, I'd obsess over this stupid crap and think \"what are they doing\" and \"who are they with?\" It's like, who cares? If the woman or man you're with is someone you trust and care about, let them go and do their thing. Because if they're cheating on you or doing messed up things to you, then they're not for you anyway. These kinds of things answer the questions for you, but I never asked the questions - even when I got into it with my girlfriend now, who I've been with for years and assume I'm going to marry. It's like, how many guys have you been with? All this stuff... I don't want to know, I don't care. It's your business, and if you feel the need to tell me that's fine, but I'm not going to offer up that stuff just out of nowhere if you don't ask.",
            "start": 3151.04
        },
        {
            "text": "know I don't care it's your business, and if you want to ask, I'll tell you. See, I mean that's the other side of that though - is like, you should not ask those questions, you're just going to get hurt. Having said that, it's really hard not to ask those questions when for a lot of people... yeah, but as you get older, it doesn't matter anymore. But beside that thing, though, it's like if you do ask the questions, you better be honest about the answers. I think that's more important. So, like, for me - and this is not for everyone - but like, as you get older and as you have a lot of these... experiences that uh, help shape who you are, you know, for the rest of your life, you sort of just assume everyone else has those...",
            "start": 3184.8
        },
        {
            "text": "not porno but as you get older and you have experiences that uh you know help shape who you are you know for the rest of your life you sort of just assume everyone else has those like for me it's never been a question I don't I don't care how many uh men my wife's been with beforehand um I hope they were all good experiences for her you know and I hope she had as many as she thought she needed before she got to me cuz she certainly doesn't need to nickolodeon get out of the way with the Green Day song playing behind him with naked dudes that your girl that your wife slept with walking camera I'm like no get the camera out of there it's not yeah all that stuff seems so much more uh exaggerated when you're younger right when you're like 16 and this is the first girl you've ever like had an intimate contact with and you're like I want to just own this and like I want to own this you know what I mean like this is mine this I don't ever want anyone else to experience this cuz it's so amazing and then you know",
            "start": 3223.16
        },
        {
            "text": "and you're like I want to just own this and like I want to own this, you know what I mean? Like this is mine. This I don't ever want anyone else to experience this because it's so amazing. And then you know after a while you lose the connection to the physical connection, so to speak, and it's more about just the companionship and making sure each other's needs are met and making sure that um basically everyone's happy and it doesn't really matter what came before at least it shouldn't in my opinion. I don't think it should matter unless there was something that needed to be dealt with like you know a disease or a right. Like oh by the way I was I have a kid. You're of this rambling thing I've been trying to put together is I'm not offended that you did pornography, I'm just it's weird that you didn't tell me. We had this. Sorry. I love that you just looked at me straight in the eyes right there. Well I feel like I'm you're the one I'm trying it's your topic so I'm",
            "start": 3270.64
        },
        {
            "text": "I'm just it's weird that you didn't tell me we had this sorry I love that you just looked at me straight in the eyes right there well I feel like I'm you're the one I'm trying it's your topic so I'm how many people you think sounds like a Tim Gettys topic it sounds like a Tim Gettys topic it is sorry that's okay it's not that I care that you did \"Girlfriend of the Year\" for a year and a half in the middle of it all yeah it's weird to me it's just like I just try to keep it all in the context of like maybe it's from past experiences where like you just get too caught up you get it's codependent it's all these things that you don't want to be and uh to me it's just like it comes with experience it really does it does um to just be like I don't care it's not even that I don't want to know it's like I don't",
            "start": 3309.68
        },
        {
            "text": "things that you don't want to be and uh to me it's just like it comes with experience it really does it does um to just be like I don't care it's not even that I don't want to know it's like I don't care I don't care you know whatever like if you care about my stuff that's cool I'm not going to say like offer up that information for you if you really unless you really want to know if you really want to know I'm going to really tell you you know and then you're not really going to want to know I like how sometimes when you make the point you squint up and you kind of look like Robert De Niro.  Robert is that an anti-Italian? Anti-Italian, I think it's very Pro-Italian. I wish I I wish I did that I wish like cro Pro it's just a time it's just an a time so anyway that's where I stand on it's just like you know there's a place for honesty I guess the answer to the specific question Tim is uh no it wouldn't matter again not my topic just sounds like everyone just assumes that it's about having",
            "start": 3350.16
        },
        {
            "text": "like you know there's a place for honesty I guess the answer to the specific question Tim is uh no it wouldn't matter again not my topic just sounds like everyone just assumes that it's about having sex with Disney princesses it's your that was your to totally sounds like a tip top and then what was your summation of it all my summation of it all is just hold on let me think back to the original question which was oh yeah I mean it would affect it I I think as much as I want to say say it wouldn't it definitely would I think it would just be more of a could you get talk about it yeah 100% 100,000% I think I'm with Colin I don't think it would matter to me one way or the other I would wonder why during that like disclosure period where you're thinking about marrying one another that didn't that didn't come up I mean see my thing is knowing me I would have asked about it and given this story she would have said she told me it didn't happen I wouldn't think to ask because you can't like",
            "start": 3387.68
        },
        {
            "text": "that didn't come up, I mean see my thing is knowing me, I would have asked about it, and given this story she would have said she told me it didn't happen, I wouldn't think to ask because you can't like, and then like you can't use the argument well, you didn't ask 'cause like who would ask if you've ever done a porn, a profession? I would never ask that but I would ask like is there anything of a sexual variety that I should know about, you know? Would ask that. I'd ask something of that yeah, but to some people like that's the thing, like, like there's a bunch of people going around right now, you know, Snapchatting each other's genitalia all over the place and like those pictures are out there, but people don't care; they don't see it doesn't seem to be bothering anyone. So five years from now someone's gonna be like, \"Did you send any... you know, yeah, time penis pictures to other people?\" Like, yeah, didn't you? Like isn't that going to be... I was going to say dick, I know you're going to say dick pics and I like",
            "start": 3430.44
        },
        {
            "text": "going like did you send any you know yeah time penis pictures to other people like yeah didn't you like isn't that going to be I was going to say dick I know you're going to say dick picture and I like that you did it you just said picture penis pictur 10 years yeah it'll be a different landscape where this will be an Antiquated conversation I don't even know if it's 10 years like I feel like we're in that now everyone's just sending like there's so much of this and it's like I think that now it's less of a um a bad thing that like you're doing something that you shouldn't be doing and it's just more like I don't think it's that crazy to be like hey is there stuff I should know about because there's definitely stuff out there and I mean I think that's the part what the extent of it is really the question okay yeah and and how much is it going to come back to damage anything that we exactly it's just like it's like the way I see it with this modern Internet it's like I would want to know",
            "start": 3472.96
        },
        {
            "text": "the question okay yeah and and how much is it going to come back to damage anything that we exactly it's just like it's like the way I see it with this modern Internet it's like I would want to know what's out there in order you want me to take it go this modern internet is like that Greg has that every time you say instead of the old timing 1920s Internet it's true it's very true faster and seemingly more vast and you it's just so easy I want to know what's out there because that reflects on her that reflects on me like all this it's just like I want to at least know that but see I also I'm of the mind that like I don't know I mean you you asked me 10 years ago would that if something like that leaked would that like destroy someone and I would have said absolutely but then you see these women who have become Empires because of their sex tapes right let's not forget Kim Kardashian was nothing was she wasn't nothing she was a friend Prime position to become something she was a friend",
            "start": 3509.6
        },
        {
            "text": "women who have become Empires because of their sex tapes, right let's not forget Kim Kardashian was nothing without her sex tape. She wasn't nothing, she was in a prime position to become something - she was a friend of Paris Hilton, great, she was a Hollywood socialite, like quote unquote whatever that's worth, whatever that means. She does a sex tape, by all means it should have ruined her reputation around town and she becomes 5 years, six years, seven years later a mega Empire. I just don't think it, I think people are just interested in whatever is uh sort of risque now they like every it's always been that way right, like everyone's lives we just find uh risque topics or polarizing topics fascinating, we're just we're just drawn to them and whether they're good or not the actually some of them that are terrible are even better because then we have more to talk about right in our lives like water cooler chat and that's all Kim Kardashian is she's built a freaking multi-million dollar Empire.",
            "start": 3554.68
        },
        {
            "text": "Are even better because then we have more to talk about right in our lives, like water cooler chat. And that's all Kim Kardashian is - she's built a freaking multi-million dollar empire. More power to her, I guess. Tim, yes, what's your topic? So my topic is what websites do you visit every day? Cuz I got a bunch of them. Does Twitter count? Definitely okay, yeah. So yeah, I feel like the social media for me at least goes without saying - Twitter, Facebook, Facebook that much. I've explained this before: my Facebook's for my friends, like my real-life people that I know. Is that what you do? Cuz I just started like anyone else, and I was like, \"Go for it, why not?\" Cuz I never post on Facebook, so it doesn't matter to me. Yeah, I just don't do that. The only time I ever post is on a fan page - yes, just promoting content. But since it's a longer tale, I usually just leave it up longer. Well, it's different like for the fan-page thing, but I'm my personal Facebook, I never update my Facebook profile.",
            "start": 3601.96
        },
        {
            "text": "promoting content but since it has a longer tale I usually just leave it up longer well it's different like for the fan page thing but I'm on my personal Facebook I never update my Facebook profile I don't update it pretty much ever but I use it to keep up with my friends from college and from middle school and see what they're doing and like who's dating who and how fat did he get and stuff like that I think again F I think that's another like thing that's a sign of our different Generations is that I just at this point in my life I I went through that where I'm like oh what does she look like what does he look like what's he doing now now I just don't care now we have this Empire that we're building this is our sex tape Empire yes like we've already done the sex tape we're just waiting for the money to roll in asend now that we've got this what if we all did a sex tap together let's do it well get us will that get us Fame and money I don't think so so wait real quick about that I had",
            "start": 3647.96
        },
        {
            "text": "the money to roll in asend now that we've got this what if we all did a sex tape together let's do it well get us will that get us fame and money I don't think so so wait real quick about that I had this idea similar so you know how like all the pretty like cosplay girls and stuff they do the sexy like pinup posters and sell them never I want to do that for us yeah we should sell are we in like bathing suits we're in like the sexy cosplay stuff yeah sure me yeah totally individual posters of us mon month gets to be whatever he wants Rockman we got to call him Rockman okay I'm sorry you got to go back to the origin um so we're doing sexy versions of just nerdy things and male characters or female characters or doesn't matter whatever you want it to be whatever you want I want to be sexy Yoshi okay I I I want you to do that I will make that costume for you it's nasty where's the egg going to come out of you going just ingest it well it's not it's not a video it'll just be the egg behind",
            "start": 3687.52
        },
        {
            "text": "okay I want you to do that I will make that costume for you it's nasty where's the egg going to come out of you going just ingest it well it's not it's not a video it'll just be the egg behind me already his tongue's out no I want my tongue going off the side of the camera so you don't know what I'm grabbing oh man what would you be in the sexy cosplay I don't know don't give them all away everybody tell us in the comments what you want us to be in our section I want you to be GoldenEye James Bond that's so good I want do that oh yes when you flip the page I want to be Oddjob also you know what I mean I like that could it be like your back side though every day uh IGN which sounds like a cop out but I still go every day happening every single day lot of time for I stopped reading that site like six years ago um so now I'm so Twitter IGN clearly duh Facebook no I get I go to Facebook every so often um here's embarrassing maybe I don't know but a a site I check every day",
            "start": 3734.44
        },
        {
            "text": "site like six years ago um so now I'm so Twitter IGN clearly duh Facebook no I get I go to Facebook every so often um here's embarrassing maybe I don't know but a a site I check every day text from last night still on the train every day it's a easy mobile refresh I read the one page of they're real I like to think they are but there's no way to prove it cuz just go to their website and you write the text that it was so I like to think they're real they're all they're you know they're always about Tinder nowadays or whatever it's just like all that's fun stupid stuff like that reddit reddit definitely see I I I've been making more of a point to make Reddit like the first thing I look at like and then check back in the day and I have now gained an appreciation for Reddit before I was like this I don't like the the way it looks I can't navigate this it doesn't make any sense to me I'm too old for this my hip hurts I got to have a replacement like this on my old I remember the old internet",
            "start": 3780.92
        },
        {
            "text": "I don't like the way it looks. I can't navigate this. It doesn't make any sense to me. I'm too old for this. My hip hurts. I got to have a replacement like this on my old one. I remember the old internet days, everybody... but now that now that I've been looking and now that you know I think Reddit's all about finding sort of your subreddit that you like right or a couple subreddits and now that Sean Finnegan showed me the movie subreddit and like some of the things in there I'm like oh this is actually really cool and there's some really good discussions that are happening in there. Do you subscribe to the Game Over Greggy subreddit? Uh, no. Everybody shows up is there a game we don't run it. There's a fan who keeps a Game Over Greggy sub going; he does it every day when we post the video at midnight. He goes and puts it in the Game Over already bad. Thank you for that. We for the record nobody goes and comments, so you should all go at least say hi and thank you. Yeah, that's awesome. I'm going to go.",
            "start": 3826.08
        },
        {
            "text": "he goes and puts it in the GameOverGreggy Show already, bad thank you for that. We, for the record, nobody goes and comments so you should all go at least say hi and thank you. Yeah, that's awesome. I'm going to go tomorrow if I remember, um, which I probably won't. I'll add it to your phone, yeah, add it to my phone. Um, but I want to make a daily thing for me because I just think there's a lot of interesting discussions happening there. Plus, it's how a lot of people discover everything, right? See, see all my my daily internet traffic is really on the main like what I'm reading so I text from last night and Reddit and like that's where I comment and catch up on everything. And Reddit for me was the same way, where there's the infamous Greg Miller Dead Space 2 review which was legitimately the first time I ever heard about Reddit when Bry's like you're reviews still on the front page of Reddit has a million comments and I was like what's Reddit and then I went there commented then talk to kids through blogs",
            "start": 3864.0
        },
        {
            "text": "heard about Reddit when Bry's like you're reviews still on the front page of Reddit has a million comments and I was like what's Reddit and then I went there commented then talk to kids through blogs and emails yada y y but after that I didn't touch it for a long long time and then yeah it was something I was looking for something to do on the train years ago now and it was like opened it up and then once you get into a rhythm of checking it and see how it works oh okay I get this this is cool see I'm I'm still trying to get to that um which I missed dig completely kind of came I was like what's dig and then everyone's like it's the best thing and then I was like literally overnight I went to check it and then I was like no Dig's not the cool thing anymore reddit's the thing now and reddit's actually had it's been popular for years now at this point right so I'm I'm looking at him to validate this I don't know it's super awesome um for me it's this is embarrassing to say superficial",
            "start": 3899.48
        },
        {
            "text": "actually had it's been popular for years now at this point right so I'm I'm looking at him to validate this I don't know it's super awesome um for me it's this is embarrassing to say Superficial I know it it's The Superficial, super it's superficial because the guy just continues to astound me with his writing he's such he just his his perspective on these issues is so uniquely him that I find him fascinating and I know it's a guy cuz no one wouldn't make that many penis jokes if it were a female um super such a weird site though cuz like it's one of those things where I think yeah Christine used to look at it a lot I think she still has a little bit but you go there and it's like just a weird mix of like it's girls and bikinis but that's it's not the story isn't about them necessarily in he's smart he's like the Tim Gettys of the future well he's now yeah Tim Gettys is like The Superficial the future when Tim runs his own site it'll be the superficial because the headline",
            "start": 3935.64
        },
        {
            "text": "he's smart he's like the Tim Gettys of the future well he's now yeah Tim Gettys is like The Superficial the future when Tim runs his own site it'll be the superficial because the headline will be really grabbing then it'll be five pictures of a girl in a bikini then the body of it will be about something that's related to the headline but not the bikinis and underneath it it'll be related videos of bikini like pictures of bikini girls smart and strategy yeah it keeps me coming back um I also you got me uh hooked on tube filter oh yeah which is pretty amazing I get a lot of YouTube news that way yeah what about new Min rockstars you still checking that everything well they changed donors and things out a little weird still cool that was the thing when you told me about them back in the day I went and checked it and then they were going through the change so they kind of stopped posting so then I got out of the Rhythm and now somebody linked me to something today and I was",
            "start": 3981.24
        },
        {
            "text": "in the day i went and checked it and then they were going through the change so they kind of stopped posting so then i got out of the rhythm and blues and now somebody linked me to something today and i was watching it on there i like oh they're they're really different it's still good it's not as good as it was but tube filter kind of like picked it up there and like tube filter is the i think the better what about well buzzfeed i so i check buzzfeed every day but i never i never go to buzzfeed i always like get linked off that's my thing i don't a lot of the website i used to go to all the time like buzzfeed and mashable and things like that i just follow them on twitter and like oh that's sounds interesting i go from there so twitter's kind of a good hub is is twitter your starting ground for everything twitter is definitely like a good jump off point there's a couple sites that i visit every day just from when i was younger that i just keep doing like q.com my favorite music artist i check",
            "start": 4019.48
        },
        {
            "text": "Twitter is definitely like a good jump off point there's a couple sites that I visit every day just from when I was younger that I just keep doing like q.com my favorite music artist I check their forums every day um Cybertron, Docomo and **** and like k k posted a lot exactly yeah yeah no I exactly all these things my my name is Karakash on all of them including the **** Fors awes did you see that somebody wanted that to be the world what we renamed the earth oh D that's a good idea I like that a lot boom change change it right now and then there's certain things that I check every day for no reason it's just like muscle memory like macrumors.com I'm not in the I'm not buying a Mac I don't even really like apple that much d d That's weird what now do you have extra like uh bookmarks on your home on your home so I have my little the two ball to toolbar thingy with a bunch of icons that are super organized oh Rooster Teeth that's the one I go to Rooster Teeth multiple times a day",
            "start": 4056.04
        },
        {
            "text": "on your home on your home so I have my little the two ball to toolbar thingy with a bunch of icons that are super organized oh RoosterTeeth thats the one I go to Rooster Teeth multiple times a day just to see what the **** going on yeah we we haven't mentioned YouTube oh Im on YouTube all the time I know its like its a utility you forget about it but I I now go to the thing where its you know default opens to our stuff and I use that as a jump off to see whats funny Im obviously Im crazy about YouTube If you guys didnt know this I have multiple things going to YouTube one goes to this one goes to IGNs one goes to my personal thing and make sure that my personal things not logged in so that I get the whole what other people are watching and what you should watch so I see the YouTube homepage from a non-logged in thing cuz I want to know whats everyone else is talking about Im smart keeping me cool so I can make you cool too Nick thats why",
            "start": 4099.68
        },
        {
            "text": "you should watch so I see the YouTube homepage from a non-logged in thing cuz I want to know what everyone else is talking about I'm smart keeping me cool so I can make you cool too Nick that's why we have you MH you're tall you're youthful you're in the no Colin what are some of your I mean I know the the big one Drudge Report Drudge Report oh yeah every day begins and ends with Drudge Report uh yeah so I mean obviously like so when I'm on my phone it's Twitter and the AP the AP app is really good you can separate into like world news or us news or by state or Sports and stuff so that's great and a lot of people ask me like how do you get un biased non political newss you go to the AP or Reuters they're pretty good but in terms of websites that I go to every day I start every day with Drudge Report Drudge Report is an aggregate a political aggregate the biggest political aggregate in the world um and uh it's it's essentially a conservative website that makes fun of a lot of things",
            "start": 4137.96
        },
        {
            "text": "Drudge Report is an aggregate, a political aggregate, the biggest political aggregate in the world, um, and uh it's it's essentially a conservative website that makes fun of a lot of things that are going on with liberals and so it's it's a little bit mean-spirited some sometimes but it's also really funny and it's also Drudge Report, it's also really topical. The guy's name is Matt Drudge, um, and Drudge Report hasn't changed designs in 15 years so it still looks really old. It's kind of totally intentional; the guy doesn't give a **** he makes millions of dollars a year off this website he does not care like that is and he's just a recluse, the guy that runs it like no one's seen him in a long time and stuff that's awesome um and uh his big story was that he was the one who broke the Monica Lewinsky scandal so that's how Drudge Report came out interesting um and that was before that anyone was breaking anything on the internet so he was like really a pioneer at the time and then",
            "start": 4174.88
        },
        {
            "text": "Monika Winsky Scandal so that's how Drudge Report came out interesting um and that was before that anyone was breaking anything on the internet so he was like really a pioneer here at the time and then I go to a a a really good political blog called Hot Air um which is like a more paleocon um slanted uh political blog that's excellent I read that multiple times a day and then I go look for video content I like Morning Joe on MSNBC a lot it's the morning show with Joe Scarborough so during lunch at work I always watch the first 20 minutes of it or whatever at work um and at Real Clear Politics is another website that has great video like they'll clip out things people said on C-Span or things that you'll just have missed like from the last day mhm and then as far as sports are concerned I go to um Al well I go to political a lot too which is a really good website um and then as far as sports are concerned I go to ESPN multiple times today um I go to a website that I'm really fond of for the",
            "start": 4216.24
        },
        {
            "text": "\"um I also go to Pardon My Take a lot too which is a really good website um and then as far as sports are concerned I go to ESPN multiple times today um I go to a website that I'm really fond of for the Islanders called The Lighthouse hockey um that's an NHL Nation website um they're excellent I'm friends with them on Twitter and and they're that's a really really good website um Jet's blog I go to um but like how these are a lot of blogs so how many how I go to these every day do you but like what percentage of your day do you guys spend consuming content that is either that is indirectly related to what you your job like I'm not saying like IGN we have to read cuz a we have to we're fans but we also are putting work up there so we have to make sure it's displayed properly and it's like doing what we needed to do but like what like do you take every hour you take five minutes to read these blogs cuz Tim you're always really into it and so are you guys always seem to me\"",
            "start": 4255.44
        },
        {
            "text": "what we needed to do but like what like do you take every hour you take five minutes to read these blogs cuz Tim Gettys you're always really in the know and so are you great like you guys always seem to me like you're so much better versed on every topic that I am well I mean that's only in terms of this stuff every literally everything else in the world besides internet video games I think Colin Moriarty is the well-versed one when it comes to your strengths that's what he's talking about like the way it's the same thing for me and like why I'm versed in comics or whatever the way I am even though I don't read everything in comics anymore it's because I follow comic people on Twitter right so they get up a link I hit the most important thing I'm back out I'm back to what I'm doing right like you jump in you see the video whatever you need to do about that see I guess I do that but I don't know I think I get it vicariously I follow all of you guys on Twitter so I get it vicariously through all of you guys if it's",
            "start": 4295.6
        },
        {
            "text": "whatever you need to do about that see I guess I do that but I don't know I think I get it vicariously I follow all of you guys on Twitter so I get it vicariously through all of you guys if it's important enough for me to read one of you will retweet it I mean that's my thing is with I really love internet video and there's sites like Devour and Geekology Awesomer which I honestly don't consume their content that much anymore just more of a time thing because I just don't have time to do that right but I do look at them every day just to see what they're curating because those are guys that just curate videos that everyone else has made they're like hey these are cool things and um I've slowly just kind of like gotten away from that I think the internet video as a whole has kind of shifted and got way more like these are all sponsored videos and like people are making money from it so a lot of the just like fun dumb things are kind of it's kind of over it's disappearing yeah",
            "start": 4331.64
        },
        {
            "text": "and got way more like these are all sponsored videos and like people are making money from it so a lot of the just like fun dumb things are kind of it's kind of over it's disappearing yeah and it's that's not necessarily a bad thing there's some bad parts to it but um well it's becoming it's because it's becoming more legitimized right exactly it's as as as the ad dollars are coming over from television to online rightfully so because online's a better medium in my opinion um not you know True Detective notwithstanding uh and things like that but uh for the most part people are getting more Savvy at it they've been at it for years now not like to a road and just becoming mainstream there are guys like us who are taking their professional lives and bringing it on to what they love to do at night we're still we're still look at thing it's not even about selling out though it's about you know getting paid money to do what do what you love and then give back and do all that stuff so",
            "start": 4368.88
        },
        {
            "text": "do at night we're still we're still look at thing it's not even about selling out though it's about you know getting paid money to do what do what you love and then give back and do all that stuff so in that sense I've stopped looking at them those sites so much because sites like tube filter that are legitimized things are presenting me with the like what's going on stuff yeah it's funny like we always talk about like you know we're going to VidCon this weekend people people people will see this the weekend after I've been to Vicon and what's funny is that like then we're going to RTX I love video games and I write about video games and I we do internet video and I'm really passionate about doing it with you guys and Stu like that but I know very little about internet video and so it's funny for me to like go to these things and kind of learn firsthand because I don't like go to YouTube and like what am I going to watch today I like 95% of the time I go to YouTube I'm like I want to",
            "start": 4407.56
        },
        {
            "text": "for me to like go to these things and kind of learn firsthand because I don't like go to YouTube and like what am I going to watch today I like 95% of the time I go to YouTube I'm like I want to watch a music video that I already know exists, 95% of the population basically does that, and like I I read a surprising little about like I don't read video about video games really, like I you get a Gaff though yeah I read I read Gaff which I think is a really I think a really good form because a lot like um I don't go to like uh they're good websites but I don't go to Kotaku or Joystiq whatever I just don't read these websites so I go to Kotaku every day, I can links to like Polygon a lot or Kotaku or what you know what I go to people I follow those writers and then they'll put up something I want to see and I click on, I don't follow anyone from the gaming industry except for like the people we work with so yeah G like I think Gaff's actually I don't post on Gaff I don't think",
            "start": 4446.84
        },
        {
            "text": "something I want to see and I click on I don't follow anyone from the gaming industry except for like the people we work with so yeah Greg like I think Gaff's actually I don't post on IGN I don't think they'd want me to post there but like it's I like reading it cuz it's usually like that like something will happen and it's there and so like it it negates the reason for you to read those the gaming websites I guess that's what I'm saying like I used to start my day out a few years ago where it was like i' go to a lot of different gaming websites to keep up um now you know that's basically like The Drudge Report of video game so it's like you can just find everything and if you're not satiated then I guess you can move on but like I'm more about using IGN itself as like my my medium to find out about games and it's the same way like why I go to ESPN or Grant and um for sports it's like I'm not going to Fox Sports and then CBS Sports and then you know Dead",
            "start": 4484.2
        },
        {
            "text": "out about games and it's the same way like why I go to ESPN or Grant and um for sports it's like I'm not going to Fox Sports and then CBS Sports and then you know Deadspin, I'm like I'm go I I go to Deadspin a lot because Deadspin's just **** hilarious but other than that I don't know if you guys read that blog it's a sport site, it's Kotaku, it's in the same family as Kotaku but it's their sports blog, it is **** heinous like it is so good so you're saying oh it's good yeah it's so funny dude they scoop like crazy **** over how they how do they do that they pay people like they're the ones that Brett Favre's like dick pics and all that kind of stuff that he was taking to his mistress when he was on the Jets like they broke that story that was like a huge they break like all these stories so basically so that's how you break stories right is that you just have a network of people that will just you buy content from, is that how it works presumably there was a really good interview with a guy",
            "start": 4518.92
        },
        {
            "text": "so that's how you break stories right, is that you just have a network of people that will just buy content from, is that how it works? presumably there was a really good interview with a guy that runs Deadspin where he makes a ton of money and he's just pretty candid about, he's just like we know they break stories like they're totally legit but I guess what I'm saying is like a lot of these aggregate websites have really helped me narrow down the list of websites I used to go to, I think when I was in college I would go I would spend so much time on all these websites because like so like NeoGAF even though I don't post there um you know you just read it a few times a day and you're like well this is everything on the front page everything that matters yeah is like is already here and then I don't have to click on all these different websites and I'm just not reading that much about games because a lot of the stuff I'm reading about at these different websites",
            "start": 4557.92
        },
        {
            "text": "already here and then I don't have to click on all these different websites and I'm just not reading that much about games because a lot of the stuff I'm reading about at these different websites I don't care about anyway I care about the things that I care about with games and so politics I'm a little broader with especially now that the midterms are coming up where I want to read a lot about that kind of stuff but I would still say like Twitter like Tim Gettys was saying is a great aggregate too of like you know getting what you need see it doesn't help for me though because I follow like like people like Emergency Kittens and like Rich Aholics where all they do is post pictures of exorbitantly rich things he'll have like five Rolexes will just be like on all of his arms with like a stack of money in front of it and like see I've stopped following people like that that do just that stuff because then I",
            "start": 4590.64
        },
        {
            "text": "have like five Rolexes will'll just be like on on all of his arms with like a stack of money in front of it and like see I've stopped following people like that that do just that stuff because then I you miss not only that will yeah you do but also that's what BuzzFeed and Mashable and all those things are for they will just give me the threads and it'll just say 24 ridiculously expensive things and if I want to want like look at that I'll click on that one thread yeah but this is the best cuz this guy just randomly tweets like twice a day where it'll just be like like he tweeted out a like cartel style stack of money with just the doe with an expensive watch like looking at the time is the same guy in all the pictures or he just I who no it's I mean people just send Pi back in the day when Instagram was first starting there was this guy that just I remember this guy you would just take pictures of himself weird little like little dude he would just take pictures of him with",
            "start": 4624.84
        },
        {
            "text": "day when Instagram was first starting there was this guy that just I remember this guy you would just take pictures of himself weird little like little dude he would just take pictures of him with ridiculous cars ridiculous girls ridiculous just everything was awesome genius yeah but there was one website that I forgot to bring up and I can't believe I forgot this it's probably the best website in the entire world and that's The Chive oh The Chive yeah I but that I mean that's kind of borderline por0 it's not so here's the thing first off no second off they also post a lot of really good things and they curate a bunch of funny videos too and they their sense of humor is so spot-on that like if they post a video it's going to be good you know BuzzFeed and all them they're making money they're doing their thing The Chive still has this like thing about it where they're just like no only the best the best that reminds me of I used to get linked a lot to The Onion because they do a lot of",
            "start": 4663.88
        },
        {
            "text": "doing their thing the CH still has this like thing about it where they're just like no only the best the best that reminds me of I used to get linked a lot to The Onion because they do a lot of really I mean they're just they they were genius back in the day I haven't watched any video from them forever I'm not crazy about satire really like I remember when The Onion was I remember when The Onion was a printed newspaper this is how old we are a lot of people probably don't even know this it probably isn't but it was only like it was only thing that was like in your school library or your local library like when in like the late 90s I think it was and uh even then I was like I don't know I'm just not I just don't care about but the problem was that I fell down the hole I liked it so much that I started checking the site all the time and then I got oversaturated so now it's like when something awesome gets made on The Onion and I get to link to it whether it be video or a thing then it's really",
            "start": 4707.16
        },
        {
            "text": "checking the site all the time and then I got oversaturated so now it's like when something awesome gets made on The Onion and I get to link to it whether it be video or a thing then it's really funny and then I make a point not to click around they should just post like once one piece of content a day Monday through Friday and then tell us about their awesome t-shirts recently they they made a new \"Clickhole\" I went there making fun of BuzzFeed it's also really funny and it's one of those things where when I first heard it I was like oh I hate this idea this is this is so clickbait, Clickhole is them making fun of BuzzFeed it's so smart and so genius like when I first read about it are you looking it up right now no I want to I'm going to I just retweeted one from Marty the other day the I I won't even spoil it I would like if you could go to the site and click on their about hold on not no I'm hold on I about so good but pretty much they're just making fun of BuzzFeed and Mashable",
            "start": 4742.12
        },
        {
            "text": "even spoil it I would like if you could go to the site and click on their about page, hold on, not no, I'm holding on, I about so good but pretty much they're just making fun of BuzzFeed and Mashable and all these sites and they just come up with these ridiculous headlines and and stuff and um what's the one Upworthy? They're totally making fun of Upworthy where the headline will be like \"this might seem silly but it has a good point\" and you're like, what is it? The thumbnail is like this little cartoon alligator and you click on it and it's just a 10-second video of an alligator just dancing around and then there are just words at the bottom that say \"racism's bad\". This is my favorite tweet from Marty: \"and I retweet\" genus seven classic 90s toys that weren't fun anymore after 9/11, yeah, oh my God, this article's so good. Number four, Gak, remember Gak? Remember that SLE fart noise it made when you pushed it back into the container? Remember before you switched on the TV and",
            "start": 4781.8
        },
        {
            "text": "9/11, yeah, oh my God, this article's so good. Number four, I remember that Tamagotchi fart noise it made when you pushed it back into the container. Remember before you switched on the TV and saw not one but three harrowing scenes downtown New York, the Pentagon, a field smoldering in Pennsylvania. We lost our national innocence that day. Number five, crocodile dentist - those people, those falling people. Number six, Tamagotchi. Seven minutes left in last period; the teacher's talking, but your Tamagotchi is the only thing on your mind: \"Is it okay? Is it hungry? Is it happy?\" Back then, before 9/11, your life revolved around thoughts like these. They seemed important; they were important. It's just so read about... yeah, read about it 'cause it's it's so good. Wait, I'm on it - which part? It's really long though, Tim. No, give it to me. There's like a specific part. Yeah. Um. Hey Game Over Greg Show, thanks for watching. Everybody, where we just read the internet to you. We strive to make sure all of our content...",
            "start": 4821.6
        },
        {
            "text": "though Tim Gettys didn't give it to me, there's like a specific part, yeah, um. Hey GameOverGreggy Show, thanks for watching. Everybody knows we just read the internet to you. We strive to make sure all of our content panders to and misleads our readers just enough to make it go viral, like that is awesome. You see, we don't think anything on the internet should ever have to settle for mere tens of thousands of page views. That's awesome; it's genius, just like BuzzFeed. Are you okay? No, I'm just coughing. Come now, I thought I slapped you. No, I had a vision of SL, and the cough came out of me. Just beat him. BuzzFeed is borderline, that sometimes right, like where you're not really getting a value out of that; it's sheer entertainment. So what you might as well just take that SEC, that little tiny step forward, and just make everything up, which BuzzFeed pretty much anyway right? Yeah, I mean all their list-like content... no, BuzzFeed's actually now getting like legitimized; they have a new show, and like they're",
            "start": 4870.04
        },
        {
            "text": "and just make everything up which BuzzFeed pretty much anyway right yeah I mean all their list-like content no, BuzzFeed's actually now getting legitimized they have a new show and like they're bringing on Daniel Radcliffe like breaking news on their site I saw uh their EIC or whoever covers their DC the guy that covers their DC beat was on CNN the other night he's on Rachel Maddow the yeah she had him on which is crazy cuz he's like his Chiron his byline bar that's what they call it underneath is like is his name and I forget his name I apologize but and then it says like X bouncer SL editor-in-chief of like the DC Bureau of BuzzFeed which I'm like that's kind of fun so they at least they can have some some some fun with it well let me ask you this before we wrap this topic up though like what is what do you think the best website is that you visit because to me like I visit these websites and they're good like Deadspin silly and Drudge Report is just terrible",
            "start": 4916.44
        },
        {
            "text": "this topic up though like what is what do you think the best website is that you visit because to me like I visit these websites and they're good like Deadspin, silly, and Drudge Report is just **** terrible you know like but I like it the best we it like the website I'm really in awe of and everyone who knows me knows what the answer to this is Grantland, like that website is phenomenal I like it's just really really really really good like the writing is superb it's funny or serious or smart long form short form mailbags the only and their podcast they don't give a **** about video they don't give a **** about images they'll have these long ass articles about with 10,000 words with like no like just read it or don't you know and it's like and it's like and it's so good they're like and Bill Simmons is like who's the editor-in-chief is like a **** phenomenon like he has more Twitter followers than IGN and he's just the person that runs the site you know what I mean it's like it's",
            "start": 4958.08
        },
        {
            "text": "Bill Simmons is like who's the editor-in-chief is like a phenomenon, like he has more Twitter followers than IGN and he's just the person that runs the site. You know what I mean? It's like it's like to me it's like man, like I look at that site and I'm like it's so good, it's so so so good. And you know some of the more clever things I like that they do is uh there's this woman there that writes um she scores the um she goes like the New York Times or The Wall Street Journal whatever and like looks at the the culture pages for like high-brow wedding announcements and she scores them based on like how like what like is there an Ivy League school did they meet at an Ivy League school? Are two Ivy League schools worth like plus two for mention of a yacht, plus three for mention of a vacation in St. Martin or something like that. Like all these be like so there's like all this brilliant weird stuff going on there in addition to their sports coverage or their TV coverage whatever but like their their",
            "start": 5003.16
        },
        {
            "text": "or something like that, like all these be like so there's like all this brilliant weird **** going on there, in addition to their sports coverage or their TV coverage, whatever, but like their TV coverage, their movie coverage, their sports coverage, uh culture coverage, all the best, like all of it. I don't think I have a number one site anymore, like Tim was talking about, uh it's given to me by all of my friends and the people that I follow on Twitter, yeah but I don't count Twitter as a site, I count it as an app right, I very seldom go to twitter.com and usually this is what happens when this is how my Twitter experience is and it's me walking around like stopping clicking on something waiting for it to load if it loads you know if it's an Instagram picture I'm like \"no\" not going to look at that, you get two seconds to look gone so here's the thing with the gifts now on Twitter so they added them I'm super excited about this they never work ever though when it opens up in the",
            "start": 5044.72
        },
        {
            "text": "look at that, you get two seconds to look at the gifts now on Twitter, so they added them. I'm super excited about this; they never work ever though, like when it opens up in the quote unquote Twitter browser, it's the worst experience in my opinion. It's the only thing that they're good for is pictures because it shows you a little bit of it and tempts you to want to click on more of it. And now since I follow Rich Holistic, he retweets so many kinds of sub dirty pictures, and that reminds me when we had that topic on Instagram porn, and you were like no, Nick, Twitter's porn, Twitter is porn; it is porn. Yeah, and now that there's gifts, I'm seeing previews of this, and I want to see it, and I click on it, it never loads, and it's so upsetting; I'll never get to know where that was going. Yeah, where have you heard about this new thing, um, sex after sex selfies? Oh my God, no, that's a thing now, thanks Rich Holics, he retweeted, thanks Rich Holic, it's like it's dudes that are just like after",
            "start": 5085.64
        },
        {
            "text": "yeah where have you heard about this new thing um sex after sex selfies oh my God no that's a thing now thanks Rich holic he retweet thanks Rich holic it's like it's dudes that are just like after sex will the girl be like sleeping or if the girl's sleeping like that I want but again the thing is like again all these are fake I None of these are like real right these people all know they're doing it at least that's how I get through the day that's how I R he didn't answer no one answered the question what is the best website I mean I think I'm well the problem it gets into this weird thing of what it is I think Twitter would probably be the best website if that's disqualified for being an app I think then it's got to be YouTube and I don't that's the same thing though like to me I think the word platform comes to mind and that then websites are just so weird I think just because it has a URL doesn't make it a website like saying is what's the best website that's programmed for",
            "start": 5127.28
        },
        {
            "text": "the word platform comes to mind and that then websites are just so weird I think just because it has a URL doesn't make it a website like saying is what's the best website that's programmed for and they have Sterling and like it's a there's a voice behind it Twitter has antique internet though that's not modern internet and that's what we live in now that's true yeah but I I agree with that but I also I also disagree with that I mean like I think I think we can all agree that like web you know the internet's moving towards these platforms apps easy access to especially media so like video imagery gifts but a website like Grantland which is massive um and growing uh proves that there's an appetite still for it and and appetite for that kind of thing what I love the most about them is even though video some we love making and doing videos like they don't do videos at all you know like it's like their their video footprint is very small compared to their you know their written footprint and",
            "start": 5164.72
        },
        {
            "text": "video some we love making and doing videos like they don't do videos at all you know like it's like their their video footprint is very small compared to their you know their written footprint and so I'm really happy about the success of Grantland because it's like it's long form it's not appealing to the eye they're not trying to like get you to click on fancy headlines in fact their headlines are not very good a lot you know what you're getting when you click on their stuff um and they just tell really fascinating stories they do this one of my favorite things they do is oral histories they call them where it's like um they'll go to like a certain event the best one I think is about the the world series between the Athletics and the San Francisco Giants when the earthquake happened that was like what the whole oral history is about and um they go back and they don't that's none of them at all talking it's just like they go talk to 25 people and just put everything in sequence yeah and it",
            "start": 5209.76
        },
        {
            "text": "what the whole oral history is about and um they go back and they don't that's none of them at all talking it's just like they go talk to 25 people and just put everything in sequence yeah and it just lasts forever I I've taken entire train rides reading this up I'm like this is so good people still appreciate the written word and that's like as a writer and a person who reads and enjoys that kind of thing I'm I'm I'm really I take heart websites like that my problem then is that we're just defining it in such a box putting website in such a box then I have none I don't go to any website like that anymore I don't go I mean you know I use Twitter I get linked out to that I go to IGN if you count IGN I go to Reddit which I also don't count because that's a platform for people to bring things together in show and then you go to I you know like so many of them are today I learned X and it's like having a conversation with Colin where I click and I read the Wikipedia page about something",
            "start": 5249.08
        },
        {
            "text": "together in this show, and then you go to I mean, like so many of them are today. I learned about X, and it's like having a conversation with Colin where I click and read the Wikipedia page about something else. You know, does Wikipedia count? Like yeah, literally, as Tim just said, you've got to go to Clickhole more. I just follow him on Twitter, that's how I go now. Yeah, exactly, that's like if it had... If I had to choose a website, I think I'm going to Chive. You guys do one IID probably go to Superficial. To me, superficial is still that, like the Chive, like I said. Their quality, like the things that they curate, they'll lead me to the right stuff. The Superficial for me is because I you know I love Pop Culture. I'm still a huge fan, I'm from Southern California so I still have that in my blood of like I need to know all the gossip that's happening in LA and New York and anywhere else with those bikini-clad women. Um, so I love The Superficial. And again, just to back it up if you've never been to it but",
            "start": 5289.44
        },
        {
            "text": "\"need to know all the gossip that's happening in LA and New York and anywhere else with those bikini-clad women um so I love The Superficial and again just to back it up if you've never been to it but the guy that writes for that is an evil genius and but I still get a lot of news that way right he he breaks news to you but he does it in such a unique voice that it's constantly entertaining unlike some of the sister sites for that that uh that property because there's a couple other sites that you can link to that I'm not I don't really care for all that much but The Smoking Gun is awesome geology is okay it never got me it never it never yeah sparked me coming back but The Superficial I read like three times I'm like this is an everyday thing for me I have to do it before we move on real quick I'm just going to give a shout to two websites I don't go to very often but when I do I'm always entertained uh The Smoking Gun I don't know how the hell they get some of the **** that's on that website\"",
            "start": 5322.0
        },
        {
            "text": "just going to give a shout to two websites I don't go to very often but when I do I'm always entertained uh Smoking Gun I don't know how the hell they get some of the content that's on that website but that's like an amazing website like I really don't understand how they're getting some of the content they're getting and they're getting some like deep stuff for a lot of people don't know Smoking Gun is like they'll just leak subpoenas and lawsuits and hidden documents secret like it's an amazing website whenever I go there I'm like what the heck you know like how do you get this stuff the other website and people might get mad might not is TMZ which is probably one of the most brilliant websites ever created so I stop going to TMZ I don't often go there I I Drudge Report links out to it a lot sometimes I have something my eye but uh you know I'm always impressed by them too like they people give TMZ a lot of crap and that's fine like they deserve it or whatever",
            "start": 5359.8
        },
        {
            "text": "Report links out to it a lot soor I have something my eye but uh you know I'm always impressed by them too like they people give TMZ a lot of **** and that's fine like they deserve it or whatever they break probably more news than anyone you know as far as like I don't again like they just the scoops aren't very important but like some of them are I guess but like where are they getting this stuff you know like this is the stuff I'm most curious about like who are your sources and how much money are you spending to like extract all this **** from people so those two websites are pretty interesting why don't you go there anymore to Team TMZ yeah cuz they put like you know we've talked about this a little bit I don't respond well to negative slants on things mhm uh I like everything in my life to be positive like I think there is a way of presenting commentary in a positive light or a negative light and TMZ for me was always that sort of like you'd go and you sort of feel like you were",
            "start": 5393.4
        },
        {
            "text": "life to be positive, like I think there is a way of presenting commentary in a positive light or a negative light. And TMZ for me was always that sort of like you'd go and you'd feel like they were making fun of everything, but not in a light that I would draw some sort of positive conclusion from. When you go to the superficial level, he's making fun of everything, but it's very self-deprecating; it's very much like everyone's included on the joke. Whereas like Egotastic and TMZ are just... they seem to do whatever will get a click, however debased or however low they have to go to do it. You know, there was like a big thing where like a lot of Hollywood started uh protesting TMZ because they were posting way too many pictures of people's kids - that was a thing. And so it's that kind of... there's no standard, there's no moral standard on that site, and I just",
            "start": 5435.04
        },
        {
            "text": "TMZ because they were like posting way too many pictures of people's kids, like that was a thing, and so it's that kind of there's no standard there's no moral standard on that site and I just can't I don't think I can go; they posted a video of the aftermath of Tracy Morgan's uh yeah and to which like a bunch of people were like please pull that like Louis CK came out and said like had this big thing where he was like please take that down now here's the thing about this inappropriate here's the thing about this is that all those tweets and people retweeting that made me go to the website and look at the video because I didn't even know it exists; you gotta be kind, you got to be kind not effect not TRS effect you got to be you got to be kind of careful of of giving wait how is it not the stri effect; stri effect is when you put something on the Internet and take it down ah yes good call um no I hear you I hear you cool good topic Colin uh so Greg my topic is about a box we received in",
            "start": 5475.32
        },
        {
            "text": "\"Strip effect strip effect is when you put something on the Internet and take it down, ah yes good call, um no I hear you, I hear you cool good topic Colin, uh so Greg my topic is about a box we received in the mail, oh wait I have to okay you start this I have to go to the I just slam that water at the beginning of Greg's topic before he ran, no go ahead you sure yeah so gentlemen, uh last week, uh to work to our IGN address we received a package from um a mystery man it says uh for Game Over Greggy Show uh Greg Colin Nick and Tim it's that's who it's mailed to, Greg Colin ni awesome remember don't you don't have to send us anything, don't send us anything yeah we appreciate it but you don't have to, that freaking MP3 that's all buy a t-shirt uh I won't blow up the town that this comes from but it is a town from Upstate New York okay do we know that was I'm sorry was the name on the return address yet do we know who who gave this to us yet yeah there I'm sure there's a note there's I can already see paper\"",
            "start": 5509.84
        },
        {
            "text": "a town from Upper okay do we know that was I'm sorry was the name on the return address yet do we know who who gave this to us yet yeah there I'm sure there's a note there's I can already see paper I can already see paper I can already see paper get something Gordon oh my God Gordon Ramsay okay so we have a thing that says oh let me get to the mic first of all this package yeah really heavy this package about the weight Greg was when he came out of his mom's womb Shalala letter open first please do we worry that it looks like serial killer handwriting do we bring that up yet serial killer hand I'm **** around it's The Game Over Greggy Show thanks for listening don't send us stuff that's how I open envelopes too I try to do it nicely and then if it **** I'm like doing it this way what is this oh it's a wiener dog dear Greg Colin Tim Nick and Pete good news P's dead he's not here one day P's really going to be dead and you're going to cry uh he's at Brian Altano's house I'm only here for two",
            "start": 5558.36
        },
        {
            "text": "oh it's a wiener dog dear Greg Colin Tim Nick and guys good news P's dead he's not here one day P's really going to be dead and you're going to cry uh he's at Brian Alano's house I'm only here for two days so it didn't make sense to go get him from Brian's house because he was already watching him dropping back you know yeah um enclosing this package is a lot of good Trill stuff first off the two fragile packages are oos for Gregor review if he would like to no the two flavors are fruit punch and watermelon we do need to get both those on the oration but you guys got to power promise to watch them if I do it I am not sure if you guys have these by you or not also I have not tried them yet so I cannot tell you how they are not sure what Nabisco has been smoking lately though they've been smoking that green that money yeah get paid I tried to pack them really well so I hope they are not damaged so let's get those out first okay so we have first of all we have let's see what newspaper this",
            "start": 5610.52
        },
        {
            "text": "that green that money yeah get paid I tried to pack them really well so I hope they are not damaged so let's get those out first okay so we have first of all we have let's see what newspaper this is what if there was a Bob's Discount Furniture ad in it the marketplace today.com I don't don't look in the box I'm not looking don't look Nick wait did I miss the letter we're in the middle of it he sent Oreos for review okay he sent watermelon and fruit punch which we do need to do so I assume that this is it you want yeah you said the two fragile ones sure of course Greg gets the boxes this fragile he dog there we go oh man daylight at the end of the tunnel the fruit punch oh my god without doing the patented oration first look I can't tell you they are intact so the fruit punch made it damn the rumor on the net is that these are terrible they don't look good yeah man fruit punch artificially flavored I didn't know there was a a normal fruit punch natural flavor yeah truth there's",
            "start": 5655.76
        },
        {
            "text": "damn the rumor on the net is that these are terrible they don't look good yeah man Fruit Punch artificially flavored I didn't know there was a a normal fruit punch natural flavor yeah truth there's actually a tree that makes the fruit punch oh those are going to be darling also intact they're in good shape I feel like those I'm calling it right now those are going to be the winner the watermelon that's 9.5 right there okay the second items are six cans of Bush's Grill and Beans a a little while back Colin said if someone sent in Bush's beans to the show that Greg would eat them on camera I didn't know so here you go one of each flavor enjoy that's disgusting did he send a can opener cuz I can go get a can opener oh Southern Pit Barbecue that's extra Smoky right there cooked black bean Fiesta wow it's like it's like Mexico in your mouth Texas Ranchero oh I'm that one Texas T into Texas in your mouth Steakhouse recipe how many are in there how how heavy was this box Bourbon and brown",
            "start": 5707.92
        },
        {
            "text": "Wow, it's like it's like Mexico in your mouth Texas Ranchero. Oh, I'm that one Texas T into Texas in your mouth Steakhouse recipe. How many are in there? How heavy was this box? Bourbon and brown sugar. There you go, B-Man. A little bit of that brown sugar. Smokehouse tradition. M yeah, that's going to be the smokiest so smokiest. I don't, I didn't agree to eat any of these. You should have made it. You should have made a if protest ask the audience. I'm protesting right now. No, if Greg said this on camera, I didn't say this. He said someone he said he said Colin said if Greg said it on camera, everyone tell us. I didn't. This is unusual. This is unusual. I feel like there might be some confusion here. Mhm. He said the bourbon one is his favorite. It also is the OG Bush's Grill and Beans flavor by the way. Okay, I like he use OG and Trill in in this letter already. All right, the third items are two cans of Coke for Colin. Now he says I needed to fill up space in the box and I know Colin loves his Coke. Now I do love",
            "start": 5760.28
        },
        {
            "text": "he use OG and Trill in in this letter already all right the third items are two cans of Coke for Colin now he says I needed to fill up space in the box and I know Colin loves his Coke now I do love Coke you do love Coke you've talked about that how you stop drinking Coke so I just didn't know if it was also since there are cans you don't have to worry about them going flat overnight so so long as you your can I have Fai that you the two lers yeah yeah no I understand the confusion right right I just want to make sure as for Tim and Nick I have nothing else to offer you but my love what what is this person's name Richard Gordon Richard Gordon Your Love Is Enough Love so I enclosed two photographs of me blowing you each kisses good Lord that went from like awesome to a to oh my God a they're actually photographs like printed out from like a Kodak we got to start putting things on the wall well these are going on the wall this is going on the wall this for Nick thank you this is amazing",
            "start": 5809.2
        },
        {
            "text": "actually photographs like printed out from like a Kodak we got to start putting things on the wall well these are going on the wall this is going on the wall this for Nick thank you this is amazing walk up camera get it nice and close here are the Cokes World Cup Cokes of course they are cuz everybody cares about the World Cup now man and he drew a little heart too I in case I didn't know nope not going be able to see that Tim hold yours up I'll zoom in how about that stand by everyone he has a nice kitchen I like the stash there's sign to you're welcome he says There It Is wow this is a crazy ass package that's good Tim okay there's more for P I threw in a squeaky tennis ball oh my God it's so small P's a small dog but it's a little tennis ball I also have a Daschund or Daxton but don't worry it's a fresh tennis ball thank you all guys for what you do you've turned some of my worst days into some of my best with just one video I cannot thank you enough for that hopefully I'll get",
            "start": 5854.36
        },
        {
            "text": "It's a fresh tennis ball, thank you all, Mely for what you guys do. You've turned some of my worst days into some of my best with just one video. I cannot thank you enough for that. Hopefully, I'll get to meet you all someday. Keep doing God's work, fellas. Lastly, Colin, I'll make sure to eat a New York water bagel in your honor. Much love, Richard Gordon at Babby 30009 at Babby Y39. How is Babby formed? Oh, he has a picture of his docs in here. He says, \"Here's a picture of me and my wiener.\" His name is Duke, you know, like the King Baby. So, the picture is not coming out very, very good; it's all dark. I can see it's cute. Uh, PPS asked him if he would deflower Rapunzel from Tangled, the version of her at the end with short brown hair. That version of her is the top of my list. Okay, both of those are good calls. I don't know which one I'd prefer though. Are you guys familiar with no? But I'm more of a brunette fan, so just so here thing Rapunzel has the long blonde hair and I was like yes, and then at the end of the",
            "start": 5915.96
        },
        {
            "text": "know which one I'd prefer though are you guys familiar with no but I'm more of a brunette fan so just so here thing Rapunzel has the long blonde hair and I was like yes and then at the end of the movie it goes away and she has short brown hair and I was like yes yes sir like oh man and also she makes a cameo appearance in Frozen at the does she yeah oh that's right they all did there's a bunch of cameos right well her and some like their car just flipped another Bus full of nuns dead that was a really nice surprise so now we'll have uh not in your **** life if I do that if I eat a spoonful of beans you eat a spoonful of mustard oh my God yeah that's going to have for must it's disgusting I don't no you'll eat anything I'll eat a SP full of ketchup and mustard eat one of the batteries I just bought $5 at the little store I don't think I can eat mustard I don't think I can eat that I'm not convinced not even Smoke House tradition we not this week maybe next week we'll just open",
            "start": 5957.68
        },
        {
            "text": "just bought $5 at the little store I don't think I can eat mustard I don't think I can eat that I'm not convinced not even Smoke House tradition we're not doing this week maybe next week we'll just open up the can and have it permeate throughout the room and just see what's happening we put a little bit like here's what you should do is eat them cold that way it's not like the warm flavor in your mouth maybe that would help a little bit it's still diarrhea and vomit is all it is I don't think it's either of those things this is flavors here dude read me the bourbon flavor what's and brown sugar doesn't that sound delicious it's like a Pop-Tart for adults no that's even grosser you somehow made it grosser I think you're going to be as a Poptart no by the way there's enough there to fill up a small bathtub for you to bathe in if that's if you want to do that instead no I don't want to do anything with these I'm not pushing it on you I'm just saying he eats a spoonful of mustard I'll eat a spoon",
            "start": 5998.88
        },
        {
            "text": "bathtub for you to bathe in if that's if you want to do that instead no I don't want to do anything with these I'm not pushing it on you I'm just saying he eats a spoonful of mustard I'll eat a spoon that's the new standing tradition I really believe that I would it's worse for me than it is for you I believe that you're allowed to believe whatever you want in my heart now we didn't touch on this and I know we're kind of out of time but when you were on your insane like rant of like a lunatic mad man about the World Cup you didn't even touch on the logo of the World Cup I don't have a problem with the logo I mean it looks like it looks like Picard's face palming yes we've all seen this it looks hide it looks like uh hands are coming out and and and dragging the ball to hell that's true that's what it looks like it's terrifying to me I just want you guys to know that I like that the back of these cans are from New York for sure because they have the Six Flags Great Adventure logo",
            "start": 6040.4
        },
        {
            "text": "what it looks like it's terrifying to me I just want you guys to know that I like that the back of these cans are from New York for sure because they have the Six Flags Great Adventure logo on the back beautiful nice well ladies and gentlemen that's The GameOverGreggy Show every week four sometimes five best friends gather on this table each bringing a random topic of conversation for your amusement if you like that pick up the MP3 every Friday over gameovergreggy.bandcamp.com for one dollar if you don't think we're worth the dollar don't worry we don't either so the next following week you go to youtube.com/gameovergreggy and every day one by one we post the topics for your amusement leading into The Big Show sometimes we start on Sunday we keep you on your toes like we're doing this time because we had that extra topic at the beginning so best man we're crazy Kevin Hart you suck uh make sure you get over to DistrictLines.com gameover and buy yourself a new",
            "start": 6084.48
        },
        {
            "text": "this time because we had that extra topic at the beginning so best man we're crazy Kevin Hart you suck uh make sure you get over to DistrictLines.com gameover buy yourself a new t-shirt team fat is hopefully up not look for it very soon pick up the Oreo shirt pick up Callin for President we got a bunch of cool stuff there might be a Tim shirt coming there might be a timir there was the Hella shirt we got another secret amazing thanks for all your support on that guys thanks for going out in general thank you for your support and you know uh I'm sorry Gordon over here Mr. Gordon right that was his full name or was it Gordon something Ricardo no Richard Richard Gord Richard Gord Gord Spanish uh you said you know that we get you through some of your worst days with one video your support every day on Twitter YouTube Facebook everything else gets us through our worst days so thank you for all your positive feedback it has been our pleasure to serve you and for everyone",
            "start": 6126.04
        },
        {
            "text": "your support every day on Twitter YouTube Facebook everything else gets us through our worst days so thank you for all your positive feedback it has been our pleasure to serve you and for everyone who's requested it a lot of requests for that lately really yeah ready mhm set to thank what **** you he just made a Tokyo Drift reference already and I liked it you want to say do you want to tell the audience what we just did you don't even know what happened the magic I know I started to talk and then Jimmy said ready and he said set Jimmy Jiles are everybody ready that's all this is all going to the end of the podcast so they can see how you did this to me that's fine",
            "start": 6168.4
        }
    ]
}