{
    "id": 345,
    "video_id": "LxiPfQJzaH4",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Physical vs. Digital Media - The GameOverGreggy Show Ep. 32 (Pt. 4)",
    "description": "Full Episode Friday! Get it EARLY here! http://gameovergreggy.bandcamp.com\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1405580402,
    "duration": 1017,
    "transcript_chunks": [
        {
            "text": "Tim, yes, what's your topic so usually I like to talk about really stupid things. Yep, today a little nothing special, no different, yeah okay but it's a little less stupid, okay. Physical media or digital media. Oh that's not stupid at all. We're getting we're getting to this point where now everything is digital. You can get day one digital, you can get all this stuff, yeah. But you can also buy stuff in stores. But more and more you can't buy it in stores. You and I are literally on the other side of the table from each other on this point. Yes I know that. And is so weird because the generational gap should be the flip side right? You love Blu-rays, you collect them, you go out and buy them, you actually watch the special features on the Blu-rays, the commentaries all these things you love it. I could I don't want it in my house, I don't want it cluttering up my shelf, I don't even have shelves. I want to be able to stream it wherever I am whenever I am with just one device and that's why I mean I'm I'm",
            "start": 1.1
        },
        {
            "text": "want it in my house I don't want it cluttering up my shelf I don't even have shelves I want to be able to stream it wherever I am whenever I am with just one device and that's why I mean I'm I'm totally if it whenever you are whatever where the year 24 um no but I know I used to think that way like you know when you especially when you produce like uh uh digital media you do have and I still love film and I still love all those analog formats um but I came to the conclusion a long time ago that it's it's one of those things that you just similar like Colin's Kickstarter conversation earlier it's like the more you're sort of you see where it's going to go you just realize that it's going to be a part of our sort of collective mindset here on out and digital is going is the way like digital distribution friends especially never gonna go away is going to be the main distribution path might as well just accept it and move on you don't have to like it but just accept it and move on right",
            "start": 41.04
        },
        {
            "text": "Distribution friends especially never gonna go away is going to be the main distribution path might as well just accept it and move on. You don't have to like it, but just accept it and move on. Right? Yeah, see for me it's interesting because I, I like the collecting of it of the physical stuff. Um, whether it's CDs or movies or games or whatever, but in addition to that, I actually do like archiving digital versions of all the things too. I just like knowing that I have the highest quality. Right? Like what we disagree on is the whole streaming thing. I don't like streaming at all; the quality is really bad. Which is so funny too, cuz I had never really exposed myself to Blu-rays before until I came over to Alfredo's new place to see it. He was like, \"You want to watch Blu-ray?\" I'm like, \"Sure.\" And he put on Predator and I'd never seen Predator on Blu-ray and I was like... Bite-sized pieces; it's been on I watch.",
            "start": 87.52
        },
        {
            "text": "like sure and he put on Predator and I'd never seen Predator on Blu-ray and I was like and I've seen Predator hundreds of times at this point you know bite-sized pieces it's been on I watch it a little bit here and there and I I watch it at least once a year just as a matter of rule um it was amazing I was like whoa this this quality is insanely good I am used to it looking way more degraded than this it opened my mind up yet still no Blu-ray player what's interesting for me is I buy the Blu-rays but then I like to rip the Blu-rays myself I like to buy the CDs rip the CDs myself just knowing that my digital copy is the best it can possibly be right like it is does so much hard drive space like yeah a hard drives are cheap as **** nowadays you had you carry that around with you and that's my biggest thing right is like what I know I I just long for a day when like Netflix when I have to when I can subscribe to like three or four different services and I'm willing to pay the",
            "start": 128.4
        },
        {
            "text": "and that's my biggest thing right is like what I know I I just long for a day when like Netflix, when I can subscribe to like three or four different services and I'm willing to pay the money for it because I'm at that point in my life um cheers to being loaded right Greg I can afford Netflix I9 you know when I was when I was in college or high school I used to steal stuff like I did actually not in high school cuz that was before the internet was but in college I used to download all my music illegally and I download all my programs legally see that's my thing I steal everything but then I buy everything yeah which is so sometimes at the same time weird like I'll buy a CD from Amazon and I'll download it illegally because I know it's on the way but I still want it but I want to be able to make my own copy of crazy to me um but yeah but uh I forget what my point was with that I don't even know where I was going with that I'll pick it up digital only for Greg Miller",
            "start": 167.16
        },
        {
            "text": "I want to be able to make my own copy of Crazy Town, but yeah, but uh, I forget what my point was with that. I don't even know where I was going with that. I'll pick it up later. Digital only for Greg Miller - that's the thing. A long time like I used to collect and I always talk about that. You know when DVDs came out we were on the same page, even though we didn't know each other. We need to have these DVDs; we love these DVDs. I bought so many DVDs. What was your first DVD? Do you remember? Oh yeah, Ghostbusters was my first DVD. Yeah, you never heard the story. Mine was The Matrix, I think. First DVD ever bought, I think. The movie Jesus Christ - mine was the replacement killer starring Chow Yun-fat and Mira Sorvino. Wow, how weird is that? No, we... you... we all have that same run of DVDs. You have the Kevin Smith ones; you had Road Trip; you had Varsity Blues. There's all these goofy ass movies like Jerry Seinfeld stand-up. I had there you go. What is Deal with this thing and so my I had all these things, and then I realized I",
            "start": 206.8
        },
        {
            "text": "you had road trip you had Varsity Blues there's all these goofy ass movies Jerry Seinfeld stand up I had there you go what is deal this thing and so my I had all these things and then I realized I never watched them that I had these on my shelf just taking up space and then you move to San Francisco where you have no space and I immediately started getting I start I sold a whole bunch of graphic novels when I moved here I sold this whole bunch of DVDs and even now there's some DVDs out there that I still have in the shelf that I don't ever plan on watching but I can't bring myself yet to get rid of them like Superman and Justice League that I know but like the thing is I don't bring any I don't bring anything new in I I haven't bought a DVD or a Blu-ray in forever Road House last Blu-ray I bought still haven't watched yeah great love that movie there's a Missouri shirt in it Terry Funk in it it's got everything you need high quality I do have a bad problem of buying them and not",
            "start": 247.44
        },
        {
            "text": "I bought still haven't watched yeah great love that movie there's a Missouri shirt in it Terry Funk in it it's got everything you need high quality I do have a bad problem of buying them and not watching them yeah see I used to I literally used to have and this was the point my wife when you get married they start pointing things out like this and you're like damn it how come I never noticed that before she was like are you aware that you have not one not two but approximately 10 DVDs on your shelf that are still in the cellophane mhm and I'm like yeah I keep them there until I'm going to watch them and she's like you're never going to watch those and even the ones that I do buy I never I don't actually like going back and watching something I own again I like catching it randomly out in nature we talked about this before catch it randomly in nature right you know where or it's natural habitat which is either like oh it's on Netflix now check it out check it out or it's on Fox or FX",
            "start": 282.68
        },
        {
            "text": "Nature we talked about this before catch it randomly in nature right you know where or it's natural habitat which is either like oh it's on Netflix now check it out check it out or it's on Fox or FX it's like sped up and cut out parts of it but I just I if something about owning something like as amazing as a film I just I don't want to own it I just want it to kind of come to me when it when the world wants it to come to me so to speak that's so unique it's really weird very very interesting I I all right so first of all the Seinfeld stand-up that uh I'm going to tell you for the last time funniest quote Nick Greg you might agree might disagree is in the beginning he's like the Tide commercial if you have blood on your laundry or you have blood on your shirt laundry might not be your biggest problem right now I like that one a lot yeah uh but uh I forget is it that one or is his his like comeback one which is the one uh Jerry always makes fun of uh he's driving on the road with",
            "start": 320.12
        },
        {
            "text": "\"problem right now I like that one a lot yeah uh but uh I forget is it that one or is his his like comeback one which is the one uh Greg's always make fun of uh he's driving on the road with a like a couch on top of his car and but he's got his arm over it he's got don't worry everybody I've got it I've got it I'm using my arm uh but I feel like I think Tim's the exception of the rule because he cares about the quality right to me I feel like usually having shelves lined with DVDs are books or whatever is a vanity thing and I think we have to like slowly get over that or whatever I feel the same way I have I have a **** **** ton of books like a metric **** ton of books and like most of most of them a scientific most of them are not even here like I I go to my mom's house and they're just like everywhere I'm like Jesus Christ I have so many books why do I have so many books you know and then a couple years ago a few years ago I started using my Kindle the or the Kindle app on\"",
            "start": 359.76
        },
        {
            "text": "just like everywhere I'm like Jesus Christ I have so many books why do I have so many books you know and then a couple years ago a few years ago I started using my Kindle the or the Kindle app on my iPad and just I buy books all the time I still read just as much if not more it's cheaper and it's more accessible I I wanted to read a book about World War I after playing Valiant Hearts so I just went online looked up some more war one books I'm reading a book about The Road to 1914 700 Pages paid like $8 for it it's brand new downloads to my iPad instantaneously I'm reading it it's all back lit and don't have the light on it's like it's perfect it's I have like experience I actually love reading on my phone now because there's a Kindle app for your phone which of course has been around forever but since I discover things at a snail Pace just discovered and I've been reading non-stop books upon books upon books comic books Tim introduced me he's like dude get on Comixology like you can",
            "start": 401.72
        },
        {
            "text": "Forever but since I discovered things at a snail pace, just discovered, and I've been reading non-stop books upon books upon books, comic books. Tim introduced me; he's like, \"Dude, get on Comixology.\" Like you can download all these amazing things that have sales, and now I'm just constantly reading, which is so much better than what I used to be doing, which was just randomly surfing around stuff on the internet and not really ever discovering anything. Really, it's perfect, right? We don't have all this clutter anymore, and then I'm having the same problem now that I had with my DVD collection. My DVD collection was great from 1999 to 2003; I had everything right, and then I just stopped. So I had like this DVD collection in stasis, caught in limbo time, that went to, like, 2003 because I went to college. You got like \"She's All That,\" and then you stopped. I don't know if I had She's All That; I think part of the last one I bought was Signs.",
            "start": 435.24
        },
        {
            "text": "when to what year to like 2003 cuz I went to college you got like She's All That and then you stopped I don't know if I had She's All That I think part of the last one I bought was like Signs or something like that Signs and And Then There Were None why would you buy that movie I have Signs on Blu-ray children I love I love I love Signs in The Village was my favorite The Village was actually really good and someone spoiled the ending of that for me before I saw it and I was like oh my God son of a **** I never saw it some people were like it's obvious it would have been a cool movie uh but so I'm having the same problem now with my video game collection because you know I have like my GameCube my PS2 my box collection and then I have like a ridiculously amount of PS3 games right like on my shelf and then just a few PS4 games I know slowly I got to get rid of these games because like I'm not going to have that many physical PS4 games anymore I have a bunch of digital PS4 games in fact I",
            "start": 473.16
        },
        {
            "text": "shelf and then just a few PS4 games I know slowly I got to get rid of these games because like I'm not going to have that many physical PS4 games anymore I have a bunch of digital PS4 games in fact I was thinking about I have like a majority of the PS4 games which is like insane there's not that many of them but that was I mean that's your job right but I'm just saying it's so weird like you're keeping up that well they can't last take those and donate them to IGN or something like that maybe I should maybe I and have we talked about that before bringing in our PS3 collection just mark them as I mean this is what I would do mark them as yours like put a sticker on just says Greg or whatever just Mark all of them and then give an IGN and that way you know that if you want to get them back you can go we'll never the plan the plan col and I have kicked around on Beyond before is that we bring in our entire PS3 collection and every episode give away one game to a listener that's awesome",
            "start": 514.24
        },
        {
            "text": "you can go we'll never the plan the plan Colin and I have kicked around on Beyond before is that we bring in our entire PS3 collection and every episode give away one game to a listener that's awesome we haven't done it we talk a big game about it God forbid when I was like hey guys I can you bring in cool stuff to put in the podcast for and dress it you were like yeah and you brought in like a picture of yourself drawn with uh cucumber whoever did amazing but yeah bring you want me to bring in my **** video games and put them in the back put W they look awesome right now the room looks awesome did a good job not like **** here we could do that uh so that's all I'm saying I feel like it's more of a vanity thing for me like eventually I just want to have clean futuristic look to everything none of this clutter anymore it's the same thing with my book like all the books I have a huge bookshelf in my room of all the books I bought since I've been in here so it's like 2007 2011 and",
            "start": 546.8
        },
        {
            "text": "None of this clutter anymore, it's the same thing with my book. Like all the books I have a huge bookshelf in my room of all the books I bought since I've been here so it's like 2007 to 2011 and again this is just caught in time. Here's what I will do for you: I will loan you my wife, you can pretend like you're marrying her. You pretend like you're moving out of this place, and she will do that. She will sit on your bed and just shake her head at the things that she thinks you should let go. All you have to do is hold something up, and she'll say \"get rid of it.\" You put it in a bag, and you take it to Goodwill. I took no, I gave my DVDs away when I moved in with my wife. I took like four bags of DVDs, seven bags of books, and like all my clothes to the Goodwill actually it was the Out of the Closet on California Street. Yeah, just packed them in my car, took him over there, moved in with my house, and I was like \"I have nothing,\" and it is liberating. And you've seen my place; you've been here.",
            "start": 587.72
        },
        {
            "text": "of the closet on California Street yeah just packed them in my car took him over there moved in with my house and I was like I have nothing and it is liberating and you've seen my place you've been over to my place Danielle really subscribes to the notion is like if it's something that we we we don't keep in the house unless we absolutely need it or absolutely find it beautiful like that is her methodology and you're I find this copy of The Village beautiful but I don't need it right because I go this two DVD set of Dogma oh man like the hardest one was I had I think I had the Criterion edition of like Armageddon and it was like in a black box with like two DVDs and I never even touched the second DVD but see I have a problem where I love how that looks on a shelf and that might just be the the young Tim me but no see but I'm I'm with you too it looks so good and like I I'm the type of person that I don't just want to buy the Blu-ray I want to make sure I'm buying the best",
            "start": 624.36
        },
        {
            "text": "be the young Tim Geddes, but no, see, but I'm with you too. It looks so good, and like I, I'm the type of person that I don't just want to buy the Blu-ray; I want to make sure I'm buying the best version of the Blu-ray in the nicest-looking box that looks best next to all my other boxes. In that regard, I kind of love steelbooks. Steel books are beautiful. You have all the Fast and Furious steel collection on my desk, it's awesome, it's pretty amazing. Um, but I mean, I'm with you though on the whole like I like the look of things, and I'm also super drawn to like covers right because the movie covers so like you instantly recognize it; it's instantly like something you respond to. I would've always wanted a room in my house that's like the guy room that has like the original Drew Struzan uh covers for Raiders of the Lost Ark or uh Big Trouble in Little China, and just like see you know, I, I just like I love that; if that were the cover or something, I would definitely",
            "start": 667.48
        },
        {
            "text": "Original Drew Shen uh covers for Raiders: The Lost Ark or uh Big Trouble in Little China and just like see you know I I just like I love that like if that were the cover or something I would definitely want to keep it in my house but it just just gets to a point where you're like M it is gorgeous especially the one on the top right Colin you look amazing you look a little like a football player or a hockey player um but I just you look at it at the same time and I'm like why am I keeping these things one more thing for me to dust and I'm never going to watch these DVDs I'm never going to get around watching that DVD again it's just not going to like replace me colors I'm never going to watch that movie again see the worst thing for me and this is a true thing that I'm like **** why did I even start this is Disney movies because it's like cuz then you got to buy the collector's edition it's only out of the Vault for limited time they have this game on lock with that the whole Vault thing oh the",
            "start": 703.8
        },
        {
            "text": "Did I even start this is Disney movies because it's like, cuz then you got to buy the Blu-ray. It's only out of the Vault for a limited time. They have this game on lock with that whole Vault thing. Oh, the struggle's real, like they've been doing since the VHS days, but now they do it again and again and again. And with the Blu-rays, it's like if you don't get those things when they first come out, like, and those things never drop in price. Disney Blu-rays will always be $30, like just that's just what they are. Unless you miss the Vault time, and then they're $90. Yeah, you have to buy them on eBay or from a Limited Edition store. So, now start flipping Pocahontas right now is good because it's not in the Vault. It's going to be hard for you to find it because that was from last year's run. You got to stay on top of this stuff and it sucks because I spent way too much time doing this and I go to the store with my friends, we buy the Blu-rays, and I'm always...",
            "start": 743.72
        },
        {
            "text": "that was from like last year's run you got to stay on top of this **** and it sucks cuz I I spent way too much time doing this and I go to the store with my friends we I buy the **** and I'm I've only missing like I think three total I'm missing Pinocchio Fantasia those are the only ones I can think of you don't have Fantasia Fantasia is awesome lady in the **** I got that I got I literally have everything else Little Mermaid um those are those are like $90 each if what about the one steam Willie do you have that is that on some Blu-ray but an it's crazy they're almost at the point now where every Disney movie every Disney classic the one do you even go like do you get the ones that are like chip and Dale's Rescue Ranger the movie or something like that The Rescuers oh yeah whatever that no not The Rescuers when they do the random spin-offs the Disney TV shows do you buy those too Aladdin 3 Jafar need's glasses yeah King of Thieves which is awesome and Aladdin's not on Blu-ray",
            "start": 787.52
        },
        {
            "text": "that no not The Rescuers when they do the random spin-offs the Disney TV shows do you buy those too Aladdin 3 Jafar needs glasses yeah King of Thieves which is awesome and Aladdins not on Blu-ray yet Ive never actually seen The Rescuers we should watch this amaz its so good but um they there is a set of the classics that they call the Im blanking on the names right now but I think there are Walt Disney Classics and theres like 52 of them Frozen was the newest one so I buy those I dont buy so does that mean its movies that theyre actually like this is a this is a Disney movie there are theres a designated set of Disney movies I done by Disney Studios proper probably got I do some of the sequels if they were good like Lion King 2 theres Lion King 2 theres Lion King 1.5 does Brad Bird do the voice for those Matthew Bri hell no no I think he does does he really yeah and for Aladdin Robin Williams did not do the voice of genie in the second one but",
            "start": 831.04
        },
        {
            "text": "one and a half does Brad Bird do the voice for those Matthew Briar hell no no I think he does does he really yeah and for Aladdin Robin Williams did not do the voice of genie in the second one but then he came back for the third yeah that's weird he the reason he didn't do the third or the second was because he said that he would only do the first movie if they didn't give his character top billing on the poster and I don't if you guys remember the poster cover Aladdin but he's like he's the biggest entire top part of the thing **** guys so he was pissed but then he was like well well Aladdin's a big deal and then there was the Aladdin cartoon that had a that was going alongside the Hercules cartoon and there was an episode where there's a crossover and that was Hercules is awesome did Steve from Full House do the voice of the main character in Aladdin too because he did the the voice in the of Aladdin in the first he did well it was the same Aladdin I'm pretty sure Aladdin stayed",
            "start": 876.6
        },
        {
            "text": "Steve from Full House does the voice of the main character in Aladdin too because he did the voice in the original Aladdin, and he did well; it was the same Aladdin. I'm pretty sure Aladdin stayed throughout one, two, and three, and the cartoon. He probably got that much work by drinking all your water. Sorry, I don't know. Don't worry, alright? Yeah, you're right there. Yeah, scratching my back. That's the GameOverGreggy show. Everybody, thank you so much for joining us as always. If you like the show, you can pick it up as an uncut, unedited most of the time MP3 at gameover.gr out one by one over on youtube.com/gameovergreggy. Then you go buy a t-shirts at DistrictLines.com/GameOverGreggy. Like this new Team Fat one; it's awesome. I like it a lot. I've been looking at myself in the mirror a lot. I like it a lot. Looks cool, yeah. I did a good job. It's a window. You did a great job. Thanks. Is that what it is? It's kind of this mirror over here; transparent. I can see myself as clear as day in it.",
            "start": 916.72
        },
        {
            "text": "like it a lot looks cool yeah I did a good job it's a window you did a great job thanks is that what it is it's kind of this mirror over here transparent I can see myself as clear as day in it that's that's not hey that mirror hey what point does the window become a mirror when it's 100% reflective rather I think that's that's the opacity over there the opacity on that is probably at a 10% right there that's a that's a window and it's only because of the screen behind it that you can't really see through it I can see your screen really needs to be cleaned you see all the dust on it yeah you can see how Mike left it open all the time and that's what happened what an idiot ladies and gentlemen we'll be back next week until then it's been our pleasure to serve you",
            "start": 969.24
        }
    ]
}