{
    "id": 788,
    "video_id": "weiyVv_5L10",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Alfredo Diaz",
        "Colin Moriarty"
    ],
    "title": "Guitar Hero and Smash Bros. DLC - Kinda Funny Gamescast Ep. 16",
    "description": "With both Guitar Hero and Rock Band coming back, is it too much, we discuss what characters we want to see come to Super Smash Bros, how do video games compare to movies, and what game series just need to stop? (Released 04.17.15)\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1429881462,
    "duration": 5040,
    "transcript_chunks": [
        {
            "text": "Alright, y'all ready? For this? Mm-hmm. Oh my god. What's up guys? Welcome to the first and last ever episode 16 of the Kinda Funny Games cast. I'm Tim Gettys. We got the coolest dudes in video games reunited for the first time and it feels- I shook him into another dimension. He went full-rehears straight to your ex on the cam. I liked that. Man, that's just how cool you are, Colin Moriarty. Well, some might say that. Yeah, you were out in Iceland. I hear it's cold there. It's fucking frigid. Absolutely frigid. Yeah. As the name suggests. Mm-hmm. Yeah. Wait, was it really cold? Yeah, it was fucking freezing. It was horrible. I thought it was the green one there. It was bluffing. I thought Greenland was- Greenland and Iceland are supposed to be backwards. No, I- I mean Reykjavik, where I was, is the northernmost capital city in the world. And uh- It shows. Yeah. Every time you walk outside. And then Greg Miller. Hey! Who must be happy because it's the first time we've seen Colin in",
            "start": 0.0
        },
        {
            "text": "I was, is the northernmost capital city in the world. And uh- It shows. Yeah. Every time you walk outside. And then Greg Miller. Hey! Who must be happy because it's the first time we've seen Colin in like- Colin's back. It's good. A week and a half. I had to eat my yogurt and shame again today this morning and I was like, I remember this world. I remember this day. We're back with your fucking dirty ass. Gross ass fucking yogurt. I do so much for you and I don't get any credit. Unsung Hero Part 2, Greg Miller. Part 2. Unsung Hero, Tim Gettys. And last we have Alfredo Diaz. The Alfredo Plays on Twitter. Alfredo Plays on Twitch. And he's been doing really well on Twitch. Just hit 500 subs. Yeah. We're on the golden nugget showers. Way sooner than I predicted. Thank you. Golden Nugget Showers. 30 things. 30,000 followers? That's insane. A lot of support from the Kinda Funny family and community. They're amazing. That's fantastic. So yeah. Best of all y'all. Y'all doing God's work. Also,",
            "start": 55.0
        },
        {
            "text": "30 things. 30,000 followers? That's insane. A lot of support from the Kinda Funny family and community. They're amazing. That's fantastic. So yeah. Best of all y'all. Y'all doing God's work. Also, just so you know, I can't hear anything so uh- because I have a head cold. Well I'm getting over one so if I'm like really low or really loud I mean it's just- It is what it is. I like that. Is that a head cold song you were working on there? No I was like head cold. I was like that's the thing. Alright cool. You ever heard that? No. You ever had a head cold before? No. Like were you all congested in your head and you can't hear? No. But mostly between that and just a cold. Head cold you're super congested. That's like the defining factor. Cold I feel like you have a sore throat, you're coughing, you're sneezing or whatever. Head cold is all up here. You feel like somebody in like a Nykole commercial. Oh okay. I get what you're saying. Good. I know all about that. I know a lot of things have",
            "start": 96.28
        },
        {
            "text": "you're sneezing or whatever. Head cold is all up here. You feel like somebody in like a Nykole commercial. Oh okay. I get what you're saying. Good. I know all about that. I know a lot of things have happened in the last couple weeks in this world of video games. I don't have a segue from this. I don't have a segue at all. But uh- Hold on Alfred. I'm sorry. Kevin's asking me to raise my antenna. Raise your mic a little bit. Oh that makes no sense. I thought he was asking you to masturbate. Yeah I was like that's not- He's like do you want- Not now Kevin. Oh shit. I forgot I haven't even told you about the game I got for our Let's Play tomorrow. I'm so excited about this. This is great. You want to know just the nutshell recap here? Oh. Nutshell recap. Give us the nutshell recap. Where you succeed by giving cars shifters hand jobs. Sounds thrilling. You and I are gonna play that one. I like that. We're gonna play that one. We're gonna be good. It's a computer game for sure. Nyk's not",
            "start": 128.96
        },
        {
            "text": "succeed by giving cars shifters hand jobs. Sounds thrilling. You and I are gonna play that one. I like that. We're gonna play that one. We're gonna be good. It's a computer game for sure. Nyk's not good at sex games. No he gets all uncomfortable. He gets really weird about it. Nyk talks a good talk about being all sexual and gross but yeah then you give him a game with two figures he banged together to make sex and he's like I don't like this I'm uncomfortable. You're springing stuff on me. Yeah that's me. Although I did watch the How Do We Do It Let's Play we did and I laughed a lot. You know things are good when you watch shit that you do and then you laugh at it. That's my metric for success. I want to tell you then by that metric I wasn't in it but I don't it's rare that I'm not in or around while you guys make a video. I wasn't at the Guitar Hero event. You boys did a fantastic job. I was a very very big fan of your Let's Play. I liked it too. I feel like we did a good job of",
            "start": 170.48
        },
        {
            "text": "or around while you guys make a video. I wasn't at the Guitar Hero event. You boys did a fantastic job. I was a very very big fan of your Let's Play. I liked it too. I feel like we did a good job of well first off I'm not modest at all when it comes to anything. Second off I think we did a good job of like talking about all the new features yeah up in the game. It was informing it having fun. My concern was like when I started I was like are you guys just going to play and horse around but you know you were actually explaining what they had given you like the bullet points beforehand here's what's new about it. You told us all and show it's cool. I've been we've both been at IGN long enough that we kind of know how the events work and all that stuff. So it's like I know we're going to sit down get the spiel do all that stuff. It was fun being able to say like fuck the corporate politics of like having to having to just go through all of the well this this is new and then this is new",
            "start": 214.96
        },
        {
            "text": "down get the spiel do all that stuff. It was fun being able to say like fuck the corporate politics of like having to having to just go through all of the well this this is new and then this is new and this is new. We just literally did a Let's Play. I don't think anyone else did a Let's Play. Which we can see in the views and the reaction the video people really liked it. And it's like the most gameplay I think that anyone else has. It was a great blend. It was like the scene from Ghost but with a guitar. That's really what it was. So the guitar is taking the place of like the clay pot. Yeah. I mean it was that or if it was taking the place of of course the bottle cap when you're trying to move the bottle cap or the penny or whatever. No no. And then it was get off my train. But he's a ghost on the train. Yeah yeah. But but me I've had a lot of fun playing and I think it comes across. And yeah the one thing about the game that I think is really unfair is that it it's really easy to",
            "start": 251.44
        },
        {
            "text": "ghost on the train. Yeah yeah. But but me I've had a lot of fun playing and I think it comes across. And yeah the one thing about the game that I think is really unfair is that it it's really easy to judge just by watching it. Playing it is a totally different experience and that's not some bullshit. I'm just saying now you are awesome because I didn't have a good segue but then you just teed me up for the best segue ever because guess what guys. First topic music music games 2015. There's so many of them. How do we feel about this. Two. Three. Because I count amplitude. The amplitudes. I'm not not letting that count although it shouldn't. Thank you. You know what I'll say about the music game. I didn't think they'd be back this quick. We had had discussions about this when we thought they were going to come back when the rock band came back. We talked about it on Colin Greg live and all these things and it was just like has enough time passed and I was like I don't think so. And then",
            "start": 292.08
        },
        {
            "text": "were going to come back when the rock band came back. We talked about it on Colin Greg live and all these things and it was just like has enough time passed and I was like I don't think so. And then when like it was like rock bands out and then guess what there's going to be a guitar hero as well. That's when I was like we're right back to square one everything's fucked it's going to explode. But after seeing Guitar Hero live I was like oh if Guitar Hero live is different and rock band is the same then finally there's parity there's a reason to own both again. There's a reason for them both to be back at the same time. That's my that's my one thing. I was concerned about them flooding the market too soon but based on a song Guitar Hero of rock bands just rock band and it's like oh OK maybe maybe this doesn't all blow up and kill everybody. Yeah. That's my thing. I'm a huge music game fan like all three of those games I'm super excited for and I'm going to put a lot of time into",
            "start": 331.8
        },
        {
            "text": "maybe maybe this doesn't all blow up and kill everybody. Yeah. That's my thing. I'm a huge music game fan like all three of those games I'm super excited for and I'm going to put a lot of time into specifically compared to how much time I put into most video games like I actually really invest in music games. I don't think we need this much. Well sure. That's it's it worries me that there needs to be all of this and it's like I really wish the only one was coming back. Of course. The thing is I don't know which one we haven't really seen too much rock band for yet. So it's like we can't really judge. But already both of them have things that I really like about them and both of them things that I'm like man I wish you just change this a little bit or I wish that wasn't how it was in my perfect world. It would be one of them and it would just be a platform it wouldn't be called rock band for it would just be called rock band and forever more. It's just adding on top of it. Right. How",
            "start": 363.56
        },
        {
            "text": "world. It would be one of them and it would just be a platform it wouldn't be called rock band for it would just be called rock band and forever more. It's just adding on top of it. Right. How do you add on top of it again. Show me how you add on top of it. You just do this. Yeah. Very good. It's good. But see I think something interesting that came across in your let's play when you were talking about it right is that rock band and then this is last year in rock band right and then the final guitar hero guitar hero you were like they were party games. They had gone from arcade experiences to party games and that was fun. Mainly guitar hero in transition rock band was always a party game right. And so I have a feeling that guitar here alive if it's going to succeed is going to succeed with people who like when it originally came out and Freddie Wong was super into it right. People who want to play it to be challenged to do this to play guitar. That's it. There's no bullshit in it. So",
            "start": 403.7
        },
        {
            "text": "people who like when it originally came out and Freddie Wong was super into it right. People who want to play it to be challenged to do this to play guitar. That's it. There's no bullshit in it. So when it turned out I was expecting when I sent you guys out right. I in my head without getting anything from Activision assumed it was going to be full band the kind of funny team goes and plays all at once. And then when I clicked the video like they're just playing. Oh it's only guitar again or so it seems so far. Yeah. They were very like they made sure they didn't say it was just on just guitar. We asked them and they were like well for now we'll see. Yeah. But I can't imagine them adding other instruments like right. Yeah. Singing at the TV with people booing you and stuff like that. Yeah. Like that just doesn't make too much sense with the game that they created because of how complicated the guitar is right. And then what you're saying is like Guitar Hero 1 through 3 were very",
            "start": 445.44
        },
        {
            "text": "Yeah. Like that just doesn't make too much sense with the game that they created because of how complicated the guitar is right. And then what you're saying is like Guitar Hero 1 through 3 were very focused on guitar songs like songs with crazy solos and the challenge levels and all this stuff. And it was it had this nice curve of you knew what you were getting if you played any song on easy medium hard or difficult. Like that the different button combinations like if it was easy was just three if it was medium it was four if it was above that you're sliding. Yeah. And it's like you knew that going into it and every song was designed around at all moments in the song you're doing something on the guitar. Yeah. And it's like even if the song has like a part that doesn't have a guitar you're doing the synth part because it wouldn't be fun to not do that. Right. But then once they switched to rock band it was entirely a party experience and like there was so many songs like Weezer Say It",
            "start": 484.3
        },
        {
            "text": "doing the synth part because it wouldn't be fun to not do that. Right. But then once they switched to rock band it was entirely a party experience and like there was so many songs like Weezer Say It Ain't So. How fun is that on guitar. It's not. Fuck you it's a great song. Yeah. But it's just like you're just doing and even on Expert it's like this isn't fun. This is just the fun came from playing with your friends being an experience and building a party thing and stuff. So what I was saying earlier earlier when I was like already I'm seeing things that I'm like oh why are you doing this it's like as much as this new Guitar Hero Live is what I always thought I wanted to come back from Guitar Hero it still is trying to be the party game and here's a perfect game for parties and it's just like can you not do that. Couldn't that be a lie though. It seems like that could easily be a lie about a point they're saying right now knowing that watching people play it they're going to be hooked",
            "start": 521.3
        },
        {
            "text": "can you not do that. Couldn't that be a lie though. It seems like that could easily be a lie about a point they're saying right now knowing that watching people play it they're going to be hooked on the guitar again and how crazy can you get with the six total buttons and one strum. Yeah but I mean just like a lot of. Just to put some thought into that I was like I didn't really care for those games coming back and then once that guitar was in my hand I was like oh I do miss this. I do want to play this again. And like I don't know I do I do see them kind of over flooding the market this year but maybe it's just a personal thing like I did the whole rock band thing. I don't want to buy a whole set again because I think I'm going to have a bunch of friends to play with all the time but that's not really how it goes. So I'm just going to buy Guitar Hero and then just do that. That was the thing I took away from that video is that that reminded me a lot of Guitar Hero 2 when I bought",
            "start": 561.3
        },
        {
            "text": "that's not really how it goes. So I'm just going to buy Guitar Hero and then just do that. That was the thing I took away from that video is that that reminded me a lot of Guitar Hero 2 when I bought Guitar Hero 2 when I was living in Micah's spare room and I just moved here and had a little CRT and just sat there and played all by myself and I was fine with that you know what I mean. Whereas rock band is a commitment. Rock band buying in the new rock band needs to be that Colin and I have agreed that we are playing rock band in the living room at least twice a week or something with the girls or whatever like we're getting use out of it so it isn't like when I bought DJ Hero and literally played it one night and never touched it again. You know DJ Hero was kind of whack though. The was a great idea. The song mashups are awesome. The thing I'm most fascinated about this these music games coming back is I personally am very excited about it. We have to remember about with rock band and",
            "start": 602.96
        },
        {
            "text": "great idea. The song mashups are awesome. The thing I'm most fascinated about this these music games coming back is I personally am very excited about it. We have to remember about with rock band and Guitar Hero is that the games were never bad. It was just that we were we were tired of them. So the formula still works and I think that you know you Greg was I think a little bit more surprised than of them coming back so soon in that also that they would be available this year and maybe think that more space needed to be had. But I don't agree. I'm actually like kind of excited to play them especially rock band. The more interesting thing is that two publishers Activision and EA have stumbled upon the same thing in the same year to bring back these franchises which is not a coincidence I don't think because I don't think they knew what the other was doing. I think that they were reading probably similar research market research maybe using the same firms to discuss internally whether",
            "start": 639.08
        },
        {
            "text": "don't think because I don't think they knew what the other was doing. I think that they were reading probably similar research market research maybe using the same firms to discuss internally whether these games could come back and they could be commercially viable and then struck at the same time. I think it's good that they're both coming back at the same time because the cream will rise to the top. If one came back undisputed I actually think would be kind of lame because the narrative in 2008 2009 was both those games going up head to head for a couple of years and which one was better and which one people preferred. So I'm interested to see like how they how they they go against each other and how the market reacts. I think these games are going to do very well. And I think that there's there's question that need to be answered backwards compatibility is probably not going to be impossible to new guitar here. But with rock band it should be our hope hope it is. I think they said",
            "start": 675.9
        },
        {
            "text": "there's question that need to be answered backwards compatibility is probably not going to be impossible to new guitar here. But with rock band it should be our hope hope it is. I think they said that it was. And it absolutely should be. Someone tweeted at us yesterday saying like oh no backwards compatibility is already a thing. I haven't heard that myself. Yeah I mean I'm not I'm not up on it at all. But that's not the fun I want to look to the Internet. But like that's going to be pretty important with rock band. And I agree with you games as a platform is kind of a smart idea and not only with music games with lots of games we talk about Call of Duty and Gran Turismo in the past. And it would be nice to do those kinds of things as well. But a lot of people think that one is being reactionary to the other and I think that's kind of a foolish thought because the licensing agreements that go into these games and all that kind of stuff take lots of time and lots of lawyer muscle and",
            "start": 713.96
        },
        {
            "text": "to the other and I think that's kind of a foolish thought because the licensing agreements that go into these games and all that kind of stuff take lots of time and lots of lawyer muscle and all that kind of stuff. So I just think it's a coincidence that they were both ready this year and I'm sure that EA wishes Activision wasn't going in Activision wishes EA wasn't going. But as a consumer we will all win because they will both have to be better because there will be competition on the market. You know going back to it like looking back at you know 2007 through 10 when these games were coming out and being a thing was there a clear winner because I know that a lot of people look like somebody I think rock band is the clue. I know that like Mike Drucker yesterday tweeted and he said that harmonics is to Pixar as Activision is to DreamWorks. Yeah. And it's just like I get that as an overall statement but it's like the guitar games did they have them to ground real quick. Hold on before",
            "start": 747.0
        },
        {
            "text": "is to Pixar as Activision is to DreamWorks. Yeah. And it's just like I get that as an overall statement but it's like the guitar games did they have them to ground real quick. Hold on before we jump let me put it to the finish according to the never on Wikipedia harmonics also promised compatibility with the over 2000 existing songs that were released as downloadable content for prior installments along with the possibility of backwards compatibility with guitar and drum controllers designed for the PlayStation 3 and Xbox 360 versions. Although new PS4 and Xbox One specific hardware is also in development. Yeah the problem with the hardware is it's probably going to be easy for them to hard code into the games it's going to be difficult for the consoles to deal with that hardware. Yeah you know I mean. So so now back to this question. Here's the problem in why rock band has looked to be the winner of that fight last time around. I'm sorry I'm getting ahead of myself in the analogy.",
            "start": 780.54
        },
        {
            "text": "you know I mean. So so now back to this question. Here's the problem in why rock band has looked to be the winner of that fight last time around. I'm sorry I'm getting ahead of myself in the analogy. Guitar Hero gave up the ground. They switched their model. They changed to be a full band thing when they saw how successful rock band was. If they would have said fuck it and stuck to being Guitar Hero and that's it then maybe there's you know well this is that and it's very similar to like with the PlayStation 4 Xbox right. Xbox is like we're going to be always online we're going to do all this stuff that PlayStation 4 hey what's up we're not we're 100 bucks cheaper in this and Xbox immediately had to go well we take it all back we understand you don't like that sorry sorry sorry and that immediately puts that mark on you right that you're like you're reactionary and you're not in it to win it you didn't have you didn't have a vision. It seems like harmonics has always had a vision for",
            "start": 829.02
        },
        {
            "text": "puts that mark on you right that you're like you're reactionary and you're not in it to win it you didn't have you didn't have a vision. It seems like harmonics has always had a vision for rock band right. You talk to those guys those developers now granted you're talking about harmonics versus Activision right where Activision is very much we're Activision. Harmonics is able even though they're published by someone to get out in front and be like we're the people behind this we love music here's this we're putting our developer or our staff's bands into the game is then like we're gonna have DLC every week and like they like showed all this TLC to that franchise you know what I mean and it does become one of those interesting things with it where since Guitar Hero was first and rock band was second I think we get into that echo chamber a bit where I think to us to inside the industry rock band was what it was all about we all loved rock band I can't remember the number of IGN rock",
            "start": 867.18
        },
        {
            "text": "was second I think we get into that echo chamber a bit where I think to us to inside the industry rock band was what it was all about we all loved rock band I can't remember the number of IGN rock band parties we had and that wasn't limited just to IGN that was every other thing but mainstream I remember when my friend she hit me up she's like hey for my husband he wants Guitar Hero but should I buy him rock band I had to explain buy him what he wants I know mainstream I think Guitar Hero has more cachet than rock band but rock bands the better game one of those kind of arguments you know. It gets so interesting because I mean at the end of the day rock band was Guitar Hero at one point like one and two were made but like the lineage goes Guitar Hero one Guitar Hero two rock band and that's where harmonics went and then Neversoft did Guitar Hero three and then I don't even know who the fuck made the rest of it yeah there was World Tour the Legends of Warriors of Rock I don't even",
            "start": 901.7
        },
        {
            "text": "that's where harmonics went and then Neversoft did Guitar Hero three and then I don't even know who the fuck made the rest of it yeah there was World Tour the Legends of Warriors of Rock I don't even fucking know band hero there was band hero had Taylor Swift in it yeah that's true and then there was like a million of the like random like Aerosmith right the 80s Beatles Beatles was rock band I apologize so it's like but that's what I'm saying like I feel like fan hell we kind of get the industry gets stuck at all rock bands the winner but I don't think it was that clear in terms of you're wrong let me know the sales I don't know I don't know the sales numbers by me in terms of quality I think I think one was clearly the winner the bigger the bigger thing with guitar that with quality though I mean quality they were both my mind I do like I think I think that the harmonics is the developer that pioneered that space they went in a different direction and made it applicable to you know",
            "start": 943.42
        },
        {
            "text": "I mean quality they were both my mind I do like I think I think that the harmonics is the developer that pioneered that space they went in a different direction and made it applicable to you know to rhythm in addition to treble so you know so I think that that was a revolution that they patted down and did first and I think that it worked out pretty nicely for them I mean I was not interested all in Guitar Hero if the rock band came out and we played a lot of them I mean what a lot of people don't know or don't remember if they weren't a long time IGN readers and Greg and I were there when it was happening but even before us is that Guitar Hero largely succeeded because IGN like loved that game and they beat the drum hardcore for the original it was Alan is cave everybody out there rocking yeah a lot of people like don't know that that because our here was somewhat under the radar until like it found evangelists in the media that really liked it and talked a lot about and wrote a lot",
            "start": 983.58
        },
        {
            "text": "yeah a lot of people like don't know that that because our here was somewhat under the radar until like it found evangelists in the media that really liked it and talked a lot about and wrote a lot about it and and so Guitar Hero did really well and so that like I think that you have to follow like the the core lineage like you were talking about about who was making these games and I think that you know rock band stole the thunder in my personal circles of friends I mean that was the same thing you know because you also invested in these instruments and so like that and so you have to go you know some of them are you know cross compatible I guess but ultimately you had a kind of go where you were spending your money as well and these were such investments the bigger thing is that if there is if there is backwards compatibility with the new rock band and I'm not confident there will be because I don't think it's going to work is that you can go to your you know your local Goodwill or",
            "start": 1027.94
        },
        {
            "text": "is if there is backwards compatibility with the new rock band and I'm not confident there will be because I don't think it's going to work is that you can go to your you know your local Goodwill or whatever and just pick that shit up for cheap right now like the minute that's announced you know like good will make a move that's making bank off them three ninety nine guitars I just remember rock band kind of doing their thing and then I fell off into that boat because Guitar Hero was doing like Van Halen and like some other weird stuff and I was like these are I mean like I was like I respect but I mean yeah it's like our generation generation when it really came on to wasn't Taylor Swift yeah did it for us that's why I remember I don't know for me I was like yeah rock bands the way you know yeah I don't know it's it's really interesting to me because I get all of that and it makes sense because yeah when you invest in rock man you're just going to keep going that path and it's like",
            "start": 1065.14
        },
        {
            "text": "know yeah I don't know it's it's really interesting to me because I get all of that and it makes sense because yeah when you invest in rock man you're just going to keep going that path and it's like then when a year I think it might have been two years later that Guitar Hero decided they're going to add their whole band and whatever it's like everyone's like well I'm not I already have this and I already don't use it so I'm not going to get that so it kind of had a bad taste but when you played the games they were great games like if you're going to review the games I don't think that rock band was better than Guitar Hero even like when it was the full band setup or whatever and like the drum set was awesome with the I remember it was four or five it had more than the other one yeah like three toms or two toms two cymbals and it was cool like it and three eleven guitar here but the the yeah I think largely the performance on them were equal because I mean we used to play them all the",
            "start": 1105.16
        },
        {
            "text": "three toms or two toms two cymbals and it was cool like it and three eleven guitar here but the the yeah I think largely the performance on them were equal because I mean we used to play them all the time at IGN in the old demo room in the old office but I think a lot of it has to do with like the songs that you prefer to and there was cross-pollination but not necessarily so I mean it's like about the yeah it was it's an expensive game it's a fucking it is an investment if you spent a hundred dollars on DLC on rock band you're not going to suddenly go play Guitar Hero so it did kind of send you into a certain niche now that I know rock band songs will work with and I don't know how they license that out but they figure it out the rock band old rock band songs will work with the new rock band I mean that's fucking huge yeah I mean that's like that's like pretty much sold me on a rock band already yeah it fucks me over there because I want to play on PlayStation 4 but I play on a 360",
            "start": 1140.66
        },
        {
            "text": "band I mean that's fucking huge yeah I mean that's like that's like pretty much sold me on a rock band already yeah it fucks me over there because I want to play on PlayStation 4 but I play on a 360 last gen so now I have all I have this giant library of 360 music maybe I can somehow redeem Eric Pope get on that figure out how to make that happen that'd be nice I don't think that's beyond the rubble possibility yeah yeah that's interesting I never think about that I have hundreds of songs for rock band I think it's pretty much gonna push me there into that so that's what I mean now it does not even question though like because Guitar Hero is different yeah that's the other thing too is that Guitar Hero is not is not what I mean it looks cool it's not what I want to play I like you know I what I hope with rock band like when they really flesh it out and I've talked about this before like I'm a musician and I like playing these instruments and I think it's fun I think playing drums on",
            "start": 1179.62
        },
        {
            "text": "what I hope with rock band like when they really flesh it out and I've talked about this before like I'm a musician and I like playing these instruments and I think it's fun I think playing drums on these on these songs on expert is largely indicative of the way you would really play a song with you know obviously not a real kit the thing that used to bum me out is bass because bass is really fun to play and I felt like it was kind of an afterthought like I play bass and I think it's a really fun instrument I'd like for them to make a different bass module like a different instrument that is different guitar yeah like that has maybe a fewer fewer frets and something that you would pick instead of well like you could pick or you could like you know or you can you know just play just play it differently just make it different as opposed to like oh who wants to play bass now and it was always like the thing you don't want to play and I'm like the bass is fun like bass like there's",
            "start": 1215.9
        },
        {
            "text": "play it differently just make it different as opposed to like oh who wants to play bass now and it was always like the thing you don't want to play and I'm like the bass is fun like bass like there's fucking like oh I was listening to Space Hog in the meanwhile you know that song in the meantime or the meanwhile or the mid 90s song give me a few bars I can't even sing right now I'll bring it up I know it's funny sometimes in your conversation here you talk like you're at awake it's really it's really awesome I can't I can't tell you it's really sad I can't hear myself in my throat hurts but there's like awesome bass lines and I don't feel like they explored the rhythm as much as they could have considering you know the implementation of bass because drums did it so nicely it was just like it was a stepchild of the guitar and so I could play bass on hard yeah I'm doing something I was always like who wasn't good oh yeah yeah okay wow wow wow wow also said in the song is like this is",
            "start": 1251.18
        },
        {
            "text": "it was a stepchild of the guitar and so I could play bass on hard yeah I'm doing something I was always like who wasn't good oh yeah yeah okay wow wow wow wow also said in the song is like this is something great you know it's like great song and like fucking awesome little walking bass line in there so I would just love for them to yeah I always jumped on the bass so that gets fun but it didn't do anything to differentiate itself from guitar because everyone thinks guitar is such a fucking dominant instrument for whatever reason so like it would have been cool to to have that and I hope that they do that that was like one of the big problems with both of those games that's my biggest problem is that the rock band guitar sucked ass yeah I mean that you mentioned it when we got away from it was the equipment quality or whatever yeah a thousand percent I will give you the grant I would totally tell you that yeah Activision had it fucking down in a guitar those rock band guitars were",
            "start": 1290.18
        },
        {
            "text": "it was the equipment quality or whatever yeah a thousand percent I will give you the grant I would totally tell you that yeah Activision had it fucking down in a guitar those rock band guitars were garbage they're fucking garbage and like I don't know why they switched to the like it's like a flicker thing instead of like a there used to be way more way more like the whole the first kind of it was all much the buttons were mush in this yeah this from was must you could use the guitars on the other game right yes and that's what I that's how much we love the other one I forget which one it was I guess it must have been that first gen rock band one versus guitar hero 3 where I block guitar hero 3 just for the guitar well yeah the guitar hero 3 the guns and roses whatever one that was guitar hero 3 right yeah what had the Guns N' Roses guitar I don't I remember that was the black guitar and it was the first wireless yeah yeah that was the fucking best well the first wireless for all of",
            "start": 1327.24
        },
        {
            "text": "hero 3 right yeah what had the Guns N' Roses guitar I don't I remember that was the black guitar and it was the first wireless yeah yeah that was the fucking best well the first wireless for all of those a wireless one on a Xbox shut up 360 for guitar to no one likes you yeah pretty sure anyways alright I'm excited for fucking I mean we can all agree the the most the best rock band was rock man through DS with your little accordion I don't give a shit which one it was I'm just making fun of your vast library no shit I fucking enjoyed this shit out of the guitar hero DS game it was great you must been a cool kid I was strumming strumming my shit right here so we're in the same thing good it was fun what up Craig Harris rest in peace hi guys second topic smash bros DLC so mu to people are getting him today as the day of recording this you see me you're indignant about it because they're not getting him for the right reason what's happening it's like YouTube no they're getting people are",
            "start": 1364.24
        },
        {
            "text": "him today as the day of recording this you see me you're indignant about it because they're not getting him for the right reason what's happening it's like YouTube no they're getting people are getting for the right reason I just fucked up as people know out there because I've talked about this before if you wanted me to you had to like register your Wii U and your 3ds codes and you get him like a week early or whatever and then otherwise we have to buy him next week or in two weeks okay I never thought that they would have given them early and like I forgot it was like all the last day to registers tomorrow and I was like I don't have to go home to get my two coffees do all this I was like I don't want to do any of that so I'll say I'll just buy it for five dollars when it comes out and then it comes out later I'm like oh well I made a bad mistake I screwed up so I don't got mu to I don't really care about mu to though I didn't really use them in melee at all but I want new smash",
            "start": 1419.52
        },
        {
            "text": "then it comes out later I'm like oh well I made a bad mistake I screwed up so I don't got mu to I don't really care about mu to though I didn't really use them in melee at all but I want new smash bros characters excuse excuse to play again forces us to play again and I like that yeah for what character you want right yeah what's going on so they announced me to way back in the day like hey before the game came out then recently they announced Lucas is gonna be the next character coming in June coming back from brawl and now there's this thing like oh yeah for the next characters we're gonna let you vote for whatever character you want and originally people were like oh just Nintendo characters and then Nintendo was like no any game character whoever the hell you want vote for it and the what's interesting to me is the voting is open until October that's a long-ass time so they're getting a lot of data here that's interesting to me because it's like why why wait that long like why",
            "start": 1452.16
        },
        {
            "text": "what's interesting to me is the voting is open until October that's a long-ass time so they're getting a lot of data here that's interesting to me because it's like why why wait that long like why wouldn't they just you know put out something a little earlier than that because if mu to isn't April Lucas is July I mean I guess October is the next thing but then that wouldn't make sense they will be making all these yeah I mean they'll probably be like it's not like it's sorry there's probably other characters too yeah that's true too hmm but yes I mean like it's not a public facing vote right like you cast your ballot and I never know and it just goes out yeah out of there they probably have the agreement boxed up already exactly for tails yeah that's what I think it's like I don't think that they're actually even looking at the votes because they're just like doing this to cause people to talk about it and oh my god are people talking about it like yeah it's one of the top neo gaffer",
            "start": 1491.72
        },
        {
            "text": "they're actually even looking at the votes because they're just like doing this to cause people to talk about it and oh my god are people talking about it like yeah it's one of the top neo gaffer it's every day is talking about what Smash Bros character do you want and like we get tweets all the time what characters do you want who are you voting for help petition to get this character and also I'm like holy crap people are taking this really seriously yeah it's cool people care about Smash Bros I noticed so my question you guys is what characters do you want in which characters do you not want in and who do you think will get in I think you have a lot of insight into this I wish that they would remove half the fucking characters are already in the game and put like but the the problem with this with it with the the roster as it is is there's just a lot of just these fucking like it's like all these fire them characters okay so I like they're all the same you know I mean it's just",
            "start": 1540.52
        },
        {
            "text": "with this with it with the the roster as it is is there's just a lot of just these fucking like it's like all these fire them characters okay so I like they're all the same you know I mean it's just like dude with cloak and sword it's like oh that's fascinating so there's there's another thing that I forgot to say there was another rumor that dropped a couple days ago since because the Mewtwo DLC is coming there's a patch that was released for Smash Bros people got in kind of hacked all the info and found a bunch of shit the planet yeah and like you know people do this all the time when games come out specifically for fighting games and games that kind of like that's how every PlayStation all-stars game character yeah that's the best that's it was all in there oh god and uh you know back in the day brawl was hacked and people found that there was or melee was hacked originally and we saw that there was like day-to-day like files in there and then brawl was hacked later and it was",
            "start": 1573.04
        },
        {
            "text": "in the day brawl was hacked and people found that there was or melee was hacked originally and we saw that there was like day-to-day like files in there and then brawl was hacked later and it was found that there was a Dixie Kong and um Mewtwo and one other character and then now that it's happening here there was this rumor that Ryu from Street Fighter and Roy from Fire Emblem good Roy let's get Roy back in there fire emblem character number seven who uh who he was in melee we're coming back and then those rumors have essentially been like squashed and just the total bullshit yeah if Roy ever came comes back to Smash Bros game I'm gonna be shot he was my main in melee and I fucking loved him but yeah if he came back that would make no sense because then there'd be three of the exact same characters too much man there's and and I just I respect Fire Emblem I think it's fine I just don't understand like why these are it just seems a little uninspired I feel like this roster for as big",
            "start": 1611.8
        },
        {
            "text": "characters too much man there's and and I just I respect Fire Emblem I think it's fine I just don't understand like why these are it just seems a little uninspired I feel like this roster for as big as it is is a little bit boring and I think that it would be cool for them to start really chasing some more third parties but I also think that there are first party characters that that could be in the game that aren't I mean I'm really still confused why ice climbers aren't in the game and I would like you know ice covers were my main and I and I enjoyed playing as them and it's a little and I know why like they couldn't make him work on 3ds and so like that's like which is so funny 3ds is like so under power that I can't use the ice climbers I was like all right that's an interesting issue to run into but the character that I've wanted for a long time that I talked about is that I think dr. wylie would've been a cool character and this is and this is before even Megaman was in the new",
            "start": 1667.44
        },
        {
            "text": "to run into but the character that I've wanted for a long time that I talked about is that I think dr. wylie would've been a cool character and this is and this is before even Megaman was in the new one when I played brawl and Pokemon trainer was in it I was like this would be an awesome way to do dr. wylie to keep him in the background and then he writes some robot masters to fight for him I think would be really cool so that's one of them and and I I like the more so like like what snake was in it it's like cool to have more serious character I wouldn't want a character like Ryu in there whatever I would like to keep it as cartoonish as possible unless it's in the Nintendo universe then you can have you know Captain Falcon or whatever like more humanoid characters but I can go on and on about the characters I actually want in the game Simon Belmont yes I'm Belmont would be would be extraordinarily awesome or alicard or Dracula or whoever if you want to get like really nerdy get",
            "start": 1702.84
        },
        {
            "text": "on about the characters I actually want in the game Simon Belmont yes I'm Belmont would be would be extraordinarily awesome or alicard or Dracula or whoever if you want to get like really nerdy get cypher in there another more obscure Castlevania character but that would be pretty cool and I mean when you when you explore like the first parties or the first party kind of content they've done a nice job of exploring like getting the villager in there even like Wii Sports trainer or whatever but I I do wonder there's no one from StarTropics in there for instance or like they like they can go deeper and and and deeper and I and I would like for them to do that but the roster is already very big but I wish that they would give a thing like which characters don't you want and then they just take like five of them out you're so funny I would I would love for them replace who do you want replaced like here's I was I was actually thinking about this the other day I've since it came to Wii U",
            "start": 1737.2
        },
        {
            "text": "like five of them out you're so funny I would I would love for them replace who do you want replaced like here's I was I was actually thinking about this the other day I've since it came to Wii U and 3ds I've not seen one single solitary fucking person plays one character if you could tell me who that character is I'll be I'll be impressed because I don't even think about them and it's that and it says everything why is Olimar in this game no one plays as him no one people have not seen any fucking person with any of the people we've ever played oh we don't yeah we just don't play as him boring he's different I watch videos too and I know and I have seen people use them effectively but I'm like this guy like come on man I get it get him out of there it's just get him out of there that's so funny the Fire Emblem thing is weird like I can't believe there's that many characters in it but it all comes down to Sakurai he's a big fan of Fire Emblem so he wanted to like support it and like",
            "start": 1778.2
        },
        {
            "text": "so funny the Fire Emblem thing is weird like I can't believe there's that many characters in it but it all comes down to Sakurai he's a big fan of Fire Emblem so he wanted to like support it and like stuff like in a lot of ways Smash Bros made Fire Emblem in America like I wonder if the franchise would have ever even come here if it wasn't for well okay it made a lot of curiosity I mean that's the brilliance of the marketing angle of Smash Brothers generally it's just you know people are exposed to this game don't know who these characters are if they're not isn't into it as we are and then they and they go and explore so it is a nice way to do it but they didn't have to do with like all these characters it's like just doing one is only I just being like here's you know not I don't need the entire fucking cast of every Fire Emblem game and that's only one Fire Emblem character that didn't need to be there and that's Lucina because her and Martha identical and she could have just been",
            "start": 1821.68
        },
        {
            "text": "entire fucking cast of every Fire Emblem game and that's only one Fire Emblem character that didn't need to be there and that's Lucina because her and Martha identical and she could have just been a costume all especially because they do costume all in this game so that never made sense to me but besides that Lucina Ike Robin are different ass characters I'm not saying they're different I'm just saying that they are they all come from the same universe and they're just cloaked people with you know that are boring I don't know I like them I think they're pretty it's such a cartoonish game they I think they those characters stand out as like being totally sterile and boring like and I'm not talking about the way they play or anything I'm just saying that like King day-to-day is like a funny fucking character you know like Shulk makes a lot of sense in this game I think it's a really brilliant move how does Shulk make more sense than the Fire Emblem guys cuz Shulk is from a new game that",
            "start": 1855.76
        },
        {
            "text": "fucking character you know like Shulk makes a lot of sense in this game I think it's a really brilliant move how does Shulk make more sense than the Fire Emblem guys cuz Shulk is from a new game that they wanted they want to we were just talking about it they want to advertise and I think that's a great other when I found out he was in the other thing that's awesome like they that's a great idea you know so get another Xenoblade character in there someone that as opposed to all these Fire Emblem dudes it is just funny I mean the game is also made for you know Japanese audience as well so we have to keep that in mind yeah and speaking of another Xenoblade character and dr. wily and stuff they did also with the Mewtwo update you can have different me fighter costumes and outfits and shit and one of them's proto man one of them's Mega Man X and one of them is another Xenoblade character that's all cool but it's like yeah whatever whatever no one uses me fight me snake back I had fun with",
            "start": 1900.24
        },
        {
            "text": "one of them's proto man one of them's Mega Man X and one of them is another Xenoblade character that's all cool but it's like yeah whatever whatever no one uses me fight me snake back I had fun with snake he was funny he was a funny character I just don't think he fit it was just weird no it was weird so we need with any me cartoony characters I would like for that I mean or like just a cart a character with a real Nintendo heritage or like Castlevania or or a more cartoon I mean I would want some sort of you know like I don't want to say a homogeneous feel but something of like that feels like like when you use to one character the other it's like a parallel like okay I'm assuming you know from the same universe as I was like Kirby versus snake like what the hell is this I thought we were just having fun and tossing stuff out because I was gonna say you know I'm not gonna these are not by the way that's my that's what I'm doing it's not what it makes sense I think it does feel like",
            "start": 1937.64
        },
        {
            "text": "just having fun and tossing stuff out because I was gonna say you know I'm not gonna these are not by the way that's my that's what I'm doing it's not what it makes sense I think it does feel like one world and like even if they are different ass characters like snake and Kirby it's still like I never looked at that and go this is there's this doesn't mix this is weird I'm like all right I always thought was a little weird I mean snakes weird to me snakes weird because of the other thing you said about it not having a Nintendo legacy well so I put twin snakes naked but that's just exclusive if I'm just going like the snake route be like snake Master Chief Gordon Freeman if I'm going like the this route the excess of it all is route maybe like trying to think of like an X-box could toss in a character blinks no I don't want to blink I was gonna say I mean so I was gonna originally say Batman Batman would be awesome you'd win that to get back conquer but then now I would say legit",
            "start": 1981.2
        },
        {
            "text": "in a character blinks no I don't want to blink I was gonna say I mean so I was gonna originally say Batman Batman would be awesome you'd win that to get back conquer but then now I would say legit legitimate thing based on this criteria we shovel night yeah somebody and I do that I would fit and look great and I think I have a I have a feeling shovel nights gonna be in this game which would be awesome and that is a great where do you feel a great example right my boss and I feel it deep in my balls deep in my loins no I just I feel like you just have the kind of the aesthetic of the game matters I like that seeing was in brawl but I was weird it was fucking weird I was like this doesn't make any sense Metal Gear does have a Nintendo first pedigree in the sense that Metal Gear was it was an MSX game first but then it was out in the ass and and that that made sense but you know the bigger thing was that when Nintendo clarified like any game character I was like this is exciting because",
            "start": 2019.44
        },
        {
            "text": "MSX game first but then it was out in the ass and and that that made sense but you know the bigger thing was that when Nintendo clarified like any game character I was like this is exciting because it got my mind going of like are the are there are the other first parties smart enough to go to Nintendo and be like you can use any of our characters because if like that would be brilliant take all the assets from PlayStation yeah boy if so if so just don't and actually go get crashed but if Sony was like you know if so it would be really smart for Sony to be like go and use any of our characters like anyone you want if you want to use like it doesn't make sense like again Drake doesn't make sense they're gone like yeah like you sack boy that would make he would fit perfectly it's great or spike and like he's not relevant Sackboy would be like you know and that would be brilliant and I was wondering it's the same kind of question we had I had with Minecraft when Microsoft bought Mojang",
            "start": 2063.64
        },
        {
            "text": "spike and like he's not relevant Sackboy would be like you know and that would be brilliant and I was wondering it's the same kind of question we had I had with Minecraft when Microsoft bought Mojang which was is my is Microsoft going to be smart enough to publish this on all the platforms and at the same time you have to wonder is is Nintendo Microsoft smart enough to be like or is Sony Microsoft smart enough to win Nintendo be like you know our arsenal of characters is open for you to use in your in your excellent fighting game that is very popular and will do nothing but engender goodwill amongst your audience if we let you do that but the lawyers will probably freak out but that's what I got really excited about cuz I assumed to it would be like oh you have to use a game from that played on the Nintendo hardware or something like that but when they said no I'll believe it when I see it though I feel like they're just saying that because that just sounds like such a bullshit",
            "start": 2103.0
        },
        {
            "text": "played on the Nintendo hardware or something like that but when they said no I'll believe it when I see it though I feel like they're just saying that because that just sounds like such a bullshit statement like there's no way that they're gonna do that your hype statement yeah right like there's like that to me is just further proof that no one's even looking at the result I'm gonna say when you compare what you're actually getting in the ballot box yeah yeah I put Colin it's my it's my thing you literally write what if that happens and it's huh what if that happens that'd be amazing Colin I don't yeah it's one inspired it's it's unlikely that that they would do it but I think it's more likely than ever considering the the way the platform holders kind of talk to each other and deal with each other now we were talking about on colony Greg live today about how you know Phil Spencer tweeted congratulations to Sony and from in the shoe hey and everyone when blood-borne past a million",
            "start": 2136.48
        },
        {
            "text": "each other now we were talking about on colony Greg live today about how you know Phil Spencer tweeted congratulations to Sony and from in the shoe hey and everyone when blood-borne past a million copies it just seems like they're there there's not too much salt between these guys anymore like they used to be and you know so if you can get you know a character like Jack and Dax or something in there like that makes sense and that's cool to do I don't think anyone Microsoft has would actually make any sense at all in there but there are only a few characters that Sony what would make sense when you said Microsoft oh I guess and rare oh yeah my god thing that'd be really interesting I don't know how the hell it would play or whatever but I'm sure they could figure that out that'd be interesting and then people be like why isn't this on Wii U yeah yeah well too late now yeah I feel like there's a lot of characters that make sense like a Bomberman Bomberman Simon Belmont Rayman was a",
            "start": 2175.36
        },
        {
            "text": "and then people be like why isn't this on Wii U yeah yeah well too late now yeah I feel like there's a lot of characters that make sense like a Bomberman Bomberman Simon Belmont Rayman was a rumored leak for a while and it's like he doesn't really have the history but then when you look at like the Wii U I guess with like legacy and um origins origins and yeah which legends and origins yeah they're not like is yeah um I guess he has something there and he could fit in the franchise like he fits in the world for sure you know so that'd be cool I don't know who else I would want I do want Colin in a cloak though if he's in he needs to be a big sword and a cloak and make me boring and yeah that'll be good right in there with the other Fire Emblem characters I was thinking there were some other guys too like fuck what was I I was thinking about this not too long ago oh we were talking about Toad like that was our not told Wart from Mario 2 like that would be awesome you know to have like",
            "start": 2211.08
        },
        {
            "text": "guys too like fuck what was I I was thinking about this not too long ago oh we were talking about Toad like that was our not told Wart from Mario 2 like that would be awesome you know to have like a guy like Ward in there there's just Berto be funny or any like Mauser or any of the like Fry guy like there's just like certain random ass characters they can put in there they have to it's cool that they want to open it up it makes them look very democratic I think that they would be wise to just go back into their archives and see like what what they're missing because they're missing a lot I was thinking about Microsoft too I mean everything with rare associated with rare so conquer would make sense of battle toes a banjo a banjo would make sense so I don't know they have such a wealth of things to choose from and I think a lot of third parties especially would fall over themselves to be in that game yeah it didn't sell extraordinarily well but it's very popular and nonetheless and",
            "start": 2259.36
        },
        {
            "text": "of things to choose from and I think a lot of third parties especially would fall over themselves to be in that game yeah it didn't sell extraordinarily well but it's very popular and nonetheless and people play it and talk about it and it's kind of part of the zeitgeist and it's going to be for years so to get your character in there is a huge a huge move forward and you can you can find characters that don't necessarily make sense that they figure out anyway like I'm not a huge fan of pac-man in the game and Pat like when I found a pack I was meeting him I like what the fuck is that even mean and and they just they figured it out yeah so you could find these older arcade style characters and get them in there it would be cool for instance how like jump man in there you know and he's basically Mario but he's not and like to give him some a different kind of move set like really go back and go go you know go deeper you know a little more obscure they did that with Rob and they did",
            "start": 2300.04
        },
        {
            "text": "basically Mario but he's not and like to give him some a different kind of move set like really go back and go go you know go deeper you know a little more obscure they did that with Rob and they did that with Rob the game and watch so it's like they could they could they could do more yeah there's like 700 other Pokemon so that's another thing that you brought is there like why are some of these fucking Pokemon in this game Greninja or whatever the hell his name is really you guys will put like magnetite in the fucking game just put magnetite in there and snorlax I don't think magnetite is a Pokemon. Is snorlax not anymore even as an item? Magnetite is a Pokemon? Magnemite. It's magnemite and magnaton. Oh, magnaton. I was thinking magnatite was like the one with just the one magnet and then the three. Magnemite had two thingies and then magnaton had three hats. Whatever I don't care put those guys in there yeah they should that'd be cool I want to vote for for magnemite now there",
            "start": 2334.92
        },
        {
            "text": "then the three. Magnemite had two thingies and then magnaton had three hats. Whatever I don't care put those guys in there yeah they should that'd be cool I want to vote for for magnemite now there would there would be there'd be one funny just Dreamcast taxi driver Shenmue Magikarp would be funny to put in there yeah it's like a joke character kind of like Dan in Street Fighter mm-hmm where you could actually use them effectively if you wanted to but it's still like funny yeah all I know is that that's Smash Brothers game is excellent and I'm so glad that they they did it I'm sorry that it's stranded on that hardware because a lot of people aren't gonna play it can you imagine how well that game would sell if it was on an X yeah on an X yeah yeah it's not even like an anti Nintendo thing it's just like I'm really sorry that it's stranded on that hardware you know this great game because I love playing it and you have to buy like GameCube controllers and all that's just an expensive",
            "start": 2374.96
        },
        {
            "text": "it's just like I'm really sorry that it's stranded on that hardware you know this great game because I love playing it and you have to buy like GameCube controllers and all that's just an expensive game to play a very yeah when we were in Toronto we were playing on we've none Chuck yeah I can't play like this you know GameCube controllers are cheap now though on Amazon for the first time ever they're like $25 no can't believe it cuz they were like skyrocketed for a while so for 75 bucks you two can play with your friends yeah all right guys topic number three comes from patreon this is from Michael Taylor where's the whenever you need like something epic that's what you played all right patreon made him think of PA words words that's our PA which were on the park God the traffic park yeah nothing in a park city Utah oh it's a nice place I've been there fuck is it where's Park City Olympics yo mmm isn't it where's where Sundance is right it wasn't there the Olympics I don't want them",
            "start": 2419.88
        },
        {
            "text": "nothing in a park city Utah oh it's a nice place I've been there fuck is it where's Park City Olympics yo mmm isn't it where's where Sundance is right it wasn't there the Olympics I don't want them or is that where you want is somebody is that where Damon and Nate went to see the I saw a Skyrim white game it's about racks it's a rap song all right hey Greg Colin and Tim Wayne I'm at Alfredo I'm assuming he's gonna talk to you too yeah we as gamers have a great admiration for stories and games I've often wondered though if our metrics might be a little skewed when you consider the relative differences caused by player agency to things like pacing can we really judge the stories of games in the same way we do those of say movies we get to take part in the story of a game and through our actions possibly change them what are some of the unique challenges faced by gaming when it comes to storytelling and what are some games what are some ways games have or could overcome them thanks for",
            "start": 2467.72
        },
        {
            "text": "possibly change them what are some of the unique challenges faced by gaming when it comes to storytelling and what are some games what are some ways games have or could overcome them thanks for everything Michael Taylor thank you Michael Taylor for your support on patreon.com that's kind of funny games Thank You Michael Taylor dress Park doo doo doo doo doo Park City Utah now rack city leads to Wayne's world cuz he had a gun rack without a gun that's a Park City bitch Park Park City bitch um yeah judging stories the way we judge movies yeah there's an inherent problem there the fact that yeah games aren't movies movies aren't games but we always try to connect the two which is not the best idea to do but yeah I understand what he's saying right if a movie has a slow start you are still you're still like well I've invested 30 minutes I'll see this movie out and then you know I get so good at the end there's a payoff at the end and people always try to apply that to games and reviewing",
            "start": 2512.96
        },
        {
            "text": "still like well I've invested 30 minutes I'll see this movie out and then you know I get so good at the end there's a payoff at the end and people always try to apply that to games and reviewing games right of like the game sucked for 14 hours yeah but did you finish it did it get better didn't like that doesn't count that's not the same that's not the same time you know trade-off there if the first 30 minutes of a game suck and I stopped playing it then yeah I'm out 43 hours or whatever 43 hours yeah yeah approximately approximately for every game I play I'm rubbing Fredo's leg with my leg by the way so yeah it's not it's not apples apples right it is apples oranges yeah how we overcome that I don't know I think as consumers you have to be more invested in what you're buying and stick it through right if you're I think again when it gets to the point of like well I was talking about the Last of Us right in the fact that you know there was there was a gamble there for Sony and for",
            "start": 2557.76
        },
        {
            "text": "it through right if you're I think again when it gets to the point of like well I was talking about the Last of Us right in the fact that you know there was there was a gamble there for Sony and for Naughty Dog right of Uncharted 3 finishes now we're gonna put out Last of Us and hopefully the audience and the consumer is smart enough that that by putting a sticker on the box that says from the creators of Last of Us you understand what that means I'm sorry from the creators of Uncharted you know what that means right it is a new IP it is a new thing it is them going off in a different direction that's you know foreign you look at Activision you look at a lot of the other big companies right they want sequels they want proven concepts they get out annualized every year get more and more money and so for you to go off and do this you have to get it to a point where the consumer understands or listens to word-of-mouth or review sites or YouTube or whatever that this game is good because",
            "start": 2594.68
        },
        {
            "text": "and so for you to go off and do this you have to get it to a point where the consumer understands or listens to word-of-mouth or review sites or YouTube or whatever that this game is good because or this there is a lineage here with these developers because and there's a reason there and that's how you connect it all mm-hmm I think what do you think for I mean yeah I don't know kind of feel like you can't judge it the same way judge movies the game sucks early on it just just sucks it does I mean there's not too many games that I play where it's like all right well the mechanics do get better like no that doesn't happen yeah you know the mechanics pretty early on I don't know playing a play through all of and Charlie recently and all and then last of us and I thought there were great games I thought they were amazing games so I know I'm so I'm so gathering thoughts on this topic he's collecting data yeah Colin I think the reason we compare movies to games so much is because gamers are",
            "start": 2634.2
        },
        {
            "text": "I thought they were amazing games so I know I'm so I'm so gathering thoughts on this topic he's collecting data yeah Colin I think the reason we compare movies to games so much is because gamers are desperate for games to be taken seriously right and and I think that games are very young still we're like just getting out of as many people noticed you know noted in the past like we're out of our like silent picture era now so like where we are right now is still pretty young and pretty primitive I think that there is some parallel nature between story and movies and games because they're told that the same conduits of protagonists and antagonists and and and plot and all this kind of thing the way games have or where games have the advantage I think is in pacing because pacing doesn't necessarily have to be fast or slow pacing can be very environmental you brought up the last one which is a great example if you played the last of us just beat to beat it would be four or five hours long",
            "start": 2682.28
        },
        {
            "text": "have to be fast or slow pacing can be very environmental you brought up the last one which is a great example if you played the last of us just beat to beat it would be four or five hours long but the fact of the matter is it gives you these huge places like Bill's town for instance where like you can just explore it and let the environment tell you a story and people that watch movies do not have that like think about the Breakfast Club like one of the great I think storytelling movies you know the last 40 years or something movie I hold very dear to my heart we get the story through these kids experience in a library during detention and their interactions with each other and the interaction with the principal and kind of just like this teen angst kind of shit going on but we would be able to learn a lot about them if we were given 15 hours by just walking around the school and being able to go into their lockers and read their notebooks and talk to their parents and do all this",
            "start": 2730.64
        },
        {
            "text": "able to learn a lot about them if we were given 15 hours by just walking around the school and being able to go into their lockers and read their notebooks and talk to their parents and do all this kind of stuff but when you see a movie you have to have a tight experience and you can't do that games let you have an experience that's not tight that's why something like the witcher so exciting because it's gonna be two or three hundred hours long and you're going to not get literal story for two or three hundred hours just like you don't fall out three and just like you don't Skyrim that's the beauty of a video game so I think people are being too literal when they talk about story in games and I don't think it's as pigeon-holed as it is in movies I think that there's a lot of freedom because you can do whatever you want to tell the story so whether you're playing a game like Ori and the Blind Forest which is very emotional doesn't really talk to you as we experienced in our let's play",
            "start": 2767.16
        },
        {
            "text": "you can do whatever you want to tell the story so whether you're playing a game like Ori and the Blind Forest which is very emotional doesn't really talk to you as we experienced in our let's play on youtube.com slash kind of funny games or whether you're playing a game like the last one is very protagonist driven and there really is no antagonist in the game and you know unless you want to talk about just everyone else is the antagonist maybe or the world. It's about those characters but you still when Ellie's going through the record store and like talking about music or she finds the broken arcade machine and starts playing it or you learn about her and there would only be a finite amount of those moments in a three-hour movie or two and a half hour movie that would let you do that so I don't think games are hamstrung at all. I think games are in a great place for storytelling though the ability of a game to tell a story is going to be heightened as time goes on as people explore",
            "start": 2799.58
        },
        {
            "text": "I don't think games are hamstrung at all. I think games are in a great place for storytelling though the ability of a game to tell a story is going to be heightened as time goes on as people explore and find new things and it doesn't necessarily have to be about player agency. Player agency is overrated and I think that player agency is actually overdone. What does that mean? Player agency is choice and you know in a very literal way it's just the choice and series that do that really well are exciting we know Fallout 4 will do that you know we know because that's just what it does we know that Mass Effect 4 is going to do that and we are excited about those games but it's not necessary. The Last of Us doesn't let you make any fucking choice at all including at the very end of the game when you want to because it's the fucking story. It's telling you a story that's the thing when you see creators and developers owning that part of it right where like and that's what I always talked",
            "start": 2836.38
        },
        {
            "text": "when you want to because it's the fucking story. It's telling you a story that's the thing when you see creators and developers owning that part of it right where like and that's what I always talked about when we talked about Last of Us no spoilers but when you get to the end I expected there to be a prompt and there wasn't and it ended and that was the story and I remember texting Neil and be like oh my what the hell and that was the story they wanted to tell right and what's exciting when you talk about it especially when you talk about how young we are right is what you're seeing now in the indie market with these games that are coming out where people are telling you stories and doing these different things whether it be gone home whether it be coming out simulator whether it be something that's not about being gay there's plenty of games that are the ones that are just playing in my mind in terms of games doing something different and telling you a story right there all these",
            "start": 2876.9
        },
        {
            "text": "that's not about being gay there's plenty of games that are the ones that are just playing in my mind in terms of games doing something different and telling you a story right there all these different things there so now you think about the kids who are growing up right now coming of age playing those games and thinking about being a game developer and what are they gonna make right it's the same way of like how do we change everything you just have to age it out you know I mean you have to the video game violence argument ages out when everybody who grew up playing games is now an old person in Congress you have to worry about it anymore same thing with stories now as the people who are growing up you know the people who were made Last of Us the people who made all these other amazing Fallout or whatever grew up you know playing Mario you know I mean these were their games that meant something to them and they keep evolving you keep changing so now the people are playing Last of Us",
            "start": 2908.02
        },
        {
            "text": "or whatever grew up you know playing Mario you know I mean these were their games that meant something to them and they keep evolving you keep changing so now the people are playing Last of Us what does that mean for what they're gonna make when they get here and how they think about stories and how they think about games well it's so interesting to think even just about stories like stories and movies versus stories and games and like with movies movies are stories right yeah I can't really have a movie without a story I mean I can't really think of an example you know I'm serious I hate you so much I can't even think of an example of a movie that doesn't have a story but there's a bunch of games that don't have stories or stories that don't matter because it's about the gameplay I can't think of anything about a movie that you can say oh it's not about the story it's about the explosion you know what I mean like I guess there is some of the transformers well I mean though that's",
            "start": 2940.26
        },
        {
            "text": "think of anything about a movie that you can say oh it's not about the story it's about the explosion you know what I mean like I guess there is some of the transformers well I mean though that's true that's that that is true but like you know but people use that as an excuse of like well the story doesn't matter but the story does get you from A to B you have to have a fucking yeah I guess like you need to have a story whereas I feel in games you don't need to have a story so it's only we could ever compare video games and movies together but I do think that there are more the games like Uncharted and Last of Us and Gone Home and all those games you can compare those two movies because they are about plot and their plot matters a lot yeah and what's interesting there is like you think about the story and you were talking about Last of Us giving you this ability to like learn and like Gone Home and there's another one where you're like there's not so much in narratives then you go to",
            "start": 2975.46
        },
        {
            "text": "the story and you were talking about Last of Us giving you this ability to like learn and like Gone Home and there's another one where you're like there's not so much in narratives then you go to narrative versus story and then like what's the difference there between the narrative being the actual plot points of this happened then this happened then this happened story being more here's all the different things that create this experience and I don't know if like movies can do the same thing that games do in that sense like can movies have that level like what's an example of a movie that has that story element to it not just narrative and plot I don't know I think people would look at something like The Shining or something maybe is something that has like all this deep hidden meaning if you found it and there's a documentary about it's kind of crazy actually but the documentary still but you know but this is the fucking exciting thing about games and how young they are and where",
            "start": 3015.38
        },
        {
            "text": "if you found it and there's a documentary about it's kind of crazy actually but the documentary still but you know but this is the fucking exciting thing about games and how young they are and where they're going movies are always going to be movies that's not to disparage them it's just to say like you are going to sit in a fucking chair and you're gonna watch it and that's it that is all a movie is ever going to be you know ever but when you play a game it's gonna be about way more than that it's gonna be about your interaction with it and when you interact with something there's various if not infinite permutations of the way you would deal with it you know a game like Castlevania 2 is a great example like it's a game that all maybe our younger viewers haven't played or even really heard of but Simon's Quest is Castlevania 2 that's an NES game and what's so cool about it is that it's a nonlinear game and it's about it's its story is about finding Dracula's body parts to put him",
            "start": 3057.46
        },
        {
            "text": "heard of but Simon's Quest is Castlevania 2 that's an NES game and what's so cool about it is that it's a nonlinear game and it's about it's its story is about finding Dracula's body parts to put him back together to kill him again but like you don't and that's because and that's because Dracula like when was when when Simon Belmont killed Dracula at the end of Castlevania he was given a curse the only way to get rid of the curse is to revive him and hit him with a stake or whatever and and so like he has to put him all back together and then kill him again that's the story and you can go through it really quick and find the five body parts of five different mansions go to the old castle revive them to fucking kill him that's fine but the game is scary it hasn't day night cycle and and it's nonlinear and there are secrets all over the fucking place it's like really obtuse and the game I was talking to someone recently like it's one of the scariest games I've ever played in my life and",
            "start": 3098.9
        },
        {
            "text": "nonlinear and there are secrets all over the fucking place it's like really obtuse and the game I was talking to someone recently like it's one of the scariest games I've ever played in my life and and it's actually unsettling because of the music and the day-night cycle and the fact that no one really talks to you and it's just it's just weird but you'll never have a movie like that you never have a tv show like that because because you're not interacting with it like that you might be able to pause it frame by frame be like you didn't really enjoy the background or or listen to the music or you missed something but there's a one-dimensional kind of aspect to movies that again it's not meant to insult movies it's just to say that like games are next level games in 50 years are going to be telling extraordinary stories and doing extraordinary things at the same time we shouldn't disparage the way things do the way things are done more conventionally we were reading a story on colin",
            "start": 3137.34
        },
        {
            "text": "be telling extraordinary stories and doing extraordinary things at the same time we shouldn't disparage the way things do the way things are done more conventionally we were reading a story on colin and greg live today about one of the guys that made orient the blind forest making fun of world war ii games and saying that like they do he wants to make something more like shindler's list as opposed to like these kind of bro shooter world war ii games and i'm like that's kind of bullshit because like there is a room for a game like that i'm excited about that we're talking about valiant hearts which is awesome a world war one game a great war game and there's nothing wrong with storming normandy in 1944 because it's fucking fun you know i mean and like how else are you going to do it like you being the fucking dude who's storming normandy and fucking killing the nazi that's fun so like there's nothing wrong with that either yeah i think sometimes we get a little pretentious the way we",
            "start": 3171.18
        },
        {
            "text": "you being the fucking dude who's storming normandy and fucking killing the nazi that's fun so like there's nothing wrong with that either yeah i think sometimes we get a little pretentious the way we talk about story that's the fucking big problem there's a story to be told in the first person shooter and it's totally fine i enjoyed advanced warfare and its story that was really interesting and silly but it doesn't mean it's wrong yeah so when we talk about story we talk about player agency which was like the obsession and you saw it kind of roll out over a few years now it's gone again like that's fine well let's not get too pretentious about the way we talk about stories either because there's going to be room for saving the princess stories in mario there's going to be room for storming near the beaches of normandy and there's going to be room for exploring a house and and figuring out that you're you know playing as a you know you know or learning about a gay girl or whatever else",
            "start": 3204.62
        },
        {
            "text": "near the beaches of normandy and there's going to be room for exploring a house and and figuring out that you're you know playing as a you know you know or learning about a gay girl or whatever else we did in gone home there's there's room for all of that don't and don't don't put spoilers in the comments i've been beating the gone home drum forever get off your ass and play it oh whatever if you have first of all it's two hours you haven't played it yet so you kind of that's kind of on you but you should um but that that's kind of the thing is that we just have to make room for everything the thing is that uncharted in the last one you brought three examples of things you can compare to movies you said uncharted i think obviously and then the last one i think again obviously we're gonna get a movie gone home can never be a game or it can never be a movie rather it's always gonna be a game because that's all about environmental storytelling and your own pace you don't have to fucking",
            "start": 3240.94
        },
        {
            "text": "get a movie gone home can never be a game or it can never be a movie rather it's always gonna be a game because that's all about environmental storytelling and your own pace you don't have to fucking do anything in that game really just have to find very certain things you can just hit all the check boxes in the game and you could stumble to the final room let me find the thing that says go to there and you go there and it's over you should beat the game in like five minutes and that's uniquely game yeah i mean and that's that's that's exciting you know the thing is is that there's no game in my mind that doesn't have some sort of story even if there's not a story in it yeah um reso gun has a story like it's just and and some games are made more exciting by it you reading into it a little bit um we were talking about mario 2 and the smash bro in the smash brothers topic and like there's a story there to be told about a dream and a dream world and all those kinds of things you want to",
            "start": 3278.14
        },
        {
            "text": "bit um we were talking about mario 2 and the smash bro in the smash brothers topic and like there's a story there to be told about a dream and a dream world and all those kinds of things you want to explore it and think about it there's a story and you know there's a story of pac-man if you really wanted to think about it he finds it might be a drug dream but it's like he's chasing the ghosts of his past so i don't know i i stories stories in every story telling is in every game but it's the you know to me games are most like books not movies and i think we should start maybe talking about them more in literary terms as opposed to cinematic terms because they're never going to be movies and movies are never going to be games but when you read a good book you're seeing what you want to see you're doing it kind of in sequence but you're you're kind of learning as you go sometimes things are lost in you the first time you read it and then it comes up again later in the book and you",
            "start": 3311.66
        },
        {
            "text": "see you're doing it kind of in sequence but you're you're kind of learning as you go sometimes things are lost in you the first time you read it and then it comes up again later in the book and you didn't realize at that time i don't know i i don't think we talk about them in in the literary terms enough i think that's really powerful see i think that's interesting but i think that goes back to what i was saying about just that's really for the the plot heavy games because i feel like so many of the other games like they're they're more relatable to movies than books because so much of it is based on camera angles and um voice acting and all that stuff like that that is kind of what creates the experience of the game like that is what the game if you're reviewing the game you're going to be reviewing those things about it like that's how important they are whereas with the book you wouldn't be reviewing those things because there's not voice acting you know what i mean sure i'm sorry",
            "start": 3348.46
        },
        {
            "text": "be reviewing those things about it like that's how important they are whereas with the book you wouldn't be reviewing those things because there's not voice acting you know what i mean sure i'm sorry sure yeah there you go all right satisfied grin anyone else have anything else to add on this i just think movies in general just give you a variety of things that you can experience that movies can't right so you mean games yeah wait the movies show you things games game yeah sorry movies show you things games can or games show you things movies can't games show you things thank you all right yeah um and there's just there's a variety right you have your your games like counter-strike which is a game you'll play endlessly but there's really no story there or you'll have ones like uh destiny where it's a failed story but you know you kind of split your audience there some people still play it some people still don't and then you have games like the the telltale walking dead games where",
            "start": 3389.5
        },
        {
            "text": "where it's a failed story but you know you kind of split your audience there some people still play it some people still don't and then you have games like the the telltale walking dead games where like and you know if you're watching the show it's like oh my goodness all these hard choices are being made but then when you're actually playing it's like i have to make this choice i don't think i can make this choice but i have to make you know i have to decide timer's counting down gotta say something exactly the games are so interesting because they they make you the character and you do need to make those decisions and stuff in a lot of ways like even if you're role-playing as this character like when things happen you see it as it happening to you i think pokemon's a great example of this where it's like the plot of pokemon is pretty thin like overall there's monsters in the grass kid go be the very best whatever but it's like because of all the npc's around and talking to everybody",
            "start": 3430.94
        },
        {
            "text": "where it's like the plot of pokemon is pretty thin like overall there's monsters in the grass kid go be the very best whatever but it's like because of all the npc's around and talking to everybody you can get this like there's like a there's so many layers and you start thinking about like the world and like they created the world in such an insane way where everything revolves around these little monsters and like there's backstories to so many of them and like the whole youtube subplot and like they tried to create a new one and like um they failed by cloning trying to clone mu and what happened there's this like abandoned um burned down uh science building what's the science building called laboratory laboratory there you go there's like this burned down laboratory and stuff and you're like kind of going around exploring it and finding all these like like ancient tracks of like what was the mu experiments it's like that's super cool and then to then play gold and silver and it's",
            "start": 3468.54
        },
        {
            "text": "like kind of going around exploring it and finding all these like like ancient tracks of like what was the mu experiments it's like that's super cool and then to then play gold and silver and it's like you're this whole on a whole new world you're a whole new kid or whatever and then at the end of it to face red who was the protagonist from the first one in a lot of ways it's like it's this weird moment of like i'm facing myself right from the last game and it's just like oh my god like this is insane that's games those that's the true power of games putting you in somebody else's experience and that's what i think where colin's talking about books too books do a great job of that if you read somebody's story and you're they're telling it to you but they're telling it in your head so you're in that section and that's why your heart will beat real fast no that and movies can give you that experience but like it's more like oh man i love this character i hope nothing bad happens to him",
            "start": 3511.66
        },
        {
            "text": "in that section and that's why your heart will beat real fast no that and movies can give you that experience but like it's more like oh man i love this character i hope nothing bad happens to him it's not the same as i don't want anything bad to happen to me you know i mean like when you're in a game and you you're down to your last three bullets and you know there's all these enemies over there's that when you're in gone home and you're i'm just trying to figure out what is going on and not because i'm worried about this person can i help this person are they in trouble kind of thing there's that and then like you know the multitude of other games you get to walk a mile in somebody else's shoes and that's why it's so powerful yeah where do you have games like like arma where people just kind of have this open world and they they create their own little stories right people go in there like oh i'm gonna role play as a cop or i'm gonna role play as a drug lord and yeah that's",
            "start": 3546.78
        },
        {
            "text": "just kind of have this open world and they they create their own little stories right people go in there like oh i'm gonna role play as a cop or i'm gonna role play as a drug lord and yeah that's interesting randomly interact with these people right or just like you go in there if you guys are cops you're just like all right well there's a cocaine field there's there's this torn up town like where am i gonna go like we're just gonna run into someone and who knows what's gonna happen right yeah it's like role playing in a completely different sense where it's like you are creating your character yeah i mean that's the thing where you're talking about games that don't have stories or whatever you make your own when you play when you play minecraft right like when people play minecraft together they aren't making their own stories of this village they did and then this time the creeper came in and exploded this or that and i think the biggest example that is actually even online and we",
            "start": 3576.46
        },
        {
            "text": "they aren't making their own stories of this village they did and then this time the creeper came in and exploded this or that and i think the biggest example that is actually even online and we could we and we could we could dedicate a whole show to eve online and like how fucking crazy it is but like there are no rules in that game so like there are rules in terms of the confines of how you deal with your ship and all that kind of stuff but like nothing is off limits so like people rip each other off in that game and like the real world and like all like all sorts of like crazy shit happens in that game because then because you know ccp from iceland did you see them when you're there no i didn't i didn't one of the biggest employers in iceland which is which is funny their whole thing is like this is the world and there are people that are like bankers that like actually take other people's money and like you trust that they're going to give it back to you for instance but there's",
            "start": 3611.18
        },
        {
            "text": "is like this is the world and there are people that are like bankers that like actually take other people's money and like you trust that they're going to give it back to you for instance but there's nothing compelling them to do that you know like there's like there's like all sorts of cool stuff in that like where they're like they don't they don't want to fight they want to be the banker they want to make shifts or trade and stuff like that's awesome you know like yeah you can't do that in the movie yeah arma has people that are just medics you just call this drive around and revive you that's fucking awesome yeah that's we got to do some less plays on that all right guys final topic once again we look to the audience we tweet out every day that we record this we're like guys what do you want us to talk about and then you let us know just like arcade lion did and he asks what game series need to end i look to you colin god of war ratchet and clank ration clank yes it's time for",
            "start": 3649.34
        },
        {
            "text": "you want us to talk about and then you let us know just like arcade lion did and he asks what game series need to end i look to you colin god of war ratchet and clank ration clank yes it's time for rashing clank to go away they've overstayed their welcome now they don't matter anymore thank you very much goodbye i want them to come back and they are they you want them to come back they never left tim you can't miss something that never left i i think but they're a perfect example of i want i wish that they they left a long time ago and then we're coming back now but i don't want the series to end they for all they all for all intents and purposes they did leave you know after a cracking time yeah exactly game since then all the other ones were just like nobody cared nobody kept coming i don't even think ratchet or clank cared no they didn't care they did not care about all for one they were they were smoking cigarettes yeah they weren't even keeping up the facade when they played like",
            "start": 3685.26
        },
        {
            "text": "even think ratchet or clank cared no they didn't care they did not care about all for one they were they were smoking cigarettes yeah they weren't even keeping up the facade when they played like oh things are coming i i i mean what comes to my mind is call of duty not because i don't like those games because i would love to see what they like the hype they could build sure and and the heights they could achieve if they just fucking stopped yeah exactly it's not to say that like they're they're all you know infinity ward and raven and all these guys are working on the game it's not to say that like the same studio is making these games sledgehammer's game will not be the new call of duty for three years but what is the power of call of duty and um could they learn something by the way rockstar treats grand theft auto for instance which is with a lot of respect or the way beveza treats fallout or uh the elder scrolls which is with a lot of respect um there are games like that that i",
            "start": 3730.78
        },
        {
            "text": "treats grand theft auto for instance which is with a lot of respect or the way beveza treats fallout or uh the elder scrolls which is with a lot of respect um there are games like that that i wish that people would just or series like that where i'm like i wish they would just back off because you're kind of like i defend call of duty all the time because i think they're fun um but it's like you're doing damage to these franchises even if you're making money on them by just not leaving them alone and look what you could do look at how much money rockstar made and how much profit they made by just not regurgitating grand theft auto they can make a grand theft auto game every fucking year they pay anyone there's studios that would be desperate to make a fucking grand theft auto game and they kind of did it during the ps2 era but they didn't reach their true financial heights until four and that was because people have been waiting for so long and then again even more now with five so",
            "start": 3764.54
        },
        {
            "text": "kind of did it during the ps2 era but they didn't reach their true financial heights until four and that was because people have been waiting for so long and then again even more now with five so they were hungry they were hungry no one's hungry for fucking call of duty like you might be you might be anxious to play you might want to play the new one but no one's no one's hungry for call of duty because they won't make you hungry see what's interesting to me about this question is that you know we kind of take it as i think all of us instinctually take it as like what series do we want to end now so they can come back later yeah but like what if we it was just end no more in the future because like yeah i would love pokemon to end now and then finally come back in like five years as like an mmo an mmo rpg is that something new and so i haven't done that yet i know right but what series do we just want to end and now i feel like that's unfair to say to a bunch of shit because like it's",
            "start": 3805.66
        },
        {
            "text": "mmo an mmo rpg is that something new and so i haven't done that yet i know right but what series do we just want to end and now i feel like that's unfair to say to a bunch of shit because like it's i feel like then we can just throw a bunch of stuff out there that we're never going to play to make it a little more interesting what's a game that we would have one more game of and then end it so they get at least one more chance to like wrap things up uncharted you're gonna for all yeah for all intents and purposes it looks like uncharted 4 is that or at least nathan's story but does that mean then there is somebody new or we're doing something different or you know there's gonna be prequels or i don't know what the hell is gonna happen but like i would like to see them give an end to that and be done with it that's good i would like them to be done with final fantasy i was about to say final fantasy how interesting would it be if final fantasy 15 was the final fantasy it'll be",
            "start": 3840.7
        },
        {
            "text": "to that and be done with it that's good i would like them to be done with final fantasy i was about to say final fantasy how interesting would it be if final fantasy 15 was the final fantasy it'll be depressing because i wouldn't want it to end uh looking like that even if the game even even if the game is great and i don't know i i i we talked about the the demo and i there were some positives and some negatives and i'm open-minded i have no expectations um i don't want it to end like that okay what about 16 then not knowing what 16 is but 16 if it was a fantasy high fantasy fucking class-based wide open beautiful game hell yeah that would be an awesome like end it the way it started you know almost make a final fantasy game like the original one that was not so dependent on story that had like kind of a shallow story that was all about character customization and um exploration and battling monsters just make it something simple and make it so it's a loop so the last one goes back",
            "start": 3876.06
        },
        {
            "text": "had like kind of a shallow story that was all about character customization and um exploration and battling monsters just make it something simple and make it so it's a loop so the last one goes back to the first one but you know that's a cash copy that's unrealistic but it would be cool for them to do that yeah i kind of feel like halo should end soon to be honest uh the story like we've we've had master chief he was the only one you know he's protected the earth so many times now there's other spartans other spiders fighting spartans kind of feel like his story should kind of come to an end yeah but i mean besides story just like gameplay wise would you be okay never having another halo 343 can make another game or bungie did make another game ever i mean yeah i mean they could make another game right they could well think about how obsessed you are with destiny yeah and that was because bungie walked away from halo you know like so it's not like they're not gonna make it's not",
            "start": 3921.58
        },
        {
            "text": "another game right they could well think about how obsessed you are with destiny yeah and that was because bungie walked away from halo you know like so it's not like they're not gonna make it's not they're not capable of making a great game clearly they are say two more wrap up master chief story right and then or finish it off this trilogy and then yeah finish the fight again finish finish the fight for final times yeah i get that but i'm on this weird thing i was like i want more stories to continue because i just played the last of us i've just ran through all the uncharted so i'm just like i want more of of these franchises so the opposite yeah yeah that makes sense surprised greg didn't say the last of us is it a franchise yet at this point do you think do we count it that's common i mean i do i would like it not to go i would like them to leave that alone then again i trust them whatever he wants to do metal gear stop doing making metal gears just recently playing the last of",
            "start": 3969.18
        },
        {
            "text": "i mean i do i would like it not to go i would like them to leave that alone then again i trust them whatever he wants to do metal gear stop doing making metal gears just recently playing the last of us i feel like it'd be cool if they just started a new storyline different characters different people what are they doing just driving i mean maybe other side of i don't know how do i get the spoilers but like the whole infection stuff you know sure yeah i feel like ellie and joel's story was really well told yeah yeah i want more metal gear you want more yes after five more snake well here what if it's all real what if it's all true though and kajima's gone hadeo kajima is gone you want more metal gear from konami under no circumstance do you want it yeah you're gonna get it they got nothing else you're gonna get it all right spacetime dave wants to know can destiny's dlc be a success without a raid have they cheated the season pass holders we were cheated well someone did tweet at me uh",
            "start": 4005.42
        },
        {
            "text": "else you're gonna get it all right spacetime dave wants to know can destiny's dlc be a success without a raid have they cheated the season pass holders we were cheated well someone did tweet at me uh a picture of house of wolves and it says brand new raid um so and that was like back in the day that was like their marketing materials yeah so value there so yeah that makes you feel cheated um i love the raid this is so many feelings with this i love the raid honestly i don't initially my thoughts are uh the dark the dark below it was a very expensive dlc do i feel like it was the only reason you can maybe justify that that dlc was because of the raid now there's no rate in this one i kind of feel cheated out of that like 100 but i have to reserve my judgment in a way because like they could turn everything around with the whole arena thing right like they could have the dynamics that they had in the raid implemented into the arena and like who doesn't want to say this to greg already",
            "start": 4056.62
        },
        {
            "text": "turn everything around with the whole arena thing right like they could have the dynamics that they had in the raid implemented into the arena and like who doesn't want to say this to greg already but who doesn't like a horde mode style game type yeah and i mean even for me it's harder to get people to be like to get six people together and be like hey you want to run this this raid is game in destiny which like a lot of my friends are just don't care about destiny anymore right it's the arena's three players it's easier to get people together right you could you could have that reward system um and a lot of people are mad because when you really look at destiny a lot of the i feel like a lot of the reasons why it kept going and it is still somewhat popular now this really falling off was because of the rates right there's this big huge thing where it's like oh check this out like here's this here's this thing that we implemented into an fps game that isn't really it's kind of brand",
            "start": 4111.66
        },
        {
            "text": "because of the rates right there's this big huge thing where it's like oh check this out like here's this here's this thing that we implemented into an fps game that isn't really it's kind of brand new right um but people get it though destiny people are craving new content oh yeah i don't think it'll i don't think it's like i think they'll be fine because the question was right is it a huge hold-up what was the exact word name question is that not the part of be a success yeah it'll still be a success it could be a success if they do the arena right a lot i mean but you're gonna have to get it into a lot of people's like flaps right you got to show them like look the arena it's like three players and there's there's great like type things in there and you can play colin we got four minutes until four yeah i know that you have some real life shit going on are you leaving right in four minutes yeah okay cool i'm gonna look through questions that are directed at you playoffs matt bw93",
            "start": 4162.62
        },
        {
            "text": "until four yeah i know that you have some real life shit going on are you leaving right in four minutes yeah okay cool i'm gonna look through questions that are directed at you playoffs matt bw93 asks why won't colin play bayonetta or wonderful 101 uh no interest really in playing them um i'm not typically an arcadey uh well for bayonet i should say i'm not really typically um into arcade games when bayonetta came um to ps3 and xbox 360 i just didn't care um there's some there's some uh examples of that not necessarily being true with the old ninja guy in games not the old old ninja guy games with you know the xbox ones um but i'm not i don't really have there's not a huge appeal for third person action arcade action games for me so like it's just that's not what i'm gonna gravitate towards unless there's something super unique about it and i don't really feel like there is just on the outside um you know the reason i started playing a game like vanquish was more like a third person",
            "start": 4201.42
        },
        {
            "text": "unless there's something super unique about it and i don't really feel like there is just on the outside um you know the reason i started playing a game like vanquish was more like a third person kind of shooter it's because it was fucking cool and it looked and it looked interesting and i wanted to play it but i can there's a i could play god of war or something like that if i wanted to play a game like that and i fucking hate god of war so it's like why would i like why would i why would i play you know that particular game so with wonderful 101 i just didn't think the game looked interesting or good um so it's really just not for me that's why i didn't play them so i'm really excited for your answer this one at 8-bit abs asks would you rather shovel knight 2 which is an nes style sequel that's slightly different than the core one right or super shovel knight which is a 16-bit sequel i'd rather than stay with the 8-bit but i think that i do think that their vision might be to do",
            "start": 4248.78
        },
        {
            "text": "that's slightly different than the core one right or super shovel knight which is a 16-bit sequel i'd rather than stay with the 8-bit but i think that i do think that their vision might be to do something more like super nintendo um and then evolve it from there uh no i think that there's they were gonna get shovel knight 64 at some point maybe um i think you're gonna get a shovel knight sequel i think that's obvious uh what what they'll do with it remains to be seen they're a small team and i think that they worked really hard on kind of that engine and getting that pixel graphic look really right and nailed it i think they'd be really foolish to abandon it i think they know that so um i think we'll get another shovel knight probably in another year year and a half would you rather a straight sequel yeah like a 3-style sequel or a mario 2-style sequel mario 3-style sequel i i i mean shovel knight's still mario 3 already the um i like six some of my favorite games are six games that",
            "start": 4287.9
        },
        {
            "text": "sequel yeah like a 3-style sequel or a mario 2-style sequel mario 3-style sequel i i i mean shovel knight's still mario 3 already the um i like six some of my favorite games are six games that are basically the same because they're so fucking good and shovel knight is a game that's like that it's they're easier than i don't think they're as good as megan man but um you know another 8-bit shovel knight game with just eight new enemies and a new world to explore and fight and play and some new puzzles and stuff that'd be awesome i'd love that yeah all right kevin white 24 this will be the last question for calling racist he wants to know will call him play millgateer solid 5 and does he think it could rekindle his love for the series yeah i'll definitely play it i'm most excited about the open world element to it but i i you know my love of the series has been dormant for a long time you know mgs and mgs2 are fantastic fantastic games they always will be but um i think the series should",
            "start": 4326.06
        },
        {
            "text": "world element to it but i i you know my love of the series has been dormant for a long time you know mgs and mgs2 are fantastic fantastic games they always will be but um i think the series should have ended a long time ago and i i don't they're kind of running it into the ground at this point i'm i don't even want to play for the story you don't even fucking even know what it's about at this point the i i want to just play it because i think it looks fun and i think kojima especially this is a swan song there um be something special with this game but uh yeah i'm i'm definitely gonna play it when it comes out and we'll see how it goes cool yeah all right i'm sorry i have to disappear bye go i look go i'll fuck the rangers right that's the thing capitals capitals is who we're fucking capitals fuck the rangers all right guys back to us let's look at this what do i got for y'all at keith schmidt wants to know talk about how awesome mortal kombat x is frato oh it's awesome yeah no the",
            "start": 4367.5
        },
        {
            "text": "fuck the rangers all right guys back to us let's look at this what do i got for y'all at keith schmidt wants to know talk about how awesome mortal kombat x is frato oh it's awesome yeah no the fatalities are fucking brutal it's it's sick and i i don't usually play fighting games but i don't know mortal kombat is one of those things where i think it really gears itself towards people who don't play fighting games right like you play there's a spectacle yeah exactly the brutality is in the fatality as well and all that kind of stuff earlier i saw a guy's balls explode yeah you know what i mean shit and um i don't know i think i think i think mortal kombat x is really cool i think it plays well i mean i played through the campaign yesterday it's more a combat campaign you know is luke hanging back is he not dead he's i don't care about spoilers fuck out of this please i mean it's not yeah i mean he's he's dead but like uh he's kwan chi like brings him back got it yeah of course that's",
            "start": 4405.42
        },
        {
            "text": "back is he not dead he's i don't care about spoilers fuck out of this please i mean it's not yeah i mean he's he's dead but like uh he's kwan chi like brings him back got it yeah of course that's kwan she does one of my favorite things ever i remember me and kern back in the day rented mortal combat deadly alliance i think it was and uh the intro cinematic starts off and luke just straight dies and the announcer's luke is dead it's like what yeah i mean no the game is just it's just fun to play it's a fun fighting game um uh yeah i mean when it comes to the story though i mean luke k i remember he used to be like oh luke is such a cool character and he did bicycle cakes and shit but like he's such a basic bitch now like he's just so compared to everyone else like he's so basic yeah yeah but also it's like starbucks and stuff yeah so wearing his boots yeah it's a it's a fun game to watch it's a fun game to play and um for people who i know a lot of people are just like oh my god like i",
            "start": 4449.66
        },
        {
            "text": "also it's like starbucks and stuff yeah so wearing his boots yeah it's a it's a fun game to watch it's a fun game to play and um for people who i know a lot of people are just like oh my god like i don't play fighting games but i want to play mortal combat i mean it's fun to get into and you could buy easy fatalities though how do you feel about that though i a lot of people are against it but as long as it's not pay to win yeah you're not like well i heard buying easy combos you can use in the middle of the game like that's just so what are you doing it's just well rather than have to go through the whole convoluted combo system yeah so instead of being like two buttons back down forward up up x right for the for the fatality you just like you hold i guess on on xbox you hold the right trigger and then press uh one button for one fatality and another button for the second and you have to pay for this on top of the game it's like five bucks for third all 30 for you get 30 tokens that",
            "start": 4502.86
        },
        {
            "text": "and then press uh one button for one fatality and another button for the second and you have to pay for this on top of the game it's like five bucks for third all 30 for you get 30 tokens that you can use correct me right is it 30 tokens i thought so yeah i think it's token oh wow if it's token based and yeah but i mean well now let's double check that so yeah token base and then the other thing about it is that you can get them through playing you earn the tokens while you're playing through the challenge that you can definitely do the rumor is that they dial down the frequency of like what they're giving out after like reviewers played it saw how it worked and then they dialed back and this is what i heard on total biscuit podcast that i was on from him is that they dialed back the amount they're giving out of tokens to kind of encourage you to go do it that i don't agree with yeah right but that's pay to win that's like you know yeah but i mean if you just if you're taking that out",
            "start": 4549.42
        },
        {
            "text": "they're giving out of tokens to kind of encourage you to go do it that i don't agree with yeah right but that's pay to win that's like you know yeah but i mean if you just if you're taking that out of the picture right and it's just like if it's like wall dude dude i mean like i suck at button fatalities actually i can get i can do them and mkx but i don't think it's not like easy combos in the middle of a match yeah if the match is done it's just you want the flashy finish yeah exactly but i just don't i don't like the idea to pay for that on top of the game you don't have if you can buy within game currency that's totally cool but if they're doing some bullshit where it's like they're making it really hard to buy within game currency to the point like going back to pokemon when you first can buy the bike and it's like 10 million dollars no one's actually is ever going to do that it should be on the table out there colin is upset he does not know where the remote is i don't know all",
            "start": 4587.26
        },
        {
            "text": "can buy the bike and it's like 10 million dollars no one's actually is ever going to do that it should be on the table out there colin is upset he does not know where the remote is i don't know all the remotes on the table which like the game is designed for you to there's no way for you to have that much money to actually buy it you have to wait until you get the free bike voucher or whatever yeah like that sounds like this shit where they're like you could get it within game yeah one dollar gets you five easy fatalities five dollars gets you 30 and i believe they're just tokens though they're not that's not like you're yeah yeah for the rest of the thing that that should be a like a constant like yeah it would have been a lot better for us five dollars for all easy fatalities whoa hold up you're paying five dollars kevin come like one time you shit yeah yeah that i agree with less oh hell no yeah it's a one it's a token you're spending once like you go into a match you spend the",
            "start": 4628.22
        },
        {
            "text": "up you're paying five dollars kevin come like one time you shit yeah yeah that i agree with less oh hell no yeah it's a one it's a token you're spending once like you go into a match you spend the token before i thought you meant like tokens or things that you can get in game and then buy stuff with well i think you guys look at it two ways right one is it worth it no two is it game breaking no i don't that's true i don't think like like i said like it's not easy combo like pay to win stuff yeah like it's not pay to win it's not paid to win it's just yeah it's it's dirty but it's not pay to win you know same thing with evolve people freaked out with evolved dlc when it's like it's just skins yeah if you want your fatalities you just know how to use the fatalities yeah like you don't have to buy this like just it's not like it's not like oh third fatality is going to be an extra two dollars that would be bullshit yeah exactly i mean it's very dirty okay that's my whole thing is it's",
            "start": 4668.46
        },
        {
            "text": "to buy this like just it's not like it's not like oh third fatality is going to be an extra two dollars that would be bullshit yeah exactly i mean it's very dirty okay that's my whole thing is it's like it's not bad but it's not okay yeah it's uh it's a very yeah i agree with that all right at dj jb85 first off i like you you're a cool dude i'm sure but why do people have twitter names that are just like typos there's so many of them sometimes i'm like i don't even know why i'm writing this down because nobody thinks it through in terms of like they're gonna have to share that or somebody's gonna need to read that or whatever it's just their stupid twitter to follow their friends or whatever there's a lot of pressure behind creating a username okay yeah i totally get that i'm sorry i don't mean to downplay your initials and then random numbers after it and then like i signed up for my first youtube channel with that like i didn't think anything i was like oh that means something to me",
            "start": 4714.3
        },
        {
            "text": "mean to downplay your initials and then random numbers after it and then like i signed up for my first youtube channel with that like i didn't think anything i was like oh that means something to me or whatever i never thought somebody else trying to find that what do you guys think about deus x mankind divided you guys excited lukewarm indifferent i didn't like the last day of sex i tried to get into it and it's just like no this is not for me it's one of those games that scarpino was all about yeah that's one of the people loved it a lot of people loved it but for me i jumped in there like the battery to do moves and stuff i was like no this isn't night and people like oh it's stealthy though and i'm like well fine but make it stealthy you don't make me like feel like i'm a very fucking underpowered cyborg yeah another fucking duracell in the back of my head that i can't it's like no it broke it for me i didn't want to yeah it's like come on use energizer yeah come on that's a",
            "start": 4756.86
        },
        {
            "text": "underpowered cyborg yeah another fucking duracell in the back of my head that i can't it's like no it broke it for me i didn't want to yeah it's like come on use energizer yeah come on that's a fucking joke never use energizer we duracell people here but i did like the bunny i'll always give the credit when he was good commercial you get a shot at the last video about commercials yeah that game never stuck with me yeah so all right i'll wait to see when it comes out we got some call and questions about star ocean because i don't think you guys have anything i'll save those for next week um okay let's do one more question one more the final question find a good one the final question do you think there should be a left for dead three yes yeah fuck yes there should be are you kidding me a next gen or current gen left for dead yes a thousand times yes and you think it'll work better than evolve yeah yeah why because zombies are hot yeah uh zombies are hot people love that you sound like",
            "start": 4796.7
        },
        {
            "text": "gen or current gen left for dead yes a thousand times yes and you think it'll work better than evolve yeah yeah why because zombies are hot yeah uh zombies are hot people love that you sound like kevin right now fuck you tim zombies are super hot everybody loves shooting zombies and the problem with the the reason left for dead works over evolve is that it's so easy to wrap your head around yep everybody go shoot zombies with your friends got it evolve everybody go hunt your friend by the way each one of your character classes has some very specific things we need to learn please sit down we have a video we have a video tutorial all right so you're gonna be the medic oh my god i just i have i have an hour and a half to play with my friends i don't feel like doing this now there's a lot of games that work awesome like that league or their strategies and there's this and there's that and okay obviously team fortress like okay i understand class-based things and da da da class-based",
            "start": 4833.74
        },
        {
            "text": "of games that work awesome like that league or their strategies and there's this and there's that and okay obviously team fortress like okay i understand class-based things and da da da class-based things not every one of them blows up not everyone needs to be on the mainstream console that's getting everybody everything right left for dead work because it was like go fucking shoot shit with your friends i got two moosies great you know what i mean awesome it's just you didn't need like evolve needs a group of four skilled hunters right who work together like very closely and you don't need that with left for dead and leopard dead always gave me that like the thing i always wanted which was just to unload bullets into a horde of zombies right you always watch zombie movies and you're like i just wish i could just unload a bunch of like weapons into these zombies and it was they allowed it had that intensity to it of like there's too many zombies for us to kill everything we need to",
            "start": 4872.3
        },
        {
            "text": "i just wish i could just unload a bunch of like weapons into these zombies and it was they allowed it had that intensity to it of like there's too many zombies for us to kill everything we need to move we're gonna keep moving get to the safe from oh god he didn't shut the door like that was always awesome stuff yeah it's very simple and yeah well i think it's the thing with your friends too like i remember before that game came out when it was first being talked about i was like holy shit we got to four of us together do this and have fun all doing the zombie thing that sounds great and like you don't need to have the skill levels and stuff but it's just shocking to hear you say this because like alfredo you're such a team-based skill-based like you do have those friends that want to like each do a specific role and work as a team and do all this stuff like why aren't you that way about this game with evolve no with left for dead oh because sometimes it's just fun to just shoot shit",
            "start": 4917.02
        },
        {
            "text": "each do a specific role and work as a team and do all this stuff like why aren't you that way about this game with evolve no with left for dead oh because sometimes it's just fun to just shoot shit there's no better way to end this ladies and gentlemen that has been the first and last ever episode 16 of the kind of funny games cast i didn't give the rigmarole in the beginning but i'm sure you guys know by now that you can get this show early at kind of funny games patreon over at patreon.com slash kind of funny games yeah i saved cover whatever you can get it for free over on youtube.com slash kind of funny games the next week topic by topic monday through thursday full episode on friday and you can also get that audio that sweet sweet sweet audio over on itunes and a bunch of other podcast sites and then you'll probably have issues with it and you know tweet at me letting me know all your personal issues thank you for that it really does help i'm not being sarcastic i need to know if",
            "start": 4955.98
        },
        {
            "text": "sites and then you'll probably have issues with it and you know tweet at me letting me know all your personal issues thank you for that it really does help i'm not being sarcastic i need to know if there's holes in the system that we have so it's gonna plug in double ups on your your your uploads and shit not seeing the episodes let me know and let me know screenshot it let me know exactly what's wrong thank you until next week i freaking love you all right y'all ready for this oh my god",
            "start": 5001.82
        }
    ]
}