{
    "id": 1250,
    "video_id": "7MQfVYq9Nv0",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Why You Need to Play Uncharted Nathan Drake Collection - Kinda Funny Gamescast Ep. 39 (Pt. 2)",
    "description": "Whether it is your first time or not, do you need to play The Uncharted Collection?\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1444136400,
    "duration": 1219,
    "transcript_chunks": [
        {
            "text": "right now I'm playing a **** ton of Uncharted. Oh, we switching topics. We are switching top. Did it just happen or are we in the middle of it? We're now in topic. Does it shoot? Oh, it does shoot. Oh man, that's not a good idea. I know, right? Let's shoot a thing that's like the tiniest little thing that's cyborg. Everybody from the hit game Lego Dimensions lost this forever. Don't worry, they G, they send you three extras. So do they. I wish they did that when we were kids, right? Well, they learned. They lost all my missiles for all my planes and **** my GI Joe. That ain't a good idea at all. So okay, Uncharted, right? This is a very, very, very big deal to me that this Uncharted Nathan Drake collection came out because because because in uh 007 the game came out, Uncharted 1 PlayStation 3 and I did not own a PS3 at the time because I was a poor child. You don't have to make excuses. I didn't own a I was on the PlayStation team, didn't own a PlayStation year. Yeah, that was thing. But then Metal Gear Solid 4",
            "start": 0.31
        },
        {
            "text": "a PS3 at the time because I was a poor child. You don't have to make excuses. I didn't own a I was on the PlayStation team, didn't own a PlayStation year. Yeah, that was thing. But then Metal Gear Solid 4 came out, sold a bunch of games, got my PS3, super stoked about it, beat Metal Gear 4 and then I was like what's the the game that I've been waiting for. I remember there was a game I played at GameStop, there was this thing, there was a demo. I had forgot what it was. I didn't know it was Uncharted. Then I was like Google searching trying to figure it out, scouring the internet and then I saw Uncharted. I'm like that's what it is and then you saw it's that I didn't realize some white guy **** there's a lot of these people. Yeah, no, no, I didn't realize that uh which one it was cuz I remember when it was first announced and just looked like Tomb Raider like when they the first trailer for it, the guys who did Crash are doing this weird jungle game. You're like what yeah and I totally wrote it off but I",
            "start": 48.8
        },
        {
            "text": "first announced and just looked like Tomb Raider like when they the first trailer for it, the guys who did Crash are doing this weird jungle game. You're like what yeah and I totally wrote it off but I didn't realize that it was the same game that I had played a demo of and then I I bought it and I fell **** in love with it and Uncharted one to this day one of my favorite games of all time. Then two came out, I got distracted, started doing a bunch of other stuff and eventually three came out and I was like I'm gonna get to them one day. Then it got to the point where I was like all right I bought them, I bought both of them and I'm like I'm going to beat them just going to back toback beat them. Then the PS4 was announced. I'm like they're definitely going to do an HD version and I'm the type of **** that's like I want to play the like HD **** so I'm like all right I'm just going to wait for them to finally announce it. They announced it now it's **** out now I get to play it sure so",
            "start": 88.76
        },
        {
            "text": "of **** that's like I want to play the like HD **** so I'm like all right I'm just going to wait for them to finally announce it. They announced it now it's **** out now I get to play it sure so now I get to join you gentlemen y as people that like Uncharted three more than Uncharted two. So so far I've been playing the **** out of these games. Um I didn't play one cuz I already beat that before you one yeah and I recently I beat two and I'm 75% through three okay planning to beat it within the next week. So you already got to the part where Elena hangs herself. I I think I missed that part okay but uh it's not coming up don't worry about it okay um but I'm **** in love with this the this franchise and this game specifically The Collection is so good oh yeah and oh my God it's beautiful. They did such a good job of making last gen look great this gen yeah and uh cuz I remember Uncharted one and how it looked and it looked great and all the I played a demo of Uncharted so I remember",
            "start": 123.68
        },
        {
            "text": "they did such a good job of making last gen look great this gen yeah and uh cuz I remember Uncharted one and how it looked and it looked great and all the I played a demo of Uncharted so I remember how these all look and feel or whatever but like this is some Next Level **** so what I want to know from you guys is cuz obviously I have a lot of opinions as a firsttime player of this **** but I want to know if you guys are excited about playing or if you've played any of the collection so far and if people that have already played the games should replay we played 40 minutes or so of each Drake's Fortune among these and and Drake's Deception um and I age with you that well first of all and I and I said this on on PS I love you but and I can't I just can't quantify because I just don't know whether it's it's necessarily true or not I don't remember that game looking that good specifically the first one I just don't remember it looking like that I remember there being a massive jump",
            "start": 169.4
        },
        {
            "text": "know whether it's it's necessarily true or not I don't remember that game looking that good specifically the first one I just don't remember it looking like that I remember there being a massive jump between one and two and a much smaller jump between two and three and I feel like the jump isn't really there anymore and I don't know if it was if it's just like they put a sheen on all this they have that's the thing is like yeah what you're saying is when you saw two after one you're like holy crap and like one looks now the way way it looked in my head you know what I mean like you sit there and you the jokes are always about Ocarina time right where you you think back and you imagine running through high R field and it was beautiful and you go back and it's just one flat **** texture and two trees you're like damn you know what I mean like I the Uncharted one playing through it again Drake fortune on the collection I was like oh this game's great I'm like they something was done",
            "start": 216.2
        },
        {
            "text": "and two trees you're like damn you know what I mean like I the Uncharted one playing through it again Drake fortune on the collection I was like oh this game's great I'm like they something was done here to make it look more beautiful you know what I mean yeah so I think as far as I understand Blue Point has and I was reading about this because I just didn't I I actually didn't I've only played Drake's Fortune in the collection Greg played all of them on our on our let's play so I don't I don't know the gist of it is that they apparently unified the combat a little bit between the games which is cool because there was differences people had a huge problem with three combat especially and I think that um pre patch I think once they patch it there was something off to that about that game with a lot of people what not I didn't really I mean I remember I remember that vaguely it's a long time ago that's like 150 games ago um but uh so to answer your questions uh I we spent a little bit of",
            "start": 249.76
        },
        {
            "text": "a lot of people what not I didn't really I mean I remember I remember that vaguely it's a long time ago that's like 150 games ago um but uh so to answer your questions uh I we spent a little bit of time but not enough to author authoritatively talk about the collection itself um other than to say that I'm sure Blue Point has done a great job as they always as yeah as they always do and we noticed some things in our Let's Plays that I'm not positive were in the original games in terms of like some weird uh like magnetism with jumps and some weird yeah like some weird like frame jumping and like I don't remember things like this but they might have always been there and I just don't know we were so enamored with these **** games who the **** knows uh but do I recommend playing them again yes they're fantastic games I'm going to play through all again I think that they're **** must playay games if you've never played them and even if you have played them I've platinumed all three",
            "start": 283.88
        },
        {
            "text": "yes they're fantastic games I'm going to play through all again I think that they're **** must playay games if you've never played them and even if you have played them I've platinumed all three of the games as say Greg on PS3 I'm going to platinum the three of them again so and it'll be easier this time because crushing is unlocked and all that um there's a there is one mode that's not unlocked yeah brutal mode is uh not unlocked and even though the trophies are not live yet uh I reached out to Sony and they sent me the trophies and so I I looked at them and while I cannot tell everyone the exact extent of the trophies I can talk a little bit about them according to my context there and they they gave me permission to say that a there are trophies gold trophies attached to brutal difficulty but what it appears to be and what we were talking about today on Colin and Greg Greg was uh there seems to be DLC attachments to each of them in onop so what I mean by that is like it's like",
            "start": 325.36
        },
        {
            "text": "but what it appears to be and what we were talking about today on Colin and Greg Greg was uh there seems to be DLC attachments to each of them in onop so what I mean by that is like it's like the core game has its core list and there are some new trophies on the core list especially for two and three because they removed the online trophies because there's no online components but then there seems to be an extended version trophy list that is equivalent to a DLC or a downable Game trophy list that has like a bunch of random **** in and in that trophy list are the brutal difficulty ones as long as like along with all these other like trophies that blue point put into the game that were not in the game originally so it seems like the Platinum might just be contingent on beating in on crushing which is manageable we've done that already um these are I hate using this word it's like such a contrived and meaningless word really but these are magical games like these are the Uncharted",
            "start": 360.48
        },
        {
            "text": "which is manageable we've done that already um these are I hate using this word it's like such a contrived and meaningless word really but these are magical games like these are the Uncharted Trilogy is special this is the cream of the crop PlayStation exclusive series not maybe the game I mean I think The Last of Us is better than all the Uncharted games but this is from the studio that made The Last of Us and this in terms of a series this is the most important pivotal Paramount Apex Series yeah for PlayStation and so everyone deserves and owes it to themselves to play these games I don't think I think the Uncharted series is event is virtually unmatched in terms of its combination of gameplay story acting writing and presentation I don't think anyone does all of that better yeah than the Uncharted series some a lot of series do gameplay better A lot of series might do storytelling better but none of them takes all that I don't think anything maybe Bioshock and The Last of Us and a",
            "start": 398.12
        },
        {
            "text": "Uncharted series some a lot of series do gameplay better A lot of series might do storytelling better but none of them takes all that I don't think anything maybe Bioshock and The Last of Us and a few other games yeah you know playing through him for the first time for all you know intents and purposes is it's it is magical it is really amazing and I'm just addicted to playing it I keep thinking about it's one of those games where it's like I want to be playing it right now I want to you know know what happens next sure it's interesting though to see that in addition to them all being masterpieces like at least so far all three of them I would say are amazing games it's crazy to see the Improvement like specifically from one to two because I loved one I think one is such a great game two is so much better it's like not even a question and I think a lot of that comes down to the fact that one was a lot harder than two and I think hard not in a like fun challenging way just to kind of",
            "start": 440.52
        },
        {
            "text": "is so much better it's like not even a question and I think a lot of that comes down to the fact that one was a lot harder than two and I think hard not in a like fun challenging way just to kind of this is **** you're head against the wall how you to survive this W this moner so many waves of **** coming and it's just like God damn it that's always been their Style with their first games too crash oh for instance you know it's like that's they don't nail difficulty levels right the first time they just don't and uh that's a very good point I mean it definitely feels like and it's not to say Uncharted one was difficult it's just compared to two two got the balance so much better it was just fun like I never felt anytime I died a couple times it was my fault I knew what I was doing I knew what I had to do better the next time that's good you know it's like when you feel like you're being rewarded to constantly keep pushing forward it's great and I think that the one was a little",
            "start": 477.68
        },
        {
            "text": "knew what I had to do better the next time that's good you know it's like when you feel like you're being rewarded to constantly keep pushing forward it's great and I think that the one was a little bit repetitive like it was you know very much you you climb a bit then cut scene cut scene and then you shoot a bunch of **** and people just keep kind of coming and then there wasn't too many set pieces in one like there was there was a few like you know key things but especially not compared to two yeah I guess setpiece is kind of the wrong place maybe we a wrong word maybe Arena Arena makes yeah there'd be like an arena thing and then a puzzle and the puzzle just slows everything to like a crawl where all of a sudden it wasn't this forward moving thing it's like all right I need to stop and think about this stuff I definitely think the puzzles are the weakest parts so far and that that also goes into two I feel like two's pacing was so much better where it had that same format but",
            "start": 516.56
        },
        {
            "text": "and think about this stuff I definitely think the puzzles are the weakest parts so far and that that also goes into two I feel like two's pacing was so much better where it had that same format but they'd switched up a bit more and the Arenas never felt as similar to each other like I guess the terrain and being able there was a lot more verticality in two than one for sure and also just the locations being different made it feel more fresh like being in a City compared to just a jungle the whole time yeah and like it the the snow and there just so many different you know variations on environments and that made it a lot better too but then whenever got to the puzzle Parts I was always just like H man like I know what I need to to do here this isn't fun like the idea of looking at the journal and you know figuring out the clues of how you need to do stuff it's cool and it's like Nifty you know but Nifty is the best way I can put it which is like that's not a good thing it's just like",
            "start": 560.08
        },
        {
            "text": "and you know figuring out the clues of how you need to do stuff it's cool and it's like Nifty you know but Nifty is the best way I can put it which is like all right I guess that's unique and on the PS4 you hit the little like trackpad thing but then you don't turn the pages with the trackpad you turn it with the the it's like those sections were the one things that I'm like oh this isn't perfect having said that I still think it's fun you know amazing as perfect of a game as it can be but like there's you know I'm just giving my gripes my my small minor gripes here um but yeah those sections it was like the puzzles are all so obvious and it's like okay I know what I need to do why do I need to look at this picture and match these things that takes three years to you know rotate all this stuff it's like that it's when it stopped feeling like oh my God I'm playing through a movie and oh I'm playing a video game sure they're learning yeah exactly",
            "start": 601.96
        },
        {
            "text": "three years to you know rotate all this stuff it's like that it's when it stopped feeling like oh my God I'm playing through a movie and oh I'm playing a video game sure they're learning yeah exactly and like again I haven't beat three yet although 75% send into three I've already seen more of those **** type puzzles than were're in two at all without spoiling what did you think of the beginning of three did you did you know that that happened did I know that that happened uh after the intro the don't say it okay yeah no I didn't very cool that's like my favorite moment in any Uncharted game oh yeah um it's it's been very yeah I don't want to spoil anything for anyone but three so far is the one that I'm most intrigued cuz I'm like What's Happening like I don't know where this is T yeah yeah yeah yeah is he crosseyed or is that just a glitch it's in a cut scene I was looking at it must be a glitch in the cut scene you're looking at cuz I thought that was part of his character like",
            "start": 643.96
        },
        {
            "text": "yeah yeah yeah is he crosseyed or is that just a glitch it's in a cut scene I was looking at it must be a glitch in the cut scene you're looking at cuz I thought that was part of his character like that's like that's weird K Mar Marlo's cross-eyed friend um but the biggest issue I had with two is the puzzle parts and the fact that it it felt a little just a little too long like I feel like we could have shaved off maybe 10% like one last all right now I have this clue oh but this clue is not the final thing this clue just shows I need one more place to go it's just like I felt like it was just the same story beat over and over and over um and three is definitely already kind of remedying that so it is cool to see the progression of them learning how to change it up and stuff and it's it's two was essentially one again but bigger and better see that was my problem with too and why I think I when we talk about this I always talk about why I think I like three more just from a story",
            "start": 688.76
        },
        {
            "text": "it's two was essentially one again but bigger and better see that was my problem with too and why I think I when we talk about this I always talk about why I think I like three more just from a story perspective is the fact that I thought two was supercharged one in like beat by beat of all this stuff's happening all right this guy's going to betray you all right this is going really beat by beat like there's story ele guess what there's a supernatural twist you're like what the **** no this is out of the blue okay whatever you know what I mean it's like and that worked the first time yeah oh the first time I remember playing like holy cow and the second one I was like I'm predicting everything that's about to happen you know what I mean like I'm aware not not like specifically but in terms of I me I but I essentially predicted like once the supernatural stuff in two happened I knew the s of it essentially cuz like it's just it's very obvious if you played the first game um yeah",
            "start": 737.96
        },
        {
            "text": "terms of I me I but I essentially predicted like once the supernatural stuff in two happened I knew the s of it essentially cuz like it's just it's very obvious if you played the first game um yeah already playing the third one I'm like man this is different like the way they're handling the story is so different um the environments again and all that stuff and then the gameplay changes too like it's just it's it's fun that like the opening scene of three is the bar fight yeah the barf fight amazing amazing and totally unlike the uh opening of two or the opening of one and I think that's good because they totally could have just again you know two with the big with the the train hanging off the thing they could have just done that again with three where it's like here's another crazy ass thing situation where the bar fight was like totally unexpected and and fun and really it was cool and what happens after the bar fight it was just like what the **** what's going on here and for a",
            "start": 773.28
        },
        {
            "text": "thing situation where the bar fight was like totally unexpected and and fun and really it was cool and what happens after the bar fight it was just like what the **** what's going on here and for a while it started feeling a little tutori but it's the beginning of a game know shit's going to happen but yeah so far three has been a lot slower and there hasn't been any any moment that I'm like **** **** this is awesome two has some of those like uh I tweeted about this everyone always talks about this train sequence being the most amazing thing in the world yeah now that I finally know what they're talking about holy **** that was amazing that is a video game setpiece 101 everyone every game designer should look at that be like this is how to how to make fun you know yeah yeah um having said that that wasn't my favorite set piece in the game I think that the uh the the building scene oh right right right right like that was better than the train scene like that was definitely",
            "start": 815.76
        },
        {
            "text": "having said that that wasn't my favorite set piece in the game I think that the uh the the building scene oh right right right right like that was better than the train scene like that was definitely something that had me be like oh **** I am engaged with what's happening see and it's one that's interesting how much do you know about three sequences and all right great perfect I telling you because there was a big one that was ruined in a commercial right that then spoiled it for when we were playing it in three but I think what you're talking about two in particular is the fact that they hid the train forever and the part with the building you played through multiple times at E3s and preview events and everything else so like that's probably why I get swept under the rug in terms of critics and press opinions so we knew about it I remember I think I described that point by point in one of my first previews of it you know what I mean like people knew about that yeah whereas yeah",
            "start": 858.44
        },
        {
            "text": "critics and press opinions so we knew about it I remember I think I described that point by point in one of my first previews of it you know what I mean like people knew about that yeah whereas yeah what you're talking about cuz I did not it's funny cuz I knew about the train at least being a big thing didn't know about the building so when it was happening like what the **** is happening right now yeah my favorite sequence I won't spoil for either it's not even what Greg's talking about either in the commercial is is my favorite my favorite set piece and favorite scene sequence in you'll know it I think when you get there once you once you beat three I'll ask you about it because it's I think it's **** extraordinary and I think it's actually one of the overlooked ones from the entire series but will do you know what I'm talking about no I've no you've given no details on what you're talking about I don't want to say I don't want I don't want to I want him to I don't even want him",
            "start": 894.56
        },
        {
            "text": "series but will do you know what I'm talking about no I've no you've given no details on what you're talking about I don't want to say I don't want I don't want to I want him to I don't even want him to know it exists okay oh when Elena hangs herself exact **** and that's the other thing my God man the characters like I knew I loved them like even in one they were so great but two really solidified like man I care about these characters I care about their relationship so much and it's like they added all the new characters they added in two I **** loved the villains **** hate them you know uh lazarovich whatever but the the other B and angry I'm drink this stuff and I like that he calls him lazarovich that is the **** the dialogue is just so good everything Suly says period it's just the best amazing yeah um the El godamn Dorado El godamn Dorado and uh in three he has another godamn line that I really liked but I it's it's blank right now yeah yeah it's fun I don't like I am",
            "start": 930.72
        },
        {
            "text": "just the best amazing yeah um the El godamn Dorado El godamn Dorado and uh in three he has another godamn line that I really liked but I it's it's blank right now yeah yeah it's fun I don't like I am the opposite of Colin where I I loved those games and I had fun pla I mean I just don't I'm not psyched to do it again you know what I mean like I wouldn't I feel like when Last of Us was coming to PS4 I was like yes I've been craving replaying Last of Us awesome and I sat down the weekend and I got to the dam and I was just like I'm not feeling this like it's just not the same and I don't and like granted Uncharted are a bit different because every we had the Platinum so it was backwards forwards I reviewed them I knew those games you know what I mean and so maybe that's part of it and I just don't want don't feel like going back and doing it again I loved those games if you've never played them I would say yeah for sure play them but if you're like you asked earlier you know if someone",
            "start": 972.48
        },
        {
            "text": "don't want don't feel like going back and doing it again I loved those games if you've never played them I would say yeah for sure play them but if you're like you asked earlier you know if someone hasn't if you've played him before should you play him again like that's a eye of the beholder kind of thing I just don't have it in me I don't think see what's interesting to me is the the changes that they made like the physics stuff and they did make the games feel from what I I've been reading they made all three of the games feel more similar to each other and uh just the controller alone makes it so much better like weird to play and use the triggers yeah being able to use the trigger and like to reload with R1 and all this stuff like oh my God like it feels so much more natural than the PS3 controller did and I never really had an issue with the PS3 controller that cuz you can switch back to L1 and R1 and I did like I'm like that's just how you play these games like that's that's",
            "start": 1009.56
        },
        {
            "text": "PS3 controller did and I never really had an issue with the PS3 controller that cuz you can switch back to L1 and R1 and I did like I'm like that's just how you play these games like that's that's it's going to be weird going on Uncharted 4 I'm sure they'll give you maybe give you the op but I feel like these games like where they there're I'm just used to playing them with L1 and R1 and when I tried to play the triggers I'm like I can't I can't play like this it's not doesn't feel right this isn't what Neil Druckmann imagined and then I in playing I I probably should have waited this but it didn't really spoil anything anyways but 5% through three last night before I went to bed I pulled up the Uncharted for like trailer like oh my God I am so excited for this like oh it's going to be so fun good yeah so after IB3 I'm going to play Golden Abyss and I'm very very excited I'm just in like a **** good but going back to you replaying it it's like these games are similar to movies in the sense",
            "start": 1044.4
        },
        {
            "text": "yeah so after IB3 I'm going to play Golden Abyss and I'm very very excited I'm just in like a **** good but going back to you replaying it it's like these games are similar to movies in the sense that like some people like rewatching movies over and over and other people don't and like I for me I can't imagine really wanting to go back and play these Uncharted games again after I already beat them like it's the the gameplay is amazing but the gameplay is a tool to progress the story and I love that because it's like this is all right one last topic I want to talk about before we move on is subtopic in this topic yeah the subtopic within this is the fact that it's crazy how earlier I was talking about how different Generations have control schemes that kind of just change or whatever and um playing going from playing Metal Gear Solid 5 because I put that on hold to play this sure it's crazy that Uncharted just does not feel right like MGS 5's action just like going around shooting",
            "start": 1084.32
        },
        {
            "text": "um playing going from playing Metal Gear Solid 5 because I put that on hold to play this sure it's crazy that Uncharted just does not feel right like MGS 5's action just like going around shooting and everything and like the stealth and all that I'm like this feels **** awesome and then playing this it's like oh man this feels a little off and it's like I know it's just because I was just coming from that these are games that are 10 years old hard to go back that was the thing of playing the Uncharted opening where we're like stealthing around trying to take out those guards and I was in the fountain and I like creep over or creep over behind the guy and like you snap to cover and come around and then it's like all right I hit the square button to grab him and I just stand up and do a whiff a punch at his head and alert him and I was like like wa where's The Sweet Spot like that felt that would have been in Metal Gear The Sweet Spot to get up and choke the guy and but it's like",
            "start": 1127.2
        },
        {
            "text": "a whiff a punch at his head and alert him and I was like like wa where's The Sweet Spot like that felt that would have been in Metal Gear The Sweet Spot to get up and choke the guy and but it's like okay this is I got to figure this out this isn't that game this isn't that thing because of time and that's the the cool thing for me is like you know I took a took a break from Metal Gear because I wanted this linearity and it's just like man I wish Metal Gear did play a little bit more like this story-wise yeah because I'm just I just want to just get through this thing and be constantly rewarded for what I'm doing but just pure like the the feeling of how the character feels and how you feel in control of the of what you're doing like snake is just so much more like on point and I not wait for Uncharted 4 like I think Uncharted 4 is just going to merge those two to be this **** perfect experience for me personally yeah um yeah",
            "start": 1165.76
        }
    ]
}