{
    "id": 1251,
    "video_id": "7tFLlem81SY",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Was Earth Created Last Thursday? - The GameOverGreggy Show Ep. 96 (Pt. 2)",
    "description": "Colin Moriarty brings up some deep shit.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1444114801,
    "duration": 1367,
    "transcript_chunks": [
        {
            "text": "Colin, yes. What's your topic? Bring my phone. So I'm going to go back on my phone. So let me give you a little setup here. Uh, I wasn't on the last episode or maybe last two episodes, uh, because I was gone for a while. I had to go home. My best childhood friend, Mike Pop, had gotten married and, and, uh, so I went to. We across street from each other and about. That is Mike Pop aware of how many times he name checked on the show? Watch it or? He has no idea. Actually, does watch this stu- he do? Um, actually think r listens to it. I w camera and said he but, uh, so Mike and I grew up across street from each other and, and I I had so to give some context, like I had grown up on the island. I was born and raised there and then I was in th grade. I moved to New England for five years and I would only spend summers on the island and then I moved back and my dad sold our old house and bought a new house and I moved across street from Mike, who was this guy I knew and we became very close friend. So he put, you know, 18",
            "start": 2.85
        },
        {
            "text": "Island and then I moved back and my dad sold our old house and bought a new house and I moved across street from Mike, who was this guy I knew and we became very close friend. So he put, you know, 18 years later I was at his wedding party and so I had to go to Connecticut. He married this really nice girl, um, Cassandra and, uh, so I had to go to Connecticut and where her her family, um, her like her step family is very wealthy. They have this beautiful estate in like the middle of nowhere, just woods and, um, it was awesome and, uh, no service, but I was with a bunch of my old friends, um, and one of them is a professor now in college and he brought up this. We were we I was basically just drinking the entire time I was there, like one would do when you have no service and we're staying in this house from 1730 and we would just sit in this around this fire pit outside of it and chairs and just like chat about things until, you know, all hours in the morning and he brought up this thing that I thought",
            "start": 61.08
        },
        {
            "text": "1730 and we would just sit in this around this fire pit outside of it and chairs and just like chat about things until, you know, all hours in the morning and he brought up this thing that I thought was interesting and so indulge me if you will for a minute. I want to explain you what it is and then I I want to ask you what you think of it. It's called the Omphalos hypothesis and it has another name and get to that in a minute. And the hypothesis is the argument. This is according to Wikipedia, this will be the best way to boil it down is the argument that God created the world recently in the last 10,000 years in keeping with flood geology, which you would know about went to Catholic school, but complete but complete with signs of great age. Okay. So you guys understand that in other words, the argument that God created the recently but complete with signs of great age. So put in the fake exactly disy really good brush it says the idea saw some revival in the 0th century by some creationist who extends the",
            "start": 104.56
        },
        {
            "text": "created the recently but complete with signs of great age. So put in the fake exactly disy really good brush it says the idea saw some revival in the 0th century by some creationist who extends the argument to light that appeared to originate in far off stars and galaxies. Many creationist believe that Adam and Eve had no navies and that the trees in the Garden of Eden had no growth rings. So this is like a creationist kind of idea held by some people that believe in in the young Earth that it's so young, but that they acknowledge that there are signs that make it seem like it's old, but it's not. So if you were to cut down a tree in the Garden of Eden, there would be no rings in it or Adam and Eve weren't born from anyone. Eve was from Adam's rib and Adam was created by God. So they have no navy since there was no and so that kind of stuff. Okay, I'm trying to find. So this got us talking about the criticism of it and then something called last Thursdayism, which I think is a really interesting",
            "start": 144.72
        },
        {
            "text": "since there was no and so that kind of stuff. Okay, I'm trying to find. So this got us talking about the criticism of it and then something called last Thursdayism, which I think is a really interesting puncture in the idea of ​​this and I'm curious what you guys think of this. So, um, it says, when did false history begin? This is what Wikipedia says and this is what we were talking about. It says they're talking about an arth Nam Ghost and they say, although Ghost's original hypothesis specifies a popular creation story, others have proposed that the idea does not preclude creation as recently as 5 minutes ago, including including memories of times before created in situ. The idea is sometimes called last Thursday as in by its opponents as in the world might as well have been created last Thursday. The concept is both unifi and unfalsifiable through any conceivable scientific me other words, it is impossible even inp to it to any form of test by reference to any empirical data themselves are",
            "start": 189.2
        },
        {
            "text": "the concept is both unifi and unfalsifiable through any conceivable scientific me other words, it is impossible even inp to it to any form of test by reference to any empirical data themselves are considered to have been arbitrarily created to look the way they do at every observable level of detail. Sorry, noad finish before we start and this is one of my big things. They have on Wikipedia says a fake creator says from a religious viewpoint, it can be interpreted as God having created a fake such as illusions of light in space or stellar explosions that never really happened or volcanic mountains that were never really volcanes in the first place and never actually experienced erosion. The conception therefore drawn reb from some theologians, um, and then it says to make I say the show never happened false meme of this show. This is the false meme looking things you can a lot about, but I was curious about that. So there's idea, you know, young Earth creationism, I mean, kind of gets into it",
            "start": 234.92
        },
        {
            "text": "happened false meme of this show. This is the false meme looking things you can a lot about, but I was curious about that. So there's idea, you know, young Earth creationism, I mean, kind of gets into it that cuz we were talking about dinosaur bones and all that kind of thing about how people people think those things, you know, some people think those things were buried and the idea of ​​like the earth isn't that interesting that you could take this idea of ​​like the earth was created 10,000 years ago and God's tricking everyone. It's like, well, you don't know that the earth wasn't created 5 minutes ago actually based on the same exact principle and I'm curious what you guys think about. Hold on, that that doesn't make sense. Although because it's a hypothesis, right? That it wasn't then we do know it was 5 minutes ago, you know, the memory can be implanted in your brain. Well then, yeah, then cu the remember the first GameOverGreggy Show? That's a made event. This is the only real thing now. This is the",
            "start": 283.08
        },
        {
            "text": "it was 5 minutes ago, you know, the memory can be implanted in your brain. Well then, yeah, then cu the remember the first GameOverGreggy Show? That's a made event. This is the only real thing now. This is the only real thing yoube.com of funny and figure it out that could be the same thing like God could have just put that there just like you put the dinosaur bones, just like you put the volcan that never actually erupted and the tree that has no rings in it. So he still put signs no the idea. So he's making up as he goes. The idea is I guess the principle curious think about this is that the 10,000 year old thing is completely arbitrary. It could have been any time because like because the argument is like did Adam and Eve have Adam specifically has false memories? Did he know that he was created? Did he know that he didn't have a navy and that was weird, you know, like me, I don't think he was thinking about that. I've never once thought about my belly button. I hate it the most thought I've ever",
            "start": 327.68
        },
        {
            "text": "he know that he didn't have a navy and that was weird, you know, like me, I don't think he was thinking about that. I've never once thought about my belly button. I hate it the most thought I've ever put in my belly button ever was. Oh, who that gu B but going out mine's not. I'm kind of happy about that. That was it. Okay, I can my finger in deep Andes it smells weird like. Well, I'm not smelling mine. You got smell it. You got to do tomorrow when you're before you get like all wet in there and smell your finger. It's not good. May it's just fact. I think Kevin smells weird. Clean it. Although well, yeah, but it doesn't matter smell cleaned it clean, you know, I take like you Kevin. I don't I don't think that I don't think ever smelled my belly button, but I'm going to do that now. Bad. It's bad SM weird. It's kind like don't do it like in front of us. No, that's your dick it every day it three times a day withing. That's not going to feel good, Kevin. If you had to a cheese that your belly but the if you to",
            "start": 369.16
        },
        {
            "text": "don't do it like in front of us. No, that's your dick it every day it three times a day withing. That's not going to feel good, Kevin. If you had to a cheese that your belly but the if you to choose to believe in theory that it doesn't matter like all is it basically pro that you have to have fai is that the whole concept of like it doesn't necessarily matter when things were created that you're supposed to have ways faith that God is the creator and that's it. The idea to me was that I mean, I think people can interpret it in different but to me I was curious about what you guys thought about it was it says to me that faith is probably arbitrary because there's there's another quote in here that I think is really interesting. Um, let me find it here. Yeah, so this is from I don't know some writer says God created God essentially created two conflicting accounts of creation, one in nature and one in the Torah. So it's the t is the old so or the Jewish Bible. So it's it's the Torah or the",
            "start": 424.84
        },
        {
            "text": "writer says God created God essentially created two conflicting accounts of creation, one in nature and one in the Torah. So it's the t is the old so or the Jewish Bible. So it's it's the Torah or the Old Testament like Genesis conflicts directly with everything we see in nature and it says how can it be determined which is the real story and which is the fake design to mislead us? One could equally claim that it is nature which presents the real story and that the t tested us with a previous history. My is why what's the point of that isct what this is of what I drew out of our conversation yeah when I was you know 7000 be deep this this was the question I wasing which wasn't just indicating to us that this is all nonsense like why would God trick us at all? I don't know because like it's kind of fun, you know, they red shift, which is a which is how we know that everything's moving away from us in right space like things shift, you know, the um spectrum shifts red when things are moving",
            "start": 480.96
        },
        {
            "text": "kind of fun, you know, they red shift, which is a which is how we know that everything's moving away from us in right space like things shift, you know, the um spectrum shifts red when things are moving away and since everything shifts that way, we know that the universe is expanding and that everything is moving away, but their suggestion is that God created the red shift to trick us and it's like why it seems like it you're going like a lot of things with people that are hardcore uh into religion, it seems like you're going a very, very long way to explain something is to exp the other. I like people there's religion i it's right or wrong to believe in organized religion at all or in anything. I mean, I'm not going to sit here and be like your belief structure is incorrect or wrong. Um, but when you go that far into when you go that far into putting elements out there that cannot be disen then like why why what does it matter if you just believe what you're going to believe metaphoric you you",
            "start": 533.8
        },
        {
            "text": "go that far into when you go that far into putting elements out there that cannot be disen then like why why what does it matter if you just believe what you're going to believe metaphoric you you got look at notal stu but more like ideas and like well no there are people that I mean these people specifically talking are at it literally literally and they're setting up the argument so that you can't disprove it ever, right? Because what they're doing is you're taking the idea of ​​logic and just basically throw it out the window for allens purposes. If I'm not mistaken, you cannot thing that is canot be proven me logic or anything therefore we're always right, but inverse talking about is the inverse argument is or you're always wrong. Yeah, you sound like we're like God's boyfriend or girlfriend so just like no matter what we defin God's boyfriend because no matter what God says he's always right and we're always wrong. So we're the guy in this situation or at least we're God's husband says",
            "start": 588.76
        },
        {
            "text": "so just like no matter what we defin God's boyfriend because no matter what God says he's always right and we're always wrong. So we're the guy in this situation or at least we're God's husband says based on my relationship with my wife and God never does the dishes. I always have to do them. Um, but it's fascinating. It's you know what that reminds me of is a conversation we had a week or two ago talking about Elon Musk where you were talking about the two questions that he asks people interested ideas to put him in a room with a creationist and be like because of the his we're in a freaking simulation and no one knows how long the uh the world's been around, right? Like are we in the simulation? Does that matter? Can we ever prove that or just prove that? Yeah, the Matrix and all that the I mean that's not what the Matrix popular that idea I guess exists in a simulation, but yeah, just it was one of those things where never thought about it we talk religion andi on show so I don't re those",
            "start": 640.68
        },
        {
            "text": "that's not what the Matrix popular that idea I guess exists in a simulation, but yeah, just it was one of those things where never thought about it we talk religion andi on show so I don't re those topics more like if you just reverse engineer the of God faking it then we literally could have been here minutes ago like he could snap exist we would know implant with fake thoughts. It's the same it's the same exact thing. We have no idea that last Thursday actually happened, right? IDE right people do Earth. I'm not judging we relig lot of Christians for instance I speak for that maybe I know best do believe the Earth is 5 billion years old and like believe that the universe is 13. or 13.5 billion years old and do believe that you know there were dinosaurs and that humans are only 100,000 years old or so and st like that. I mean like so there's a lot of acknowledgment of like scientific truth, but there are people that hang on to these things where it's like yeah God put a volcano here that",
            "start": 680.16
        },
        {
            "text": "old or so and st like that. I mean like so there's a lot of acknowledgment of like scientific truth, but there are people that hang on to these things where it's like yeah God put a volcano here that looked like it erupted 1 000 years ago, but it never actually erupted, you know, and I'm like like what the you talk what's the point behind that is just to that I mean that's a hardcore. Oh, I'm sry Kevin's not m with picture. Kevin is the most by far distracting element on just do your job and he'll do his swear to J and do his J swear to earlier. He was doing that yoga that you do on planes, you know, where you're seated, but like seated yoga so he like arms I can't reach things. He's turned the fan off. He knocked a Starbucks cup over a little bit then sit the Starbucks C you and have to switch. I might have to God. You guys don't get it then you're going him all the fascinating animal. Yes, I've said that before you could be the man cur remember that was the thing when you were being smelly",
            "start": 734.08
        },
        {
            "text": "I might have to God. You guys don't get it then you're going him all the fascinating animal. Yes, I've said that before you could be the man cur remember that was the thing when you were being smelly one day or something thre to trap you back there when you were smelling. Anyway, anyway, I just I just don't get the idea what does it matter like why prove 10,000 years is it just simply to prove Adam and Eve the the beginning of kind of like like conspiracy theories kind of like people I feel like people believe these things just so like they can believe something different like it's it's just like kind of a different like I want to put my faith in this just to believe this, but like are you just doing it so you can use it as like a like a conversation topic like have you ever heard this topic? I think it's it's that thing when like you know how sometimes I talk out of my ass 90 99 time and then like this thing happened and it's true and you go no Nick it's not true and there's that thing in",
            "start": 775.68
        },
        {
            "text": "think it's it's that thing when like you know how sometimes I talk out of my ass 90 99 time and then like this thing happened and it's true and you go no Nick it's not true and there's that thing in human brains that go well they just disproved this but because I chose to believe going I have inad my friends Andy figure out Sing this I'm going to go the opposite way and just say no I believe this you're wrong and but it's taking that to the extreme of saying like not only are you wrong but I've just made up a bunch of different criteria why excuse you have neat right um and so and it sucks and it is sort of like it's basically arguing with someone who has thrown logic out the window. I'm making things up right now that so far out of left field that of course you disprove it because impossible to or disprove and where we're right now and it's impossible there's it's impossible arguing with person who has chosen to completely abandon all logic you just can't do it and granted I could",
            "start": 822.36
        },
        {
            "text": "to or disprove and where we're right now and it's impossible there's it's impossible arguing with person who has chosen to completely abandon all logic you just can't do it and granted I could be wrong but we never prove it one way the other so all I can prove is what I can see and what other people can prove you won't know until it's too late ian is real. I talked about with my dad a little bit about you know specifically about purgatory and stuff about you know I'm not a believer but I live a good life so I probably go to purgatory and I won't know that until I go to purgatory, you know like and my idea was like would God smite me or if I went to Saint Peter at the Gates would he let me in even I didn't believe because I was good. Well Tim would talk his way into the Gates easily. Tim and would be inside like we get you in just wait just wait go get Mike go get mik go get Mikey mik mik told me I come in who's m m just go get Mike I want m 5.7 billion mik show up put you pits of hell",
            "start": 872.64
        },
        {
            "text": "would be inside like we get you in just wait just wait go get Mike go get mik go get Mikey mik mik told me I come in who's m m just go get Mike I want m 5.7 billion mik show up put you pits of hell even messing with ster but yeah I don't know it was interesting to me just in the sense that you know I it's kind of what you said Nick like where nature the natural world around us tells us a lot of things and this is what always inf me about the Old Testament the New Testament doesn't really bother me that much. I mean there's things in it that are ridiculous but the old the Old Testament is just completely ridiculous everything about and BS the story itself is just totally out of sequence anyway like they're creating things out of order compared to like the way the natural order like the way like the way a planet sun would be creating and then the planets around it and all that kind of stuff and then people are like well it's just it's just a story it's just you know I'm like",
            "start": 917.8
        },
        {
            "text": "the way like the way a planet sun would be creating and then the planets around it and all that kind of stuff and then people are like well it's just it's just a story it's just you know I'm like but this kind of stuff comes from people that take it literally so that's that that's so there's not even agreement there where some people like no it's an analogy based on millions or billions of years whatever but then you get the human element in it with Moses and all that kind of stuff and and you know the flood and Noah and none of it makes any sense but there's like all of this stuff that just puts it together anyway in a way that makes the most sense to people and to me it's just like I feel like the ancient you learn a great deal about the Old Testament I think you can learn a great deal especially about the New Testament about how to live a good life but um maybe we should just acknowledge that these are old fables and doesn't mean there's no God it just means that these were",
            "start": 963.16
        },
        {
            "text": "deal especially about the New Testament about how to live a good life but um maybe we should just acknowledge that these are old fables and doesn't mean there's no God it just means that these were written down by humans who then like we don't even know when these things were written or who wrote them. Moses might himself might pen but like we don't know which are the first five stories of the books of the Old Testament but we don't know even know who the wrote it yet. We take it as gospel sure which is where that term came from gospel refers to the New Testament but we do know what it was written in a time when scientific advancements didn't really understand with the world around and so you had to sort of fill in the gaps with something maybe that was your imagination most likely it was um and so and and that's that's that's very dangerous is if you take them as allegories or you take them as metaphors and you take them as sort of a not literal way of living your life then I",
            "start": 1001.56
        },
        {
            "text": "it was um and so and and that's that's that's very dangerous is if you take them as allegories or you take them as metaphors and you take them as sort of a not literal way of living your life then I think it's a there's a lot more good to be had than harm but when you start taking them it literally becomes very dangerous to me and become very scary to me because what it tells me is that you are not really paying attention to the world around you. You are choosing to sort of uh live under this blanket of like this barrier between you and the rest of the world and you're just taking it blind faith in any way in any walk of life terrifies me. I don't like it. I like people that don't things and don't question things. I don't like people that follow things without question. Um, I think that I I've chosen around myself with the group of people and I always have that constantly keep me on my toes with questions and doubt and and keep me in check cuz if it wasn't for if it wen for Tam and Kevin",
            "start": 1040.44
        },
        {
            "text": "chosen around myself with the group of people and I always have that constantly keep me on my toes with questions and doubt and and keep me in check cuz if it wasn't for if it wen for Tam and Kevin I would go on thinking that you know I would I would always misquote Drake always I would be constantly singing the wrong lcs with Drake song and that's that's st way of put drinking on the low wrong that's wrong and you know it's wrong you you got me on that but I and AR that right yeah you but I no that's a different version of the song you would never know ridiculous and it's scary and it's scary because that's not how you progress that's not how we as a people progress as as humans we just we it's impossible you have to constantly be honest with yourself and it sus and you have to look out there and say oh maybe some of the world doesn't make sense maybe it's not fair maybe it won be even the way nature works is that it's not all fair and just and at the end it's all going to",
            "start": 1083.08
        },
        {
            "text": "there and say oh maybe some of the world doesn't make sense maybe it's not fair maybe it won be even the way nature works is that it's not all fair and just and at the end it's all going to even out maybe y ou know eat by bear one day and there's no there's no r or reason to it he was the wrong place according to time or to be perfly honest it's he trying to feed the be cereal for some stupid ass video or something try to get he video where like you know really needing bear dogar and Kevin like needing bear that off EB right now show things respect for people with faith and ial respect religion especially my dad religious person we were talking one night when I was home about how I wanted to believe and I go through these things where I try to believe and my mind just won't let me like it's just my mind just like this isn't real like like you know it's not real you're trying to like you and you're trying to believe it that it is real there's two things that",
            "start": 1130.12
        },
        {
            "text": "just won't let me like it's just my mind just like this isn't real like like you know it's not real you're trying to like you and you're trying to believe it that it is real. There's two things that religion gets away with that nothing else gets away with thinking about the Constitution United States, right, was written in 1787, ratified 1780, all that. We know exactly the who wrote it, we know wrote exactly it right has provenance. We don't we didn't the United States come to being like, oh, we have this document and it was copied about 5000 times from other people that wrote it and this is what we live by. Right now, but with the Bible, especially with the Old Testament, these things were copied like this was 15 500 3000 years before Gutenberg, right? So this was like there was no printing press. Nothing you had to copy them, copy them, copy them, copy them, copy them over and over and over and over and over over again. And then you get to this point to a point where you can really believe that the",
            "start": 1177.8
        },
        {
            "text": "you had to copy them, copy them, copy them, copy them, copy them over and over and over and over and over over again. And then you get to this point to a point where you can really believe that the copies are the right. So like maybe like after the church was founded, but so like early AD or whatever, but like it's the only thing that gets away with like no provenance. We have no idea who the the we have no idea where it came from. And even like in the New Testament as we talk the gospels even contradict each other, you know, like in certain places it's like it's remarkable that like we look for provenance and and and and logic and everything, but we don't look for it here. And that's why I thought this thing was interesting because it's saying like if you believe the literal version of this, then there's no reason to believe that this shouldn't happen literally 5 minutes ago. There's no reason to believe that the universe wasn't created last Thursday and I thought that that was an",
            "start": 1221.2
        },
        {
            "text": "of this, then there's no reason to believe that this shouldn't happen literally 5 minutes ago. There's no reason to believe that the universe wasn't created last Thursday and I thought that that was an interesting I want I want to bring that to you guys because it makes I never thought about it in that respect and it and it and to me was quite thought provoking not in respect of religion, but maybe an encouragement to religion and religious text whether it's the t whether it's the the new whether it's the Quran, whatever it is to say like maybe we can learn a few things from these fables yeah and these stories and I believe Jesus exists. We talked in the past it's clear the Roman histor talk about definitely did exist but maybe we can learn from these different things and live a better life but let's not be let's not talk as if we know that these things really happened because we don't. We know that James Madison wrote the Constitution, we know that the Magna was the first, you know,",
            "start": 1256.88
        },
        {
            "text": "life but let's not be let's not talk as if we know that these things really happened because we don't. We know that James Madison wrote the Constitution, we know that the Magna was the first, you know, constitution of its kind and who wrote it, we know that this happen, we know that this happened but that we have no idea if it happened yet. We believe it and that and that is that is you know that's where this came from so I want to bring it up. Yeah, it's a slippery slow it's a dangerous slow because th the argument I would take on the oppos side of the devil's advocate was well you don't know that that's just and that's last Thursday ths crazy and that's why it's and that's the beauty of the thing is that it's so frustrating because you cannot disprove it but you cannot that's the whole point that's the idea that was what was frustrating heart that's the point I can't disprove the Old Testament either because if I look at a star that's",
            "start": 1292.6
        },
        {
            "text": "point that's the idea that was what was frustrating heart that's the point I can't disprove the Old Testament either because if I look at a star that's 5000 light years away and I'm like that's 5000 light years away the light reach us we must have been here for at least 5000 years no and that's where from so I thought throw that out there and may provoke some thought interesting comments out there in the audience. I think we look at religion and religious text too literally and I think that even if you don't look at them literally we should just try to learn good things from them and and kind of understand that they have no provenance.",
            "start": 1328.4
        }
    ]
}