{
  "id": 1277,
  "video_id": "oVUTQYtMmnE",
  "show_name": "Reactions",
  "hosts": ["Colin Moriarty"],
  "title": "Tales of Zestiria Collector's Edition Unboxing",
  "description": "Colin has the latest Tales collector's edition, but what's inside? \n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
  "published_at": 1445281201,
  "duration": 305,
  "transcript_chunks": [
    {
      "text": "Greetings and salutations, welcome to Kinda Funny games. My name is Colin Moriarity. Now many of you out there might know that I'm a huge fan of the Tales series from Bandai Namco, and our friends at Bandai Namco sent me a collector's edition of the brand new Tales game, Tales of Zestiria. And as you can see on the top, I am 3rd of 5,000. There's only 5,000 of these in the world. And so I thought I'd open them, do a little unboxing for you in the style of a normal Kinda Funny unboxing, which is to say a little bit silly and a little bit zany. So the one thing I want to point out before I even unbox it is I like that Bandai Namco smart enough and cognizant enough to keep their Collector's Edition for the Tales games the same size. So the Symphonia one for instance, and the Exillia Exillia one, um they're all the same size. You can put them on the shelf next to each other. I actually quite enjoy that and I appreciate that. But let's open up the plastic and get this this box out. See if we can do it just just",
      "start": 0.04
    },
    {
      "text": "the same size you can put them on the shelf next to each other. I actually quite enjoy that and I appreciate that. But let's open up the plastic and get this this box out. See if we can do it just just going to kind of give it a little shake. I don't know. I'm going to am I going to break it Kevin? You think I'm going to break it if I give a sh no, I'll be all right. It's it's in this plastic sheath. Let me see if I can grab it. I'm going to palm it. Oh yeah, there we go. So it comes out like this as you can see here and then it's basically just got like the back of the box kind of stuff here as opposed to like some beautiful art over it here. Um so then we'll open it up and we'll see what's inside. All right, so most importantly the game, Tales of Zestiria on PlayStation 4 on Blu-ray. Uh interestingly not for resale on the back because it is the special edition one I guess. Uh let's see 13 gig install one to four players of course you can that's an old tal thing you can play with a up to four players in",
      "start": 42.8
    },
    {
      "text": "resale on the back because it is the special edition one I guess. Uh let's see 13 gab install one to four players of course you can that's an old tal thing you can play with a up to four players in battle. Um remote play on Vita of course very important as well. There's a Blu-ray in here. Tales is Aeria Dawn of the Shepherd when chaos and dark darkness threatens to engulf the land the people turn to Legends for Solus. All right all right all out. Now we have this here what's in this box what do you think it is? It's a keychain you would have never guessed it Kevin never. I think I just dropped it there it is it's a little keychain it's a little keychain let's see what it says about it limited edition retro keychain set so is there oh there's more oh dear oh these are cool ooh I like those those are kind of cool very nice all right let's see what else is in here we got okay so this is similar to the ones they did for Symphonia uh Chibi Koncha Figure Set limited edition for Tales is Aeria",
      "start": 81.44
    },
    {
      "text": "are kind of cool very nice all right let's see what else is in here we got okay so this is similar to the ones they did for Symphonia uh Chibi Koncha Figure Set limited edition for Tales is Aeria nothing else really interesting on the box you can see the little art there on the box let's just I'm going to just kind of bang this one open I'm going bang it open I don't really know what that means no I'm good thank you and then I'll put them together for you but basically they're just little chiby figures little act figures you got to put them together on their little stand so we'll do that in a moment we'll get it all out oh it smells good oh it reminds me the it reminds me of old Star Wars and T GI Joe toys when you take them out of the bubble oh that's a that's a nostalgic smell Kevin it's a very nostalgic smell all right there's more in here though we have a steel case for the game so you can do this I've never been a huge fan of steel cases because I like the the normal look of all",
      "start": 133.0
    },
    {
      "text": "a very nostalgic smell all right there's more in here though we have a steel case for the game so you can do this I've never been a huge fan of steel cases because I like the the normal look of all the games next to each other the very nice sequence of of games but if you want to have the fanciest steelc case you can use this one as well replace your standard one it has two um discs in it and this assume I assume is only one disc right I mean it must be so I assume this is also for your Blu-ray if you want to put that in there as well and finally last but not least the art of Tales of Aeria the visual Celestial record some a cool little art book here you can kind of see inside of it smells like a good new book oh yeah and you can see some of the characters in it here's Zavid for instance let see what we can find uh some of the main characters I'm going to flip through real quick let's see Alicia with her staff for instance I love the art I think the art is you know I've been to Bamco",
      "start": 179.36
    },
    {
      "text": "let see what we can find uh some of the main characters I'm going to flip through real quick let's see Alicia with her staff for instance I love the art I think the art is you know I've been to Bamco Studio a couple times in Japan and in some of the rooms they had uh adorned just the beautiful art the box art that that specific style that they've always had in Tales um the art is like one of my favorite things about the game uh for sure although the uh gameplay of course is awesome and I'm excited about Zeria specifically because this is the first game in the tail Series in a long time that's going to switch it up it's more open world the combat is more seamless instead of an arena style combat you kind of run into enemies and fight them on the field um but it still has your arts and your Combos and all that kind of stuff as well um we'll have more thoughts on the game itself on on PS I Love You XOXO our new PlayStation podcast on Kinda Funny games and I'm sure we'll talk about it",
      "start": 222.0
    },
    {
      "text": "Combos and all that kind of stuff as well um we'll have more thoughts on the game itself on on PS I Love You XOXO our new PlayStation podcast on Kinda Funny games and I'm sure we'll talk about it on Colin and Greg live as well we'll also do a let's play we'll do a let's play for it as well CU I know you guys are excited about this so thank you for joining me I hope you enjoyed our look at the Tales Aeria collector edition I'm excited to play the game you should play it too it's on PlayStation 4 available pretty much right now by the time you're watching this do enjoy and join us next time on Kinda Funny games goodbye",
      "start": 265.92
    }
  ]
}
