{
  "id": 1258,
  "video_id": "PdaA0FpE8LE",
  "show_name": "Gamescast",
  "hosts": ["Greg Miller", "Tim Gettys", "Colin Moriarty", "Portillo"],
  "title": "SO MANY GAMES TO PLAY! - Kinda Funny Gamescast Ep. 39",
  "description": "So many games! The fall rush has begun, whether it is your first time or not, do you need to play The Uncharted Collection? Sometimes you can just tell a game is going to disappoint, and we try to break down how much we have each spent on video games. (Released 10.02.15)\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
  "published_at": 1444411569,
  "duration": 6602,
  "transcript_chunks": [
    {
      "text": "Today's sponsor is Loot Crate. For less than $20 a month, Loot Crate gives the geek in you a special treat every month. Loot Crate's a subscription box service with over $40 worth of geek gamer and pop culture gear, collectibles, apparel, comics, etc., delivered to your mailbox every month. This month's theme is time, and quite appropriately, we're celebrating the 30th anniversary of Back to the Future in the month and year Marty McFly travels to in Back to the Future Part Two, the timeless appeal of Bill and Ted's Excellent Adventure, and the timey wimey charm of Doctor Who. You have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate, and when the cut off happens, that's it, it's over. So go to lootcrate.com/kfgames and enter code KF games to save $3 on your new subscription today. What's up guys, welcome to the first ever episode 39 of the Kinda Funny Gamescast. I'm Tim Gettys, joined by the coolest dudes in video games, Colin Moriarty and Greg Miller. Hi, it's good to be here. You think",
      "start": 0.04
    },
    {
      "text": "up guys, welcome to the first ever episode 39 of the Kinda Funny Gamescast. I'm Tim Gettys, joined by the coolest dudes in video games, Colin Moriarty and Greg Miller. Hi, it's good to be here. You think if I is this connected to something? Yeah, probably. Probably one of the 10 PS4s in this house. It's on console on. Yeah, all right, they were in rest mode. Nick put it back in rest mode. Nick, oh no, it's now this is a disaster. What's going on? I don't I there's much in that one. So you might know these gentlemen from this little show called PS I Love You XOXO. It's a brand new PlayStation podcast over here on youtube.com/kindafunnygames and all the podcast services you could ever dream of. iTunes, Stitcher, Beyond Pod, whatever. There's all these other ones that people use. Some people were showing me screenshots of it today in in the timeline. We we launched it today. People are putting up screenshots of us the number one on charts for apps I've never even seen before. I don't I don't know how there's",
      "start": 44.56
    },
    {
      "text": "of it today in in the timeline. We we launched it today. People are putting up screenshots of us the number one on charts for apps I've never even seen before. I don't I don't know how there's this many podcasting apps, but I'm happy that people are, you know, consuming the content where they're consuming it. Couldn't be happier with the reception that things got. So before we get into the whole rigamarole of of the Kinda Funny Gamescast, I I did want to talk about PS I Love You and Gamescast for a second. Feud in the blood. Feud, yes, but one if you haven't already, um go download it, like it, subscribe, comment, review, do whatever the hell like whatever the option is or whatever system you're doing, just do that. Help us in what give it a random score. Yes, and do that for this show as well because that would be that would be really really nice. But a lot of people are like are you guys getting rid of Gamescast because you're doing PS I Love You and I know we've addressed this a million times but mainly",
      "start": 94.88
    },
    {
      "text": "be that would be really really nice. But a lot of people are like are you guys getting rid of Gamescast because you're doing PS I Love You and I know we've addressed this a million times but mainly we're addressing it on PS I Love You. This is the first Gamescast post PS I Love You launching okay and I'm with you so far yeah so no we're not stopping the show yeah we thought we talked about this last did we I don't know we've been talking about a lot of places I don't remember Colin is life where we're like do we talk about this on Colin Greg live GameOverGreggy I said this at some point somewhere a lot of this is a big problem is the fact that we repeat ourselves a lot and we're trying to not do that and I guess we're not off to the best start but this is different because we're not talking about game stuff we're talking about our own **** semantics yes so on the Kinda Funny forums in the Gamescast sub Forum I posted a a post that's pretty much how to make Gamescast better so I",
      "start": 136.72
    },
    {
      "text": "about game stuff we're talking about our own **** semantics yes so on the Kinda Funny forums in the Gamescast sub Forum I posted a a post that's pretty much how to make Gamescast better so I definitely a lot of people gave a lot of really great feedback I wrote a really long thing with ideas I have to kind of differentiate a little bit from PS I Love You going forward whatever if you guys have ideas please go let me know your thoughts let me know what you like about the show what you don't like the one thing I need people to keep in mind is the fact that the format of the show cannot change so it needs to be topic by top here's the rigamarole and just kind of there this is the Kinda Funny Gamescast where we talk about video games topic by topic day by day Monday through th on youtube.com/kindafunnygames you get the YouTube breakouts then Friday you get the full episode and the full thing over on all the podcast services soundcloud.com kindafunnygames all that good stuff if",
      "start": 170.76
    },
    {
      "text": "Kinda Funny Games you get the YouTube breakouts then Friday you get the full episode and the full thing over on all the podcast services soundcloud.com kindafunnygames all that good stuff if you want it early you can go to patreon.com kindafunnygames get whatever you want early the video audio whole bunch of different stuff's there Colin's phone number yeah it's a hidden tier but it's there it's it is a hidden you can figure out the exact sum I was going to say you have to hit it by the exact dollars and cents that's the hard part for it and then you get it so that that'll be pretty cool but format cannot change and because of that format that means that this show will never be timely and we're never going to be talking about news as it happens and this and that and whatever that's why PS I Love You is so awesome is the fact that this is finally something where you guys are going to be able to talk about PlayStation news literally the night before it goes live you guys are",
      "start": 209.52
    },
    {
      "text": "why PS I Love You is so awesome is the fact that this is finally something where you guys are going to be able to talk about PlayStation news literally the night before it goes live you guys are recording it's going to be great we have Colin and Greg live in the morning exactly you see you start small Colin and Greg live is the one that's giving you the microscopic detail you go a little bit larger PS I Love You which is talking about the week in PlayStation so it's more of an identity problem of why are we do so many different things when we're just the same group of people talk games and whatever and like okay Tim's here Tim's not here what's the difference this show specifically isn't so much going to be about news it's going to be more about why we love video games and video games that we love and I'm going to try to get more guests and I want to have people we've been doing recently a lot of why you need to play Lego Dimensions or why you need to play Mad Max or Until Dawn or",
      "start": 248.72
    },
    {
      "text": "that we love and I'm going to try to get more guests and I want to have people we've been doing recently a lot of why you need to play Lego Dimensions or why you need to play Mad Max or Until Dawn or whatever and I kind of want to a lot more topics like that that are cuz we've kind of gotten away from doing more fully-fledged reviews even though we never really did a true review but we did review discussion sure sure and I think that the using Gamescast to kind especially now that we're in the leading into the holiday season I think we'll be able to kind of get our passions out there a little bit and like kind of just discuss the games and what we like about them what we don't like about them and by having people like Alfredo on to talk a bit about more about first person shooters having some uh Gamespot friends IGN friends whoever the hell wants to come on the show yeah to kind of pitch their games and kind of sell it to us and to the audience and the best friends and everything so",
      "start": 287.28
    },
    {
      "text": "some uh Gamespot friends IGN friends whoever the hell wants to come on the show yeah to kind of pitch their games and kind of sell it to us and to the audience and the best friends and everything so the show is it always has been this but I think now it's more the direction where before I used to say it's GameOverGreggy show but for video games it never really has been that it's just been formatted that way right so I think now it's just more like it's a show about why we love video games that's really it but but could it also be a show about why we hate video games yes yes our issues with cuz I hate video games I don't know you yeah no no we know and it's it's a thing I do too things happen but can't I I know you've been busy but I've now made my prediction that I cannot wait can't **** wait for Colin to hate the division cuz it's going to be the sweetest berries off the bush just kidding why you say that why do you cuz you're holding on to this dream this goddamn Cloud that this",
      "start": 324.36
    },
    {
      "text": "wait for Colin to hate the division cuz it's going to be the sweetest berries off the bush just kidding why you say that why do you cuz you're holding on to this dream this goddamn Cloud that this multiplayer game is going to have a single player mode that's just for you antisocial Andy but why do you why do you find such pleasure cuz I don't get I don't get out in front enough and and predict what Colin's about to do I usually know what going to do but I don't predict how you know so cuz I know you just like your **** Skyrim **** the other day I I stopped playing out of well you stopped three weeks before the problem ever his yeah you someone someone said it in the comments like I love it when Greg calls calling out on his **** and I'm like welcome back to PlayStation podcast land **** you called me out twice that podcast too because I was talking about how we still play PSP which I have in reality about PP games but I'm talking about what you're talking about I know what",
      "start": 364.4
    },
    {
      "text": "**** you called me out twice that podcast too because I was talking about how we still play PSP which I have in reality about PP games but I'm talking about what you're talking about I know what you're talking about I haven't played the PSP since Let Us Cling Together came out wow which was four years ago I think I played at GDC and then I broke my PSP oh no and that was the end of that that is sad should we talk about things that are relevant so be topic starts at 13:31 those those people were slowly weeding out the ones who want the headline and thumbnail where you want so yeah go to the Kinda Funny forums find the topic and please give me your feedback back again what you like and what you don't like and guests that you'd like to see and all that stuff cuz yeah I definitely want to start gearing it more towards us talking about why you should play games it could be old games too like we I was thinking it'd be cool to kind of like try to sell each other on why we should play",
      "start": 409.32
    },
    {
      "text": "to start gearing it more towards us talking about why you should play games it could be old games too like we I was thinking it'd be cool to kind of like try to sell each other on why we should play old games sure and uh but yeah it will also be about broader topics whether we like them or dislike them about news where it's our it's more opinion based and just like here's our thoughts on this or whatever like later on today one of the topics is going to be how we know a game's going to be bad before it even comes out and that's just a purely you know opinion thing I think that we should also do a topic about the games we've protested like I protested Skyrim on PlayStation 3 sure in the fall of 2011 which you you remember well I'm like one day I'm going to I'm going to get bonked on the head and go into a coma and I'll wake up and they'll be I'll wake up and look I we all these calling statues cuz no one was here to keep them in check somehow he's now in control so this gamees cast is sponsored",
      "start": 454.72
    },
    {
      "text": "into a coma and I'll wake up and they'll be I'll wake up and look I we all these calling statues cuz no one was here to keep them in check somehow he's now in control so this gamees cast is sponsored by Volume for the final time oh no this is the final Volume sponsorship two months in a row support for us thank so if you haven't already please go tweet at Volume game tell Mike Bithell the amazing man that created Thomas Was Alone and out Volume my dude how much you're enjoying his game or if you haven't enjoyed it yet go enjoy it it's available now PlayStation 4 coming eventually you buy it on PS4 it'll eventually be on Vita yeah waiting who knows and uh so it's going to be good so for more information follow Volume game on Twitter tell them I love them that'll be that'll be fun yeah I mean at this point it's been two month it's been this has been a serious two month long relationship yeah so the first topic of the day is a classic so people one thing that people said that they want is",
      "start": 493.28
    },
    {
      "text": "at this point it's been two month it's been this has been a serious two month long relationship yeah so the first topic of the day is a classic so people one thing that people said that they want is segments and it's hard to segment topical I know right but it's hard to to have segments out of out of just the how the topical nature of the show is but one thing that we have done a recurring segment is what are we playing now ah yes and people really really enjoy this and they like to know what we've been up to and what we've been playing I personally have been playing more games in the last two months than I have the the rest of the entire year cuz it's happening it's finally at that point where it's like these are the games I've been waiting for now a lot of the games I wanted are getting delayed which is a good and bad thing Star Fox Zero please be okay delay that back to my biggest problem all the games that I want are just turning out to be garbage and that's why I can't wait to get",
      "start": 538.64
    },
    {
      "text": "delayed which is a good and bad thing Star Fox Zero please be okay delay that back to my biggest problem all the games that I want are just turning out to be garbage and that's why I can't wait to get to the topic of how you know a bad game's coming because every time Tim opens his mouth about a game he's excited for I'm like that looks like a giant pile of crap check the box yeah yeah sign number one Tim's excited about it I mean that's so shitty though we'll we'll get there but it's like it it is very upsetting that a lot of the big games that I've waited for for so long are are just very upsetting me but I'm still going to play it I'm still going to try to see the good all of them you sound definitely like an Nintendo fan and we'll see but I'm not even just talking about Nintendo that's just Star Fox the rest of the Nintendo's lineup's fine but yeah give me that goddamn Mario Tennis they see the announce the release date today oh what is it November 20 oh you and I are going to the",
      "start": 576.2
    },
    {
      "text": "just Star Fox the rest of the Nintendo's lineup's fine but yeah give me that goddamn Mario Tennis they see the announce the release date today oh what is it November 20 oh you and I are going to the clay as they say yeah I bet by the prediction was that we'll have Fallout 4 probably a little early so let's say we have Fallout 4 first week of November we have Mario we'll probably get Mario early too so let's say we have them both a week before they come out you'll never play Mario Tennis I bet we get I get Mario I bet we get Mario Tennis before we get we have to because we already there's a grudge match going yeah Nintendo knows Greer that's an exagger that's exageration remember when Greg close I did for a month and a half which is longer than you said I would you can try to call me on my **** but I'm iron clad there's nothing you're going to find you're IR right there's no skeletons in my closet no no definitely we'll go there in the documentary we'll find the skeletons in closet",
      "start": 617.04
    },
    {
      "text": "**** but I'm iron clad there's nothing you're going to find you're IR right there's no skeletons in my closet no no definitely we'll go there in the documentary we'll find the skeletons in closet God covered in urine that I peed into a little cup and threw on them you're sick **** right you are sick **** all right so back to the video games I have been playing a lot more Star Fox is you know is a ways off now but that's a good thing for me because I'm like I need more time to be able to play all these games so a couple weeks back when I I've been playing Metal Gear obviously everybody knows this we've been playing the **** out of it I had to put it on pause because games are just starting to come out and I'm like **** I need to get on this you should probably turn it off because leaving it on pause for that long you're right it might be bad so um during one of the downloads I downloaded one one of the downloads of some Metal Gear thing that I had to wait for before I had PT",
      "start": 655.24
    },
    {
      "text": "leaving it on pause for that long you're right it might be bad so um during one of the downloads I downloaded one one of the downloads of some Metal Gear thing that I had to wait for before I had PT on my system like oh I'm just going to play this cuz I've never played it wow have you played it no it's excellent PT is awesome it is quite the experience I'm very upset that I haven't experienced it before now did you turn off the lights and sit it was just it was me me and my boy Curran did you guys get huh you guys get naked to do it to get the end the true ending you have to get naked I heard put the PS camera in the PS4 and be naked it has to see at least one dong yeah or you don't get the real I don't know if ghost is thirsty but uh man it's one of those things where I played through the whole thing I got to the end and I couldn't figure out how to trigger the you talk to the thing I was trying to do all the **** I looked at walk and I'm like doing it walking 10 steps spinning",
      "start": 696.16
    },
    {
      "text": "the whole thing I got to the end and I couldn't figure out how to trigger the you talk to the thing I was trying to do all the **** I looked at walk and I'm like doing it walking 10 steps spinning around like a goddamn it just wasn't working so I just YouTub the final video whatever I'm like all right cool um but my thing with that is like everyone's upset that we're never going to get that game like that Silent Hills game I'm I'm okay with that like that that demo was a cool experience for me I don't know how you'd make a game out of that it's one of well it's like I don't think that would have been represent uh representative of the actual gameplay of Silent Hills you know what I mean and that's the thing like when you have Norman Reedus chances are you're going to use his face you're going to make it third person like a the old Silent Hills right and have them do things and run around so I think that was just more of yeah this is the tone we're going for kind of thing and yeah",
      "start": 741.32
    },
    {
      "text": "going to make it third person like a the old Silent Hills right and have them do things and run around so I think that was just more of yeah this is the tone we're going for kind of thing and yeah that's the Bittersweet thing about it is that that was by far the best horror game I've played in years if not ever you know what I mean just in terms of enjoyment of me actually getting tense and my heart beating and like what's because it was it you know something's going to happen but it still doesn't get you like that game got you you know what I mean and so would it have lived up to that I don't know cuz like that's it's like a movie right the longer they go the more it kind of unravels in that like this bite-sized experience of like what the hell is happening I thought I mean that's a really good way to put it I thought it was really really good because it didn't overstay its welcome and it kept you guessing what was going to happen but the biggest thing is there was setups for some",
      "start": 781.52
    },
    {
      "text": "good way to put it I thought it was really really good because it didn't overstay its welcome and it kept you guessing what was going to happen but the biggest thing is there was setups for some like really easy scares and they didn't do it exactly when you thought you knew exactly what it was going to do it didn't do it yeah and I'm like oh man like that's that's the Telltale sign of a good horror movie and when you adapt that to a game and like I think that there this was you know this is one of those things where is it really a game or is it just like whatever it's like there's definitely game elements in there it's like a lot of it is just kind of like an interactive movie but it was cool like I really really enjoyed it and I saw that there's a Kickstarter for some game that's similar do you know what I'm talking about it's like oh man I'm blanking on the name right now but it looks really cool and someone's making a game that's takes place in a hallway and doesn't Goa Goa Goa so",
      "start": 816.04
    },
    {
      "text": "do you know what I'm talking about it's like oh man I'm blanking on the name right now but it looks really cool and someone's making a game that's takes place in a hallway and doesn't Goa Goa Goa so it's called TP it's no no it's called hallway horror but uh it looks it looks really cool and uh but I'm excited because I want to do like a week or maybe more of horror game Let's Plays in October for Halloween get yeah and um Fatal Frame 2 scared the **** out of me yes Amy's scary for a number of reasons and I want I want to play with Nick because he's never played and I think he's a coward he'll scare the **** out of him should how come youve never played it that surprises me uh I don't know I don't care about Silent Hills so or Silent Hill so it's just uh I don't I think the last Silent Hill game I ever really played all the way through was Silent Hill 2 which was 15 years ago so and I played Sil Hills of course book of memories the classic PSVita game remember how we were like",
      "start": 850.08
    },
    {
      "text": "Hill game I ever really played all the way through was Silent Hill 2 which was 15 years ago so and I played Sil Hills of course book of memories the classic PSVita game remember how we were like really but remember we were like it's close it's almost great it's almost a good game like it's close enough it's something to play co RPG elements and stuff like that but it was just as close as we're ever going to get to a Diablo or whatever on a thing because they got ruin or yeah Warriors layer same game yeah we should buy that and just publish it because it close enough we played it man it was done at least the vertical slice we played yeah that was done yeah yeah um yeah playing Mar maker still like I I'm in this thing now I keep just switching games like I'll be playing a couple hours of games night that I can't do that and it's just like I'll play like two hours of this two hours of this two hours of this and uh Mario Maker still has me like it's still I still haven't beat all of the",
      "start": 892.56
    },
    {
      "text": "games night that I can't do that and it's just like I'll play like two hours of this two hours of this two hours of this and uh Mario Maker still has me like it's still I still haven't beat all of the Nintendo made levels how many are there I think there's only 100 okay maybe maybe there's 60 I don't know but I'll do a little dent in that and then I'll download a couple I keep getting distracted by the of the levels you can download of course um but man that game is just awesome and I just love that it'll always just be there yeah always just come back whenever I need to it it'll be better yeah exactly um so that's that's been a lot of fun and then I'm missing out on some stuff here but the the two big ones obviously Uncharted yeah which we'll get to that's a whole Topic in itself Uncharted coming up next yes and um and then yeah I got to oh we played a little uh NBA 2K16 which was interesting yes you asked me about getting this game getting it in because you want to do stuff you got",
      "start": 933.36
    },
    {
      "text": "coming up next yes and um and then yeah I got to oh we played a little uh NBA 2K16 which was interesting yes you asked me about getting this game getting it in because you want to do stuff you got bit by the NBA bug it's a spike joint it is a spiky joint that's why I want to play I was like well crap I I that's the one thing I want to play about it and that's I mean we talk about this all the time how we had talked at the GameStop Expo about it the fact that 2K is so they're on top of the world so why do they keep trying but then they go and they do this thing right where it's been originally Jordan then it was multiple Legends now they're bringing in this bike lead directed story like I'm like well yeah I don't know anything about the NBA right now but I want to play this bike it's super interesting watching them just it reminds me of what the Patriots do to their opponents in the football where they run the score up oh okay we were talking w talking this past weekend wasn't it with",
      "start": 971.68
    },
    {
      "text": "interesting watching them just it reminds me of what the Patriots do to their opponents in the football where they run the score up oh okay we were talking w talking this past weekend wasn't it with you or was it was with charl someone where it's like there are teams that stop right like there are teams that stop trying to score they'll just run the ball right up the middle and just run the clock out and then punt the ball the Patriots will run the score up as much as they can had those stats like they scored like over 50 points against the Jaguars like totally unnecessary amount of points to win a football game and it reminds me of what NBA does or 2K does to EA because it just gets worse and worse for them for EA with like you were telling me and I went and looked like the NBA Live 16 glitch reels or whatever are the **** funniest things I've ever seen shooting the free throw and you turn around and shoot it across how could it be so how could one game be so good one Series be so",
      "start": 1010.28
    },
    {
      "text": "reels or whatever are the **** funniest things I've ever seen shooting the free throw and you turn around and shoot it across how could it be so how could one game be so good one Series be so good and it is it's Immaculate and the other Series be so bad even after years of trying and even after taking time off and even after making a game as we talked about and not even releasing it that was the funniest thing I think it was NBA Live 1 or maybe 11 where they what it called NBA Elite yeah might have been when we got it yeah like the game existed and they just never released the game because the the mock reviews were probably so devastating that they were like It's let's just not yeah like it's it's going to kill this franchise but what they I don't it's just so funny like every year because I don't play these games really I'll mess around with NBA 2K or whatever you know once in a blue moon like when PS4 came out we fued around with it but I don't understand how they keep **** it",
      "start": 1048.08
    },
    {
      "text": "I don't play these games really I'll mess around with NBA 2K or whatever you know once in a blue moon like when PS4 came out we fued around with it but I don't understand how they keep **** it up like how it the disparity doesn't only exist and persist but grow after like time and time again it's a great Testament to 2K I'm sorry to interrupt but I just wanted to I wanted to throw out there cuz I they're on top of their game like the NBA a lot a lot of people NBA 2K is the best sports series by far and that really says a lot because NHL is really great Madden's great FIFA's great Etc all these EA Games and I someone I think it might have been on the Kinda Funny forums or maybe was on the Facebook group someone was saying like why doesn't NBA 2K get considered for Game of the Year like when when Game of the Year comes around it's so good I think it's I mean the problem is is the fact that it's so up one person's alley yeah I like it's literally what what I think speaks volumes",
      "start": 1087.8
    },
    {
      "text": "like when when Game of the Year comes around it's so good I think it's I mean the problem is is the fact that it's so up one person's alley yeah I like it's literally what what I think speaks volumes about NBA 2K whatever this year's you know 16 is the fact that I'm not an NBA fan in this game always finds a way to make me interested when it was Jordan I was like well yeah I got to play that and then it was more Legends next year like I don't need to I'll try and then this one it's like Spike Lee directed yeah okay sure I don't I'm going to be terrible at the gameplay I'm probably they're doing something cool and different so so anyway sorry it how is it yeah so my thing with it uh so Alfredo is huge into the NBA 2K series and like there's a obviously a very large group of people that are in love with this franchise and the thing that like from talking to him about is they every year they do something so radically different and they just keep changing things up so that it is",
      "start": 1124.36
    },
    {
      "text": "that are in love with this franchise and the thing that like from talking to him about is they every year they do something so radically different and they just keep changing things up so that it is consistently good and there is always something new so it isn't just this year sports game over and over I mean you know at its core it's basketball right but but even then it's like you make a once you perfect the engine what do you do yeah exactly so for me it's funny because I obviously I'm not a sports guy at all but you know sports are games at their purc form so it's just like they translate to video games well you know I remember you know basketball ball games were kind of the standard it was one of the it was a genre you know like I remember it's like oh I want a racing when I was a little kid I was like I want a racing game I want a basketball game all because it was just that made sense I understood it right like and I was huge into the more arcadey stuff so NBA Jam and",
      "start": 1162.6
    },
    {
      "text": "was a little kid I was like I want a racing game I want a basketball game all because it was just that made sense I understood it right like and I was huge into the more arcadey stuff so NBA Jam and specifically NBA Street but those a pick up and play you know what you're doing and whatever I'd messed around a little bit with the lives back when lives were good and 2K on its early days but like I never really got serious into it because I don't really care too much about sports but haven't played one for a long time and I was like oh see I'll just pick this up and see how it plays now first observations having not seen a game like an NBA game for probably a couple years it's like good Lord beautiful right beautiful when whenever mcaffry was reviewing these I'd walk by you do that double take yeah it's like what oh yeah there's some buttons on the screen that's just watching TV that's the the craziest thing is like we say that and it's funny because I'm sure we've said that three years",
      "start": 1203.76
    },
    {
      "text": "yeah it's like what oh yeah there's some buttons on the screen that's just watching TV that's the the craziest thing is like we say that and it's funny because I'm sure we've said that three years ago and we said it six years ago we said it first time I saw Sonic the Hedgehog I was like real hedgehog oh my God that's what the real hedgehog looks like where' you get those shoes that question but uh it's why does he want these rings so bad it's crazy that you know as we grow as Gamers Graphics just keep getting better and we consistently like oh my God that looks like TV but it's getting to the point now it's like damn like and I even said this to you when we were in Vegas watching I think it was basketball or maybe it was football but I was like that real football game looks like a video game because it has so much heads up display **** going on it's like this is ridiculous and uh so yeah the presentation is just on another level and like the the commentators and like like even the",
      "start": 1246.44
    },
    {
      "text": "game because it has so much heads up display **** going on it's like this is ridiculous and uh so yeah the presentation is just on another level and like the the commentators and like like even the crowds finally don't look just like a bunch of dudes just like doing a wave over and over yeah 100 like 100 different groups of 100 that are like in a yellow shirt and white shirt and they're just all sporadically put up they're all doing the same animations over and over yeah so the the graphics on the presentation it's not so much Graphics the presentation is like oh it's just Immaculate then I started playing it and I'm like it's basketball I should totally understand this I have not felt that lost in so long playing a video game where I'm like this is deep this is so so deep I don't even understand what's going on but I was playing with my brother and he got it he totally cleed it he loves basketball he just knows understands like what all the different terms mean like I I know",
      "start": 1284.4
    },
    {
      "text": "even understand what's going on but I was playing with my brother and he got it he totally cleed it he loves basketball he just knows understands like what all the different terms mean like I I know basketball there's two teams you get in the hoop like two points three points I that was the thing when I was playing NHL right of just sitting down and playing it I was like oh man I used to love playing these with Po and then you sit down like I've I've been gone from this franchise for so long I have no idea what I'm doing yeah I also had to explain icing and offside D which which was you used to turn those off proba exactly because they were **** rules that slowed down the game and weren't fun they keep it keep you honest yeah they keep you honest I'll take your word for it I don't know what they do so I was confused cuz I was like man like am I really this dysfunctional that like I can't just pick up and play a basketball game and so I started reading about it a little bit and like",
      "start": 1326.24
    },
    {
      "text": "what they do so I was confused cuz I was like man like am I really this dysfunctional that like I can't just pick up and play a basketball game and so I started reading about it a little bit and like supposedly they like totally changed the control schemes from even like last year and it's like totally fine-tuned and stuff and this is something that they do is that they just keep changing the control schemes to kind of make it better and better and it's just it's interesting to me like how much of a challenge it must be to make a sports game feel fresh year after year without alienating the people that love sure one like they like you did last year yeah so like oh why are you getting rid of this why you Chang the controls but then it's pretty unique because only sports games really have to do that because other annualized games over time you see changes it's a more of like a generational thing like PS and Xbox and GameCube when you play play a racing game you hold a or X to go now",
      "start": 1362.0
    },
    {
      "text": "to do that because other annualized games over time you see changes it's a more of like a generational thing like PS2 and Xbox and GameCube when you play play a racing game you hold a or X to go now the Gen after that PS3 and 360 it turned to the triggers you know which was weird but then now it's that standard you know what I mean shooting games kind of have similar things where over time it just totally changed but with these sports games it seems like it's more of like a every season there is something totally different with the controls that if you looked at 10 seasons ago and now you can kind of see the jump but when you look at it more incrementally it's it's a little weird but I had fun playing it I just don't get it steer's in the other room playing shovel night she's screaming but so you didn't did you play it at all no I haven't had time yeah but it's it's definitely cool okay M yeah I've been playing the this little game called Lego Dimensions which is the front R for game",
      "start": 1397.92
    },
    {
      "text": "so you didn't did you play it at all no I haven't had time yeah but it's it's definitely cool okay M yeah I've been playing the this little game called Lego Dimensions which is the front R for game of the year I keep reading about and so yeah just didn't have time to get into that NBA because I'm too obsessed now with playing with toys in this room and streaming building the I mean it's just Lego Dimensions I know we talked about it last last week but that was more before I had the actual retail box you know I mean now I'm in multiple hours multiple twitch streams here I have my own Legos my own thing and damn is this game fun you know what I mean like it's you know it's it's it's the Lego games maybe in like it's I'm still just getting into the story if that makes sense because I'm doing so many Lego the level packs with portal and uh Simpsons and then like I have back did you do Ninjago no I didn't I did not buy Ninjago I'm sorry I know I should have I do run into these things",
      "start": 1445.68
    },
    {
      "text": "doing so many Lego the level packs with portal and uh Simpsons and then like I have back did you do Ninjago no I didn't I did not buy Ninjago I'm sorry I know I should have I do run into these things every so often that only the Ninjago guys can interact with duh and I do think maybe I should have picked up a ninjo guy but that's where they get you they're not going to get me all right they're going to get you no I'm not I will I will not randomly at full price buy packs that I don't care about on a discount two for one sale I'm not going to count myself out on that one but like in terms of just like straight up going there paying full retail I'm not doing it okay we'll see I'm not buying when you're done with all this stuff with the exception of crazy sales okay okay okay all right good yeah we will see where I'm but yeah like no like uh game's a ton of fun to play it's ton of fun to stream it's one of those games that actually works well for streaming where I can talk to everybody",
      "start": 1483.32
    },
    {
      "text": "yeah we will see where I'm but yeah like no like uh game's a ton of fun to play it's ton of fun to stream it's one of those games that actually works well for streaming where I can talk to everybody and hang out there's still these giant portions where I unbox something I'm like all right then it's 30 minutes 0 minutes of me building the Legos on camera and everybody loves that cuz then I just talk and we put together leg **** Legos man there's nothing more fun than Legos and that's the thing is like I think honestly i' forgotten how much fun Legos were to put together cuz like you know what I mean like there's the Ghostbusters up there but I don't have any room for it so I never put it together it's just in the Box whatever and so this is the chance to sit there and build for a reason and not have it be too overwhelming right I can still put everything in a box and get it out of here uh but building like building the portal the other night and like here let me show you so you got",
      "start": 1523.2
    },
    {
      "text": "and not have it be too overwhelming right I can still put everything in a box and get it out of here uh but building like building the portal the other night and like here let me show you so you got the portal I build the portal right and so I build the portal Tim and on the back here I put all these little these little dads right I'm like that's a weird place to you put on the back nothing's happening on the back right and so then in the game I start I found one of these and then they were like all right stop you have to pull it off the it had instructions of pulling it off the back and putting it on the front so that I'm matching I like holy **** I'm actually doing something with the portal now why you have to do that cuz they basically if they're back here I don't have them and if they're up here I do have them and then they give me different abilities with the guys to move them around they make portals I just I just unlocked another one I'm not 100% sure what it does yet I don't",
      "start": 1552.32
    },
    {
      "text": "up here I do have them and then they give me different abilities with the guys to move them around they make portals I just I just unlocked another one I'm not 100% sure what it does yet I don't know yet but you put them you hop them around use them through the portal solve the puzzles with them and stuff so what does Moses do in the G that's uh I know you're not a big reader that's of course Ganondorf from the hit film Lord of the Rings okay cool yeah yeah yeah it's of course it's scand off of course I'm just kidding because you if you remove the cape he looks like and the witch he's on the mount take off the witch's hat too too probably I don't think Moses wore wore a wizard hat can we take the cape off yeah take his head off he's Lego you can do whatever you want to yeah that's awesome oh don't lose his beard now very there's CH so how was the the portal pack mind-blowing really I because it's like one of those things where I jumped into this game and I honestly knew that I like",
      "start": 1590.0
    },
    {
      "text": "oh don't lose his beard now very there's CH so how was the the portal pack mind-blowing really I because it's like one of those things where I jumped into this game and I honestly knew that I like the franchises I knew what i' had seen before from demos and stuff and I'm like don't want to know much more about it I'm going to have fun and get it so I get in and I uh the first I literally get into level one after building the portal uh build the Batmobile and assembling a few other things jump in What is wrong I'm just realizing so these are real just Minix yeah you build these they all come loose and you have to open it up and go through the instruction manual and make them all I thought these were like more of a glued to the base yeah like I thought like these were specific you pop the Batmobile off the base and it's a Batmobile you roll it down over there these are real Legos this is **** awesome right yeah yeah yeah exactly so here we go now you made show to the camera there you",
      "start": 1625.52
    },
    {
      "text": "off the base and it's a Batmobile you roll it down over there these are real Legos this is **** awesome right yeah yeah yeah exactly so here we go now you made show to the camera there you go and you put it on there Moses but no there's going to be some DLC about when he goes into Egypt I jump into level one I immediately backtrack because during my demo they're like oh and here's where you get your first mini kit or whatever I'm like yeah mini kit oh okay you know where you go through the one one of the pieces to assemble the whole mini kit and it's like oh you need an explosive and none of the guy none of the guys I had at the time were explosive but they were in the chat was like oh well Homer's TV is explosive I was like oh okay I'll go get that so I had to play The Simpsons level pack jump in it is the Lego Simpsons which is so like but everybody maintains their art style right so like Batman looks like Batman wild style moves like the Lego characters in the movie did in the",
      "start": 1666.2
    },
    {
      "text": "pack jump in it is the Lego Simpsons which is so like but everybody maintains their art style right so like Batman looks like Batman wild style moves like the Lego characters in the movie did in the stop motion thing whereas the other people just move normally and **** and you jump into The Simpsons and it looks like The Simpsons and it's got these Lego Simpsons and it's like whoa but it was uh the level is uh the level pack I should say the level you play through is the one where I don't know how big of a Simpsons fan you were but it's the chili one where he he ate the uh Chief Wiggum's chili and then goes on the spiritual Quest so it's it's audio pulled from that so I was like oh that's cool it's telling me in a different way they had Johnny Cash's vo which I thought was crazy and awesome and stuff and I was like awesome that was fun it was a nice throwback so in my head now I'm like that's how they're all going to be right that's how it plays out so then we jump into Portal 2 and",
      "start": 1700.96
    },
    {
      "text": "and stuff and I was like awesome that was fun it was a nice throwback so in my head now I'm like that's how they're all going to be right that's how it plays out so then we jump into Portal 2 and we're playing and I'm like and they start referencing Portal 2 and it's like oh no this is all new this is Glattus this is or GLaDOS this is Wheatley this is JK Simmons's guy who runs like these are all new voices this is a new portal story in this level that is taking place after Portal 2 and you're you're working with Wheatley again and going and they the puzzles and the port like shooting the portal gun in in making Lego portals and jumping through them and then solving like don't get me wrong they're toned down puzzles and stuff but that was awesome and I was like holy crap that's amazing and then outside of just the level pack you're going to fly the invisible plane into  Pella uh outside of just the portal pack right like when you get a level pack you get this level pack that's",
      "start": 1740.36
    },
    {
      "text": "outside of just the level pack you're going to fly the invisible plane into  Pella uh outside of just the portal pack right like when you get a level pack you get this level pack that's a story that you play through right but then you also if you have the character when you have one of the characters open up their Hub world where there's like random stuff to do races to do all this other stuff to do right and so like I played around DC Comics last night where I jumped in and it's metropolis and Gotham are like slammed together and everything's kind of in a hellish thing because that's what's happening in the game I go in there immediately there's this woman who's like hey if I have all the pieces if you can help me and you have to pay her the studs you've collected to build the Superman statue and then it's like okay cool that's one of the construction jobs done and then there's another one over here then there's some Batmobile races there's in a flying race then I ran into",
      "start": 1780.0
    },
    {
      "text": "Superman statue and then it's like okay cool that's one of the construction jobs done and then there's another one over here then there's some Batmobile races there's in a flying race then I ran into Lois Lane and she's like voiced and she's like hey blah blah blah and like she basically runs from point point A to point B to C to D to F or whatever around the city explaining what's happening this is Arkham Manor and this is Lex Bill and like getting attacked you have a sa I'm like this is awesome I kept wanting to do stuff like that so I was like oh that's how those levels work you jump into Portal 2's one and it's all the other AI cores are there and they all have challenges and puzzles for you to do with the portal gun it's just like there's a lot of awesome yeah so the question I have is obviously Lego games have always really been about fan service and stuff like that yeah do is there enough game there minus the fan service to make it fun and worth playing like if you were to",
      "start": 1821.6
    },
    {
      "text": "is obviously Lego games have always really been about fan service and stuff like that yeah do is there enough game there minus the fan service to make it fun and worth playing like if you were to played Ninjago something that you have no real connection to at all do you think it'd be entertaining hard to say here's so so let's go this way all right the I'm talking about the portal and The Simpsons level and I love them right because yeah they're I love those two franchises whatever don't hit sidew work with the bat oh no uh I and I love those universes so I'm clearly in love with them right but in the story mode right I'm dropped into uh Wizard of Oz and I don't have any affinity for Wizard of Oz or anything you have no **** soul Craig sorry but I enjoy playing it I'm running around I'm doing it Dorothy there's a bunch of funny jokes there I'm fighting doing Dorthy I'm doing Dorothy that's **** up figh I'm fighting the wicked witch right like I'm I had fun in those so I mean",
      "start": 1857.36
    },
    {
      "text": "I'm doing it Dorothy there's a bunch of funny jokes there I'm fighting doing Dorthy I'm doing Dorothy that's **** up figh I'm fighting the wicked witch right like I'm I had fun in those so I mean Ninjago you Dro me in and I would literally be like I don't is this a cartoon is this a game is this I don't know what the hell this is this is just Lego figures you know me all of those could be true so I don't know what specifically would that one it'll be so I don't know for you but so far enjoying myself quite a bit so was Callin yeah look yeah Legos are just fun look at oh there you go and then you put him on those things right there and you yeah you got it you got it I'm G put like this that makes no sense now he's just like first viewer and then Cyborg's in the middle you got hom right here with his his Cola and that's how you play with toys if you remember correct what you what are you been playing Colin uh a couple VA games uh we played I played a little bit of Uncharted Nathan",
      "start": 1903.12
    },
    {
      "text": "here with his his Cola and that's how you play with toys if you remember correct what you what are you been playing Colin uh a couple Vita games uh we played I played a little bit of Uncharted Nathan Drake collection we'll save that um I don't have too much insight into it but we'll talk about Uncharted generally uh I played the Vita game Zod Drifter on my way home uh a week or two ago and it's a game by our friend uh Jules Wasam who do who is the leader or the the owner and and CEO whatever of Ren Kid which is a studio down in Texas that um does mutant muds and stuff they're basically a Nintendo developer and they've been bringing their stuff to PlayStation um so I'm actually a big fan of mutant muds Deluxe on Vita and uh you know he and I are friendly we talk on on Twitter and see each other trade shows and stuff and he had sent us Z he was the first person to send us a game when we had broken off and he had sent us Zod Drifter on PC Zod Drifter is also on PC it's on 3DS I think it's on",
      "start": 1945.84
    },
    {
      "text": "trade shows and stuff and he had sent us he was the first person to send us a game when we had broken off and he had sent us Zod Drifter on PC. Zod Drifter is also on PC, it's on 3DS, I think it's on Wii U um and it's cool it's like a very pixelated which is what they do stylized uh kind of uh open world Metroid Vany game but it takes like two hours to beat so it's it's like bite-sized it's kind of neat um and Renegade K Renegade kids hold hold shtick whether it's a mutant muds or in this game and I don't know if it's in other games CU I haven't played them but they like playing with uh dimensions in terms of going into the background and then coming back into the foreground so you like find things that allow you to go into the background and then jump back into the foreground and that's how you play the game Donkey Kong yeah Country Returns uh pretty much uh similar yeah what was that that was Christine Yen okay um and uh it's just it's just a cool game cuz it's just bite siiz it's",
      "start": 1990.76
    },
    {
      "text": "how you play the game Donkey Kong yeah Country Returns uh pretty much uh similar yeah what was that that was Christine Yen okay um and uh it's just it's just a cool game cuz it's just bite siiz it's just four planets and you land on each of the planets and then you find something on the planet that you need like fight a boss all the bosses are the same you fight the boss and then like you get something and then you go back to another planet and you can now get a little further but you're like jumping around constantly it's like way more backtracking than say like Symphony the Night or something uh but I thought it was like a cool little bite-sized game it takes a few hours maybe to play if you want to get everything it might take you a little bit longer because there's upgrades to find and stuff and you can there's a trophy for beating the game in under an hour I think so um there's some trophies to play around with so I I recommend that game Zod Drifter it was free a couple months",
      "start": 2028.64
    },
    {
      "text": "and stuff and you can there's a trophy for beating the game in under an hour I think so um there's some trophies to play around with so I I recommend that game Zod Drifter it was free a couple months ago I think on PS+ but you can go buy it it's probably pretty cheap and I think it's also on PS4 um so I do recommend that and then I've been messing around more recently with Dang and RPA another episode ultimate or Ultra Despair Girls whatever the game's called which is basically I've only played it for like a couple hours and it's the spin-off that when we had uh um uh Kadaka Son here who's the creator of the series talking about how it's a very different game it's not Danganronpa 3 um it's very fanservicey um and very story heavy which is fine but it's not quite clicking with me enough where I want to like continue to play but I will because I'm you know I love Danganronpa um but it's like a third person shooter it's a little rough it's super violent which I think is pretty interesting",
      "start": 2062.0
    },
    {
      "text": "I want to like continue to play but I will because I'm you know I love Danganronpa um but it's like a third person shooter it's a little rough it's super violent which I think is pretty interesting like the Danganronpa gam what does that mean is it l really bloody and stuff or Danganronpa is to to skirt I think ratings issues and to also not scare people off blood in Danga games is always pink and the the which I think is actually really disturbing and unsettling I think I like that design choice I think it's actually way cooler than having it as red blood um but the Danga 1 and Danga 2 are murder mystery so people lots of people die and they die in brutal **** ways in the game like when Monokuma kills someone he he don't **** around no he really doesn't like the whole thing is he wants some dead though so the for people that don't know Danganronpa story is in the first one it takes place at a school and the second one takes place on like a desert island it's basically like kids",
      "start": 2100.8
    },
    {
      "text": "wants some dead though so the for people that don't know Danganronpa story is in the first one it takes place at a school and the second one takes place on like a desert island it's basically like kids talented kids end up isolated in this place and they're locked in by Monokuma who's a **** teddy bear and the game is about how you can only Escape if you murder someone and you get away with it so slowly people start dying and then it's so it's like Phoenix Wright um meets like Battle Royale yeah basically meets and meets like a virtual like or a visual novel so it's like very story heavy but then someone dies and you investigate kind of like Phoenix right and then you have a trial and Monokuma is the judge and like everyone is like using these things called Truth bullets and stuff to like yeah try to tear each other up and then if the person's caught murdering someone which is how the story goes like everyone's ultimately caught murdering someone else um Monokuma executes them in like",
      "start": 2143.6
    },
    {
      "text": "yeah try to tear each other up and then if the person's caught murdering someone which is how the story goes like everyone's ultimately caught murdering someone else um Monokuma executes them in like really dramatic ways and and so I I'm telling you that cu the game's always been violent but this and that's always been the unsettling nature of a teddy bear that is killing everyone that's why Danganronpa is really like one of the themes is just it's just weird you know and this game is just in the beginning is like super violent because it's about there are multiple monokumas technically but in this game there are like a **** ton of like an army of monokumas and they're just murdering everyone and the story is pretty cool because at least preliminarily from where I am it's about um how uh the kids are killing all the adults in this in the world like that's what it's all about and and Children of the Corn is my favorite horror movie for the similar reason I like that kind of story",
      "start": 2180.92
    },
    {
      "text": "uh the kids are killing all the adults in this in the world like that's what it's all about and and Children of the Corn is my favorite horror movie for the similar reason I like that kind of story where it's like the kids are killing the adults like that's just super scary and weird yeah and teddy bears and it's just you know yeah exactly but like in the beginning of the game like their claws are coming out and like the monom are just stabbing everyone and like killing everyone it's like super **** violent and I was like it's pretty cool but then blood pink it buds P okay and then the story gets in the way though because and I've been reading a little bit about it on Neo and stuff where people are just saying the same things which is like this it's just so story heavy like you just want to play it it maybe like Final Fantasy 10 where the game just keeps getting in its own way and I've noticed that just in a couple hours where I'm like I might have played the game for five minutes",
      "start": 2221.68
    },
    {
      "text": "to play it it maybe like Final Fantasy 10 where the game just keeps getting in its own way and I've noticed that just in a couple hours where I'm like I might have played the game for five minutes yeah you know and that's a little disappointing me so those are the two games I'm spending time with on Vita in addition to Uncharted cuz I'm just trying to kind of like tick these boxes of these games I just need to get out of the way are you done with Mad Max uh no I'm not I want to go back and play Mad Max uh I'm almost done with it uh I'm close to filling up the like getting everything in the entire map which means I assume that I have to be pretty close to having beaten it gotcha um but I want to spend time with Uncharted which we'll talk about in a minute and uh that's going to take some time but I will get back to bandmax and I intend on getting back to dying like too but who the **** knows we there's nothing the beauty is there's nothing really of any consequence for me coming out",
      "start": 2256.28
    },
    {
      "text": "but I will get back to bandmax and I intend on getting back to dying like too but who the **** knows we there's nothing the beauty is there's nothing really of any consequence for me coming out between now and Fallout so I have time unless I'm missing something finally time a little yeah little Twilight Zone reference I appreciate that uh so unless there's something major I'm missing I'm sure there's going to be incidental downloadable games and little smaller games that are going to come out that I'm excited about that I want to play but like S I still need to get through and all that but I'm going to try to use this month of October wisely to just get rid of some of this **** because once fall comes out it's over **** that's that's a month of my life and then um who I think it's more I think it's GNA be more than a month I mean who knows you know like I hope that I want to be smart when Fallout comes out with our schedules where it's like let's get everything done so we can",
      "start": 2291.28
    },
    {
      "text": "more I think it's GNA be more than a month I mean who knows you know like I hope that I want to be smart when Fallout comes out with our schedules where it's like let's get everything done so we can just not talk do four game casts the week the day before I don't know what's happening anymore but I can't wait we're getting that's the other thing Greg and I know you're not excited about it Tim but we're getting close we're like five and a half weeks away from I know I try to I know but that's why I try to I mean there's so much it's I'm on the same thing right now I feel like I'm trying to clean things up before it gets here you know what I mean like you figure I'm waiting for we're doing extra life con funny.com extra life if you want to join or support us kick us some money for our fundraising efforts for Children's Miracle Network uh but my plan is for my shift of extra life to platinum Metal Gear which I'm not I need to do more housekeeping to get it into a place where it's like all",
      "start": 2326.96
    },
    {
      "text": "efforts for Children's Miracle Network uh but my plan is for my shift of extra life to platinum Metal Gear which I'm not I need to do more housekeeping to get it into a place where it's like all right I have eight hours what do I need to do kind of thing you know what I mean yeah that's cool I mean I'm the I'm happy I'm not looking forward to Fallout because that means that I have November to still catch up on all all this other stuff November will probably be my bental gear beating time do you think every month's my beating time yeah every day is my beating time uh you guys are extravagant uh do you think there's any chance that Fallout might grab you I don't wow I really don't are you gonna give it a shot I will for you guys thank you I just let's do a let's play where you play okay from the beginning don't Crouch the entire time this time CR I won't Crouch yeah yeah yeah no I'm done for that that that'll be that'll be interesting I just I don't think it will it's just too the the",
      "start": 2362.08
    },
    {
      "text": "the beginning don't Crouch the entire time this time CR I won't Crouch yeah yeah yeah no I'm done for that that that'll be that'll be interesting I just I don't think it will it's just too the the open World stuff man it just sounds too crazy do you think you're going to get hooked by Lego Dimensions get hooked by it yeah no okay I don't I'm excited for Transformers I have hope for Transformers Devastation Transformers Devastation next week so Transformers we'll get to this later in the topic where we talk about science games are bad so far that one's not doing that for me that's looking good okay yeah there's a there's a chance it might not it's failing my test number one that you're excited about it no I know so we're screwed for that but I'm excited about that um because I'm going to be playing the **** out of that come next week because right now I'm playing a **** ton of Uncharted oh are we switching topics we are switching top did it just happen or we in the middle of it",
      "start": 2403.96
    },
    {
      "text": "be playing the **** out of that come next week because right now I'm playing a **** ton of Uncharted oh are we switching topics we are switching top did it just happen or we in the middle of it we're now in topic two does it shoot oh it does shoot oh man that's not a good I know right let's shoot a thing that's like the tiniest little thing that's cyborg everybody from the hit game Lego Dimensions lost forever don't worry they G they send you three extras do they I wish they did that when we were kids right well they learned they lost all my missiles for all my planes and **** my GI Joe planes that ain't a good idea at all so okay Uncharted right this is a very very very big deal to me that this Uncharted Nathan Drake collection came out because because because in uh 2007 the game came out Uncharted 1 PlayStation 3 and I did not own a PS3 at the time because I was a poor child you don't have to make excuses I didn't own a I was on the PlayStation team didn't own a PlayStation",
      "start": 2441.92
    },
    {
      "text": "came out Uncharted 1 PlayStation 3 and I did not own a PS3 at the time because I was a poor child you don't have to make excuses I didn't own a I was on the PlayStation team didn't own a PlayStation yeah that was thing but then Metal Gear Solid 4 came out sold a bunch of games got my PS3 super stoked about it beat Metal Gear 4 and then I was like what's the the game that I've been waiting for I remember there was a game I played at GameStop there was this thing there was a demo I had forgot what it was I didn't know it was Uncharted then I was like Google searching trying to figure it out scouring the internet and then I saw saw Uncharted I'm like that's what it is and then you saw it's that I didn't realize some white guy **** there's a lot of these people yeah no no I didn't realize that uh which one it was cuz I remember when it was first announced and it just looked like Tomb Raider like when they the first trailer for it the guys who did crash are doing this weird jungle game",
      "start": 2480.88
    },
    {
      "text": "that uh which one it was cuz I remember when it was first announced and it just looked like Tomb Raider like when they the first trailer for it the guys who did crash are doing this weird jungle game you're like what yeah and I totally wrote it off but I didn't realize that it was the same game that I had played a demo of and then I I bought it and I fell **** in love with it and Uncharted one to this day one of my favorite games of all time then two came out I got distracted started doing a bunch of other stuff and eventually three came out and I was like I'm going to get to them one day then it got to the point where I was like all right I bought them I bought both of them and I'm like I'm going to beat them just going to back to back beat them then the PS4 was announced I'm like they're definitely going to do an HD version and I'm the type of **** that's like I want to play the like HD **** so I'm like all right I'm just going to wait for them to finally announce it then they",
      "start": 2524.24
    },
    {
      "text": "definitely going to do an HD version and I'm the type of **** that's like I want to play the like HD **** so I'm like all right I'm just going to wait for them to finally announce it then they announced it now it's **** out now I get to play it sure so now I get to join you gentlemen yeah as people that like Uncharted three more thaned two so so far I've been playing the **** out of these games um I didn't play one because I already beat that before one yeah and I recently I beat two and I'm 75% through three okay planning to beat it within the next week so you already got to the part where Elena hangs herself I I think I missed that part okay uh it's not coming up don't worry about it okay um but I'm **** in love with this the this franchise and this game specifically The Collection is so good oh yeah and oh my God it's beautiful they did such a good job of making last gen look great this gen yeah and uh because I remember Uncharted one and how it looked and it looked great",
      "start": 2559.48
    },
    {
      "text": "is so good oh yeah and oh my God it's beautiful they did such a good job of making last gen look great this gen yeah and uh because I remember Uncharted one and how it looked and it looked great and all the I played a demo of Uncharted 2 so I remember how these all look and feel or whatever but like this is some Next Level **** so what I want to know from you guys is because obviously I have a lot of opinions as a firsttime player of this **** but I want to know if you guys are excited about playing or if you've played any of the collection so far and if people that have already played the games should rep play we played 40 minutes or so of each Drake's Fortune among these and and Drake's Deception um and I agree with you that well first of all and I and I said this on on PS I love you but and I can't I just can't quantify because I just don't know whether it's it's necessarily true or not I don't remember that game looking that good specifically the first one I just don't",
      "start": 2601.84
    },
    {
      "text": "love you but and I can't I just can't quantify because I just don't know whether it's it's necessarily true or not I don't remember that game looking that good specifically the first one I just don't remember it looking like that I remember there being a massive jump between one and two and a much smaller jump between two and three and I feel like the jump isn't really there anymore and I don't know if it was if it's just like they put a sheen on all this they have that's the thing is like yeah what you're saying is when you saw two after one you're like holy crap and like one looks now the way it looked in my head you know what I mean like you sit there and you the jokes are always about Ocarina Time right where you you think back and you imagine running through high Ru field and it was beautiful and you go back and it's just one flat **** texture and two trees you're like damn you know what I mean like I the Uncharted one playing through it again Drake's Fortune on the collection",
      "start": 2649.76
    },
    {
      "text": "beautiful and you go back and it's just one flat **** texture and two trees you're like damn you know what I mean like I the Uncharted one playing through it again Drake's Fortune on the collection I was like oh this game's great I'm like they something was done here to make it look more beautiful you know what I mean yeah so I think as far as I understand Blue Point has and I was reading about this because I just didn't I I actually didn't I've only played Drake's Fortune in the collection Greg played all of them on our on our let's play so I don't I don't know the gist of it is that they apparently unified the combat a little bit between the games which is cool because there was differences people had a huge problem with three's combat especially and I think that um pre patch I think once they patch it there was something off to that about that game with a lot of people what not I didn't really I mean I remember I remember that vaguely it's a long time ago that's like 150 games ago",
      "start": 2686.16
    },
    {
      "text": "they patch it there was something off to that about that game with a lot of people what not I didn't really I mean I remember I remember that vaguely it's a long time ago that's like 150 games ago um but uh so to answer your questions uh I we spent a little bit of time but not enough to author authoritatively talk about the collection itself um other than to say that I'm sure Blue Point has done a great job as they always as yeah as they always do and we noticed some things in our Let's Plays that I'm not positive were in the original games in terms of like some weird uh like magnetism with jumps and some weird yeah like some weird like frame jumping and Stu I don't remember things like this but they might have always been there and I just don't know we were so enamored with these **** games who the **** knows uh but do I recommend playing them again yes they're fantastic games I'm going to play through them all again I think that they're **** must playay games if you've never",
      "start": 2719.44
    },
    {
      "text": "games who the **** knows uh but do I recommend playing them again yes they're fantastic games I'm going to play through them all again I think that they're **** must playay games if you've never played them and even if you have played them I've platinumed all three of the games as say Greg on PS3 I'm going to platinum the three of them again so and it'll be easier this time because crushing is unlocked and all that um there's a there is one mode that's not unlocked yeah brutal mode is uh not unlocked and even though the trophies are not live yet uh I reached out to Sony and they sent me the trophies and so I I looked at them and while I cannot tell everyone the exact extent of the trophies I can talk a little bit about them according to my context there and they they gave me permission to say that ay there are trophies gold trophies attached to brutal difficulty but what it appears to be and what we were talking about today on Colin and Greg Greg was uh there seems to be DLC",
      "start": 2760.2
    },
    {
      "text": "to say that ay there are trophies gold trophies attached to brutal difficulty but what it appears to be and what we were talking about today on Colin and Greg Greg was uh there seems to be DLC attachments to each of them in on trophy so what I mean by that is like it's like the core game has its core list and there are some new trophies on the core list especially for two and three because they removed the online trophies because there online components but then there seems to be an extended version trophy list that is equivalent to a DLC or a downable Game trophy list that has like a bunch of random **** in and in that trophy list are the brutal difficulty ones as long as like along with all these other like trophies that blue point put into the game that were not in the game originally so it seems like the Platinum might just be contingent on beating and on crushing which is manageable we've done that already um these are I hate using this word it's like such a contrived and",
      "start": 2796.16
    },
    {
      "text": "so it seems like the Platinum might just be contingent on beating and on crushing which is manageable we've done that already um these are I hate using this word it's like such a contrived and meaningless word really but these are magical games like these are the Uncharted Trilogy is special this is the cream of the crop PlayStation exclusive series not maybe the game I mean I think The Last of Us is better than all the Uncharted games but this is from the studio that made The Last of Us and this in terms of a series this is the most important pivotal Paramount Apex Series yeah for PlayStation and so everyone deserves and owes it to themselves to play these games I don't think I think the Uncharted series is event is virtually unmatched in terms of its combination of gameplay story acting writing and presentation I don't think anyone does all of that better than the Uncharted series some a lot of series do gameplay better A lot of series might do storytelling better but none of them",
      "start": 2831.88
    },
    {
      "text": "writing and presentation I don't think anyone does all of that better than the Uncharted series some a lot of series do gameplay better A lot of series might do storytelling better but none of them takes that I don't think anything maybe Bioshock and The Last of Us and a few other games yeah you know playing through him for the first time for all you know intents and purposes is it's it is magical it is really amazing and I'm just addicted to playing it I keep thinking about it's one of those games where it's like I want to be playing it right now I want to you know know what happens next sure it's interesting though to see that in addition to them all being masterpieces like at least so far all three of them I would say are amazing games it's crazy to see the Improvement like specifically from 1 to two because I loved one I think one is such a great game two is so much better it's like not even a question and I think a lot of that comes down to the fact that one was a lot harder than",
      "start": 2873.96
    },
    {
      "text": "from 1 to two because I loved one I think one is such a great game two is so much better it's like not even a question and I think a lot of that comes down to the fact that one was a lot harder than two and I think hard not in a like funall fun challenging way just to kind of this is **** you're head against the wall how you to survive this W thiser so many waves of **** coming and it's just like God damn it that's always been their Style with their first games too crash oh for instance you know it's like that's they don't nail difficulty levels right the first time they just don't and uh that's a very good point I mean it definitely feels like and it's not to say Uncharted one was difficult it's just compared to two two got the balance so much better it was just fun like I never felt any time I died a couple times it was my fault I knew what I was doing I knew what I had to do better the next time that's good you know it's like when you feel like you're being rewarded to",
      "start": 2911.68
    },
    {
      "text": "felt any time I died a couple times it was my fault I knew what I was doing I knew what I had to do better the next time that's good you know it's like when you feel like you're being rewarded to constantly keep pushing forward it's great and I think that the one was a little bit repetitive like it was you know very much you you climb a bit then cut scene cut scene and then you shoot a bunch of **** and people just keep kind of coming and then there wasn't too many set pieces in one like there was there was a few like you know key things but especially not compared to two yeah I guess set piece is kind of the wrong place maybe we the wrong word maybe Arena Arena makes there'd be like an arena thing and then a puzzle and the puzzle just slows everything to like a crawl where all of a sudden it wasn't this forward moving thing it's like all right I need to stop and think about this stuff I definitely think the puzzles are the weakest parts so far and that also goes into two I feel",
      "start": 2951.2
    },
    {
      "text": "sudden it wasn't this forward moving thing it's like all right I need to stop and think about this stuff I definitely think the puzzles are the weakest parts so far and that also goes into two I feel like two's pacing was so much better where it had that same format but they'd switched up a bit more and the Arenas never felt as similar to each other like I guess the terrain and being a there was a lot more verticality in two than one for sure and also just the locations being different made it feel more fresh like being in a City compared to just a jungle the whole time yeah and like it the the snow and the there's so many different you know variations on environments and that made it a lot better too but then whenever got to the puzzle Parts I was always just like H man like I know what I need to do here this isn't fun like the idea of looking at the journal and you know figuring out the clues of how you need to do stuff it's cool and it's like Nifty you know but Nifty is the best",
      "start": 2993.28
    },
    {
      "text": "I need to do here this isn't fun like the idea of looking at the journal and you know figuring out the clues of how you need to do stuff it's cool and it's like Nifty you know but Nifty is the best way I can put it which is like that's not a good thing it's just like all right I guess that's unique and on the PS4 you hit the little like trackpad thing but then you don't turn the pages with the trackpad it with the it's like those sections were the one things that I'm like oh this isn't perfect having said that I still think it's fun you know amazing as perfect of a game as it can be but like there's you know I'm just giv my gripes my my gripes here um but yeah those sections it was like the puzzles are all so obvious and it's like okay I know what I need to do why do I need to look at this picture and match these things that takes three years to you know rotate all this stuff it's like that it's when it stopped feeling like oh my God I'm playing through a movie and oh I'm playing a",
      "start": 3035.88
    },
    {
      "text": "picture and match these things that takes three years to you know rotate all this stuff it's like that it's when it stopped feeling like oh my God I'm playing through a movie and oh I'm playing a video game sure and they're learning yeah exactly and it like again I haven't beat three yet although 5% into three I've already seen more of those **** type puzzles than were into at all which without spoiling what did you think of the beginning of three did you did you know that that happened I know that happened uh after the intro the don't say it okay yeah no I didn't very cool that's like my favorite moment in any Uncharted game oh yeah um it's it's been very yeah I don't want to spoil anything for anyone but three so far is the one that I'm most intrigued cuz I'm like What's Happening like I don't know where this is going yeah yeah yeah yeah is he cross-eyed or is that just a glitch it's in the cut scene I was looking at it must be a glitch in the cut scene you're looking at cuz I",
      "start": 3079.56
    },
    {
      "text": "like I don't know where this is going yeah yeah yeah yeah is he cross-eyed or is that just a glitch it's in the cut scene I was looking at it must be a glitch in the cut scene you're looking at cuz I thought that was part of his character like that's like that's weird K Mar Marlo's cross-eyed friend yeah um but the biggest issue I had with two is the puzzle parts and the fact that it it felt a little just a little too long like I feel like we could have shaved off maybe 10% like one last all right now I have this clue oh but this clue is not the final thing this clue just shows I need one more place to go and it's just like I felt like it was just the same story beat over and over and over um and three's definitely already kind of remedying that so it is cool to see the progression of them learning how to change it up and stuff and it's it's two was essentially one again but bigger and better see that was my problem with two and why I think I when we were talking about this I always",
      "start": 3125.12
    },
    {
      "text": "learning how to change it up and stuff and it's it's two was essentially one again but bigger and better see that was my problem with two and why I think I when we were talking about this I always talk about why I think I like three more just from a story perspective is the fact that I thought two was supercharged one in like beat by beat of all this stuff's happening all right this guy's going to betray you all right this is going really beat by beat like there's story element guess what there's a supernatural twist you're like what the fu no this is out of the blue okay whatever you know what I mean it's like and that worked the first time yeah oh the first time I W playing like holy cow and the second one I was like I'm predicting everything that's about to happen you know what I mean like I'm aware not not like specifically but in terms of I me but I essentially predicted like once the supernatural stuff and two happened I knew the source of it essentially where CU like it's just",
      "start": 3172.8
    },
    {
      "text": "like I'm aware not not like specifically but in terms of I me but I essentially predicted like once the supernatural stuff and two happened I knew the source of it essentially where CU like it's just it's very obvious if you played the first game sure um yeah already playing the third one I'm like man this is different like the way they're handling the story is so different uh the environments again and all that stuff and the the gameplay changes too like it's just it's it's fun that like the opening scene of three is bar fight yeah the barf fight amazing amazing and totally unlike the uh opening of two or the opening of one and I think that's good because they totally could have just again you know two opens with the big with the the train hanging off the thing they could have just done that again with three where it's like here's another crazy ass thing situation where the bar fight was like totally unexpected and and fun and really it was cool and what happens after the bar fight",
      "start": 3207.68
    },
    {
      "text": "that again with three where it's like here's another crazy ass thing situation where the bar fight was like totally unexpected and and fun and really it was cool and what happens after the bar fight it was just like what the **** what's going on here and for a while started feeling a little tutori but it's the beginning of a game know that shit's going to happen but yeah so far three has been a lot slower and there hasn't been any any moment that I'm like **** this is awesome two has some of those like uh I tweeted about this everyone always talks about this train sequence being the most amazing thing in the world yeah now that I finally know what they're talking about holy **** that was amazing that is a video game set piece 101 everyone every game designer should look at that be like this is how to how to make fun yeah you know yeah yeah um having said that that wasn't my favorite set piece in the game I think that the uh the the building scene oh right right right right like",
      "start": 3249.32
    },
    {
      "text": "this is how to how to make fun yeah you know yeah yeah um having said that that wasn't my favorite set piece in the game I think that the uh the building scene oh right right right right like that was better than the train scene like that was definitely something that had me be like oh **** I am engaged with what's happening see it's that's interesting how much do you know about three sequences and stuff all right great perfect I'm telling you because there was a big one that was ruined in a commercial right that then spoiled it for when we were playing it in three but I think what you're talking about with two in particular is the fact that they hid the train forever and the part with the building you play through multiple times at E3s and preview events and everything else so that's probably why I get swept under the rug in terms of critics and press opinions so we knew about it I remember I think I described that point by point in one of my first previews of it you know what",
      "start": 3293.72
    },
    {
      "text": "probably why I get swept under the rug in terms of critics and press opinions so we knew about it I remember I think I described that point by point in one of my first previews of it you know what I mean like people knew about that yeah whereas yeah what you're talking about CU I did not it's funny cuz I knew about the train at least being a big thing didn't know about the building so when it was happening like what the **** is happening right now yeah my favorite sequence I won't spoil for either it's not even what Greg's talking about either in the commercial is is my favorite my favorite setpiece and favorite scene sequence in you'll know it I think when you get there once you once you beat three I'll ask you about it because it's I think it's **** extraordinary and I think it's actually one of the overlooked ones from the entire series but will do you know what I'm talking about no I've no you've given no details on what you're talking about I don't want to say I don't want to",
      "start": 3329.6
    },
    {
      "text": "one of the overlooked ones from the entire series but will do you know what I'm talking about no I've no you've given no details on what you're talking about I don't want to say I don't want to I want to I want him to I don't even want him to know it exists okay oh when Elena hangs herself right exactly and that's the other thing my God man the characters like I knew I loved them like even in one they were so great but two really solid like man I care about these characters I care about the relationship so much and it's like they added all the new characters they added in two I **** loved the villains **** hate himar uh lazaric whatever but the the other **** and angry drink this stuff and I like that he calls him lazarovich that is the **** the dialogue is just so good everything Suly says period it's just the best amazing yeah um the El godamn Dorado El godamn Dorado and uh he and three has another goddamn line that I really liked but I it's blank right now yeah yeah it's",
      "start": 3365.24
    },
    {
      "text": "Suly says period it's just the best amazing yeah um the El godamn Dorado El godamn Dorado and uh he and three has another goddamn line that I really liked but I it's blank right now yeah yeah it's fun I don't like I am the opposite of Colin where I I loved those games and I had fun platinuming and I just don't I'm not psyched to do it again you know what I mean like I wouldn't I feel like when Last of Us was coming to PS4 I was like yes I've been craving replaying last was awesome and I sat down the weekend and I got to the dam and I was just like I'm not feeling this like it's just not the same and I don't like granted Uncharted are a bit different because every we had the Platinum so it was backwards forwards I reviewed them I knew those games you know what I mean and so maybe that's part of it and I just don't want don't feel like going back and doing it again I loved those games if you've never played them I would say yeah for sure play them but if you're like you asked earlier",
      "start": 3407.08
    },
    {
      "text": "part of it and I just don't want don't feel like going back and doing it again I loved those games if you've never played them I would say yeah for sure play them but if you're like you asked earlier you know if someone hasn't if you've played them before should you play him again like that's a eye of the beholder kind of thing I just don't have it in me I don't think see what's interesting to me is the the changes that they made like the physics stuff and they did make the games feel from what I I've been reading they made all three of the games feel more similar to each other and uh just the controller alone makes it so much better like we play Tri yeah being able to use the trigger and like to reload with R1 and all stuff like oh my God like it feels so much more natural than the PS3 controller did and I never really had an issue with the PS3 controller it's funny you say that because you can switch back to L1 and R1 and I did like I'm like that's just how you play these games like",
      "start": 3447.36
    },
    {
      "text": "did and I never really had an issue with the PS3 controller it's funny you say that because you can switch back to L1 and R1 and I did like I'm like that's just how you play these games like that's that's it's going to be we are going on Uncharted 4 I'm sure they'll give you maybe the option but I feel like these games like we there there's I'm just used to playing with L1 and R1 and when I tried to play them the triggers I'm like I can't I can't play like this it's not doesn't feel right this isn't what Neil Dman I'm imagined and then I in playing I I probably should have waited to this but it didn't really spoil anything anyways but 5% through three last night before I went to bed I pulled up the Uncharted 4 like trailer like oh my God I am so excited for this like oh it's going to be so fun good yeah so after I beat3 I'm going play Golden Abyss and I'm very very excited I'm just in like a **** good but going back to you replaying it it's like these games are similar to movies in the",
      "start": 3483.2
    },
    {
      "text": "good yeah so after I beat3 I'm going play Golden Abyss and I'm very very excited I'm just in like a **** good but going back to you replaying it it's like these games are similar to movies in the sense that like some people like rewatching movies over and over for Imagine to back and play these Uncharted games again after I already beat them it's the gameplay is amazing but the gamepl is a tool to progress the story and I love that because it's like this is all right one last topic I want to talk about before we move on is subtopic in this topic yeah the subtopic within this is the fact that it's crazy how earlier I was talking about how different Generations have control schemes that kind of just change or whatever and uh playing going from playing Middle Gear Solid 5 because I put that on hold to play this sure it's crazy that Uncharted just does not feel right like MGS 5's action just like going around shooting and everything and like the stealth and all that I'm like this feels",
      "start": 3522.64
    },
    {
      "text": "on hold to play this sure it's crazy that Uncharted just does not feel right like MGS 5's action just like going around shooting and everything and like the stealth and all that I'm like this feels **** awesome and then playing this it's like oh man this feels a little off and it's like I know it's just because I was just coming from that these are games that are 10 years old so hard to go back that was the thing of playing the Uncharted opening where we're like stealthing around trying to take out those guards and I was in the fountain and I like over creep over behind the guy and like you snap the cover and come around and then it's like all right I hit the square button to grab him and I just stand up and do a whiff a punch at his head and alert him and I was like like wa where's The Sweet Spot like that felt that would have been in Metal Gear The Sweet Spot to get up and choke the guy and but it's like okay this is I got to figure this out this isn't that game this isn't that",
      "start": 3568.8
    },
    {
      "text": "Sweet Spot like that felt that would have been in Metal Gear The Sweet Spot to get up and choke the guy and but it's like okay this is I got to figure this out this isn't that game this isn't that thing because of time and that's the the cool thing for me is like you know I took a took a break from Metal Gear because I wanted this linearity and it's just like man I wish Metal Gear did play a little bit more like this storywise I'm just I just want to just get through this thing and be constantly rewarded for what I'm doing but just pure like the the feeling of how the character feels and how you feel in control of the of what you're doing like snake is just so much more like on point and I cannot wait for Uncharted 4 like I think Uncharted 4 is just going to merge those two to be this **** perfect experience for me personally yeah um yeah so topic three of the Day signs you know a game will be horrible Tim likes it we've already identified if Tim is excited about a game it's going",
      "start": 3606.48
    },
    {
      "text": "perfect experience for me personally yeah um yeah so topic three of the Day signs you know a game will be horrible Tim likes it we've already identified if Tim is excited about a game it's going to be garbage cuz this has coming from the guy who was not excited for Middle gear 5 but has been **** banging the Tony Hawk five for tonw forever middle gear 5 no you remember you were all like I don't know I didn't like Peace Walker I don't know I'm like this no but I was still excited for it I was super excited for for me all right so this topic was originally going to be why you need to play Tony Hawks Pro Skater 5 and it's not that because I can't you know sit here and tell you that you should play this **** now for the record you haven't played it though right I've played it oh you have I apologize I thought you hadn't played it yet I haven't played it extensively enough to really like give a full review of the game I've played enough to know its problems and to know what I like",
      "start": 3647.96
    },
    {
      "text": "I apologize I thought you hadn't played it yet I haven't played it extensively enough to really like give a full review of the game I've played enough to know its problems and to know what I like about it um so I'm going to treat this topic what like what would have been that just there's not that much positive things to say sure it's bad period it's bad it doesn't make sense how a game that is this high-profile from Activision like you know there's money being put behind this Tony Hawk's name is on this this is not a spin-off of Tony Hawk this is we're going back we're doing it right except we're not yeah you know and for me my hold out for it was I was like all right the graphics look really bad **** whatever oh all the video why does it look like no trailer for this was even edited people just released footage and didn't even think about what was being shown how come I haven't seen anybody that actually knows how to play playing in any footage at all all these signs just looked",
      "start": 3692.36
    },
    {
      "text": "people just released footage and didn't even think about what was being shown how come I haven't seen anybody that actually knows how to play playing in any footage at all all these signs just looked really bad but I'm like whatever it's still Tony Hawk if the game play is there I'm fine I played with it for like 15 minutes and that was enough to be like all right this is not right come together you know it's for anybody that played all the I played every Tony Hawk game at least in the core I played all the pro skaters all the thugs American Wasteland Project 8 um the only one I didn't play was the ride no so those don't count full of Technology um what was after Project 8 the whatever the hell it was called there was another start of the P um breaking I think I'm just going to not move it okay sorry that **** was bad it was really really really bad so playing the old games was amazing for me those was a game I looked forward to every year it was an annualized thing that was good",
      "start": 3736.56
    },
    {
      "text": "it okay sorry that **** was bad it was really really really bad so playing the old games was amazing for me those was a game I looked forward to every year it was an annualized thing that was good and you look back at Tony Hawk 1 10 out of 10 from IGN Tony Hawk 3 10 out of 10 from Gamespot damn like these games were 10 out of 10 quality right right and now you look at this and you're like what and this is could you imagine this would happen to series to Tony Haw Pro Skater 5 like this is getting that title and like their whole thing is we're going back to the roots and I play it I'm like man did you guys play the other games like there's no roots here like there's none of this makes makes sense they got rid of the two-minute run I'm like what the did you play the other ones this doesn't even **** make sense and like Tony H prator 4 was a little bit more open where you go in these big maps and kind of take missions from people and this is more similar to that except the maps aren't",
      "start": 3782.8
    },
    {
      "text": "even **** make sense and like Tony H prator 4 was a little bit more open where you go in these big maps and kind of take missions from people and this is more similar to that except the maps aren't big and there's like no things going on in the level there's no like cars going driving around or like people like NPCs or anything it's just just bare flat empty land and I'm like all right I can deal with that if the game play is right the game play feels like Tony Hawk Pro Skater HD that came out like a couple years ago which was also made by Roboto and it's close but it's not right this doesn't feel like Tony Hawk 3 or four or two this feels closer to one and like that's like not a good sign you know like that's super **** old game and uh HD I kind of you know looked past its problems because I was like it's Tony Hawk at least they're they have Tony Hawk I'm getting a Tony Hawk that I haven't had forever it looks fine for a downloadable PS3 game like whatever it has classic levels",
      "start": 3825.88
    },
    {
      "text": "because I was like it's Tony Hawk at least they're they have Tony Hawk I'm getting a Tony Hawk that I haven't had forever it looks fine for a downloadable PS3 game like whatever it has classic levels it was a semi remix of one and two together I'm like cool I'm heading three eventually with the DLC I'm having fun with this and I had a lot of fun with it I played the **** out of it and like loved it this one takes away all the good things about that one and keeps all the bad stuff and then adds worse stuff you've all seen by now probably the glitch videos yeah it's awesome it's awesome stuff and all that stuff falling through the world and all the weird physics and **** now to be fair Tony Hawk games have always had really weird bail physics and like weird **** happens and you go through a wall and like whatever that **** always happened but there's always an amazing solid game behind that right so you overlook those flws yeah I I need to spend some more time with this game to",
      "start": 3873.68
    },
    {
      "text": "a wall and like whatever that **** always happened but there's always an amazing solid game behind that right so you overlook those flws yeah I I need to spend some more time with this game to really see if if there is that solid game there but mechanically there's just some problems with this **** like they added a new function where if you hit triangle you slam you instantly slam down like your gravity just goes up so you can like get onto rails faster or whatever and when I first saw that I was like all right cool that's a gameplay mechanic that I can see helping for Combos and like actually being good but they set it the triangle button which is also your grind button so that means that whenever you're near a rail it does that thing where it's not sure if you're trying to grind trying to **** slam so you just **** slam to the floor and your combo's done and it's like well and if that was like a oneoff thing I'd be like all right whatever that happened to me consistently in",
      "start": 3916.0
    },
    {
      "text": "to **** slam so you just **** slam to the floor and your combo's done and it's like well and if that was like a oneoff thing I'd be like all right whatever that happened to me consistently in little I was playing so I'm like well that **** sucks they changed it to reverts R1 you can change the control so that's not that big of a deal but it's like they're just **** with **** the only the great thing about it and people are hating on this but I think that they're just being **** just to be **** the soundtrack's awesome playing through it I'm like it does feel like a Tony Haw we got Good Charlotte in there like good Charlotte's not there but Blink 18 playing through it it does remind me of being a little kid it feels like Tony Hawk with Khalifa it just looks like a Tony Hawk game that it looks like the HD version did but the HD version was a **** $10 downloadable title on PS3 this is a $60 boxed retail game when I I thought it was just to download this game and then I",
      "start": 3954.8
    },
    {
      "text": "game that it looks like the HD version did but the HD version was a **** $10 downloadable title on PS3 this is a $60 boxed retail game when I I thought it was just to download this game and then I saw people on Facebook the Kinda Funny Facebook group with photos of it I was like what the hell like really like whoa I did not realize that was happening you know what I mean and so to your question of like you know what are signs games are bad like we've talked about this a lot so I mean some of it I'm sure be but like the first of course is when like no one is getting copies of this game the gaming press Enthusiast press has been vocal about the fact that heads up none of us have this we're not getting this Activision isn't giving it out and that's usually for you know 90% of the time troubl waters you know what I mean something bad is happening mhm yeah it's a bad sign also a bad sign when your game is smaller than the day one patch which is uh what is the case with the the game",
      "start": 3990.92
    },
    {
      "text": "troubl waters you know what I mean something bad is happening mhm yeah it's a bad sign also a bad sign when your game is smaller than the day one patch which is uh what is the case with the the game itself is like 5 gigs the patch is 7 gigs something like that it's a terrible sign for your game um so I think that's a terrible sign but I also think that's being a little blown out of proportion like to me the sizes and numbers and stuff I think the internet just likes to get upset about none of that **** matters if the the shit's there like who cares how big the patch is the day one patches are it's a normal thing it's not good but I don't think that that's a sign the **** disc yeah I I don't I'm totally with that but I'm just saying like in the modern day of how games work like I don't think that that that the sizes of the the install files matter",
      "start": 4033.6
    },
    {
      "text": "I do I think that it matters a great deal when the when the patch that fixes the game is bigger than the game I think that's absolutely relevant I think that's a totally salian thing to for people to be upset about but I understand that some people don't or to be a sign of trouble yeah like so the game went gold early and and it clearly wasn't ready and it's not uncommon day one patches are are everywhere now and that's fine every even great games get day one patches but the day one patches are not seven gigabytes and they're not thing is I think the size doesn't matter but it's more of a thing with Tony Hawk specifically you can't play the game with the patch like the the on disk thing is only like the tutorial and like a free skate mode or whatever so that's **** like that there is a definite problem with the way this game is released but I don't think the size is necessarily the problem yeah I don't agree I think I",
      "start": 4071.52
    },
    {
      "text": "skate mode or whatever so that's **** like that there is a definite problem with the way this game is released but I don't think the size is necessarily the problem yeah I don't agree I think I think I think it's just I think that's weird when there when you're releasing a batch of data that is bigger than the game the bigger than the game to fix the game or to add what is supposed to be in the game because they had a reach a certain certification or Q way before um I think that's that's weird and that's uncommon there are good games that have bigger patches like Killzone Mercenary had a huge patch that's a good game so it's not always always the case but that was when I read that I was like that's really strange um the other thing that's that's weird about it is just generally I think that this might have been I'm interested to see the scores everyone seems to hate this **** game so uh this seemed to be a game where I'm like I don't understand why you're even releasing this you",
      "start": 4109.76
    },
    {
      "text": "that this might have been I'm interested to see the scores everyone seems to hate this **** game so uh this seemed to be a game where I'm like I don't understand why you're even releasing this you know like like and I'm right there with you man it's not they're not Activision is not a small publisher the biggest publisher in the world they can they can afford to make good games they typically do make good games which is one of the things that I think is weird I I don't like Prototype for instance but those games worked and they were fine and people did like them um it's weird they don't often release a game that I think is going to settle in the bad territory based on what I've heard about the game from a lot of different sources um it just seemed to be a game that was just they should have just been like ah like and they shouldn't have identified that now they should have in the summer maybe been like this game is not ready they knew they knew that's the thing you're talking about",
      "start": 4144.04
    },
    {
      "text": "have just been like ah like and they shouldn't have identified that now they should have in the summer maybe been like this game is not ready they knew they knew that's the thing you're talking about another sign is like why were these trailers so bad trailers are when you're supposed to be using vertical license and all that stuff to show a game that is not what you're going to get you know what I mean why did they change the art style so late to be this cell shaded stuff late why did it seem like they've been hiding this game forever they you know what I mean like it's a Tony Hawk game and like we it got announced by the **** Chef putting out a goddamn Instagram post when he set up the event so it first leaks from a Instagram post of some random person that shouldn't have have done that then it gets formally announced at E3 during Jeff Key's YouTube stream during all the other press conferences so everybody didn't even know it actually happened like me being a huge Tony Hawks Pro",
      "start": 4178.72
    },
    {
      "text": "then it gets formally announced at E3 during Jeff Key's YouTube stream during all the other press conferences so everybody didn't even know it actually happened like me being a huge Tony Hawks Pro Skater fan couldn't immediately find a trailer at E3 like I remember I had to look for it and search through the whole **** live stream to be able to see it I'm like that's a problem then the the trailer that they showed was it was like two minutes long and a minute and 30 seconds of it was developers talking about it's Tony Hawk man it's coming back man it's going to be we're going back to the classics it's we're doing all the things you love and then it's like you see maybe 3 seconds of gameplay and the rest of the gameplay is on a computer screen in the back right and even that did look good and that's the big that's one of the big things too is like show don't tell yeah when it's just like you know what I mean like this there is there's a time for that a great time right was not what",
      "start": 4212.96
    },
    {
      "text": "and that's the big that's one of the big things too is like show don't tell yeah when it's just like you know what I mean like this there is there's a time for that a great time right was not what it would have been E3 2014 EA's press conference of hey we're working on Mass Effect we have a new Mass Effect coming we ain't ready to show you anything about it hey we're working on Battlefront here's some you know concept art that we're doing Speeders and stuff we're not ready to show you know what I mean and those games were it turns out a year and a half away for Battlefront and you know two for Mass Effect probably if not more and whereas like when you're here and like this game comes out this year and we're not showing you anything that's bad and this goes back to again on how you do it and how I knew Persona 5 wasn't coming out where was the information on this game you're not it's not suddenly going to pop up and you know Persona's gonna be an awesome game so that's why it was like",
      "start": 4254.6
    },
    {
      "text": "how I knew Persona 5 wasn't coming out where was the information on this game you're not it's not suddenly going to pop up and you know Persona's gonna be an awesome game so that's why it was like well this game's just not coming out whereas Tony Hawk they're like all right yeah we're going you're like I guess they're probably going yeah I mean it's so weird that they that they did release this game and they are just pretending it's not bad I don't even know like it's it's shocking to me that they can do this and they would do this and it makes any sense like had they known that it's going to be bad if they were **** around with it like oh the phys physics are horrible none of this makes sense the Bales look funny all the characters look dead even with the new art style things are just **** stoic and weird like weird to a point that it's like the PS1 Tony Hawk 1 didn't even look this weird you know that looked like something this just looks like who the **** approved this yeah I",
      "start": 4294.72
    },
    {
      "text": "stoic and weird like weird to a point that it's like the PS1 Tony Hawk 1 didn't even look this weird you know that looked like something this just looks like who the **** approved this yeah I mean just based on what I've seen I mean I again I haven't played so I don't want maybe I'd love it if I play I don't know I don't want to make any assumptions I just I'm just seeing people kind of go off on this game the people have been skeptical of this game for a long time and I think that activations calculus might be that a like this game might not you know noft doesn't exist anymore this is a smaller Studio that doesn't really do anything it's probably cheap to to make for them to make this game um and their calculus is probably like we can probably sell a few hundred thousand of these just just based on them being on the store shelf and reviews are not going to matter and people aren't going to see them and they might have buyers but they're not that's the thing is that game Publishers",
      "start": 4330.0
    },
    {
      "text": "just based on them being on the store shelf and reviews are not going to matter and people aren't going to see them and they might have buyers but they're not that's the thing is that game Publishers aren't stupid and in fact I would say the bigger the game publisher the less stupid they are so Activision knew full well that this game wasn't good they and and and and to reiterate because we said this before Publishers get mock reviews Publishers pay lots of money to like ex critics and people in the industry to review their games early and then be like what do you think this game's going to be write as a review based on what you think this is going to be and that every game gets those multiple ones um so I think that it's just it's just there's got to be some sort of financial calculus behind it the thing is is that this is going to have long-term ramifications on Tony Hawk and and and unlike unlike Rockband which I think is ready to come back and is going to come back I'm not sure",
      "start": 4367.4
    },
    {
      "text": "behind it the thing is is that this is going to have long-term ramifications on Tony Hawk and and and unlike unlike Rockband which I think is ready to come back and is going to come back I'm not sure how it's going to do there's always going to be space for a good skate game and they think they're **** themselves and what they're really doing is giving EA a way to come back for SK they are absolutely **** teeing it up and I and I bet you Skate is in development you know so like they're e probably looking at this being like excellent yeah you know now we can come back at EA conference in E3 next year and be like we we're we take a little take a little Slam at at your publisher in very cursy way we know you guys are waiting for a real skateboarding game we have a skateboarding game and there's again it's a **** meatball down the plate for these guys to just **** Hammer so hungry every time see it's interesting to me though because looking at this and how much of a disaster it is",
      "start": 4409.04
    },
    {
      "text": "again it's a **** meatball down the plate for these guys to just **** Hammer so hungry every time see it's interesting to me though because looking at this and how much of a disaster it is and the fact that they're still putting it out my first gut reaction is are they targeting the streamers and the let's play people that are going to like just do dumb great the first thing I I saw Ray last night brown man on Twitch there playing it right and I popped in and I watched for a while and he's just like ah this is and it's like yeah it's terrible in that way though you know and it's like that's weird if that's what they're doing it's like man why' you have to do that with Tony Hawk like you could have just **** put out I think that's giving them too much credit me to oh I think you get to the point of like are we going to cancel this game or not no we're not going to cancel it because we will ship or sell through or whatever 100 you know whatever thousand copies which will get",
      "start": 4447.4
    },
    {
      "text": "get to the point of like are we going to cancel this game or not no we're not going to cancel it because we will ship or sell through or whatever 100 you know whatever thousand copies which will get enough to make back the money we put into it or at least some of the money we put into it but it's just that's the weird thing and that's why guys really or Studios and Publishers really need to worry about their IP and their catalog because this will have ramifications it always bad games always do injure the perception of future games out of that franchise if they're bad it just always goes that way but maybe they were done with this I mean that's what sucks that's what sucks to me is that this is it this is my last chance at getting a Tony Hawk game the one that I want Tony Hawk's Pro Skater 5 are you **** kidding me yeah like do you know how excited I mean you guys know how excited I was about this being shut that's insane that they they're going back to the original naming scheme",
      "start": 4482.68
    },
    {
      "text": "5 are you **** kidding me yeah like do you know how excited I mean you guys know how excited I was about this being shut that's insane that they they're going back to the original naming scheme like that says something and this game does not say that this game is just it's it should game man it's like here's my thing it is still fun and like it is still fun to play and I'm enjoying it and I'm going to beat the hell out of this game well it is like that's the thing it's Tony Hawk man like it looks dumb there's weird branding everywhere like you're getting annoyed with your grind slams yeah sounds like a lot of fun yeah but that's the thing though is like yeah you have to work around it but the game is there it is fun it's still Tony Hawk I still enjoy it and skating around doing all this stuff Dum stuff but there's so much dumb little things for somebody that actually really enjoys the Tony Hawk gameplay and is good at it like the wall rides are just wrong to wall ride in this game",
      "start": 4515.68
    },
    {
      "text": "stuff Dum stuff but there's so much dumb little things for somebody that actually really enjoys the Tony Hawk gameplay and is good at it like the wall rides are just wrong to wall ride in this game Colin you know how before you'd go against it and like go up on the side you need to go straight into the wall jump at it and then you wall ride that makes **** sense this is the thing about they just didn't massage this game right wrong developer wrong amount of money wrong premise maybe the wrong name it seems to me that if like Activision again has the money to spend spend money on making the game properly and since the home studio doesn't exist anymore for this series they were making Call of Duty stuff and I don't they never saw it even exists anymore uh or if they do they just disbanded them into other and folded them into like Raven and other Studios that that activation owns it's just frustrating that it's like I I just think you have to take better care it's like giving a game",
      "start": 4554.32
    },
    {
      "text": "them into other and folded them into like Raven and other Studios that that activation owns it's just frustrating that it's like I I just think you have to take better care it's like giving a game like Uncharted to I don't know **** Cyber Connect or something it's like all right you guys can do this right and it's like maybe they're just not up to the task I don't know I don't know these guys history or whatever but it just seems like this is a game that has a legacy and it needs to be treated better if you're going to go Mainline which they did with with with Tony Hawk's Pro Skater and also being retail I don't think this is going to be the end of Tony Hawk but I do think that this is going to have bad perception issues and this is a weird move for Activision and I cannot remember an Activision game that was released that seems like it's going to be outright bad since the classified and I don't know that they even publish that game I think Sony might have even publish that game so",
      "start": 4596.48
    },
    {
      "text": "game that was released that seems like it's going to be outright bad since the classified and I don't know that they even publish that game I think Sony might have even publish that game so um it just seems weird it's like a weird thing like you don't see Ubisoft or Activision or EA releasing games that are like Terrible Bad yeah like so you know they're not dumb they know they know what they're doing they they they knew what this was they clearly have a plan I don't know if it's going to pan out for them or not I'm kind of curious to play and again I want to reiterate this is all conjecture I have not played the game I am just going through like Neo Gap threads and looking at trailers and just for months everyone's been being like this this game looks all **** up you know and Activision certainly holding on the re review copies and not sending them out to anyone until the game's la just like that's what we're talking about on col Greg live today that happens once in a blue moon to",
      "start": 4633.28
    },
    {
      "text": "certainly holding on the re review copies and not sending them out to anyone until the game's la just like that's what we're talking about on col Greg live today that happens once in a blue moon to a good or great game when they're really trying to hide something hide like a story spoiler or or they just straight don't trust you there are certain Publishers that do that M but when n Greg said nine out of 10 times I'd say 95 out of 100 times I'd say even more than that when a game is delivered or you don't get a copy of it before the day comes out like and you're in the you're Inus press it's bad before we move on is there any like what are other signs besides that I mean you guys have a lot of experience when it comes to dealing with this stuff developer is is the big one I think personally sure you can tell by somebody's history you know I mean again these are yeah these aren't Telltale like this game's bad because of this developer it's just saying like it's you know like Lady",
      "start": 4671.36
    },
    {
      "text": "sure you can tell by somebody's history you know I mean again these are yeah these aren't Telltale like this game's bad because of this developer it's just saying like it's you know like Lady Liberty with her **** blindfold on and you give her a scale and it's like knowing what you know these guys develop the game put it on the scale and it like tips it a little bit or whatever and it's like this is the release window and maybe it tips it a little bit more and this is when we got the game and this tips it a little bit more one way or the other where is the trailer why haven't you seen this why you know what I mean like so many of these games are so many games are so anxious to get in front of you you know what I mean that's how it is that's what PR PE job is you know what I mean like we didn't there weren't many reviews for Lego Dimensions early right but there was a stream on our channel the week before it had shown up on live shows and been played extensively you knew it was",
      "start": 4708.36
    },
    {
      "text": "we didn't there weren't many reviews for Lego Dimensions early right but there was a stream on our channel the week before it had shown up on live shows and been played extensively you knew it was happening there had been events for it at Comic Con and other things I'm just using that as an example right now but that's how a PR roll out goes for something right you see these things pop up and Tony Hawk was a ghost right like when on our Gamespot show like it was Tony Hawk who came by which was awesome let's talked to Tony Hawk for a while but it was like he didn't have like demos to show he wasn't playing I me even then it's like playing Tony Hawk we've been to a whole bunch of different events and stuff and I don't think Tony Hawk was ever playable I might be wrong about this but I don't think it was ever playable at on the show floor for the public like was it was it at GameStop I thought we walked by one on the at the GameStop you're right it was yeah but because I know that it was",
      "start": 4741.12
    },
    {
      "text": "think it was ever playable at on the show floor for the public like was it was it at GameStop I thought we walked by one on the at the GameStop you're right it was yeah but because I know that it was playable at some point like I was invited to play it at different points but uh it wasn't at E3 on the show floor sure and uh at at Comic Con it wasn't on the show floor either so I mean that's those are definitely signs too playable for the public at events where it's playable for other people yeah there just there are signs it's just the thing is is that again the Lady Liberty kind of or the you know Justice not Liberty Justice said liberty before it's not true it's Justice knows how to hold the uh is uh it's just the scale can be out of whack like Wolfenstein for instance uh the New Order being made by uh machine games like who the **** are they so like you drop that into the category of like I don't know but it actually ends up being a **** awesome and remember that they that was",
      "start": 4774.64
    },
    {
      "text": "being made by uh machine games like who the **** are they so like you drop that into the category of like I don't know but it actually ends up being a **** awesome and remember that they that was a game that they didn't hide hey I remember showing up to my pack I'm like all right the Demo's going to take 3 hours you're like what yeah no but then you sat down you played like oh the game's great no wonder they want me to play it for so long you know what I mean like they're not afraid to talk about it and I I will say to reiterate although it doesn't answer the question about good or bad is that this is why I hated previews and this is why I hated previewing games a lot and this is why I think previews are largely useless because even when a game is bad like the Order 1886 for instance they figure out ways especially closer to launch to josly a little bit they like Sony actually had done done this to us and they they're not doing anything to us they're just they're putting out their",
      "start": 4818.16
    },
    {
      "text": "figure out ways especially closer to launch to josly a little bit they like Sony actually had done done this to us and they they're not doing anything to us they're just they're putting out their game and we kind of interet exactly Beyond Two Souls was a good example like we were really dubious at this game I went and played it right before it came out and they showed us a really cool sequence the wood sequence when they're running away from the cops is really cool game ended up not being very good the Order 1886 was super dubious about it uh they show us the uh the Zeppelin sequence which is maybe the best part of the game um I was like okay maybe there's promise they've turned it around right exactly and and Knack again like Knack is a really great example because Knack is like I I played Knack at E3 I don't think I wrote anything about that E3 but I was like oh this is actually coming together like this game I think is going to be fun I had Knack was one of those games where like I",
      "start": 4854.92
    },
    {
      "text": "Knack at E3 I don't think I wrote anything about that E3 but I was like oh this is actually coming together like this game I think is going to be fun I had Knack was one of those games where like I remember when people were playing it before it came out and they're like this game's bad and I'm like really I didn't I I I was like I could understand it not being good but there was nothing about what I had seen to indicate that it was going to be bad and so I guess what I'm saying is that like the proof's ultimately in the pudding it's only when you get the full experience in the full game do you have any idea how the game really is and that's why I think that's why previewing to me was always a matter of like I want to be honest and brutal when I need to and be give it praise when I need to but it was all about that balance because it's like I don't really know yeah you know I'm just this is my interpretation of what I've been shown from this vertical slice as opposed to reviewing the",
      "start": 4892.32
    },
    {
      "text": "but it was all about that balance because it's like I don't really know yeah you know I'm just this is my interpretation of what I've been shown from this vertical slice as opposed to reviewing the entire game where you get the whole package and that's why I think like people just need to be a little more wary of previews not because people are writing previews that are not honest but because previews are just based on what they want you to see and and it always works to the game's benefit and that's what was Liling about Tony Hawk there was nothing they wanted us to see yeah Lil Wayne they wanted us to see Lil Wayne I know he's a playable skater in the game he's a famous skate do they have 311 in the game? 311 is not in the game so that's great wait Sweet Tooth the Twisted Metal character really and Ratchet and Sack Boy you got Master Chief in the other one no they got someone else I don't know there's some weird robot no I don't even know great Vector man I don't even Vector man no no no",
      "start": 4928.4
    },
    {
      "text": "and Ratchet and Sack Boy you got Master Chief in the other one no they got someone else I don't know there's some weird robot no I don't even know great Vector man I don't even Vector man no no no it does kind of actually look like Dreamcast exclusive yeah which is funny to say that because Tony Hawk on Dreamcast was like the best version of that game I play them on PS1 me too but the Dreamcast one was fantastic this topic brought to you by it was lit brought to you by Loot Crate would you classify yourself as a geek gamer or pop culture nerd then loot crate is the subscription box for you loot crates a subscription box service with $40 worth of geek gamer and pop culture gear Collectibles apparel Comics Etc delivered to your mailbox every month make sure to head to lootcrate.com KF games and ENT code KF games to save $3 on any new subscription every month there's a different theme which are all inspired by classic movie and video game releases as well as pulling from pop culture franchises",
      "start": 4969.84
    },
    {
      "text": "code KF games to save $3 on any new subscription every month there's a different theme which are all inspired by classic movie and video game releases as well as pulling from pop culture franchises this month's theme is time and quite appropriately we're celebrating the 30th anniversary of Back to the Future and the Timeless appeal of Bill and Ted's Excellent Adventure and the timey wiy charm of Doctor Who basically lot crates like a friend who know knows what you love and surprises you with an awesome present every month you have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate and then it's over you can't get it anymore go to loot crate.com kfam and code kfam to save $3 on your new subscription today final topic of the day as always brought to you by the Kinda Funny forums Kinda Funny Forum Hy if you have a topic you want us to discuss on this beautiful beautiful show go to kindafunny.com gamescast topic leave a post and we'll get to it just",
      "start": 5011.4
    },
    {
      "text": "Kinda Funny forums Kinda Funny Forum Hy if you have a topic you want us to discuss on this beautiful beautiful show go to kindafunny.com gamescast topic leave a post and we'll get to it just like we did for jalapan neilo oh okay I what doing there it was all right I I mean I wasn't excited I actually really really really enjoyed this question if you had to estimate how much money would you say you spent on games consoles and DLC how much would it be oh my God are we counting what what our our parents spent on us yeah yeah oh jeez I in college I remember getting interviewed for a girl who was working on in one of our journal for girl getting interviewed by girl is what I meant to say sorry if I didn't uh who was in a journalism class my freshman year and she knew I was big into video games and it was yeah she I she asked me like what all I had own I ran her through all the systems not of a game obviously and she's like does it ever Boggle your mind to think about how much money",
      "start": 5049.64
    },
    {
      "text": "games and it was yeah she I she asked me like what all I had own I ran her through all the systems not of a game obviously and she's like does it ever Boggle your mind to think about how much money you spent I was like not until right now you know what I mean like now now I have no idea I mean I'm going to use my calculator here okay that's cuz I remember I had this conversation back with my friends in high school where we'd stop and like this was towards the tail end of like the Xbox generation I remember looking at all my Xbox GameCube and PlayStation 2 games so this is just modern that generation looking at all of them being like all right $50 $50 $50 $50 you add it up you're like it adds up so Qui oh my God this this is like thousands of dollars how did I don't have thousands of dollars this doesn't make any sense you know there's always the things where you know you got things free or you traded ex that you know last night I was digging through Colin introduced a new segment on PS I",
      "start": 5098.92
    },
    {
      "text": "doesn't make any sense you know there's always the things where you know you got things free or you traded ex that you know last night I was digging through Colin introduced a new segment on PS I Love You that's a you know a station game and so I was digging through my trophy list last night and just the scroll and the scroll and the to try to get to the bottom where it all starts with super Stardust you know what I mean and when you get there it's just like I didn't pay for all those games obviously I was working in the industry but it's just like Lord Almighty there's so many just there you know PS3 on yeah I mean that's the thing is it's tough because from 2007 to now I mean just frankly I mean we we've not paid for a blind share by games you know so it's so the game spending has precipitously gone down since I've got out of college I'd say that on average I was spending between console and gaming including from NES so NES SNES the PlayStation era which would include",
      "start": 5140.68
    },
    {
      "text": "has precipitously gone down since I've got out of college I'd say that on average I was spending between console and gaming including from NES so NES SNES the PlayStation era which would include N64 and maybe like Dreamcast later on and I didn't own a Saturn at that you know during that um and then GameCube PS2 Xbox and then including putting in like DS Game Boy Advance Game Boy Color Game Boy it's got to be I mean I have a lot of games on some of those systems it's got to be like something like absurd like $5,000 probably so I think it's got to be even more than that I think it's more than that for you like knowing how many games you have knowing how many games I have and only imagining how many you have on all the old systems and in addition to how much you must have because you're older than me so you you were making money during like the PS2 generation I I had a job the entire PS3 generation yeah so it's like you must have been buying things left and **** right I used to buy so",
      "start": 5182.2
    },
    {
      "text": "than me so you you were making money during like the PS2 generation I I had a job the entire PS3 generation yeah so it's like you must have been buying things left and **** right I used to buy so many games I didn't even open half of them so I mean that was the thing is that I would buy I would make like $50 a week after taxes or whatever in high school and then I would just buy like four games a like I'd literally buy like four games a week for years like I I had no intention of playing half these games I remember buying like Red Faction and being like I don't even know why I bought Red Faction was great but I was like why did I even buy that like I remember being like so desperate for PS2 games I was like why did I buy Red Faction again was because that cute girl at **** Planet Comics um but I remember she always get but I had like all these Dreamcast games I remember getting even after Dreamcast was cancelled or like continued in 2001 early 2001 I remember getting like the Sega",
      "start": 5233.48
    },
    {
      "text": "um but I remember she always get but I had like all these Dreamcast games I remember getting even after Dreamcast was cancelled or like continued in 2001 early 2001 I remember getting like the Sega smash pack and like well I would just buy anything so like during the so like PS1 N64 PS2 Dreamcast Xbox GameCube that was when I spent a lot of money I have a lot of games on those systems especially GameCube and PS2 and PS1 N64 I probably had like 20 games they're expensive though yeah they maybe a few maybe 15 maybe more than that probably and then PS1 I feel like I had I mean I had a lot of games on PS1 like dozens of games on PS1 for sure PS2 I probably had dozens of games I probably had like 30 GameCube games and 10 Xbox games or something like that I don't know it's hard to say the thing is that I have more my the biggest question I have is PS3 I have over 100 retail PS3 games but I don't know I mean to be perfectly honest with you initi I don't know that I paid for any more than a",
      "start": 5265.6
    },
    {
      "text": "is that I have more my the biggest question I have is PS3 I have over 100 retail PS3 games but I don't know I mean to be perfectly honest with you initi I don't know that I paid for any more than a few of those and I think you're probably the same oh yeah same way yeah that's the thing out there of why that collection's so vast and into PS4 now too just in the fact of like you know eventually IGN changed our policy of like you couldn't trade in games anymore while we were there and this is early early like 08 when we were there I don't remember you you when IG when Hillary switched the policy he's like don't trade anymore and so like that's why I just have all these PS3 games so yeah like do you just weren't allowed to trade it right there was there was always this you know when when I first got to IGN coming out of Journalism school like it was the Wild West in terms of like I don't know if this is the right thing to do and like as the industry grew up ethics became a real thing and",
      "start": 5314.36
    },
    {
      "text": "got to IGN coming out of Journalism school like it was the Wild West in terms of like I don't know if this is the right thing to do and like as the industry grew up ethics became a real thing and everybody's like this is eventually enough people were awake to the fact of like this is weird that we're getting games for review or just because it was like it used in the old days when companies had money to burn it would be like hey everyone gets a copy of game whatever it is and so like one person's reviewing and 30 people have it and then if you know 29 of those people didn't care about it they could go trade it in or whatever oh I got you so tra gam whatever free games you're getting exactly exactly exactly yeah if you bought a game you can do whatever you want yeah okay cool and so like that's when like the collection just started of just like oh cool and now we're it's the same thing right now everything we gets digital seems but like even with the PS4 and stuff like I mean digital",
      "start": 5355.36
    },
    {
      "text": "that's when like the collection just started of just like oh cool and now we're it's the same thing right now everything we gets digital seems but like even with the PS4 and stuff like I mean digital still costs money though that's the sure yeah I mean between on PS3 retail and digital I have to have something approaching 300 350 games probably I mean my digital my digital collection on all these things is insane all of these things you look in there I have like I probably have most of the VA games released on retail or I un like we and Wii U even those things add up you know how many copies of just think of how much money I put into just the Super Mario Bros series is crazy yeah you know I I I I'm just bringing that up though not to say like these are the amount of games that bought it's like this is an unrealistic amount of games that no one owns and that in the .1% and that's why it's impossible for us to quantify how much money we would spend because if I look at my shelf about",
      "start": 5390.8
    },
    {
      "text": "like this is an unrealistic amount of games that no one owns and that in the .1% and that's why it's impossible for us to quantify how much money we would spend because if I look at my shelf about the games I would have bought it's probably 10% of the games that I actually own so exactly um maybe a little more than that like 20% but so that's why like we I'm just saying that to be honest and to say like we are detached from that reality today but there was a point in time when we were far from being detached from that reality and and and I can sympathize with those guys that go out and be like I don't even have time to play all the games I buy because I was like I'm right there with you man when I go through my game collection at home every few years I go through dozens of games that are still wrapped that are like just I don't even like that see that's crazy you that's what I did too and I like honestly that was I it's it's a convoluted question because I would venture to say my",
      "start": 5437.88
    },
    {
      "text": "are still wrapped that are like just I don't even like that see that's crazy you that's what I did too and I like honestly that was I it's it's a convoluted question because I would venture to say my Genesis collection was my biggest collection I ever had and that was cuz parents would my parents would buy them and I remember I had this little cabinet that had all like three big shelves and I was a little kid of got of course so size is all **** up but I remember having this thing and I remember a friend came over one of my mom's like friends from back in high school his she came over with her kid and he's like oh you got a Genesis you want to play something like yeah and he's like what games do you have I'm like oh they're in there and he opened it up and he was like I've never seen this many games you know what I mean but we were dumb kids so then you jump for to PS2 generation PS2 was the first console I ever bought with my money that was like my thing and that was definitely the",
      "start": 5471.4
    },
    {
      "text": "many games you know what I mean but we were dumb kids so then you jump for to PS2 generation PS2 was the first console I ever bought with my money that was like my thing and that was definitely the thing of like I remember yeah like getting Hitman and Shadow of the Colossus like in the same trip or whatever and then I think I finally open Hitman popped in I'm like I don't I like this and popped it out you know what I mean like you were just burning through because there were so many **** games on that thing it's just funny how you know a couple year difference in age will change so much like for me PS2 I was still I was like middle school so that was I didn't have my own money so it was like I'll me and my friends would like combine money and pitch and buy Gam together and share them and stuff like that that was an event that was like if we bought a PS2 game or GameCube game or Xbox game that was the game we were playing for the next month right you no that PS2 like yeah that came",
      "start": 5507.52
    },
    {
      "text": "stuff like that that was an event that was like if we bought a PS2 game or GameCube game or Xbox game that was the game we were playing for the next month right you no that PS2 like yeah that came out you know my the what fall of my senior year I waited in line the nine hours to get it with Adam Brown and then I went to college and I was **** awesome at College because I had a PS2 not many people had those yet you know what I mean and that was totally the thing of like I am dying for PS2 games it that pilgrimage out to the Columbia Mall go to GameStop to see what they had walk down to Slackers and just look through the PS2 catalog on the wall and I've played most of these or I haven't and it's like buy something bring it home try it yeah see if it's yeah the bouncer yeah oie I remember being **** stoked for Onie I'm like yes a third person action game hell yes this is going to be great and then you're playing it's like well it's it's like dark angel ps 's launch was was a good",
      "start": 5544.2
    },
    {
      "text": "being **** stoked for Onie I'm like yes a third person action game hell yes this is going to be great and then you're playing it's like well it's it's like dark angel PS's launch was was a good sign because I still I still say Vita actually out of all the PlayStation devices had the best launch library and it was because PS Vita nailed what PS2 didn't which was PS2 was like we just have a lot of games I don't think there's any system that came out that had more launch games than PS2 there were so many launch games that there were Studios that made multiple launch games so it was like what the and I remember looking at these gam being like what the **** is all this **** and I I I run SM was Phantom Mission I had smuggers run was was fine but I remember buying geni or something like that and being like Oh my God and then I I like that was when you still bring games back after you open them and I bought Summoner and I was like oh oh my God and then it was like and then it was like",
      "start": 5584.4
    },
    {
      "text": "and being like Oh my God and then I I like that was when you still bring games back after you open them and I bought Summoner and I was like oh oh my God and then it was like and then it was like no bag's ambition or some **** game like that and I was like Jesus Christ I I remember I remember being like what the **** am I supposed to play I t myself into silent scope at launch and I came home and cracked that open and took it right back and got mad and I was like all right this is a much better that's what happened to me too I ended up sing at NHL where I was like all right fine I can play NHL it's fine that's so funny um but it I'm just this goes back to I met a kid in Vegas um when we were there for GameStop we were talking to him and he was the kid that during our panel was like I have money to burn and I was like so should I buy this and I'm like save your money when I was your age because I was literally his age when the PS2 was out I was like I spent all of my money on video",
      "start": 5624.92
    },
    {
      "text": "money to burn and I was like so should I buy this and I'm like save your money when I was your age because I was literally his age when the PS2 was out I was like I spent all of my money on video games all of it you know and I would leave a little bit to go to like a movie a week and be able to eat at the **** food court and then I would have no money until I got paid the next week and I'm like that is just stupid if I could take 90% of the games in those **** boxes in my mom's beach house and put them back and get that money back I'd be rich that's what got you here though you know stupidity and that passion yeah yeah it's true I guess but I just I look back at those days where I was making you know $15,000 a year working a lot at like a deli or whatever and I'm like man I really at 16 years old 17 years old when I had no expenses my mom was paying for my cell phone I didn't have rent or anything like that I was like I could have lived like a **** King I I would have been like",
      "start": 5664.52
    },
    {
      "text": "16 years old 17 years old when I had no expenses my mom was paying for my cell phone I didn't have rent or anything like that I was like I could have lived like a **** King I I would have been like totally sep instead I went like a beline like a **** heat seeking missile to Smith Haven Mall on Long Island every week with my stupid **** friends and we would spend hundreds of dollars on video games every week and then I would go home and be like I don't even know when I'm going to play these games yeah and then and then I remember having my dad had this like shelf he made me and I just had it was just lined with games and I was just like this is all of my this is everything I own is right here I even have like the shitty TV I'm like I'm focused on buying these this Hardware in these games and I'm **** focused and fixated on this I remember when I went to college I had this those old DVD shelves that were like these thin but like vertical and it was just all PS2 games and I was",
      "start": 5708.16
    },
    {
      "text": "games and I'm **** focused and fixated on this I remember when I went to college I had this those old DVD shelves that were like these thin but like vertical and it was just all PS2 games and I was like the hell am I doing like there there came a point in time it really was like 2004 which is the year I always talk about when I really stopped playing games for a year where it like it all collapsed it wasn't even like it went down it was just like everything just **** fell out and I was like what am I doing you know like that was the year when I played Resident Evil 4 San Andreas and I and that's basically it yeah it's pretty much the end of the PS2 yeah and it was a weird like transition era but the times before and I was I was writing for IGN and stuff like that so I would get games that way but it was just like that was when I stopped really buying games conspicuously and I was like this is dumb like I I was obsessed as we all were in the pre-digital ERA with and you still are",
      "start": 5745.52
    },
    {
      "text": "that way but it was just like that was when I stopped really buying games conspicuously and I was like this is dumb like I I was obsessed as we all were in the pre-digital ERA with and you still are with just having collecting you want these things I was like well my PS2 collection certainly can't be complete unless the bouncer's on there and my PS2 collection certainly can't be complete unless I go back and don't get the red version of you know uh the **** bestell get me started oh my God **** that **** yeah ATV whatever off-road whatever **** random that I don't even understand why I ever bought and I and I would and I would like stare at my shelf and be like oh it's the red version that's satisfaction that satisfaction of having them there I remember when I got the N64 and like that was my first Nintendo console that was like what real like I bought SNES just to play Mario one time but I had it and like I wouldn't I kept the boxes in pristine condition and I'd slide them",
      "start": 5781.28
    },
    {
      "text": "that was my first Nintendo console that was like what real like I bought SNES just to play Mario one time but I had it and like I wouldn't I kept the boxes in pristine condition and I'd slide them out and take the cartridges out and put them in and then put them back in and slide them and I had this like beautiful thing I was like the TV it was the Shelf with all the systems on it and then on the bottom I had underneath it the games lined up in like a perfect little brick array all label facing yeah but it's like yeah why why was I buying these things what was I doing these Mario Party obsessed with Mario Party cutting the whole in my hand playing Mario Party that's why I just bring this up is just say like don't do that buy the games you want like because there are people that just buy games and you see it on sometimes Facebook group and just I know people like that just yeah they just buy games and it's great buy buy as many games as you want but don't do what I used to do or like a",
      "start": 5822.8
    },
    {
      "text": "and you see it on sometimes Facebook group and just I know people like that just yeah they just buy games and it's great buy buy as many games as you want but don't do what I used to do or like a lot of other people maybe still do or used to do which is like just save your money man like buy a couple games a month maybe you don't need to be buying like all you don't have time yeah I mean it's funny like thinking back for me I never really I was never I never had that money like I went from not having money to once I had money being a little bit more you know in the industry and stuff so either I got stuff or I knew what games I was buying I'm going to buy those games you I'm buying Smash Bros it's going to **** happen you know but I I've never really been the type just walking to a GameStop and be like oh that looks kind of cool I'm gonna I'm gonna buy that you know for me it was like when what was the killer to that was the rise not the killer of I should say but one of the things",
      "start": 5857.24
    },
    {
      "text": "and be like oh that looks kind of cool I'm gonna I'm gonna buy that you know for me it was like when what was the killer to that was the rise not the killer of I should say but one of the things that was able to cut off the random buys and purchases and interest just on a box was when like Blockbuster got his **** together and had a great video game section and did that's when we'd go in and just take a shot I'm going random this is when I'm going to play all these games I wasn't never going to pay $50 for a game I had knew nothing about but I remember being uh in middle school and even high school reading these video game magazines and just looking into you know after June towards December looking at that holiday and just being like **** how am I going to buy Metroid Prime 2 and Need for Speed underground whatever and Tony Hawk and this and that like I'm not going to have this much money right you I remember my friends discussing this like all right you get these three you get",
      "start": 5892.56
    },
    {
      "text": "for Speed Underground, whatever, and Tony Hawk and this and that, like I'm not going to have this much money, right? You, I remember my friends discussing this like, all right, you get these three, you get those four, like we'll combine, have your mom buy me this for Christmas and my mom will buy you that for Christmas and just trade with each other. Well, when you're close like that, we had a whole scheme going. It was it was a good a good system. But man, yeah, to answer the question is, I think I spent about 0, 5,000 on games. I think you've spent a lot more than that. Maybe I don't even want to think about it. It's a terrible thing to think about. And then there was eBay and so you rebot all the games that you traded in for nothing. Yeah, I used to, I used to really, I I'm telling you man, I used to, I don't know what the **** I was doing. I really don't. I have no idea what the **** I was doing. I was buying Genesis games, I was buying like N64 games, The Collection, yeah, like just like fill like games that",
      "start": 5933.88
    },
    {
      "text": "what the **** I was doing. I really don't. I have no idea what the **** I was doing. I was buying Genesis games, I was buying like N64 games, The Collection, yeah, like just like fill like games that I was like, I'm never going to play this game, you know, I'm never, I don't know. I I remember a lot of it was sparked cuz I found like eight copies of of Castlevania Bloodlines at Toys R Us in 2000 that were sealed still in Genesis and I was like, oh, and I I'm going to retire. Yeah, and I was and then but then you go on there and you and you just I'm just buying and it's funny my brother is that person now. My brother is, you know, uh, you know, in his early 40s and he's big gamer and and he's a big retro gamer and he just buys so many **** games like nothing even new just like he has like a Famicom collection and a Super Famicom collection, NES, that's NES, all Atari and I'm like and he tells me he's like, yeah, I bought blah blah blah blah blah blah blah this week. I'm like really it's like a lot of",
      "start": 5977.84
    },
    {
      "text": "collection and a Super Famicom collection, NES, that's NES, all Atari and I'm like and he tells me he's like, yeah, I bought blah blah blah blah blah blah blah this week. I'm like really it's like a lot of games dude that's a lot dude and and uh yeah, so but then you see those pictures of those like, you know, guys that have like the collections and stuff on the wall and they make them look all nice that looks awesome and you simultaneously go, oh **** I hope I never get there and goddamn that's he's the coolest dude in the **** world like one day I hope I'm that guy. Yeah, it's like it's like feast or famine with that **** man. Yeah, Sha Shanker says, hey guys, what's your opinion on borrowing or lending games to friends? I feel kind of dirty when I let a friend borrow a game knowing that they didn't pay money for it and that the company that made the great game didn't get a profit in the situation. However, most of the time I know that my friends wouldn't buy the game otherwise so I feel like I",
      "start": 6020.88
    },
    {
      "text": "pay money for it and that the company that made the great game didn't get a profit in the situation. However, most of the time I know that my friends wouldn't buy the game otherwise so I feel like I owe it to the developers to let my friends experience their great work which is right. I mean I don't think it's a moral conundrum it's your game. Yeah, I think I always support I always tell people to buy games new if they can and to support the Publishers and developers if they can to give them their financial incentive to do good things but it's your game. It's the same thing as like saying like uh the five of us are sitting in the living room and one of us is going to buy the movie on Amazon so we can all watch it you know like that's normal and I think fine I don't I don't necessarily think there's anything on tour but it's super rare too you know what I mean like what I rented Interstellar once and you and Sheri wased it the next night you know what I mean like game-wise doing it I I feel",
      "start": 6056.68
    },
    {
      "text": "anything on tour but it's super rare too you know what I mean like what I rented Interstellar once and you and Sheri wased it the next night you know what I mean like game-wise doing it I I feel like usually it comes down to especially if he's like if his friends were like my friends in high school right that weren't into games like Po or whatever like me lending him a game was that he's never going to buy this game you know what I mean and so like even nowadays that's the way way it be it's so rare somebody if they're looking through out there and like oh man I always wanted to try this can I try it like yeah go ahead it's old it's not new you know what I mean if it's a if it's you're passing around a game that is PS3 or PS4 launch era game like well it's one of those then you start have to weigh if you're really worried about the developer it's more word of mouth right another person has played this they now know they believe in developer X yeah they're going to Tweet about how much",
      "start": 6090.96
    },
    {
      "text": "to weigh if you're really worried about the developer it's more word of mouth right another person has played this they now know they believe in developer X yeah they're going to Tweet about how much fun they're having it's like all exactly yeah I think it's a good thing I mean I think people experiencing the things that you like is important it's the it's not I'm saying it's not the same as what we're always talking about of walking into GameStop and oh for I'm going to save the five bucks and buy this used copy of the game well no buy the new copy because you're already there you're already in your head committed to buy this game like why is it you know like here when it's just like I want to try this I wouldn't buy it any other way well then yeah play it I want you to talk about it and be able to say something about it yeah the only relevance to it is that I remember the the Quantic Dream story from some years ago when David Cage some said something and I I think the numbers are",
      "start": 6128.24
    },
    {
      "text": "be able to say something about it yeah the only relevance to it is that I remember the the Quantic Dream story from some years ago when David Cage some said something and I I think the numbers are right but they could be awward he was saying like we sold 2 million copies of Heavy Rain but 3 million trophies like trophy lists were activated so like 50% of the people that played the game didn't even or 33% of the people that played the game didn't even buy it I'm like yeah that sucks when you look at that near developer and you're like well we missed out in a million sales because the rentals are borrowing and all that stuff I'm like ah yeah that's that's just the money like yeah and this sounds like some **** Soul Skater **** but it's like money's one thing but it's like if you're making this thing that you want people to enjoy it's like for you know looking at us as an example it's like the people on Patreon that are paying for this content that's **** amazing and we love that",
      "start": 6160.92
    },
    {
      "text": "this thing that you want people to enjoy it's like for you know looking at us as an example it's like the people on Patreon that are paying for this content that's **** amazing and we love that but then you look at YouTube it's free and it's like those numbers are just as valuable because we made something and people are enjoying it you know but let's see I want to we we went long on though so have one more oh that was you I thought it dog I was like damn dog's Lou I also like earlier when he came in Snee but it was just the most dramatic entrance he's ever made um my favorite the Pella is never cuter than when he comes around and just jogs in cuz he jogs he just looks up at you and he just looks perfect he just looks perfect you're perfect dog 18 asks and I think this is another cool question it's a Box Car Racer Blink 182 reference it's got to be yeah don't you think or it's Box Car Wily his favorite country musician probably not that one with movies now having their own shared",
      "start": 6192.92
    },
    {
      "text": "question it's a Box Car Racer Blink 182 reference it's got to be yeah don't you think or it's Box Car Wily his favorite country musician probably not that one with movies now having their own shared Universe do you guys think games could jump on this wagon as well if so what game worlds would you see would you love to see Collide it can be reasonable or wishful thinking well let go to mention no um see I think the thing with this though is you need I think reasonable is more fun to look at cuz wishful thinking it's like oh let's just combine whatever the **** we want I think it's cool to actually look at the politics of you know developers and all that stuff and be like like the Square Enix Universe could be a thing got you okay okay I'm with you now yeah I think I'm sorry to interrupt I was just G to say I think that I I don't like the whole like Universe sharing thing I think it stifles people ultimately it it oh the more you go down that road the more you're pigeon hold into",
      "start": 6235.72
    },
    {
      "text": "I was just G to say I think that I I don't like the whole like Universe sharing thing I think it stifles people ultimately it it oh the more you go down that road the more you're pigeon hold into doing or saying or creating certain things that fit within the realm of this universe and to make sense in these Universe I wish people would just continue to make things that don't touch each other necessarily in terms of like plot or setting or whatever it's not necessary then what does it add you know if The Last of Us was a pre was a sequel to Uncharted for instance like that's just like what does that do for I love it there's something about that like even if it's like I don't need it to be you know super forced and super like you know explained and stuff but if if those were in the same universe and it was just little mentions here and there they might be but like that type of thing I love that I think that's really cool but for them to like really kind of do the Marvel Universe type",
      "start": 6273.44
    },
    {
      "text": "and it was just little mentions here and there they might be but like that type of thing I love that I think that's really cool but for them to like really kind of do the Marvel Universe type **** where it's like every single thing is building up to this next stuff that might be a little much and uh Assassin's Creed and Watchdogs I don't I am not too familiar with those games yeah there's like what something buried in uh I know what you're talking about yeah there's a reference yeah I can't remember that's cool I think that's really cool and I think like that type of thing interesting Co yeah it is interesting I mean Uncharted 3 has a reference to The Last of Us if that that would be so it it it does that would be awesome if the end of Uncharted 4 like Nate and Elena are like whatever and it's like credits rolling and there's like one more scene of them flying back to the States and they look out the window and it's just pandemonium like what is happening see that would be ****",
      "start": 6311.96
    },
    {
      "text": "and it's like credits rolling and there's like one more scene of them flying back to the States and they look out the window and it's just pandemonium like what is happening see that would be **** great n well that' be a but that'd be a really shitty end for Uncharted and like that that would feel like you're screwing over Uncharted that's what it comes down to right like theoretically and this is before you said reasonable my first thing I jumped to right was why can't Uncharted and Tomb Raider be in the same thing you know what I mean same universe because it does and I'm not talking about a full-fledged crossover but I'm talking about like it would be as simple as like you know they he's paging through notes and he sees Laura Croft's notes or there's something you know her her climbing spear is embedded in a wall when he W he's investing like who somebody was here not too long like **** like that I wouldn't mind but I don't it can't get to what we just said with Uncharted last",
      "start": 6348.24
    },
    {
      "text": "spear is embedded in a wall when he W he's investing like who somebody was here not too long like **** like that I wouldn't mind but I don't it can't get to what we just said with Uncharted Last of Us where the Uncharted thing slams into Last of Us and they both explode you know what I mean like now it's like oh man like what a **** horrible for Uncharted I like some of that I think it could be could be cool but I do think that there needs to be enough of each franchise to be its own thing and then you can start you know just to change **** up like Uncharted four okay like we've we're we've done enough you know what I mean changing **** up I mean if you want if you want to have it go that way and they fly in at the post credit scene of Uncharted 4 they look out and like people are attacking each other however you want to start it right that's fine as long as Last of Us Two is Nathan Drake whatever it is 30 years the 20 what is it how much times past 11 is it what from uh the",
      "start": 6385.4
    },
    {
      "text": "attacking each other however you want to start it right that's fine as long as Last of Us Two is Nathan Drake whatever it is 30 years the 20 what is it how much times past 11 is it what from uh the start of Last of Us to when we pick up with Ellie isn't it 20 or is it 30 all right so there you go so Drake's going to be old he's going to be Sly he's going to be old as **** but like great now I'm kind ofest now the other thing for me that's obvious and this is already kind of a thing is Nintendo just have like a Nintendo Universe yeah but that doesn't count those are just they kind of do though too that's what I'm saying like they already kind of do with Smash Bros but like I want to see it more like the fact that Mario Kart is only kind of dabbling in it it's like it should just be Nintendo cart all this stuff should just be Nintendo this Nintendo that and whatever um but I I think this is more of a fun question when it comes to story and you know instead of not just like Mario Kart",
      "start": 6423.76
    },
    {
      "text": "cart all this stuff should just be Nintendo this Nintendo that and whatever um but I I think this is more of a fun question when it comes to story and you know instead of not just like Mario Kart or smash sure I it's like a well that doesn't count I guess I was going to say Portal and Half-Life, Half-Life like they're in the same world like with Black Mason stuff but me that's not as like crazy but I mean that does count though I mean that's it is the same universe sure sure sure um I mean like you know Square with all their games and they're talking about doing a movie Universe I guess it fits with the game to technically the Western Square yeah yeah yeah yeah Japan Square I mean Final Fantasy is already see the problem with games is that most not every game lots of games they're whatever you're overcoming the end of the world or something like an existence so great how do you wrap in something else and have that make sense how do you put somebody else in the Persona Universe other",
      "start": 6459.96
    },
    {
      "text": "you're overcoming the end of the world or something like an existence so great how do you wrap in something else and have that make sense how do you put somebody else in the Persona Universe other than other Persona characters yeah well see what's interesting about the end of the world stuff is that I mean if you beat the game that means it didn't happen sure so but Drake's a great Uncharted is a great example of it happening in an island that in Tomb Raider 2 where these things are happening and no one else would know about it but like Dead Rising can't we can't say Dead Rising's part of this or Resident Evil's part of this you know what I mean like there has to be these little things that are pocketed and when you're just putting together pocketed things what are the crossover opportunities yeah ladies and gentlemen that has been episode 39 of the Kinda Funny Games Cast this topic is brought to you by DraftKings put your fantasy skills to the test starting Sunday at draftkings.com",
      "start": 6500.36
    },
    {
      "text": "yeah ladies and gentlemen that has been episode 39 of the Kinda Funny Games Cast this topic is brought to you by DraftKings put your fantasy skills to the test starting Sunday at draftkings.com America's favorite onewe fantasy football site where you can K off the season by winning $10 million it's the biggest fantasy football contest ever $10 million in prizes are up for grabs including 2 million for first place and 1 million for second one week fantasy means no season long commitments it's Fantasy Football on demand play where you want when you want with the players that you want this isn't fantasy as usual this is DraftKings welcome to the big time hurry to draftkings.com and use promo code Kinda Funny to play for free for a shot at part of 10 million in Sunday's Millionaire Maker event and andent they Kinda Funny for free entry now only at draftkings.com that's draftkings.com thank you guys for joining us thank you in honor of that DraftKings is that what you wore your high",
      "start": 6534.52
    },
    {
      "text": "event and andent they Kinda Funny for free entry now only at draftkings.com that's draftkings.com thank you guys for joining us thank you in honor of that DraftKings is that what you wore your high school football coach Jack little leue coach yeah I like this jacket I like I like this jacket a lot I like it I'm just saying that it's are going to they are going to hate I'll see you guys next week and I love you all bye thank you bye love you",
      "start": 6572.0
    }
  ]
}
