{
  "id": 1294,
  "video_id": "tsPbLaxgfH4",
  "show_name": "The GameOverGreggy Show",
  "hosts": [
    "Greg Miller",
    "Tim Gettys",
    "Nick Scarpino",
    "Adam Sessler",
    "Colin Moriarty"
  ],
  "title": "Adam Sessler Returns! - The GameOverGreggy Show Ep. 98",
  "description": "Adam Sessler returns to tell us about the new horror movie he is in, Lumberjack Man, Tim Gettys wants to know what have been the most challenging moment of our lives, we all Google image search ourselves to disastrous results, and Colin Moriarty challenges conventional wisdom. (Released 10.16.15)\n\nLumberjack Man Amazon Link:\nhttps://amzn.com/B015S61D1U\n\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1445583600,
  "duration": 6533,
  "transcript_chunks": [
    {
      "text": "I got beat. What's up everybody? Welcome to another episode of The GameOverGreggy Show. I'm one of your hosts Greg Miller alongside the producer/seducer with his haircut and his shorts Nick Scarpino. Oh my god Greg. It's so hot outside right now. It is. I I don't like it. This is not why we moved to San Francisco. It's supposed to be fall all the time here. It's ridiculous. We're supposed to have built-in air condition in the way of it's always freezing. And now I've been I've been wearing shorts three consecutive days in a row. That is a record for me. That's no good. That that just reminds me of my days spent my youthful days spent in Southern California. Place of myth. You know why happening? Why is that? Cuz global warming came. Yeah. I haven't said that at all. It's we mean global warming is real. El Niño is coming. You're going to wish it was warm in a few weeks probably when it's **** torrentially raining for the next five months. I'll love it. I'll just swim down my",
      "start": 11.84
    },
    {
      "text": "warming is real. El Niño is coming. You're going to wish it was warm in a few weeks probably when it's **** torrentially raining for the next five months. I'll love it. I'll just swim down my street. Yeah. See that's the thing is it's like this heat has been stopping me and Nick from enjoying our walks to Starbucks. And when I say that I mean me. Um but once it rains I can walk through rain. I'm okay with the rain. Well it's a warm rain. Oh I'm out of No don't worry. No you're only surprising the podcast. Scarpino and Tim Gettys and of course our good friend who's getting to hug Adam Sessler. Yeah. Thank you so much. Thanks for coming back. Nobody ever comes back. Where is everyone? I had fun the first time. We're happy to have you Adam. Thank you for coming through. My pleasure. How are you surviving the San Francisco heat wave? No it's horrible. I mean my my my place here in the city it's got a wonderful view but it's at a horrible cost because the windows only point west",
      "start": 75.76
    },
    {
      "text": "are you surviving the San Francisco heat wave? No it's horrible. I mean my my my place here in the city it's got a wonderful view but it's at a horrible cost because the windows only point west and the windows don't really open and there's no way to circulate air. So even in the evening when it does cool off it doesn't cool off in the apartment and then it just starts warming up the next day and like I'm slowly losing my mind. Just cooking from the inside. It's not greatly. My wife has a whole system where like the windows have to be cracked at just the right amount. The the shades have to be closed for the like the beginning of the day and toward the end they start to open up a little bit. It's a whole angle game. Yeah it's an angle game. Well we didn't even talk about this and I know you don't check my Twitter so you'd have no idea. Sure. I'm out there Sunday morning trying to get the DirecTV to work. It's giving me trouble. Of course cuz DirecTV sucks and I won't go",
      "start": 116.08
    },
    {
      "text": "I know you don't check my Twitter so you'd have no idea. Sure. I'm out there Sunday morning trying to get the DirecTV to work. It's giving me trouble. Of course cuz DirecTV sucks and I won't go down that road but I'm work I'm working on the DirecTV. I have open up the windows. I'm on hold the thing and all of a sudden just all of this water shoots through the window. What? And then through the other window all of this water and then back to the other window continually water raining down all over Colin's chair the furniture and I run to the I go \"Stop. Stop.\" And it's our landlord. He goes \"Oh your windows were open.\" He was trying to clean the windows. Wow. But instead he just blasted right through the screens into the house. I was like \"God it's just like all these things are going wrong at once. Something about this neighborhood right now that's just losing its **** cuz between so the water issues I guess and then the freaking squirrel man which is the dude that",
      "start": 152.4
    },
    {
      "text": "are going wrong at once. Something about this neighborhood right now that's just losing its **** cuz between so the water issues I guess and then the freaking squirrel man which is the dude that decided to just put like squirrel traps all over the They're not traps. They're definitely not traps. He's making them in the traps. He's trying to increase the squirrel population in this general vicinity and it's terrifying. I don't I don't know to what end he's doing. Yeah that that was I mean if you have more squirrels don't you just have more bubonic plague opportunities? Yeah this doesn't sound good. I I don't trust any of this cuz it started just around his house which is like I this guy at the end of the block. Yeah. It's like I'm still uncomfortable with this but whatever do you but then all of a sudden you start walking you start noticing that there's these things they look like giant Rice Krispie Treats. Yeah. It's like starting to feel like a horror movie. Like it's starting",
      "start": 186.56
    },
    {
      "text": "then all of a sudden you start walking you start noticing that there's these things they look like giant Rice Krispie Treats. Yeah. It's like starting to feel like a horror movie. Like it's starting to shit's going on. Feels like Blair Witch. Why do I feel like everyone in this neighborhood thinks I'm going to rob them? I don't know why I feel that way but every time I walk down the street people look at me like I'm going to rob them. And I'm like I don't understand why I'm the shifty person. It's just a very distrusting neighborhood. Weird **** going on. We lived in in an older neighborhood. We skew up. And most people have families and kids. So when somebody with their punk haircut and chubby shorts come walking through my smoking cigarettes they expect trouble. Yeah that's true. I guess you do look like trouble. You look like trouble when it's specifically when it's the three of us. When it's me you and Kevin just like walking down the street. But do I look like Taylor Swift",
      "start": 220.48
    },
    {
      "text": "guess you do look like trouble. You look like trouble when it's specifically when it's the three of us. When it's me you and Kevin just like walking down the street. But do I look like Taylor Swift trouble or like real trouble? Real trouble. Well not real trouble either but somewhere in the middle of lowercase T. Yeah. Okay. Okay. And then there's the construction. Oh yeah. Across the street then just hammering that goes on. They just never they never make any progress. It's a drug front. That whole house has been shifty for a long time. They moved in a year and a half ago. They've never put any furniture in the living room. I don't know what the hell they're doing over there. I look through the windows living places that like you know they're they're like I saw it on Craigslist. I think this one guy was trying to rent a room. It was like a bachelor to six people but they just had CS on each wall. I mean I think that's what people are doing. They're just buying properties. Just saying.",
      "start": 255.44
    },
    {
      "text": "one guy was trying to rent a room. It was like a bachelor to six people but they just had CS on each wall. I mean I think that's what people are doing. They're just buying properties. Just saying. Like I think there's one other guy that was offering I think for 750 a month a tent on his deck. Yes I heard about that. Like legit. I was like you could live in my backyard. Some ridiculous **** Capitalism. Capitalism indeed. The tent's worth what you'll pay for it Greg. I'm sorry. What? The tent's worth what you'll pay for it. It's true. I wouldn't pay for it. Wouldn't pay anything Tim. Mhm. If you didn't know this is The GameOverGreggy Show. Each and every week four sometimes five best friends gather on this table each bringing a random topic and discussion for your amusement. If you like that head over to Patreon.com/KindaFunny where you can toss us a few bucks and get every episode early. You keep you keep touching me which normally I like. I'll be honest because everything is",
      "start": 292.4
    },
    {
      "text": "like that head over to Patreon.com/KindaFunny where you can toss us a few bucks and get every episode early. You keep you keep touching me which normally I like. I'll be honest because everything is sticky and clammy right now on me on you. Your hand feels like when Portillo has a cold and the nose rubs up against you. Kind of tough but kind of clammy at the same time. It like exists in both those states. Clammy. Little clammy. Right out of soft hand. All right. I actually I I I accidentally for the past three days I've been trying to be better at putting on you know sunscreen. Oh yeah. So I've been putting on from this big tube that my wife had out on the sink and you've been putting on this sunscreen. And today she's like \"What's wrong with you? Why are you like I like I I couldn't hold things like my phone. You're trying to turn knobs and they're just slipping out your hand.\" And she's like \"What are you putting on?\" I'm like \"Well you know there's all that there's",
      "start": 334.24
    },
    {
      "text": "hold things like my phone. You're trying to turn knobs and they're just slipping out your hand.\" And she's like \"What are you putting on?\" I'm like \"Well you know there's all that there's there's so much that comes out of that tube.\" She's like \"Which tube are you using?\" I was like \"Well that's that big one on the sink.\" She's like \"That's like shea butter.\" Oh yeah. Body lotion that I've been rubbing all over my head and my face for the past three days and showing if I'm remarkably glisteny right now it's actually because of that. You got a glow right? That's amazing. That's a great way to be. That's a great way to be. Now my wife always gets this stuff like the special stuff that costs way too much per tube. And when you put it on it never like actually goes into your skin. It just coats your hands. Like it's exactly what we were talking about where you put it on maybe after you've gone to the bathroom and the door's locked and you can't you don't have the physical",
      "start": 373.92
    },
    {
      "text": "It just coats your hands. Like it's exactly what we were talking about where you put it on maybe after you've gone to the bathroom and the door's locked and you can't you don't have the physical dexterity to unlock the door anymore. So you're just kind of like pawing at it like a **** dog desperately to do it. So funny. This is why I used to have lotion at work cuz if I would lotion before I leave Yeah. And then but then once I got to work I didn't do anything. So I just sprayed it all over myself and rubbed myself down inside. Funny funny story about that lotion. That was Anthony Gios's lube. Wow. that we made that last when he left he he gifted it to me. By that I mean I just I walked up to his desk and I said \"Can I have that?\" And he said \"Sure.\" But we used that. That thing lasted for three years. Yeah. And I used it a lot and as did you. I saw you sneaking it out there. Little dribblelets. There's something else funny too. If you ever read IGN PlayStation from 2011 to",
      "start": 406.72
    },
    {
      "text": "lasted for three years. Yeah. And I used it a lot and as did you. I saw you sneaking it out there. Little dribblelets. There's something else funny too. If you ever read IGN PlayStation from 2011 to 2013 I did all of the work. You were the guy who does all the work the one who makes the the videos. Didn't Didn't you have a teammate at that time? Someone who was loud? Yeah I had him. Yeah. No he had a boss at that time. He had a boss at that time. He had a boss. Yeah just like he does now. Oh wow. If you don't want to toss us any bucks go to YouTube.com/KindaFunny where we break it out topic by topic day by day until we post the entire show for your amusement. Please head over to iTunes.com/KindaFunny and subscribe to all the shows there and rate them. Right Tim? Yes. Leave nice reviews. It really helps us right now. Okay good. Yeah Adam. Yes. You're the guest. Okay. You come in to talk and just chill yourself out for all your wees and things. You got it. I'm excited about this",
      "start": 443.28
    },
    {
      "text": "It really helps us right now. Okay good. Yeah Adam. Yes. You're the guest. Okay. You come in to talk and just chill yourself out for all your wees and things. You got it. I'm excited about this one though. Not the other one but this one. I'm excited about Lumberjack Man. Your movie. Yeah. It's good. Good. I'm so glad you It's a fun It's a fun dumb bee horror movie. Yep. Yeah. I mean and and that's what they set out to do. Uh Josh and Bill they're kind of the producer director on the movie. You guys might actually know them from the Twisted Pixel. Um if you if you look at their games over time you start to see more and more live action seem to be showing up in that. And I think they were starting to get that bug. Uh anyway yeah. So they wanted to do a horror movie and it was a comedy and they asked me to be in it and I asked what happened to my character. When they gave me the answer I wanted to hear I said \"Yes I will do that.\" And it was a it was so much fun to make but",
      "start": 480.48
    },
    {
      "text": "and they asked me to be in it and I asked what happened to my character. When they gave me the answer I wanted to hear I said \"Yes I will do that.\" And it was a it was so much fun to make but yeah I have a lot of fun watching it. I mean it's weird because I'm watching it so I can't evaluate it but it's it's great to hear that it is as silly as I think it is. It's as definitely as silly as you think it is and it's got some really good moments in it. And we'll I'm sure we'll get into some of the other moments a little bit. Go ahead. Get into one of your moments. For me it was like I didn't know what we were getting into. I say you get into your moment and then I immediately cut you off to Nick Scarpino. That was a Nick move. No tell me **** you. Here's my opinion. No but I mean like the first time the killer comes by and he's dragging the giant thing of flapjacks. I was like well this is **** awesome. Yeah. I mean the the story is so completely ridiculous and outlandish",
      "start": 519.68
    },
    {
      "text": "the first time the killer comes by and he's dragging the giant thing of flapjacks. I was like well this is **** awesome. Yeah. I mean the the story is so completely ridiculous and outlandish that it it lends itself very very well to the overall overall movie. Not not the least of which is there's it's extreme gore extreme comedy and extreme nudity. Nudity. I mean it's a teen horror movie is exactly what it needs. I saw the trailer and I I got that sense of Well you you was Kinda Funny and and this is because obviously I'm not going to bring it up now but I'm working on another project that kind of is around horror movies and so I've been watching a lot of the classics lately. They're not as gory as we remember. Some some are and they have a moment. There's definitely not as much nudity as we remember that there's actually this movie is more an homage to the memories we think we have what we watched when we were young. Yeah I think that's that's how you do the type of",
      "start": 554.8
    },
    {
      "text": "much nudity as we remember that there's actually this movie is more an homage to the memories we think we have what we watched when we were young. Yeah I think that's that's how you do the type of homage thing correctly is when you really kind of feed into what we remember it being not so much what it was but even then it's like the reason we remember that is because we were younger and we saw boobs and we're like \"Oh my god that's the boob movie.\" Like I remember the boob movie. That's when I saw the boobs. But everyone knew as bad as it was. Friday the 13th Part V that had the most nudity and so that was one that you still went ahead and rented. Yeah of course. Of course of course of course. Seminal. Uh no. I mean to me to be fair I still have that same reaction when I see boobs. But boobs but that was the thing. This movie had I was like 45 minutes in I'm like \"Oh there's some more boob.\" Like I I had been so excited and then it just became the norm. And I'm like",
      "start": 588.4
    },
    {
      "text": "boobs. But boobs but that was the thing. This movie had I was like 45 minutes in I'm like \"Oh there's some more boob.\" Like I I had been so excited and then it just became the norm. And I'm like \"Yeah boobs all the time. This movie seasoned with nudity a little bit. Do they just sprinkle it around a little bit to kind of go it goes in between?\" Well actually it usually goes hand inhand with extraordinary gore which actually is done very very well. And that's something we were talking about like the overall um when I start looking at you know indie movies that you know it's always fascinating to me to see sort of how they do what they do. And one of the things that stood out with this one is that it looks really good and the effects are really good and they're they're done almost too well in certain instances which is which cuz it you know it's a horror comedy but in some instances I was like wow that was really **** graphic and but luckily it was sandwiched in between nude",
      "start": 624.64
    },
    {
      "text": "too well in certain instances which is which cuz it you know it's a horror comedy but in some instances I was like wow that was really **** graphic and but luckily it was sandwiched in between nude scenes. So that really kind of totally worked out well for me. I mean obviously what was very present in the minds of the guys making the movie and I was thinking about it too was stuff like from Troma and of course Evil Dead. you know those movies that seem to be the more extreme the gore or or or more not so much the gore the novelty of the deaths that that actually kind of propelled the comedy in a lot of instances. I think that's what works in this one. Yeah. I mean like speaking of that that's what all the the great movies do. Like Freddy not Freddy vs. Jason Jason X right? Oh yeah. And it's like horrible movie but like that will always whenever people talk about horror deaths like you mentioned that **** cuz when he freezes the face and just explodes it like puts",
      "start": 658.08
    },
    {
      "text": "Oh yeah. And it's like horrible movie but like that will always whenever people talk about horror deaths like you mentioned that **** cuz when he freezes the face and just explodes it like puts them in the the sleeping bag and beats the other one with it. Like that's what you remember for like those dumb horror movies. Yeah of course. Of course. And that's part of the fun. That's that was part of the fun in this one that I that you know they had you could tell you guys were having fun making it and that's always a good sign. It was I mean I yeah in one way the movie could have been four hours long because there was so much improv that went into this movie and they were just like let's just go let's just see what happens and I think what it really helped was like got this kind of fun spirit where we were allowed to kind of experiment. Sure. And you know with my character Doug for those of you out there you know there's I'm the head counselor of a religious camp because they were",
      "start": 699.84
    },
    {
      "text": "spirit where we were allowed to kind of experiment. Sure. And you know with my character Doug for those of you out there you know there's I'm the head counselor of a religious camp because they were completely casting to type and my name is Doug and I have the most horrific head of hair. Yeah. And um I was given one direction cuz I was like \"How broad do you want me to be?\" And that like \"Well you're Doug and Doug loves camp.\" Yeah. And that kind of just made sense to me. Like I'm just going to play a guy who has a pathological affection to camp. I know I look older than I should be being around young campers. And it's like you just loves camp. He can't let go of camp. And there is a scene where um I inadvertently come upon someone who is in a state of undress. Mhm. And when I was thinking about that speaking of lotion when I was thinking about how I was going to do that you know I I think the more obvious way is it would get a little bit lurid or I'll get interested and oh",
      "start": 735.6
    },
    {
      "text": "about that speaking of lotion when I was thinking about how I was going to do that you know I I think the more obvious way is it would get a little bit lurid or I'll get interested and oh look I'm a big hypocrite. And I thought no that's not Doug. You know Doug is like probably in love with camp because he is in incapable of growing up. He's terrified of it. So when he sees the naked lady if you look carefully I'm about to cry. Like this is not something I want to be seeing. This is just the brain cannot compute. And you know it is all all is lost. We should mention it's a it's a Christian camp. It is. Yeah. That adds that added dimension to it. That's fun under the sun spelled s um So back up. So back up for a sec. So how long exactly was Well let's before we go to that you got to shoot and do a couple scenes with Michael Madsen. Yes. Talk to me a little bit about that because he is I mean he's an icon at this point. No. I mean for so many different reasons. I mean was was",
      "start": 782.64
    },
    {
      "text": "to shoot and do a couple scenes with Michael Madsen. Yes. Talk to me a little bit about that because he is I mean he's an icon at this point. No. I mean for so many different reasons. I mean was was he Mr. Was he Mr. Mr. Blonde? Mr. Blonde. That's right. So I mean the minute he showed up I I heard him before I saw him like \"Oh I know that voice.\" And he came in you know he he doesn't do comedy much and I now think he should. He should. But what's great is it's not like he shifted sort of a Madsen character all that much to accommodate the comedy. It was just you know he's a slight tweak. He's very very very serious saying the most absurd things about demon loggers and flapjacks and the Ocelot. I don't know anything about meatloaf. So that I mean that must have been a fun experience for you right? Cuz we talked a little bit before the show. Sorry. And you said you shot for about 10 days on this. Yeah. I I had two scenes where he was there. One of them is where he tries to",
      "start": 832.32
    },
    {
      "text": "for you right? Cuz we talked a little bit before the show. Sorry. And you said you shot for about 10 days on this. Yeah. I I had two scenes where he was there. One of them is where he tries to explain all the horrible things that are going on at the camp and you know I'm standing there with the other counselors just kind of looking at him and I decided to play Doug still as Doug even though the camera wasn't on me. You kind of it's how I memorize where I'm supposed to be looking so I can replicate it and he stopped down a couple of times. He's like are you going to **** do that cuz I I can't pay attention if you look that stupid. You're like I'm giving you something to go off of. Yeah. I thought okay I just made Michael Madsen laugh. So I think I can just take that one off my list and feel pretty good about myself. Yeah we got the we got the opportunity to meet him for Up at Noon when we were doing that show. Yeah that was my second time. Yeah when he requested to come on Up",
      "start": 877.12
    },
    {
      "text": "feel pretty good about myself. Yeah we got the we got the opportunity to meet him for Up at Noon when we were doing that show. Yeah that was my second time. Yeah when he requested to come on Up at Noon was super weird. It was cool though. It was No it was awesome. Michael Madsen is awesome. No straight. Yeah. Long and short but like that first time you meet him and it's it's just that voice. He's always that voice. Oh and what what was so funny is so we taped it cuz we filmed this two years ago I think maybe even more. But I got back home and the first DLC for Dishonored came out. I can't remember the name of it but Madsen is the voice in it. And it was this kind of weird moment where like I put on the headphones down to play a game. I'm like you again my head. Um so and you got shot in Texas. We were talking about that. Yes it was. It was right outside of Austin. Um it was like a big boy scout camp. Man they take boy scouting way more seriously in Texas. You have",
      "start": 914.24
    },
    {
      "text": "you got shot in Texas. We were talking about that. Yes it was. It was right outside of Austin. Um it was like a big boy scout camp. Man they take boy scouting way more seriously in Texas. You have guns but that was the most guns right? I don't know what that what what do you call the big room with the mesh halls and the it had lots of stuff on the wall. The mess hall. Yeah. But there was more to it and it felt very scout intense and ceremonial inside of this room. My being there was somehow disgracing it. Most likely it was there and a few other uh wooded locations. Wait what's neat is the bus scenes are all green screen. Oh okay. And see that's what I thought. But they look so good. No they look really good. There is a sound stage so far out in the sticks outside of Austin. There's this beautiful beautiful sound stage. And so they just kind of pulled up a bus all the way into it and just it was wrapped in green and we did all the bus scenes on that. And yeah I I thought",
      "start": 949.56
    },
    {
      "text": "this beautiful beautiful sound stage. And so they just kind of pulled up a bus all the way into it and just it was wrapped in green and we did all the bus scenes on that. And yeah I I I thought the keying in was phenomenal. We talked about this after watching the Fear of the Walking Dead finale and I made a comment of like I can't get over how far behind TV green screen technology is to movies cause it's so obvious. And this is the thing that's caught me off guard with the movies. You're like \"Oh I'm in this indie movie. I want to come and talk.\" I'm like \"Sure.\" And I sat down to watch it expecting what I've seen in other indie horror movies whether it be friends or just people I've run into lighting. Hold on. Is that dialogue to be heard or ADR everywhere? Yeah. Like Yeah. The bus. I was like \"This looks awesome.\" And then like to Yeah. Nerd out over the nerdy cinema stuff. There's this one part with a banana that shoots up in the air and they go to an over the top look and",
      "start": 998.56
    },
    {
      "text": "I was like \"This looks awesome.\" And then like to Yeah. Nerd out over the nerdy cinema stuff. There's this one part with a banana that shoots up in the air and they go to an over the top look and I'm like \"That banana effect looks awesome. That looks like a real banana.\" For those obviously I am here to encourage people to see this movie. It's out on Friday in theaters. But um if they put that kind of attention into a banana right? Let me just say a lot of these death scenes uh have been given even more love and attention. There is some completely ridiculous I think one of my favorites is is the uh the bus scene. I'm not going to go I don't want to spoil it but I think that whole setup for that was Yeah. Well the gentleman who plays Driver is a very well-known comic that's in Austin and he he had a very funny. He had a couple lines like and he only has a few lines which is a testament to how funny this guy is that just **** made me laugh out loud. Like specifically the",
      "start": 1032.24
    },
    {
      "text": "Austin and he he had a very funny. He had a couple lines like and he only has a few lines which is a testament to how funny this guy is that just **** made me laugh out loud. Like specifically the interaction you guys have together is I'm like this guy's funny. So he plays a very very angry bus driver. Of course I'm Doug. I'm oblivious to all of this. So we did it was almost like a challenge. We we did some uh some some improv where he's driving the bus and I'm talking to him and he hates me but I don't know that. I still think that you know he's my friend. Yeah. And so you know he'd be like Doug. I'm like yeah like Doug. Yeah. I was like \"Doug I'm I'm I'm going to crash the bus. I'm going to kill the kids.\" Doug. Doug I'm I'm I'm going to shove a bear up your dick. When he finally said that that I laughed so hard that um we actually broke character. He won. He He He won the bet. Yeah I was going to say I'm not going up against that. Go bear dick. Yeah. Well his character also is",
      "start": 1072.72
    },
    {
      "text": "that that I laughed so hard that um we actually broke character. He won. He He He won the bet. Yeah I was going to say I'm not going up against that. Go bear dick. Yeah. Well his character also is allowed to go a little bit farther than yours is given that he is a camp counselor or a bus driver for kids for kids and also likes to indulge in white powder. Um how much of the film if you had to say was was actually like on the page versus what you guys ended up seeing? The majority of it was what you would tend to see is you would get the lines and then maybe a a coda you know stuff like that. Um some of the physical stuff I think you it's one of those also you kind of worked it out a couple of times in front of the camera you found that kind of rhythm and I think that worked. And so I I would say that's happened the most of the time. Those lines I know I ad-lib but I said them so many times over and over that I felt like they were in the script. Sure sure. Sure. Sure. Sure.",
      "start": 1112.56
    },
    {
      "text": "so I I would say that's happened the most of the time. Those lines I know I ad-lib but I said them so many times over and over that I felt like they were in the script. Sure sure. Sure. Sure. Sure. And then for you I mean obviously coming from more of a you're you're being more of a personality than than doing more narrative work. Like was this sort of an adjustment for you because it seems like you were just kind of fit you right? It was kind of like doing an Xplay sketch all over again. So no. Just a really long one. Yeah a really really long Xplay sketch. Um I mean I've always liked acting. Sure. Like I got into the whole hosting thing because of the acting thing. like it was it was not I know someone had asked like I think on Twitter somewhere like hey how did you get into this or did you always want to go into games journalism I didn't know it existed I wanted to do acting and so someone said hey do you want to try out for something on TV involves video games I did so I",
      "start": 1154.64
    },
    {
      "text": "or did you always want to go into games journalism I didn't know it existed I wanted to do acting and so someone said hey do you want to try out for something on TV involves video games I did so I think it was over time that that's how you started to see the sketches fall into Xplay let's go back and indulge some of that again and do some of that so this I think also being around really really cool people it wasn't like a hyper judgmental or hyper control set it was a very efficient and professional that but it wasn't like there was such a particular vision that you just had to lock yourself into that. Gotcha. And so is that something that you think you know you consider yourself doing more of that in the next couple years? Yes. If you're out there with a silly movie and you need a bald person to humiliate himself in front of the camera. I am always here. He'll put on a wig. He doesn't have it. I picked that wig. I was the one who chose that wig. That wig was I just want to feel it",
      "start": 1190.4
    },
    {
      "text": "person to humiliate himself in front of the camera. I am always here. He'll put on a wig. He doesn't have it. I picked that wig. I was the one who chose that wig. That wig was I just want to feel it again one more time. I got just the right amount because know I knew that Doug would not have the beard that I typically have. That just that didn't seem right. But then I take all of that off. I don't look like I'm doing too well you know. I'm just So default create a character for everything. Here's the blank slate. Do what you want. So I was like \"Okay I'm going to Yeah. Let's go look at the wigs.\" And we're going through it and they It was the most awesome just Texas ladies that were doing hair and makeup. And they brought out the box of wigs and they pulled out the one I ended up wearing. And I could tell they were just going to put it aside. Like no self-respecting human being would actually wear that. Like I want to see that. I want that one and I want that. They're like \"Are",
      "start": 1225.84
    },
    {
      "text": "And I could tell they were just going to put it aside. Like no self-respecting human being would actually wear that. Like I want to see that. I want that one and I want that. They're like \"Are you sure?\" I'm like \"Yeah I want that.\" It's It's hard to put into words what that wig looks like on you specifically. I would imagine that it it looks a little bit like Tasha Yar's haircut from Star Trek: The Next Generation. Remember Tasha Yar? She was like the security. Why am I tell Why am I looking at you? I should be looking at I'm looking at you. I go across the table. I've got Anyway it's it's a very blonde you know very He looks like an overgrown first. Exactly. That's what he looks like. Yeah. I went to school with this guy. I went to school. He was the guy that pulled his pants down when he went to the bathroom with the urinal and just like you should stop that. I for a moment wondered if that was the same wig that was worn by Christopher Guest in Waiting for Guffman.",
      "start": 1266.0
    },
    {
      "text": "his pants down when he went to the bathroom with the urinal and just like you should stop that. I for a moment wondered if that was the same wig that was worn by Christopher Guest in Waiting for Guffman. That's That's a perfect Yeah. Once again it's someone who is not in touch with their age whatsoever. Yes. Someone who really like really likes collecting toys. like really hardcore into collecting uh uh like Disney Infinity toys or or like a Lego. You can't me. I'm too slippery for you Scarpino. Track me down. You're a freaking You're a snake. So I mean is this one of the things that like the freedom you have now right? That you're you're just can go do whatever the hell you want. Well I mean yeah. I mean I actually was still at Rev3 when I did that but I just I couldn't pass it up. Um I Yeah I definitely want to do stuff like this again. Um I I do feel like there's there's more freedom for that. I think also with what's happening with streaming services and things like that",
      "start": 1306.08
    },
    {
      "text": "Um I Yeah I definitely want to do stuff like this again. Um I I do feel like there's there's more freedom for that. I think also with what's happening with streaming services and things like that that it's there there there's more opportunity for movies of these kind of minimal budgets but with a lot of creativity and energy that you know th this was made before it ever had a distributor. It was it was it was self financed and then they went and shopped the finished movie around which pro-tip that really helps a lot of what do you mean I'm not bankrolling a a movie. I just have it. I have to distribute it. Um very risky but yeah very very risky but um it I I I think there's a lot more out there. I mean I miss horror comedies and we've been in a pretty bleak like I live in a house or something horrible here I'm going to die. And that I'm hoping with this and another movie I just saw called The Final Girls that that maybe we're going to start to see a small resurgence of you",
      "start": 1351.04
    },
    {
      "text": "or something horrible here I'm going to die. And that I'm hoping with this and another movie I just saw called The Final Girls that that maybe we're going to start to see a small resurgence of you know something that's a little bit more about the fun Yeah. of just you know of a horror movie because it's silly and we should all just you know have fun with it. Have you seen The Visit? No I have not. And I You should definitely check it out because it's like I think it's a return to form for Shyamalan with like the twist and all that stuff and it's definitely not nearly as bad as the last couple things he's done. But nothing can be that bad. Exactly. But I think The Trees are bad. Not a perfect movie but it's it's really I'd say it's really good The Happening. I got you. Oh when someone immediately in The Village. Yeah. No. Oh my god. I liked I liked The Village. I liked The Village but but shittily enough someone ruined the ending for me. They were like you know this that ends",
      "start": 1392.32
    },
    {
      "text": "immediately in The Village. Yeah. No. Oh my god. I liked I liked The Village. I liked The Village but but shittily enough someone ruined the ending for me. They were like you know this that ends like this and I was like you still liked the trailer what what what The Village was about. I'm like oh yeah it's got to be that. See I I didn't know. I was like this is just going to be one of those weird supernatural like period pieces. And so as I was I think it was like the week before I was going to watch it. I didn't have any plans to watch it. It just kind of one of those things that popped up on HBO. I was just randomly casually having a conversation with my friend. He's like oh yeah it's like this. I'm like you could not have spoiled that more succinctly for him. Like it was so fast that my brain didn't even have time to figure it **** out. I I love The Village and I mean I I have a great affinity for Signs and The Village. I think it was a great movie. I forgot about the",
      "start": 1434.6
    },
    {
      "text": "that my brain didn't even have time to figure it **** out. I I love The Village and I mean I I have a great affinity for Signs and The Village. I think it was a great movie. I forgot about The Happening. I saw that in the theater. I totally forgot about the movie. I remember walking out Summer '08. I think I remember walking out and being like \"What the **** was that?\" It's honestly it's one of my least favorite movies of all time. What was that? And Mark Wahlberg's in it isn't he? Yeah that's right. Like all great films. Don't you want to think that like they didn't know what the ending was when they started filming and they're like \"I don't know. We got to do it now. What is it?\" Freeze. The planet was turning on the people right? That was Yeah that was the plan. But it's it was it's it's a really nice idea actually. But it's it's super hokey and it didn't go anywhere. Anyway The Visit is awesome and it's like actually like it's it's really reminiscent of the older",
      "start": 1470.08
    },
    {
      "text": "it was it's it's a really nice idea actually. But it's it's super hokey and it didn't go anywhere. Anyway The Visit is awesome and it's like actually like it's it's really reminiscent of the older ones. But what I loved the most about it was the comedy aspects. Like it's so funny that like some people would say it's a comedy. Definitely don't think it's a comedy. But like you mean in the way that it knows that you as the viewer know that there's a Hansel and Gretel quality to this. It's really interesting because it's funny in the sense that it's old people doing weird **** So that that's what old people do. It's already funny you know just like seeing when you see an old lady. A lot of people deal with fear like when they're watching scary movies they'll like make a joke out of it and kind of laugh with their friends to kind of like you know not be scared about it but just be like \"Oh this is so stupid.\" Like \"Oh look how she moves. It's so funny looking.\" Like but",
      "start": 1506.32
    },
    {
      "text": "it and kind of laugh with their friends to kind of like you know not be scared about it but just be like \"Oh this is so stupid.\" Like \"Oh look how she moves. It's so funny looking.\" Like but then they kind of understand that and they use that to their advantage where it's like the way everyone moves is funny but then something scary will happen because everyone's kind of making a joke out of it. It's really interesting. You should definitely check it out cuz I was pleasantly surprised. No no I' I've I've really wanted to see it. But yeah see that's my thing is I don't naturally gravitate toward those and so like I've never been a huge horror fan period. I mean there's there's obviously classics in the genre but there's been a couple that have come out in the last year. The Visit being one of them and another one was It called It Follows that supposed to be great. It Follows is incredible. And I I I just everyone's like \"Hey we're going to see it.\" I'm like \"I just",
      "start": 1546.88
    },
    {
      "text": "Visit being one of them and another one was It called It Follows that supposed to be great. It Follows is incredible. And I I I just everyone's like \"Hey we're going to see it.\" I'm like \"I just No I'm more sci-fi.\" The one thing I say about It Follows and also The Babadook which I really really like. I didn't do that either. But those function as good movies. And I'm not saying that horror movies are somehow fundamentally bad. But I know people who weren't scared by one or both of them but really really enjoyed watching them anyway because there was something very very interesting going on. I love horror movies like always have. Always. Well zombie movies and stuff. But the problem is I'll do what I want. He's Stop touching. I'm making sure he's never come natural. He's a He's a natural treasure for And I'm covered in shea butter. He is pops at you like a like a like a stick of butter. Catch up. Catch him. Catch him. Catch me the ground. No but I feel like we've struggled so",
      "start": 1577.6
    },
    {
      "text": "treasure for And I'm covered in shea butter. He is pops at you like a like a like a stick of butter. Catch up. Catch him. Catch him. Catch me the ground. No but I feel like we've struggled so much as as horror fans lately just cuz either they're not funny or they're so overproduced with CG that they're so unbelievable or they're overproduced. And you know it's funny. It's interesting how you know with that beautiful cinematography how Lumberjack Man works. I think because something as silly and kind of crude as what it is it's Kinda Funny to see how well it's shot. Yeah. But what I've seen especially like with with remakes of some of the more classic movies you know they did that remake of Last House on the Left and this is not a recommendation to anyone to go see the original Last House on the Left. If you watch it just learn about it first because that thing will give you nightmares. But I was curious to see how you remake something as notorious as that. and it doesn't",
      "start": 1615.68
    },
    {
      "text": "Last House on the Left. If you watch it just learn about it first because that thing will give you nightmares. But I was curious to see how you remake something as notorious as that. and it doesn't work. And I think it almost becomes even more unpleasant and lurid because it's shot well. It's lit well. And what you're watching is something that's fundamentally it's too good for what it is. Like those those older '70s movies the crudeness gave it this weirdness and strangeness that when it's glossy you feel that there's responsible adults spending time and money to portray something like this. And I it actually feels kind of unseemly and it's not scary. So both things are happening. Was that Ryan Reynolds one? Was Ryan Reynolds in the remake of that? I can't remember who was in the remake of that. He was he was Amityville Horror remake. Oh that might be the one I'm thinking of. Then they also did like a remake of Sam Peckinpah's Straw Dogs which is why the Halloween reboot or whatever that",
      "start": 1657.92
    },
    {
      "text": "that. He was he was Amityville Horror remake. Oh that might be the one I'm thinking of. Then they also did like a remake of Sam Peckinpah's Straw Dogs which is why the Halloween reboot or whatever that Rob Zombie did. Like those it don't that's a perfect example of the polish being just totally off where those movies are just overproduced. And specifically the second one it like the first 15 minutes of it I'm like \"Oh **** this is **** awesome.\" Cuz it's essentially just a Halloween II recreation of Halloween. Yeah. And it's like no this is so great so tense so perfect. And then the rest of the movie it's like just a overproduced Rob Zombie. I couldn't see the rest of the movie. Like it was so dark. I'm like is this on? I like I I had one of those panic attacks. I thought I was going blind. Like I was just macular degeneration was happening right there. And I was wasting it on a Rob Zombie movie. Oh no. These are my parting way of God. I wishing I always knew it would",
      "start": 1696.96
    },
    {
      "text": "was going blind. Like I was just macular degeneration was happening right there. And I was wasting it on a Rob Zombie movie. Oh no. These are my parting way of God. I wishing I always knew it would end like this. to the point of production and sterility and and in and sets and like beautiful lighting and stuff. I think I I do think one horror movie that benefited from that was The Shining but like because that movie that movie was creepy because it looked the way it looked which was perfect right? Yeah. And bright and colorful and all that weird **** which I like. So I just wanted to throw that out there that I generally agree but there are examples to the contrary as well. Like no. I I I I don't think good production hurts the movie but for all of these reboots of classic 80s and 70s movies you add the the the good production on them and it's just like I think you just took Well Poltergeist did the new Poltergeist. I was forced to see it for my friend's birthday who",
      "start": 1736.96
    },
    {
      "text": "80s and 70s movies you add the the the good production on them and it's just like I think you just took Well Poltergeist did the new Poltergeist. I was forced to see it for my friend's birthday who loves horror, any horror movie whatever. No no this guy James. **** you James. Call so we watched this movie and my god that is it's definitely now The Happening was I think the worst movie I ever saw. It's now Poltergeist the remake. It was It took away any of the soul any of the anything that that other movie had. And you watch it you're just like \"This is just garbage.\" Yeah. I mean that's that's the issue right? It's these people that remake them remake them for the namesake only generally right? They have these like they have these brands that people they know people are aware of. There's a brand called Poltergeist that was that was big and there's a nostalgia factor for all of us that are over the age of certain points. The original starring Coach what up now? Yeah. Yeah I",
      "start": 1773.04
    },
    {
      "text": "There's a brand called Poltergeist that was that was big and there's a nostalgia factor for all of us that are over the age of certain points. The original starring Coach what up now? Yeah. Yeah I mean I I it just it goes back to the point of like where are the new ideas? I would have you know I've said before many times my favorite horror property is Children of the Corn and like I but I I like thinking about it the way it is and not the way it could be now. It's the same thing with Amityville Horror was like like not necessary to re re you know. No especially hurt my pride as a Long Islander as well. We don't need to go back and and study Amityville again. And and actually the one that sticks out to me the most that I remember seeing in college that I was really excited about and ended up being super disappointed was The Texas Chainsaw Massacre which is another movie that's remake. Yeah the remake. The original is awesome. And and I I think that that again that again is",
      "start": 1814.48
    },
    {
      "text": "and ended up being super disappointed was The Texas Chainsaw Massacre which is another movie that's remake. Yeah the remake. The original is awesome. And and I I think that that again that again is like a gritty and **** dark and weird and you know movie of its time. The original Texas Chainsaw Massacre was perfect in what it was. It wasn't trying to be anything other than a **** terrifying quick roller coaster ride. I mean I think some of those movies at the time were reacting to certain things that were happening in society. I mean a lot of the theory because if you really compare the 70s movies to the 80s ones the 70s are much burlier. Like the original The Hills Have Eyes is really upsetting. I'm not saying like fun upsetting. I mean like really really upsetting. And and the going theory goes that you know a lot of it was in reaction to what people had seen in Vietnam you know and and what was happening on the news. But it was just kind of saying we're this inured. How how",
      "start": 1849.76
    },
    {
      "text": "theory goes that you know a lot of it was in reaction to what people had seen in Vietnam you know and and what was happening on the news. But it was just kind of saying we're this inured. How how far do we have to go to push it? I think you get to the 80s. I think you see something different. I've always wondered if you could look at Michael Myers and um and Jason is almost kind of a Reagan era reaction to the excesses of the late 60s and the entire 70s. Not that the filmmakers are endorsing that but it's kind of this embodiment of hey you've gone too far and I'm now we're going to punish you for it. It's you know all of you you can see a lot of that cultural subtext there. These new ones and this is that there's nothing more than oh maybe the kids will like this. Yeah. The beauty of horror is I think a lot of the filmmakers had other ideas and the producers couldn't care less if they were sneaking interesting ideas into their movies. They just want to get it into the grindhouse",
      "start": 1889.04
    },
    {
      "text": "horror is I think a lot of the filmmakers had other ideas and the producers couldn't care less if they were sneaking interesting ideas into their movies. They just want to get it into the grindhouse and just make some bucks. Yeah. I think I mean not that I'm I'm super up on horror anymore. I mean I love horror movies from the 70s and 80s and and some of my favorite movies are you know are horror movies are horror movies like Rosemary's Baby and all that kind of stuff. But but I think you're leaving out some of the classics starring Sarah Michelle Gellar. Remember I note what you did. Oh yeah. How could I forget? But I but I I was gonna say that I feel like the last original like really original horror IP that I thought was really really good personally was Saw say Saw is one of my favorite franchises of all time. Like it has it's low points but I think overall it's very entertaining. Everything after Saw 1. No man. Saw 1, 2, and 3 are a great trilogy that actually tell a",
      "start": 1930.24
    },
    {
      "text": "franchises of all time. Like it has it's low points but I think overall it's very entertaining. Everything after Saw One. No man. Saw One, Two, and Three are a great trilogy that actually tell a great story. Interesting. Four, Five, Six, Seven is where like they were just stretching it out. But I mean still like there was interesting things and that it was a unique idea. Yeah. The first one I thought was really actually really disturbing. That that that one from two years ago The Conjuring that was probably And once again I think that was related to some of the Saw guys. I mean that was one of the director of Saw and Furious 7. That was one of those like okay you actually got under my skin and I'm scared. And yes it anticedants were were precedence really was was Amnil Horror but it was so much nicer to see something that wasn't let's try to do Amnil Horror all over again. I always liked and now it's a joke obviously but Paranormal Activity that original Paranormal Activity",
      "start": 1967.84
    },
    {
      "text": "it was so much nicer to see something that wasn't let's try to do Amnil Horror all over again. I always liked and now it's a joke obviously but Paranormal Activity that original Paranormal Activity was super good. that was great and scary and different and like unexpected that it was that good. another one that had like you know sho string budget you hadn't heard about and of course now there's Paranormal Activity: Ghost Dimension in 3D and you look at a jeez like that kind of gets away from that Fox made so much money on Paranormal like they bought it for a song it was made for about 5 bucks they bought it for I think like you know a hundred and then it went on to make like $7 million I mean in terms of profitable actually horror movies tend to be the most profitable profitable movies ever I think Halloween was is is still up there that it was made for just nothing and it just makes sense. Yeah. Well you also I mean there's a there's that hard set rule for a lot of starting",
      "start": 2004.08
    },
    {
      "text": "ever I think Halloween was is is still up there that it was made for just nothing and it just makes sense. Yeah. Well you also I mean there's a there's that hard set rule for a lot of starting filmmakers are like do a horror film first because it it's more likely to get picked up especially in the foreign markets because there's not a lot of there's not it doesn't rely heavily on storytelling dialogue or really language at all. It's a very visual medium. So a lot of people you know a lot of my friends that graduated were like I'm going to make a horror movie because I can you know you can sell it in in the foreign market and make a little money and kind of fund the next one. Um and they're also required every year. Like the thing is people want new ones around October every year. It's like Yeah. And people I mean fans of the genre just love them too. I mean that's something if you if you if that's your particular cup of tea like there's no shortage of them. But because going back",
      "start": 2047.12
    },
    {
      "text": "like Yeah. And people I mean fans of the genre just love them too. I mean that's something if you if you if that's your particular cup of tea like there's no shortage of them. But because going back to your original point yeah I mean as far as indie filmmaking is concerned there's it's it's an interesting time for it because that you have sites like uh you know organizations like Netflix and Amazon and Hulu and all these things are looking for this content. And so I have to imagine it's it's got to be an interesting time to start making something for a very low budget because you have a little bit more leverage than than people trying to make that 30 or 40 or $50 million Hollywood uh movie. And the the the only flip side I think this is more particular to horror movies um is it's so hard to tell if it's going to be good or not because you know the way a horror movie poster or the cover of it looks it's like I don't know guy's got a knife that shadow man's got a knife. It's you know",
      "start": 2080.08
    },
    {
      "text": "to tell if it's going to be good or not because you know the way a horror movie poster or the cover of it looks it's like I don't know guy's got a knife that shadow man's got a knife. It's you know they have to do it a particular way. I think that's one of the cool things about why they went with 8 Films to Die For is these kind of groups festivals whatever you want to call it that does some degree of curation. Like someone has at least watched this ahead of you and said \"Yes we are going to anoint this and put it in with our other collections for for this year.\" So I was I was really happy when that happened to be what their distributor was for VOD and for the theatrical which is limited theatrical. I think it's you know Chicago Boston a few other cities. It says San Francisco. Then you look at it it's a theater in Modesto. Man that is a stretch. The extended Bay Area. The extended Bay Area. Yeah for sure. But you need to wait. Lumberjack Man is out right now.",
      "start": 2117.44
    },
    {
      "text": "Francisco. Then you look at it it's a theater in Modesto. Man that is a stretch. The extended Bay Area. The extended Bay Area. Yeah for sure. But you need to wait. Lumberjack Man is out right now. Kevin's put up the link. Maybe just to the website. I'm sure there's an Amazon VOD link in the description. Kev I'm telling them how this happens. It's kind of like back to or I'm sorry. It's kind of like Bill & Ted's Excellent Adventure in here where you say stuff and you look at him and you know he'll go back there and he'll he'll go back and put the keys right here. Just keep finding keys everywhere. Kevin I don't mean literally. I'll put the keys behind the Portello picture. Yeah. I mean it should be I I know it's definitely Amazon but I I imagine just turn on your PS4 or your Xbox and you should be able to find it. I mean it's Xbox find. We're not trying to hide the movie from anyone and yeah watch it. Let me know because I'm I'm it's it's it's it's a lot of fun. I agree.",
      "start": 2158.88
    },
    {
      "text": "and you should be able to find it. I mean it's Xbox find. We're not trying to hide the movie from anyone and yeah watch it. Let me know because I'm I'm it's it's it's it's a lot of fun. I agree. Nick agrees. I do. All right. Good. Tim yes. What's your topic? So I'm going to go a little bit more serious than I normally do because usually I have really really stupid topics. But today uh I want to talk about something that it's a little darker. Yesterday was the third anniversary of my dad's death. And I didn't realize that until my mom called me. We're just c catching up talking about stuff. And then like she brought it up. She was talking about how like my little cousin got married and all this other stuff like all this good stuff. And then she like like ended it with like \"Oh yeah it was it was you know it's been 3 years.\" And I was like \"Holy shit.\" And I like you know talked to her for a bit and hung up the phone and I was just like \"Man like I can't believe that",
      "start": 2197.68
    },
    {
      "text": "it was it was you know it's been 3 years.\" And I was like \"Holy shit.\" And I like you know talked to her for a bit and hung up the phone and I was just like \"Man like I can't believe that it's been 3 years.\" And it really kind of made me start thinking about challenges that we've had in our lives and like how we over overcome them or whatever. And it then made me I I went down this really deep rabbit hole of just like \"All right what have the biggest hurdles I've had to kind of jump over in my life?\" And I look back and a lot of them are death based and losing stuff. Then there's you know the the breakups and the the the heartbreaks like that. But it's like it's just interesting to me that like I don't think I've ever had to overcome a challenge that I was in control of that like I felt like I couldn't do anything about you know and I was just wondering if you guys had anything that you feel like there was this challenge put in front of you that you could overcome the",
      "start": 2240.96
    },
    {
      "text": "like I felt like I couldn't do anything about you know and I was just wondering if you guys had anything that you feel like there was this challenge put in front of you that you could overcome the actual issue cuz you know my dad dying or like a long time ago um when Kevin's dad died like those are two things that are seminal moments in my life where I was like holy Holy **** The challenge here isn't uh fixing that problem but it's more dealing with the realities that life now is like for with those two things. Like it's the challenge is talking to my mom on the phone and having her bring it up and hearing her tear up and stuff. Or the challenge was like the first time I saw Kevin after that happened and I remember having to be there for him and being like \"Dude like we got each other.\" Like and that is the ongoing challenge of it you know? Um and then breakups obviously are things that don't get fixed necessarily but it's more stuff that you just kind of need to talk to",
      "start": 2284.24
    },
    {
      "text": "other.\" Like and that is the ongoing challenge of it you know? Um and then breakups obviously are things that don't get fixed necessarily but it's more stuff that you just kind of need to talk to people and deal with. So I don't know. That's kind of like the launch pad of the whole the biggest challenge. Yeah. Okay. Do you do you cite your father's death as yours? No no no no. I I definitely think Kevin's father's death was is a a bit more of the hurdle that in terms of my growth and my sure everything. And I think that's just because of how close we are and like I don't know just sort of feeling like you like someone else is hurting in your life and you can't really do anything about it. It's that feeling of like helplessness and that's a it's it's hard because that's life right? The challenges that you can easily overcome. The challenges that you're you're sort of faced with you're like \"Ah I just thought for 5 seconds and I have the answer to this.\" Those aren't the hard",
      "start": 2327.52
    },
    {
      "text": "The challenges that you can easily overcome. The challenges that you're you're sort of faced with you're like \"Ah I just thought for 5 seconds and I have the answer to this.\" Those aren't the hard ones. The hard ones are the ones that kind of take a piece of you and never give it back. And those are the ones that you just kind of have to get through not over you know. Um I don't know that you know I don't know that I've dealt with that to be fairly honest. Um I deal with smaller challenges. Um namely I think the biggest one I have right now is that I'm losing my connection with my family which is hard for me. Like I have my wife who I live with but my you know my brother is one of my best friends and I have a great relationship with my parents and I just I think my mom text me the other day and she's like we're fine. And I'm like oh **** I haven't talked to you guys in like a month and a half. like we're just not in each other's collective conscious anymore. We're not we're not",
      "start": 2368.72
    },
    {
      "text": "day and she's like we're fine. And I'm like oh **** I haven't talked to you guys in like a month and a half. like we're just not in each other's collective conscious anymore. We're not we're not a unit anymore. And that's that's difficult because as I look at my life I'm like nothing's going to change. This this rift that's between us and it's not a bad riff. I'm not saying it's like my mom's like you know **** him. He's the worst kid on the planet. We still have a great relationship. But this little wedge that's between us is never going to go away unless I do something to to deal with that. And so I'm trying to go down there more and trying to talk to them a little more. It's hard feeling like you're a part of people's lives when you're not physically in front of them at least every other week or you know and you know FaceTime just doesn't count right that that because you generally tend to sort of show the best part of you when you're talking to people and you're just",
      "start": 2407.2
    },
    {
      "text": "every other week or you know and you know FaceTime just doesn't count right that that because you generally tend to sort of show the best part of you when you're talking to people and you're just catching up. You have an hour and it's like I'm not there when my parents need me right? I'm not there when my mom has a bad day and I used to be like the person she would confide in. Um I'm just not there for that and I hear it in her voice where I'm like there's something missing now. We don't have that level of intimacy that we should have with each other. And so you know that's and it's something that I just like circumstance prevailing. Like my business is here my wife is here my wife is here her business is here you guys are all here. Like I'd love it if I could snap my fingers and we could all just exist together somewhere else. You know all of our families and all our close friends could just be someplace that God willing was way cheaper for real estate. Um which would be",
      "start": 2441.92
    },
    {
      "text": "we could all just exist together somewhere else. You know all of our families and all our close friends could just be someplace that God willing was way cheaper for real estate. Um which would be lovely. Not this hot. Not this hot. Well I could deal with the heat. You guys all hate the heat but I just throw on the short shorts right? I'm pretty sure I flashed my testicles to the camera three or four times already. Kevin can you confirm that? Kevin said \"Yes.\" Are you pretending that the short shorts are actually that much cooler than slightly longer shorts? Yes I am. That's That's what I'm arguing. I want you I I want this tested. I'm telling you I'll buy you a pair of these these shorts that I'm now wearing called Chubbies aptly named. Uh they're a little too short. They make you uncomfortable the first time you walk out of the store cuz people think you're wearing boxer shorts. But No no no. But it's the design of them. Nick look. Get up get up and show them. Get up",
      "start": 2476.96
    },
    {
      "text": "you uncomfortable the first time you walk out of the store cuz people think you're wearing boxer shorts. But No no no. But it's the design of them. Nick look. Get up get up and show them. Get up and show the camera. It's the the size and the design that makes them look like boxers. They look They do look like boxers. They also look like a like like a like a a blanket you put out at a picnic. Like this. Yeah they're short. It's kind of like you It's like you're pretending you're going to the Hamptons but you don't fully understand the concept. It's almost That's it. It's It's like a pornographic rendition of the Hamptons. That's what I'm trying to get. I I I want You'll appreciate this Adam because you're you're a man of the 80s just like me. I feel or at least I try to pretend like I feel like one Magnum P.I. when I wear these shorts because if you remember correctly Tom Selleck shorts looked like his ass was trying to eat them the entire time. They were being sucked up into",
      "start": 2515.68
    },
    {
      "text": "like I feel like one Magnum P.I. when I wear these shorts because if you remember correctly Tom Selleck shorts looked like his ass was trying to eat them the entire time. They were being sucked up into that little fight thing. Go look at basketball. I look at some of the photos of when I was a kid and like you let me out of the house like that. That's pornographic. Strange people could stare at me just like beautiful silky thighs. I'm oblivious but I'm like the kid's vulnerable there. That is wow. I mean wow. Yeah we didn't have camera phones but I mean still that's that's Wow. Yeah that's weighing up on the internet. Uh yeah I mean I don't really know how we got on the topic of my short shorts but I do talking about distance between you and your mom. Mom would appreciate it. But I will argue that the shorter the shorts the more wind flow you get into that pipeline. If that makes sense. That makes sense. That makes sense. And you can cool off a little place. Well you know",
      "start": 2560.32
    },
    {
      "text": "I will argue that the shorter the shorts the more wind flow you get into that pipeline. If that makes sense. That makes sense. That makes sense. And you can cool off a little place. Well you know they they say cool balls cool heads. That's that's the old saying. Who who says that? Maybe it's cooler heads. Uh cool heads prevail. Cool balls cool heads. Close enough. I don't know. My my balls are cool so I think I can make a decision. Yeah. I don't know Greg. I mean you've had you've dealt with strife. You've you've dealt with a lot of **** in your life. This one time my Wolverine: X-Men Origins save at just gone. I was so close to Platinum that drove me crazy. I remember you're making you're making a joke about it. You're making a laugh about it. But you've dealt with some **** Yeah. I mean cancer for sure is the hardest you know thing I've overcome the challenge I've overcome or whatever. I mean like I was just talking to somebody yesterday on uh Twitter I guess in",
      "start": 2602.24
    },
    {
      "text": "Yeah. I mean cancer for sure is the hardest you know thing I've overcome the challenge I've overcome or whatever. I mean like I was just talking to somebody yesterday on uh Twitter I guess in one of the recent shows because I black out when I podcast. I said something to the effect of like \"Yeah and I'm still screwed up from chemo or whatever.\" And this guy hit me up and he's like \"Hey I had gone through chemo a few years ago too.\" And is what you're saying in this episode of The GameOverGreggy Show that you're way too emotional and fly off the handle really easy. And I'm like \"Yes that's exactly what I'm saying. You'd never feel like yourself again. You are a **** tiny little fuse that'll **** You get a lot of it. Kevin gets a lot of it. Steimer gets a lot of it.\" You know what I mean? Like that. You guys all You and Steimer share it. because you're the closest people to me in my life. And then you to the credit when you say I'm overstepping I usually snap back at",
      "start": 2644.24
    },
    {
      "text": "what I mean? Like that. You guys all You and Steimer share it. because you're the closest people to me in my life. And then you to the credit when you say I'm overstepping I usually snap back at you but then I I settle down and I know you're correct and I dial it back. Well I'm never wrong. Well except for Little Devi it's going to be a hit PlayStation. That whole Mitt Romney that whole Mitt Romney ordeal was a was an embarrassing. So I mean that's still Yeah that's still like No that's not the same thing. What about your divorce? That was that was fun. No I mean like that's totally like a pain in the butt at the time right? Of whatever but like it's just like anybody else. It's like well not everybody else I guess but like I feel like when a relationship's ending you know it right? It's rarely that it is light switched. And there are light switch moments for sure with people don't get me wrong but for us it wasn't. You know what I mean? We knew we were growing",
      "start": 2682.8
    },
    {
      "text": "know it right? It's rarely that it is light switched. And there are light switch moments for sure with people don't get me wrong but for us it wasn't. You know what I mean? We knew we were growing apart. So by the time you actually did that it was more of a relief of like all right we were both on the same page. Cool. Let's move on. And then there's there's the stress of trying to find you know where to live or do this or whatever. Portilla there was no stress there. That was an easy That was a slam dunk. Greg Miller taking that dog. Um you just you just snuck in while she wasn't there. I took the dog. No she said we had a I mean we were both it was like we had such a boring breakup. We had such a boring breakup. I was just like \"Yeah this is it and your job's taking you there and your job's there.\" Okay cool. Well you you know her job had her traveling all the time. So she's like \"All right you keep everything.\" And I was like \"Well do you want to talk about",
      "start": 2721.36
    },
    {
      "text": "there and your job's there.\" Okay cool. Well you you know her job had her traveling all the time. So she's like \"All right you keep everything.\" And I was like \"Well do you want to talk about the dog?\" And she's like \"No of course not. Like I'm traveling all the time. There's no way I could possibly do it. He he deserves to be.\" Who would really want Portilla? Exactly. That's the other. She's like \"Well I've learned a lot of mistakes we made with this one. You can you can limp on another 1 years with them. I'll take care of it. I will say to to to your point well to when you had cancer and time I'll never forget I'll never forget you told me you had cancer that uh that that's like ingrained in my mind was that was like one of the the moments in my life as an adult probably the first time in my life as an adult where I'm like I have to now I have to step up you know like that was like that was like where like I remember my being in my head I'm like I have to take all the",
      "start": 2753.12
    },
    {
      "text": "first time in my life as an adult where I'm like I have to now I have to step up you know like that was like that was like where like I remember my being in my head I'm like I have to take all the responsibility for our work and I have to do that's the right thing to do and I have to take responsibility as a friend and be there and all that kind of that's actually kind of an interesting learning moment in my life where I was like this is these are the times where friends need to be friends you know like unabashedly be your friend. And I hope that I was good in that respect. I think a lot of I think a lot of us were were good in that respect. Everyone like that's the thing is everyone did it because everyone everyone had a much different reaction to cancer than I did because when I got diagnosed with cancer and it's a I've said it before on other podcasts and things like that so stick with me everybody. When I got diagnosed with cancer like my parent or grandparents had died of lung",
      "start": 2785.28
    },
    {
      "text": "with cancer and it's a I've said it before on other podcasts and things like that so stick with me everybody. When I got diagnosed with cancer like my parent or grandparents had died of lung cancer emphysema and stuff but that's not like cancer like this was for me. You know what I mean? And my my experience with that was when I had been working at the newspaper and I followed a little boy named Tim Grant around and you know he was six and he became seven while I was there and I had read about him when I was in college because he had this neuroblastoma cancer that was incredibly hard to treat. He beat it. The Tribune had followed him and done this giant piece on him going through it and coming out on the other end. Yay. I go to the paper started the paper. I'm working at the paper for a while or whatever and eventually Tim gets sick again and they're like we should do that piece again. Greg you'll cover it this time because the old reporter had left. I was like \"All right great.\" So",
      "start": 2818.16
    },
    {
      "text": "or whatever and eventually Tim gets sick again and they're like we should do that piece again. Greg you'll cover it this time because the old reporter had left. I was like \"All right great.\" So like I start talking to this and everybody knows you know if you listen to the show obviously I don't want kids. I don't I don't hate kids but I don't like being around kids necessarily. You know what I mean? But Tim Grant literally was if there was a parallel world where I had a kid he would be the kid I would want where Spider-Man is Superman of the Walls and loves playing video games and has his DS and always in a Superman or Spider-Man shirt. I was like \"This kid's **** awesome. He plays Lego games with his dad and stuff.\" I was like \"This kid's great.\" You know what I mean? So I'm following him through his treatment. And it was like all right well you're going to come to the chemo session you know we do we were living in Columbia obviously it was St. Louis Children's Hospital",
      "start": 2853.76
    },
    {
      "text": "So I'm following him through his treatment. And it was like all right well you're going to come to the chemo session you know we do we were living in Columbia obviously it was St. Louis Children's Hospital. So like all right great because it was this like radical experimental procedure to beat neuroblastoma and I remember being in the car driving there and granted I always try to give time you know about this. This is 2005, 2006 and this is a dumb reference but stick with me. 50/50 hasn't come out you know what I mean like I don't I can't in my head as a 24-year-old right 23-year-old whatever it would have been. Uh I didn't understand what chemo was. I still thought of chemo. he's going to be put in a tube and blasted with like radiation you know what I mean? Like like a a CAT scan really or like a PET scan or whatever. And so you get there and I we walk in and he sits down and he pops out his DS and they pull up his shirt and he has a port in his chest and they pop the port in and he just",
      "start": 2885.52
    },
    {
      "text": "a PET scan or whatever. And so you get there and I we walk in and he sits down and he pops out his DS and they pull up his shirt and he has a port in his chest and they pop the port in and he just starts getting chemo and like for five hours I sat there you know talking to him talking to his mom talking to nurses doing all this research talking to everybody getting quotes or whatever. And he just sat there played video games played with his trucks played with his cars. And only at one point like in three hours in was he like \"I don't feel good mom.\" She's like \"Oh did you tell me?\" He's like \"Yeah I'm going to lay down.\" Okay. Laid down and took a nap. And I was like I'm like \"Not at the time obviously.\" But I'm like \"Oh okay. That's cool. That's what chemo is. It's great. No big deal.\" And so you jumped to me getting sick and I was super flippant about it. You know what I mean? Like Christine always gives me **** cuz like when the diagnosis I remember giving",
      "start": 2926.96
    },
    {
      "text": "great. No big deal.\" And so you jumped to me getting sick and I was super flippant about it. You know what I mean? Like Christine always gives me **** cuz like when the diagnosis I remember giving you updates cuz we were at the desk like waiting for a call or whatever. And when I finally got the call and finally had confirmed cancer I hung up and IM'd Christine. I'm like \"Yeah okay. So I do have cancer. That's what's gonna happen.\" She's like \"Oh my god.\" Okay. Like we've been preparing for this. So you're going home. I'm like \"No I'm don't work. What are you talking?\" She's like \"You're the only person I know who gets told they have cancer and keeps working.\" You know what I mean? And so then like when I started telling people I like it was it's this weird thing of I remember trying to relish the moment because I really feel like in your life in anyone's life there's very few times you get to deliver **** crazy news. Cra like even if you're like even if you're engaged or",
      "start": 2960.08
    },
    {
      "text": "to relish the moment because I really feel like in your life in anyone's life there's very few times you get to deliver **** crazy news. Cra like even if you're like even if you're engaged or uh pregnant or there's usually so much leading up to it that like you know what I mean? Like if if Kevin and Paula were to get we're engaged tomorrow like oh that makes sense. You know what I mean? Even if they were like oh we're having a baby. I'm like \"Oh that makes sense. You guys have been together and you're great together.\" You know what I mean? But like something completely out of the blue changed the course of everything for a little bit. You know what I mean? And so like that was like I remember like not liking it obviously but like calling all of my friends everybody I called that night when I was waiting for a pizza to get delivered to tell I had cancer. Everyone the story always led in with like \"So I have something crazy to tell you. What do you think it is?\" And then I'd make",
      "start": 2993.44
    },
    {
      "text": "when I was waiting for a pizza to get delivered to tell I had cancer. Everyone the story always led in with like \"So I have something crazy to tell you. What do you think it is?\" And then I'd make them guess around and like after I call that cancer I have cancer. You know what I mean? Like uh someone's pregnant. No you got a new job. No guess again. Yeah exactly. And it was like you know but it's like you know like my when I called my dad like I first off like I am not good at keeping touch with my family ever. You know what I mean? That kind of thing. So like the phone the fact that you're getting a phone call at night on not a weekend on a normal time is already something's wrong. You know what I mean? Something's out of the My mom would freak out if I called my mom at like Tuesday night at like night. She like \"What?\" Immediately answer the phone. What's wrong? Exactly. Exactly. It's like calling dad. like it was totally out of out of the ordinary of our schedule or",
      "start": 3029.84
    },
    {
      "text": "Tuesday night at like night. She like \"What?\" Immediately answer the phone. What's wrong? Exactly. Exactly. It's like calling dad. like it was totally out of out of the ordinary of our schedule or whatever. But what I remember about it is I didn't make him guess you know what I mean? My dad's very you know very very uh hang up on you. What you see is what you get kind of thing or whatever. But I you know I have cancer. And then and I like stopped for him to say something and there was this huge gap of silence and then all of a sudden I pivoted and started filling but I'm going to be okay. Don't worry. It's this you know what I mean? Like I was letting people react to me and like I had to be off on the offense on that. You know what I mean? and then like for calling my aunt like totally out of the ordinary and on top of that her mother-in-law had been staying with them and was like getting ready to die. So like I called and it was like a day they had to rush her to the hospital",
      "start": 3065.68
    },
    {
      "text": "out of the ordinary and on top of that her mother-in-law had been staying with them and was like getting ready to die. So like I called and it was like a day they had to rush her to the hospital and stuff. I'm like all right well I'll talk to you later and I hang up and it's like I had to tell people before I put up the blog before I made a big deal on the internet. So but what I'm saying about is all this dumb stuff's happening. You know what I mean? And I go into that first chemo. This is a long story. I'm sorry. You go I go into this my first chemo right? And they're like \"All right yeah you know sit you down. It's going to go for like four to four hoursish. You know what I mean? and we'll give you this. This is the cocktail you're getting with all these different kinds in there and blah blah blah. And they're coming in they're hooking up banana bags and they're poking you in the arm and all this other stuff. And it's like \"All right we're getting ready.\" And then they come",
      "start": 3097.68
    },
    {
      "text": "blah blah blah. And they're coming in they're hooking up banana bags and they're poking you in the arm and all this other stuff. And it's like \"All right we're getting ready.\" And then they come in like \"All right well you know we're doing this test that test. Like we have to test you for this one cuz like one in a 100,000 people are allergic to it or whatever.\" I'm like \"Okay cool.\" And they poke me. I'm like \"Ow.\" Like \"Oh that one hurt.\" And I was like \"Yeah.\" Like \"All right we'll keep an eye on it.\" I'm like \"All right no big deal. You're the one in 100,000.\" They walk out of the room and I'm sitting there and I'm talking to Christine and I'm da And I always leave this side. They give you a bell which is awesome because then you ring it like I need water or I'm can I have some snacks or can I get a new magazine or whatever. The bell's there or whatever if you need help. But I'm sitting there and I'm talking to Christine over here. I'm like d and just **** out",
      "start": 3128.24
    },
    {
      "text": "I have some snacks or can I get a new magazine or whatever. The bell's there or whatever if you need help. But I'm sitting there and I'm talking to Christine over here. I'm like d and just **** out of the blue entire left side of my body goes dead. Just numb. Like you just all of a sudden know everything's off and I yank up the arm and it's like a **** noodle and I slam it down in the bell and Christine goes \"What's wrong?\" And I'm like \"Oh my god the left side of my body is dead.\" Like I mean all of a sudden panic begins to rise in the entire room and the nurse comes in. She's like \"What?\" And I'm noticing something. I'm left side of my body's dead. I can't feel anything. She's like \"All right I'll go get the doctor.\" And she runs out to get the doctor. And Christine's like \"All right just keep talking to me. What's happening?\" \"Well left side of my body's dead blah blah blah.\" And I look at her face and I go \"And now your mouth is tin foil.\" And she goes \"What?\" I'm",
      "start": 3157.68
    },
    {
      "text": "right just keep talking to me. What's happening?\" \"Well left side of my body's dead blah blah blah.\" And I look at her face and I go \"And now your mouth is tin foil.\" And she goes \"What?\" I'm like \"Now your mouth is tin foil?\" And like at her mouth was a triangle of tin foil that was crinkly and wrinkly. And then it started to expand. And the doctor comes in he's like \"What's happening?\" I'm like \"Left side of my body's dead.\" And her and I look at him like \"Your mouth is tin foil.\" And he goes \"What do you mean?\" And I'm like there is tin foil taking over everything I see. And it was just like by the end it all I saw were people's eyes and it was tin foil all around them. Like you're having an allergic reaction. And I I was getting a banana bag of saline at the time but I thought that's what it is. I'm like well take it out. They're like no that's helping you right now. That's flushing it. It's the thing we poked you with in the arm to see if you're allergic.",
      "start": 3188.72
    },
    {
      "text": "I thought that's what it is. I'm like well take it out. They're like no that's helping you right now. That's flushing it. It's the thing we poked you with in the arm to see if you're allergic. Spoilers you're allergic. You're like is there another test that could have done that better? Like so skin cell test. So it was just like okay **** You know what I mean? and like like they like now this is going to go on a little bit longer. We're going to sit there and let that process out of you. You can't do that. I'm like \"All right so we just sit there and you process and it goes and then it comes back to normal.\" It's like now it's like a 6-hour chemo and it's like all right we're going to give you the rest right? And like that usually it's a banana bag hanging there. You you know as soon as it hits you you can taste it. You can feel it. Your body doesn't feel right. It burns or something. There's heat through your body. At one point for like the second or third one the",
      "start": 3219.52
    },
    {
      "text": "as soon as it hits you you can taste it. You can feel it. Your body doesn't feel right. It burns or something. There's heat through your body. At one point for like the second or third one the doctor comes in in gloves full body armor and a face mask with this one syringe full of like neon red stuff. And he's like \"This looks like overkill I know but if it gets on your skin it'll eat through your skin.\" And I was like \"All right.\" Like \"But what the **** is it going to do when it gets into my body?\" And so he did that. My body is not with like you know I came out of it. I remember. And it was just like exhausting. And you feel weird. You can feel you feel something. And this is the first one so it's before I know anything's happening. And it was just like \"Okay fine.\" And like Christine drove me home and it was kind of quiet and then she dropped me. She's like \"I'm going to go to the store now and get food for us.\" I'm like \"All right great. I'm going to go",
      "start": 3250.96
    },
    {
      "text": "And like Christine drove me home and it was kind of quiet and then she dropped me. She's like \"I'm going to go to the store now and get food for us.\" I'm like \"All right great. I'm going to go obviously take a nap.\" And I came upstairs. I was tear up at this point. I'm sorry. I came upstairs and I walked in the room and I walked to the closets between the door and I started crying. Not because of me but because of how badly I'd underestimated this and the fact that you jump back five six years and Tim was there doing this is all he knew. You know what I mean? He passed away. He didn't make it. He had seven years of just this and like you know best case scenario I was going to be at the time in six it turned out to be six months nine is what they were telling me I would have to do it but just of the fact of like how exhausted and beat I was let alone to be a child having to go through this and that's what like why I try to do Extra Life every year kindafunny.com/extralife and",
      "start": 3286.24
    },
    {
      "text": "just of the fact of like how exhausted and beat I was let alone to be a child having to go through this and that's what like why I try to do Extra Life every year kindafunny.com/extralife and all these different things you know what I mean of all these different things of like what it was you know what I mean and like he was out for a minute but he was think and like you I I you know it's not that people knew that's what it was going to be but I thought I the inside track cuz I remember being and it sounds **** up kind of excited that I would get an afternoon where I didn't have to work and I could play PlayStation Vita and just like you have you can't do anything but sit there and I was like I'm going to sit there and get trophies and it's going to be awesome. You know what I mean? And every chemo sucked and every chemo was different and every chemo left you feeling **** up this way or that way or whatever. And then if they ever if you ever have to get chemo get the port in",
      "start": 3323.12
    },
    {
      "text": "And every chemo sucked and every chemo was different and every chemo left you feeling **** up this way or that way or whatever. And then if they ever if you ever have to get chemo get the port in your chest or wherever they tell you to put the port cuz they don't tell you your veins might shrink and then they'll dig around with syringes in your arms trying to get to the vein. It's just like and then the first time you get the port it might make you sick. Cuz that was the only time I ever got sick is the first time they ever gave me through the port in my chest. And then they pulled it out and I stood up and I'm like I'm going to the bathroom and just laid in their bathroom for like 45 minutes before asking can I have a garbage bag for the car ride home. You know what I mean? Like that's the thing of like it's I always you know I'm a nerd and I talk about comics all the time and for me the divorce and then but really cancer are like the retcon moments of my life where we tried",
      "start": 3359.52
    },
    {
      "text": "the thing of like it's I always you know I'm a nerd and I talk about comics all the time and for me the divorce and then but really cancer are like the retcon moments of my life where we tried something out in these books and it didn't work and we blinked it out of existence kind of thing. You know what I mean? Cuz now it's like I know that I'm not right. You know what I mean? A topic I'll probably do next week on The GameOverGreggy Show is related to me not being right emotionally. You know what I mean? But it's yeah I get pissed off or everything and I kind of forget about it and then I don't want to ever just blame that it's like it's the hangover from cancer. It's how my body is now chem-wired chemically. Clearly it's true. I was never like this before. But it's those little things of you know I shower or something. I'll look and I'll see the scar on my chest from the port or like this is a permanent bruise from where they gave me. That's where they gave me the prick 3 years",
      "start": 3387.84
    },
    {
      "text": "of you know I shower or something. I'll look and I'll see the scar on my chest from the port or like this is a permanent bruise from where they gave me. That's where they gave me the prick 3 years ago to test. The **** was that thing they gave you? Bleo sounds terrible. Now every time you go anywhere and they're like \"Any allergies?\" I'm like \"Bleomy?\" And they'll be like \"The dentist is like \"What's bleomy?\" I'm like \"It's a chemotherapy drug.\" He's like \"We'll probably won't give it to you.\" I'm like \"Great.\" You know what I mean? But he just puts the red syringe away. It's like I guess we're not going to do that. The best the best was the red syringe one right? Well I eventually started wearing the That's like some **** from **** Justice League. Like we've got the red Kryptonite. I got to tell you about the the best. It's not cuz it's like so overblown or whatever but I I eventually you learned to start for me I was wear I wear button-down shirts so I could get the",
      "start": 3425.36
    },
    {
      "text": "Kryptonite. I got to tell you about the the best. It's not cuz it's like so overblown or whatever but I I eventually you learned to start for me I was wear I wear button-down shirts so I could get the port easily. And so I'm sitting there button-down shirt. This is chemo 7 or whatever. I don't know what it is. And he's giving it to me and going going going and it pops out the back end and gets all over him all over my chest. And he does that thing where he like looks me in the eye and I'm like this and he's like it's not that bad. Don't worry. And he goes and like washes me wipes me down. I'm like what are you talking about? It's not that bad. You can't on step one tell me to eat my skin. You came in seven times later when he gets on my skin like a You can't walk in looking like the **** bomb squad. All of a sudden I was like Cronenberg's Dead Ringers in my head. Guys are just creepy red robes. Yeah that's **** I mean that whole situation just sounds terrible. It just sounds",
      "start": 3456.88
    },
    {
      "text": "bomb squad. All of a sudden I was like Cronenberg's Dead Ringers in my head. Guys are just creepy red robes. Yeah that's **** I mean that whole situation just sounds terrible. It just sounds **** terrible. Yeah. I mean it was you know it's it's I don't know. It that's the whole thing though is it feels like a lifetime ago. It feels so different. It's only three years ago. It is my biggest fear. You know what I mean? That it comes back because now that I know that's the problem now that I know. I mean I remember Christine always tell the story. I think what like two or two months in probably maybe maybe two and a half where it was I was getting something and something else had gone wrong. You know what I mean? Something else was wrong. And I looked at her and started crying and I just go \"This isn't fun anymore.\" And she goes \"When was this ever fun?\" And I had explained to her how in my head I built this up that it wasn't going to be that bad based on this one brave little",
      "start": 3492.0
    },
    {
      "text": "just go \"This isn't fun anymore.\" And she goes \"When was this ever fun?\" And I had explained to her how in my head I built this up that it wasn't going to be that bad based on this one brave little boy I knew. And now I'm like \"This sucks.\" And I'm like \"I don't want to do this.\" You know what I mean? So yeah I still like I still can't open um at IGN we had the screen protect the screen wipes you know what I mean? Like I can't open those without gagging because it the smell of them is the saline taste and when they would give you that initial banana bag that would go in and I would start gagging then so I had to start eating Jolly Ranchers when I had the you know what I mean? Like there's all these little weird ticks about it. It's it's weird how like as you get older and you go through these emotional moments or like these weird traumatic experiences how that sort of sets you on a slightly different path. Like I used to never give a **** about needles right? I would get",
      "start": 3527.12
    },
    {
      "text": "through these emotional moments or like these weird traumatic experiences how that sort of sets you on a slightly different path. Like I used to never give a **** about needles right? I would get blood drawn. I'd be like whatever. It was never a thing. I could I could I could literally do this thing and watch the blood flow into that **** I used to be the bad man. Then I had one instance where I went into dehydrated and passed out. And now even the thought of getting my blood drawn like gives me that sort of fuzzy feeling where I'm like Jesus am I just becoming am I becoming more of a wuss as I get older or am I just more aware of the **** up things that are out there that can possibly happen to me? I I think it's the latter. I mean it's because I I know I have I have memories of how fearless I felt you know all those stupid things. And now I think it's certain things. I think for me it was getting married and my wife getting very very sick and thinking \"Oh my I'm only",
      "start": 3562.96
    },
    {
      "text": "of how fearless I felt you know all those stupid things. And now I think it's certain things. I think for me it was getting married and my wife getting very very sick and thinking \"Oh my I'm only you know a year and a half in a marriage. I might lose my wife.\" And you just start like there's usually those moments. It's like \"Oh wait. Things are way more fragile.\" and the loss of things that mean something to you. Like I I like the only thing that goes through my head is like I I I can't you know if this if she were to pass away I can't walk away from this. I I will be eternally changed. Yeah. And I think it's that's where actually I take that it was it was around the time that I was going out with her and I knew was completely madly in love with her and I got scared about flying on planes. You just got I used to I used to be a nihilist where I'm like h if it goes down who's going to miss me you know or I was just you know I'm not a religious person like it's done. And",
      "start": 3603.12
    },
    {
      "text": "on planes. You just got I used to I used to be a nihilist where I'm like h if it goes down who's going to miss me you know or I was just you know I'm not a religious person like it's done. And suddenly I'm like \"Hold on there's something I want to get home to. There's a person I want to see.\" You know there's a sensation of of being with someone else. And all of a sudden I felt myself becoming far more cautious and not wanting to take those chances. And I wouldn't say being fearful but being far more aware that mistakes can happen and some of those mistakes can carry some pretty severe consequences. Yeah. And I feel like I mean that's that's a good point too. I think a lot of my um awareness stems from the fact that I have been married now for a while. I do have someone that wants me to come home and I do have someone that I care about. Um like my wife just had an arm surgery. It was a very small surgery. Um nothing like that. She it was you know she had a small nerve some",
      "start": 3638.96
    },
    {
      "text": "me to come home and I do have someone that I care about. Um like my wife just had an arm surgery. It was a very small surgery. Um nothing like that. She it was you know she had a small nerve some nerve damage and the arm is still there. But the arm is still there which is great. But you know there's that there's that realization that you're sitting in a hospital with your the person that you love most in the world and there's a doctor who is by the way way too **** good-looking to be a doctor. And my that was one of the only things I was like I'm having this beautiful tender moment with my wife. I'm like you're going to be okay. You know they're putting you under under uh anesthesia but you're Ted walks in and then no Dr. McDreamy walks in with his perfect beard. Well I'm like I got a good beard but this guy's beard is like perfect right? Right? And he's like a little too tall and a little too skinny and probably makes a little too much money. And",
      "start": 3681.84
    },
    {
      "text": "beard. Well I'm like I got a good beard but this guy's beard is like perfect right? Right? And he's like a little too tall and a little too skinny and probably makes a little too much money. And my wife does this thing every time she sees someone that she's clearly attracted to. Cuz you've met my wife right? She just does not have it in her to lie. She just she won't do it. And she sees this guy. She goes \"Oh hi.\" And he's like \"Hi I'm I'm doctor whatever. I'll be you know I'll be putting you under today.\" And I'm like \"You'll be doing **** nothing to my wife my friend. Give me the ugliest doctor in the my wife.\" And I was like \"This guy's got to go.\" Um but you know but he's he's I mean you know he put her at ease obviously and and and he's he was good at what he did because she came out of it. But there's that realization that when they're wheeling her down the hall then I'm like if this guy **** up well first of all he's dead cuz I'll",
      "start": 3718.32
    },
    {
      "text": "good at what he did because she came out of it. But there's that realization that when they're wheeling her down the hall then I'm like if this guy **** up well first of all he's dead cuz I'll **** I'll take his lengthy ass up the building and **** throw him right off if he **** my wife. It would just be one of those of him with his hand on your forehead and you swinging. Excuse me sir. Security will be here soon over here right into my eyeball. No but I mean there's that there's that realization that you're like I'm watching my wife who I and I can't do anything about this. There's nothing in my power that I can do that will help the situation. I just have to trust that these people are professional and will take care of her. And she came out and it's it's a it's a really weird feeling of relief but it's also a feeling of like **** this was something that didn't really matter. What happens if there was something that mattered? What happened if she had like it",
      "start": 3754.48
    },
    {
      "text": "weird feeling of relief but it's also a feeling of like fuck this was something that didn't really matter. What happens if there was something that mattered? What happened if she had like it needed heart valve surgery or something very very severe that this I mean this was like a they were like \"Yeah there's there's 100% success for this.\" It's like it it may not take but she's coming out of it right? But imagine if it was something where they're like this is maybe I mean that's what I if it goes below 100% like I'm not willing to deal with those that that percentages. I mean it it was a while before people could figure out what was happening everyone just knew something very bad was happening and then once they realized what it was it's a it's a very strange rare autoimmune disease called autoimmune hepatitis really. So it falls in the same family as like Lupus and Crohn's disease. Fundamentally your immune system suddenly does not like your organs. In her case it was her",
      "start": 3790.16
    },
    {
      "text": "called autoimmune hepatitis really. So it falls in the same family as like Lupus and Crohn's disease. Fundamentally your immune system suddenly does not like your organs. In her case it was her liver attacking it right? just the same way that had you had a transplant your body might reject it but this is all happening somehow on the inside. Um and no one really understands it and it can just be sort of monitored with drugs and stuff like that. But yeah that was just like you just didn't know what the next day was going to bring. And like I I reached a point where I hate hospitals so much because we're constantly going to UCLA and we get that blood test and like that was my that was like my all of my self-worth was predicated on her blood tests because if it looked like that these numbers were dropping. It's like okay this feels good. This feels good. But like those numbers shifting in another direction. It's like okay I have to re-trigger the way I'm looking at the world and all",
      "start": 3822.96
    },
    {
      "text": "were dropping. It's like okay this feels good. This feels good. But like those numbers shifting in another direction. It's like okay I have to re-trigger the way I'm looking at the world and all of this stuff that yeah it's it's I mean it's weird. I I had something of a small scare this year turned out to be absolutely nothing. But I so prefer the idea that something bad was gonna happen to me. Oh yeah. And something happening to her. Oh no. I told my wife straight up. I was like you know a I'm Italian and b my family has a history of just the guys die super fast. I think largely it's because they always they married Italian women and I think that Colin knows what I'm talking about. Um but yeah I'm like you just have to just deal with the fact that I mean my wife's like kind of a health nut and she works out and she like she teaches Pilates for a living and so she drinks smoothies all the time and I'm like \"What is that fuck you're putting in your body?\" She's like \"It's",
      "start": 3862.32
    },
    {
      "text": "health nut and she works out and she like she teaches Pilates for a living and so she drinks smoothies all the time and I'm like \"What is that fuck you're putting in your body?\" She's like \"It's healthy.\" I'm the opposite where I'm like you know I treat my body like a jungle gym. Um Kevin and so I'm just like you know babe you got you got to just realize that I'm going way before you. You're going to you know you're you're going to have to just wrap your head around that I'm not the last guy that you're going to be with. And she's like \"No that's not going to be the case.\" Ted's out there. It's okay. Fuck Ted. Dr. Ted. Ted's gonna What's up Dr. Ted? He's like \"I'm so It was like he was saying doctor shit but in the back my brain was translating with it like \"Your wife's going to leave you and we are going to have sex and it's going to happen way faster than it ought to.\" You know what I mean? Way faster than it has any natural ability to happen. And then he's",
      "start": 3900.32
    },
    {
      "text": "going to leave you and we are going to have sex and it's going to happen way faster than it ought to.\" You know what I mean? Way faster than it has any natural ability to happen. And then he's like \"Any questions?\" And I was left with nothing. Yeah. I mean I I saw this doctor earlier this year when I was having this this this scare and the guy who's who played the head of the bad frat in Revenge of the Nerds. Oh fuck He was also on Childrens Hospital. Yeah the head of the bad. Anyway he looked like the oncologist equivalent of that dude with like the same head of blonde hair. He wasn't even wearing like the lab coat and I'm just like \"Come on play doctor for me. I don't want to be here.\" And you come in with this alpha male nonsense. He then put something in my mouth and like with with those those those swabs. Yeah. Well but except it was the cardboard wooden one. Oh tongue suppressor. Tongue depressor. And then he's like \"All right fine.\" He walks out. I'm just like I got the",
      "start": 3938.96
    },
    {
      "text": "those those those swabs. Yeah. Well but except it was the cardboard wooden one. Oh tongue suppressor. Tongue depressor. And then he's like \"All right fine.\" He walks out. I'm just like I got the survey from UCSF. Go I'm going to tell you what I want to think of this guy. Oh my god it's Ted McGinley. Nailed it. Nailed it. I was thinking John C. McGinley or John C. I knew it was Ted Mc you guys are Married... with Children. Yeah weird. That's right. You played uh Oh the neighbor. Yeah. Mhm. He actually had to start on Happy Days. Yeah. Because I Yeah. One of my early theater instructors used to direct some of the later episodes. I think Post-Shark Happy Days the Post-Shark incident and he was he would constantly imply that guy and complain about him because he he he was a water polo player at UCLA and somebody was like \"You get out. We're going to put you on TV.\" And he's like \"I don't want to wreck this guy.\" Oh my god that's hilarious. I don't know. Colin what about you? I don't",
      "start": 3982.16
    },
    {
      "text": "at UCLA and somebody was like \"You get out. We're going to put you on TV.\" And he's like \"I don't want to wreck this guy.\" Oh my god that's hilarious. I don't know. Colin what about you? I don't know. The the the thing I've been coming to to I've had like pretty chronic stomach problems my whole life and that was like where my mind first went but that's that's something I'm so used to like you know the whole shitting blood and being in the hospital like or going to the the uh rather going to the doctor and getting shit shoved up your ass and down your throat. You know it's not that sounds like a good Saturday night. Uh so um that's not where I'm going to go. I was thinking more about for Tim for Tim's point about something more a little more emotional which is like my parents got divorced when I was like really young and that was always really normal to me and as I got older like in like when I went to college and like my early 20s I started to get really mad about it and I",
      "start": 4028.08
    },
    {
      "text": "divorced when I was like really young and that was always really normal to me and as I got older like in like when I went to college and like my early 20s I started to get really mad about it and I don't really know like didn't really know why and then I started having fights with both my parents about it like about things that happened literally in like 1991 or something like that. Um and uh I've always dealt as I got older with this this nagging feeling that I was robbed of a normal childhood. And I think that's kind of like where where like my angst about it comes from. Also the fact that I'm the youngest of four and that my other siblings seem to have way more anger about it than I do and always have in like Exactly. My brother was like 17 when it happened. he was about to go to college you know like and I remember my brother being like fucking super mad about it you know and and my sisters being a little younger or whatever than him um also having their own anger as time",
      "start": 4066.8
    },
    {
      "text": "college you know like and I remember my brother being like fucking super mad about it you know and and my sisters being a little younger or whatever than him um also having their own anger as time went on but me kind of being just thinking like this is normal and then like thinking back on and being like my parents and I'm not talking shit about my parents. My parents are great people and they did a really nice job of raising me and making it seem normal but I have this like nagging feeling that I missed out on a lot of like normal shit when I was a kid and that like my normal childhood was not a normal childhood. I lived in four states and you know went to a bunch of different schools and would only go to the Long Island when I left you know for summers to see my dad and stuff like that. And like that's not normal you know that's not a normal way to live is like being transient. like I lived in Maine and then I lived in New Hampshire and then you know I lived in",
      "start": 4106.48
    },
    {
      "text": "stuff like that. And like that's not normal you know that's not a normal way to live is like being transient. like I lived in Maine and then I lived in New Hampshire and then you know I lived in Massachusetts and um I don't think there is a normal though. Yeah. You know like Well the nor Yeah there is a normal which is like you know I don't remember what it was to like sit down the six of us and have dinner together. I don't remember like what it was to like open presents together in Christmas. I don't remember what it was to like but like that was normal. I had two Christmases. I had two Thanksgivings. I had like but like that's not normal and that's not like the the the white I don't want the white picket fence thing. And it's hard for me to even I've never even really talked about it but it's like it's just something that's always nagged at me which is like I I don't have anyone to blame because I don't think it was anyone's fault. Like my my my parents just you know didn't",
      "start": 4142.0
    },
    {
      "text": "but it's like it's just something that's always nagged at me which is like I I don't have anyone to blame because I don't think it was anyone's fault. Like my my my parents just you know didn't see eye to eye anymore and and they broke up. But I never had the thing where everyone used to say like I remember being sent to therapy when I was a kid. Like they were they thought that was the thing. They were like you know we should probably just send Colin to therapy. Don't know why. Uh and I remember them saying like it's not your fault. It's not your fault. I'm like I don't think it is my fault. Like I'm not taking any of the blame for this. Like I I don't understand where that platitude came from because I don't think it's my fault. Like the bigger thing I was confused about was like my parents kept me so busy that I think like I played I played a lot of hockey when I was a kid. I can't understate like I was on travel teams and I played I was all over the fucking place and I like",
      "start": 4177.12
    },
    {
      "text": "my parents kept me so busy that I think like I played I played a lot of hockey when I was a kid. I can't understate like I was on travel teams and I played I was all over the fucking place and I like was kind on weekends I was gone like every weekend gone for years and uh I just I think it was about the time like maybe in high school when I went moved back to Long Island in 9th grade like permanently to be like live with my dad again and had time to like sit and think and I was just playing high school hockey so I was only playing like you know for a little while and I was just hanging out with my friends and stuff and I started to think more and more I'm like what the fuck just happened you know like in 1991 my parents were together and then they apart and then I lived in Maine and then I lived in New Hampshire and then you my mom was in Connecticut and then she went to Massachusetts and now I'm back here and what happened like what the hell happened to my life you know and like",
      "start": 4208.56
    },
    {
      "text": "I lived in New Hampshire and then you my mom was in Connecticut and then she went to Massachusetts and now I'm back here and what happened like what the hell happened to my life you know and like what did I miss and the friends I missed because when I moved away from Long Island my friends moved on and then I came back to Long Island we were just totally different you know like totally different people I had these like really kindred connections with people in in New England that I'll never see again you know like I never knew what it was like to be part of a group and really be part of it forever you know like for like from like being very young to being now. Like my friends my closest friends are people I met in college or after with the exception of like Mike and a few other guys that I do have friends from Long Island. But there's just a lot of nagging feelings that I deal with every once in a while like quiet times at night when I'm just like sitting in bed thinking and I get",
      "start": 4246.48
    },
    {
      "text": "I do have friends from Long Island. But there's just a lot of nagging feelings that I deal with every once in a while like quiet times at night when I'm just like sitting in bed thinking and I get real I'm a nostalgic kind of person. I just think back and I'm like what what the fuck happened? You know like like people have these friends that they've had for this group of core group of friends that they've had for 30 years but I only have my core group of friends for you know since college or a few guys from high school whatever. And um I just have these memories of moving and being and and this normality and it it really bothers me especially because like when I say things that are unpopular or you know make it seem like I come from a uh a privileged background or whatever. Um it bo like everyone thinks that like I didn't have my own issues growing up or like my childhood was somehow easy because I'm from Long Island or they assume my family has money or you know all those kinds",
      "start": 4280.4
    },
    {
      "text": "like everyone thinks that like I didn't have my own issues growing up or like my childhood was somehow easy because I'm from Long Island or they assume my family has money or you know all those kinds of things because Long Island is is is you know totally associated with money like in people's minds. Yeah. Absolutely. the Hamptons and and all that kind of stuff. Like people think that that's what it is. And like if you're from there that it is a well-to-do part of New York I guess but if like you're from there then like it's like like you have no problems. You come from a white picket fence like suburban neighborhood. That's c people of strips told me that before and and and it ignores all like the the the the realities of what it was like to grow up in that situation. And unfortunately it's not abnormal. The abnormal part of it I think was how normal we all came out which is why I'm not really mad at my parents. like my my siblings are all great. They're all doing fine. My",
      "start": 4315.52
    },
    {
      "text": "it's not abnormal. The abnormal part of it I think was how normal we all came out which is why I'm not really mad at my parents. like my my siblings are all great. They're all doing fine. My parents are fine. They get along with each other fine now. Like time has passed and healed all wounds and and all that stuff. But yet I'm left with this left with this nagging feeling that that something wasn't right when I was younger. And I can't go back and correct it. And I can't even go back and observe it at the time because I was so oblivious. It was the perfect age for me not to know what was happening. And by the time I was cognizant of it it was too late to do anything about it. You know I'll never The one thing that I will always bring with me and I know it's true even though my dad tells me it's not is my dad was a New York City firefighter as everyone knows and um worked a lot and save you know had a you know we were we were fine. We we we did well. They're well paid. My dad",
      "start": 4352.56
    },
    {
      "text": "tells me it's not is my dad was a New York City firefighter as everyone knows and um worked a lot and save you know had a you know we were we were fine. We we we did well. They're well paid. My dad built a house in Brookhaven where I'm from on Long Island on an acre piece of land in 1985. He like designed the house and helped build it. And uh in 1997 I was still living in New England with my mom but I was home for a summer. My dad was deciding to sell the house. And I knew that if I just stayed that he wouldn't have sold the house. And I know that it still hurts him to this day that he doesn't have it anymore. That he lives in a house someone else built and and all this kind of stuff which is why I think he you know he's building his new house in the Hamptons which is something we've talked about or whatever. And I think this is like his final his way to be like I want to build something again have something of my own or whatever. And I have this incredible guilt that if I",
      "start": 4387.6
    },
    {
      "text": "talked about or whatever. And I think this is like his final his way to be like I want to build something again have something of my own or whatever. And I have this incredible guilt that if I just stayed on Long Island that he wouldn't have done that. and I know it's true even though he tells me it's not. So there's like all these like little familial problems that I like that have these domino effects in my life that have you know affected people. So it's it's not if I don't know if this any of this makes any sense. It does. I've never tried to actually verbalize any of it but um that's kind of the emotional tumult that I come from is like just dealing with my childhood. It was it was pristine in the sense that no one did anything wrong with me. I didn't grow up in a violent household or anything like that. My parents were very good to me. Hockey is a super expensive sport. I was a goalie which is really expensive. They brought me all over the place to play. And I realized",
      "start": 4427.36
    },
    {
      "text": "or anything like that. My parents were very good to me. Hockey is a super expensive sport. I was a goalie which is really expensive. They brought me all over the place to play. And I realized that they did that because they loved me and cared about me and tried to keep it normal. But I also know that the underpinnings of it was not normal. That and one of the things that brought up to me was I was talking to my I went to Mike Pope's wedding my my good friend from high school. I was in his wedding party and I I drove up to Connecticut with his parents who I'm very close to and uh I've known them for 20 years almost and I lived across the street from them for they still live across the street. And uh they brought up the point they're like \"We don't know your mom. Like we've just never met your mom. That's crazy. And I'm like it's okay. You guys never met my wife so that works out. That's true. But like a different woman every time we meet her Adam. I'm not here. I'm I'm just not",
      "start": 4461.84
    },
    {
      "text": "your mom. That's crazy. And I'm like it's okay. You guys never met my wife so that works out. That's true. But like a different woman every time we meet her Adam. I'm not here. I'm I'm just not here. And and it's just this it's just this thing where I'm like \"Wow that's true.\" Like I grew up in that house basically with that family eating dinner there and hanging out with them. 18 years of my life. Um from 1 to 30. I mean I still go home and take them to dinner and stuff cuz I I feel like I owe them so much. And I'm like \"Wow you don't even know this other half of my life at all.\" you know and it's it's just funny how I I don't know. I've just I've just experienced more than I think people might give me credit for and that I've kind of just buried it and put it away you know because that's what you have to do to move on. But there's something haunting about it you know and I don't really know like what it is. It's just it is haunting and I don't know. So that's kind of",
      "start": 4495.84
    },
    {
      "text": "that's what you have to do to move on. But there's something haunting about it you know and I don't really know like what it is. It's just it is haunting and I don't know. So that's kind of where I'm coming from with it. Not as a little more uh nebulous but certainly the thing that came to mind when Tim started talking. So Downer topic Tim. Good job. Yeah that's what I did. Go back to talking about Disney shit lists and stuff. Yeah next week we should revisit that. That was the first thing he ever did on the show. The Disney Princess shit list. Who Who would you want to have sex with from Disney princesses? And I said Sebastian the Crab and he said \"That's not a princess.\" Yeah. I came by the next day. Revisit that one. Nick. Yes sir. Give me a palate cleanser. All right. This will be This is the polar end of the uh spectrum on that one. Turn on the damn fan. It's too loud when we podcast with it. You want to take a break and get waters real quick? Let's go. All right.",
      "start": 4532.24
    },
    {
      "text": "will be This is the polar end of the uh spectrum on that one. Turn on the damn fan. It's too loud when we podcast with it. You want to take a break and get waters real quick? Let's go. All right. Uh do you need a water? You didn't come in with one. We can send Kevin. No problem. Well he needs a glass too. Go get the young man a glass. Kevin I'm going to cross the camera though. You cross. That never stops you Kevin. Everyone loves it by the way when you do that. Uh get him a glass. Don't knock into the camera. You're running like a half. The speed was unnecessary Kevin. He likes to defy gravity and physics with his body. Have you noticed that? Yes. He's able to sort of swim through the air. It's less frames. Kevin would have been a great fullback. Uh probably I don't even know what position that is but it sound it has the word full impact. It's the guy that runs into the offensive. It's the guy that runs into the defensive line so that the running back can run behind him in",
      "start": 4577.28
    },
    {
      "text": "position that is but it sound it has the word full impact. It's the guy that runs into the offensive. It's the guy that runs into the defensive line so that the running back can run behind him in the full. Yes Kevin would have done an amazing job. Uh my topic's a little bit on the lighter side. It comes from uh some of our good friends and supporters over on Patreon. Uh oh. So you can say this topic is brought to you by Patreon.com/KindaFunny. Go there to support the show. Oh here comes Kevin everybody. There he comes. There you Oh look at him. Do you see his little head? That was like Oh my god. It's like just come into the shot. Now you're making this. Now you're just This is actually more distracting. Everyone knows you're here than you walking in front of the camera. It's you fucking dancing around the camera and send that water bottle like a ballerina. Second position. Oh pa. Uh my god. Rhonda Strong over at Patreon.com/KindaFunny that we Google image search ourselves and",
      "start": 4618.48
    },
    {
      "text": "dancing around the camera and send that water bottle like a ballerina. Second position. Oh pa. Uh my god. Rhonda Strong over at Patreon.com/KindaFunny that we Google image search ourselves and discuss. Oh good lord. Yes. This sounds fucking awesome. I cannot wait. Should we go which way? Which part of the table should we start on? No we'll start on me. Go over to Are you going to use the same phone for Are you going to use your laptop? Yeah your laptop. That's a better idea. I'll screen one. How about that? Does that work? What do you want? Laptop. I'm fascinated to see what happens when we Google image search Adam. Are you guys going to search through all the We'll figure it out. I don't even Google my name anymore. Like I stopped doing that over a decade ago. Oh really? I put my name pretty often to see what horrible things people are saying about. Oh god. Well now it's just it's just the auto thing. There's a Oh the auto. There's a restaurant in in the building and I've",
      "start": 4655.2
    },
    {
      "text": "name pretty often to see what horrible things people are saying about. Oh god. Well now it's just it's just the auto thing. There's a Oh the auto. There's a restaurant in in the building and I've become close with the bartender down there. Surprise surprise surprise. And he's like \"So what? You worked on TV?\" And goes \"It's amazing what's coming up but I'm putting your name in.\" That's actually a fun part of this. So we will also read the search result. I already because I already I put in Nick Scarpino autofills to Nick Scarpino wife Nick Scarpino age Nick Scarpino Wiki Nick Scarpino IGN Nick Scarpino PSN. Oh that's a lot cleaner than I thought it was going to be cuz it used it. Yeah it used to be other things. Then Nick says \"Stop saying that about us.\" So now we're going to the Oh Nick Scarpino cocaine. Yeah that was one we tried to get related searches. Yeah. Our wife Shadow Boxing IGN Colin Moriarty Cheryl which is a picture of me and my sister. Colin Moriarty Moho.",
      "start": 4700.56
    },
    {
      "text": "Oh Nick Scarpino cocaine. Yeah, that was one we tried to get related searches. Yeah. Our wife Shadow Boxing, IGN, Colin Moriarty, Cheryl, which is a picture of me and my sister. Colin Moriarty Mohawk. Well, uh, Nick Scarpino wife is him and Courtney Draper or Alexis. Yeah, that's that's hilarious. That that was when I did those those Dorito commercials for that competition. Everyone's like \"Nick's wife is hot.\" And I was like \"That is Alexis cuz I'm us.\" But this one I'm actually h I'm happy. Like this makes me happy that people think that I actually have what it takes to be married to either of these gorgeous women because Courtney Draper is not bad on the old eyes if you know what I mean. You're also tacitly insulting your wife. Just my wife's hot too but no one knows what she looks like. So follow her every time we try. She could be changing. So yeah, the first image results here are just the Kinda Funny photos right there from the photo shoot. You with a goofy face. Yeah. And",
      "start": 4743.52
    },
    {
      "text": "So follow her every time we try. She could be changing. So yeah, the first image results here are just the Kinda Funny photos right there from the photo shoot. You with a goofy face. Yeah. And then there's this one here with you. Uh that's from my Vine. I think I was just that someone grabbed a frame from like the one and only Vine I've ever done. It looks like I just smoked an insane amount of weed. Some of them dank nugs, bro. That's sticky wicky icky sticky one of you from Comic-Con running the show. That one's great. The one where I have fantastic hair and that's not me. That's the Portillo's Nick Scarpino. Yeah, two of Portillo's Nick Scarpino show up. One with the purple background we know well and then one of him outside of Portillo's in I believe Buena Park there looks like. Yeah. Isn't Isn't that the side where we come in? It does look like one. Yeah. Uh yeah, that's the where we had the meet and greet. It looks like Yeah. Then your Axiom Verge, of course, a photo. That picture",
      "start": 4786.16
    },
    {
      "text": "Isn't that the side where we come in? It does look like one. Yeah. Uh yeah, that's the where we had the meet and greet. It looks like Yeah. Then your Axiom Verge, of course, a photo. That picture is meant like one of my favorites. Oh, the slow the slow zoom in the gif off of Yeah. off of uh the Victoria's Secret fashion show. The cat one. My scared cat face. It's not open. It's not working. I hate that one. Jesus, my hair was terrible back then. Your hair was awesome. No, there it is. Sorry MP3 listeners, but you know it. That's a good That is a great classic Nick Scarpino moment. These are some of the fun like uh what's me and uh Chris Jericho at noon. That was the first one of the first big E3s that we did the big live stream on. Yeah. Not too crazy. I don't have too many guys. Oh, that's a great one. That's that's Kenny Loggins, isn't it? The one that is KOG. Oh, yeah. It's funny how much Kenny Loggins looks like you though. That is again another compliment because",
      "start": 4826.64
    },
    {
      "text": "guys. Oh, that's a great one. That's that's Kenny Loggins, isn't it? The one that is KOG. Oh, yeah. It's funny how much Kenny Loggins looks like you though. That is again another compliment because Kenny Loggins is a just a majestic human being. Look at him. That album cover. It's weird. Like it's weird how much you guys look alike. We have the same eyebrows. And then buried way down here. You you actually as the drum major. That's me from high school. We don't see that one. That's why I didn't have sex till I was 1. Right there. Look at that. Look at the hairline. This is what I talk about. Why do you talk about so down on being the drum major? No, cuz you had to make a cool face. So it made you look tough when you were the drum major. Cuz you had a cape on. See? and a plume. My plume was dark. Everyone else's plume was white. I had a blue plume. But then why do you kind of have the boo-boo? Because that you when you're when you're in the marching band community, you're supposed to",
      "start": 4871.68
    },
    {
      "text": "dark. Everyone else's plume was white. I had a blue plume. But then why do you kind of have the boo-boo? Because that you when you're when you're in the marching band community, you're supposed to look hard. Okay. Cuz that's if there's one thing that marching band that's why I'm asking you about this quick picture. Oh, no. I was I think you're just referring to the fact that I was saying that's how you look hard because I need to tell you they are not your friend. They are not your friend. It looks a little like someone had pizza off camera and I'm just kind of staring at that like thinking I'm going to have my pizza on that pizza. But this is what I was talking about. Look at that **** hairline. You have that awesome vampire. Amazing. I had Eddie Munster kind of but now it's like, you know, it's it's a little up there now. All right. Yeah, that's you. That's me. That's you too deep. Mine won't be interesting. Yes, it will. Greg you screaming. Greg Miller. Autofills are cancer.",
      "start": 4909.6
    },
    {
      "text": "you know, it's it's a little up there now. All right. Yeah, that's you. That's me. That's you too deep. Mine won't be interesting. Yes, it will. Greg you screaming. Greg Miller. Autofills are cancer. Christine Steimer, artist, photography burder. Portillo, Utah Jazz. No, Ber. Oh, and net worth net worth negative $500,000 then. Okay. See, but then here on the image search, the top ones are Christine Steimer, ex-wife, cancer, artist, jazz. She's the Utah Jazz owners. People have a really weird obsession with everyone's girlfriend. God, that is a weird thing to associate with you. I didn't know you. I love jazz. I mean, I know the regions of the country I not Utah. Yeah. See, mine are boring. Well, scroll down. Hold on. Okay. What? Well, I mean, you see my Twitter profile pick. The other one I used a Kotaku one an old Twitter profile pick old up at noon me and Portillo. Scroll down a bit. Here's one of Yeah. Here's a here's the geek-rific one where me I'm next to a cartoon. This poor",
      "start": 4944.88
    },
    {
      "text": "one I used a Kotaku one an old Twitter profile pick old up at noon me and Portillo. Scroll down a bit. Here's one of Yeah. Here's a here's the geek-rific one where me I'm next to a cartoon. This poor bastard. Who is that? I don't know. Yeah. See, mine are all like actually publicity shots. Oh, here's that G4 one. Yeah. You remember this? Good lord. Oh god. Were you 14? People still throw this at me all the time. What were you talking about? I came on with uh it was me and Shane to talk about the new DualShock when they put Rumble back in it and I thought it was and I was like why am I why like they and I think you kicked me. You're like so what tell me about the controller Greg and I'm like it's the DualShock without the cord and you're like thanks thanks Greg like great Greg we only have 10 more minutes to film. This is still what I love is the is the backdrop we use for San Francisco because if that were actual where Greg would be doing this interview from would be a park would",
      "start": 4990.88
    },
    {
      "text": "have 10 more minutes to film. This is still what I love is the is the backdrop we use for San Francisco because if that were actual where Greg would be doing this interview from would be a park would be a park that I swear to God. I like the idea that like unbeknownst to Greg behind him Full House is happening and too close for comfort. I was going to say that looks like a still from the intro of Full House like walking into Lori in in that park. Sorry, just cataloging it for Kevin there. We got C minor boring. There's me talking. Oh, this is from uh IGN First Friday. So is this one. This is me at a singing competition. And there's that. What's is that Greg Pac Park? I don't know. From Heroes. That's Oh, yeah. Greg Grunberg. Wait a minute. Isn't that Wait a minute. That's the guy that owned the the studio that we were at with Kevin. Yeah. Kevin Pereira. Yeah. It all comes back to G4 because there was a standup **** because there was a cardboard cut out of him in there. Oh, that's",
      "start": 5032.72
    },
    {
      "text": "owned the the studio that we were at with Kevin. Yeah. Kevin Pereira. Yeah. It all comes back to G4 because there was a standup **** because there was a cardboard cut out of him in there. Oh, that's right. Yeah. And then it's not till way down the page that the Yeah. The Utah Jazz Dude and stuff starts to popping up here. Good. And they got that gif of me from Giant Bomb when I knocked all those beers off when I was shirtless at E3. People still bring that up sometimes I see is like Greg's such an **** I'm like, you don't know **** about Greg. It's just Yeah, it's just that's a good one. I love that. Oh, that up at noon. That's when we announced I or that was Yeah. when I announced that I had cancer. And it's from Cancer: Fact or Fiction. Yeah. Me knocking these the cans off. I didn't realize the cans were full. I still Yeah, cuz somebody was in the podcast before me and left their their beer there. So, like three of them are mine and fallen soldiers. Yeah. The moment where you look",
      "start": 5077.76
    },
    {
      "text": "the cans were full. I still Yeah, cuz somebody was in the podcast before me and left their their beer there. So, like three of them are mine and fallen soldiers. Yeah. The moment where you look at it, you're like, \"Yes, I'm doing this.\" I Yeah. Yeah. Well, it's like, you see me look at it, I'm like, \"These are mine. They're empty.\" And then I do that look where I'm like, \"Oh, no, they weren't. Oops. That's all right. I don't play this.\" Cool. **** My shirt's not on. This my This is like that dream you sometimes have. All right. Adam Sessler. Oh, good. autofills right now or Twitter 015. Wait, you got to go to go to Google because there's more. Go to google.com and search for one because it's it's going to give you twice as many. Oh, yeah. Let's just do it to Adam. We did it to Greg as well. We did. Yeah. All right. See, Adam Sessler Twitter 015 podcast. Wasn't there like 10 of them? Type in nude. That was from search, I think. Maybe. Adam Sessler nude. No, I was going to get the",
      "start": 5119.2
    },
    {
      "text": "as well. We did. Yeah. All right. See, Adam Sessler Twitter 015 podcast. Wasn't there like 10 of them? Type in nude. That was from search, I think. Maybe. Adam Sessler nude. No, I was going to get the drugs thing, too, because of what the kids like to say. And there's another one. So then, okay. So then autumn autofill here on like the Hold on. This is funny. Adam Sessler, hair, wife, young. Hold on. Can we talk about what is being shown under wife? This gets really funny. Hey, it's my nude billboard I did for Gunnar. What are the other two? I think looks like you and Cyborg uh cyborg ninja outfit for Metal Gear on this one. We'll see. Yeah, but that be under wife. I But I never wore that. Well, no. It's cuz Well, it's it's a bad shop. I think he's just putting your head in there. Why would you waste the time? Cuz they want to make you look like Gray Fox. That's a good Where I come from? That's a cosplay. Is that what? All right. So, there's whatever Metal Gear character that was. Then",
      "start": 5157.36
    },
    {
      "text": "you waste the time? Cuz they want to make you look like Gray Fox. That's a good Where I come from? That's a cosplay. Is that what? All right. So, there's whatever Metal Gear character that was. Then, see you. Yeah. See, you're all boring, too. No, let's not even go there. We'll crop that one out for sure. We'll crop that one out for sure. But then Yeah, it's all Yeah. I mean, it's a lot of just you this one. Yeah. Your Twitter. Your Twitter. Oh, yeah. Yeah. the the the Google Hey, I guess I guess I Dragon Age. Oh, that's I was thinking Witcher, but you're right. That's Dragon Age. Yeah. Yeah. Yeah. See, you're boring. I'm actually a very boring guy. More shirtless photos of you than I thought would be available. Sessler box about the Vita. I like that. I like that. Kevin Pereira rearing his ugly head. I had something I can't believe I had something to say about the Vita. There it is. This is from NeoGAF. Adam Sessler is now an actor in a film. Oh, you know what? I was reading that thread",
      "start": 5206.4
    },
    {
      "text": "ugly head. I had something I can't believe I had something to say about the Vita. There it is. This is from NeoGAF. Adam Sessler is now an actor in a film. Oh, you know what? I was reading that thread last night because I just got a little bit curious. Yeah. Um, it's really funny. Just just internet. I'm just going to throw this out there. I might have other things I do that I don't tell the world about. You know, you don't just yell about video games. I haven't just been dormant doing a be horror movie as my sole form of income or employment. He told me he's been off the air for three years. I guess he has to do something for the money. I was like, \"No, I was doing it for the shits and giggles.\" Yeah. I did the other things for the money. All right, Colin Moriarty. I'm excited for this. Colin Moriarty Mohawk, memes, tattoos, Fallout 3, IGN, afro, Mega Man, Mega Man hat. Go to Mega Man hat. Your image autofill is Mohawk, Cheryl, tattoo, beard, afro. And I'll I'll reiterate that the picture",
      "start": 5252.48
    },
    {
      "text": "Moriarty Mohawk, memes, tattoos, Fallout 3, IGN, afro, Mega Man, Mega Man hat. Go to Mega Man hat. Your image autofill is Mohawk, Cheryl, tattoo, beard, afro. And I'll I'll reiterate that the picture of the first picture comes up of Tom wearing Cheryl is me and my sister Dana. So So not that is not the other one is pear. So they're searching. It said wife and it was me as Gray Fox and naked. That's true. More or less. Adam just loves himself. Oh god. Yeah. You were such a baby at times, Colin. You guys are so young. You were so young, Colin. I was young. There was a time when I was young. This was Yeah, this one with you in the bandana. That's a great one. That's when I lived in that studio in Daly City. There was a Yeah, there was a time, I think, when you first started IGN that you were like an 80s character. Like you were like the boyfriend on an 80s show. You know what I mean? Where you came you were just you just would do a guest spot like every once every like four or five",
      "start": 5295.68
    },
    {
      "text": "were like an 80s character. Like you were like the boyfriend on an 80s show. You know what I mean? Where you came you were just you just would do a guest spot like every once every like four or five episodes. And like Danny Tanner just really didn't like you that much. So wait, so he he he was like George Clooney on Facts of Life showing up at the store. Yes. Oh, right. Yes. **** I forgot about that. At the end I'm I'm trying to spin this. It doesn't matter. Like maybe you like maybe like cuz you know like the cardinal sin in the 80s was like if if the character smoked, you know, and they were like, \"We just caught DJ smoking with Colin.\" Yeah. And you'd be like, \"That's a great one. It's okay. It's okay that I'm smoking.\" That grass picture. Yeah. The shirt of you and the grass t-shirt you still wear to this day. Yeah. And the uh and my and that I think that came from when I used to write on forms that says I think like I'm the greatest writer. I am the best writer dot dot dot dot",
      "start": 5337.92
    },
    {
      "text": "you still wear to this day. Yeah. And the uh and my and that I think that came from when I used to write on forms that says I think like I'm the greatest writer. I am the best writer dot dot dot dot dot dot on the planet. Colin. I read it. That's amazing. I love that picture though. That's probably I'm probably let me see. You're like 0. No, I'm like younger than I think I'm like 17 or 18. Conflict: Desert Storm is the is this is cap from that uh fact. And then it says, \"Guide by Colin, quote, check the technique. 311 in LA, Moriarty.\" Oh, no. Chris used to Chris used to write my when I used to write for Chris, he used to write my um my bylines for me. That's awesome. There's no one I remember. That was um that was a huge mistake on your part. Letting I assume Chris Carle is what you're talking about. I think Well, cuz I think if I remember the rule. Oh, wait. This was a game. Yeah, I remember. I remember writing the show. I thought you were just doing war correspondents. I was like",
      "start": 5379.36
    },
    {
      "text": "about. I think Well, cuz I think if I remember the rule. Oh, wait. This was a game. Yeah, I remember. I remember writing the show. I thought you were just doing war correspondents. I was like, \"Damn K.\" I remember I remember that. That's weird. 17 We were covering We were covering some real **** there. Uh, no, I think I remember the rule being that when you wrote a when you wrote a guide that they would write your by line for you like you had no control over it as a joke. That was like kind of one of the running gags if I remember correctly. Seems uh bad for your for everything. Bad for your Seems like a bad bad idea. That's good. There's some I want to see like I love it's still one of my favorite pictures ever. Oh, you I love that there. Yeah. Your hair. See, this is what I'm talking about. I want I want People get so offended by that picture. I want you to come back to the Mohawk badly. He threw superior firepower and the Uzi on it. The **** Uzi smile. You still have that",
      "start": 5423.36
    },
    {
      "text": "about. I want I want People get so offended by that picture. I want you to come back to the Mohawk badly. He threw superior firepower and the Uzi on it. The **** Uzi smile. You still have that shirt? I don't fit in it anymore, but yeah, I I have it. I want you to rock that shirt for your birthday stream. Tim Gettys' text autofills to IGN, Hair, Age, Twitter, Mario, Snapchat, Instagram, MySpace, LinkedIn. **** yeah, I made it. Now when we click on the image here goes oh Tim Gettys' Cara hair, Colin Moriarty tattoo, Colin Moriarty Cheryl, Colin Moriarty hair. Yo, deal with it **** want to know about me now. See, deal with it man I can't even see this. Oh, sorry we get a whole bunch of stuff. Obviously the Kinda Funny stuff's up front because we've been really good at promoting our faces. Then there's this one. This is old one. That is an old one. I do. I miss that shirt so much. The the machine ate it. Why don't you buy a new one? My Hakuna Matata shirt. Yeah. Buy a new one. This picture",
      "start": 5462.4
    },
    {
      "text": "there's this one. This is old one. That is an old one. I do. I miss that shirt so much. The the machine ate it. Why don't you buy a new one? My Hakuna Matata shirt. Yeah. Buy a new one. This picture of me and Nick with the Cokes is one of my favorite. Yeah, I took that picture. Yeah, it was gold. **** gold. I won an award for that picture. Did you? Yeah. Wow. Best tweet ever. Colin or I'm sorry, Nick. How do you feel about him having the ring light picture you always want? That is from a video that I think I helped shoot, so I'm okay with that. I feel like that was from the 37. No, it was that was **** Electronics that'll make you feel old. Yeah, we bought a ring light for that. We bought I convinced I to buy a ring light for a two second shot that was totally unnecessary. And then you lamented that ring light for the longest time cuz it wasn't an actual ring. It was like two. It was like octagon. Yeah, it was **** **** You **** me over on that. I didn't **** you over. You",
      "start": 5510.48
    },
    {
      "text": "lamented that ring light for the longest time cuz it wasn't an actual ring. It was like two. It was like octagon. Yeah, it was **** **** You **** me over on that. I didn't **** you over. You **** me over that. I said find one that's expensive and you were like, \"Well, I found one that's $800. Then I found another one that was 7 grand. Can I give the 7 grand one?\" I was like, \"What do you think?\" It wasn't It was If you look at the picture, you can see a lot of sadness in my eyes. It looked dope. Anyway, I always like this one from Nick's Bachelor Party. You and Alfredo where you're like, \"What was it? How to party like Nick Scarpino.\" We made like a how to prep for Nick Scarpino's bachelor party um video. Yeah. Where we dressed up like Nick and Alfredo actually took a beard to himself and took your sunglasses. Yes. Where the **** are my sunglasses? I love that video. But that image is so good. That's a good video. That's good. Do you guys have the Coke shirts or did you take",
      "start": 5547.36
    },
    {
      "text": "and took your sunglasses. Yes. Where the **** are my sunglasses? I love that video. But that image is so good. That's a good video. That's good. Do you guys have the Coke shirts or did you take them back? I still have them. I see more at Eversoft than I thought. Yeah. Yeah. Then more Kinda Funny stuff. This uh Moving Mind Studios. The beer pump. which I watched a couple days ago randomly when I just **** destroyed them when I housed them. Me and Naomi. Those guys are good guys. All right. And then yeah, my Hunter Pence video. More Alexis stuff. A lot of me, Alexis, and Naomi. Well, there's a lot of us, too. But yeah, you can just girls, too. I mean, we're in it, too, but if you want to keep cutting us out, I understand. No. And also, the picture of me and Cara is like another one of my favorites where I'm the it's for Halloween. I want to say astronaut and Britney from the Oops!... I Did It Again video. One of my proudest moments. It's a really good one. You were living the dream",
      "start": 5584.24
    },
    {
      "text": "of my favorites where I'm the it's for Halloween. I want to say astronaut and Britney from the Oops!... I Did It Again video. One of my proudest moments. It's a really good one. You were living the dream that day. I was Oh, that story is great, too, where Burnie **** tweeted at me. He's like, I forgot what he said. I'm doing I'm clicking on Burnie Burns tweeted at you and just oh, sent you the Robert De Niro, though. I'm watching you. That's really funny. That's really really really funny. Makes it kind of intimidating. Burnie is a pretty powerful guy. Yeah, if you wanted to crush you, he would crush you. I already I already cut Gus. I could get him, too. So, there you go. Ronda Rousey. All right, that's us Google imaging ourselves and discussing the results and then making Kevin do a lot of post work where he's got to go through and find these. But I screen capped everything is you'll be all right. Not well. I'm so happy that just every social media feed comes after me. Yeah, ****",
      "start": 5622.4
    },
    {
      "text": "of post work where he's got to go through and find these. But I screen capped everything is you'll be all right. Not well. I'm so happy that just every social media feed comes after me. Yeah, **** yeah. Well, you know how to use Instagram and you won't tell Snapchat and MySpace. I'm running it on MySpace. That's great. Colin, yes. Take me home. Uh, so let me tell you a story and where we're going to we're going to get to is a nice nice light way to end the podcast. Okay. Mike Pope. I brought him up before I went to his wedding. I was in his wedding party. We had a great time. We were up in Connecticut in the middle of nowhere. I already told you guys I was on a bender for like three days. Now, on the night of the wedding, I told you that he lit up a bonfire by shooting a a flaming arrow into it, which is a true story. Now, we everyone was drunk and and having a great time by this point. So, we all gather around the fire, right? And we're just sitting around. I'm smoking a cigar",
      "start": 5659.04
    },
    {
      "text": "into it, which is a true story. Now, we everyone was drunk and and having a great time by this point. So, we all gather around the fire, right? And we're just sitting around. I'm smoking a cigar, drinking a beer in my suit, just laying around, whatever. I sit next to this girl. I never met her before. she's like friends with his um his wife. So, we struck up a conversation and we were going back and forth. She's like, \"Oh, what do you do?\" And blah blah blah. I'm like, \"What do you do? Blah blah blah.\" And she was saying she was um you know, we were talking back and forth and and she said something where I was like I said, you know, I just said I was like, \"How old are you?\" Mhm. And because she had said something that made it seem like she was younger, like younger than us, and we're all like in our old, you know, late 0s, early 30s. And she's like, \"Oh, you know, I'm 7 or whatever.\" I'm like, \"Oh, okay, cool.\" And then I I we we that's basically the end of the story to get me to",
      "start": 5696.4
    },
    {
      "text": "like in our old, you know, late 0s, early 30s. And she's like, \"Oh, you know, I'm 7 or whatever.\" I'm like, \"Oh, okay, cool.\" And then I I we we that's basically the end of the story to get me to to the point I'm trying to make, which was conventional wisdom. Oh, no, no, no, sorry. Uh, conventional wisdom states that there are certain things you like there's just conventional wisdom and and one of the things that conventional wisdom says is you never ask a woman her age. Sure. And um I don't ascribe to that. I think that's a stupid rule. So the what I want to talk about today is what conventional wisdom do you find to be stupid? I'll give you a couple of examples of conventional wisdom, right? Uh practice makes perfect. Not true, right? Practice doesn't make perfect. Nothing's perfect. Practice makes better was the way they got around at some way time in the late 80s, early 90s. And that just sounds stupid. So that's another that's another example. Or money is the root of all evil.",
      "start": 5733.76
    },
    {
      "text": "Practice makes better was the way they got around at some way time in the late 80s, early 90s. And that just sounds stupid. So that's another that's another example. Or money is the root of all evil. Another thing that's not true. In the words of uh uh who was it? It was uh Ben Affleck in Boiler Room. What did What did he say? No it's an awesome quote though. And it is a quote that people know if they've seen the movie. It's like uh people who say money is the root of all evil never had any. I think is is the is the is the quote which I think is like an amazing quote. Not that I agree with what he's saying. I just love that. That's like the way he nips it in the bud. That's a great movie by the way. You should watch it. Takes place on Long Island. Um so it's how I imagine most of your childhood was truth be told. Yep. Underground junk bonds selling junk bonds out of out of office parks in Masipa. Um so what do you guys can you guys think of any conventional wisdom that you don't agree",
      "start": 5770.88
    },
    {
      "text": "was truth be told. Yep. Underground junk bonds selling junk bonds out of out of office parks in Masipa. Um so what do you guys can you guys think of any conventional wisdom that you don't agree with? Just like I don't agree with never asking a woman her age because I think that's a **** stupid like that doesn't make any sense. Yeah. There there there's one that has driven me crazy all my life and it's there's no stupid questions only stupid answers. No there are some dumb **** questions I've heard in my life. Trust me I'm on Twitter. I have seen some questions where I'm like \"What is that?\" I've seen dumb some things sir. Oh yeah. I I mean there's still dumb answers. I'm not excusing the dumb answer people but like the dumb answers can go with the dumb questions and they can just all just go marry the **** off down the road right? Just that that one I just don't like cuz like that it's given people license to ask dumb questions just by the mere fact that it is a question",
      "start": 5806.8
    },
    {
      "text": "all just go marry the **** off down the road right? Just that that one I just don't like cuz like that it's given people license to ask dumb questions just by the mere fact that it is a question in in articulate questions questions that are postulated on falsehoods. Just Google sometimes too. Yeah sometimes Google. Uh anyway that's it you know. Yeah obviously the top dumb question is when is Kingdom Hearts 3 coming out. Goofy already told you this year so don't worry. I told you mother. Told you **** I've never been a fan of there's no eye in team. I understand that there has to be a team mentality but we're a team. We do all this stuff and there has to be an eye in it. You got You guys know what you need to go do you know when you need to step up. You know we all know what our roles are and how we have to go do it. Yeah. I I always hated that too especially in football because everyone's always like the QB is the most important position in any professional sport and",
      "start": 5846.96
    },
    {
      "text": "our roles are and how we have to go do it. Yeah. I I always hated that too especially in football because everyone's always like the QB is the most important position in any professional sport and I'm like yeah it is. So there is an eye in team isn't there because without a QB you can't win. So yeah I agree I agree with the I like the pre I like the preface of it or like the idea of a team mentality or what my my eye actions are doing are benefiting. You need a lot of eyes to make a team. Yeah that's Can it just be deep? Can you guys just accept that I said something? Pretend it was cool. It was really cool. Give me something. Greg there is although let's just think. Do you think certain unpleasant world leaders like say a Pol Pot like turned to someone and said to other members of the Khmer Rouge \"Hey there's no I in team. Get in line.\" All right. Come on. We're an agrarian Marxist existence right now. There's no eye in team. You got deep cuts here. Talking about economic",
      "start": 5889.68
    },
    {
      "text": "of the Khmer Rouge \"Hey there's no I in team. Get in line.\" All right. Come on. We're an agrarian Marxist existence right now. There's no eye in team. You got deep cuts here. Talking about economic theory now. I like that. Yeah. I I I always just I don't know. I love these like pieces of conventional wisdom like that just don't make any sense. Like why? Like cuz I was thinking immediately after I said I'm like I shouldn't ask. said \"I don't even know this woman.\" But then I was like she didn't she didn't give a **** Like it was clear like she didn't care. I'm I'm 37. To be fair when you're in your 0s you don't care. Yeah. But women when they hit 30 I think that's when the the stigma quote unquote effect. I'm going to make a point to ask every woman I ever meet how old they are. Immediately when I when I see it I think it I think you can then avoid it if you don't then immediately turn around and walk away. I I I'm assuming that piece of wisdom was when people really picked",
      "start": 5928.8
    },
    {
      "text": "Immediately when I when I see it I think it I think you can then avoid it if you don't then immediately turn around and walk away. I I I'm assuming that piece of wisdom was when people really picked up other people at bars is like that that was the most reliable place to meet somebody else and that is kind of like I'm doing my evaluation so I'm going to ask your age. You know there are times yeah I would like to know someone's age if I'm about to tell a story that's going to make me look really old or yeah that's pretty much it. I always I always guess I was I a good way to do it is if you want to know a person's age or you you want to you just need that for context. I shoot the age that I think they are and then I decrease it by about seven years and I'm like well I remember and I'll use the following phrase. Well I remember when I was 21 so you probably don't understand what I'm talking about. Like I'm 37. You're like oh yeah see the age thing the reason people get upset about",
      "start": 5966.24
    },
    {
      "text": "use the following phrase. Well I remember when I was 21 so you probably don't understand what I'm talking about. Like I'm 37. You're like oh yeah see the age thing the reason people get upset about you're making assumptions anyway. You just make out of them. Oh yeah. Yeah. I mean yeah people used to forget about that question. Yeah. I guess mainly women I guess that's interesting and I I think nine times out of 10 nobody had a problem with it at the paper when I because that's you know key information for your article or whatever it's always in there which is kind of weird but whatever but it's just dress the picture for the reader I guess but yeah like there occasionally be why do you need to know my age I'm like that's how newspapers work that's how you're going to be quoted and so the the I always had it there would be ones where I'd write like uh you know Jane Doe and then parenthesis f did not give age but back out to the story But I I think the part in I like this topic is I",
      "start": 6009.44
    },
    {
      "text": "the the I always had it there would be ones where I'd write like uh you know Jane Doe and then parenthesis f did not give age but back out to the story But I I think the part in I like this topic is I think that it's not that people live by these you know axioms and stuff like that but they're used to kind of stop a conversation especially like I and team you know I've seen that where it's like the one guy thinks that everyone else is doing something wrong. It's like well hold on what's with the individualism here you know get in line. Right. And I and I do find it very frustrating because it's kind of like no we've already made a social contract that we've agreed that these silly phrases actually carry the weight of truth. Yeah. I don't I can't even really think of too many other ones that I would disagree with. Like the only ones that come to my head are like you don't know what you got till it's gone and which is which is a good one. Yeah. Um I know build it and they will come.",
      "start": 6043.2
    },
    {
      "text": "that I would disagree with. Like the only ones that come to my head are like you don't know what you got till it's gone and which is which is a good one. Yeah. Um I know build it and they will come. The Field of Dreams one that's just a dumb. No build it. Well then maybe it'll get Instagrammed. Build it and they will Okay sure. Go right ahead builder. What about grass is greener on the other side? Yeah that is a good one too. That's a I actually think grass the grass is always greener is a great one because it is true. Yeah I heard I used to I look at Kevin's life and I'm like \"No it's not greener.\" Well that's like right in front of you. That's That's literally I heard this is kind of a non sequitur for that but I used to shoot a lot of uh weddings back in the day when I was first getting my footing underneath me as a uh as the premier video producer that I am today. Um and I heard it's a cheesy as **** but I heard a priest say like he's like \"A lot of people say the",
      "start": 6086.16
    },
    {
      "text": "getting my footing underneath me as a uh as the premier video producer that I am today. Um and I heard it's a cheesy as **** but I heard a priest say like he's like \"A lot of people say the grass is always green on the other side.\" He's like \"No the grass is greener where you water it.\" And that stuck with me. I'm like \"That was really cheesy but really true.\" Did you just have like one of those moments you just came as they're about to kiss? I'm like **** groovy man. Do you have any Do you have any uh I can't think of anything that offhand that I would say don't I don't I disagree with um never judge a book by its cover I think is probably a pretty good one maybe there are good ones there are good ones uh I'm trying to think of any that I can't that I sort of disagree with all of them that are coming to my mind are are just sort of the cliche bird in the bush hand two in the bush that's a good one what are the ones to disagree with potentially yeah I'm trying to think of",
      "start": 6127.28
    },
    {
      "text": "of them that are coming to my mind are are just sort of the cliche bird in the hand, two in the bush that's a good one what are the ones to disagree with potentially yeah I'm trying to think of bad ones or just bad conventional wisdom I'm going to look maybe like you should if you have a really good paying job that's got security you should stay there forever might be one doesn't I've never heard that one that's a little long you might want to make that a little I believe that's \"bird in the hand\" I don't know that actually maybe that is that is a good one to look into \"the bird in the hand is worth two in the bush\" right is is that that opportunity that's right or I guess the the the one you have already one you have already is worth this is taking a shot but I feel like that might be one that I I fundamentally now disagree with a little bit because I very risk averse. It's very much saying like do the safe thing all the time which is what we always sort of have to promote so that",
      "start": 6171.04
    },
    {
      "text": "one that I I fundamentally now disagree with a little bit because I very risk averse. It's very much saying like do the safe thing all the time which is what we always sort of have to promote so that hordes of angry unemployed people don't it's still saying there's two in the bush like you can still get them you know it is a risk thing. Yeah. Have you tried to get two birds in a bush? No. It sounds impossible to me because like they they know the inside of the bush. You're like what I'm doing and this is my this is where we draw the line. What about no pain, no gain? That's one that's popping up. That is unfortunately true. **** That's true. And that's I don't think it's true at all. I do think it's true. I got Kevin for that. I do I do think no pain, no gain is is probably true you know like mostly true. Like when have you ever gained without really because it's not saying you're in literal pain. It just means that like you have to try. Okay. For what it's saying I guess. But but",
      "start": 6212.0
    },
    {
      "text": "like mostly true. Like when have you ever gained without really because it's not saying you're in literal pain. It just means that like you have to try. Okay. For what it's saying I guess. But but the phrase is used usually when you're complaining about pain but you have not been established that gain is going to be accomplished. Yeah. It's more or less like hey go out. I mean it's it's kind of like what what uh in Karate Kid he's playing a no pain, no gain on him. He's really just getting you know free work out of him. Yeah. He then learns to get karate and gets the lady. Miyagi is Yeah. getting some of that that that labor though. I don't know. No pain, no gain more or less. Sounds like that's what you can get away with abusing interns. Hey no pain, no gain. I think Fox got in trouble for that. Pain no money. Yeah. Okay. Bye. Thanks. So here's some credit. Here's some credit. I go have fun. Good luck. Do you find anything else Greg? No. A lot of these people are just",
      "start": 6252.48
    },
    {
      "text": "in trouble for that. Pain no money. Yeah. Okay. Bye. Thanks. So here's some credit. Here's some credit. I go have fun. Good luck. Do you find anything else Greg? No. A lot of these people are just making **** up. Like I'm reading I'm like that's not No one's ever said that's conventional with I'm clicking around too much. Next next terrible one I find. I'll let you know. Okay. We're at MagpieGirl.com right now to see what they have to say. Magpie Girl. Here we go. Eight **** conventional wisdoms. I sound like my mother. You should try to stay the size you were in high school. This see this is now is that a horrible number five. You need good grades. Wait can we go back? That's not conventional wisdom. You do. Sorry I got to go back to you need to stay the same besides you're in high school. That is I've never heard that. I'm so bad in high school. It's not a real book unless it's printed by a real publisher. What? These aren't conventional wisdom. All right. Is there another piece",
      "start": 6293.36
    },
    {
      "text": "school. That is I've never heard that. I'm so bad in high school. It's not a real book unless it's printed by a real publisher. What? These aren't conventional wisdom. All right. Is there another piece of commercial wisdom there that just says **** you? That's all I'm really hearing there. What the **** CBS Money Watch has eight nine bits of conventional wisdom you should ignore. This is going to be about money. Trying to find one. Don't just stand there. Do something. All right. And on that note I'm saying right now Colin you go get conventional wisdom.com. You put a list of conventional wisdom. You'll be fine. That's all you got to do. You make a million dollars right there. All right. All right. Good to know. Ladies and gentlemen this topic was brought to you and sponsored for you by KindaFunny.com/store. Go there. Look at the t-shirts. Maybe buy a poster. Look at the new coffee mug. Nick worked on all of them. I did. Give Nick a round of applause at your computer right",
      "start": 6338.56
    },
    {
      "text": "you by KindaFunny.com/store. Go there. Look at the t-shirts. Maybe buy a poster. Look at the new coffee mug. Nick worked on all of them. I did. Give Nick a round of applause at your computer right now. I'll wait. Thank you. You're too kind. You're too kind to Nick. Ladies and gentlemen this has been The GameOverGreggy Show. Each and every week four sometimes five best friends gather on this table. Each bring a random taco discussion for your amusement. If you like that head over to Patreon.com/KindaFunny and toss us a few bucks to get every episode early. If you have no bucks to toss no big deal. Go to YouTube.com/KindaFunny where we break it up topic by topic day by day until we post the entire thing for free on of course YouTube and of course iTunes and other podcast services. But go to iTunes.com/KindaFunny. Subscribe to everything. Rate everything. It helps us out because you were saying last week it's been years since people subscribed to this show. Yeah. With specifically",
      "start": 6389.92
    },
    {
      "text": "go to iTunes.com/KindaFunny. Subscribe to everything. Rate everything. It helps us out because you were saying last week it's been years since people subscribed to this show. Yeah. With specifically The GameOverGreggy Show. If you listen to it in any other way like YouTube or on Patreon or whatever just go over to iTunes and subscribe. Even if you don't listen to it there just just do it for me please. Oh just for Tim. Yeah thank you. Uh of course everyone needs to go watch Lumberjack Man. Yes. Our good friend Adam Lumberjack Man like I said it's in a few big cities. Uh Chicago Boston. If you go to 8 Films to Die For you have a list of us playing in in your hometown. But more importantly it's available on VOD. I know there is a home video release but I think that may be a week or two off. So go check it out. You know you can hit the red or you could hit the buy on the VOD because then you could relive the magic which I think there's a",
      "start": 6425.44
    },
    {
      "text": "but I think that may be a week or two off. So go check it out. You know you can hit the red or you could hit the buy on the VOD because then you could relive the magic which I think there's a reason to relive it. I think you want to watch this with your friends. If you live in Colorado or Washington you know what to do. Adam it's a pleasure. Thank you so much for coming by. You're on the Gamescast too. So go listen to the Gamescast as well. Until next time it's been our pleasure to serve you. I I I can bring it up here. Well I know. I'm just bringing up my rundown too. Mhm. Mhm. Mhm. Okay. And you're happy with every Do we need Do we need to Because this chair is sagging. Is this chair sagging or no? No I think it's good. Okay great. Just make sure thing looks good. No I'm sagging. The chair's fine. Don't Don't put it on the furniture. Oh god. Here we go. Hold on real quick. I'm not going to hold on real quick. You son of a **** I mean you're you're you're third. You",
      "start": 6463.04
    },
    {
      "text": "The chair's fine. Don't Don't put it on the furniture. Oh god. Here we go. Hold on real quick. I'm not going to hold on real quick. You son of a **** I mean you're you're you're third. You got plenty of time to do. All right. All right. I'm good. Just let me know. Freaking good right now. Go for it. Kevin put all that at the end so everybody knows that Nick held up the show and they wonder why this episode starts on us being so sour. Thank you Kevin.",
      "start": 6504.0
    }
  ]
}
