{
  "id": 1247,
  "video_id": "uOh8x6w9UkQ",
  "show_name": "The GameOverGreggy Show",
  "hosts": [],
  "title": "Should You Travel? - The GameOverGreggy Show Ep. 96 (Pt. 1)",
  "description": "Special guest Jacob Spellman wants to know what we think about travelling.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1444028403,
  "duration": 2252,
  "transcript_chunks": [
    {
      "text": "Good evening ladies and gentlemen. It's I Greg Miller, co-founder, CEO of KindaFunny.com, here on the set of the Kinda Funny Gamescast. And you may be saying \"This is an awkward beginning to The GameOverGreggy Show.\" And I agree with you. It is an awkward beginning to The GameOverGreggy Show. I come with terrible news for you ladies and gentlemen. Uh, today Kevin opened up his computer and discovered that he did not have the first five minutes of our show for The GameOverGreggy Show. Now, at which point we said, \"Oh, Kevin, how cute. I'll open up the backup files and get the first five minutes of The GameOverGreggy Show.\" I opened up the backup files. No five minutes. The first five minutes gone. And now you might say, \"You didn't click record.\" We clicked record. The numbered files show that there was a file before this file, but it mysteriously disappeared without any interference from anyone else in the world. And so the Lord Jesus Christ himself came down and smacked",
      "start": 13.76
    },
    {
      "text": "files show that there was a file before this file, but it mysteriously disappeared without any interference from anyone else in the world. And so the Lord Jesus Christ himself came down and smacked this file back down to hell. And I wish I could explain when this happened. I wish I could have seen him do it. I wish maybe that I wasn't having sex out of wedlock all the time. And this is why he was punishing me like this. But some things can't change, ladies and gentlemen. And we've lost the first five minutes of The GameOverGreggy Show. Now you might say no big deal. The first five to seven to 0 to 30 minutes of The GameOverGreggy Show every week are just **** It's just you guys sitting around talking about mocha lattes and whatever the hell Kevin's mad about this week. But here's what I'll tell you ladies and gentlemen. This is an especially bad time. Kevin, how many shows we've done? 96. 96. This is the 96. God dang it. We've never had something like this happen before. You say, \"Ah",
      "start": 54.48
    },
    {
      "text": "tell you ladies and gentlemen. This is an especially bad time. Kevin, how many shows we've done? 96. 96. This is the 96. God dang it. We've never had something like this happen before. You say, \"Ah, no big deal. We've had a lot. We screwed up something for Jacob Spellman.\" Jacob Spellman went over to Patreon.com/KindaFunny to come be on this show. That's right. One out of 96 times we had to screw up the one time we had somebody who paid to come be on our dumb show. So ladies and gentlemen, welcome to the show. Jacob Spellman. Yay. Hey, Jacob. How are you doing? Good. How you doing? Good. How mad at me are you? I'm not mad at all. You guys have technical difficulties over there all the time, so it's not a big surprise. Yeah, but the that's not an excuse. Like I hate the technical difficulties. I hate that that's an excuse for us that that's one of the reasons and the garbage truck on fire and all that. It's not cool to me. Damn it. Well, it's fine to be part of the process. At least I",
      "start": 91.92
    },
    {
      "text": "I hate that that's an excuse for us that that's one of the reasons and the garbage truck on fire and all that. It's not cool to me. Damn it. Well, it's fine to be part of the process. At least I got to be part of one of the the malfunctions. So it's all Well, I mean that's true. You're on a show that's making history. This has never happened. I'll tell you right now, there's never been a GameOverGreggy Show that opened with a guest. That's a one-on-one Skype interview. Yeah. So So luckily, like I said, we only missed the first five minutes of this show. So we just missed the normal rambling trash we talked about. So tell me, what did we talk about? What was our rambling trash? What were we talking about? Uh, I think Colin was talking about the word brick and how it hails from the East Coast. You're right. That was the thing cuz it was cold. We were talking about Grimecraft had been on the last show and words that words that had been invented but because he's lit and sus and then",
      "start": 132.4
    },
    {
      "text": "Coast. You're right. That was the thing cuz it was cold. We were talking about Grimecraft had been on the last show and words that words that had been invented but because he's lit and sus and then Yeah. Colin did invent brick. Yeah. And he he says out in the East Coast it's cold. It's it's brick. It's it's brick cold out there. Nick was confused because he thought it was just a basketball term which I was in the same boat whereas when you miss a shot you throw up a brick. So exactly that's what I thought too. There's some you know some real deep conversation going on there. Yeah. So that honestly that's pretty that's a 30 second synopsis of everything you people missed out in YouTube and MP3 land. So not that much which is great but I would have gone producer/seducer Nick Scarpino. I would have gone Pure One Tim Gettys. I would have got Prolog Island Colin Moriarty and I would have said a special guest Jacob Spellman. Jacob Spellman, what's up? I I don't feel like we really we didn't",
      "start": 166.56
    },
    {
      "text": "I would have gone Pure One Tim Gettys. I would have got Prolog Island Colin Moriarty and I would have said a special guest Jacob Spellman. Jacob Spellman, what's up? I I don't feel like we really we didn't touch on this. It all happened so fast your episode. They all go there's like sand through our hands every time. Number one, where you from? I'm from uh Pacific Grove, California. Number two, why did you why did you give us money on Patreon.com/KindaFunny to come be part of this show? Oh, I just uh like what you guys do. Um, you guys have started up a big um, just kind of a project based off of passion. Um, and I'm I'm passionate about well the subject that I brought up was was travel. So I don't know. It was just something that I felt was important and um, I think my big thing was just I was confused why Americans don't travel as much. So I just wanted to talk about it. Now you say that. Yeah. And like that's what's interesting and part of your intro. Oh, my topic's travel. I'm confused",
      "start": 205.04
    },
    {
      "text": "confused why Americans don't travel as much. So I just wanted to talk about it. Now you say that. Yeah. And like that's what's interesting and part of your intro. Oh, my topic's travel. I'm confused why Americans don't travel more. Uh, I follow my passion and my passion is travel. You say that and it sounds like just like, oh, people like to travel. Sure, Troy Baker goes a lot of places. But you like you you tore apart your life. That's one you're this fascinating individual. You tore apart your life. You So you you go to college and you where do you go to college? I went to Sonoma State University. Go see. You get a degree in what? What's your degree in? Business management and human resources. So then you leave and you just start making money hand over fist. Oh yeah, definitely. But yeah, it's better better money than uh Yeah, it was pretty it was it was good enough. Yeah. So then So how long did you go into you leave you go into this corporate job and like what happens? Uh I just I",
      "start": 244.72
    },
    {
      "text": "it's better better money than uh Yeah, it was pretty it was it was good enough. Yeah. So then So how long did you go into you leave you go into this corporate job and like what happens? Uh I just I don't know. I just had I realized that I wanted to I always wanted to travel and I I didn't do it but I'd saved up all this money to do it. So I mean there's no time like the present, so I just quit, bought a one-way ticket and went. That's not what people do, Jacob. That's not You go to You don't go to work for two years and then decide I've saved up money to travel. You saved up that money for your life, son, for what's going to happen next. I'm going to go travel more. Oh my God. So, yeah. Yeah. You tear up you go into this corporate life and then you decide to blow it all up. Tear it apart. Yeah. I want you to know that I I talked about you on the Super Knock and Boots podcast cuz I went and recorded that the next day and I talked about how I'm here's the the silver lining to this whole",
      "start": 285.44
    },
    {
      "text": "Yeah. I want you to know that I I talked about you on the Super Knock and Boots podcast cuz I went and recorded that the next day and I talked about how I'm here's the the silver lining to this whole fugal is the fact that we still have your topic. We still have your topic in full because I was enraptured with everything you said on this. It's rare that I meet someone cuz I nobody comes to my house anymore, but it's rare that I meet someone whose story is so crazy that I got to sit back in awe and listen to it. You get a job. You got you're you're doing everything right, Jacob. You're working out clearly. You're being sexy. All these girls like you. They love you. You go to college. You get the degree. You get a good job. You start making money. Then you're supposed to get married, have a kid, get a house, get in crippling debt. The kids move away and don't talk to you anymore. Then you slowly start to die. That's the path. Yeah. It's the dream. The dream. But when did you know that",
      "start": 324.24
    },
    {
      "text": "a kid, get a house, get in crippling debt. The kids move away and don't talk to you anymore. Then you slowly start to die. That's the path. Yeah. It's the dream. The dream. But when did you know that it was time to shake off the regular dream and travel the world? Um, it's just something that I I want to do. one of my good friends talked to me about it and I'd always kind of had in the back of my mind, but he really sold it to me. So, I was hoping I could just maybe come on your show and maybe do that the the same thing for all the people out there. Well, ladies and gentlemen, that's exactly what he did. If you didn't know, this is The GameOverGreggy Show. Each and every week, sometimes one and one person through Skype get together and bring a random topic of discussion for you. If you like that, head over to Patreon.com/KindaFunny. give us some money and you get each and every episode early. Then if you don't want to give us any money, we totally understand. Head over to",
      "start": 364.24
    },
    {
      "text": "you. If you like that, head over to Patreon.com/KindaFunny. give us some money and you get each and every episode early. Then if you don't want to give us any money, we totally understand. Head over to YouTube.com/KindaFunny. We get every topic broken out day by day, topic by topic until we post the entire thing for free. I didn't do the table pound by the right way because it's just depressing that you're not here to pound on the table with me, Jacob. Yeah, I appreciate that. I missed it anyway, so it's all good. I know that's the we we can hide that. And maybe I won't spoil it. Maybe at the end of the episode, Jacob pounds it out like that business. Of course. Just throwing it out there for you. So, we now join The GameOverGreggy Show in progress where Jacob is just caught up on the fact that yes, he had this perfect life with money and security and he decided to throw it all away and travel the world. Jacob, thank you. Thanks, Greg. It's always a pleasure. And thank you, ladies. It's",
      "start": 401.12
    },
    {
      "text": "yes, he had this perfect life with money and security and he decided to throw it all away and travel the world. Jacob, thank you. Thanks, Greg. It's always a pleasure. And thank you, ladies. It's always a pleasure with you, sir. Let's join the show. It's not the best decision. Yeah, it's just really bad. No one tells you how bad it is. So, uh, so I just kind of went on this epic quest of avoiding adult responsibilities. I bought a one-way ticket to Southeast Asia. I tooled around there for like six months. I got a working home. Wait, wait, wait, wait. Did you have like a house? Did you know where you were going? No. No. I just bought like a ticket and just kind of figured it out. Just went. Yeah. So, I was like, maybe I'll stay for three months, maybe six. Uh, a year and a half later, I finally came home. How much did you have money going into this? Oh, yeah. Yeah. I mean, I I didn't have a life when I worked my corporate job, so I saved up a lot and I was like, \"Okay, maybe I should",
      "start": 438.16
    },
    {
      "text": "came home. How much did you have money going into this? Oh, yeah. Yeah. I mean, I I didn't have a life when I worked my corporate job, so I saved up a lot and I was like, \"Okay, maybe I should spend this.\" That How much money do you need to to be able to make that type of thing? Cuz I know a lot of people that are trying to go to do trips and they're like, \"They're saving. And it sounds like it's a **** ton of money. It's not a lot. No. No. It's like if you go to like third world countries and stuff like that, it's super cheap. Like that's not necessarily for everyone. If you're going to Europe or something like that, it's definitely more expensive. But I did I lived in Australia for a year and uh boy just like that. It's exactly how they sound. The epitome of the third world country. Yeah, exactly. Australia. Why they call it down under? This is true. And uh I had a working holiday over there. So I actually worked while I was over there. And places like that you need some sort of",
      "start": 477.6
    },
    {
      "text": "Yeah, exactly. Australia. Why they call it down under? This is true. And uh I had a working holiday over there. So I actually worked while I was over there. And places like that you need some sort of income to be like travel around. But uh yeah. So now what type of work did you do? Uh so my first job my first job there was a a door to door salesman. So I uh I did that and then uh but most what were you selling? Uh groceries. This is this is where Yeah. It's a it's like a it's like a a delivery service. They deliver That's not a salesman. It's a delivery service. No, no, but you you have to sell the service to people. So you're going around knocking on people's doors. I just I basically used it like they gave me an iPad with internet so I would just go to a park and look for other jobs while I was there. But like it was just basically I just knock on people's doors. They'd invite me in. I'd be like, \"I'm not going to sell you this.\" But I just I need the money. So I would do that. How",
      "start": 508.0
    },
    {
      "text": "I was there. But like it was just basically I just knock on people's doors. They'd invite me in. I'd be like, \"I'm not going to sell you this.\" But I just I need the money. So I would do that. How many like housewives open the door and they were like in negliges and such? Not a lot. No. Not a lot. No. No. At some point did the following happened. Okay. You had sex with a housewife. I did not have sex with the housewife. House. I know. I know. No. House husband. I guess 18-year-old or I guess the house. The house. Yeah. What are you doing? Get out here, you crazy American. Giving us all a bad name over there. Yeah. Well, I have a question about this, too. Okay. You weren't trying to sell, but did you make any sales anyway? Yeah, I did. Of course. I mean, it's a great service already. I can tell you. Oh, yeah. It's burning hot outside. I don't want to go outside in Australia. You just send me the food. You get a sunburn just by walking around. I guess she might get attacked by a",
      "start": 548.32
    },
    {
      "text": "I can tell you. Oh, yeah. It's burning hot outside. I don't want to go outside in Australia. You just send me the food. You get a sunburn just by walking around. I guess she might get attacked by a kangaroo. They're very vicious. Is that true? Are they just chilling? They just They're there. Yeah. Yeah. Okay. Do you see any kangaroos? You make any friends? I worked on a golf course, too, and there was like kangaroos everywhere. It's like Jurassic Park. They just kind of like hopped around and stuff this time. That's the best statement ever. There's kangaroos everywhere. Eyes. I just drive around my little cart, you know, around the golf course and there just be like a herd of kangaroos just hopping next to me. It's tight. Yeah, that that sounds tight. I like that. And then till they eat each other. They're vicious. Kangaroos, I mean, they they seem like they can **** you up. I've never seen one **** up, but like you see them sometimes. I've seen pictures. I haven't ever actually",
      "start": 582.48
    },
    {
      "text": "each other. They're vicious. Kangaroos, I mean, they they seem like they can **** you up. I've never seen one **** up, but like you see them sometimes. I've seen pictures. I haven't ever actually seen a kangaroo, but they look like freaking wrestlers. Yeah, they're jacked. They got They're jacked as **** Yeah, that's where the whole boxing thing comes in. Yeah, box a kangaroo. Yeah, but they're not the they're not the scary thing. There's they're scarier stuff in Australia. Spiders. Spiders. Yeah, spiders. Yeah, I had a huntsman spider in my house and they're like literally like this big. So, at evacuate the premises at that point, does the thing just get your house like, \"Oh, you won.\" Like, you got They became new roommates. They were just kind of like hanging out here, hanging out there. Yeah. Oh, no thanks. Did you How did you react to this? No, I tried to kill it, but you can't kill them. Unless you don't want you don't want to do you don't want to **** with those things.",
      "start": 612.72
    },
    {
      "text": "there. Yeah. Oh, no thanks. Did you How did you react to this? No, I tried to kill it, but you can't kill them. Unless you don't want you don't want to do you don't want to **** with those things. Spider catches the axe. You see you like you've seen the picture of like them or like the video of them like jumping off the walls of people like people trying to catch them, right? Have you seen those? No. No. That was bad. Yeah. Like slowly coming up and it jumps. Yeah. Good topic. Next topic. That's terrifying. Getting anxiety over here. Yeah. That's terrifying. I hate spiders. Well, was there was there any cool animals? Oh, yeah. Like there's echidnas. Uh, Knuckles. Yeah. Yeah. Only he doesn't look anything like that. Oh, I don't I don't know what a real echidna looks like. Yeah. He's kind of a dumb looking hedgehog. Yeah. Yeah. Knuckles. Well, Australia has been isolated. All sorts of weird animals that evolve there. Yeah. The man of war, I think, is in the ocean right over there, too.",
      "start": 648.64
    },
    {
      "text": "a dumb looking hedgehog. Yeah. Yeah. Knuckles. Well, Australia has been isolated. All sorts of weird animals that evolve there. Yeah. The man of war, I think, is in the ocean right over there, too. The the the most deadly the man of war. The man of war. It's a deadly like small octopus. The little jellyfish. Yeah. The small jellyfish. Yeah. It's as big as your like your pinky. Like I went to it **** kill you. Yeah. I went to this place and they're like, it's like this beach and like, \"Okay, you can go in the water, but here's your sting suit, so put that on before you go.\" You're just like dressed in like all black like No, see right there. I'd be like, \"You know what? No, I'm good. I'm just going to go in the water.\" Yeah. I don't need a sting suit. Thanks. I'm good. Not going to get in there. It's like, hey, here's, you know, you're going to Starbucks. Here's your bulletproof vest. Throw it in there. All right. So, sorry. Southeast Asia. Yes. But wait, wait, wait. We're",
      "start": 686.08
    },
    {
      "text": "to get in there. It's like, hey, here's, you know, you're going to Starbucks. Here's your bulletproof vest. Throw it in there. All right. So, sorry. Southeast Asia. Yes. But wait, wait, wait. We're Australia's not Southeast Asia. So, I'm curious where I'm curious where you in the Indiana Jones. So, okay. Well, you want to know how I got to Australia? Is that Yeah, back up a little bit cuz you were talking about third world countries and all that kind of stuff. Australia is not count. It's very developed. Yeah. So, I'm curious, what did you go to? Like Vietnam or Laos or something like that? Uh, I went to Thailand, Cambodia, Laos, uh, Malaysia, Singapore, and Indonesia. Wow. So, pretty much everywhere. Yeah. How many tuk tuks did you take? A ton. Yeah. Too many. Yeah. Tuk tuks are awesome. I know what you're talking about. They're little uh like motorcycle cabs, basically. Motorcycle basically. Yeah. Yeah. So, and how much how much did it like All right. So, Malaysia, how much did it",
      "start": 718.8
    },
    {
      "text": "I know what you're talking about. They're little uh like motorcycle cabs, basically. Motorcycle basically. Yeah. Yeah. So, and how much how much did it like All right. So, Malaysia, how much did it cost you to live there for a month? Like, it's not it's not expensive. Like, but what what is your quality of life when you're in Malaysia? Not not spending money cuz this is why Let him answer the question. Let him answer the question first. I'm curious about the number. He's taking no further questions. There's you can stay in hostels which aren't that bad. Like if you want to stay in a place where there's a bed and air conditioning, you can probably spend like roughly probably like $6 a night. So like so staying there like if you really want to spoil yourself like $10 a night will get you like a really nice place. Holy **** Yeah. Like you you can just like it's really just a place with a high barrier to entry because the plane ticket is what the big cost is. Once you get there it's just",
      "start": 751.36
    },
    {
      "text": "a really nice place. Holy **** Yeah. Like you you can just like it's really just a place with a high barrier to entry because the plane ticket is what the big cost is. Once you get there it's just kind of you can just do whatever you want. So yeah, it's really cheap. like doing anything is like my first month in Thailand, I didn't even hit my rent that I was playing paying up in Santa Rosa. So like my just my month my rent alone up like in California, I didn't spend that my first month over there. So wow, it's it's super cheap. It's affordable. You can still do a lot of cool **** while you're over there and cuz it's so cheap. And then uh yeah, there's just a lot of lot of stuff to do. And then like the best part I mean there's there's cool stuff to do, but like the best part of it is is meeting people. Like it's a really good way to interact with people. you're kind of separated from technology and everything and you can just kind of connect with people in different ways and it's",
      "start": 789.36
    },
    {
      "text": "is meeting people. Like it's a really good way to interact with people. you're kind of separated from technology and everything and you can just kind of connect with people in different ways and it's just good for like globalization everything like you get to see how other people do live their lives and you get to meet people from like I didn't I didn't really understand like what was different between British people and Australian people until I actually met them I was like I was just like United States only they talk funny it's a lot it's a lot different it's a lot different UK or in Australia both well I I met UK people over there cuz they're they're everywhere so yeah so it's good to just kind of meet people from different countries and actually be able to talk to them and connect to and through travel and everything. So, it's fun. So, you're bouncing around and you're just like whenever you get sick of a place, you're like, I'm going to move on to that place. Yeah. It's like",
      "start": 824.72
    },
    {
      "text": "to and through travel and everything. So, it's fun. So, you're bouncing around and you're just like whenever you get sick of a place, you're like, I'm going to move on to that place. Yeah. It's like Colin, I know you always talk about like you want to retire and you just want to be like not have to do anything. It's like that as soon as possible. It's like that. I did that for like a year and a half. You just wake up and you're just like, well, what am I going to do today? And you can just maybe I'll read all day. Maybe I'll go do this, do this, maybe I'll get on a bus to the next place. It's just you're just kind of at your leisure. You can do whatever you want. Were you just living out of one backpack? Yeah, I had a 45 liter backpack and I lived out of that for a year and a half. Jeez Louise. Yeah. So that would be See, I wouldn't be able to exist in that. I would get decision paralysis. I There's too much stuff to do I would just end up doing nothing every single time. Just like",
      "start": 856.24
    },
    {
      "text": "Louise. Yeah. So that would be See, I wouldn't be able to exist in that. I would get decision paralysis. I There's too much stuff to do I would just end up doing nothing every single time. Just like Netflix. Yeah. Where I've got too many things, too many options to pick from and I would be I would be useless. I need structure. I need to know that if I don't have like 50 things to do, like if I don't have Tim and Greg and Kevin at midnight saying, \"Hey, I need this lower third name bar for our guest that I totally forgot to ask you about before you left, but now I'm going to interrupt you during your uh wife time.\" Yeah, midnight's wife time, right? Midnight's not wife time. Midnight's key prime wife time. No, not for Nick Scarpino's wife. Yeah, my wife knocks out like 9. No, that's that's like midnight. Midnight's right around the time I'm going to bed. 11:00 is more like play video game time. Um, so yeah, but that's my thing. I like that that's the thing with me in travel is that it",
      "start": 887.68
    },
    {
      "text": "like midnight. Midnight's right around the time I'm going to bed. 11:00 is more like play video game time. Um so yeah but that's my thing. I like that that's the thing with me in travel is that it it seems harder than it needs to be. Like it seems like you would get out there and then you just have to make a bunch of decisions. You have to figure out how to feed yourself and then if you screw up you you'll die or get put into a Thai prison. You know that's the thing that's like a lot that was like the biggest thing I heard when people like when I got back like \"Well weren't you scared?\" Like I mean if there was somebody that should have ended up dead in a cave with all their organs being sold on like on the black market is me. Like I'm like 5'8. I weigh 130 to 135 pounds. Like these flyweights aren't fighting anybody off. Like I I Yeah. But it's just like it's not you are not you are not in any danger like at all while you're over there. I'm not. I wouldn't be so much",
      "start": 925.76
    },
    {
      "text": "these flyweights aren't fighting anybody off. Like I I Yeah. But it's just like it's not you are not you are not in any danger like at all while you're over there. I'm not I I wouldn't be so much worried about that because as we all know I have martial arts training. Shadow boxing boxing. I mean I'm you know number one in the nation so far. Number one in the nation shadow boxing so far. I mean you know it's the world keeps moving as Colin will tell you from east to west. But I would be more worried about not being able to I would be more worried about getting into a position where I'm like \"Shit I'm out of money and now I have to sell my body.\" That happened to the night. That that happened actually cuz like when I went to Australia let's talk more about that. The the running out of money part. I didn't have to sell my body. But yeah when I was uh cuz when I decided to go to Australia um I I it was kind of like a last minute decision. So like I I knew some British guys like",
      "start": 960.4
    },
    {
      "text": "money part. I didn't have to sell my body. But yeah when I was uh cuz when I decided to go to Australia um I I it was kind of like a last minute decision. So like I I knew some British guys like \"Oh we're just going to go to Australia and work there.\" And I was like \"Okay I'll go there.\" And I arrived in Australia with $700 and that's not enough money to survive in Australia with for very long. So I ran out of money pretty quick. And I got to a point I landed a door to door sales job like right when I had paid off my last week at my hostel. So I had $0 in my pocket. And I went like I went down to my hostel. I remember I just like I bought like this bag of salt and vinegar chips. I just sat on sat on my couch. I'm like \"Huh it's going to be interesting how this plays out.\" And uh it's I started my job the next day. I did the door to door sales thing. I made enough money to pay off my hostel and I had $5 to buy food and I just did that until I found another job.",
      "start": 1003.2
    },
    {
      "text": "out.\" And uh it's I started my job the next day. I did the door to door sales thing. I made enough money to pay off my hostel and I had $5 to buy food and I just did that until I found another job. And then uh I just kind of worked my way back and started traveling around Australia. So the first the first month there was pretty rough. But uh And then when you're traveling are you getting jobs in these other places that you're you're staying or not in like not Well yeah like in Australia. Yeah. So I I lived in Perth, Melbourne, and Sydney. And then I kind of traveled around to like Brisbane, Cairns, and uh what's it called? Tasmania as well. So but yeah. Yeah. Every time I went to like a city and like I'd stay there for like three to four months and just kind of work and save up. So you just found something something to kind of keep you going. Yeah. I had like a a bar job. Like in the pay in Australia is insane. Like if if you're young and you live in America or the UK I'd",
      "start": 1041.04
    },
    {
      "text": "you just found something something to kind of keep you going. Yeah. I had like a a bar job. Like in the pay in Australia is insane. Like if if you're young and you live in America or the UK I'd really recommend like just trying to check out like um like a working holiday visa in Australia. It's like if you're under 30 you can go and live there a year if you're American two years if you're from the UK. And uh shit That's some shit right there. Well we make it we make it impossible to get in this country legally of course. But I I just think that everyone hates Americans. That's why we're number one right Colin? We are number one. But makes sense. They're in the Commonwealth. It's weird. The Queen of England has won all their money which is weird but whatever. But yeah it's it's it's cool to check out like the uh like the pay in Australia is insane. I I worked a job as a just like a like I worked at a bar and I would just pick up empty glasses and make",
      "start": 1078.0
    },
    {
      "text": "But yeah it's it's it's cool to check out like the uh like the pay in Australia is insane. I I worked a job as a just like a like I worked at a bar and I would just pick up empty glasses and make fun of drunk Australians and I'd made like 3 to $45 an hour. What? Yeah. Like depending on the holidays like if I worked on holidays 45 it was on the weekend it'd be 35 and just any other day I'd be making 5. So I lived in Sydney I was working maybe three days a week like three days a week and I would just be able to live. And it wasn't like I was living a luxurious life. I don't want to throw that out there. But if I worked like more I probably could have been living pretty well. But just for what I wanted to do just kind of like cruise around just to subsidize. That's awesome. Did you have a girlfriend going into this? Do you have a girlfriend now? No. No. How was it? How was that experience not having a girlfriend being single? That's good. Around the world. Oh it's good. That's",
      "start": 1114.64
    },
    {
      "text": "a girlfriend going into this? Do you have a girlfriend now? No. No. How was it? How was that experience not having a girlfriend being single? That's good. Around the world. Oh it's good. That's good. Real good. That's fun. American accent. I feel like it goes without saying that you didn't have a girlfriend or a significant other. I don't know. There's no way that I can live for $700 a day with my wife. I need more than that. If we were like for instance you talk about how it's how it's cheap to travel to Thailand. Not my experience when I was on my honeymoon. Yeah. Well it depends. Probably because I stayed at the Four Seasons. Yeah. If you're staying in nice places then you're kind of taking that out the window. That was a pain in the ass. I was like \"Oh it's going to be so cheap when we get there.\" But how much was it? The Four Seasons. We got a deal where I think we paid everything ahead of time and it was roughly And I'm ballparking. Ballparking 400 a night. Okay. Yeah.",
      "start": 1149.76
    },
    {
      "text": "when we get there.\" But how much was it? The Four Seasons. We got a deal where I think we paid everything ahead of time and it was roughly And I'm ballparking. Ballparking 400 a night. Okay. Yeah. It might have been more for the weekend. It's your honeymoon. No we splurge. To be fair yeah we saved and we splurge. It's not something we're going to do all the time but that's my You're only going to do that once maybe three times in your life. I do. Well I mean no. I mean like that's that's the problem with me right now is currently like in order in order to travel I'm doing it once that's it. I'm never doing it again. Um in order to travel though it's unfortunate but I'm in a place in my life where especially with my significant other that she wants to have some level of comfort. And so what you're talking about is the fun travel that everyone ought to do when they're in their 20s. How old are you or how old were you when the trip happened? I was I left when I was 24",
      "start": 1182.08
    },
    {
      "text": "And so what you're talking about is the fun travel that everyone ought to do when they're in their 20s. How old are you or how old were you when the trip happened? I was I left when I was 24 going on 25. I'm 27 right now. Perfect timing for that right? You did you went you did sort of what you were supposed to quote unquote do which was go to I assume you went to college or school graduated got the corporate gig and then of course the next step in your life was going to be to find someone and immediately have kids with them and then be together and then you know maybe go on to a second or third divorce uh to the point where you have no money for the rest of your life which is great that's how we do it here that's how the economy keeps going um so I I that's where you say oh let's travel and I immediately get that anxiety of like oh man this is going It cost me so much because I have two plane tickets. I have hotel hotel stays at nice places cuz you know when I like to go out there",
      "start": 1218.16
    },
    {
      "text": "and I immediately get that anxiety of like oh man this is going It cost me so much because I have two plane tickets. I have hotel hotel stays at nice places cuz you know when I like to go out there when we went to Thailand it was fun cuz you go out into the heat and the craziness and the chaos and you'd see that and then you'd be like okay this is really overwhelming cuz I'm sure you you're familiar with Thailand is overwhelming. Like they have they just have a ton of people especially if you're in Bangkok. It's all kind of like on top of you. There's there's a smell factor that you have to think about that you don't think about when you see pictures. Um and it's awesome. Don't get me wrong. if you want to gigantic mega malls they have there. But it was nice to come back to like hey Mr. Scarpino how you doing? Like do you need anything to Yeah. going somewhere and they have what you're looking for not just going around and talking to a bunch of people and it's like yeah you know",
      "start": 1256.96
    },
    {
      "text": "Scarpino how you doing? Like do you need anything to Yeah. going somewhere and they have what you're looking for not just going around and talking to a bunch of people and it's like yeah you know they have like a side quest or something. I think Mr. Scarpo is the thing that bothers me most about that whole story. They call me Mr. Scarpo. I don't I don't appreciate getting laidback and officialness in that sentence. Oh hey Mr. Scarpino. It's like hey shit straighten your tie. Sit up straight. And I'm calling me Mr. Scarpino. Hello. Good day. You don't know anything Thailand. Do not leave the room until I've told you to leave the room and never turn your back to me. That's how I roll. Uh but no I I I always I always thought about that and I had a lot of friends that did that right? Like they they would either take a year off college to go do a summer abroad or or a year abroad or something like that or they would I had a couple friends that like literally were like I'm not",
      "start": 1295.76
    },
    {
      "text": "Like they they would either take a year off college to go do a summer abroad or or a year abroad or something like that or they would I had a couple friends that like literally were like I'm not going to get a job. I've saved up some money and I'm just going to go. Um but that always just I was always way too um I guess conservative to do that. I was like \"No no no no. You're going to get you're going to run out of money. You're going to have to sell your body to the night just like The Police song.\" Yep. Um and you're not going to be able to come back. And I guess the thing that that scared me most about doing it was like I'm going to be behind everyone else that entered the workforce and went into it. Um now I can tell you know I tell people without a doubt that it's probably an invaluable life uh experience that you should get because you have the rest of your life to go and check into a cubicle under fluorescent lights and fight for promotions and fight for climbing the",
      "start": 1334.16
    },
    {
      "text": "an invaluable life uh experience that you should get because you have the rest of your life to go and check into a cubicle under fluorescent lights and fight for promotions and fight for climbing the corporate ladder if that's where you go. Um so give yourself that year. Give yourself those two years cuz you seem to be happy with it. Your hand hasn't faded yet so that's good. Yeah. Right. Thanks though. I appreciate it. But but Greg I feel like you're like you're with me on this one where it's like given the opportunity if I said I can give you a month to go travel the world or just stay home and do nothing. Nothing big time. Yeah. Yeah. No I don't want to go anywhere. I don't want to do anything. That's Have you though? Cuz I mean that's obviously right where I'm at. Like everybody knows that I don't want to do anything. But like have you done the traveling things? Cuz I've never been out of America. Oh no. No. Yeah. I mean for I just went to Mexico not too long ago which",
      "start": 1367.76
    },
    {
      "text": "knows that I don't want to do anything. But like have you done the traveling things? Cuz I've never been out of America. Oh no. No. Yeah. I mean for I just went to Mexico not too long ago which wasn't I mean it was a resort so whatever. I we did that week in Japan uh two Thanksgivings ago right? where we went out with Scott, Cindy, Shuhei, Warren Price, and all them and hung out for a week in Japan. That was awesome. I'd love to do that again. But uh yeah like I just don't feel that pull ever. You know what I mean? Like I look at photos of Thailand I'm like \"No really crowded. Looks really hot. It's really hot.\" It's funny though cuz I I I actually feel kind of bad about it. Like I feel like I'm doing something wrong cuz I see him talking about shit Like he sounds super happy. I feel like there's a lot of other shit that are just really judgy about it that to the point that I feel like I'm living wrong where I'm like shit Is it messed up that I do just like sitting in",
      "start": 1406.64
    },
    {
      "text": "I feel like there's a lot of other shit that are just really judgy about it that to the point that I feel like I'm living wrong where I'm like shit Is it messed up that I do just like sitting in front of my computer and watching YouTube videos like about anything. It's not like I'm just wasting my life away. I am. But it's like I I'm learning shit I'm like I'm experiencing things. I'm enjoying stuff. Yeah. But I don't know. That's not to say I don't like going places. Like Hawaii was one of my favorite places in the world going to be being able to jump off. It kind of counts. I mean I guess kind of Hawaii's like the weird mix you know where it's like it's not really America. It's tropical but it's Westernized and everything. I love jumping off cliffs and shit That's awesome. He does. He does it all the time. It's a big stop him sometimes. It's going to get dangerous to have it but I don't I don't have the drive at all to to go you know? I feel like I get drives",
      "start": 1442.4
    },
    {
      "text": "He does. He does it all the time. It's a big stop him sometimes. It's going to get dangerous to have it but I don't I don't have the drive at all to to go you know? I feel like I get drives for very specific places. I love Japan. I've been to Japan. I enjoyed Japan. When we went to Germany for Gamescom back in the day when it was Leipzig or whatever I was like \"This is fine. I don't really feel drawn to come back.\" You know what I mean? That's why people love Cologne now and it's different. So I'm sure one day I'll make it out there. I really want to go to London. And granted I think that's probably because it would be the one I'd understand from the get-go at their words and their use everywhere. But you know what I mean? Like I would I would get the feeling of that. I would understand. Ireland I think's cool. I got to get down with Ireland once in a while. New Zealand all tucked away up north like that. That'd be a hard one to go to. Yeah. Exactly. Exactly. Colin you just",
      "start": 1479.92
    },
    {
      "text": "Ireland I think's cool. I got to get down with Ireland once in a while. New Zealand all tucked away up north like that. That'd be a hard one to go to. Yeah. Exactly. Exactly. Colin you just went to Iceland. Yeah that's also right by you. I didn't like I didn't I didn't say it was terrible. I just said I was there for way too long. I think that I've been overseas five times. And the common theme is I've been to Japan twice. I've been to Europe three times. And my the the common theme is I've had fun a lot of fun on four of those trips. Well I mean Iceland was fine too. It was just I was just there for way too shit long. Uh the common theme when I go overseas is always like how long do I have to be here until I can go home? That's like basically like the minute I land I'm like \"All right this is Even in Japan I have a lot of fun in Japan but I'm always like \"All right 3 days, 2 days, one day and then I can finally go home.\" Like Mhm. I just don't like being out of",
      "start": 1515.84
    },
    {
      "text": "\"All right this is Even in Japan I have a lot of fun in Japan but I'm always like \"All right 3 days, 2 days, one day and then I can finally go home.\" Like Mhm. I just don't like being out of the States that much. I just don't It's not It's not like I know it's a typical American thing but I've been overseas. I'll go overseas again. It's just that I don't really enjoy traveling. Like I especially in the United States like I it goes for the US and for overseas. I've been I've been to a lot of places in the United States like I would I mean off the top of my head maybe 30 states right? Like and maybe more. And it's just like okay like I kind of just want to go home. Like this is this is fun you know? But like I I just I don't have that travel bug. I don't have that travel gene. When I go to Canada I I feel the same way. It's like I don't count that overseas at all. I mean or you know it's not really like another country. It's basically the United States. But I just",
      "start": 1553.2
    },
    {
      "text": "When I go to Canada I I feel the same way. It's like I don't count that overseas at all. I mean or you know it's not really like another country. It's basically the United States. But I just don't feel like being somewhere else. I don't. But is it different for you to travel within the United States versus like do you get a different feeling like when we went to Atlanta for instance which was hot Atlanta. Hot Atlanta. Um is that different than if you're like \"Okay I know I'm going to be gone.\" Because we were gone for what three or four days to to Momocon? Is that different than saying like \"Okay we're going to do like a a week trip for you to Tokyo.\" I mean granted this the airfare but is the same concept of like being away. Does that apply to the United States versus outside or is it just easier to travel within the United States? No I mean it's definitely easier to travel with the US. It's the currency. It's the you can understand things. You know we I I'll stick by",
      "start": 1584.72
    },
    {
      "text": "or is it just easier to travel within the United States? No I mean it's definitely easier to travel with the US. It's the currency. It's the you can understand things. You know we I I'll stick by it for the rest of my life. We eat the best here. Um but you know especially in the south I like I like we had our conversation on that. I know people don't agree with it. I think Southern food is the best food I've ever had anywhere period. Um in any country. And we know that. We saw you trying to stuff like mac and cheese in your pockets before we left. That vortex place you keep I know you call in the night and say \"Come on shift to California.\" Yeah. Give me some of that gravy. Describe it. Describe the But I just I just It's just not travel is just not for me. Like I I'm with you Greg where it's just like I want to retire one day and just not do anything. I My Like I told you my uncle is doing that right now. He he sold his house on the island. He moved to Virginia with like",
      "start": 1620.24
    },
    {
      "text": "where it's just like I want to retire one day and just not do anything. I My Like I told you my uncle is doing that right now. He he sold his house on the island. He moved to Virginia with like some of my other family members that have all kind of migrated out of the island because it's so shit expensive. And uh they just he's just I remember talking to him being like \"What are you going to do? You going to play golf?\" He's like \"I'm not going to do anything. Just do whatever.\" And I'm like \"That sounds shit awesome.\" Like you just wake up and you just do whatever. I feel like we're we're in the minority or it's just the people traveling are just very loud about Well it's it's it's definitely a cultural thing with America. Like I mean when I was abroad like you see like 18-year-old like British kids and Australian kids like German kids and they just do their gap year just part of their culture. It's like you should just go out and travel like in America it's more of just like",
      "start": 1652.56
    },
    {
      "text": "like British kids and Australian kids like German kids and they just do their gap year just part of their culture. It's like you should just go out and travel like in America it's more of just like like a lot of people they're going to travel it's like oh well I'll do a semester abroad or I'll do like Peace Corps or something. It's always like Americans we have a very good work ethic. So it's like it's like if if we're going to go out and travel it's like we have to be working while we're doing or accomplishing something like just to go travel to travel seems silly to us. And like the only reason that I really went and travel is because I had a friend that did it. So he kind of just like told me about it. He's like \"Oh yeah you should go and do this.\" I was like \"Why would you just go and travel just to travel?\" But then I did. I was like \"Oh yeah it's good.\" And like I just don't feel like that message doesn't get out there. It's just not a it's just not a cultural thing over",
      "start": 1686.48
    },
    {
      "text": "and travel just to travel?\" But then I did. I was like \"Oh yeah it's good.\" And like I just don't feel like that message doesn't get out there. It's just not a it's just not a cultural thing over here. And there's nothing wrong with that. Like if you don't want to travel you don't have to travel. Like people enjoy different things. Yeah. I don't I don't judge. Like I don't I'm not judging the people that travel. I I do feel like some people that travel and do judge sometimes not necessarily you but do judge people that don't like to travel cuz I think they correlate it with culture which I think is nonsense. Like we like I think you can gain culture by reading. I think you can gain culture by listening and watching and viewing things. I don't think necessarily there's a lot of people that don't have the means or or the desire to go overseas that so I don't think there's necessarily a correlation. I am not more cultured because I've been to Europe three times and I've been to Japan",
      "start": 1717.44
    },
    {
      "text": "don't have the means or or the desire to go overseas that so I don't think there's necessarily a correlation. I am not more cultured because I've been to Europe three times and I've been to Japan twice. Sorry I'm not. I'm much more cultured in the things I've read and the things that I know like than so I think that there's like an unnecessary correlation between those two things that I think makes some people snooty about it. But I think also in the United States I think that we are just isolated from the rest of the world like in Europe you can stumble into another country if you if you if you to that point though to that point there's if like the population of like Americans that have their their passports and Canadians and Americans it's like 30% or something Canadians is 50% and those shit are everywhere. Like you can't go anywhere without seeing somebody with like the Canadian flag on them and they're they're they're everywhere. Yeah. But no it's nothing against Canadians.",
      "start": 1746.8
    },
    {
      "text": "shit are everywhere. Like you can't go anywhere without seeing somebody with like the Canadian flag on them and they're they're they're everywhere. Yeah. But no it's nothing against Canadians. I'm just saying I went to college with them. I know all about it. Yeah. Um I know Mitch Dyer and I don't like them. I remember I remember uh when I was a freshman in college someone had a Canadian flag in the dorm window and so and across the way someone was playing Blame Canada like really loud try to piss them from South Park. Um but uh no I I just think like I I I think if people want to go travel overseas and do it like that sound like your experience would give me shit crazy anxiety. It's just it's just not something for me. I not knowing where you're going to be next and how much money and how like that would drive me nuts. Especially no offense but like in some third world countries or whatever. It's just like like Yeah I'm just like I don't know. Like no off I mean do",
      "start": 1781.28
    },
    {
      "text": "and how like that would drive me nuts. Especially no offense but like in third some third world countries or whatever. It's just like like Yeah I'm just like I don't know. Like no off I mean do live how you want to live and do what you want but I mean that's just that's just not for me. I understand that we pay an arm and a leg to live here but I really do think that there we have some excuses. We are separated by the rest of the world by two huge oceans. We have a humongous geographical country that has desert and tundra and sea co you know beaches beautiful beaches and like we basically I think there's I'm not saying there's nothing we could find overseas that we don't have here. But geographically we pretty much have everything especially if you include Alaska and Hawaii. which I would. So it's just like I I can there's just a lot of excuses of why we don't need to leave like the if you grew up in the Netherlands or something like that like you you could just fall into you",
      "start": 1816.08
    },
    {
      "text": "would. So it's just like I I can there's just a lot of excuses of why we don't need to leave like the if you grew up in the Netherlands or something like that like you you could just fall into you know Belgium you know like or France or like you know like it's not so I can understand being a European for instance and then Canada has a has a kindred connection to Europe. So it makes sense to me that they would they would travel and all that kind of stuff since they are British in their own way. So it's um you know I don't know. I I I just think our culture doesn't necessarily preclude us traveling but I understand why we don't. And I understand why people around the world judge us for that. But I would encourage people to not judge us based on that. Our culture doesn't necessarily come from just seeing things but rather like I I know people that I know I I'm not I know people that have been overseas that are the most uncultured **** I've ever met in my life. So there's",
      "start": 1854.16
    },
    {
      "text": "come from just seeing things but rather like I I know people that I know I I'm not I know people that have been overseas that are the most uncultured **** I've ever met in my life. So there's no correlation between those kinds of things in my opinion. There because there is a I mean I'm not going to disagree and say we have everything like everything we could ever want in this country. like we're I'm I've came back very like very um hashtag blessed. Yeah. Well no not hashtag blessed but very appreciative of like what I had growing up and it's just kind of to go abroad. It's not more or less to see see things cuz you'll see a lot of stuff that you've already seen but it's just it's just the cultural part like you get to you get to see there are a lot of things that we do great in this country and I'm very proud of that but there are some things that could probably use some work. It's just kind of cool to see how other people do things. So that's that's good to see. And like I",
      "start": 1889.68
    },
    {
      "text": "country and I'm very proud of that but there are some things that could probably use some work. It's just kind of cool to see how other people do things. So that's that's good to see. And like I you do see people that just kind of go out and they're just like oh I'm I'm going to India to go to India. It's like oh the Indian food tastes so much better when you eat it with your hands. Like no it tastes the exact same. Like they just want to sound like snooty. It's like just get out of here. Like go to experience that people like a lot of people go and they just like you they just go to stay at the like the well not I don't want to bash your honeymoon here but like they'll just go and they'll stay at the resorts and you just they just do **** privileged American but they just they just go and they do the same things that you do in the United States. like it's like \"Oh I go out on the weekends and I drink like I go on and then they just do that in another country.\" If you're not if",
      "start": 1929.76
    },
    {
      "text": "and they do the same things that you do in the United States. like it's like \"Oh I go out on the weekends and I drink like I go on and then they just do that in another country.\" If you're not if you're just staying on the resort and just doing that you're just going to see the same stuff. It's just going to be slightly different weather and it'll just be a slightly different feel. But when you actually go out and kind of try to live with them Yeah. get involved with the people. It's it kind of opens your eyes to like just different ways. Yeah. And that's something that and that's that's that's sort of my point that we were talking earlier before we did the show was that most of our travels especially together and when we were at IGN had travel were really about around work and so you weren't getting that experience you were going if you were on the video team you were often carrying a ton of gear um that you had to worry about getting through in and out of customs which is",
      "start": 1960.24
    },
    {
      "text": "so you weren't getting that experience you were going if you were on the video team you were often carrying a ton of gear um that you had to worry about getting through in and out of customs which is always that was always a fun experience always different always unique um carnet the carnet form was what it was called and you no matter what you did you would present that to the customs official and they would have no idea what you were talking about until they found the one guy that knew it was up and had the stamp. Um and so there is that sort of anxiety that comes when you say travel with me where it's okay I have to go do work. But what I've never done which is something that my wife has done which is give herself that year to be like just go exist go embed yourself in a different society in a different culture and just see. Maybe you won't like it maybe it sucks maybe it's completely different. But she has such a different perspective on the world than I do. And it's not",
      "start": 1993.6
    },
    {
      "text": "society in a different culture and just see. Maybe you won't like it maybe it sucks maybe it's completely different. But she has such a different perspective on the world than I do. And it's not like it's better or worse but I think it is to some degree a little bit more broad than my perspective. Whereas I happen to think that I I mean I would be perfectly fine with never ever ever leaving my house. Maybe come to here once a day. Um but then beyond that we should get houses that attach and then you can just come through the wall. You're really big into the attached thing. Every time we say in a hotel you're like \"Can we please get rooms that attach?\" And I feel like you want to come jump on my bed. Team joke. And then I'm just the only one who ever walks up first. I like it. Yeah I would support the attachment for sure. I know you would Kevin. I want the attached houses too. I would totally do all that but I I want you to know that Kevin comes over and jumps on my bed.",
      "start": 2027.92
    },
    {
      "text": "I would support the attachment for sure. I know you would Kevin. I want the attached houses too. I would totally do all that but I I want you to know that Kevin comes over and jumps on my bed. There's doors that open up in the middle and like the Beatles movie. You never leave. No you could take the fourth house. I'll be in Montana somewhere on a **** on a survivalist compound waiting for the Russians to invade. Jacob I want to wrap it up but I want I want two things from you. One what brought you home? Like what was when when did you were you like \"All right now it's time to end this journey and come home.\" And then two like is there like a takeaway you have from it? Is there something you learned from this whole thing? So yeah I mean I came home because I mean traveling on a budget eventually gets very tiresome and I'm like I just want to sleep in my own bed. I just want to be able to just kind of wake up like you want to get back into the routine eventually after a",
      "start": 2061.68
    },
    {
      "text": "on a budget eventually gets very tiresome and I'm like I just want to sleep in my own bed. I just want to be able to just kind of wake up like you want to get back into the routine eventually after a while. You can only do it for so long. Like you have an a certain amount of endurance. And I I went a while I I was just expecting to leave initially for like three months maybe six and a year and a half. I was like \"All right I'm done.\" Like I was thinking of going to South America. I'm going to go to South America eventually but I needed to take a break and come back and just be home and see my family and everything like and and going a year and a half without good Mexican food is the toughest thing I have ever done. I can't go through days without rough. It it was rough. So that was uh yeah I just I just want to come home. was getting homesick. But uh yeah the takeaway I mean it's just good to I I mean I really just kind of really just became appreciative of everything that",
      "start": 2094.32
    },
    {
      "text": "yeah I just I just want to come home. was getting homesick. But uh yeah the takeaway I mean it's just good to I I mean I really just kind of really just became appreciative of everything that I have here cuz I mean you just see you see a whole different level of like human suffering if you do go into other places like like the what is it the Tenderloin like that like that's that's poor for by our standards but if you go other places it's just kind of crazy to see what people people deal with in like other countries and how they get they get by. It's crazy like like in how inventive they are just how because they have to do everything themselves. Like you'll go through Thailand and people will be fixing their own bikes making their own food and just like they just know how to do everything because they don't have they don't have the luxury of paying for pe like paying people to do things for them. So I mean it's just it's good to come back and just be we we kind of have",
      "start": 2126.48
    },
    {
      "text": "do everything because they don't have they don't have the luxury of paying for pe like paying people to do things for them. So I mean it's just it's good to come back and just be we we kind of have a culture where we we kind of we're always looking at what we don't have and we work towards to get those things. It's kind of nice to just be able to sit back and be like \"Okay these are things I do have and you can appreciate these things.\" Well I'll give you I the poor in the United States definitely do struggle but I I've always been intrigued by this Heritage Foundation thing to this point. Heritage Foundation is like kind of a conservative think tank or whatever. They released these stats about the classification of poor in the United States and why that word might not mean what we think it means. So based on the United States poor like what poor means which I think is like whatever amount of money 80% of poor households have air conditioning 9 % of poor households have a",
      "start": 2162.56
    },
    {
      "text": "think it means. So based on the United States poor like what poor means which I think is like whatever amount of money 80% of poor households have air conditioning 9 % of poor households have a microwave in the United States. Nearly 3/4s have a car or truck. And 31% have two or more cars or trucks. Mhm. So like that it's just it's all relative. Nearly /3 have cable or satellite TV. Two/3s have at least one DVD player and 70% have a VCR. These stats half have a personal computer and one in seven have two or more computers. More than half of poor families have and children have video game systems. 43% have internet access. One third have a wide screen plasma or LCD TV. 1/4 have a digital video recorder system to what it means to be poor in the United States. So it is it is all. Yeah. It's totally relative. So it's I always I always go back to that Heritage Foundation things. Like it's all when we when we throw that word around we throw that word around very **** loosely. You",
      "start": 2192.4
    },
    {
      "text": "It's totally relative. So it's I always I always go back to that Heritage Foundation things. Like it's all when we when we throw that word around we throw that word around very **** loosely. You want to see poor you know? Yeah. Like Yeah. Yeah. Well welcome home Jacob. Yeah. Thanks.",
      "start": 2230.48
    }
  ]
}
