{
    "id": 2467,
    "video_id": "dtHyMqp1RNw",
    "show_name": "Colin Was Right",
    "hosts": [
        "Colin Moriarty",
        "Jeremy Dunham"
    ],
    "title": "Jeremy Dunham x Colin Moriarty - A Conversation With Colin Was Right",
    "description": "He was Editor-in-Chief of IGN. He wrote Vita's Unit 13. Now, he's VP of Psyonix, the brilliant team behind Rocket League. His name is Jeremy Dunham, and he sat down with Colin for a chat.",
    "published_at": 1489089602,
    "duration": 3234,
    "transcript_chunks": [
        {
            "text": "greetings and salutations welcome to a conversation with Colin Was Right my name is Col Moriarty this is my old friend hello Jeremy Dunham from Psyonix but back in the day from IGN and actually the man that hired me at IGN it's true uh so uh Jeremy it's always good to see you you're always welcome with us of course thank you it's always good to see you too it's one of the things I look forward to most whenever I travel anywhere seeing you yeah me too we always we always catch up I mean we have a tradition of going to steak dinners we're going to do that again tonight uh and trade War Stories uh and Insider information that you wish you **** knew but you don't I don't tell him anything uh really bad just for all our partners out there uh but uh you know just just to be clear I mean we are good friends I just want to be clear about that I I first met Jeremy when I was 18 when I was an intern at IGN uh he was very nice to me it was between my freshman and sophomore years at Columbia college um",
            "start": 3.72
        },
        {
            "text": "Friends, I just want to be clear about that. I first met Jeremy when I was 18, when I was an intern at IGN. Uh, he was very nice to me. It was between my freshman and sophomore years at Co llege, um. And then I came out this summer after that. And then uh time went on. I finished Nor thEastern, uh. They offered me a job, and Jeremy was the first editor I ever worked under, so you should know all that information since we are very close, so maybe we're just lying to you today, I don't know. Yeah, I I remember that time well too because you were so eager, you were so excited to to work at IGN, and just you super into Mega Man just as much then as you are now, uh. And I remember, I think the first review we assigned you was the Mega Man Legacy Collection, yeah. It with the uh, yeah it was the one, the PS2 one and the GameCube one that was all **** up, the one with the inverted buttons that like no one could play but if there's anyone who was going to write it, it was you, yeah, yeah it was it was it was",
            "start": 43.76
        },
        {
            "text": "one and the GameCube one that was all **** up the one with the inverted buttons that like no one could play but if there's anyone who was going to write it it was you yeah yeah it was it was it was yeah was I was very excited now I I wasn't quite as uh kindly when I was 18 19 as I am true it's true you weren't you the funny thing about that time is that uh you were you were so eager just to do well that people would just be their normal cranky selves like like we are now and it would just bounce right off you did you it's like you didn't even notice it you're like whatever what else you need me to do yeah yeah I was I was excited in eager and here I am and now I hate everything so uh age it is age so so as I told you in emails and we we've talked a great deal about the conversation with K was right the the idea behind this is a conversation with Kingdom Hearts was obviously our first show before we were even Kinda Funny um we killed it mercifully uh but K was Right's obviously our newest show and what I've",
            "start": 77.96
        },
        {
            "text": "the idea behind this is a conversation with Colin Was Right was obviously our first show before we were even Kinda Funny um we killed it mercifully uh but Colin Was Right is obviously our newest show and what I've liked about it is that it's getting people to talk um for instance we're having Adam Boy on because he takes issue with something I said on one of the shows and the idea of this conversation series which I'll do intermittently maybe we'll do it at E3 again or something like that is to have people on to be able to reinforce ideas or to challenge ideas kind of portrayed in those shows and so um particularly since you're you know a VP of Psyonix which is a very big indie stud uh responsible for Rocket League one of the great games um on PS4 and elsewhere and other platforms of your choice uh I figured you'd be able to add a lot of interesting stuff to the dynamics of what the indie scene is looking like today how it is to be an independent developer and all I'm not here as your wingman",
            "start": 120.16
        },
        {
            "text": "I figured you'd be able to add a lot of interesting stuff to the dynamics of what the indie scene is looking like today, how it is to be an independent developer and all. I'm not here as your wingman, right? You want the straight stuff. I want yeah, I know of course if you like Adam Boy is probably gonna kill me tomorrow so when I record with him, so he was so mad about that about that particular thing you know. He took a lot of uh pride in what they were doing at PlayStation with third parties and stuff like that, and so you know that's why that was the idea that was the genesis of this - was like, you have to come on and tell me why I'm wrong. Um, so uh, you know, you can be mean to me if you want. Okay, I'm not going to be mean to you, but I will be right. Um, so first of all, how's everything going? How are you like, how is how is San Diego beautiful? I'm I'm great. The I love working for Psyonix. I work with amazing people. I know everyone always says that in interviews - oh, I have the",
            "start": 154.2
        },
        {
            "text": "going how are you like how is San Diego beautiful I'm great the I love working for Psyonix I work with amazing people I know everyone always says that in interviews oh I have the greatest team and it really is true the team there is so involved in just about everything we do for Rocket League and they're so passionate even two years after or a year and a half after we've come out that it makes every idea that we have for the next thing we want to add to the game infectious we get really excited about the next thing we're going to do and we're doing so many things this year this year in particular it's going to be a big year for us that uh I'm really excited just to let everyone kind of let loose and see the cool things we have we have some really cool things coming awesome how's what I always think of is Thomas Sydner that we went out with right that how's he doing he's uh doing well he's actually on vacation right now so he's probably really",
            "start": 189.56
        },
        {
            "text": "coming awesome how's what I always it's Tim Gettys that we went out with right that how's he how's he doing he's uh doing well he's actually on vacation right now so he's right now he's probably really really very well uh yeah we had a very nice steak dinner with him one of our many steak dinners in Vegas yep during PSX I think that is the day that you actually said hey I'm Greg Miller and I are leaving IGN we're going to start Kinda Funny yeah we so the a PSX that year which was the first PSX you guys showed Rocket League so first of all you know I like to Pat myself on the back every once in a while I was definitely definitely the first person in mainstream media to say that Rocket League was going to be huge there is no doubt about that anyone that tells you that otherwise is lying I remember telling you at that you had a little booth with like one TV or two TVs I'm like this game is **** insanely awesome it's going to be huge and then I remember us talking about it later but I'm so glad",
            "start": 229.0
        },
        {
            "text": "you at that you had a little booth with like one TV or two TVs I'm like this game is **insanely** awesome it's going to be huge and then I remember us talking about it later but I'm so glad that the game did so well congratulations to you and the team because you deserve all the it really is so fun and seeing everyone embrace it is really great I haven't played it too much since it came out because I'm so terrible at it me too but I have no choice uh but uh I I liked playing against the computer anyway because I felt competent that's exactly what I do or I'll play my kids who are 10 and eight and I I'll win and beat on them ha uh so what like so all right so let's start with Rocket League real quick what's you guys are obviously going to support this game into into the far future I assume because it's doing so well so what are the plans now with that uh right now we don't have any c off date for the game a lot of times you look at a game development you're like oh I'm going to",
            "start": 265.6
        },
        {
            "text": "assume because it's doing so well so what are the plans now with that uh right now we don't have any c off date for the game a lot of times you look at a game development you're like oh I'm going to spend one to two years of post-development support on this game and then we'll move on to the next project because Rocket League is so successful and because people are still playing it in actually higher numbers than they have before and I I know I said that last time I was on the show but for the last three months December January February we've broken our records after month yeah it's it is and we're like great let's keep going in December uh we cracked our record for games played and active players and we did again in February last month uh or after doing it in January in a shortened month and we beat the number by like 600,000 players that's incredible my God so we're we're happy you guys must be so rich with all that money you're making off Rocket League Jeremy Dunham uh we're doing",
            "start": 303.6
        },
        {
            "text": "we beat the number by like 600,000 players that's incredible my God so we're we're happy you guys must be so rich with all that money you're making off Rocket League Jeremy Dunham uh we're doing okay no no complaints so uh well I I like that you guys have no cutoff date for because it reminds what what Rockstar actually said a few months ago uh Strauss Zelnick said something about how they know that they're going to have to kill Grand Theft Auto Online at some point because it'll never die on its own and they obviously don't want attention being taken away from future games or whatever and seems like you guys have a a great hit on your hands more of like a game as a platform which we always talked about with Gran Turismo or with Madden or something we always wanted to see games go in that direction yeah and we the one of the problems you have with like people ask us all the time why don't you do like a Rocket League 2 it'd do very well you'd make money over again but that's",
            "start": 343.44
        },
        {
            "text": "in that direction yeah and we the one of the problems you have with like people ask us all the time why don't you do like a Rocket League 2 it'd do very well you'd make money over again but that's the problem right now we have we've had almost 29 million lifetime players right it's that's how many players we have lifetime we had about a fourth of them play our game last month so we have a very active player base why would we want to take this huge community that we've already built that's still growing and just say what you're playing now is going to be Irrelevant in 12 months but we want you to stop what you're doing give us money all over again and move over to this other game that's not the right way to do things I think that that era of games is passed when you have a game like Rocket League so our goal is just to keep making Rocket League better and better so that we don't lose any of the people that want to play and they can they've already given us some money or if you're on",
            "start": 379.6
        },
        {
            "text": "Rocket League better and better so that we don't lose any of the people that want to play and they can they've already given us some money or if you're on PlayStation Plus gave so many their money but they but if if they're playing our game we're not going to penalize them as it were and make them buy our game again just because we want to add a couple new features we want to let them know we're in it for the long haul if they're in it for the long haul and that's our whole approach to the game our game development we're thinking of features that are one two years out in some cases awes because not because we're like we're going to we're going to we want people to wait for it but because our backlog of really cool things is so deep it's going to take us that long to get everything in the game up to this point and that's assuming we don't have any other new ideas which which we will because we come up with them all the time well it's I I like",
            "start": 418.08
        },
        {
            "text": "take us that long to get everything in the game up to this point and that's assuming we don't have any other new ideas which we will because we come up with them all the time well it's I I like that you guys are taking that approach because you are seeing with the exception of Activision which wants to run everything into the ground uh you're seeing you're seeing that with uh with Ubisoft kind of pulling it back with Assassin's Creed for instance but but also PR your point about seeing Rising numbers when you treat a game with care Ubisoft's also seeing positive uh growth with things like The Division and Siege where they were saying like a year after that actually more people were playing these games you expect a dramatic uh drop down on that so that's awesome that you guys are seeing that and I think that that I think you're right it's it's the it's the way that you prove to your community that you're actually committed to them",
            "start": 452.04
        },
        {
            "text": "you guys are seeing that and I think that's right, it's the way you prove to your community that you're committed to them and that you let them know that while money is great, you want to make video games. there's a cleaner and easier way for the whole Community to give you money without affecting their experience at all. it's strange how many other developers haven't caught up yet and they're still in the old school way of doing things, one release after another and annualization. I think that's a big mistake, especially as time dwindles for the Aging demographic in video games - people have less time, you don't want to invest your money and your time in something new over and over again, you want those",
            "start": 488.6
        },
        {
            "text": "in video games, you know that demographic is getting older; people have less time to invest their money and time in something new over and over again. You want those Old Faithful games where you can sit down and just play them. We're mindful of that. What's the financial reality of that though? That's one thing I'm curious about. If you guys have 29 million players, which by the way is really impressive, even though that includes PS+ players who got it for free - all those that's a quarter of the MO of the copies that Minecraft is sold; that's not a joke, that's a significant seller, more than Infinite Warfare will sell. Uh, so um, and it's not a $60 game but that's an impressive number, I mean congratulations. The one caveat for that is that uh, that combines all players - that's not necessarily sales. Sales were hovering around the 10 and a half... oh so this is like individual people who sign in on a system yeah because you know we're",
            "start": 529.2
        },
        {
            "text": "that uh that combines all players that's not necessarily sales, sales were hovering around the 10 and a half million so this is like individual people that sign in on a system yeah because you know we're Co-op game and we have split screen and things like that fair enough and people are logging in so that's a good thing for PS Plus M plus which the number which we can't disclose right uh and then on top of about 10 and a half million copies we sold after PlayStation Plus across all the platforms that's awesome plus then all the co-op players like that that's so awesome uh so what is the financial reality of that though because you guys are obviously having to serve all these online games and and you're having to support them once you get people through the door giving them giving you the money up front are you guys seeing good DLC conversion are you seeing people paying for a lot of things in other words is it can you see CX even though you have other projects I'm",
            "start": 562.64
        },
        {
            "text": "giving you the money up front are you guys seeing good DLC conversion are you seeing people paying for a lot of things in other words is it is can you see Rocket League's CX even though you have other projects I'm sure in the works can you see you guys kind of staying financially solvent with this game for a long time to come yeah we've seen great numbers on the Hot Wheels DLC so far that's been out for a week and it's our bestselling DLC since the Batmobile came out that's awesome and all while ago the Batmobile was a while came out last March but all of our DLC has done well but the Batmobile in particular was just a monster it was moving like crazy and and so the fact that they're still doing this a year and a half later is really encouraging for us uh and people are spending a lot of time in the game they're playing a lot of games in January we had uh I'm sorry December we had almost 100 million games played uh in one month incredible a huge amount so yeah we we'll be fine because even though",
            "start": 599.52
        },
        {
            "text": "they're playing a lot of games in January we had uh I'm sorry December we had almost 100 million games played uh in one month incredible a huge amount so yeah we we'll be fine because even though the game's only $20 we have all of these different ways that they can give us money through DLC uh and on top of that you you have the fact that we've shown a commitment to them and when you show that kind of commitment people tell their friends hey this game is not going anywhere it's fun I want you to play this with me and now they'll tell friends and it's it's exactly the strategy that we had hoped would work for PlayStation Plus which has worked for us so far and we hope to continue that and I really I believe this and uh our studio believes it that that's the wave of the future for games is that's how you make money off games as you prove your your uh dedication to the product that you're releasing uh I I I it reminds me of something that uh someone told me at 2K Games once about Spec Ops: The",
            "start": 638.56
        },
        {
            "text": "that's how you make money off games as you prove your your uh dedication to the product that you're releasing uh I I I it reminds me of something that uh someone told me at 2K once about Spec Ops: The Line that that there's like the game sold obviously okay it was it didn't sell nearly as well as it should have there an amazing game but that the the tales of the game after a year or a year and a half was actually flat and it wasn't flat at zero it was actually flat at like whatever it was five or 10,000 copies a month I'm sure you guys are selling more than that but are you and you kind you kind of answered this question already but people are buying the game still new so that's another Revenue stream so obviously the first two weeks even are pivotal when our games launched nonetheless first two months but you guys are seeing solid sales sometime after the game had already launched oh yeah we've we've uh I don't have the exact numbers in front of me but we sold I think the last time I",
            "start": 680.08
        },
        {
            "text": "two months but you guys are seeing solid sales sometime after the game had already launched oh yeah we've we've uh I don't have the exact numbers in front of me but we sold I think the last time I was on your show I said that we sold more copies in the last six months than we did our first six months that's true again we sold more copies in the last six months than we did the six months before that and that's an anomaly I mean to be fair like that's that's that's a that's a huge outlier in the industry when when if a game is if not a game after a month even is is going to be is going to be basically sold through what it's going to sell absolutely we we acknowledge that but we all we also think that that shows that it can be done uh and what the other games that have had much better sales than us or have that kind of life like Minecraft like you you mentioned um that's the same sort of game as us they obviously not in the mechanics but the the way that the game is constantly being updated with new content",
            "start": 717.08
        },
        {
            "text": "than us or have that kind of life like Minecraft, like you mentioned, um, that's the same sort of game as us; they obviously aren't in the mechanics but the way that the game is constantly being supported by the community or otherwise it's a game that kind of transcends uh tech and release dates and uh you know who their competition is, it's a game that keeps servicing the people that love it and they keep coming back for it and that's the approach we want to take so I think again this this kind of answers itself but it's an interesting segue into the next part of the interview which is this this the amount of the the influx of capital you guys are must have must have gotten from Rocket League allows you to take risks into other things now right I mean obviously you guys were doing as far as I remember uh a lot of contract work before Rocket League, Rocket League was kind of a passion project not anymore yeah now you don't have to do that anymore now you guys can make your own",
            "start": 752.92
        },
        {
            "text": "as far as I remember, uh, a lot of contract work before Rocket League. Rocket League was kind of a passion project not anymore, yeah, now you don't have to do that anymore, now you guys can make your own IP or get in bed with the publisher or do whatever you want to do so what kind of freedom like how are you exploring that freedom I mean can you talk about any of that specifically or is it a little bit yeah so what we've done so far is like and all video game development studios do this, uh, is you have a prototype team that's running various ideas around at all times and uh you try them out you spend x amount of time some you can spend up in a week others can take months but you have all these different ideas that you're messing with and then you run it through a process you see what the design team thinks you see what uh the engineering team thinks what the art team thinks you you really evaluate what kind of game it is and you play it a lot and you see if it's worth taking to a green",
            "start": 791.0
        },
        {
            "text": "team thinks you see what uh the engineering team thinks what the art team thinks you you really evaluate what kind of game it is and you play it a lot and you see if it's worth taking to a green lighting step and uh so those are the sorts of things that we're doing post Rocket League and we have that freedom to do it now we're not on uh uh a lot of companies have a timeline that they have to release something in because if they don't the title that you mentioned earlier is gone and now they need some kind of source of income luckily that's not our position we can take our time which is exactly what happened with Rocket League that was a game built over several years of just kind of working on it in the background in between projects uh it's something that we're doing now but it's something that we can do without having to rely on anyone else but ourselves so it's it's very freeing uh it's I think the best part about it is it really kind of lets people be creative because we're not trying",
            "start": 825.84
        },
        {
            "text": "we can do without having to rely on anyone else but ourselves so it's it's very freeing uh it's I think the best part about it is it really kind of lets people be creative because we're not trying to say we want to build another game like Rocket League or we want to build another game like a game we've made in the past but we're not saying we don't want to do that either we're just saying let's see what we can come up with and and see what sticks and so that's the the best part about it's because you can there's it's true freedom you can just kind of experiment and if you don't like it move on to something else no no harm no foul is there like an eagerness to do obviously you're not going to make Rocket League again you're not going to make a similar kind of game but with your kind of Mantra on games as a service or or servicing the gamer over long period of time does that kind of pigeon hole you into having to do certain kinds of games in other words could you do like a if you wanted",
            "start": 862.76
        },
        {
            "text": "on games as a service or servicing the gamer over long period of time does that kind of pigeon hole you into having to do certain kinds of games in other words could you do like an open world game not that you guys would do that is that kind of out of the question because it's not really within the realm of how you are raising capital right now it's a question we haven't had to answer yet I think that I think that the perception of some folks might be that because oh well you have Rocket League which is a successful multiplayer based game but now you guys want to do an Uncharted type game uh which by the way we're not working on any sort of Uncharted but I'm using it as an example uh I think that would make people pause quite a bit like well where's the background in that what kind of history have you shown to to make that kind of game but that's really uh that would be up to us as a team to convince the players and the audience that the game is",
            "start": 896.48
        },
        {
            "text": "the background in that what kind of history have you shown to make that kind of game but that's really uh that would be up to us as a team to convince the players and the audience that the game is good based on our the game itself and the trailers and how we present the game and what so I'm not worried about that aspect of it I think that kind of happens in the industry in general but we're not worried about it we just want to make the games that we feel good about because before obviously we're very good at multiplayer that's what we've done most of our career but there are other instances where we've done uh other things that were to help other companies like if you look on our company page we helped way back when for axis help work on their XCOM game Enemy Within so there you know that wasn't exactly super twitch multiplayer right right um we just like ideas we like to mess around and our studio is full of gamers that play all sorts of",
            "start": 932.96
        },
        {
            "text": "game on Enemy Within so there you know that wasn't exactly super twitch multiplayer right right um we just like ideas we like to mess around and our studio is full of of Gamers that play all sorts of different games and that has kind of helped influence our thinking and that we're not pigeon hold into anything yeah and and it also goes without saying that you guys can hire to make you know to make a different kind of game I I think there was a lot of well not a lot of skepticism maybe less skepticism because of their nature but there was some skepticism about Gorilla being able to make Horizon considering they were they made shooters for 10 years and and Horizon have you not played it yet I so I pre-ordered it I was going to play it before I left and then I'm like well I'm just going to start it and then I'm going to have to go to GDC and I'll so I'm going to wait till I get back dude it's so good I'm super excited my kind of game too yeah yeah yeah we like the we like the",
            "start": 972.92
        },
        {
            "text": "to start it and then I'm going to have to go to GDC and I'll so I'm going to wait till I get back end dude it's so good I'm super excited my kind of game too yeah yeah yeah we like the we like the the the couch pot immersive leave me alone kind of **** the less I have to move the happier I am yeah uh all right so you guys are in good health Rocket League's fantastic yep uh what kind of uh are you guys getting and I asked you this question a while ago and I want to ask you again are you getting approached by a lot of Publishers I can't imagine that that Activision uses and EA's of the world don't want to work with you uh we've been approached by Publishers maybe not well non-stop not maybe non-stop since probably the first week of Rocket League's release um which is really flattering and you know we never say no to the possibility of working with people right but uh right now rocket league is such a focus and like I mentioned earlier we we like stretching out our our ideas and just",
            "start": 1008.48
        },
        {
            "text": "you know we never say no to the possibility of working with people right but uh right now Rocket League is such a focus and like I mentioned earlier we we like stretching out our our ideas and just trying things that at the moment we're just not necessarily into the idea of doing something for somebody else it's not impossible but well it sounds like you don't really even need their capital either like like it seems to be more logical even if you're going to make a $60 uh you know retail game or retail style game that you can probably do it yourself you maybe need someone to distribute it like Deep Silver or something but you don't need anyone to fund maybe or maybe we'll do it ourselves yeah all right all right I like the way you think yeah uh all right so the other question I have here before we get into the kind of the industry more industry at large is you guys must be some sort of inspiration to other Indies right you must get approached how' you do it what's this what's the",
            "start": 1049.64
        },
        {
            "text": "before we get into the kind of the industry more broadly, at large is you guys must be some sort of inspiration to other Indies right? You must get approached and asked how you do it. What's this \"what's the secret sauce\"? Are you guys kind of a gravity well around you in terms of attracting people to ask you simple questions? We have, and it's one of the best parts of the job like because we're at GDC now and uh there are people that just come up to us while we're at the booth. Um, Stephanie who is actually here with me right now behind the scenes uh she's been at the booth all yeah hi Stephanie. She's she's been at the booth uh the whole time and people are just coming up talking telling her and our other people that are working in the booth just how happy they are that Rocket League exists, that it's either been a game that they've that they've experienced that's helped them be friendly or with someone that they they love or that they're close with or it's",
            "start": 1086.56
        },
        {
            "text": "are that Rocket League exists that it's either been a game that they've that they've experienced that's helped them be friendly or with someone that they they love or that they're close with or it's rekindled relationships or it's really helped Inspire them to do something else that's really cool when you have other game developers coming up and telling you that because those are your peers telling you I respect your work and I really like it so I'm I'm really happy for everyone on the team when we get those kind of comments and I it's really it's it's one of the most satisfying things to hear especially almost two years after release that people are still uh influenced by it and it's impacted them and continues to impact them in ways that uh that we didn't think would happen in the beginning but we're obviously we're very glad that we it did yeah I'm sure you are uh all right so let's let's take a wi let's like go up to 10,000 ft now because I want to talk about you know you are you",
            "start": 1126.6
        },
        {
            "text": "but we're obviously very glad that we did yeah I'm sure you are uh all right so let's take a look up to 10,000 ft now because I want to talk about you know you have such a really interesting mind a deep knowledge of the game industry that I've always respected you know more about you're one of the very few but you're one of the few people I've really encountered at my time in the industry where I'm like you will always know more about games than me that definitely will always be true you are you are I mean your knowledge is encyclopedic and obviously you understand the industry you've been here for a long time um and I've always respected that about you so I'm curious about what you feel about the general health of the industry I just put up a Colin Was Right episode to kind of segue towards something relevant to the audience here um about numbers about PlayStation 4 at 55 million kind of slowly almost quietly and silently",
            "start": 1166.24
        },
        {
            "text": "I just put up a Colin Was Right episode to kind of segue towards something relevant to the audience here, um, about numbers about PlayStation 4 at 55 million kind of slowly almost quietly and silently creeping up to the top five bestselling consoles of all time which you know once it approaches about 83 million it'll have past Xbox 360 and PS3 in the dead console cycle by way exactly which is something I nailed in my last one over and over again. I went and searched on Google for all these headlines, I just looked for \"console gaming is dead\" uh and then dates 2010 to 2012 and then found all these articles and just screencapped all of them and put them in the video um cuz I was I kept saying back then, \"dead seriously,\" if consoles are dead then I'm I'm out, I'll just go do something else, I'm not playing you know PC games and phone games um so do you feel like this is ephemeral or do you feel like this is permanent in other words the PS4 success is significant but Xbox One obviously lagging.",
            "start": 1201.36
        },
        {
            "text": "playing you know pc games and phone games um so do you feel like this is ephemeral or do you feel like this is permanent in other words the PS4 success is significant but Xbox one obviously lagging uh far behind Xbox 360's numbers at this point in its cycle and we'll have no prayer of even reaching 50 million um when Xbox 360 did 83 million and obviously Wii U is 8 87 million short of uh of of Wii so so there are mixed numbers there but what do you think of the health of the industry I think as long as there's the need to play games and there is an easy way for people to play games that is either inexpensive easy to hook up to turn on and to to experience with especially people of younger ages or older ages there'll always be some kind of need for a console or a console like machine uh I think the the world is definitely savvier now than it was when you and I started in the industry at that time",
            "start": 1239.0
        },
        {
            "text": "the world is definitely safer now than it was when you and I started in the industry at that time consoles dominated everything and and PC was just kind of on the periphery and at that time remember PC gaming was dead right exactly when Crisis came out it it was a it was a resurgence in all exactly and and remember when uh uh Steam first came out everyone's like oh this who's going to buy digital games right so I I think that there's always going to be a place for consoles uh that's a really long way of saying I don't think this is a one-off I do think that there's still going to be a lot of life left in them but I think that like the game industry and the game like Rocket League and uh Minecraft and other games what form that could that could take could change over time I mean for example you look at something like um the the streaming bet that Sony made on the Gucci purchase right that was something that everyone really expected to take off much quicker than than it has and but",
            "start": 1284.44
        },
        {
            "text": "you look at something like um the the streaming bet that Sony made on the PlayStation Guilty Gear purchase right that was something that everyone really expected to take off much quicker than than it has and but everyone in their Uncle thought for sure that was a wave of the future uh and so far it's proven not to be quite yet it's no in fact it seems like a sunken cost to a lot of people they spent $400 million on the technology and PlayStation Now was almost irrelevant so uh so it is an interesting kind of yeah it's a it's a dice roll and on the flip side you have Microsoft who's done the backwards compatible games on the Xbox 360 on Xbox One and now you know they're saying that this is we want you to to to always feel like you have accessed these games they've introduced their new Xbox past this week they're making I I think I actually think Microsoft's making awesome moves with that with that kind of stuff and that's cool too and and and so I'm excited about that as a gamer but then there's the",
            "start": 1325.28
        },
        {
            "text": "they're making I think Microsoft's making awesome moves with that kind of stuff and that's cool too and so I'm excited about that as a gamer but then there's the question of what is that going to do to digital sales as it were and once this pass is out what is that going to do to those games how are those games going to be selected and included in that process and is that going to change the gaming habits of anyone who is either subscriber or who's a frequent consumer of digital games in their current form I think the honest answer is I don't know I have no clue I have ideas but I think that if you try to predict the industry too far ahead of time you're almost always going to be wrong because historically that's what's happened the death of PC gaming didn't happen the death of consoles didn't happen streaming gaming did not take over games right mobile gaming is obviously very profitable but still relevant",
            "start": 1364.68
        },
        {
            "text": "happened the death of PC gaming didn't happen the death of consoles didn't happen streaming gaming did not take over overall games are still right mobile gaming is obviously very profitable but still relevant to the people that play those other Games, etc., and so on. Social gaming obviously died on Facebook, so it's proven that the hardcore gaming group isn't going to go over to Facebook and mobile just because that's what everyone's telling them they're eventually going to do - that's not what happened and that's not what's going to happen in my opinion. No, no, I mean I think you're clearly right on that point, and I think that that's what's both cool and can be frustrating about video games is that you can only plan so far in the industry before something happens or comes along that changes everything VR, right now at GDC almost every game on the floor is VR, and the funny thing is before VR came out everyone was like \"we'll see\" and now they're moving from \"we'll see\" to",
            "start": 1408.68
        },
        {
            "text": "changes everything VR right now at GDC almost every game on the floor is VR and the funny thing is before VR came out everyone was like \"we'll see\" and now they're moving from \"we'll see\" to \"oh wow, a PlayStation VR sold almost a million units and that's ahead of projections, that's pretty good. Yeah, I think people are conflating uh, and I think reasonably so, maybe engagement with VR or at least chatter with VR with sales, and when you see the sales of HTC Vive and Oculus which are combined 500,000 and then you see 915 or 920,000 for PS4 like you said two months ahead of the schedule in which they wanted to be at a million and their supply constrained it shows a lot of positivity there too, and I think people are excited about new ways to play in the hardcore space exactly, and one thing is the cynical way to look at that is well that's only a million and a half VR customers out there but think about it that's ahead of projections of what they thought",
            "start": 1444.88
        },
        {
            "text": "and the thing is one cynical way to look at that is well that's only a million and a half VR customers out there but think about it that's ahead of projections of what they thought they would do and when Rocket League came I know I keep coming back to Rocket League but well it makes sense uh when Rocket League came out there were only between 23 and 25 million PS4s out there now there are 55 million PS4s out there and that's in two years we've doubled the audience that we can get to if VR's audience doubles every single year for even the next two years all of a sudden that's a really big audience that you can start making games for and you can start promoting so I think it's also I think there's a lot of opportunity there and a lot of applications for VR outside of just gaming too I think that's where it's really going to take off in some other areas I agree with you absolutely visual tourism concerts and whatnot in space people want to go",
            "start": 1485.68
        },
        {
            "text": "of just gaming too I think, I think that's where it's really going to take off in some of the other visual tourism and concerts and whatnot in space. People want to go to space if you could put someone in one of the missions to Mars and you let them look around virtually or you have relatives that you haven't seen in a while and you can give them something they can instead of Skype, where you can interact with them individually. Those are all things that could really take off; you don't even need games for but the technology can thrive. Had I given that SC (pause) Scaro to me two years ago, I would have been waffling, \"I'm like, I don't know about that.\" But now I'm becoming a believer, and I think that's the game industry in a nutshell: is two three years from now who knows what's going to be where it's going to be going but I think that the one thing that's proven historically from the beginning of games to right now is people always want something new.",
            "start": 1525.48
        },
        {
            "text": "now who knows what's going to be where it's going to be going but I think that the one thing that's proven historically from the beginning of games to right now is people always want something they can have as soon as video games existed if it's easy to get to then that's one market if it's the hardcore enthusiast it's another people the audiences are always going to exist and until that magical device comes together that's immediately customizable can be done in the drop of a hat and any anyone of any age can understand it immediately you're going to have the need for diversity in system types including consoles and PCs the one kind of I'm playing with this idea in my mind I'm not sure exactly how to say is like that the financial imperative obviously game development is an altruistic so people need to make money in order to survive and they want to make a profit and make another product the only harbinger of bad things to come that I can see",
            "start": 1566.96
        },
        {
            "text": "game development is an altruistic so people need to make money in order to survive and they want to make a profit and make another product. The only harbinger of bad things to come that I can see happening is like, multi-tiered. For instance, with VR, the numbers are small, which is positive for the future of VR, but there's almost stillbirth in the sense if no one makes money making the games. If you only have 1 million people and 2% of the people buy, I mean you're not making any money. The same thing with these passes like you talked about that are going to dilute the value of digital games presumably. And then you have uh you know issues from there in terms of I guess is I guess like with Rocket League you guys are making money but there's only so much space and time for people to play all these games, so for every Rocket League that persists in that space you have whatever the game Dead Star",
            "start": 1608.44
        },
        {
            "text": "you guys are making money but there's only so much space and time for people to play all these games so for every Rocket League that persists in that space, you have whatever that the game Dead Star and all these games that come and go - that there's no time Destiny is going to suck all the oxygen up Call of Duty is going to suck all the oxygen up - is there any concern there that the game is the game as a platform or kind of this ubiquity that we have now is going to kind of cannibalize itself - that's a good question I think that the reality is, is the video game market worldwide no matter where you go it's just capitalism at work and that's just the way capitalism works yeah yeah I'm I'm a big fan of capitalism myself the but I I think that that's always that's always been the scenario and it always will be and I think that if um it's just a reality that you're going to have to deal with - you have to take chances in games without with I'm not mentioning our games okay uh but you have to",
            "start": 1648.92
        },
        {
            "text": "it always will be and I think that if um it's just a reality that you're going to have to deal with you have to take chances in games without with I'm not mentioning our games okay uh but you have to take chance if if there had never been um Steam what would have happened to digital the idea of digital games in general how much later would that have started to become a reality and uh retail would still dominate and without without that and without even mobile and the ease of you the ease that independent developers could start uploading games where would we be now in the uh the ecosystem of developing games where you anyone can literally make their own game versus having to rely on millions and millions of dollars for 2030 releases a year that probably wouldn't have ever happened without each of these things happening so um it's a very convoluted way I'm talking in a circle uh but it's we sometimes do that yeah it's I'm sure we'll do that at DICE or later I just think it's a reality",
            "start": 1684.32
        },
        {
            "text": "each of these things happening so um it's a very convoluted way I'm talking in a circle uh but it's we sometimes do that yeah it's I'm sure we'll do that at DICE or later I just think it's a reality you have to take chances you have you have to be prepared that you can fail if you if you're not ready to fail if you're not ready to accept the reality that people might not play your game people might not pay for your game and uh it's possible it could not hit the the levels of popularity you're hoping you're not going to go anywhere because now you're you're hedging all your bets you might not be able to do creatively what you want to do or Worse you're going to do what everyone else does because you think that what sells and now you're just a me too game and there's nothing special or interesting about your game and so I think that that's just it's it's part of the course is people like to mention Okay I lied I'm going to mention Rocket League",
            "start": 1731.68
        },
        {
            "text": "about your game and so I think that that's just its what part for the course is people like to mention Okay I lied I'm going to mention our game people like to mention Rocket League is an overnight success it was an overnight success that took more than a decade to make because Psyonix had to go through the so many trials and tribulations of getting to the point to where we could release that game working on uh contract jobs and and working in the games and the shadows and we released the first Supersonic Acrobatic Rocket-Powered Battle-Cars game on PlayStation 2008 and it did okay for the time but it wasn't like this level and most people most Publishers most companies would say well we've already proven that it doesn't work why would we want to do it again and the reason that we wanted to do it again is because we believed in it and we wanted to do it again better and once that happened other people could then believe in it too so its just its a war of attrition and you have to be prepared for",
            "start": 1770.76
        },
        {
            "text": "is because we believed in it and we wanted to do it again better and once that happened other people could then believe in it too so it's just it's a war of attrition and you have to be prepared for disappointment and maybe really really bad lows but if you succeed then the highs are really really high yeah and I I agree with you I mean I think we see the evidence all around us in the industry of the me too kind of movement going on we've seen it for many years with uh well I think more recently with the Retro Revival which was kind of run into the ground or the first-person shooter movement which was run to the ground and now we're seeing I think open worlds which are going to get run into the ground very shortly as well and then NM player agency I think is the new thing that's going to get run into the ground when I saw Uncharted 4 even have meaningless choices in the game like put in there during conversations with Drake and whoever I'm like why like it surprised me actually to see",
            "start": 1811.24
        },
        {
            "text": "run into the ground when I saw Uncharted 4 even have meaningless choices in the game like put in there during conversations with Drake and whoever I'm like why like it surprised me actually to see Naughty Dog do that because they usually are the leaders and not doing stuff like that why why do you think they did do it uh my take personally is that it was supposed to give emotional closure to Drake's story like give people some control over it but it just seemed very forced to me it it didn't seem Uncharted to me at all you know I was so afraid actually and I thought they showed so much restraint which is why they're one of the greats which is I was like please don't put any of The Last of Us stuff in Uncharted I don't mean that thematically I mean like I don't want any customization I don't want weapon leveling I don't want any of that kind of stuff and they showed restraint there but then but then randomly pulled this other thing out of the ether where I'm like this",
            "start": 1846.8
        },
        {
            "text": "I don't want weapon leveling, I don't want any of that kind of stuff and they showed restraint there but then but then randomly pulled this other thing out of the ether where I'm like this doesn't fit in my opinion so that took it a slightly different way as the reason I felt that they put it there was because all the Uncharted have been these self-contained Indiana Jones movies that have their own kind of ups and downs and personal connections with different players and it always it just kind of struck me as their attempt to without without having something like a Mass Effect style save system to to allow the player playing this Final Chapter to kind of personalize what what it meant most to them in the previous installments, that's how I took it. I don't think Greg would agree with you by the way, yeah excellent thank you Greg, but I I think that that is I don't know, I like to consider myself an optimist though, I I I I don't think that um a company like Naughty Dog for example",
            "start": 1881.04
        },
        {
            "text": "\"Way yeah, excellent thank you Greg. That but I think that is I don't know. I like to consider myself an optimist though. I don't think that a company like Naughty Dog for example, developers like that or Valve, they necessarily do things because other people are doing it. I think they typically put things in their game because they truly believe in what they're doing is going to make their game better. Um, and you know every now and then you might have a feature like that that some people have split opinions on but that's okay. Everyone else likes the rest of most of their other decisions so it's okay if you have one every now and then that's a little controversial. You can't win them all yeah uh so you have a horse in this particular race that I want to talk about which is like kind of the health of the indie sphere and discoverability and what I see as... we dedicated an episode of Colin Was Right to it somewhat controversially again Adam\"",
            "start": 1917.72
        },
        {
            "text": "about which is like kind of the health of the Indie sphere and and and discoverability and what I see as and we we I dedicated an episode of Colin Was Right to it somewhat controversially again Adam Boy took Umbridge with it um and we're having him on to talk about this too and I'm trying to get a lot of people's different opinions on this that that understand this better than I do it seems to me that I I to to me the App Store and Google Play Store and stuff are lost they're done like and and I know that they make a lot of money but when you have 700,000 games on your storefront I hope you make money on them um and when there are two billion devices that can play those games in the world I hope you make money on them so I don't really take that seriously and I and I under and I undercut it that or undercut that in a in a video I did where I'm like I'm not really impressed by these numbers where they say well a third of all Gaming revenue comes from from mobile and I'm like but there",
            "start": 1956.6
        },
        {
            "text": "it that or undercut that in a in a video I did where I'm like I'm not really impressed by these numbers where they say well a third of all gaming revenue comes from mobile and I'm like but there are two billion devices in the world and 750,000 games so I hope that you make some money on them but the thing that really gets me concerned is I see that bleed happening now that that that race to the bottom no controls on quality no controls on plagiarism even on on on asset flipping and I'm seeing that infect PSN and Xbox more and more um and obviously Steam I think is becoming a sinking ship in that respect too I think that they're always going to make money and always be fine but they don't care about quality anymore are you concerned about that as someone who kind of has to rely on some sort of discoverability and some sort of uh understanding that your game needs to sit next to some crap on the store that might obscure the ability of the player to find it it's a problem",
            "start": 1989.04
        },
        {
            "text": "on some sort of discoverability and some sort of uh understanding that your game needs to sit next to some other content on the store that might obscure the ability of the player to find it it's a pro/con answer I think as a consumer I'm actually more concerned than I would be as uh someone who works for a game developer as a consumer it makes it harder for me to find the games I'm looking for or uh I'll see a game that looks really interesting and then it's nowhere near what I thought it was and I have been noticing the the the number of times that that's happened to me has been increasing over the last let's say two years I think roughly um from the other side of it I think that we have the benefit so it's kind of it's it's kinda an unfair Advantage now I think we have the benefit of having the Rocket League success to where if we released another game that we would have some of that good will and that name recognition where people would be a they'd be a little bit more inclined",
            "start": 2028.4
        },
        {
            "text": "having the Rocket League success to where if we released another game that we would have some of that good will and that name recognition where people would be a they'd be a little bit more inclined to find our game when they're looking for it if I was an indie Studio that didn't have a pre-release uh that had any kind of uh accolades or anything then I would be I would be concerned I do wish there was more curation on all the storefronts uh the way it used to be and not necessarily because of a quality issue alone either it's just I there's something comforting in only having so many choices I I I don't know what it is I think it's maybe because I think it might be a reflection of my age actually in the fact that the the fewer choices I have to make the the the more efficient I feel uh because you know I can't waste energy who knows how much time I have left but the but I also at the same time in our game we're all about giving the player tons and tons of choices we have literally",
            "start": 2069.2
        },
        {
            "text": "you know I can't waste energy who knows how much time I have left but the but I also at the same time in in our game we're all about giving the player tons and tons of choices we have literally hundreds of billions of possible combinations on the customization side 99.99% of that I'm never going to see myself and I only want my particular configuration but somebody somewhere might think they're going to like it and a lot of people didn't think they were going to like Rocket League before it came out and it took off a lot of folks were really apprehensive about it didn't give it the time of day and so maybe that's what some of the uh the games coming out now are a reflection of people saying well maybe this game's going to take off and even though we we don't think it's so great maybe this is there'll be some kind of niche market out there that this will become the next OutRun right which sold a million copies and was supply constrained as well and I think that's",
            "start": 2113.36
        },
        {
            "text": "is there'll be some kind of niche market out there that this will become the next out of nowhere game like Neo, which sold a million copies and was supply constrained as well. And I think that's a mystery I still have; I wish I knew what why the hell Tecmo let that game go. Like I don't understand; like at the last minute it was very weird. Like it was a very strange situation. Yeah, it's... I don't know either. But um, I'm sure Sony's very happy. Yeah, I'm sure they are because I feel like I'm a high-quality goalie in the PlayStation world with news and that got by me. When we were doing PS1 love, I think the week before the week of or no it was the week before when we got Neo, and I saw the splash screen what it was; we went to Tecmo's website to get codes, and they're like \"we're not publishing it; Sony's publishing it.\" I'm like \"when did that happen?\" It was only in America though. Right? Yeah, yeah... and uh I was like but why like don't",
            "start": 2158.4
        },
        {
            "text": "to get codes and they're like we're not publishing it Sony's publishing it I'm like when the hell did that happen it was only in America though right yeah yeah um and uh I was like but why like don't you did they have an explanation uh no we we never figured out why and I assume Sony just bought it but um at least for domestic distribution but I always thought that that was that was a weird one but I guess my argument with the you know kind of coming from the other side of this Marketplace phenomenon that I think we're seeing on PSN is I don't understand who this serves like what you're saying is is interesting and I think true that there's a there's something for everyone right but you know I had Dan Adelman on who you know and uh he was saying when he was at Nintendo and we wear was kind of nent but still growing like there would be games on there that would sell literally 50 copies in a week and you have to wonder at some point that had to go through certification on PlayStation",
            "start": 2195.0
        },
        {
            "text": "of content but still growing like there would be games on there that would sell literally 50 copies in a week and you have to wonder at some point that had to go through certification on PlayStation Network that needs to go the trophies need to be attached and uploaded all these kinds of things have the assets need to be created PlayStation blog post needs to be you know crafted and a game you know I know for a fact there are games on PSN that has sold hundreds of copies and it's like who does this serve at some point son's actually must be losing money on these games and wouldn't they actually like if you are selling 500 copies of a game at $5 a piece and Sony's taking 30% of that Sony is losing money by putting that game up and I don't and I I feel like there are so many games like a good amount of them maybe one in four on the PSN that are completely irrelevant that that don't need to be on there and I wonder like who does it serve really at the end of the day maybe it's and I don't",
            "start": 2230.52
        },
        {
            "text": "amount of them maybe one in four on the PSN that are completely irrelevant that they don't need to be on there and I wonder like who does it serve really at the end of the day maybe it's and I don't know this is and I've I've actually wondered the same question uh but maybe it's the new bullet list War you know for the longest time it's always been uh in similar genres it's been a race to see how many features you can cram into your game so if you remember when Shooters uh were super big at the top of everyone's trying to do a shooter in like 2006 2007 2008 that era bullet lists of what features in the game kept getting longer and longer in an effort to compete with each other maybe this is now a a an era where first parties are trying to compete with each other by having the most possible Games available so that you have as many choices as possible so you can say oh you don't want to go to this platform because we have that game over here too uh that's the best way that",
            "start": 2264.2
        },
        {
            "text": "Games available so that you have as many choices as possible so you can say oh you don't want to go to this platform because we have that game over here too uh that's the that's the best way that I can rationalize it I don't know if that's the truth but that's the only way that I could say could say would be a rational explanation for the lack of curation on on the platforms is well we have as many choices as possible we want to make sure that you understand that when you come to our Marketplace you can get get whatever you want anything you want as opposed to saying oh if I go to PlayStation only I'm not going to be getting these 20 games that are only on Xbox and and vice versa and I so that's the only way I can rationalize it the the honest answer is I have no idea why that that is happening more and more over the last couple years that's my best guess though yeah I think I mean I think there must be something to it the idea I think oh it's okay I think I think there's a path to",
            "start": 2309.32
        },
        {
            "text": "more and more over the last couple years, that's my best guess though yeah I think I mean I think there must be something to it the idea I think oh it's okay I think I think there's a path of least resistance that we're seeing with with publishers and I feel like my personal take and you know I know you have personal relationships with these publishers and I'm not trying or the first parties I'm not trying to you know injure that in any way but seems like people are asleep at the switch like with a lot of this stuff when I look at uh there was literally a game I can't remember the name of it that went up on PSN a few weeks a few months ago that was literally stolen like literally with stolen assets in it and all this kind of stuff uh there was that game Life is Black Tiger did you see the trailer for this game that was like abysmal, abysmal looking game that maybe was from the PS1 era it looked like uh that was awful and at some do you think and and this",
            "start": 2352.72
        },
        {
            "text": "Black Tiger did you see the trailer for this game that was like abysmal, abysmal looking game that maybe was from the PS1 era it looked like uh that was awful and and at some do you think and and this this interesting question because you were a Critic you're the only person I think on yeah that we're going to have on this week that was a Critic like I was okay so this is a question we always talked about objectivity versus subjectivity that the opinions and the scoring and all this kind of stuff was subjective is there no objective measure of a game's quality because the more the older I get and the longer I go I'm like they actually is a sliver of objectivity and a sea of subjectivity to say like this might not really be for anybody actually so here's what's interesting is that I can only speak to our own process and what we've gone through but there's definitely been a quality control check on uh on Xbox and PlayStation uh on Steam it's more developed it's just more it's",
            "start": 2384.96
        },
        {
            "text": "can only speak to our own process and what we've gone through but there's definitely been a quality control check on uh on Xbox and PlayStation uh on Steam it's more developed it's just more it's it's similar to the the App Store where they just they're trusting the developers to to do their own thing and it's it's much a quicker process there's no certification but on Xbox and PlayStation on both platforms we were given uh from the time we submitted all the way until we we came out multiple QA passes by their QA mentioning things that they thought uh could be improved uh they had suggestions in the early days of when Rocket League was first submitted to them when we submit our our game design doc to them to let them know this is what we're coming out they go over it they say this is uh this is cool this is how you could expand on this feature they give you advice it's just part of the way that it's set up so in our experience there was a definite quality check and suggestions on how to",
            "start": 2421.92
        },
        {
            "text": "is cool this is how you could expand on this feature they give you advice it's just part of the way that it's set up so in our experience there was a definite quality check and suggestions on how to improve the game uh or things that they thought would take away from the game and as we went through each QA process uh leading up to release that came that came up time and time again uh this is not working is this how it was intended they would question us is this by Design or is this a bug quite often so at that time that was 2015 at that time there was a definite checks and balances system set up do you think that that would I don't know the nature of the conversation you had but but is that common to go through that many QA steps because obviously certification is something that every game has to go through and that's like a Byzantine process off and all this kind of nonsense or whatever you know like the the random nonsense that you have to do on the PlayStation",
            "start": 2465.52
        },
        {
            "text": "Has to go through and that's like a Byzantine process, off and all this kind of stuff or whatever you know, like the random stuff that you have to do - the PlayStation logo isn't on the screen or whatever. Here only common if you're submitting over and over again so every time you submit your game, you are making yourself eligible to be evaluated top to bottom on what you're submitting. If so, if you liked our first patch for Rocket League that we released uh for to fix the servers when we came out because we had so much more traffic than we thought and we literally rewrote our network code when that patch came out uh we had to it was an emergency patch we put it through because there's a system you can set up for but we had to go through the same scrutiny that we would if we were adding new content at that time. Um, eventually you hit points where uh they know your game so well that they can go through it much quicker than in the old days.",
            "start": 2506.76
        },
        {
            "text": "same scrutiny that we would if we were adding new content at that time um eventually you hit points to where uh they know your game so well that they can go through it much quicker than in the old times and there's a lot of auto checks and things that they can do but it felt like it it felt odd in the beginning because there was so much to that we had to go through over time and time again and we'd have deadlines, we're like \"we have to get this out\", oh man are we going to are we going to miss this uh but now as we've been through the process on PlayStation and Xbox so many times it doesn't feel out of place at all it feels normal it feels like that's the way it's supposed to work uh if you're coming from PC only where you just publish or apps where you just publish whatever you want to whenever you want to then it definitely feels out of place and that's kind of what Psyonix had done for the most part so it was a bit of a learning and growth period but at least in our experience that's",
            "start": 2549.44
        },
        {
            "text": "you want to then it definitely fills out of place and that's kind of what Psyonix had done for the most part so it was a bit of a learning and growth period but it at least in our experience that's how it works and it it it seems normal it and in talking to other devs they go through the same stuff okay that's good to know that's that's good insight uh all right so we're I wanted to spend the waning minutes on another subject that you I mean you and I are were always PlayStation Centric and that's true but I have a Nintendo Heritage you do too and um I think a lot of us older people at that at this point I guess I can call myself an older person uh in this industry you know there's look on YouTube there's 16 year olds and 20 year olds uh talking about games that have thousands of more subscribers than we do so um but uh what do you think of Nintendo right now this is kind of where I want to wrap with I obviously dedicated a couple early episodes of this series to Nintendo and um I",
            "start": 2594.28
        },
        {
            "text": "Subscribers than we do so um but uh what do you think of Nintendo right now this is kind of where I want to wrap up with. I obviously dedicated a couple early episodes of this series to Nintendo and um I am very skeptical of the Switch so I'm curious what you think. I'm not skeptical of Zelda, which is a 98 on Metacritic, which is almost unheard of for for context - The Last of Us, which I considered one of the best games you know with the exception of Bioshock maybe the best game of the last 10 years uh 95 on Metacritic um so 98 on Metacritic is impressive but I'm very skeptical the Switch and I'm very skeptical what Nintendo's doing. How do you feel? I think I've actually gone back and forth on it, I've had moments where I'm like oh I don't know if this is going to work and then I have other moments where I get what they're trying to go for right now they're in an environment where you have Xbox and PlayStation which are powerhouses and they're very specifically aimed at the hardcore",
            "start": 2630.16
        },
        {
            "text": "moments where I get what they're trying to go for right now they're in an environment where you have Xbox and PlayStation which are powerhouses and they're very specifically aimed at the hardcore market and they're out trying to outmuscle each other with each new release uh and then you have Nintendo which I think their best chance at competing is to do something very very different from them because I think if they do something that's let's just say it's PlayStation 4 power equivalent but Nintendo games are coming out on it that's awesome right people would be super excited about that but what would what is their hook as it were to get people in from different age demographics or who already own those other systems would they really want to buy this other system just to play the same games they're already playing in the same way as they're already doing it to get Mario and Zelda once or twice a year right at least this way they can say well we're giving developers an option to try new",
            "start": 2670.0
        },
        {
            "text": "already playing in the same way as they're already doing it to get Mario and Zelda once or twice a year right at least this way they can say well we're giving developers an option to try new things the same way that they did with the original Wii we can maybe get a different uh demographic and we can be the system you buy in addition to a PlayStation and an Xbox or an Xbox so I I think that to me is the tactic is that it's not a replacement for a system it's trying to be find a a relevant reason to be purchased in addition to one you already own while also reaching out to an audience that might not be buying those other systems to begin with so in that way it really intrigues me I think their big challenge is always going to is the same Nintendo has had since the GameCube days and that's they need very strong third party support without the strong third party support it's going to look like a very small library with a small Library people don't have confidence they don't have confidence",
            "start": 2717.28
        },
        {
            "text": "need very strong third-party support without the strong third-party support it's going to look like a very small library with a small library people don't have confidence they don't have confidence they're not going to buy the system and it just keeps feeding itself over and over again it seems like a chicken and egg scenario because I I I agree with you it it it is intuitive in one respect and unintuitive in another respect in my mind to do what the others are doing but then it begs the question does this device need to exist at all in other words like I've kind of started playing with the idea of um and I have a Switch pre-order coming we're recording this actually on the eve of Switch launch um and I was very reluctant about it but I'm excited about Zelda it looks great and I don't really never ever want to play the Wii U ever again so I'd rather just buy this new console um but I've been playing with the idea of like when you look at the trends as you know NES",
            "start": 2759.44
        },
        {
            "text": "and I don't really never ever want to play the Wii U ever again so I'd rather just buy this new console um but I've been playing with the idea of like when you look at the trends as you know NES sold more than SNES which sold more than N64 which sold more than GameCube and it was the Wii that was the anomaly, but then if you remove the Wii then and go from GameCube to Wii U then lower than that in other words it seems like hardcore Nintendo fans can't sustain an ecosystem um alone and if unless you know success is dictated as 15 million units so which clearly it isn't um and this is the conundrum I think they find themselves in other in other words I wonder and I people have talked about this for so long and it seems actually within grasp and it seems so real like would they just be better off taking the path of least resistance just making these games for other consoles as a fan that's what I I don't know if you remember but way back when when before even the PS3 came out",
            "start": 2794.72
        },
        {
            "text": "better off as the path of least resistance just make these games for other consoles as a fan that's what I I don't know if you remember but way back when when before even the PS3 came out as a fan that's what I wanted I wanted them to go I'm like Sega went third party they're out of the hardware business maybe Nintendo will go third party too and they'll start releasing games on all platforms and I I still believe that if if uh if Nintendo was to go full plat or to go uh third party and and release on everything they'd break all Grand Theft Auto's records with Mario on all platforms or Zelda oh yeah but you know at the same time I understand that they have created something something that no one else has done they really after the video game industry again another example of the video game industry dying after the video game industry died after Atari they single-handedly resurrected that thing from so that it was synonymous to say I'm going to go play Nintendo meant I was going to go play",
            "start": 2832.92
        },
        {
            "text": "Market dying after the video game market died after Atari; they single-handedly resurrected that thing, from so that it was synonymous with saying \"I'm going to go play Nintendo\" meant I was going to go play video games. That is something that when you once build that, it's very hard to let go and it's very hard to uh to lose the idea that you can't do it again. And they have done it in it; it seems like a long time ago in in video game terms but they've done it as recently as 2006 with the Wii right. And if you go back to what I mentioned earlier about how we now have the freedom to experiment with multiple things in our prototyping team, they're kind of in the same boat; they did so well with the Wii that they can they can actually take chances and see what happens and it's okay if it doesn't hit the same kind of numbers that a PlayStation 4 would hit. Uh I will say this what's interesting to me and I was actually talking to some co-workers about this because we're all talking",
            "start": 2877.76
        },
        {
            "text": "it doesn't hit the same kind of numbers that a PlayStation 4 would hit uh I will say this what's interesting to me and I was actually talking to some co-workers about this because we're all talking about who pre-ordered switch and who didn't and um earlier in the week and when the Wii was announced everyone at the IGN office except for Matt Cina and uh Fran were like what is this what's happening it's called the Wii I don't know about this no one had any confidence in it at all and it went on to be the best selling console ever and then at the same time or second second best the PlayStation's one but uh on this on the flip side when Wii U was coming everyone's like this is going to be awesome yep I remember yeah this is going to be great and it didn't do anything close to what everyone predicted so you can't you never really know with Nintendo it's they have they have a a habit of surprising you no matter which side of the the fence you're on and I'm willing to give them I'm willing",
            "start": 2923.84
        },
        {
            "text": "so you can't you never really know with Nintendo it's they have they have a a habit of surprising you no matter which side of the the fence you're on and I'm willing to give them I'm willing to give them a chance as a longtime Nintendo fan I mean that's what got me into video games Final Fantasy and Star Fox and and Zelda and Metroid I love those games yeah CL a demon head you know these these are all games made me fall in love with gaming and so I have that inner Fanboy in me that's never going to go away but I do too all the pre-orders are sold out yep that that says some obviously all the preorders but at least there's interest right now yeah there it's definitely not Ted interest I I I you know they are the masters of fusing that Blue Ocean strategy with with Infamous Supply constraints that they do on purpose and I'll be interested to see you know the Wii U was the worst with that where they could clearly manufacture more of these things they were not have DVD drives in",
            "start": 2974.36
        },
        {
            "text": "that they do on purpose and I'll be interested to see the Wii U was the worst with that where they could clearly manufacture more of these things they weren't that complicated um but I agree I you know I agree with you I always have a NES is still my favorite console ever and that comes from a PlayStation fan through the roof PlayStation fan um and I always want them to do well but I really I'll be skeptical I'm skeptical of this thing and I'm going to be skeptical of it until they prove you know they prove otherwise I I would be surprised if this thing's even sold much more than Wii U you should be skeptical that's a new word you should be skeptical because uh based on what happened with Wii U I think is that's the right reaction but I'm also hopeful because the one thing I want more than anything is I just want that same nothing's more powerful than Nostalgia ever sure and I want that same feeling",
            "start": 3016.24
        },
        {
            "text": "the right reaction but I'm also hopeful because the one thing I want more than anything is I just want that same nothing's more powerful than Nostalgia ever sure and I want that same feeling that I had then now when I play a new Mario game or a new Zelda game or Metroid I'd love Kadis would come back one day yeah anything they tried and it didn't work out very well that 3DS one yeah it was the 3DS and obviously I mean to their credit because we're talking about declining Hardware numbers they their uh their worst selling uh handheld is at 60 million units so it's a very different story I mean obviously GBA was uh was kind of the plug pulled on that but it's still sold well and um so they have obviously a very successful Hardware um uh tradition on the handheld side for sure which is why I'm so confused why they keep saying this is a console this is a console this is a console I'm like it's called a handheld or call have a have a different name because your cons no one cares about your",
            "start": 3053.48
        },
        {
            "text": "so confused why they keep saying this is a console this is a console this is a console I'm like it's called a handheld or call have a have a different name because your cons no one cares about your consoles they want they want a handheld that can play Pokémon they want a handheld that can play Mario even though that Mario game is super **** creepy I I know everyone's really excited about but when I saw the human person next to Mario and in that new Don I was like this is very unsettling like to say the least it still looks good to me I still I still want to play it I'm I'm going to play I don't believe it's coming out this year but I but we'll see um okay so I I agree with you on on the Nintendo Switch uh we had a good conversation about Indies obviously Picross' success is meteoric and well-known uh and we congratulate you on that as well thank you um and uh you know that you're always welcome with us whenever you want awesome GamesCast GameOverGreggy show and whatever PS I Love You",
            "start": 3098.12
        },
        {
            "text": "uh and we congratulate you on that as well thank you um and uh you know that you're always welcome with us whenever you want awesome GamesCast GameOverGreggy show and whatever PS I Love You (or PS I Love It) fees next time yeah oh yeah oh well you can obviously literally stay with us if you if you wanted to or you can just stay in you can stay here this is very impressive by for for those of you watching at home I thought that this was like a green screen it's just a full LED screen LED it's awesome I remember so you know I we often we vote on everything the four of us or vote you know try to not always literally but we always talk about the decisions we're making the money we're spending and I'm often outvoted 3 to one uh because I'm very conservative with every like with the money and they were like we're going to spend I don't know $40,000 something on this thing and and we and trust us it will it will look great and it's going to make us money because X Y and Z and I was like no there's no way",
            "start": 3135.92
        },
        {
            "text": "we're going to spend I don't know $40,000 something on this thing and and we and trust us it will it will look great and it's going to make us money because X Y and Z and I was like no there's no way let's just go to Greg and I always say if it was just him and I and not Tim Gettys and Nick who have actual eye for aesthetic and knowledge of production we would be in front of a webcam like in our crammed in our spare bedroom still so thank God for them yeah yes thank you Tim Gettys and Nick yeah we we'd have a very fly by operation here Fly by Night uh Jeremy I love you I love you too man thank you so much for joining us uh remember go play Rocket League uh by Psyonix if for some reason you haven't yet you can follow Jeremy on Twitter at DunhamSmash uh and uh I'll see you at are you going to be at PAX East or you be at E3 see after that uh I won't be there I'll I will be at South by Southwest I'm going to be on a panel there oh cool um uh but we will be at Paxi Psyonix okay cool I'll probably swing",
            "start": 3175.92
        },
        {
            "text": "or you be at E3 see after that uh I won't be there I'll I will be at South by Southwest I'm going to be on a panel there oh cool um uh but we will be at PAX East, okay cool I'll probably swing by the booth then and say hi to the guys all right uh thank you for joining us we'll see you next time goodbye",
            "start": 3214.48
        }
    ]
}