{
    "id": 2511,
    "video_id": "GSRIvJYdXh0",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Nick Scarpino",
        "David Dino"
    ],
    "title": "Let's Get Drunk and Play Snake Pass - Kinda Funny Plays",
    "description": "Subscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids",
    "published_at": 1490716802,
    "duration": 1572,
    "transcript_chunks": [
        {
            "text": "What's up everybody welcome to another let's play here on YouTube.com/ Kinda Funny Games. I'm one of your hosts, Greg Miller, alongside the producer, Nick Scarpino. Hey hey Nick, this is my friend Dino. Hi Dino, how's it going? Good, I'm very well. I just noticed you guys took off your snakes and I'm still wearing mine. We were worried that the snakes were going to interrupt the audio experience of this here let's play. Oh okay, so we... I put my snake right here. Sure what' you name it? I haven't named it yet. Should we should we come up with maybe Arnold? I want to call him Arnold Schwarzenegger. Arnold, CU. He reminds me of that big ass anaconda in uh uh Conan the Barbarian thing chops its head off and steals jewels. That's what starts all the action happening in the movie, and James Earl Jones is like yo that's not cool. And then we have Ahkmed and the other dudes that kind of look like Arnold come after him and they start like fighting. That Arnold... I'm going to name my snake Conan Britain. You know why?",
            "start": 0.12
        },
        {
            "text": "not cool and then we have Avenue and the other dudes that kind of look like Arnold come after him and they start like fighting that Arnold I'm going to name my con BR Connie Britton you know why watch no you don't say that as a spoiler for Nashville I'm just saving you Seasons it's the character that died not really Connie Britton so it's not she came back as Phoebe Nichols and people versus OJ Simpson and she's awesome you're here to show Snake Pass and we've all been drinking and I'm excited about it you have a we have a little gallery over how you guys doing to be fair shout out to the Sua Digital crew and plan of attack I was a kind of funny but it's a Kinda Funny when yeah okay like we all together all right all right cool now all of us haven't been drinking mostly just Greg you guys came over very sober Greg has been hammered all day I can't see it I can't prove it but that's the sign of a sheer alcoholic so Snake Pass is here yes Snake Pass it's from you",
            "start": 36.28
        },
        {
            "text": "guys came over very sober Greg is it though has been hammered all day I can't see it I can't prove it but that's the sign of a true alcoholic so Snake Pass is here yes Snake Pass it's from you guys at Sumo Digital yes you did Little Big Planet 3 where most people know you guys from actually Sonic & All-Stars Racing Transformed no I ran not even that one no everyone remembers the Sonic racing game that was a good racing game congratulations yeah thank you very much now you hear with Snake Snake Pass yeah when it came out I was like oh I'm going to be ahead of the curve on this one this one looks cool great then this is the end of GDC which is why we're all drinking and it turns out at GDC everybody fell in love with your game just a little bit everybody's like was great Marty said he loved Snakes I love him what doesn't he fall in love exactly right maybe you should have more discerning taste uh so we're I'm going to jump in and play to get a hang of it yeah def I'm going to play on",
            "start": 77.12
        },
        {
            "text": "I love him, what doesn't he fall in love exactly right? Maybe you should have more discerning taste. Uh, so we're I'm going to jump in and play to get a hang of it, yeah, def I'm going to play on easy, yeah, it's a good start, it's a very good start. Then I want Nick to play on hard, okay, we can do that too, that's not a problem. I'm fine, I'm a master. So what is Snake Pass? Snake Pass is a 3D physics-based puzzle platform where you control a snake and the snake's name is Noodle. Is that the first time you've ever said that because that came off the top of your head very quickly? Yeah, thank you very much. This entire week basically. That's on PS4, yes, Xbox One, that's right. Swit is what we're playing it on as well, yeah, everywhere if you're one of these dorks with your mouse and keyboard all right so here but you can't control it with a mouse and keyboard. Oh wow, you're already thinking like a snake right now. So like that yes now see I'll Now kill that bird, kill that bir that's your homie that's",
            "start": 114.48
        },
        {
            "text": "Here but you can't control it with a mouse and keyboard, oh wow, you're already thinking like a snake right now, so like that. Yes, now see I'll kill that bird, kill that bird, that's your homie, that's your homie. Saw the bird, it's all in the head movement looks exactly exactly. And the interesting thing is like the mechanics that we um implemented in Snake Pass is emulates what a snake actually does as well when it's like single muscle muscul and everything like that. Actually it came from an internal game Jam that that guy over there Seb Loeb go, the thing, go up the thing. Yes I'm go up the thing, I'm doing it, I'm going thing Jump On In, Jump On In. This guy he deserves all the credit over here cuz he is the creator of basically yeah and he yeah he used to be a biology teacher before he um became a game designer thanks so essentially you gave up on children you were like I want money I appreciate that I respect that this is a pretty good um you know Avenue to work in anyway and your your",
            "start": 156.0
        },
        {
            "text": "a game designer thanks so essentially you gave up on children you were like i want money i appreciate that i respect that this is a pretty good um you know Avenue to work in anyway and your your entire game is here now you know its unbelievable wait so Little Big Planet was your gateway though yeah yes it was both of ours actually of Little Big Planet and Sumo Digital gave me the chance to actually become a real game designer holy crap thats awesome yeah dreams do come true do you want to drink and talk you want me to play are you going to drive the car here im driving the car fine now i'm sorry that I'm not like you bamboo you are a natural snake we've all known it for years i'm sorry i've got it down i know that i need to do this and wiggle my way up now hold the A button there it is thats a problem you try some the button hold down the A button and then lift your head thats yeah thats me i know there we go there you go now you start climbing all over its all about the points of",
            "start": 195.24
        },
        {
            "text": "a problem you try some of the buttons hold down the A button, and then lift your head. That's yeah, that's me. I know there we go, there you go. Now you start climbing all over it's all about the points of contact as to how a real snake would do it anyway, of course, of course with their one muscle I heard yeah but a real snake wouldn't put up with that bird running around he'd **** out of that an interesting bird yeah he's your homie basically I know the bird's my friend but also I'm just I'm I'm very method right now I'm being Snake and I'm hungry and so I feel like maybe the bird at a certain point would stop being my friend and start looking like dinner so if you press the Y button yeah once he starts stop talking and everything thanks a lot bird remember when I needed this literally hit the Y button picks up your tail makes you lighter and everything like that changes your center of gravity oh he is your friend that's a friendly thing to do like I said a homie got your back he got",
            "start": 236.68
        },
        {
            "text": "the Y button picks up your tail makes you lighter and everything like that changes your center of gravity oh he is your friend thats a friendly thing to do like i said a homie got your back he got your back literally tail yeah so if you just keep moving forward remember Slither like a s yeah is that what teach me here does it make me go faster hey yes its again remember getting the musculature going on and everything the constriction expansion of that muscle who whose idea was this and how did it come it was his idea it came from an internal game Jam that we did okay yeah October 2015 yeah so lets rewind a little bit did you really just say whats up everybody long day its okay its i completely understand were been in GDC the whole week but its been a great GDC to be fair but yeah it came from an internal game Jam that we had and actually Seb was learning unreal uh cuz we put him on another project Lear and he was trying to figure out how how could i put this how splines worked",
            "start": 274.92
        },
        {
            "text": "came from an internal game Jam that we had and actually Seb was learning unreal uh cuz we put him on another project Lear and he was trying to figure out how how could I put this how splines worked am I am I correct in saying this yes yes so and he tried to he made a rope where a character can interact with it but for some reason the Rope just fell onto the ground onto the plane M as robes do yeah as you do and um as it fell um in an interesting position he was all like huh why don't I make this into a car what if I can control this rope and make it into something and because of his love of snakes and and I guess his background history and stuff his love of snakes I mean who who who wouldn't love a snake like this the snake is a very lovable character yeah and it's funny it's funny that you want to control that rope because sometimes I want to control rope into a noose and wrap it around Greg Miller you know what Nick you've had a problem with me ever since you took the con here we go",
            "start": 322.48
        },
        {
            "text": "want to control that rope because sometimes I want to control a snake and wrap it around GameOverGreggy, you know what Nick, you've had a problem with me ever since you took the con here we go my maybe we can have the Intercontinental Championship right now actually once you guys figure we're talking about there just not enough there's not enough of us to have multiple B that's true fair enough fair enough true yeah so we end up uh he ended up winning the the game jam with his amazing concept and of course it was all trying to figure out how do we make that into a game because the mechanics themselves were pretty intense like okay you should be slithering around collecting things but you know took into a concept phase um made a pretty nice demo out of it took it to EGX, just to see how people would enjoy the controls more than anything else and people took to it they loved it and then the guys you know the big bosses over at Sumo were like let's go full bore thing this cool now GameOverGreggy",
            "start": 367.2
        },
        {
            "text": "people would enjoy the controls more than anything else and people took to it they loved it and then the guys you know the big bosses over at Sumo were like let's go full bore thing this cool now Greg how's it how's it feel still getting the hang of it look like you're still getting the hang I'm still getting the hang of it but it is that thing of like when you start to have those aha moments like okay here we go said he said he'd give me a rematch he said and then he didn't come to work the next day uhoh I had a thing that came up and then the next day after that the belt was dirty the belt had to go out for cleaning I'm not going to clean it myself I'm not an expert at cleaning the championship belt and that thing needs to get shot Champion should you know how to do that you champion we have a guy named Kevin at our beck and call all day he'd spit shine at any day anytime doesn't put his own shoes on I haven't put my own shoes on since 1969",
            "start": 408.48
        },
        {
            "text": "you know how to do that, you champions? We have a guy named Kevin at our beckoning call all day; he'd spit shine at any time. Doesn't put his own shoes on. I haven't put my own shoes on since 1969. Does Kevin do that? Kevin puts my shoes on for me; he puts my belt on for me. He'll uh, he'll rub my calves when they're a bit sore after my run. I could use that now, actually. Yeah, can we get a cup please? Get a cup. He's Mr. Miyagi, it looks like. He heats the hands first so that they come at you like a rice bunny. You know what those things are? Yes, a rice bunny. Yeah, rice. You ever seen these? They're like bags of rice that you warm up just inanimate dumb bags of rice that you warm up in the microwave and stick on yourself all right feels good yeah I bet it does who doesn't love rice I love rice oh look your little tube when did you get that tube I just I just did but I I when I was talking I looked at you guys and he went the wrong way so I got to go back",
            "start": 447.52
        },
        {
            "text": "\"I love playing this game, oh look, your little snake when did you get that? I just got it, but I was talking and I looked at you guys and he went the wrong way, so I had to go back. It's okay, you have to go back, no, go forward, go forward, it doesn't matter - you can play any way you want in this game. It's all about playing at your own pace, there are actually no enemies in the game at all. Yeah, it's all about navigating the environment hazards that are in the game, and that's fun more than anything else. And of course, Nick is going to struggle with the mechanics here - I'm keeping track, but I clearly am not listening, guys have made him repeat himself twice already. But yeah, can you eat that thing? No, there are no enemies, but you can change your snake's behavior just like in Snake Planet - actually, if you use the d-pad, it makes him little and sneaky, and happy, and he's got a special move if you press it multiple times.\"",
            "start": 488.44
        },
        {
            "text": "that thing no there's no enemies but you can change faal just like a little B Planet actually if you use the d-pad make him little sneaky make him happy he's got a press it multiple times yeah to oh we're being happy we're being happy I'll let Nick get in here and then he'll be sad and always to hear about that again Greg's favorite thing to do is be like look how easy this game is and then I pick it up and I can't do anything with it and then he just subtly makes fun of me the entire time well there's nothing subtle about it no I know it's not going be subtle you missed one of the little uh gobbly go I didn't miss it the game's teaching me as like oh cool right yeah I mean it's up it's hearkening back the old N64 Playstation One Platformers you know different little collectons you collect those are optional you don't have to get those to beat the level um you were collecting those gigantic uh gems which were keystones that's the main path basically okay and of course you can",
            "start": 525.84
        },
        {
            "text": "those are optional, you don't have to get those to beat the level um you were collecting those gigantic uh gems which were keystones that's the main path basically okay and of course you can um collect them in any order that you want it's all good again play at your own pace do however you want to mhm now one important question do you have a platinum trophy on PlayStation 4 do you have a platinum trophy on PlayStation 4 do I want to answer that do I want to answer that the PR person in the room is saying we're doing everything we can we're trying we got that answer then we're trying you start roping me in on the email chains if they're saying no to this we will get you a platinum trophy well thanks to Greg, you don't want to let me loose on them, you don't want to see what I'll do so what's your comfort level with the Snake right now what's your comfort well I think I mean I think I'm real good I got the main stuff I want to go after all the other ones as you do yeah handle business can",
            "start": 568.28
        },
        {
            "text": "your comfort level with the snake right now what's your comfort well I think I mean I think I'm real good I got the main stuff I want to go after all the other ones as you do yeah handle business can you go on top of that then I got a lot left to do I kind of want to see Nick fail okay I mean Nick are you ready for hard yet definitely I feel like I've learned a lot by just watching you yeah yeah exactly a lot of it comes through osmosis yeah I think so but also if I can't play it and master it within the first 5 minutes I will throw the controller that's actually the European release date the 28th is the state for America America USA number one again everybody you say first sorry UK we love UK but no no no one else what all right you go let me try this is my first time playing with this controller sure oh yeah controller by the way it is I really like the Pro Controller we're recording this on on switch launch day yes it's a Switch as people are calling you want to hit you want",
            "start": 613.8
        },
        {
            "text": "controller sure oh yeah controller by the way it is I really like the Pro Controller we're recording this on on switch launch day yes it's a Switch, as people are calling you want to hit you want now if we can just cut through the **** you want to hit what would be R2 hold R2 to get some momentum then Nintendo's calling them L and ZLs and ZRs it's like all right guys come on why are we Reinventing the wheel here look at these updrafts I can carry you across here I bet you can fly you know what I'm not even going to think about this go which one's why which one's why we're too just look at the controller oh you brought the bird down with you too listen quar M at a time everybody we're going straight into that one more time we know which one why is I know which one why is what's the bird's name does it have a name Doodle, Noodle and lift me Doodle why why oh no just do you just do it once no **** that's okay all right oh wow just everybody who doubted me suck it okay fair that",
            "start": 663.36
        },
        {
            "text": "name does it have a name Doodle Jump and Lift Me Up, Doodle Jump why why oh no just do you just do it once no **** that's okay all right oh wow just everybody who doubted me suck it okay fair that was like a suplex that was like a suplex yeah it was Lift Me Up again let's go again maybe he has the Intercontinental title all right you know when he's got enough titles yeah well I can't get out of this little ring so hold down the A button, A button okay that lifts your head and technically that's all you need to know that's really all you need to know yeah okay so I got one of the Totems first got to come over here lift me lift me brother there you go there you go outstanding right there he's my brother from another mother he like my kindred spirit though in reality let's be honest he would be eaten in a heartbeat have you ever eaten hummingbird before uh no I have not I can't say that happened how did you get around this thing again remember lift your head and then like get try to get dude plain",
            "start": 706.36
        },
        {
            "text": "in a heartbeat have you ever eaten hummingbird before uh no I have not I can't say that Happ how did you get around this thing a again remember lift your head and then like get try to get dude plain Zelda trying to figure out like their things I'm like I don't here we go again hit X you're like well isn't none it's none of the normal X's oh God oh God oh God why you can tighten oh God no again L2 down there L2 will Titan your grip L2 Titans the grip at least you're discovering the rest of the world as well as you follow it's very true there's nothing down there except for death okay we're going to go forward here is it really death though if you come back every single time I like I here's the deal I'm big on yoga and I like that in this game you can just do whatever you want to do and there's no real you know there's no real consequences for it it's nice I can just sit in child's pose all day like this how do watch this this is me Dino all right where was that so you said it was",
            "start": 751.48
        },
        {
            "text": "no real consequences for it it's nice I can just sit in child's pose all day like this how do watch this this is me David Dino all right where was that so you said it was October 2015 when was this that you start so that's when the game Jam happened yeah so we've actually been in full production since last April so this all came together pretty quickly yes yes I mean we're really lucky considering our position at Sumo Digital you know we work on so many different games and everything like that so being a big independent Studio having worked on so many different titles and being having those resources and also the experience that you know we've had people work on like Zul and I'm going to crush this I'm going to crush this I'm going to crush this this one you got this one just remember to get tight business handle business I'm tightening I don't think it's working z z i got it that's what I'm talking about see now you're now you got that tight ass grip see",
            "start": 795.76
        },
        {
            "text": "got this one just remember to tighten business handle business I'm tightening I don't think it's working z z i got it that's what I'm talking about see now you're now you got that tight ass grip see that comes they call this Anaconda grip it seems like you're getting cocky be careful my anaconda doesn't want none it doesn't want any unless you've got glowing balls hun yeah get it get it get that get that there we go nice outstanding o baby I love you oh my God there it is thank you thank for joining me to you oh that wind is strong dog it is oh no man is it going to knock me off this give me anxiety maybe going to knock you into the diamond yeah is it going to knock me into the diamond only if you want it to I like your style yeah so no fail states other than like falling off I guess right there's no enemies you're saying yeah there's there's spikes and um we have different themed levels as well so this is the Air theme we also have the fire theme Water Theme so you know the typical things",
            "start": 840.0
        },
        {
            "text": "no enemies you're saying yeah there's there's spikes and um we have different themed levels as well so this is the Air theme we also have the fire theme Water Theme so you know the typical things like that yeah uh with the water level um you have you can like swim and everything which is nice because it kind of takes gravity away okay so it gives you a brand new um experience okay more than anything else yeah and also for um people who like to speedrun uh we have time trials as well there it is I was wondering how you be putting trophies on this these time trials yeah I I mean I love speedrunning as well so trying to find the different exploits and everything too so it's good times got got get oh yeah you got to get up there hit Y and then let it blow you you got you got to be nice and loose hit Y you're going to want to jump yeah see another thing about you know learning Snake Pass is knowing when to let go oh you got all sorts of like wisdom indeed indeed I would hope so consider",
            "start": 891.16
        },
        {
            "text": "hit You're going to want to jump, yeah. See another thing about you know learning Snake Pass is knowing when to let go. Oh, you got all sorts of like wisdom indeed. Indeed I would hope so. Consider oh no, oh no. I wasn't off, no. Nick, you went. Oh Nick, I got to start over. Come on, it's all right. We believe in you. Or maybe I, I believe in. I just like to give him **** okay. Oh no, too close, too close guys. I'm just exploring my boundaries part of growing up yes indeed. Okay, part of becoming a snake as well yes that's also true mhm see yeah this game again comes out in March 28th all the different SKUs as well question and it's I know is one you don't like okay how long is it how many WHs are there I mean like so we have 15 levels actually. And if you did like some main path stuff for the most part you around like me four five hour 100% so um Tom over there our plan of attack guy our guy back there he actually my girlfriend that's not cool man Tom not cool man you know what you're doing you know what",
            "start": 933.84
        },
        {
            "text": "like me four five hour 100% so um Tim Gettys over there our plan of attack guy our guy back there he actually my girlfriend that's not cool man Tim Gettys not cool man you know what you're doing you know what you're doing so anyway he was yourself sir I'm sorry sure oh the French yes I know how to speak French have a French kiss I know how this goes that's how I got her so he clearly knows French too dude so anyway he was the first one to actually 100% the Snake Pass game oh wow okay yeah and it took him about what 15 16 hours back to talking to my girlfriend answer the question I'm trying to get an answer back from this guy how long did it take for you to 100% the Snake Pass collect everything so come on come on come on yeah come on now come on now he's been wanting to do this for ages anyway so now you're all shy Co all right how do I jump again you don't you don't jump yeah you're a it's different for everyone but um I went through the game I'm done with Snake Pass I went through the game my neck speak French to W",
            "start": 979.76
        },
        {
            "text": "Co all right how do I jump again you don't you don't jump yeah you're a it's different for everyone but um I went through the game I'm done with this I went through the game my neck speak French to W this is I like this actually this is nice say it in French just like you doing over there um that's as far as it goes but yeah essentially I would say 15 hours I spend an hour in every level but um there were ways to do it quicker but I decided to do it one by one like that okay okay cool now 15 hours I'm just going to say you can clip this out guys use it however you want I'm just going to say 15 hours for a platinum trophy sounds pretty good that's legit I remember Taco Master my name is Mayo I got those a lot faster PlayStation so you should probably let him have a platinum trophy and if not I know where shui lives what do I do here he do Japan make it happen it I I called up my boy GameOverGreggy to bring me a beer he brought the beers everybody more beers the party continues to roll",
            "start": 1035.68
        },
        {
            "text": "not I know where Greg lives what do I do here he does live in Japan make it happen it I I called up my boy GameOverGreggy to bring me a beer he brought the beers everybody more beers the party continues to roll and the GDC Snake Pass party indeed I'm going to eat this bird are you going get did you do it yet did you get picked up didn't it's it Doodle's fault it's definitely Doodle's fault a doodle come on man okay I'm try I need I need to focus you guys are all talking about GameOverGreggy's girlfriend getting head on I'm like that's clearly my job all right so I'm hanging out here and then what I get to the top when you get you got to go like you got to go loose yeah keep climbing keep climbing keep climbing keep climbing keep wrong y like why here right why why why yeah yeah well why yeah oh yeah oh that's so then we so what is his move he's got he's kind of got to just jettison himself once he gets at the top I apologize Nick it's all right it's jet in myself yeah just hold a and shoot for the moon",
            "start": 1088.72
        },
        {
            "text": "so then we so what is his move he's got he's kind of got to just jettison himself once he gets at the top I apologize Nick it's all right it's jet in myself yeah just hold a and shoot for the moon okay I'll hold a and shoot for the moon yeah all right now get off my tail dog it's not the time come on dude back off back off D okay we're not stopping until we get this everyone has to keep drinking no I no we're getting this I speak French how many how many many times I don't know if that applies to this right now oh I speak French too it's just all right my what have you done Tom all right what has become of us all right now grip oh wait not yet no that's cool bring you back bring you back bring you back that's cool that's cool flying it's hard to be a snake and fly it's really not it's not you want to try this Greg sure I mean I don't think I'm going to do better than you for the record we're on hard right this this is hard this is one of the later levels we would have learned this",
            "start": 1140.16
        },
        {
            "text": "not you want to try this Greg sure I mean I don't think I'm going to do better than you for the record we're on hard right this this is hard this is one of the later levels we would have learned this method by now yes exactly exactly I think I got it I think I'm just going to stay here nothing that that can work too actually you know again so how do you gentis in yourself you just just it's kind of like running in Mario when you see like those really small platforms like oh crap do I just jump and you just run here you try it hand there I can't I don't know if I'm going to be able to handle it for the record I'm not confident in my handling skills here you got this if it was for the belt would you do it I'll do anything for the belt all right then maybe they should be for the Bel no it's too too soon it is Nintendo yeah but it's also we don't have the time trial thing going oh no no no so CL no snake remember got to know when to let go because well I like to say it's like driving a",
            "start": 1190.68
        },
        {
            "text": "too too soon it is Nintendo yeah but it's also we don't have the time trial thing going oh no no no so CL no snake remember got to know when to let go because well I like to say it's like driving a weird car sometimes when you take a tight turn would you you know hold on to the um accelerator okay okay kind I definitely hold on to the steering wheel though your analogy breaks down there well this is kind of a steering wheel you well the snake you always want to be moving left and right this is like weird drifting in a way app I was going to say we are big we are big F oh my God we are huge fast Fury fans over there so I'm going to doad over there we're just like literally I'm as Han basically oh man you going to fit in perfect we need a Han in our office can yeah thank you so much you know that means your fate is D oh but yeah but I did get the that's you got the M yeah you did Wonder Woman yeah indeed Wonder can you go wrong with that no all right okay now grip oh wait there you go",
            "start": 1237.68
        },
        {
            "text": "that means your fate is sealed but yeah but i did get the hang of it yeah you did wonder woman yeah indeed wonder can you go wrong with that no all right okay now grip oh wait there you go thats all right thats all right thats all right were just hanging there like like a yeah thats cool now see now see if you can wrap yourself around while gripping because the thing is when youre gripping no nod come get me and then we watch jason statham come out and murk him thats not i one more shot at it and then i want to see you do it well handle it okay yeah forget you know how to play this game yeah just a little good good i hope so anyway if not youre fired yeah i cant be done anymore if you dont get this in the first try hes going to fire you give me that look all right thats he's going to go speak french to your girlfriend and her wife oh thats not cool man thats not what im trying to be like that cord on blue corduroy blue ranch damn it snake help me all right",
            "start": 1283.56
        },
        {
            "text": "he's going he's going to go speak to your girlfriend and her wife oh that's not cool man that's I'm not trying to be like that cord on Blue Dragon damn it snake help me all right give him the controller I want it and I know he's got yeah you're almost there you're almost there there you go there you go there oh boy Greg I would like to see you come over here and try come do it let's go let's go Greg Greg Greg Greg the controls we're off to a good start one there you go I tried that didn't work didn't work there you go you got it you got that perfect just wrap around that and hold on for your life give a nice coil give a nice coil get a coil for Christ say not a straight line all right there you go all right all right all right come here come here no no no you're not passing it off sit sit on my lap Greg you're doing this sit on my lap amazing I don't know I was like so yeah I mean this whole time watching it I know why is the Y button there",
            "start": 1333.6
        },
        {
            "text": "you're not passing it off sit sit on my lap Greg you're doing this sit on my lap amazing I don't know I was listing so yeah I mean this whole time watching it I know why is the Y button there you go you did it this so hold down the A button hold down the A button lift your head I'm not there yet you can lift it though it's fine it's all good see how do I how do I hold myself you hold left trigger yeah left trigger when you're coiled around yeah when you're coiled around things I don't like this by the way this is not comfy you feel my trouser snake there if anyone's listening to this because we make a podcast we're not going to make it a podcast he's referring he's not referring to the game the game is fun he doesn't like the fact that Greg is in fact molesting him right now and what I think we call in the business world sexual harassment yeah there's a lot of heat going on over here too so yeah that's double jeopardy I can't be twice for the same crime that's very true that's",
            "start": 1393.12
        },
        {
            "text": "I think we call it in the business world sexual harassment, yeah there's a lot of heat going on over here too, so yeah that's Double Jeopardy. I can't be tried twice for the same crime, that's very true, that's very true. She's just shaking her head like what the **** who the **** are these people? Like I got to go, I got to go okay. So they keep saying make a tight coil, you've got good, good, good, good now hold it, I said I didn't know what you're good at, keep going, keep going up, keep going up, up dog, up top, up top, what's up dog? Come on let's see, up top, up top. Oh dude go for it, go for it, God damn, go lay down here, let's get you a surprise yeah you don't want your cupcake, God damn. Snake Pass is fun huh, oh my goodness so when is it coming out March 28th in the US, March 29th in the EU, in the UK sure, £19.99 look at that yes, $1.99, yeah of course, $199.99, British pounds okay yeah I don't know how much that is in Bison dollars though it's probably like three cuz you said five",
            "start": 1442.56
        },
        {
            "text": "the UK sure $19.99 look at that yes, £199 so $1999 yeah of course £1999 $16.99 British pounds okay yeah I don't know how much that is in Bison dollars though it's probably like three cuz you said five five British pounds if he how many is that in quid what does that equate to in quid? $1699 yeah in Australia it's $79 don't quote us on that one trillion yen all right great Snake Pass is really cool cool I'm glad you guys enjoyed it no thank you for coming by know than you guys for coming by and um big shout out to everybody at Sumo Digital and Snake Pass as well Seb, that guy is awesome over there he created this so more props to him yeah he has his own game I mean dreams came true yeah dreams came true so like the game those kids anymore no ladies and gentlemen this has been a let's play like subscribe share drink a beer if you're of age if not mom and dad probably aren't marking the bottles do whatever till next time it's been a pleasure to serve you",
            "start": 1503.84
        }
    ]
}