{
    "id": 4890,
    "video_id": "G6-j5r-cGFE",
    "show_name": "Animated",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Kyle Feduniw"
    ],
    "title": "Nick's Chair Rant - Best Kinda Funny Moments Animated",
    "description": "Animated by https://twitter.com/KyleFeduniw\nIntro by Cameron Kennedy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\r\n\r\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\r\n\r\nCheck out our store! http://www.kindafunny.com/store\r\n\r\nFollow us on Twitter!\r\nGreg - http://www.twitter.com/GameOverGreggy\r\nTim - http://www.twitter.com/TimGettys\r\nNick - http://www.twitter.com/Nick_Scarpino\r\nKinda Funny - http://www.twitter.com/KindaFunnyVids",
    "published_at": 1583758803,
    "duration": 124,
    "transcript_chunks": [
        {
            "text": "here's so yeah he's gonna get up he's gonna forget about it so again remind we're here now we're at Chase Field we're down there amazing seats we're sitting over the seats we get to take you know you've been folding chairs I was like do I can I leave this chair here and Tim goes no cool Greg wants him for the Hendersons and I was like okay pull it up and I looked out and I see the tray of condiments I looked over at Tim and I was like here's the chair and Tim goes no no you have to carry the chair in an active of course Nick I'm tired stubbornness I go up and I walk off and I stop off I didn't even notice mattered my foot goes right into the mustard I'm wearing all white Reeboks and he grabs a napkin he bends down starts cleaning issue and as he's doing it his foot slides out of his pocket and lanes in the mustard he's like no it is not so I get all the way up to the top and I asked him I was like hey what are we doing with this chair the Cougar goes I don't know because I'm carrying",
            "start": 6.47
        },
        {
            "text": "and lanes in the mustard he's like no it is not so I get all the way up to the top and I asked him I was like hey what are we doing with this chair the Cougar goes I don't know because I'm carrying this [ __ ] thing around I know Jesus of Nazareth my cross to bear is what I'm more tired than ever over my life like I need you just carry something so I neatly turn to this family it's walking by us like hey do you guys want not believing uh why I was like I just want to give it away I want to carry any more guys like why not and I'm like cuz it's a [ __ ] chair a chair yeah this chair okay I think that's like sure I'll take it okay cool great like looks he's not at least aware where's the chairs at and then he's like oh I just gave mine away I then look sad as I get addicted to the Cooper girls did I ask them to keep it in Spanish",
            "start": 49.8
        }
    ]
}