{
    "id": 634,
    "video_id": "_km13rad8YM",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "The First 15 Minutes of The Order: 1886 - Freeplay Fridays",
    "description": "We play the opening of Sony's latest exclusive.\n\n\nWe quit our jobs, please support us here: http://www.patreon.com/kindafunnygames\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation",
    "published_at": 1424462430,
    "duration": 1016,
    "transcript_chunks": [
        {
            "text": "what's up everybody welcome to Freeplay Fridays Colin yes I love you love you too buddy I'm glad we get to work together and do so much about it we our careers have been defined by PlayStation the first giant PlayStation 4 exclusive of the year is here The Order: 1886 uh of course maybe yesterday you caught us live streaming The Order: 1886 at 5 in the morning cuz we're crazy that's when the Embargo lifted today for Freeplay Friday though we've gone back in time mhm The Order just showed up at our house 1886 no not yet The Order just showed up at our house we're going to play the first 15 minutes of it this is our first time ever playing The Order in well in the yeah it's final retail let's be you know we played it it's our first time ever playing The Order from the jump as Tim would say you know what I mean this is it's out of the box the cellophane's off I'm setting a 15-minute timer are you ready yep 3 2 1 go no don't save there's no time for Save the first 15 minutes it is what it",
            "start": 0.12
        },
        {
            "text": "You know what I mean, this is it's out of the box, the cellophane's off. I'm setting a 15-minute timer. Are you ready? Yep, 3, 2, 1, go! No don't save, there's no time for Save. The first 15 minutes - it is what it is. It is what it is. It is whatever you want it to be. Now Colin, are you excited? I am excited. I'm looking forward to this game. I'm very interested to see yeah because like you said, there's a little time traveling going on. We filmed this the day we got the game, a week before it came out right, and uh they're probably talking right now. You care? Oh no, this just bubbles. He's underwater. Somebody's underwater. Sorry, we filmed it the day the game... never mind, the do's gone because he interrupted me already. The thought's gone. The do's gone. Nothing else to say. Let's just watch the uh the man not talking on the screen. I just want to make sure you're getting the experience you need. All right. I don't know why Mom and Dad to F here we go. Why can't freak give up the GH? Do you like this commentary? I'm",
            "start": 37.64
        },
        {
            "text": "on the screen I just want to make sure you're getting the experience you need all right I don't know why Mom and Dad are here we go why can't Greg give up the GH do you like this commentary I'm giving it's good oh he got a red cross on his torture that water seems kind of wet I'm going to turn up a little taking them off it's just getting started we'll come back and have another go later me right put the PR handcuffs back on come on get up up come on you still no gameplay that's fine that's okay time to play 5 minutes you think so yeah it's a pretty cutscene though mm oh looks great it's kind of what I expected honestly in terms of you not playing right away right yeah I mean I'm not mad about it it's not been that long it's been 3 minutes yeah I mean it's not almost terrible 2.5 I guess not a terrible thing terrible what if you got a trophy right now how happy would you be system so it would be irrelevant it's a guest trophy don't you're not logged in with me go for your morning",
            "start": 77.92
        },
        {
            "text": "not a terrible thing, terrible. What if you got a trophy right now? How happy would you be? System so it would be irrelevant. It's a guest trophy; doesn't you're not logged in with me. Go for your morning. Oh, they're just going to toss a bucket of water on them or shove them back in that hole. You think what do you think's going happen? I don't know. You think we're you think this is an Order character or you think we're a werewolf? Yeah, it's Gahad. Yeah, there you go. I wonder if this is like in the future. Yeah, right. And they're going to go once a night. This right. I don't think he's going to last much longer. No. Well, maybe later 1886. Why do you insist on doing this? Then we've seen this already. We've seen this. He's going to break for you. This here we go again. They just want to know like where the bodies are. You're about ready. These things take time. Put them back here. What do you think they're making? It takes time. Maybe it's rice. This is before Minute Rice. You know. I don't know if they've thought about",
            "start": 199.72
        },
        {
            "text": "you're about ready these things take time put them back here what do you think they're making it takes time maybe it's Rice-a-Roni, you know I don't know if they're thought about cooking oh look see he's he's almost got it out this guy's going to catch that bolt through the head **** time to gameplay four minutes **** I was close all right so the first thing you do in the game is a QTE good more of it isn't taking into account how hard it is to wrestle somebody who's wet I think he could get away from this one-armed guy you should have had to hold R1 down when you as you were pressing X one like Heavy Rain, the Origami Killer that'd be awesome if this took place in the same universe as Heavy right yeah right now I am a little Disturbed I mean my first impression of the game is that I'm a little Disturbed that it's teaching you how to use Quick Time events before it teaches you how to move or shoot sure that that tells me and maybe we're wrong that",
            "start": 265.96
        },
        {
            "text": "impression of the game is that I'm a little disturbed that it's teaching you how to use quick time events before it teaches you how to move or shoot, sure that that tells me and maybe we're wrong, that tells me that this will be a QT heavy game after all, mhm which something obviously people are speculated about and that's not necessarily anything wrong with that but yeah yeah yeah you'd prefer to be out there running gunning shooting Sho I so I'd like to I'd like to get to that, there you go, so we're going this way, oh looks like we got a touch screen coming up, huh use that old touchpad see look at it no no oh inter I remember that from uh the time we played a PlayStation I would dock points off this then don't do that with an icon that clearly should be a touchpad with control come on ready D Scurry like a rat you **** rat hey I'm just sitting here playing the game man yeah you can walk like a man you can Scurry like a rat you can walk like a man or scar like a rap but I don't think",
            "start": 327.96
        },
        {
            "text": "We play the opening of Sony's latest exclusive. We quit our jobs, please support us here: http://www.patreon.com/kindafunnygames Subscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1 This video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com Follow us on Twitter! Greg - http://www.twitter.com/GameOverGreggy Colin - http://www.twitter.com/NoTaxation\n\nWe play the opening of Sony's latest exclusive, The Order: 1886. We quit our jobs, please support us here: http://www.patreon.com/kindafunnygames Subscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1 This video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com Follow us on Twitter! Greg - http://www.twitter.com/GameOverGreggy Colin - http://www.twitter.com/NoTaxation\n\nWe play the opening of Sony's latest exclusive, The Order: 1886. We quit our jobs, please support us here: http://www.patreon.com/kindafunnygames Subscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1 This video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com Follow us on Twitter! Greg - http://www.twitter.com/GameOverGreggy Colin - http://www.twitter.com/NoTaxation",
            "start": 378.6
        },
        {
            "text": "through stuff shut up yeah are looking for you man hey somebody drank all my tea uh sounds like maybe the halves the Red Coats are bravely standing their ground though I don't yeah hey man they're used to this this is in their alternate universe they understand half they've got to die you run away from them they're just going to catch you your time's up from them I like the camera constantly very cinematic yeah no no yeah that's one of the reasons I think people think it's on top of just being pretty in general with graphics the the framing is really nice you know it's all very intriguing it does feel like like just move towards the door for God's sake just make a break for it he's been at this a lot longer than we have uh oh British elevator hands up oh nice threaten alright m w inside close them let's just talk this through shall we very polite very British you're him AR you convict everyone's talking about there's only one way out of here Walking Dead that's are gr BR",
            "start": 473.2
        },
        {
            "text": "m w inside close them let's just talk this through shall we very polite very British you're him AR you convict everyone's talking about there's only one way out of here Walking Dead that's are gr BR it's a joke Family Guy can make fair enough it's your funeral not mine I don't know if we're we're as clever or you're as clever as Seth MacFarlane think I'm as clever as Peter Griffin though that allow that yeah also I have horrible teeth myself so I do he has a gun make you're a little hard on it's like it's like when I say team fat cuz I'm fat I say fun oh come on man shot his own man yep speed this he's Us in the speed rationale it's empty who goes cuz you're going to find bullets oh oh there's going again oh now you're going to get to kick his ass when he yeah look what press right to quickly wait press to quickly assess situations oh I see okay that's it for this guy clown down clown down did you make that up CL down never heard that I don't know where I got that from it's gotta be from",
            "start": 562.52
        },
        {
            "text": "The First 15 Minutes of The Order: 1886 - Freeplay Fridays\nWe play the opening of Sony's latest exclusive.\n\nWe quit our jobs, please support us here: http://www.patreon.com/kindafunnygames\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nwait press to quickly assess situations oh I see okay that's it for this guy clown down clown down did you make that up CL down never heard that I don't know where I got that from it's gotta be from something I'm not clever enough to make got I pick that up you think you to it from Seth MacFarlane no yourself up M my next shot will not be a warning nice the what if this is where it ties in the next Assassin's Creed the play is over Gad surrender yourself oh raise your hands now raise your hands hands up cuz that's the order there right mm gray don't do this I it must be the end then we're accidentally playing the last 15 minutes of the game you betrayed our order no one may escape the penalty you forget Lord Chancellor I'm as good as dead already jeez Louise that a good opening I like that opening The Order: 1886 TM love their trademarks man they got it don't want some kid coming in here knocking it off just so you know we made this game and we own don't think you can just go home make your",
            "start": 653.44
        },
        {
            "text": "The First 15 Minutes of The Order: 1886 - Freeplay Fridays\nWe play the opening of Sony's latest exclusive.\nWe quit our jobs, please support us here: http://www.patreon.com/kindafunnygames\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nthe Order 1886, love their trademarks man they got it don't want some kid coming in here knocking it off just so you know we made this game and we own don't think you can just go home make your own Order: 1886 where are we on the clock we're getting close Man 2 minutes 33 seconds oh there's London, I read you, personal enjoying a stroll in the park are we nothing quite like a chilly London to stimulate the senses always a night what was the first what was the last one something about night two night T nope that was the heat so what about a month there in difference October November and I the Indian House India House I can't hear so I don't know what yeah just keep looking at them, you get a prompt there you go do it in this the smooth way like you know like when you're seeing a game and they play like like they're like yeah E3 demos of like Uncharted when they run up onto a thing like sh hand around slowly let's go to Pi pickling ping I go for some",
            "start": 772.96
        },
        {
            "text": "like when you're seeing a game and they play like they're yeah E3 demos of like Uncharted when they run up onto a thing with their hand around slowly let's go to pickling ping I go for some pickles good job thank you found it yeah for everyone out there we can't hear the game so I'm sure they're saying something but you kind of cross-eyed there got kicked in the head by a horse secondary should help no it's okay you can shut up Nick when I want to know how to grow a deliciously handsome beard I'll talk to you until then understood are you joining us I have a small matter to attend to I'll find you after you should shave your face when you're ready shave that into the Gahar Khan Galahad I'm sorry I apologize Gahar solo Gahar solo don't apologize to me apologize to R. Dawn for not knowing the character's name ready Dawn on PlayStation show I've let you all down today um it's I mean there's a lot of things it's I blame my upbringing uh I blame my parents my teachers no one",
            "start": 830.16
        },
        {
            "text": "not knowing the character's name, Arden Raphaël, on PlayStation show I've let you all down today um it's I mean there's a lot of things it's I blame my upbringing uh I blame my parents my teachers no one really focused on like I don't think Greg understands how to read every syllable of the word it was kind of like he's got the basics now we just let him go out and everyone's always for you know years writer for years and years everyone's always like it's kind of fun listening to Greg talk it's like jazz he never says the same things the same way but today I've let the PlayStation Nation down by referring to Galahad very pretty environments the movement is really cool the look at the the cloth physics man on point Jesus Christ is that the end yeah the duck means it's been 15 minutes all right that's it that's the first 15 minutes of The Order: 1886 remember ladies and gentlemen we put up a let's play here on youtube.com/kindafunnygames each and every day Colin and I Left podcast be",
            "start": 896.72
        },
        {
            "text": "that's it that's the first 15 minutes of The Order: 1886 remember ladies and gentlemen we put up a let's play here on youtube.com/kindafunnygames each and every day Colin and I left PodcastBeOn and we do this other podcast now called The Kinda Funny Gamescast you should pick it up it posts here as a video each and every day you can get it on iTunes everything every Friday too as well um what you think you're your first 15 minutes of the Order I don't know it's not enough time for me to judge the game sure of course um it looked like fun I'm intrigued to go play it you know what I mean it looked like a fun opening now I got to do it all over again I'm on console Greg yeah then you'll get the trophies and you'll feel really happy and at home with everything you'll be making your own progress ladies and gentlemen what do you think of The Order like I said you probably watched us play three hours of it yesterday on twitch.tv/kindofunnygames I hope but it's out today for you",
            "start": 949.76
        },
        {
            "text": "progress ladies and gentlemen what do you think of The Order: 1886 like I said you probably watched us play three hours of it yesterday on twitch.tv/kindafunnygames I hope but it's out today for you in the entire world so let us know what your opinions are down in the comments then keep coming back here for new videos each and every day shut up Nick you're really mean to Nick I know but it's cuz I just feel the world's built him up too much and someone needs to put him down a little",
            "start": 980.24
        }
    ]
}