{
    "id": 606,
    "video_id": "TCgtVQHlJrw",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Metal Gear Solid Open World Remake - Kinda Funny Gamescast Ep. 06 (Pt. 3)",
    "description": "Kojima wants to remake Metal Gear Solid as an open world game.\n---\nWe quit our jobs, please support us here: http://www.patreon.com/kindafunnygames\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1423663201,
    "duration": 610,
    "transcript_chunks": [
        {
            "text": "All right guys, next topic. Kojima wants to make an open-world remake of Metal Gear Solid 1. But he says he's too busy and no other studio has stepped up yet. Sorry. If you just heard scratching that was because Colin was scratching his crotch. Sorry. He's got something on there. I have a little ketchup from my lunch, which is eggs and rice. It's happily placed right on top of your...penis. That's a good place. That's one of my favorite places in the entire world. I forgot we're not doing the GoG show. Oh, it doesn't matter. Okay. It's fun. Okay. Anyway, yeah, so he wants to do that. Yeah, well is it news? Well, exactly. So far, he's attached open-world elements, don't get me wrong, you know I love Kojima, I'm not...I love him",
            "start": 0.0
        },
        {
            "text": "Yeah, well is it news? Well, exactly. Well, so far, he attached open, now don't get me wrong, you know that I love Hideo Kojima, I'm not, you know, I love Guillermo del Toro, so I want this to happen. But in 2013 he made this announcement. He'd love another studio to work on it. In 2014 he talked about it again. Now, in 2015 here he is and all he's done is added Open World to it. Well, I think that's a, to me that's the biggest issue with this because I want him to do this. What's the big, what's the biggest issue? I, I definitely want a remake of one. Yeah. We already got it with Metal Gear Solid: Twin Snakes. His idea. And it was amazing. I really liked Metal Gear Solid: Twin Snakes. I loved Metal Gear Solid: Twin Snakes. A lot of That's why I bought my game. So the first person broke it. Yeah. The grey fox ninja battle you just stood on one side of the office and shot. Some mother fucker by the way I said that, on Twitch, that it broke the grey fox battle you mean",
            "start": 40.51
        },
        {
            "text": "stood on one side of the office and shot. Some motherfucker by the way I said that, on Twitch, that it broke the Grey Fox battle you mean Revolver Ocelot, and I'm like no, granted same argument but Grey Fox was really hard. The Revolver was never hard, just running around the pillars with them. Yeah. But now, they made it really easy. Exactly. Yeah, you just stood in one spot and then, like, picked them up. But, the Grey Fox, I remember me and Pho playing through the Ninja Battle forever. It was like sweat, like the giant beads of sweat. Yeah. As you're playing trying not to, and then like, in this one, yeah, I just run, like, back into a locker, pop, pop, pop Yeah, exactly. But, and also, there's all the VO changes in the. And stuff, which I never had that big of a, a deal with. And all the ninja acrobats and stuff. People, you need to calm the fuck down. Rob Paulsen way. What? Rob Paulsen was a ninja in that game. Really?\n\nI corrected the following errors:\n\n* \"wing grety\" → \"Tim Gettys\"\n* \"grey fox battle\" → \"Grey Fox battle\" (proper noun)\n* \"revolver rasa\" → \"Revolver Ocelot\" (correct character name from Metal Gear Solid)\n* \"Pho\" → assumed to be a nickname or handle, but left as is since it's not a clear error\n* \"Rob Paulson way\" → \"Rob Paulsen way\" (correct voice actor's name)",
            "start": 75.72
        },
        {
            "text": "A deal with. And all the ninja acrobats and stuff. People, you need to calm the fuck down. Rob Paulsen way. What? Rob Paulsen was a ninja in that game. Really? Gray Fox, I didn't know that either. So I, somebody tweeted at me about it. Huh. And I believe him. That's pretty awesome. Yeah. Anyways, I would love a remake on the new gen systems and stuff. Jesus, yes. Be a great play through for a lot of people that haven't played Metal Gear One. Somehow. But. You're all monsters. This open world idea. That's me. What the hell? That's what doesn't make sense to me. So, all right, MGS 5 is open world, cool. That's gonna be a new experience and stuff. You can't make Metal Gear Solid 1 open world. Like, Metal Gear Solid 1 it's like Resident Evil or it's like Metroid and all this stuff where it's like Shadow Moses was a thing. Yeah. Like you are in a building.\n\nI corrected the following errors:\n\n- \"Rob Paulson way\" to refer to Rob Paulsen, an American voice actor known for his work on animated shows.\n- No other changes were made as the text seemed coherent and accurate.",
            "start": 109.21
        },
        {
            "text": "Metal Gear Solid 1 it's like Resident Evil or it's like Metroid and all this stuff where it's like Shadow Moses was a thing. Yeah. Like you are in a building. Yeah, but are you remaking that? Like. That's what he's saying. It's a complete remake? Th, th, that doesn't exist, but yeah. Well, that's We saying he'd love the remake to be made, but also be Open World. That would be awesome. And you're on Shadow Moses Island. Yeah. It doesn't really make any sense though. I mean, you could have the facility and then just be able to explore out into the island and have new buildings and facilities. But that's . For it to be Open World. I hear ya. I hear ya. I hear ya. That would, that would require. To be Metal Gear Solid 1, plus all this other stuff, and that just, it, it just makes no sense. But if you be like Ground Zeroes, where",
            "start": 141.64
        },
        {
            "text": "other shit, and that just, it, it just makes no sense. But if you be like Ground Zeroes, where you're playing through one story, that's the story but then there's all these little side missions to go do or whatever to go off on the side. And I'm not saying, don't, I'm not saying. Well. It's an easy sell, I'm with you. Yeah. That Metal Gear should be remade, probably just still be Metal Gear, but. Yeah I think, I,I think that, yeah. I mean, I, I agree with Tim. I, it doesn't make any sense. Unless, unless the game's totally rewritten. Because the idea, it's great that you brought up Resident Evil. Very astute, I think, because it, does remind me of the mansion in Resident Evil or the sh, or Ishimura in Dead Space. Like, it's a place you exist in and go back and forth in, but it's not really an open world. Just a non-linear space like, like the castle in Castlevania or something. It's, it's the, in Symphony of the Night",
            "start": 172.75
        },
        {
            "text": "Back and forth in, but it's not really an open world. Just a non-linear space like, like the castle in Castlevania or something. It's, it's the, in Symphony of the Night or something. It's the same thing you're backtracking all over the place. Yeah, it's like you go through the same thing multiple times. You're familiar with the area and it's like oh, now you have this key so you can go through this door. Like you'll all these different things. I wonder if something was lost in translation with that. Like. You know, with him. Well, no. He's he's, he's making an Open World Metal Gear now, right? He is, but, but, yeah, he is, but, but, he knows them just well enough to know that that's not an open world game so I'm, I'm wondering, like, what, you know, what, what the intent is, what he's saying. If he means- He's trying to entice people on it. No one's buying this pro, no one's buying",
            "start": 208.75
        },
        {
            "text": "what the intent is, what he's saying. If he means- He's trying to entice people on it. No one's buying this pro, no one's buying this pitch he's selling. Well, look what happened to the last, look what happened to the last company that, that made a, a Metal Gear game. Yeah. They made one good game and then they kept screwing up. Nobody's biting on this, so now he's trying to spruce up the deal. It's like when you're trying to sell your- It's like when you're trying to sell your friend Tim Gettys a vacuum. Uh-huh. And the conversation's gone really cold after the first offer of buying the vacuum. And now you're like, you know what? I'll throw in an HDMI connector, controller. Open world, open world vacuum. Wi-fi Yeah, I think, I think it is a matter of, of, pacing, right? Like the beauty of which I think is a better game, is the pacing of the game. Sure. How you run in, like, I can see in my head as clear as day",
            "start": 236.95
        },
        {
            "text": "Right? Like the beauty of which I think is a better game, is the pacing of the game. Sure. How you run in, like, I can see in my head as clear as day how you go through that game. And how you encounter the enemies in the order, when you encounter Vulcan Raven or something like that. Like, where it happens. And where it's your first introduction to Sniper Wolf. Sniper Wolf. Just talking. Or, when you see, when you see the most beloved of all Metal Gear enemies, Decoy Octopus. Let, let, let's not forget. I've heard of him, her- You know, like there's something special about him moving through that game in a certain way. You're able to back track somewhat, but not always and, you know, it's about. It's, it's not like Mega Man where it's like you go in any order you want. And that's the thing that disturbs me when it's. When it's, they're talking about an open",
            "start": 266.76
        },
        {
            "text": "like you go in any order you want. And that's the thing that disturbs me when it's. When it's, they're talking about an open world Metal Gear game is that no, it's, it's Revolver Ocelot first, then it's Vulcan Raven. You know, like you don't. Yeah, but couldn't they still do that? You don't do them in the other. No, because I feel like you're getting more weapons and new weapons and different things. Like, the game works with a certain rhythm that I don't think works. I actually think Big Shell would be an easier place to do an open, like an open worldish game if you had multiple. Shells. But even then, it would rewrite the game itself. Like, Metal Gear games aren't open world until four, or until five. Potentially, but I mean, aren't you. Open world is such a misleading term, because you are working your way through a linear story. Like, most open world games have a linear story. It's their main plot that you have to work",
            "start": 309.33
        },
        {
            "text": "linear story. Like, most open world games have a linear story. It's their main plot that you have to work your way through. Grand Theft Auto had, Fallout had it, everything has it. You're supposed to, you are achieving objectives one at a time and they are coming one after each other. I still think you can base a game like Metal Gear off of that. But then you're right, you just have a bunch of crazy side quests that you probably don't need to do or you can go do and they're just totally crazy and people are gonna spend millions of hours doing them and having fun with it. Well, see but that's Ground Zero. Like that. Yeah. That is that. And that is the story that Ground Zero has, that is very just kinda. Okay. There's a very thing happening. Sure. And you gotta rescue this person. And that's it. Mm-hm. But with Metal Gear, it's like the only reason you're in this",
            "start": 344.45
        },
        {
            "text": "There's a very thing happening. Sure. And you gotta rescue this person. And that's it. Mm-hm. But with Metal Gear Solid, it's like the only reason you're in this place is to do this thing. And like outside of it. If there was weird. Like it'd be weird having side missions. In the story of Metal Gear Solid 1. We're trying to stop nuclear war. It's like. But, hey. But, hey, can you please find my monkey? Yeah. He got away with my You know what I mean? Yeah. Yeah. And drummin's just chilling on the last You know they'll do something stupid. But it, yeah, it just doesn't make sense. It's hard but what do you make of Metal Gear Solid one and stuff. Pardon the ignorance. Does, does Arkham Asylum count as an open world game?",
            "start": 375.42
        },
        {
            "text": "Make sense. It's hard but what do you make of Metal Gear Solid one and stuff. Pardon the ignorance. Does, does Arkham Asylum count as an open world? No, right? That's kind of a linear. Hm. Kind of more enclosed. That's like the mansion. Yeah. Arkham City. Open world. Arkham City is an open world game. But Arkham Asylum isn't really an open world experience, it's more linear. You can go backwards to get something you missed, but it's not a true open world experience, maybe that's kinda what Hideo Kojima wants to do with Metal Gear Solid. No. I, I, I understand. How about if I throw in a cup of coffee? I understand, I understand what you're saying.",
            "start": 398.58
        },
        {
            "text": "with it no I understand how about if I throw in a cup of coffee I understand what you're saying I think my bigger hang up is that I just don't think Metal Gear Solid needs to be touched again like Metal Gear Solid's already been remade so move on you know like it really doesn't need to be and like even if we just got recently we saw Resident Evil Remastered yeah that's what it's called mmh yeah the remake remastered yeah if we just got Twin Snakes remastered that'd be cool yeah I would be absolutely fine with that as well the bigger hang up with that is that Nintendo published that game mm yeah so bastards so this is this might be this actually might we actually might be getting to the core of the issue which might be that Kojima wants a new",
            "start": 433.39
        },
        {
            "text": "So this is, this might be. This actually might, this, we actually might be getting to the core of the issue. Which might be that Kojima wants a new remake because he doesn't own the other remake. You know, so like he can't do anything with it. I think Silicon Knights was funded by Nintendo to do that game. Yeah. Produced it. He definitely loves putting out freaking collections of Metal Gear. And he loves, and he has like a random obsession with. With, with. I mean, he has a random obsession with a lot of things, obviously. But, but he likes going back randomly to old games. I mean, they just patched trophies into Final Fantasy XIV last year, which is weird. Yeah. You know what I mean? So like, he, it might just be on his mind. Like, the original Metal Gear Solid just might be on his mind as he makes this new game. But I would rather see. I really, I think Metal Gear Solid 2 is the best Metal Gear game. With that said, I never beat three and",
            "start": 467.41
        },
        {
            "text": "Metal Gear Solid two is the best Metal Gear game. With that said, I never beat three and four, I got most of the way through, and I was like I can't stand this game. Oh, my. Peace Walker son. Three I didn't like, because it got too in to the weave, we've talked about this many times. The games like way too in the weave. Like when I saw that my rations were getting eaten, I was like what the fuck. Like I just want to, I just want to chill. Like, I don't want to be like, just leave me alone, let me do my thing. The camo and all this shit. Metal Gear Solid three rubbed me the wrong way, I always meant to go back. Can play though again. But two oh, two is so good. Game play wise. Oh, my god. That game is so good. And I like to see them re-imagine that game, remake that game. I, I would be shocked if that ever happened. Yeah, exactly. It's the same thing I want, I want them to",
            "start": 501.25
        },
        {
            "text": "That game is so good. And I like to see them re-imagine that game, remake that game. I, I would be shocked if that ever happened. Yeah, exactly. It's the same thing I want, I want them to just bring Peace Walker to Vita, with trophies. And you know, that, that's not gonna happen. I mean yeah, that, that should have happened. It should have. I, I- The collection came out but it was just the PSP version- I can't believe that, and that's so upsetting to me. And on, and then on PS3, there is the version with trophies. I said guys. Yeah, and I said, why didn't you just do this? Yeah. And he's like, oh, cuz you can download the PSP version. It's like, well, that's not HD. That's not my Yeah. My suspicion is that with Konami's limited resources that they saw, and Metal Gear's collection probably did not do very well and beat them and so they were like there is no reason to do this again. Well, that's the thing is that",
            "start": 533.87
        },
        {
            "text": "Very well and beat them and so they were like there is no reason to do this again. Well, that's the thing is that collection should have had it. Cuz it didn't. At the get go, yeah. It should have had won too. Well exactly, and that's the other problem. So far all the collections, they have all the discs and all the stuff, except for one, and that's a download code of just the original. Which is fine, but when all of the rest of them look similar, or at least 2 and 3. So, I guess it's not all of the them. But, at least they're all HD, you know, they're all but. Except for one, so a remake would be tantalizing. Tantalizing. Yeah.\n\nI corrected spelling errors (\"cuz\" to \"because\") and phonetic mistakes (none found in this chunk). I also capitalized proper nouns like names of games or collections, but none were present in this chunk.",
            "start": 567.6
        }
    ]
}