{
    "id": 577,
    "video_id": "xR3XuvOxefM",
    "show_name": "Miscellaneous",
    "hosts": [
        "Tim Gettys"
    ],
    "title": "Monty Oum Tribute",
    "description": "We love you Monty.\n\nSupport Monty's Family: http://www.gofundme.com/MontyandSheena\n\n\nPlease share your favorite Monty Oum videos. Here are a few of mine:\n\nDead Fantasy 2: http://youtu.be/c-rTM9qOasQ\n\nThe Tex Fight: http://roosterteeth.com/archive/?id=1344&v=more&s=8\n\nSpiral: http://roosterteeth.com/archive/?id=3766&v=more&s=9\n\nThe Best RvB Ever: http://roosterteeth.com/archive/?id=5845&v=more&s=10\n\nRWBY \"White\" Trailer: http://roosterteeth.com/archive/?id=6934&v=more\n\nRWBY Volume 2 Ep. 1: http://roosterteeth.com/archive/?id=9439&v=more\n\n\n\n\nSong is Wings from RWBY: https://itunes.apple.com/us/album/rwby-vol.-1-soundtrack/id785720869\n\n\nThe beautiful fan art by Nijuuni: http://nijuukoo.tumblr.com/post/109931506787/tribute-to-monty-oum-x-rest-peacefully-monty",
    "published_at": 1422988201,
    "duration": 195,
    "transcript_chunks": [
        {
            "text": "It's really hard for me to say that after a very hard-fought battle Monty Oum has passed away; he's a friend, an unmatched talent, and one of the biggest inspirations of my life. I've never met someone who's creative or hard-working, but if I had no money at all, the last thing he would want is for us to be sad. So I want to take a look at some of the amazing things he has poured his passion into. For me, it all started when he broke into the internet with \"Dead Fantasy.\" I remember being shocked that was even possible for it to exist; the animation was so fluid, the choreography was so creative, and just seeing two of my favorite characters fight without the restrictions of developers made sure that I posted on all of my friends' MySpace pages. And to have it all end in a K-pop dance-off – this guy just gets me! And to imagine that he made the entire video by himself was awe-inspiring, especially at a time when I was just getting started in Internet video. And then \"Dead Fantasy\" parts 1 & 2 dropped; it felt",
            "start": 0.06
        },
        {
            "text": "and to imagine that he made the entire video by himself was awe-inspiring especially at a time when I was just getting started in Internet video and then Dead Fantasy, when parts 1 & 2 dropped, it felt like everything just paused for me; everyone in my class stopped what they were doing and gathered around the computer screen with their jaws dropped for 15 straight minutes from Tifa's Limit Break to accurately using various spells all the way down to the potion Monty's attention to detail and love for not only his work but for the franchise that inspired him to work as hard as he does really makes it all so special; and let me tell you I was one of the biggest Red vs. Blue fans in the world, nothing was as special as when that Warthog broke through the wall in Season 8; I will never forget actually out loud saying holy before I called Alfredo and made him watch out of Starbucks while I was on the phone with him so I could hear his reaction and the crazy thing is I instantly knew it",
            "start": 37.14
        },
        {
            "text": "actually out loud saying holy before I called Alfredo and made him watch Out of Starbucks while I was on the phone with him so I could hear his reaction and the crazy thing is I instantly knew it was Monty's - I had followed his work for so long and there's simply no one's that style and that's polish I just couldn't believe that Rooster Teeth and Monty Oum were working together it was like my favorite worlds just collided and man those three seasons of Red vs. Blue just kept getting better me and Kevin would watch every Monday hoping it was Monty time and every time it was somehow it was cooler more creative and more rewatchable than the last four years I had grown with these characters and now they were given a whole new life with expression personality and unnecessary backflips and then Ruby he did it he made his own anime after years of having to do it all by himself he now got to work along on a team some of the most talented people in the industry to make his vision",
            "start": 72.33
        },
        {
            "text": "and then Ruby, he did it, he made his own anime after years of having to do it all by himself; he now got to work along on a team with some of the most talented people in the industry to make his vision and characters come to life. To see him at RTX or PAX or Comic-Con and to see the reaction you could get from thousands of cheering fans, I will always feel overwhelming pride for him and how far he pushed his dream. I will never forget the day I first met him and got to tell him how influential he was to me; we ended up talking for hours about how you would listen to a song on repeat for months, piecing together fights synced to the beat in his head, and how he had this crazy idea for someone to fight with nunchucks made of shotguns that Woodcock as they swing around – it. He just couldn't get it to work; now of course knowing Monty, months later I saw you manage just fine, Zamani. I just want to say thank you, thank you for the years of entertainment, for inspiring me to do what I do, and for being such a good",
            "start": 108.9
        },
        {
            "text": "of course knowing Monty months later I saw you manage just fine Zamani I just want to say thank you thank you for the years of entertainment for inspiring me to do what I do and for being such a good friend memory is the key and your memory will live on forever and all of those you and your work have touched my heart goes out to you Sheena and the entire RoosterTeeth family and community there's no somewhere out there mommy's at a DDR machine with unlimited quarters doing his thing the only way he knows how so today go out and show your favorite Monty Oum video with everyone you know and on behalf of everyone it Kinda Funny we love you Monty you",
            "start": 146.04
        }
    ]
}