{
    "id": 592,
    "video_id": "Yi6y7VK5BpA",
    "show_name": "Reactions",
    "hosts": [
        "Tim Gettys",
        "Nick Scarpino"
    ],
    "title": "Live-Action Zelda Netflix TV Series - Kinda Funny Reacts",
    "description": "Get everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get you PC here www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino",
    "published_at": 1423263006,
    "duration": 327,
    "transcript_chunks": [
        {
            "text": "All right guys, I'm Tim Gettys, this is Nick Scarpino. That doesn't matter. A Legend of Zelda series might be coming to Netflix. Holy crap, holy cannoli! This is huge. Yet another reason why I'm glad I was an early subscriber to Netflix. Oh yeah, yeah. This is huge news, man. And you know, I'll be honest: like when I first heard this, like Netflix is a perfect platform for this. They're going to do what they always do, hopefully fingers crossed, which is they're going to buy an entire season. Which will be nice in terms of the budget; it won't be 24 episodes; it'll probably more like 12 episodes. Uh, and you're going to be able to watch it all at once just like you would be able to play the game all at once at your leisure. You take in the content as you want to take it in. No no more commercial breaks; none of that stuff. I'm excited about this. So where this stands right now, this is from a report from The New York Times and Wall Street Journal. Yes, and so they just announced this thing that",
            "start": 0.24
        },
        {
            "text": "of that stuff I'm excited about this so where this stands right now this is from a report from The New York Times and Wall Street Journal yes and so they just announced this thing that this is a thing and they reached out for comment Nintendo didn't say anything Netflix didn't say anything so right now this is very very rumor I mean this is the biggest this if this is true which I hope to God it is this is the biggest thing that's come to Netflix ever m i mean this this is this could be bigger than Game of Thrones for HBO this that's because it's it's Game of Thrones but it's for a wide audience like this is for for kids for adults it's for everybody whereas Game of Thrones like you can't be showing the the kids that no you can't I mean the most exciting part is for the one the 0.001% of people that don't know what The Legend of Zelda is or for all those hardcore PlayStation fans or Xbox fans this is going to be a great entry point into the series for me cuz for all",
            "start": 34.48
        },
        {
            "text": "one of the 0.001% of people that don't know what The Legend of Zelda is or for all those hardcore PlayStation fans or Xbox fans this is going to be a great entry point into the series for me cuz for all of them that are like uh he doesn't talk he doesn't say anything I'm gonna tell you something he's definitely going to say they're going to have to make him talk right uh what age do you think they're going to cast him at well young Link he's going to start young he's going to be a little boy the one thing that they did say was that cuz he looks like he's about 16 this this image is from a fan CGI thing so this has nothing to do with not the series but you know hopefully we'll get some age going here The thing with Zelda is there's so many different like um canons to it and so different like takes on the same story so I don't know what we'll get here but it'll probably be the same idea Link's a young kid there's a Princess Zelda they're",
            "start": 74.84
        },
        {
            "text": "like um cannons to it and so different like takes on the same story so I don't know what we'll get here but it'll probably be the same idea Link's a young kid there's a Princess Zelda they're in the world of Hyrule he needs the savior Ganondorf is this evil pig monster he might not be a pig monster he might be a dude named Ganondorf we don't know but it's exciting it's very exciting if you had it last question if you had to choose a series as far as the storyline goes that they would as a jumping off point for this what would it be I'll put you on the spot there well I mean I I feel like it's the easy thing of talking of time yeah but that would be so hard with cuz then you would need the young Link you need the Old Link but that would be the most satisfying that would definitely for the fans I think that's what they were shaking his head behind the camera it's not that hard you cast two people and you go you have awesome yeah well I know but I'm just saying like I guess I guess you're",
            "start": 110.36
        },
        {
            "text": "I think that's what they were shaking his head behind the camera it's not that hard you cast two people and you go you have awesome yeah well I know but I'm just saying like I guess I guess you're right but I'm saying in terms of it's not just casting the two people then you have the whole you have to deal with the same place the old version and the new version so it's a lot of production it's a lot of production design see I think is this from the video side where it's like cuz you know we didn't we didn't work on this but back in the day IGN made the the April Fool's video for the Zelda movie trailer great great April Fools' trailer exactly and imagine that but a whole series no I mean that's that's I think what we're all imagining you know don't count Netflix down they are not a budget house these guys are Netflix is going full steam they're throwing tons hundreds of millions of dollars into their original programming Daredevil they Daredevil looks fantastic that trailer looks legit",
            "start": 148.92
        },
        {
            "text": "these guys are Netflix is going full steam they're throwing tons hundreds of millions of dollars into their original programming Daredevil it looks fantastic that trailer looks legit it looks like a show better than it's on TV right now so I mean they're going to put I would not be surprised if they put more than House of Cards money into this easily easily so here's my question to you do you think this is going to happen I want it to happen I just worry that there's you know when you're developing your own original IP it's really really easy it's it's easier to get that to move forward right so Game of Thrones there was not the only person I could really say no to that was George R. R. Martin there was no other kind of barriers or gatekeepers for that Nintendo has kind of historically been um a little harder to work with on that side kind of a dick well on his own series he is man um but they're very very protective of their IP and rightfully so because their core content",
            "start": 183.88
        },
        {
            "text": "been a little harder to work with on that side, kind of a dick well on his own series he is man um but they're very very protective of their IP and rightfully so because their core content offering you know their core IP is Mario Zelda what am I missing that's right Metroid Star Fox there you go um you know these are their these are their flagship series you can't screw it these and so you know we all remember what happened back in the early 90s with Super Mario no it was a great movie yeah it was uh I don't know if your definition of great is a little different than mine um I think there I think if it happens it's going to be amazing I hope it happens I think this would be cool another reason for me to keep giving Netflix my 8.99 mon I just hope that at some point Link says excuse me princess that's all I need anyways let us know in the comments what you think about this obviously we're excited I don't think it's going to happen this is just too good to be true and it's one of those things",
            "start": 220.64
        },
        {
            "text": "all I need anyways let us know in the comments what you think about this obviously we're excited I don't think it's going to happen this is just too good to be true and it's one of those things where it's like all right all right this ain't happening but let us know what you think and until next time come back to it's not that hard like lay the link figure down no like lay him in front of the connect there 10 years have passed in the shot what I don't even get he's dead no that's the future see like this is the shot when he standing up that was present day and then when you laid him I'm saying is is like to set to make this set to make this set into the future you just push him down you put some cobwebs yeah what Greg's saying is you go to a a party house supply store and you get some cobweb and the scene and put a coup C up BR that definitely be you know game accurate just put link down and put some cobwebs up go like this there you go was that Prince or was that Zelda that's Prince",
            "start": 254.92
        },
        {
            "text": "and the scene and put a coup de grâce up, that definitely be you know game accurate just put Link down and put some cobwebs up, go like this, there you go, was that Prince or was that Zelda? That's Princess Zelda. Get off the set.",
            "start": 298.72
        }
    ]
}