{
    "id": 1455,
    "video_id": "cluJmKlXmNQ",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Best Xbox Games of 2015 - Kinda Funny Gamescast Ep. 50 (Pt. 4)",
    "description": "We take a look at the best Xbox and PC games of 2015.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1451570401,
    "duration": 1188,
    "transcript_chunks": [
        {
            "text": "Best Xbox Games of 2015 going down the games Halo 5 just that that's it I totally like it's just like and it's and I'm not it's just playing it it was like right this is Halo and this is why I'm not a Halo fan like I just felt it was I'm playing co-op with Christine you know what I mean we got halfway through the game in a night thought it was forgettable MH I understand why people love it I played multiplayer for a couple hours I was like all right yeah cool but it's just like it's time to admit that I'm just not a Halo fan you know what I mean like I'm on the other side of that completely where it's like it's I played a bit of the single player and it's just like this is why I like Halo that's great I'm glad you like it you know what I mean but um yeah I mean it there was a couple things that it's not Halo I've talked about this before but the the lack of the couch Co-op I'm like well **** that took away my Halo experience and um so I was upset about that I'm not so much an",
            "start": 0.33
        },
        {
            "text": "things that it's not Halo I've talked about this before but the the lack of the couch Co-op I'm like well **** that took away my Halo experience and um so I was upset about that I'm not so much an online guy so like multiplayer doesn't mean anything to me yeah um and yeah the single player overall not the best story so it was a forgettable Halo game but not I wouldn't say just for me just Greg Miller not as a Critic just as Greg Miller playing games over there um wanting to play Destiny instead of this because Destiny is more fun and Progressive Gears Remastered or Ultimate Edition, whatever you call it played it at for Let's Plays with Alfredo I was like oh cool never went back to it I was never I mean I I'm one of the guys who appreciates what Gears does I play I think I've played every Gears like I mean we did the Gears 3 thing at IGN I definitely played Gears 2, Gears One I didn't have it one but I played at a friend's house so I'm like yeah more Gears cool and I",
            "start": 49.44
        },
        {
            "text": "I've played every Gears of War like I mean we did the Gears 3 thing at IGN. I definitely played Gears 2, Gears One - I didn't have it one but I played at a friend's house so I'm like yeah more Gears cool and I was like but it's not like something that Drew me back where I felt like I needed to go play it. Yeah I the only Gears game I played I beat One back in the day yeah and then seeing this I was like oh **** it's looks way better yeah yeah yeah did you play it at all? Not remastered, no no um but that that's another one kind of seemed like came and went but I guess that's just with all the remas - yeah remaster it's just like it's going to speak to an audience right and then we'll see what happens. Rise of the Tomb Raider was a game Tim, a game that everyone should play. MH you can't because it's not in every console and it didn't really sell well because it's fall late ate its lunch but yeah great game man that's another we're talking about it earlier in this show",
            "start": 92.36
        },
        {
            "text": "MH you can't because it's not in every console and it didn't really sell well because it's fall late ate its lunch but yeah great game man that's another we're talking about it earlier in this show like the gameplay Loops right like that game has a great gameplay Loop of like I've got to a new area and the mission is on the other side of the area but **** I see a coin chest over there and I'm going to take this side mission and that just unlocked all these new things and all crap I'm close to a and like two hours later you've 100% of the area and you're like now let's go do the story Quest and go let's move on there beautiful fun uh it's a game that I feel like at the end kind of does the video game thing I hate where it's like let's give you some of the most annoying parts to remember us by and it's like and like the thing of course would is that if I was into achievements and wanted 100% that game or 1,000 points I would then have gone back and replayed the stuff I missed",
            "start": 132.92
        },
        {
            "text": "us by and it's like and like the thing of course would is that if I was into achievements and wanted 100% completion in that game or the 1,000 point achievement I would then have gone back and replayed the stuff I missed, the caves and whatnot. It wouldn't be my last impression of the game; my last impression of the game wouldn't have been these three corridors of let's fight every enemy even though fighting is not the fun part of this game. Uh, so I wouldn't have that. But for me right now, somebody who's like well I'm done now let's finish this experience, that's where it ends for me. But I can't say enough nice things about that game; great game, really fun. It's the original Tomb Raider: Definitive Edition, so if you didn't like the story on the original Tomb Raider, I thought it was really forgettable - a ghost witch or something at the end, if I remember correctly. This one in three years will be the same way; like I remember what there was this guy and these people and they wanted that, and then at the end they were totally set up",
            "start": 169.64
        },
        {
            "text": "if I remember correctly this one in 3 years will be the same way of like I remember what there was this guy and this these people and they wanted that and then at the end they were totally setting up for a third so that's what they did you know mhm Rare Replay, I want to give a shout out to that just as being one of the best compilation games I've ever played it made me care about games I don't care about and you know we we did a a let's play series where we kind of played through all of them even a lot of the really early really shitty games but it it was fun that they presented it in a way that made me want to try them out and want to appreciate them for what they are um I love the whole theater look of it and I loved the all the modes that they added the challenge modes and the the um I forgot what they were called but like maybe they were replays the ones where you go in and like it just gives you the here's what you should play this game for like Battletoads you play it and they",
            "start": 203.96
        },
        {
            "text": "Best Xbox Games of 2015 - Kinda Funny Gamescast Ep. 50 (Pt. 4) \nWe take a look at the best Xbox and PC games of 2015.\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames.\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nMusic by Rakohus!: http://www.youtube.com/user/rakohus\n\nforgot what they were called but like maybe they were replays the ones where you go in and like it just gives you the here's what you should play this game for like Battletoads you play it and they gave you that speed or Bite part like just right away got you straight into it um yeah I really wish that other compilations would have have that level of love and care put into them yeah I was really impressed by it I was glad to hear that it sold better than they thought uh beat their projections and yeah there's a lot of there was a lot of respect put in into into uh into that collection and and and did bring back some obscure games a lot of obscure games and and definitely educated people on who Rare is and celebrated a history that I think is kind of lost to the ages now um maybe Microsoft's you know tip of the hat that that Rare is not really alive anymore um at least that was my that was kind of what I walked away from like here's what rare was and evolve into what they're going to",
            "start": 244.72
        },
        {
            "text": "you know tip of the hat that that Rare is not really alive anymore um at least that was my that was kind of what I walked away from like here's what Rare was and evolved into what they're going to be and they really haven't been Rare in a long time anyway so um yeah I thought it was really cool a lot of definitely a lot of respect put in a lot of love I agree and and uh happy to see some of those old games shine again yeah idarb oh was great idarb was fantastic really that was a really fun time when we were all playing that yeah it's one of those I feel like there's a lot of of multiplayer games like that with that kind of aesthetic you know like uh TowerFall and sure and um Brawlhalla things like that they're just like hey just pick up and play it's a 2d **** game but they're fun and like I think idarb specifically added that that just Insanity level yeah EX why crazy ass announcer the hashtags going over you one of us figures out how to dash before the rest of us and then you're",
            "start": 284.04
        },
        {
            "text": "like I think IDARB specifically added that just Insanity level, yeah. EX why crazy ass announcer, the hashtags going over you one of us figures out how to dash before the rest of us and then you're trying to figure out, yeah, and it's just like again it's why we play games, it's fun, yeah. So I, we should we should bust that one out, yeah totally at some point do a do a second let's play of it or third let's play, yeah we did a bunch actually um or in the Blind Forest, oh very pretty very veryy very very very pretty game very awesome game I'm happy there's a definitive version coming out and all that um I I like that that Xbox had that cuz feel like forever Xbox was kind of missing that level game you know there you think Xbox you definitely think Forza and Halo and Gears and stuff you wanted that artisanal platformer and or gave it to you gave it to me good yeah gave it did you play a lot not I didn't I still haven't beat it okay but they do the thing that I hate where",
            "start": 323.0
        },
        {
            "text": "you wanted that Artisanal platformer and or gave it to you gave it to me good yeah gave it did you play a lot not I didn't I still haven't beat it okay but they do the thing that I **** hate where it's like I got far into it but not far enough to once they announced like the Definitive Edition where I was like oh I should just probably wait sure sure sure um but yeah I mean it's I love it and I love I love that it felt different than games like that like it's a it's a Metroidvania kind of game but it doesn't feel that way it's not so much just like the the physics of it are weird where you jump and you have to kind of like go the slingshotting type stuff that you have to do with the the jumps yeah um it's I like when when I'm playing a game and it's kind of like Guitar Hero where I'm playing I'm like I don't I'm not familiar with this this feels different I'm not good at it oh I'm getting better at it oh now I can do this now I can just kind of zip through the thing sure um and",
            "start": 367.0
        },
        {
            "text": "playing I'm like I don't I'm not familiar with this this feels different I'm not good at it oh I'm getting better at it oh now I can do this now I can just kind of zip through the thing sure um and yeah I mean you know just the the first 15 minutes of that game it's emotional as **** it's like a Pixar movie and it's like anything that I can relate to a Pixar movie I'm into so big fan of A Boy and His Blob uh and then Forza Motorsport happened which wouldn't matter to any of us except for the fact that there was The Fast and Furious: Showdown and that **** was awesome like man like that they really nailed that like it felt like Fast and Furious they added a whole bunch of dumb **** and just vo and like stupid songs over like just play it on repeat and like they took a game and made me care about it like that's good and it yeah it was it was really fun it was like it's a fun two hours that you're just you know in and out and it made me realize how much I want a Fast and Furious Telltale Game oh",
            "start": 411.12
        },
        {
            "text": "like that's good and it yeah it was it was really fun it was like it's a fun two hours that you're just you know in and out and it made me realize how much I want a Fast & Furious Telltale Game oh and uh one day one day you got to pitch it to him next time we're around job yeah um so I mean that's it kind of for the the Xbox Games State of Decay: Year One Survival Edition come on son that was great that guy you know State of Decay on Xbox 360 PC back in the day McFarlane and I did a bunch of Let's Plays leading into it I was super into it and it was that thing yeah it came out at E3 and came back exhausted and tried to play and and never it just I two ships in the night so when it finally came here man that was it like that's the most I've played my Xbox One you know what I mean CU and I mean like in a condensed period of like there was a week where I shut down that's all I played and as soon as I was done with something I was back out there to fill my Rucksacks and clear off the",
            "start": 453.72
        },
        {
            "text": "I mean, like in a condensed period of time, there was a week where I shut down, that's all I played, and as soon as I was done with something, I was back out there to fill my Ruckus sacks and clear off the map and go get this. Got to do it, you don't understand, man. I got to make my settlement big. You've got to, got to, so that was a great, great one. I'm really excited to see what Undead Labs does next. So, what are your thoughts on Xbox overall in terms of like conferences and announcements and just their year? They had really good conferences, they had really good announcements. I mean, we go back to the fact you know at E3 Colin has said it before, I think I agree with him, the biggest announcement was the backwards compatibility right. Like, it's what I love about Xbox right now is that you, it's it's weird right because we're PlayStation fans obviously, that's where our history lies, that's where our coverage lies, we've covered that beat for so long but you cheer for Xbox cuz",
            "start": 489.6
        },
        {
            "text": "Is that you? It's weird, right, because we're PlayStation fans, obviously, that's where our history lies, that's where our coverage lies. We've covered that beat for so long, but you cheer for Xbox because they are The Underdogs now and they keep making the Right Moves; they keep coming out and saying the right things. They keep making business decisions that are based on \"Is this good for games?\" You know what I mean? Like Phil Spencer has been all about when Aaron Greenberg was here with you guys, listen to that podcast. You know what I mean? Like they're cognizant of what were their missteps were and how they need to fix them and go forward. And it seems like it's Everest, and are they going to be able to get up that mountain because PlayStation continues now to dominate out there. And it's one of those things where I think in the old days it was so easy in a console war to sit around and pick a side and be like \"**** those other guys\" da D, and now everybody's is has the spokes.",
            "start": 523.8
        },
        {
            "text": "It's one of those things where I think in the old days it was so easy in a console war to sit around and pick a side and be like \"those other guys\" da D, and now everybody's got spokespeople, these voices, these faces that you connect with. It's like I want Phil Spencer to win, I want him to have a successful year, you know? I want him to be as successful as Shuhei Yoshida. I want these things to be out there and have it where Rise of the Tomb Raider comes out and is an amazing game and sells really well, you know what I mean? Because it sucks when it doesn't, because then people aren't playing, and this that and the other. Will Crystal Dynamics ever recover from you like all these different things? It's like it's just everybody's human now, and that's awesome, that's what I love about it, you know what I mean? Like everyone is human now, so you sit there and it's like man Nintendo's year wasn't great but we know people over there that are great, Cory and Reggie and all these different.",
            "start": 559.2
        },
        {
            "text": "it you know what I mean like everyone is human now so you sit there and it's like man Nintendo's year wasn't great but we know people over there that are great Cory and Reggie and all these different it's like you know I want them to do well MH same thing here I think Xbox made all the right calls all the right decisions and it didn't pay off in the Monumental they're back on top and now it's this race where they're going to you know trade the lead back and forth back and forth I don't know what it looks like next year now the next year is like if they stick to their messaging of games games games games games and Sony does this PlayStation VR thing where and that does let's say that doesn't work out what does that do to Xbox yeah definitely interesting so just uh kind of adding into this topic we also got PC games and mobile games hold on shit's going crazy right now shit's going crazy on your mobile device yeah it is wake me when all your mobile device games come to Vita in four",
            "start": 592.12
        },
        {
            "text": "Topic we also got PC games and mobile games hold on shit's going crazy right now shit's going crazy on your mobile device yeah it is wake me when all your mobile device games come to Vita in four years so uh for PC we had at least on my list there's Her Story and Emily is away a whole bunch of yes yes yes her story and uh I was like her was a great movie with The Walking Dead that I really dug yeah so I didn't play Her Story you seen that yet Colin that is a movie you need to see it's about AI and technology and Future No this is one of the ones where I'm doing the stress thing to tell you you have to watch it good haircut by the way so did you play Her Story no so it was just Nick and I right I don't think it wasn't you then it was Nick and I yes yes yes and I think one of the only Let's Plays we've ever taken down and then didn't put back up audio got all **** up in or whatever great game really amazing performances and it was another one if you don't know Her Story which",
            "start": 628.24
        },
        {
            "text": "Let's Plays we've ever taken down and then didn't put back up audio got all messed up or whatever great game really amazing performances and it was another one if you don't know her story which is possible don't it's like Gone Home, don't know anything about it just jump in and play cuz that's what we did everyone was talking about it we sat down and they started up and you're at a computer terminal yeah first person it's like what the heck is this and you start piecing it together and those like wait search this holy crap oh my god do this da da like it's awesome like I want I hope that game I mean obviously for selfish reasons I hope it gets ported to consoles so you could play it it won't because it's keyboard-based and everything else so everyone should just go play it on PC it was that much fun I was shocked to see it win so big at the Game Awards, I think that's a good sign for it because you know there's certain games that you know we have a lot of friends in the industry so when",
            "start": 670.44
        },
        {
            "text": "much fun I was shocked to see it win so big at The Game Awards. I think that's a good sign for it, because you know there's certain games that you know we have a lot of friends in the industry, so when something happens, you know about it pretty instantly. Everyone's talking about it on Twitter. You got to play Gone Home; this was one of those things - you got to play this, oh I'm listening to this right now, whatever, but it's like there's that weekend and if you missed that weekend, you never hear about it again because people are onto the next thing. And to see this game, like I haven't heard about it since... you know everyone's talking about it, you're like \"we got to do a Let's Play, let's do this,\" then it kind of went silent. Yeah, didn't hear anything about it and all of a sudden it's winning **** I'm like that's great for that game. Like same thing with Gone Home - where it's like I feel like it did have that moment of conversation and then it dropped off; then eventually got to the main stream because of the awards and stuff, so no yeah",
            "start": 706.8
        },
        {
            "text": "like same thing with Gone Home where it's like I feel like it did have that moment of conversation and then it dropped off, then eventually got to the main game because of the awards and stuff so no, yeah her story was great, I highly recommend it, yeah. And then Emily is Away, my God you want to talk about... I'm doing a piece for Game Informer and Giant Bomb on my top 10 games, and where Emily is Away lands on it, and I'm sure it'll be in the same spot when we do our video next or two weeks from now, two weeks from now like totally man I could not believe how high that rank because it is one of those things where yeah it's a short game you know we did a let's play is 50 minutes you know what I mean and that's with us Heming and haing and being idiots it's all realistic of us, Heming and haing and like it such a trip it got emotion out of us when I kept talking about and when I was talk... when I talked to people about Emily is Away the fact that it's like you have to understand",
            "start": 741.8
        },
        {
            "text": "and having and like it such a trip it got emotion out of us when I kept talking about and when I was talking to people about Emily as way is the fact that it's like you have to understand sitting there and playing that game in my spare bedroom for Kinda Funny with Tim Gettys next to me or whatever **that** like in my head I am at my desk freshman year of high school at Missoula with my huge Toshiba looking out at this like it's all right there cuz this was life this was it where you're you leave these people and you then start talking to them through AIM messaging and like picking the right buddy icon and then picking the right response and all stuff and like the way you and I sat back like what do we saying what do we do well what's funny is like you you say that like you're not in this room you're by yourself whatever to me it's not even by yourself like those memories are having someone next to you it's like what should I say what should I say and you overthink it and like talk it over",
            "start": 780.04
        },
        {
            "text": "by yourself, whatever to me, it's not even by yourself, like those memories are having someone next to you, it's like, what should I say, what should I say, and you overthink it and like talk it over and like rewrite it 10 times. Like that game, it did something man, I'm so happy that I... I recently looked at the numbers for it, like the let's play is over 50,000 views, which puts it in the upper echelon of our Let's Plays, that's awesome because when it first came out, it wasn't moving numbers and I was like, guys, like I'm not talking about our performance, you need to see this game if you... this game. And I love that, I love that it's like, it is, it's I want Kinda Funny to be known for that type of stuff, for those those moments of it's like we genuinely enjoy this, you know? It reminds me of your Batman v Superman reaction, like who gives a **** what everyone else thinks, like you genuinely love this thing and I... I just, it's great. Emily is away, highly recommend it, do it, definitely check",
            "start": 820.4
        },
        {
            "text": "Batman v Superman reaction like who gives a **** what everyone else thinks like you genuinely love this thing and I I just it it's great Emily is away highly recommend it do it definitely check that **** out is there any other PC games I'm sure there's a bazillion but I'm talking about that we really care about we connect it with because it's out of our normal wheelhouse what was the one where we jacked the car off oh Drive Shaft or no that was that was Charlie's band Shift happens find the jack it was just jacking a car off it not uh **** there was one that I had a momentary glance at Jack in the box is what I said and that made me think of something else I remember the game Party Hard I enjoyed Party Hard that's finally out or whatever or Greenlight or whatever oh yeah yeah there was one I don't think it's out yet but we played the the early version of it that uh it was like a very sterile white white stuff and super hot super hot super hot super awesome awesome concept really",
            "start": 856.88
        },
        {
            "text": "one I don't think it's out yet, but we played the early version of it. It was like a very sterile white stuff and super hot, super hot, super hot, super awesome concept really cool game. I love the Steam Greenlight stuff; it brings a lot of bad games, it's like mobile games - there's so much bad stuff, but then it does allow the really cool random things to come through. So yeah, I was a big fan of that. Do you have any? No, yeah, no. I don't think I played much. I played Civilization 5; that's pretty much only PC game I play. Um, then for mobile, I do got to give a couple shout outs because I have put so much time into like Pagel Blast - I talked about it all year, it came out at the tail end of last year but I didn't start playing until this year, sure. And uh, there's a lot of problems with it just in terms of microtransactions and this and that you've heard it all before. You could hard boot your phone to get around it, yeah. But there's there's there was a new",
            "start": 901.88
        },
        {
            "text": "Pagel Blast is the best Pagel game that ever happened. Like when you don't have to deal with the microtransactions, like you know it's not too hard to get around it but I mean you've seen me anytime we were on a trip I was going through that and it's like if you could Platinum this game I would Platinum this game it is just so much fun there's so much to do and you know Pagel's always been cool because it is just a simple brick breaking game but then with the powers and stuff and just the stupid ass music that plays and like it just you know adds a fresh twist to it and P Blast I think is ideal because it's on a mobile phone where you play vertically instead of the the",
            "start": 947.0
        },
        {
            "text": "and just the stupid ass music that plays and like it just you know adds a fresh twist to it and Plague Blast I think is ideal because it's on a mobile phone where you play vertically instead of the horizontal version that you normally do with Peggle it gives you so much more real estate it just changed the game up enough and I'm like **** I'm **** addicted to this there was no game I was more addicted to than Plague Blast um Lurcoft go oh yeah very fun very cool I liked that it um felt like a more fully featured game even though it was on mobile um my biggest problem was that it it's a tease at what could have been a really fun challenging difficult puzzle game it ended up just being kind of a puzzle game where you play it and you're like I know exactly what I need to do yeah you always said this it was never hard enough right yeah you see the room you have all the things you look at you're like all right I need to move this thing there so then it just kind of",
            "start": 983.48
        },
        {
            "text": "do yeah you always said this it was never hard enough right yeah you see the the room you have all the things you look at you're like all right I need to move this thing there so then it just kind of becomes about going through the motions of doing but it's still fun to do and it's still it's still cool to see and I love the art style of it um I love the the music and just the the visuals are just really really engaging and it's it's a fun low game like it reminded me a lot of the old Tomb Raider games and you know we saw the um we had them on the panel in right P.S. Prime yeah and they're talking about how this is we made a game that was what we remember Tomb Raider being and it's like that really is this like it's much better than the games yeah yeah there is many of them jumping around um Pac-Man 256 did you play this no I heard good things awesome yeah I mean it's it's the same thing which is kind of like it's just Pac-Man but back in the day with Pac-Man 256 level when",
            "start": 1027.8
        },
        {
            "text": "around um Pac-Man 256 did you play this no I heard good things awesome yeah I mean it's it's the same thing which is kind of like it's just Pac-Man but back in the day with Pac-Man 256 level when you got there there was like a glitch where everything would start glitching and they're like let's make a game out of that and it kind of just became this thing where it's an endless scrolling Pac-Man game where you just kind of keep having to go up as the bottom of the screen kind of just Rises with this like glitches and stuff and it's just a score attack thing and like it's randomly generated and it's just it's fun Pac-Man just like techno music just blaring and stuff and it's a definitely a playing game for me um I enjoy that and the one that doesn't get talked about enough is Horizon Chase Turbo you like cruising USA and I don't know why you wouldn't this is the game for you it's just takes that that stupid arcadey racing from the 90s thing where it's just like you just go and you",
            "start": 1067.08
        },
        {
            "text": "Chase Hudson, you like cruising USA and I don't know why you wouldn't this is the game for you it's just takes that that stupid arcadey racing from the 90s thing where it's just like you just go and you perfectly drift around everything without having any skill at all really just you just hold it you just go and then you just it's left and right and it just kind of like Auto does it but it's addicting and it's fun and there's the stupid like dancing girls at the end and stuff it's just it's exactly now we know why Tim likes it oh yeah I'm all I'm all end it yeah the soundtrack are great and everything it's just it's very 90s it's very Tim I'm a big fan of that those are those are my mobile games um Tim's mobile game sha yeah gotta give him the shout outs I'm glad you did yeah ladies and gentlemen that was 2015 whoa Whoa man hey man Dan Auerbach nugs man you got them Dan Auerbach nugs what are your favorite games 2015 let us know in the comments below and make sure you come back next week where we",
            "start": 1108.48
        },
        {
            "text": "that was 2015 whoa Whoa man hey man Dan Auerbach nugs man you got them Dan Auerbach nugs what are your favorite games of 2015 let us know in the comments below and make sure you come back next week where we will be predicting 2016 it's going to be a wild ride it's going to be a lot of fun one day I predict that I'm going to get that **** Championship never I'm never letting it go it's gonna Happen toad stool T is the next one so start **** practicing oh **** you **** yep thank you so much for everything till next time I love you",
            "start": 1150.92
        }
    ]
}