{
    "id": 1438,
    "video_id": "LG4qnA7PIeM",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Is VR The Future of Gaming? - Kinda Funny Gamescast Ep. 49-II (Pt. 3)",
    "description": "Is virtual reality the true future of video games?\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1450879202,
    "duration": 1409,
    "transcript_chunks": [
        {
            "text": "third topic of the day yeah comes from you patreon.com / kindoffunnygames boy throw seven big fan of throw seven I love throw seven big supporter of us on Twitter I didn't know he was doing the patron te37 and go there my six support the only shot to his topics they are very well thought out he has multiple ones that I I look at them like oh that's actually a good conversation for about 15 minutes 7 so smell that's a good topic I'm proud of you throw seven we're proud of you boy uh topic that he has today you bleed Greg VR is on the horizon but where do you think gaming will be past that in 10 years in a hundred years as a child I read The Veldt by Ray Bradbury it's The Veldt not veldt you read books i already had where's come on you know for a night 451 by bradbury I don't really know any and it fascinated me with the division of game-like experiences that could one day be a reality so what's the future of gaming and I'm also I I know he says past VR but I also",
            "start": 7.43
        },
        {
            "text": "I don't really know any and it fascinated me with the division of game-like experiences that could one day be a reality so what's the future of gaming and I'm also I I know he says past VR but I also think that we need to talk about AR a lot in this well I think makes sense i mean i think to me that the idea of augmented reality has to play into it right mmm i don't know if it's necessarily VR but i love the idea of sitting in a real full immersive experience in your own house that that you know similar where they showed at the Microsoft conference but you know how lowland hollow lens or just something that extends the experience beyond just the 2d the 2d experience the television right sure and that gets me more excited in game in the doesn't film film you know I'm a die-hard 2D fan like it needs to be a flat 2D plane I don't want to **** put glasses on I don't need any more experience if you can't tell story to me in 2D it's not worth telling but for gaming sky's the limit right",
            "start": 54.51
        },
        {
            "text": "it needs to be a flat 2D plane I don't want to **** put glasses on I don't need any more experience if you can't tell a story to me in 2D it's not worth telling but for gaming the sky's the limit right because it is, it is a much more creative, much more involved media where people are a lot more forgiving of like the technology because technology increases so rapidly every year every guy and that sort of thing is what pushes the industry forward. Where's film? I still trying to find its legs with that but I get what gets me excited is the ability to yeah just to have that extension of the experience, to have things in front of me, to have the world kind of mimic to see those I mean like a fax in front of my eyes with just you know wearing something like a Google Cardboard. That's very non-invasive. Mmm ya know hey hey I know what question we answer there's a lot going on here there's a lot I mean what will adding VR take from that? I think Nick \"CVR Hater\" was on Colin's podcast yesterday, I tried to",
            "start": 97.2
        },
        {
            "text": "know hey hey I know good what question we answer there's a lot going on here there's a lot I mean what will adding VR take from that I think Nick Cervantes, the VR hater, was on Colin Moriarty's show yesterday I tried to upsell them a bid on it how did it work did it work Nick really no I mean I'll try it of course I'll try it but you've tried it but he won't really real games I think I mean I'll so I'll play a game with VR I'll try I'll put it in my living room I'll try that Justin myself I'll deal with my wife making fun of but that's why I was saying I put the headphones on yeah nobody else is that um so it could be cool but I still don't see you know people putting glasses on to do anything if they don't have to wear them right and that was the same thing with my wife, Wii 3D it's been a little difficult to pick up in the living room is because I just don't think people want to deal with charging glasses they don't want to deal with extra peripherals I want to deal with having to put those",
            "start": 138.61
        },
        {
            "text": "to pick up in the living room is because I just don't think people want to deal with charging glasses, they don't want to deal with my extra peripherals. I want to deal with having to put those on in a medium with TV that is passive now what gaming it's not passive so there's a different story there. My thing for it is this is gonna sound stupid stick with me is that 3D is such a gimmick, words I don't think VR is 3D for me it would stick with me because I want to try to make my point here and joke tell me if I succeed or not uh 3D especially in games like when they put out in like okay you know Uncharted: The Lost Legacy, didn't it's just like a little bit like alright cool whatever you know what I mean or any other game you popped in and did it with it was like fine but it wasn't built for this this isn't like what it's about even if it does it's only adding that extra little bit of layer but it's making the rest my house look stupid or whatever where's VR like I'm",
            "start": 185.6
        },
        {
            "text": "for this, this isn't like what it's about even if it does it's only adding that extra little bit of layer but it's making the rest my house look **** we were stupid or whatever where's VR like I'm talking to you like I'm you know I i I'd like to think that I am a guy who hates gimmicks and is all I you know I talk about PlayStation Move hating it from the get-go thing it was stupid watching it fail I hate the touch on my Vita with the exception of Taco Master now but mainly the back touch where people thought that was a good idea rather than put extra buttons on it you know what I mean I'm the list goes like the **** sniper scopes and all this other **** you'd have you know back in the day right putting on the VR when they announced Fear, I'm a Claw it's gonna be PlayStation Move again you know what I mean and then putting it on and playing it like real games like Res rigs around here it's like **** this is a different thing this isn't 3D which was like trying to",
            "start": 219.38
        },
        {
            "text": "Is VR The Future of Gaming? - Kinda Funny Gamescast Ep. 49-II (Pt. 3)\nagain you know what i mean and then putting it on and playing it like real games like Resident Evil, you know, rigs around here it's like **** this is a different thing this isn't 3D which was like trying to shoehorn it in and do this like I'm talking about putting these things on and you are looking all around you're in this different game and it's this different experience it's changing the way you play and you know i mean like that's the big thing games are gonna be built from the ground up with that I think are what's going to sell people on it will sell you on and we actually get to play together, Resident Evil, you're gonna have a completely different experience ok but like I'm open to it and then my other point to you like earlier right of like changing the experience and the point that I you know we talked about on PS i love you XOXO episode 14 and I haven't talked to you about I don't think is the fact of like I put it on for Reza, put on the headphones and I'm laughing I'm",
            "start": 254.99
        },
        {
            "text": "talked about on PS I Love You XOXO episode 14 and I haven't talked to you about I don't think is the fact of like I keep going back to I put it on for Reza put on the headphones and I'm laughing I'm giggling I'm in comics myself I can barely hear you that's like muted cuz I've his headphones on and I forget that Tim's in the room as Greggy's in the room, all these are the people in the room and you're talking you're laughing you have a good time you're looking on you you you're totally blanking out the fact name buddy else is there and so for me what's going if this works it actually happens and who knows you know what I mean for me the next a big step of making VR a thing and making PlayStation VR thing is you having the headset on for all games or most games and not having it mean that that means it's a 3D game but what I keep going back to is you know The Last of Us right, The Last of Us I play The Last of Us and it's this incredibly emotional touching cool experience I'm twists and turns all",
            "start": 292.19
        },
        {
            "text": "that means it's a 3D game but what I keep going back to is you know The Last of Us right, Last of Us, I play Last of Us and it's this incredibly emotional touching cool experience, I'm twists and turns all these different things right, but at any time my phone vibrates on the table, I pause and I look at and look at Twitter, and I shut it down or so they'll car honk, so the lights are coming in, so I get up and I do this, and I'm always available be taken out of that experience right, imagine Last of Us with that on this on, and that's it, like, and I'm not saying The Last of Us now controlling the camera none of that ****, I'm just saying the screen is right here and there's nothing else and there's nothing else in my ears and it's just I'm in this world for as long as I want it being calling keeps talking about the fact that at you know III this year in the middle of it I leaned over and I'm like ground like the wraparound screen looks like a pair of glasses like they're going to come out and say",
            "start": 330.05
        },
        {
            "text": "about the fact that at you know III this year in the middle of it I leaned over and I'm like ground like the wraparound screen looks like a pair of glasses like they're going to come out and say that everything is PSVR compatible or whatever they didn't but Colin sticks with me on the fact that because even though I always go back to the Horizon demo, The Rising demo ended at E3 and I've been playing this whole time anyone move and it filled in and I think what they're gonna do when they say you know PlayStation VR compatible for a lot of the games going forward like Horizon like probably maybe kind of Uncharted 4 if they patch it whatever is the fact that you can put it on play the game again doesn't control anything but it fills up and down a little bit more so it literally is that you're just looking into this thing and then it's blocking on everything it's like when that happens that's when all of a sudden I understand what Nick sees in the movies and why like I'm I got washed",
            "start": 368.75
        },
        {
            "text": "just looking into this thing and then it's blocking on everything it's like when that happens that's when all of a sudden I understand what Nick sees in the movies and why like I'm I got washed up on a plane or whatever doubt of that like when you go to the movies right you're forced to put down your phone you're forced to be in a dark room but of course the babies in the back the old man's in the back sucking on his pacifiers, this guy's checking his phone up here like there's enough things to take you out so imagine like that ratcheted up just a notch and then I get started I start getting excited about it on that I I'm totally already in on the game's excited about the games can't wait to see what people do when they create with games but the sake of the other level like I'm excited then if it's possible to watch Walking Dead that way to put down my phone and not and just boom and just be there you know me watch movies I just be there yeah it's like that's totally I",
            "start": 405.08
        },
        {
            "text": "I'm excited then if it's possible to watch The Walking Dead that way, to put down my phone and not have to look at it and just be there, you know? Me watching movies, I'd just be there. Yeah, it's like that's totally what he's talking about in Seven, asking about what happens a hundred years in the future. I'm a cyber warfare expert, were dead, yeah, yeah. Look under here to the future, we've hit the singularity, yeah. Are we one? We are gamers will just be real life, yeah, that's what it will be. But see, see, I don't know that I buy that, that implementation can work necessarily because think about if something was always right in front of you, how disorienting that would be. Everywhere you look, it's the same image, that's gotta be weird. So the power of VR is that every time you look at the actual world changes so what you're saying is just it's like if you want that right now, just go get that Samsung Gear VR but put the phone and the thing you know what I mean yeah play moving in front of you but imagine looking at the",
            "start": 438.59
        },
        {
            "text": "You're saying is just it's like if you want that right now, just go get that Samsung VR, but put the phone and the thing, you know what I mean, yeah. Play moving in front of you, but imagine looking at the same movie no matter where you go, that's got to be really disorienting. I mean, here's the problem: fact and figure about all they wake up everybody that PlayStation VR, Oculus, all that is going to be completely sore anything playing rigs I got in it was immediately like whoa, yeah. But I'm saying it's disorienting enough when you're looking around actual fully realized rendered 3D, oral sure how disorienting will be if the pictures just locked no matter where you're. I understand your point, no, I totally get your point. I'm just saying that it's this is something these are the hurdles we're gonna have to overcome. Everything's like when I sat down to play rigs like for real and got at first it was the thing of like we're coming out of the ground and I was in I've been the mech or",
            "start": 477.53
        },
        {
            "text": "we're gonna have to overcome everything's like when i sat down to play rigs like for real and got at first it was the thing of like we're coming out of the ground and i was in i've been the mech or whatever and the elevator stopped and they all later stopped and you know my body was like i'm gonna keep going i'm gonna feel that something and it didn't so then i was like woman i was gonna be like whoa that's a new one but more to the point is you're playing rigs and you're running around you're still you know dual-stick controlling moving churning away but you're aiming with your head so all of a sudden it was like oh man the guy's going that way and i would go like that but then that i wasn't moving the sticks like trying to move the body like i was learning to play and although you effectively have a third analogs right there's a third way to config controllers crazy yeah that's what do you have to say already i know i know home theater thinks about what what's that sober stone is",
            "start": 513.47
        },
        {
            "text": "have a third analogs right there's a third way to configure controllers, crazy, yeah, that's what do you have to say already I know I know home theater thinks about what what's that Brookstone is a Brookstone, yeah but this is the thing where it's finally affordable it's going to be in your house already that's why I mean this is what we're talking about, about a wall falling down, yeah I mean I think they have to have that stuff for me with the with the gimmicks and all that stuff I'd go back to like the 90s in the arcades and it's like those are the games that cost a dollar those are the games that weren't just 25 cents and you it's like oh you can punch things you can ride on the skateboard or you can play a guitar or DDR or Silent Scope or all these things and those are the games that you're like oh my god, like I get to move things share sure sure sure it's crazy and it's like then all of a sudden it became a gimmick over time you know and yeah that went from my holy **** this is so",
            "start": 546.74
        },
        {
            "text": "like oh my god like I get to move things share sure sure sure it's crazy and it's like then all of a sudden it became a gimmick over time you know and yeah that went from my holy **** this is so cool i wish we could do that now at home one day to Guitar Hero and Rock Band happened and Time Crisis, yeah Stay at Odds welcome and like all of these things happen no more line all right and then the week and PS Move and all this **** were like I'm done I'm **** rent and all of us revolted we're like we want these hardcore experiences and blah blah blah and those things can't exist in all this **** then Nintendo comes out with a with a 3DS and PlayStation tried its whole 3D thing for a while so never on and exactly and with with PlayStation with the games none of them were really made to be 3D games it's right here's Uncharted and there's like a little depth of field yeah and that is totally disoriented like that is like it's the difference between like taking a movie and making it 3D",
            "start": 592.13
        },
        {
            "text": "\"3D games, it's right here's Uncharted and there's like a little depth of field, yeah, and that is totally disoriented, like that is like it's the difference between like taking a movie and making it 3D versus if you're shot into it, yeah, whatever. But even that's different 'cause that has real thought being put into, yeah, that-that's this, yeah, like that's it frame by frame shot my shot, whereas video games are like **** there's so much **** that they have to like to do this, like that's impossible, so then you just get a bunch of shewing things like Sonic Generations or like a bunch of 2D platformers did it where it was like disorienting to play, yeah, you couldn't focus on what you're trying to look at there was just too much depth and a too many layers, and then the 3DS happens in 3D S was like alright we're going to take a different approach and we're gonna actually try to make gameplay based around this 3D experience and stuff and the 3D is part of it and then yeah that was\"",
            "start": 633.38
        },
        {
            "text": "S was like, \"Alright, we're going to take a different approach and we're gonna actually try to make gameplay based around this 3D experience and stuff. And the 3D is part of it.\" And then yeah, that was supposed to be the thing in the way that like the DS dual-screen games are going to be made differently in Deus Ex games were made differently to fit the two screens. 3DS games weren't you know, and that's the problem. It's like this promise that never actually happened. We saw a couple cases of it, like what you also had, that they weren't fully committed to it right? Cuz he had a slider where everything I guess was to play 2D games that wouldn't work, like I said. I was like the slider thing was uh, it was mainly just because like a 3D like experience with people and stuff like that because it does cause motion sickness and all that. But what I'm saying is it's like the out of the gate with the DS, like maybe not at launch but like very soon after launch there were games you're",
            "start": 675.6
        },
        {
            "text": "it does and causes motion sickness and all that but what I'm saying is it's like the out of the gate with the d/s like maybe not at launch but like very soon after launch there was games you're like oh this is why and it was until Mario 3D Land that it was like oh this is why but then since then there hasn't really been anything that I'm like sure this is the 3D is part of the gameplay like playing Mario 3D Land with and without the 3D is a very different experience like it is tailored and it's like Nintendo did it they nailed it they made the 3D not a gimmick with that game and they made it part of the gameplay but then they failed to do it after that and that's where I think the VR comes into play which I'm sold in the VR I think it's cool yeah I'm sold in the 3D I think it's cool yeah but the the VR it's like are we gonna see those games are they really gonna happen how many are we gonna get and how many how much of it is just gonna be like even what you're Tom",
            "start": 717.0
        },
        {
            "text": "It's cool, yeah, but the VR, it's like, are we gonna see those games? Are they really gonna happen? How many are we gonna get and how much of it is just gonna be like even what you Tom, I'm just like being able to watch and do all that stuff, it's like that's cool, but it is just a different way to do the same thing. And I worried that like it's not going to be good, and I keep thinking about the screens aren't that high quality. I would much rather watch like yeah you're talking about the distraction stuff, I'm Way more distracted when the screen doesn't look good, you know? And it's I don't even talk about blurriness, I'm gonna talk about just the graphics, you know? So my system and then we're talking about like the it wrapping around and stuff things need to be made for that. So if you like when you talk about the like maybe Horizon will have that extra bit or whatever that goes back to Uncharted, just getting 3D where it's like you can't just make more screen happen",
            "start": 757.92
        },
        {
            "text": "So if you like when you talk about the like maybe Horizon will have that extra bit or whatever that goes back to Uncharted, just getting 3D where it's like you can't just make more screen happen, you know. Um, it would have to be designed that way and you see it now like I have an ultra-wide monitor and I love that thing for productivity in like editing and stuff like that and when you see a video game that is in that resolution it's incredible, you see a first-person shooter and like how much of the map you can see. It's like, \"Damn,\" or a racing game, sure, it's like, \"Yo, let me see those rigs\" or people have like the wide monitor and the monitors on the side, yep, and have the graphics cards that will actually select quad graphics cards, it'll support all that's really cool, it's really really cool and it's really immersive and imagining that on your face is just insane but the problem is the HUDs all weird and it's like in the middle of the screen.",
            "start": 797.9
        },
        {
            "text": "Cool, it's really really cool and it's really immersive and imagining that on your face is just insane but the problem that is the HUDs all weird and it's like in the middle of the screen and it's like it's distracting it becomes distracting and that that's the kind of thing I'm with you know I mean in your mind it I think on the main part of like these things have to be built from the ground up this way I'm yeah my big my big concern with PlayStation VR in particular because I just don't understand how Oculus is gonna work into the developers and people we know and how are you know life is going to work other than the Indies and stuff is the fact that they launch PlayStation VR and it is super shitty ass minigames like it was with the Move it doesn't sell the VR doesn't sell developers like well I'm not gonna make anything for it and then it falls all the cliff I don't mean that's I'm gonna be shocked if that doesn't happen yeah like that's that's the trajectory and it's",
            "start": 840.71
        },
        {
            "text": "developers like well I'm not gonna make anything for it and then it falls all the cliff I don't mean that's I'm gonna be shocked if that doesn't happen yeah like that's that's the trajectory and it's like have you said that when you do it for the first time I'm it's amazing it is an experience early like whoa this is **** cool like even when we did that random be I remember even what it was but like we got to be on the moon and like oh yeah that was a Brandon yeah and it's like we it changed how we like you talk about the elevators yeah you start we're on the moon so we start moving slower does it feels like yeah yeah it's been instantly like you forget you're in a room like VR is something really special yeah but how special was it when you played tennis for the first time on the week right you know great point it's the same thing and I i we saw without when and now VR I think has a different uh peak that it potentially could hit ya but then again so does motion controls happen",
            "start": 880.25
        },
        {
            "text": "right you know great point it's the same thing and I i we saw without when and now VR I think has a different uh peak that it potentially could hit ya but then again so does motion controls happen like how many people played Mario Kart Wii Sports and we're like oh my god imagine when they make the Star Wars game where you get to have lightsabers yeah imagine when The Legend of Zelda happens and then those things did happen or the lightsaber didn't happen right and it's like why you know share and that's kind of where I'm at now feel that happy there's a so many pitfalls yeah and it's like I don't see us getting past those like and I wish we did I love it i think that the VR every time i've used it I'm like whoa this is really cool also though every time I've used it there's been like multiple demos or multiple things I've seen and one of them are two of them are like whoa this is cool the others are all right this is the equivalent to a shitty mobile game yeah I am done with this",
            "start": 918.11
        },
        {
            "text": "multiple demos or multiple things I've seen and one of them are two of them are like whoa this is cool the others are all right this is the equivalent to a shitty mobile game yeah I am done with this and I mean mobile games are another gimmick people talk about and stuff and like with the touch screen and all that stuff I love good mobile games I hate the shitty ones and it's like the one it's the ones that really like all right I'm gonna design this game around this thing that's in this guy's pocket always there's a touch screen right make the game for that don't give me analog controls and having to pretend I'm hitting buttons and stuff like that's why i love Pagel's so much it's literally a slingshot thing touch screens make sense for that yeah um yeah minute I think I'm starting erupted you know some work I was gonna say but i think that i think that's that really drives the point home right it's not the first game they make us on the 2nd game they make what's the 10th game they",
            "start": 962.21
        },
        {
            "text": "you know some work I was gonna say but i think that i think that's that really drives the point home right it's not the first game they make us on the 2nd game they make what's the 10th game they make that's going to be amazing on VR that's what's gonna sell it yeah but the problem that is everyone has a phone in their pocket like that sold the VR needs to have something to sell this yeah yeah that's a good point man I'm gonna get to Game Time and that's my thing about lightsaber that's the problem right yeah that was the problem with that that was my issue with the Wii was I was like this is really cool i can't wait until they iterate on this and perfect this and they never did and see that's the never did that's the wild card and what I was talking about with this in terms of PlayStation right is the fact that one PlayStation Move came out when 3D came out it was all gimmicks and they'd say it wasn't gimmicks but as far as they go whereas when you talk to Shoe about this sure",
            "start": 1002.65
        },
        {
            "text": "Is the fact that one PlayStation Move came out when 3D came out, it was all gimmicks, and they'd say it wasn't gimmicks, but as far as they go. Whereas when you talk to Sony about this, sure, you talk to somebody who's involved with this; they're talking about I mean she literally said on PS I Love You, right, like we're looking to launch PlayStation VR as launching the original PlayStation in 20 years, we want to be here talking to you about that. And granted, you if you want to be negative, you can talk that up as marketing speak, then the other two for me took it to mean she doesn't speak like that, you know? I mean so for me that makes me go huh, but yeah what are they that committed to it, yeah, like sure work right now we're wave one early adopters, ground zero people, and sure there's gonna be tons of hurdles and da da if they're committed to it 20 years now it's amazing all these different things or if they're Microsoft, they iterate on it once Connect and then",
            "start": 1035.53
        },
        {
            "text": "\"Sure, there's gonna be tons of hurdles and da-da if they're committed to it 20 years now it's amazing all these different things or if they're Microsoft, they iterate on it once connected, and then like, okay, everyone hates it. We're sorry. Yeah, I'm with you on that just in the sense that I want it to work. I want to be proven wrong here, and I wanted to make it past those hurdles because I wanted 3D to work. I wanted motion controls to work, and I think all of these things need to work together in order for it to work. And that's the funny thing about VR: it needs motion controls; it needs 3D. Right now, it's just a stick; it has so much up against it to succeed. Having said that, it also has the lessons learned from 3D and from motion control to kind of put into it. There are so many questions we keep talking about, like you every time I've seen the PlayStation VR, like it has PlayStation Move attached, and it's like, 'So I can sell PlayStation Move with it.' Like, there's so many\"",
            "start": 1078.01
        },
        {
            "text": "Is VR the future of gaming? We keep talking about this every time I've seen the PlayStation VR, like it has PlayStation Move attached, and it's like, so I can sell PlayStation Move with it. Like, there's so many questions we still have no answer to. I know, and then that's what's weird about it is, like I think if you were to go through all our podcasts from beating your on and Beyond What Not, like I'm from really negative to it too now positive on the tech. You know, and I think for the first time ever, I'm starting to think it has a shot not to be in a million houses and all this stuff and be this juggernaut piece of hardware but to be something that is supported because my line of reason has been from the get-go that it's going to come out have no support and then fall away. But now you're playing these experiences where it's like... if they launched with eval courier or even in launch window quote-unquote eval curry, and No Man's Sky is compatible, and then Gran Turismo comes out.",
            "start": 1119.08
        },
        {
            "text": "playing these experiences where it's like **** if they launched with eval Curry or even in launch window quote-unquote eval Curry and no man's sky is compatible and then gran turismo comes out with something and then you know I mean like you start racking up these games are like huh there's a few things I want to play and then you start off setting them with now the new Assassin's Creed it is it has a rap and I'm again i'm not saying like I your widescreen monitor things totally something I hadn't thought of and you're right but I'm not yeah I for me it's like the when you watch sports stick with me when you watch anything I guess local news on Oh on widescreen right but all the stuff is on them yeah so they still set for four by three but then there's extra space in the other widescreen yeah well no I mean it does that like that's that's how the games are now just one thing is it's really disorienting kind of weird because that's not how we're used to sharing games and it blocks",
            "start": 1159.1
        },
        {
            "text": "yeah well no I mean it does that like that's that's how the games are now just one thing is it's really disorienting kind of weird because that's not how we're used to sharing games and it blocks things in ways that you're like no I don't want that to be right there it's it's not like watching the news or stuff where that's title safe or whatever they're calling you know it's like that stuff's designed and everything is shot to be recognizable stuff where's with video games it's like you know you you're when you move things you need to be able to see with enemies on something again problems can be solved but the bigger issue I think is the graphics card thing of to be able to make the resolution instead of it being I mean that all of a sudden that's not 1080 anymore so they're either going to make it uh two down down down down and just make it the different aspect ratio and then stretch it or not stretch it but uh just make it make it bigger target or um they're going to",
            "start": 1198.65
        },
        {
            "text": "to make it two down, down, down, and just make it the different aspect ratio and then stretch it or not stretch it, but uh just make it bigger. Or um, they're going to New talking about if the glass actually curves around you, yeah, the curtain around you like this right now at 69 your innocence is renderings yes that won't be sixteen by nine, it'll be something else and it will either have to be dumbed down significantly to be able to run more. I mean I don't know, it doesn't have any processing power in itself right, like it's got an extra box okay then maybe maybe it does have like a graphics card, don't know, it has a dedicated graphic card yes okay maybe if it's good enough it could potentially run things on high and all that yes I God would be a game changer I think it would be cool to say I was what I always default to when I think VR I think first-person shooters yeah right but then you have to take a step back and you're like that is obviously what it's",
            "start": 1236.78
        },
        {
            "text": "think it would be cool to say I was what I always default to when I think VR, I think first-person shooters, yeah right but then you have to take a step back and you're like that is obviously one of the prime intentions for VR, but then you think a third person shooter like or third person game like Arkham Asylum and it has its creator, Rocksteady Games' Batman: Arkham series, right well you're literally sitting there and you can look anywhere and the environment but your character stays where he's at that's cool that sounds like a cool experience but we all know I mean you said it yourself a million times like what sells tech games Yeah right the experience itself yeah so it's all just theoretical yep and it's academic until that first title comes out and that's the one that's gonna make everyone think huh I'll invest in this but I stand by it they have to have a year straight of great titles, they have to have multiple titles that come out that really get you invested.",
            "start": 1278.57
        },
        {
            "text": "Is VR The Future of Gaming? - Kinda Funny Gamescast Ep. 49-II (Pt. 3)\nhuh I'll invest in this but I stand by it they have to have a year straight of great titles they have to have multiple titles that come out that really get the sort of uh Fairweather fans like me on board say okay I'm gonna put this in my living room next to that's their test that's what they're up against right off like the fact that yeah the PlayStation hardcore audience you know I mean these people who go to PSX and stuff they're going to buy it right then it becomes a must-have then they move into marketing mode where we can call and I are gonna have to get these units in the house right let's hope we have them early ah but we have them in the house and let's say we were you know people and you came over and we put it on and gave you this experience right like that's when it starts to spread a little bit but yeah you're right that yeah it's like cool I love that one game let me know when there are four more I mean it needs to be we not you and I think",
            "start": 1319.43
        },
        {
            "text": "that's when it starts to spread a little bit but yeah you're right that yeah it's like cool I love that one game let me know when there's four more I mean it needs to be we and not we you and I think that's the thing is like you know that we use is that it's like there's just the tablet and controller that's not gonna sell anyone yeah yeah you know love to see ya hey that's the future gaming what a pass BR but i think the VR is the problem is the hurdle one Eon that can you ever think about what would be I mean remember when you're playing SNES or Genesis me like it'll never look better than this yeah so it's like 24 now to even think farther than that it's hard because yeah what do Adam it getting a foot from just a graphic standpoint photo realistic is it is going to happen and it will happen soon you're really looking at games if you look at games in this this generation as opposed to like even even last generation its they blow em away yeah it's ridiculous",
            "start": 1357.5
        }
    ]
}