{
    "id": 1429,
    "video_id": "sg6TJ0-w9e0",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty",
        "Matty Kerr"
    ],
    "title": "Matty Kerr (Special Guest) - The GameOverGreggy Show Ep. 106",
    "description": "Nick Scarpino wants to know what we all thought of the new Batman v Superman Trailer, Patreon supporter Matty Kerr questions who we would want to eat dinner with, Colin Moriarty discusses the parameters of friendship, and Tim Gettys explains what made his childhood a living death trap. (Released on Patreon 12.11.15)\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1450450931,
    "duration": 7502,
    "transcript_chunks": [
        {
            "text": "This episode is brought to you by Loot Crate. Would you classify yourself as a geek, gamer, or pop culture nerd? Then this is the subscription box for you. For less than $20 a month, you get six to eight items of gamer and pop culture licensed gear, apparel, collectibles, unique one-of-a-kind items, and more. Make sure you head to lootcrate.com/kindfunny and enter the offer code kind of funny to save $3 on any new subscription. Not that long ago, and depending on where you live, not so far away, Loot Crate blasted off into a voyage across the galaxy. Searching the far reaches of space to find universally awesome gear. Using December's Star Wars: The Force Awakens loot as the launchpad, we landed on some equally cosmic items from Halo 5 and more. With an exclusive Funko Pop and an exclusive t-shirt in this month's crate, this is the loot you're looking for. Basically, Loot Crate is like a friend who knows what you love and surprises you with an awesome present every month. You have",
            "start": 0.08
        },
        {
            "text": "t-shirt in this month's crate, this is the loot you're looking for. Basically, Loot Crate is like a friend who knows what you love and surprises you with an awesome present every month. You have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate. And when the cutoff happens, Jackie boy, that's it. It's over. So go to lootcrate.com/kindfunny and enter the offer code kind of funny to save $3 on your new subscription today. And now you can showcase your geek chic style with Level Up, a monthly mystery apparel subscription from Loot Crate. You can get two different pairs of high-quality socks, one to two fashionable accessories, or a wearable item like a long sleeve shirt or lounge pants. same themes as Loot Crate every month, and it serves as a great companion to your loot because there are no repeats. Each month's theme is inspired by all your favorite pop culture brands like Star Wars, Doctor Who, and Fallout 4, and often contains high-quality exclusives. Go",
            "start": 41.04
        },
        {
            "text": "Your loot because there are no repeats. Each month's theme is inspired by all your favorite pop culture brands like Star Wars, Doctor Who, and Fallout 4, and often contains high-quality exclusives. Go to LootCrate.com/funny to learn more. Use the code funny to save 10%. This month's theme is galaxy with Star Wars items perfect for Jedi, Padawans, rebels, and serious fans of Star Wars. And I'm adding in myself Watt W. I like W. I like W. What's up everybody? Welcome to The Game Over Greggy Show. I am one of your hosts, Greg Miller, alongside the producer/seducer. He's back, Nick Scarpino. I missed you guys. We missed you, too. Oh, hey, claps. I uh Thank you. Thank you. Um I uh it's hard being out of the game. I'll say that right now. We we talk a lot about vacationing and how it it causes probably more anxiety than it's worth. Sure. I had a great time. But about a day and a half into it, I was like, I got to check Twitter. I got to get my phone. I got to get on Wi-Fi. I got to",
            "start": 81.68
        },
        {
            "text": "causes probably more anxiety than it's worth. Sure. I had a great time. But about a day and a half into it, I was like, I got to check Twitter. I got to get my phone. I got to get on Wi-Fi. I got to start doing something. I'm going crazy. Yeah. But I figured it out. I was talking to my my girlfriend and she was like, there's something up with you guys. When whenever I'm like, \"Oh, how's Nick Scarpino doing?\" your answer is, \"Yeah, he just wants to be back doing stuff.\" And when it's like, \"Oh, so we take a week off or whatever for Thanksgiving and the entire time you just want to go back to doing stuff.\" It's like to you guys, vacation is the work part. And it's like, yeah, that's kind of how it is. Vacation's becoming more and more fun for me as time goes on. Like this year, vacations were actually really good. That's good. When we were back at IGN, I had this constant guilt trip that I only put on myself that no one else put on me that I have to constantly be working. But now",
            "start": 166.88
        },
        {
            "text": "actually really good. That's good. When we were back at IGN, I had this this constant guilt trip that I only put on myself that no one else put on me that I have to constantly be working. But now that I, you know, we own this company, I, you know, just like, well, I'm gonna go on vacation. I'm really going to enjoy myself. And we were just talking that next year in April, Greg and I are going to Japan. Japan. Japan. And uh we all we were trying to see if uh we can get the entire kind of funny crew and uh and significant to go. I would probably be okay if I had vacationed with you guys. Having said that, it would not have been a it wouldn't have been a vacation. We would just talked about work the whole time. So it was it was great in that like for the record, Matty Kerr is here. I feel like this is the long Nick intro with Tim Gettys pride along. There's going to be like 30 seconds of like who is this guy? Patreon supporter Matty Ker. Thank you Maddie for all your support. All",
            "start": 203.6
        },
        {
            "text": "like this is the long Nick intro with Tim Gettys' pride along. There's going to be like 30 seconds of like who is this guy? Patreon supporter Matty Kerr. Thank you Maddie for all your support. All right, continue into your thing now. Yes. If you would have it would have worked. No, the thing is my wife was right. She was like you need to get away. You guys work really really hard and every once in a while you have to just kind of get away and recharge. And that's exactly what happened. I didn't watch any TV. I barely checked my phone. Um and I ended up reading a lot. A day and a half in you were checking your Twitter. I I made like it was very sparse, right? So, like for the most part, I left the phone in the room. Um, and I read a lot and I recharged and I I I wrote a little bit as you guys know for for some stuff we have upcoming. Um, and it was just it was fun, man. It really was good to just kind of sit back and recharge. It didn't do me any favors, though, that it was a huge",
            "start": 243.04
        },
        {
            "text": "guys know for some stuff we have upcoming. Um, and it was just it was fun, man. It really was good to just kind of sit back and recharge. It didn't do me any favors, though, that it was a hugely important and crazy busy week for you guys that when I planned this last January, I just didn't see coming. Uh, namely we had the PlayStation Experience (PSX) game awards, right, which you were at, which you won the award for your support. He won best friend of the year. Game of the Year. Yeah, I have the trophy right here. A lot of applause today. It's like a State of the Union. I like it. I think I'm going to break something. What's this weird rat? But yeah, so I mean it would have helped maybe to take it on a you know if I had gone for there's always going to be something every week there's something going on for us but last week was the week what was it PSX",
            "start": 277.44
        },
        {
            "text": "us but last week was the week what was it a PSX Game Awards PSX so it was Greg Miller winning a ** award which is amazing and giving an amazing speech that everyone's super happy about it was PSX aka Kinda Funny Live 1.5 which was amazing and then there was the Batman v Superman trailer Right. One of our most successful videos that we've ever made. Who would have thought people want to hear me talk about Batman? When Greg loses his goddamn mind cuz he's Greg Miller. Yeah. Leading right into the Game Awards. It was just a whole This is your week, Greg. Enjoy it. There was It was that we I announced the and got to show the first footage of me in the Lego video game. Lego. You You came up with That's really cool, man. I got boss. Right. Right. Yeah. To Greg's credit. Marvel the Avengers cuz voice acting. I've talked about how I just want to be like a voice in an NPC in a game once, just like one time because voice acting is really hard. I would just be me, you know. Can I give you",
            "start": 323.52
        },
        {
            "text": "cuz voice acting. I've talked about how I just want to be like a voice in an NPC in a game once, just like one time because voice acting is really hard. I would just be me, you know. Can I give you some lines right now for you to say? Sure. I need you to say the line. Okay. Huh? What was that? Huh? What was that? Yeah, you're nailing. And then you got to say, I guess it was nothing. What? Or if I'm a Grand Theft Auto V NPC, it would be like, you know, oh, watch where you're going. You know, something like that. Nothing. You know, I'd be pretty good at it. Driving like an idiot. Yeah. You want me to say that? Yeah. This is driving like an idiot. That's pretty pretty good. limit. We just got to wait for Grand Theft Auto V: The Lost and Damned when it eventually comes out. Grand Theft Auto V the island. What if you What if you are killed? What's What's that noise? That sounds like I'm actually having an orgasm. That's Well, that's great cuz you're cost effective. You get two for",
            "start": 371.6
        },
        {
            "text": "Auto the island. What if you were killed? What's that noise? That sounds like I'm actually having an orgasm. That's great, cuz you're cost effective. You get two for one. But what I was trying to say is that Especially the first line, Greg Del Toro is actually really good. Yeah, it's really good. You know, you can emote. He's a complete hack otherwise, but the that one line was pretty good. I had great voice direction from Liam O'Brien who's a voice actor who's been around the block. Did he really help you? Yeah. A thousand. Were you awful or something when you got It's not I think The lines were fine. Like my lines when for like the boss fight when I'm yelling at Tony Stark and all this stuff throat was a little tight. Throat was a little tight. He came in and massaged that with his tongue. No. Um I that was all normal and fine. He's like do this. it. What was really",
            "start": 406.08
        },
        {
            "text": "and all this stuff throat was a little tight. Throat was a little tight. He came in and massaged that with his tongue. No. Um I that was all normal and fine. He's like do this it. What was really fascinating was I'd do a line I'd do like a long line. He's like, \"Well, I liked I liked the first part of that. Can we do it do the second part?\" And then he would immediately piece it together right there. Like you know how we a we edit and it takes forever. They were he had an audio tech that was just like swinging things around in two seconds. But it got weird when then it was like, \"All right, let's jump to the next page.\" And there was like an Excel grid of like uggh. And he's like, \"All right, so now you now you've fallen from a stoop. Now you've fallen from two stories. And now you've fallen into a bottom.\" What are those called? There's a word for them. Wilhelm screams. No, no, no. Efforts. They're efforts. Okay. That's what they're called in viol. And then there was a lot of stuff",
            "start": 449.28
        },
        {
            "text": "into a bottom. What are those called? There's a word for them. Wilhelm screams. No, no, no. Efforts. They're efforts. Okay. That's what they're called in video games. And then there was a lot of stuff of like in the Lego games like the characters emote and talk in the game without talking sometimes. So it's like that he likes a lot of that. And so it there was a when we got to that page of just the weird stuff, he was doing the work. He's like give me he's like all right, give me this. And he'd be like and I'm like oh okay. And I would just parrot him. You know what I mean? That so he was great. Not not to jump in, but I think one of my biggest pet peeves is in a game when why did they choose to only record like two lines or three lines and then they start looping and they start looping and it takes you out of it. Yeah. They always do that because they only have so much time. They only have so much time and money. A lot of games that are pay attention to that though and and you don't notice",
            "start": 484.8
        },
        {
            "text": "you out of it. Yeah. They always do that because they only have so much time. They only have so much time and money. A lot of games pay attention to that though and you don't notice that stuff. Yeah. You know, which is good. Mhm. But no, no, congratulations on that. I think that was really cool. It was a hell of a week. We had a we had four days there that were jam-packed. Hell of a week for you. Really? No. I mean, it was for all of us, but I mean, especially for What's good for the goose is good for the gander. Oh, man. I love your goose and your gander. I'd rather Colin and me have completely opposite versions of this where Colin's like, \"Nah, like I'm your boy and whatever.\" But nah, I ain't taking that **** I'm like, I am your gander. Take me with you. Say my name whenever you want to say my name. I'll take that. See, it's because I I uh He fits right in. Can we can we talk about Beyoncé in the Orange Room with Yeah. Destiny's Child DC. Daddy. Like those are the old",
            "start": 523.12
        },
        {
            "text": "you want to say my name. I'll take my name. See, it's because I I uh He fits right in. Can we can we talk about Beyoncé in the orange room with Yeah. Destiny Child DC. Daddy. Like those are the old days. Yeah. I remember those days. Yeah. I always get them confused with uh TLC. I thought you were going to say I thought you were going to say LFO. Racist. LFO. Nick, I don't Nick, I'm glad you're here actually now because you weren't here for this, you know, during Greg's acceptance speech. I don't know if you noticed um you know that uh I was thanked third I was just like one of you know one of the one of the guys I was thanked and you know Kevin you know thank you you know thank you my beautiful girlfriend Christine uh you know loveine I know right huge weird also thank you you know Nick Tim Colin and Kevin you like Kevin and I emp it's look I'm just a piece of **** you were essentially a comma between just like Tim I was like I was that was nothing you know I would have honestly",
            "start": 560.24
        },
        {
            "text": "Tim Colin and Nick you like Nick and I emp it's look I'm just a piece of **** you were essentially a comma between just like Tim I was like I was that was nothing you know I would have honestly expected him to say, \"And last, but certainly not least, my platonic man toy. My, you know, my my what does he call you? My uh hetero lifemate heterolifemate Colin without whom life would cease to exist.\" No, I was just one of the guys. But, you know, it's it was it was all good. It I was busting Greg's balls, too, because uh at Podcast Beyond, I couldn't go to Podcast Beyond 400. And uh I watched it later and he was like he mentioned it once that no one else was there and he's like, \"Oh, uh Colin, Nick, and Tim couldn't make it.\" And I'm like, this was our show. You're not gonna give me a special shout out? I'm just one of the **** I'm just one I'm just one of Greg's little schmucks out there now. I'm the gander. I'll take it. Thanks, Tim. Look, it's like this, man. Like, you know",
            "start": 612.24
        },
        {
            "text": "special shout out? I'm just one of the **GameOverGreggy** show's little schmucks out there now. I'm the gander. I'll take it. Thanks, Tim. Look, it's like this, man. Like, you know, every one of us at some point just becomes Greg's stepping stool, and that's just the way it goes. Um, and I won't forget you guys when I get to the top. You will. Yeah, I know. You're like still near the bottom. I know. And you've already which And we're like below the bottom. I know, right? Which makes me scared for when you do get to the top cuz you're only giving me a fossilized remain beneath the mantle of the earth. I'm going to be like a footnote in your biography. Oh yeah, totally. And then also this other guy quit with him. He's dead. Why' I die? But I'm going to get a lot of crushed by coffee beans. It's interesting. It was a freak accident. No, but for real. I I love I love the um We were busting balls about this on Colin and Greg. You would have gotten hysterical. That Colin",
            "start": 657.6
        },
        {
            "text": "by coffee beans. It's interesting. It was a freak accident. No, but for real. I I love I love the um We were busting balls about this on Colin and Greg. You would have gotten hysterical. That Colin and Greg episode was really funny. And uh cuz I was just busting Greg's balls over and over again about it. Uh and people came up with some really great shirt designs that we should sell where where the shirt the shirt just says blank. Yeah. Just like it says uh Nick and Christine and Nick and Tim and Kevin and Nicole. No, the Crystal Dynamics artist, but no. I think that's so brilliant. I really want that to be the next show. We should do it. Sure. Let's do it. That can be t-shirt Tuesday for next month. If you didn't know, this is the Game Over Greggy show. Each and every week, four, sometimes five best friends gather around this table. Each bring a random topic of discussion for your amusement. If you like that, head over to patreon.com/kindafunny where you can support us. Let us live our",
            "start": 699.44
        },
        {
            "text": "five best friends gather around this table. Each bring a random topic of discussion for your amusement. If you like that, head over to patreon.com/kindafunny where you can support us. Let us live our dreams and get each and every episode early. If you have no way to support us, don't worry. Go to youtube.com/kindafunny where we post it topic by topic day by day until the entire show is free on Fridays as one big video in one big MP3. Big beautiful MP3. I can tell you right now, Tim, this one's worth a dollar. Oh, Matty Kerr's fitting in great. Hey, it works out. Yeah. Yeah. Batman v Superman trailer came out of nowhere. Jesus Christ. I like you though. I like you a lot. You fit in. You have a good voice. You have a good like just energy to you. That's stuck in my head now. Good. Nick, yes. What's your topic? I have I got to lead off with the uh the new Batman v Superman trailer. Don, you loved it like I did. I did not particularly care for this trailer and I I've watched it a few times now",
            "start": 741.84
        },
        {
            "text": "your topic? I have I got to lead off with the uh the new Batman v Superman trailer. Don, you loved it like I did. I did not particularly care for this trailer and I I've watched it a few times now in preparation for this what I can only assume is going to be war between you and I going it's very similar I started unfollowing people when they were like I don't like it I'm like I don't want you I don't want the haters in my parade but today I know I have to fight now you're backing me into a corner it's like Karate Kid 3 when he killed that guy by kicking him too hard that was dark I think that was at all. Um, I didn't like the actual way the trailer was put together and I think that was part of the reason why I didn't really vibe with it. Um, I didn't like that the somewhat liberal use of Jesse Eisenberg in it. I thought that his lines came off to the point where it almost made me think, is this really what this movie is going to be about? Like",
            "start": 787.6
        },
        {
            "text": "like that the somewhat liberal use of Jesse Eisenberg in it. I thought that his lines came off to the point where it almost made me think, is this really what this movie is going to be about? Like, am I going to have to deal with that level of care of of Eisenberg the entire time? And is he going to ruin the movie for me? When you walk out of the theater and you check Twitter, is everyone going to say Jesse Eisenberg ruined this movie? And that that was from that trailer. Yeah, it's gonna No, they won't say that. Well, then it'll be Zack Snyder's fault. Of course, but of course everything's fault. But I mean, I think going back and watching again, I'm like, okay, it's got more of a playful style than I'm than I'm used to. I was expecting it to be a little bit more along the lines of The Dark Knight, but because some of the other trailers leading up to it were really serious. You know, I still think that Matt's in there, but then we get to the the line of she is she with you?",
            "start": 832.08
        },
        {
            "text": "of Dark Knight, but because some of the other trailers leading up to it were really serious. You know, I still think that Matt's in there, but then we get to the line \"She is she with you? I thought she was with you.\" Hey, do you want to go get a cup of coffee? Yeah. Look, I'm best friends. It was just it comes off a little like I makes me a little scared that they're not going to be able to nail that tone, you know, cuz that's a very thin line between if a little bit to the left, a little bit to the right, and this whole thing's going to come off as cheesy and campy and it's not going to have the intensity that I need it to have, you know, especially since that, you know, the Marvel universe is supposed to be what it is and the DC universe is supposed to be kind of a little bit darker, right? From what we've been able to cobble together. Yeah. Yeah. So, I mean, that was my take on it. I mean, I don't know if obviously I'll reserve",
            "start": 865.52
        },
        {
            "text": "is supposed to be kind of a little bit darker, right? From what we've been able to cobble together. Yeah. Yeah. So, I mean, that was my take on it. I mean, I I I don't know if obviously I'll reserve judgment for when I actually get my butt in the theater, but the the the Lex Luthor character is the one that that is most concerning for me. I just I got to see how that plays out. What I What don't you like about him? I don't like that. He is goofy. He's just like He seems like more closer to the Joker than he is. I see that. He's an eccentric. Like, you know what? I mean, the funny thing about it is what you're saying is interesting because Max Landis is convinced that Jesse Eisenberg is just doing an impression of him. That is and like that's I mean, that's the kind of he's he's trying to be this eccentric billionaire, you know, billionaire who's like this Facebook money kind of kid like this tech. Isn't that probably a more accurate representation of like what that",
            "start": 905.04
        },
        {
            "text": "to be this eccentric billionaire, you know, billionaire who's like this Facebook money kind of kid like this tech. Isn't that probably a more accurate representation of like what that kind of character in today's world? Like this weird, weird scrawny guy. He's not just some suit at the top of a building who has all this money. Yeah. Yeah, I just I just worry that that character is hard to nail, right? And we've been burned before. Let's not forget Kevin Spacey, the great Kevin Spacey debacle of circa 2000. I mean, that that was I mean, I don't blame his performance as Lex. I blame the fact that they just said, \"Do Superman one again and he was like, 'Oh, I want to be a villain.'\" Okay, good. Glad that's still happening. Um, other than that, there were some awesome moments in the trailer, though. Uh, namely like getting to actually see them battle back and forth and knowing that I think they've done a good thing so far as far as the story is concerned with knowing that he's",
            "start": 944.96
        },
        {
            "text": "trailer, though. uh namely like getting to actually see them battle back and forth and knowing that I think they've done a good thing so far as far as the story is concerned with knowing that he's going to not be able to win that fight. And so there's got to be another reason why he's doing it. And I like that idea because you know you got the the moment in the trailer where he says what are you like stop I could have killed you if I wanted to just stop like what you're doing and you see basically Batman get his ass handed to him for the most part. Um, but then there's the inclusion of Wonder Woman, which is the big wild card in this whole thing is like, how are they going to start integrating all these people with when in the DC universe, they had what, like six movies before they decided to do Justice League, give or take. Um, we're just seeing Wonder Woman for the first time here and she just pops up in the trailer and I'm like, is that really how she's going to they're going to set",
            "start": 987.92
        },
        {
            "text": "to do Avengers, give or take. Um, we're just seeing Wonder Woman for the first time here and she just pops up in the trailer and I'm like, is that really how they're going to set her up as her alter ego, but um, I don't know, man. It all just kind of seems really fragmented and frayed right now and I really want to see how they pull it all together. Mhm. Okay. So, for you though, was it just the fact that like all of the elements are there, you know, like maybe you're staring at the recipe and it's all laid out on the counter, you're like, hopefully they put it together correctly. I mean, my whole thing, my only honestly, my only criticism of the trailer is the fact that yeah, they gave away too much. Now, here's the thing is when I was freaking out in the reactions video with Tim and everything else and that night and da da da, did that matter to me? No. Right now, does it matter to me that much? No. Like, it would have been",
            "start": 1022.64
        },
        {
            "text": "I was freaking out in the reactions video with Tim Gettys and everything else, and that night, da da da, did that matter to me? No. Right now, does it matter to me that much? No. Like, it would have been cool what I was doing is have you seen this? I haven't watched it. Reddit did a re-edit of the trailer where they said everybody said it fixed it or whatever. Have you seen this? You want to see it? Sure. Let's see what happens. All right. For everybody at home or watching this thing, you can just Google. This is the spoiler-free fan edit. Right now, we're getting a sweet ad. Oh, fun. You know what? I love these to start with the very delicate piano. Well, it's kind of similar to how the fan edit. Oh, jeez. I guess do this thing the ad. But no, like that my only thing is like it gave away too much. It's like, okay, but I don't hate that. It got me hyped for real. I still want to see them fight Doomsday and how are they going to do that? It gave away too much. Is it Wraith",
            "start": 1059.12
        },
        {
            "text": "it gave away too much. It's like, okay, but I don't hate that. It got me hyped for real. I still want to see them fight Doomsday and how are they going to do that? It gave away too much. Is it Wraith and blah blah blah blah. It It hinted at a lot. I mean, I don't know. We'll see where it all comes down to. I mean, I think the thing is it gave away way more than I thought it would, but there's still so much we don't know. There's so many heroes in this damn movie that we haven't seen yet. So, I don't think it gave away everything. And people are acting like we know the whole movie. It's like you don't you really don't. You haven't seen 50% of the **** in this thing. Yeah. Yeah. You know, and it's like with Batman v Superman, like I liked the Batman v Superman trailer that they didn't show Spider-Man. I hope they don't show I really hope they don't show in any trailer and like they're probably going to cuz that's how movies work. But that's a reason that's the reason I'm concerned about the movie. Um",
            "start": 1094.0
        },
        {
            "text": "they don't show i really hope they don't show in any trailer and like they're probably going to cuz that's how movies work but that's a reason that's the reason i'm concerned about the movie um i'm excited about it i think the trailer was 80% really good i was really quite intrigued i was way more intrigued by watching greg watch it um definitely uh but to me that's why i'm concerned is because they already showed such a dense amount of the movie that how are you going to flesh out the entire movie and all these characters and make them work in two hours or two hours and 10 minutes whatever it's going to be um when it's already seems like there's enough density in this one trailer for two movies i really feel like all you have to do in this movie is flesh out batman and lex wonder woman has two scenes i imagine the party thing we've seen where she's there we introduce her oh this is diana why why she's talking blah blah blah she must they don't know her clearly",
            "start": 1127.2
        },
        {
            "text": "Woman has two scenes. I imagine the party thing we've seen where she's there. We introduce her. Oh, this is Diana. Why? Why she's talking blah blah blah. She must they don't know her clearly in Wonder Woman fashion yet. And then she shows up in the end to help him fight this thing around. And then Donna Justice is the or not Don Justice League. Yeah, she has her own movie they started shooting off. Do you do you actually like Zack Snyder as a filmmaker and his visual style? I do. You enjoy that. So, is this just seeing everything that you've wanted for 30 years come to fruition? Is that just what? It doesn't matter what they're saying in the trailer. It doesn't matter how cheesy the lines. It doesn't matter what they look like. Is that just it it could be anything and you would be excited? No, because I mean I think that you can make a bad trailer and I would think oh like it took me a while in the first trailer to see great I almost felt that the the tone in the first trailer felt so",
            "start": 1162.8
        },
        {
            "text": "No, because I mean I think that you can make a bad trailer and I would think oh like it took me a while in the first trailer to see great I almost felt that the the tone in the first trailer felt so much more grounded. I I I definitely and I don't I'm not a comic reader. I I honestly never been really big into comics. But I think sometimes like we've lost this idea that comics are fun. They kind of are playful. And I mean you may know this better, but would Batman and Superman have that kind of moment? Wouldn't that be like a playful thing? That's the thing is like the animated series. I don't know if it just comes into view this is a film that everyone wants to be gritty that there's a moment they're having some fun. They're guys with superpowers. Of course they're going to have fun. Yeah, I know. I mean, and that's what I have to kind of wrap my head around, right, is that I don't know. Like the problem with that is this. The movie that that preceded it is Man of Steel.\n\nI corrected the following errors:\n\n* \"wing grety\" → \"Tim Gettys\"\n* \"final fantasy versus 13\" was not present in the chunk\n* \"game over greggy\" was not present in the chunk, but I did capitalize \"Batman and Superman\" as they are proper nouns.\n* Corrected spelling of \"comics\" to match common usage.\n* Added capitalization for \"Man of Steel\", which is a proper noun.",
            "start": 1204.08
        },
        {
            "text": "fun. Yeah, I know. I mean, and that's what I have to kind of wrap my head around, right, is that I don't know. Like the problem with that is this. The movie that that preceded it is Man of Steel. That's all we have to go off of. And Man of Steel was very much not that. Did you like Man of Steel? I liked Man of Steel. I I wanted to love it. I wanted it to be the same reaction I had when I watched the trailer 50 times for that movie before it came out. And I cried when I heard Russell Crowe give that like the rousing speech. And then I was like, \"Wait, there's another the exact same trailer with Kevin Costner instead of that.\" I'm like, \"Fuck, I got to listen to that.\" And I like went back and forth and debated which one was better, Russell Crowe, hands down. Um, but that movie was serious. That was a sci-fi movie. That wasn't let's let's like there was one or two little nods to like let's have a little fun with this, which is like what does that stand for? He's like it",
            "start": 1243.28
        },
        {
            "text": "was serious. That was a sci-fi movie. That wasn't let's let's like there was one or two little nods to like let's have a little fun with this, which is like what does that stand for? He's like it stands for hope and or whatever and the microphone buzzes and things like that. So, we have those small little moments, but there's this looks more like a buddy cop film. I mean, I don't I just don't agree because I think Man of Steel did have those moments just overlooking him. He spikes a drone in front of the general and he's like, \"I'm from Kansas. It doesn't get more American.\" And then she's like, \"He's hot.\" And it was that those were fun moments of levity just leveling a city. You know what I mean? Like that was the other thing, too. They're making out in the dust that is literally people. There's plenty of other things that are not like super serious and grounded in Man of Steel. Yeah. But there was a tone, right? There was a tone of like when you think of that movie, do you",
            "start": 1277.52
        },
        {
            "text": "people. There's plenty of other things that are not like super serious and grounded in Man of Steel. Yeah. But there was a tone, right? There was a tone of like when you think of that movie, do you think of it being more like the animated Justice League, or do you think of it being closer in tone to a sci-fi film? Like, oh no, it is a sci-fi film, right? So, this doesn't look Oh my god. Spike your phone and get out of here. No one needs a text right now. It gets more American than that. So, I mean, that's that's going to be my thing. And you'll know from the first like, you know, the first obviously 10-15 minutes where they're going for, but I think that they're there. I think that he's probably trying to go for a little bit more light-hearted tone, which is I mean, yeah, I think they are. Well, is this them chasing Avengers and trying to fit that family-friendly It's mixing. It's Avengers mixed with The Dark Knight because it is that dark. They're trying to",
            "start": 1311.92
        },
        {
            "text": "is I mean, yeah, I think they are. Well, is this them chasing Avengers and trying to fit that family-friendly It's mixing. It's Avengers mixed with Dark Knight cuz it is that dark. They're trying to like match that, but they're not doing that. And they know that. There's no way they're doing that because it's not grounded in reality. We've known it. It's not grounded in reality since Man of Steel. So, it's like, all right, we take that. But then, yeah, there is the Avengers, Captain America, like watch your language type jokes and stuff, which it's cringy. That was super, but it's cheesy and cringy, but it's not like that's the like the point. You can't write these characters differently. Yeah. But I think you can though, and that's that's that's my problem is that you watch what they're doing in the animated world and they can get super serious with them, right? And so it's like how it's really hard I understand to translate that that level of of intensity over to live action because",
            "start": 1347.04
        },
        {
            "text": "in the animated world and they can get super serious with them, right? And so it's like how it's really hard I understand to translate that that level of intensity over to live action because you are at the end of the day dealing with Ben Affleck in a bat suit and Henry Cavill playing Superman. Like at a certain point you have to just be like this is probably as far as we can go with this. But even the animated show, I mean there's no animated show, no matter even the movie, like the DC animated movies, they still have those, it's still cheesy. Even The Dark Knight, him, the thing, this isn't a car, like well that was bad. That does come in black? Yeah. Like stuff like that. Like that's but but when you use up the next when you use those moments it's it's comic relief, right? It's the the movie. If you watch The Dark Knight again, there is an underlying level of tension in that film that slowly raises all the way like and basically jumps a level every time we see the",
            "start": 1386.32
        },
        {
            "text": "It's the movie. If you watch The Dark Knight again, there is an underlying level of tension in that film that slowly raises all the way like and basically jumps a level every time we see the **** jump. Do you think that the trailer matches that for Dark Knight? Yes. I have I can't remember the because one thing I think with Zack Snyder the trailer he that was first or maybe it was just the teaser the one with like the the the cape blowing in the wind and like the butterfly and everything was so like emotionally Yeah. Man of Steel. It was like I don't think that trailer I mean maybe it was just trying to excite people but that trailer did not match that movie. And so now I'm I'm worried that is this just a thing with Zack Snyder or with the people who edit the things or is this just all marketing? Isn't that the thing that they say about him is that he makes great trailers? Yeah. Well, that's what you trailers and so let me give you let me give you a little bit of perspective as",
            "start": 1430.0
        },
        {
            "text": "all marketing? Isn't that the thing that they say about him is that he makes great trailers? Yeah. Well, that's what you trailer makers and so let me give you let me give you a little bit of perspective as someone who doesn't really know anything about this stuff because this is this is because I think I think it's going to because I think frankly it's going to be valuable to maybe not most of our relationship but most of the people are going to see this movie. A it doesn't matter what happened in any of the comic books or what this is based on or the animated series cuz no one cares. Like that that's number one. So like th this is this is like one of those things where like the precedents aren't important just like the precedents that were set say by the Schumacher Batman movies weren't important you know because no one gave a like that was just their own interpretation really of what was going on in the '60s as opposed to the more grounded Burton movies and then obviously like the",
            "start": 1469.44
        },
        {
            "text": "important you know because no one gave a like that was just their own interpretation really of what was going on in the '60s as opposed to the more grounded Burton movies and then obviously like the masterpieces at the Nolan trilogy were I think so like you know those are all disconnected from each other and normal people that see all those movies know that they're all different but they don't know why and so you have to like look into like people walking into this movie like my father for instance, who's going to see it, I'm sure, and who's excited about it. He's he likes watching a lot of movies, and he's not a superhero, but he's going to see this, and he's not going to have any of this context. And so, that's going to be the normal person that's going to go see it. So, and that's kind of me, too. I have more context into Batman, I guess. But, I'll tell you what I like about it. And and what I like about it is I I like Ben Affleck as Batman, and I like Henry Cavill as Superman.",
            "start": 1498.8
        },
        {
            "text": "of me, too. I have more context into Batman, I guess. But, I'll tell you what I like about it. And and what I like about it is I I like Ben Affleck as Batman, and I like Henry Cavill as Superman. And like I especially like Superman. Like, I'm actually really into it. I was telling Greg that we've seen these two shots before from the previous trailer, but that shot of him descending in front of the capital building is **** awesome. That's an awesome **** shot. And the other shot of him like in what looks like Hurricane Katrina or whatever where he's back lit or whatever. I'm like these are amazing shots. Finally the technology can make Superman look the way he's supposed to look. I think um and I have to say I really like Lex Luthor. Like I think that he's really like super unsettling and **** weird. I love that one shot of him when he like puts his hand on the girl's head like and he's like he's like it's a three-letter or three syllable word for whatever and like for what",
            "start": 1528.72
        },
        {
            "text": "and yeah, I love that one shot of him when he puts his hand on the girl's head like and he's like it's a three-letter or three-syllable word for whatever and like for what people can't understand. Yeah. Like and I'm like that seems tonally from what I know about Lex Luthor kind of in line with like it kind of resonates with me as someone where I was telling Greg I'm like I like this character, Lex Luthor is an interesting unsettling psychopath clearly you know uh so I don't think you have to have like the brooding weird man at the top of the tower you know like uh necessarily that's my interpretation. I don't know if most Superman fans feel like that cuz I don't have a connection to that character. But I will say what I'm super concerned about with the movie and why I think it's going to be maybe mediocre is there's it's just too dense. A I agree with you that end scene is",
            "start": 1564.64
        },
        {
            "text": "with the movie and why I think it's I'm going to see it. I'm excited about, but I think it's going to be maybe mediocre is there's it's just too dense. A I agree with you that end scene is campy as hell. And and uh that's something that DC needs to get away from because their characters are inherently campy compared to, you know, the more overtly over the top X-Men or Avengers, whatever, with their Captain America with his suit or Wolverine with his claws. There's that's corny. Like these like these guys are supposed to be a little more like not grounded because Superman's not grounded, but they're normal people. Mhm. So that seems like there's a dissonance there with like that and and especially Wonder Woman who I think like is just corny as hell. Like I'm sorry like like that like just corny as all hell. Like that scene is so stupid to me with their shield and they're like who brought like what you were talking about. I'm like this is so dumb. It just",
            "start": 1601.68
        },
        {
            "text": "like that like just corny as all hell. Like that scene is so stupid to me with their shield and they're like who brought like what you were talking about. I'm like this is so dumb. It just then Yeah. And and so like so I'm afraid of how they're going to like pigeon hole or or wedge that kind of stuff into this movie including with Aquaman and other characters I think are probably going to be equally corny. um when you really have these two pretty strong characters represented by really two strong actors and that should be the focus. Batman an older kind of Batman Affleck is really cool and this and Henry Cavill as Superman is totally believable to me. So like I wish that they would just focus on those things. This movie seems to be too dense, you know, already. The problem is this movie, Dark Knight was a movie. Batman Begins was a movie. This isn't a movie. This is a long trailer and that's all it is. It's like it is dense because all it is is just here's a bunch of",
            "start": 1638.16
        },
        {
            "text": "is this movie, The Dark Knight was a movie. Batman Begins was a movie. This isn't a movie. This is a long trailer and that's all it is. It's like it is dense because all it is is just here's a bunch of things teasing out things that are going to happen. Just smaller amount of those things and not reveal as much. Like what if we didn't see Wonder Woman at all and what if that was the reveal in the theater? I mean but that's what I'm saying like the movies are are just longer trailers at this point. But who's going to be the reveal? I mean Aquaman obviously Cyborg I guess is going to be in it, right? So like you have I mean I think don't forget too that I mean like I think we're seeing everything out of context. You're talking about comic relief, right? And I if I'm if I'm a betting man, it's Doomsday's working these two dudes. Batman's it looks like either the Batmobile or the Batwing is downed. Uh he's he accepts that he's about to die and he puts up his hands. Wonder Woman jumps",
            "start": 1672.24
        },
        {
            "text": "working these two dudes. Batman's it looks like either the Batmobile or the Batwing is downed. Uh he's he accepts that he's about to die and he puts up his hands. Wonder Woman jumps into frame, blocks it with a shield, goes full bore at this thing and they have this amazing fight. Knock down. Batman finally gets out and he's like, \"Did you I think I think while like she's destroy taking buildings and smashing.\" I mean, like, I don't think it's as natural as a cut. I think it's going to work in the film. But but understand why contextually why I brought up that like I'm ignorant about this stuff, but I'm someone who's excited about the movie. And this was something I was talking about with Tim is that it's a foregone conclusion for some people, for DC fans, for instance, to know that eventually they're going to partner up, but they ruined the tension in that trailer. Like, we know that they're it's like B the movie's called Batman v Superman",
            "start": 1709.04
        },
        {
            "text": "fans, for instance, to know that eventually they're going to partner up, but they ruined the tension in that trailer. Like, we know that it's like B the movie's called Batman v Superman, you know? And like me going into that, I'm like, I don't have any context. So, like I don't know what does that mean. I have no idea what the **** that means. I love that line where Superman's like, you know, I would have killed you basically already if I wanted to. I'm like, that's a really powerful line. Leave it there, you know, like, leave it there. And and maybe they partner up, but maybe that's obvious to comic book fans, but that's not obvious to me. And I'm telling you that is not going to be obvious to most of the people that are going to go see the movie. They want to know what that means. And they ruined it in the **** trailer. They ruined it. They ruined that whole tension, the whole tension of the title, you know? And so, you have to you have to kind of",
            "start": 1744.64
        },
        {
            "text": "to know what that means. And they ruined it in the Batman v Superman trailer. They ruined it. They ruined that whole tension, the whole tension of the title, you know? And so, you have to you have to kind of like withdraw yourself. It's kind of the way I felt about the G.I. Joe movies when they came out cuz I'm a huge G.I. Joe fan or whatever where I'm like I have a lot I have a lot of expectations and a lot of for like four like four conclusions of what this should be and what Storm Shadow should be and what Snake Eyes should be and stuff like that. But when when I walked out of the movie I'm like that movie sucks. But when some people walked out of the movie they're like I don't know anything about G.I. Joe and now it's just a fun action movie and I'm like yeah but I have expectations. Yeah. And so that's what I think that like you guys have to kind of remove those because there's just a lot of tension that was ruined and I think that's a really good way of putting it and people had put it that",
            "start": 1774.4
        },
        {
            "text": "that's what I think that like you guys have to kind of remove those because there's just a lot of tension that was ruined and I think that's a really good way of putting it and people had put it that way where like well that sucks man that that scene shouldn't have been in that trailer. Just that one scene even if Wonder Woman is in it in a different way. Just that one scene of them working together I think was really was really quite stupid. I mean you know eventually that it's going to be they're going to build the Justice League, right? I I and I respect what you're talking about. But but we might know that but most people don't, right? Like no one most people are going to say we don't even know what the **** the Justice League is. That's probably true. Uh I mean my I I'm the trailer was kind of bittersweet for me. I'm hopeful and I'm also reserved about it for the same reason everyone else is. Right. I don't know if they've had enough time to set these characters up so that when",
            "start": 1804.08
        },
        {
            "text": "was kind of bittersweet for me. I'm hopeful and I'm also reserved about it for the same reason everyone else is. Right. I don't know if they've had enough time to set these characters up so that when and if there are those big emotional set pieces like you're talking about, they will really hit. Right. For instance, what you're talking about needs we need to be invested in those characters and we need to be invested in Wonder Woman for her to come save the day and for it to make sense. It can't be like a comic book where you're like you turn the page and all of a sudden Wonder Woman's there for no reason. Like you're used to that in comic book land, in movie land. That is a cardinal sin to just throw a character in, right? Which is, you know, it's it's it's fine in games. It's fine in these things that have these long long legacies. Like take Metal Gear Solid for instance. Like when characters come back from previous games that like four games ago, you're like, \"That was awesome.\"",
            "start": 1833.76
        },
        {
            "text": "fine in these things that have these long long legacies. Like take Metal Gear for instance. Like when characters come back from old games that like four games ago, you're like, \"That was awesome.\" Because you understand that. Sure. But we don't have that yet in the movie world, right? They're not set up. So that's my one trepidation is I'm I'm I want to love this. I know I'll like it. We're all going to enjoy it. It's all it's going to be a good film. when we're picking it apart because like Star Wars, it means something to us. I want to love it, right? I want to love it. Like I left Man of Steel, right? It's not because I left Dark Knight and I was like, my mind was just blown by that. This isn't that like I know. I know. I'll settle for I'll settle for Man of Steel. I liked Man of Steel. I've watched it three times since. I'm like, this is a good film. I don't care what anyone says. It's entertaining. It does what it needs to do. Um, I'm",
            "start": 1870.32
        },
        {
            "text": "for Man of Steel. I liked Man of Steel. I've watched it three times since. I'm like, this is a good film. I don't care what anyone says. It's entertaining. It does what it needs to do. Um, I'm hopeful because of all the other **** that's in the trailer that we haven't even talked about yet, which I'm sure you touched on, but like the the sort of connection to um what's the character? Is it Darkseid? No, Dark Side. Dark side. Have you seen Have you talked Have you heard the parach like that if they're setting that up? They called it That's **** awesome. He did say that looks like Dark Side. Not Not in the reference that we're making, but you are the first person in that I was around who is it dark side? I'm like, no, it's Doomsday and then the paratrooper. I want to give you troopers. But so that's what I like about this, right? Is that they are finally going, \"Hey, we can't make a Superman film where he fights a **** island, right? He's he's got to fight Doomsday and he has",
            "start": 1904.08
        },
        {
            "text": "But so that's what I like about this, right? Is that they are finally going, \"Hey, we can't make a Superman film where he fights a **** island, right? He's he's got to fight Doomsday and he has to fight and and that was my big thing like when um when Superman Returns came out and everyone was talking about like, oh, they should have had a character like he should have fought uh Brainiac or he should have fought Metallo or any of these guys. This is a smart idea. Come out of the **** gate swinging with Doomsday because it doesn't get any better than that. Yeah. And then try to go better with Darkseid. Yeah. Did you uh overall watching the trailer after your reaction? Yeah. Do you What would you change of it? Anything? I I mean I would have I mean No. Yes. No. I I wish they had shown less, but I think I wish they would have shown less because I think it's that's the one main knock so many people have against it. I I I like it. Here's what I'll be honest with about it, right? Is that",
            "start": 1943.12
        },
        {
            "text": "but I think I wish they would have shown less because I think it's that's the one main knock so many people have against it. I I I like it. Here's what I'll be honest with about it, right? Is that I like so many people being negative about the trailer because I think that the movie is going to exceed their expectations. Like I still I stand by the fact that the Wonder Woman introduction, it won't be as out of the blue as you turn the page, but I mean like you're going to see Diana at the ball talking to Bruce because you've already seen that sc that screenshot or whatever image I guess they call him in real life. Um and so like that's a tip of the hat to anyone who does know that that's going to be Wonder Woman and then she comes and does whatever. The scene I'm most excited for that I that has been teased that we don't know anything about is Jeremy Irons as Alfred talking to Bruce. Yeah, like we have like that one line or what drives men to madness or whatever. I want I'm not worried",
            "start": 1981.68
        },
        {
            "text": "has been teased that we don't know anything about is Jeremy Irons as Alfred talking to Bruce. Yeah, like we have like that one line or what drives men to madness or whatever. I want I'm not worried about the focus of this the way I was worried about Spider-Man 3 when I was watching. I'm like, why are they putting all these people in this movie? What the **** is happening? This one I think it's going to be two little bits of Wonder Woman that make you go, \"Holy **** that's awesome.\" And either she's having the Hulk moment from Avengers where you want more of her or Aquaman is and whatever his introduction is going to be. Cyborg, I think, is going to be there. The Hawkeye. No, but I mean I he's I like everything talks about this is like he's still Victor Stone. He's just going to be there. Again, it'll be a nod of if you know he's that's Victor, you know, he's going to become Cyborg. That's when you lean over to somebody and say something about it or it's just that he's there to establish",
            "start": 2016.56
        },
        {
            "text": "it'll be a nod if you know he's that's Victor, you know, he's going to become Cyborg. That's when you lean over to somebody and say something about it or it's just that he's there to establish that he's in this world and Aquaman's in this world. I really think the focus is, you know, people have talked about that. Then they tried to draw back from a little bit and explain is is it's a Batman movie that you know what I mean? Superman, we know Superman. Now we have to learn who who this Bruce Wayne is in this world. Who this Batman is in this world? What's going on with the Robin suit? Is it Jared Leto's Joker? You know what I mean? Like how do we all tie this into this thing? I think you're gonna I think you're going to get a ton of that. And I think that's going to be the focus. Meanwhile, we're we're playing to who Lex is and what's happening with him and Yeah. When does he lose his hair? Exactly. And Toey for Grace is Nightwing. It's gonna be great. It's gonna be fun.",
            "start": 2053.84
        },
        {
            "text": "Meanwhile, we're playing to who Lex is and what's happening with him and Yeah. When does he lose his hair? Exactly. And To be fair for Grace is Nightwing. It's gonna be great. It's gonna be fun. Great. So, my whole take on the trailer is that, you know, everyone's biggest thing is that, oh, they showed too much or whatever. I think that they had to show that because they when you put it up against the Marvel stuff, right, with the Civil War, they needed to outdo that trailer. Like, they just had to gain momentum back. Civil War didn't show too much. But to me, the Civil War trailer, eh, it's just more, which is great. Cool. I'm going to see the movie. I know I'm going to love it. At this point, we're sold. We're already invested in all this stuff. But it's like that trailer, yeah, if it showed Spider-Man, everyone would be like, but it's like we don't need that, right? The Batman v Superman thing I think did need that because Batman v Superman, they're on the losing",
            "start": 2087.6
        },
        {
            "text": "yeah, if it showed Spider-Man, everyone would be like, but it's like we don't need that, right? The Batman v Superman thing I think did need that because Batman v Superman, they're on the losing team right now. Like that's they needed to at least show who's the bad guy. My biggest critique of the people giving critiques of this trailer is the freaking anyone saying that, \"Oh, that's the Teenage Mutant Ninja Turtles.\" Those aren't the **** Teenage Mutant Ninja Turtles. Those are the stupid talking about the part where the Ninja Turtle comes out of the building and goes and then his eyes glow. That was a Ninja Turtle, right? I hate you so **** much. But it's like that thing. That's what Doomsday looks like. This is the DC Comics universe version of Doomsday. Google Doomsday. That's it. So, I I read a little bit about it and so I my first reaction was like, \"Oh, I don't like that.\" But I did not I haven't read the comics. I didn't know that Doomsday has like different forms and like the things grow. So, like you can see",
            "start": 2123.28
        },
        {
            "text": "so I my first reaction was like \"Oh, I don't like that\" But I did not I haven't read the comics I didn't know that Doomsday has like different forms and like the things grow So like you can see if you put the horns on me like that looks exactly like Doom Exactly And that's kind of my point And it's like for anyone that thinks that's what Ninja looks like People are just people people are just being cynical like The And we've all we can all we've all been cynical and are cynical about things But but the thing is that I'm I'm pretty optimistic about the movie I'm just I'm interested in in how it resonates you know like Civil War is a culmination of work right Or at least one of the culminations of work There'll be many culminations because they're never going to let this thing die Um but like this is already like you said an established thing What I'm concerned about with Batman v Superman is that if this falls flat or isn't good it's going to **** everything",
            "start": 2155.44
        },
        {
            "text": "die. Um, but like this is already, an established thing. What I'm concerned about with Batman v Superman is that if this falls flat or isn't good, it's going to **** everything up for that universe. And they that's why and I was talking to Greg about this. I know it's leaving money on the table. Well, I know it's not smart business and whatever, but like I wish that DC would just take a different tact and just be like, we're not Marvel and we don't have the like we don't do things like they do them. We do things in a more thoughtful way like in a more sober and solemn way like we did with the Batman trilogy where it's like we're going to do our own thing and it we don't have to make this interconnected capitalist-driven kind of universe that we're trying to just one-up each other. Like we have our own stories to tell in our own fashion. And now that they're all intrinsically linked to each other, one of them is if one of them is really bad, then they're",
            "start": 2187.6
        },
        {
            "text": "oneup each other. Like we have our own stories to tell in our own fashion. And now that they're all intrinsically linked to each other, one of them is if one of them is really bad, then they're kind of **** because they're starting from a bad point already, especially with Superman. And that was the thing I was telling Greg, like this is Superman's last chance, like with people, I think, in terms of making him super Marvel-type relevant to people. Like they need to nail this. Batman's already relevant because of what Nolan did. So they can possibly ruin him as well. But I don't think they're going to. I think they have a good thing going with Affleck. So I'm just I'm super interested to see how that all goes down. But I wish DC would just take a different more mature approach because that's not what I really mean. But it doesn't necessarily be dark and brooding like that. But you're saying I mean you have to get this universe",
            "start": 2226.4
        },
        {
            "text": "I don't want to say mature because that's not what I really mean. But it doesn't necessarily have to be dark and brooding like that. But you're saying I mean you're just saying I have to get this universe going. Oh, you want to make a Wonder Woman movie? Go make the best Wonder Woman movie however you want to do. Why do they all have to touch each other? You know, like it's awesome. Well, I mean, no, it's what comics are. It's awesome if it works. I know. It's awesome if it works. It can be disastrous if it doesn't. And that's like why I think the guys there's they're taking a huge risk, you know, because they could just make a Superman movie or just make a Batman movie or make a Batman versus Superman movie. You don't have to pigeonhole and throw in Cyborg and all these characters in there and you know like we don't you know culminating in the Justice League especially with uh Suicide Squad which I I'm pretty convinced is going to be bad. Um like they're they just have to be careful",
            "start": 2259.92
        },
        {
            "text": "and you know like we don't you know culminating in the Justice League especially with uh Suicide Squad which I I'm pretty convinced is going to be bad. Um like they're they just have to be careful because they don't they're they're chasing they're chasing Marvel and they're not Marvel. Like that's why I always liked DC more because they're not Marvel. They're you know and Batman especially so **** cool. Like don't **** with him, you know? Like Batman is so goddamn cool. Well, the the one the one good grace of Batman though is he he survived the Joel Schumacher era. And if you can survive that, I mean, that's like surviving a **** nuclear blast. So, Batman will always be cool. Oh, it took it took one of the great filmmakers. During that time, there was like two superhero movies in 5 years. That's true. The superhero genre wasn't a thing. The 15 got released yesterday. Yeah, man. Batman's the king. Batman will live forever. Sorry. I'm I'm wearing the Google results. No, but",
            "start": 2291.52
        },
        {
            "text": "in 5 years. That's true. The superhero genre wasn't a thing. The new Batman v Superman trailer got released yesterday. Yeah, man. Batman is the king. Batman will live forever. Sorry. I'm I'm wearing Google results. No, but remember that you're right. Like people did look back at Batman Forever and Batman & Robin and stuff and they're terrible movies. I mean they are **** awful. Uh there's some interesting things in them. I like the villains in them. I don't like the way the villains act. I don't like but I like Tommy's over-the-topness of it is there's something to be said about that and he tried and he tried something that didn't work and I respect that. But to my mind Batman was redeemed only because of who was making it and who was acting in those movies. Like Batman could have easily been ruined even more if it was given to someone else. Nolan saved those movies, you know, like Nolan made Batman what it was and that's why our",
            "start": 2329.2
        },
        {
            "text": "those movies. Like Batman could have easily been ruined even more if it was given to someone else. Nolan saved those movies, you know, like Nolan made Batman what it was and and that's why our expectations are really high for this, you know. Well, I mean Nolan does in some degree have Joel Schumacher to thank for that because everything's a product of what came before it, right? So the Joel Schumacher films were a direct product of the dark kind of weird twisted **** up Burton films. And then Nolan came in and was like, well, we can't do either of those, so let's go super real with it. And that was what was so powerful about that. And now they're going the opposite direction. I think they're going in a great direction, don't get me wrong, because I don't think Batman deserves to be 100% real. I don't I think there always is going to be an element of he is a superhuman being not be not in form but his super power is that he's Batman. Yeah. And so like there's got to be a little",
            "start": 2367.68
        },
        {
            "text": "100% real. I don't think there always is going to be an element of he is a superhuman being not be not in form but his super power is that he's Batman. Yeah. And so like there's got to be a little bit of an error of unbelievability. He should be able to do things that are Batman-esque in that maybe you look over and he's gone. Right. And that's kind of a magical fun thing. Maybe he does that, maybe he doesn't. I don't know. But I think they're going they're angling more toward that feel with this. I just hope they again it's the hardest thing to do in a film because you don't know. You're talking about something that that they've pro I I don't know how many days they shot on Batman v Superman, but I have to imagine it's more than a couple months they put into this. You don't know when you roll the camera the first time what that film's going to be after all that footage and all those special effects. And it's really hard tonally. It's like the hardest thing. If you ask any",
            "start": 2399.76
        },
        {
            "text": "you roll the camera the first time what that film's going to be after all that footage and all those special effects. And it's really hard tonally. It's like the hardest thing. If you ask any filmmaker, they'll say the hardest thing is to nail that tone and nail that intensity that we're going for because you don't know. You shot that end scene the first day, you know? You don't know. So hopefully they nail it. I either way I feel like everyone needs to just kind of relax, take a breath, and realize that it's a movie about a guy that can fly and do that dressed up like Batman. Yeah. And just enjoy it. Going back to the original conversation you had about the trailer and like how the trailer was made and you said you didn't think it was that great of a trailer. Yes. Like so my thing with that is I enjoyed it for a trailer. I thought it was fun. It kept my energy up and I was into it and like I didn't hate it or love it, but I'm like cool. That was my my thing is",
            "start": 2433.52
        },
        {
            "text": "Like so my thing with that is I enjoyed it for a trailer. I thought it was fun. It kept my energy up and I was into it and like I didn't hate it or love it, but I'm like cool. That was my my thing is this is cool. Um, and I didn't didn't know all the insider **** cuz like I'm not that hardcore into the DC thing. So, I didn't **** lose my **** in the same way that you would have. Um, my biggest problems with it is that I'm a fan of Zack Snyder trailers. Very much so. So, yeah, man. Exactly. Man of Steel trailer, Watchmen trailer. Like, those are **** classic trailers. This, to me, I put it probably really low on the the Zack Snyder thing. Having said that, it's still **** amazing cuz Zack Snyder trailers are great. But the most cringeworthy thing to me of that whole trailer was not the the line at the end of the the **** It was and I was show telling you this earlier. It's the music bothered you. This really bothered me because I think that it's it's just like for when you",
            "start": 2463.76
        },
        {
            "text": "the line at the end of the episode, I was telling you this earlier. It's the music that bothered you. This really bothered me because I think that it's just like when you edit a trailer, it felt off and it took me out of it where it's all this like classical music playing. Is it the Yeah. Yeah. And then it looks at his reaction. So it's the classical music playing at the banquet, right? And there's like, oh, then you're meeting this is Bruce Wayne or whatever. And it's like it's background music, which is fine, but then the moment it's like, oh, this is Clark Kent. And it's like this piano key comes out of nowhere where all of a sudden the background music jumps up and it's like breaking the fourth wall of it. And I'm like, oh, I don't like that. It really bothered me cuz I'm like, this this is not a great trailer. It's unfortunate, too, because the trailer should not take me out of it that way. I know. I was uh I was watching both of",
            "start": 2504.96
        },
        {
            "text": "that. It really bothered me cuz I'm like, this this is not a great trailer. It's unfortunate, too, because the trailer should not take me out of it that way. I know. I I was uh I was watching both of them when I was on vacation and I so I was catching up on all the trailers. I watched Civil War first and then I watched the little exclusive like clip they had of when he lands and walks up and grabs him and I was like and he was like rips it off and there's a **** insane intensity between the two. I'm like whoa this is going to be a cool movie. And then I immediately watched the next trailer I was like totally different tone. Like watch those two back to back and you'll be like what what happened? I don't understand what's going on. But again, they're the same movie. So it's like Greg keeps saying like the movie is going to be different. It's not going to be cut that way. True. So both scenes all those scenes are in that movie. That's true. And the other the other weird audio thing I",
            "start": 2538.16
        },
        {
            "text": "saying like the movie is going to be different. It's not going to be cut that way. True. So both scenes all those scenes are in that movie. That's true. And the other the other weird audio thing I didn't like about the trailer is at the end when it had the like when it showed you know the title splashes **** there's like **** goes da da d and it's the same **** audio loop. Not happy with the score. That was my overall. Yeah. I mean it might again those are just the trailers they put together too. So that's a whole separate house that's doing those trailers and they probably it might actually be two two different houses that are doing the trailers because there's so much that people have to put out now like nine TV spots, three different trailers, sneak peeks, all this **** So I'd be interested in Zack Snyder can't watch them all. I'm sure when he was making 300 he was like yeah I want to go to the actual",
            "start": 2569.84
        },
        {
            "text": "I'd be interested in Zack can't watch them all. I'm sure when he was making Zach didn't even watch his trailer. No, I mean I'm sure when he was making 300 he was like yeah I want to go to the actual trailer house and be like I want to sit there and pick it's probably part of his contract. I would imagine he gets to actually do that and he probably cared a lot about 300. Not that he doesn't care about this, but that was like his first like chance to really break out and establish himself. Um and so I'm sure that he was probably really really pouring over that. But I mean he probably had a lot more control there than he does with DC and Warner's probably like no we'll **** you do what you got to do. We'll do what we got to get the movie done and get it done. Get done. I'm tired of you. I'm tired of your attitude. Who's this? Oh, the detective Lance is working at Warner Brothers. Boral, tell him to hurry up. You're gonna tell me, you don't know the arrow. He's so good when you do it.\n\nCorrected phonetic mistakes and spelling errors:\n\n* \"Zack\" → \"Zach\" (correcting for context of making 300)\n* \"Boral\" → \"Burton\" (assuming reference to director Zack Snyder, who worked with Burton on Batman v Superman: Dawn of Justice)\n* \"Lance\" → \"Laurence\" (assuming reference to Laurence Fishburne, who played Perry White in the DC Extended Universe)",
            "start": 2603.6
        },
        {
            "text": "tired of your attitude. Who's this? Oh, the detective Lance is working at Warner Brothers. Tell him to hurry up. You're gonna tell me, you don't know Arrow. He's so good when you do it. It's because the voice is a little bit off, but your face expression squint up just like him. He's so good. I'm telling you, I can stand in for you anytime on the set of Arrow. Detective Lance, we're going to have to talk off air about what you think is going on with Legends of Tomorrow, cuz I've watched one episode of Arrow this season. Really? Yeah. I'm like Flash. I'm too behind on Arrow, except for last night's which I thought was supposed to be awesome watching. Not everything has to be. It's fun. It's forgettable. I mean it's like it's fun. Maybe it's going somewhere. Last night's episode we flipped out about but I they ruined it on Twitter when I'm reading but I was like called it a long time ago. I'm not too worried about that. Kev knows",
            "start": 2635.68
        },
        {
            "text": "It's going somewhere. Last night's episode we flipped out about, but I think they ruined it on Twitter when I'm reading, but I was like called it a long time ago. I'm not too worried about that. Greg knows what I'm saying. Matty Kerr. Yeah. What's your topic? Um, you know I've been thinking about it for two months now. Um, I donated and I was like, \"Okay, I need to come up with an idea.\" Kind of funny. Yeah, thank you for that. Good plug. No problem. It's what I do. Um, and I was trying to think of something that would encompass what I want. I don't want to just like show up here and say something like a like a dick joke. I didn't want to say just like breakfast cereal. I didn't want to say something that was like a big black baseball bat. **** God damn it. Um, um, I just uh, I wanted to do something, and as I keep uh thinking about it, it it dawned on me that the reason I actually donated and came on the show was I got asked a question. Um, who do you want to eat dinner with? If you had a chance",
            "start": 2675.04
        },
        {
            "text": "and as I keep uh thinking about it, it it dawned on me that the reason I actually donated and came on the show was I got asked a question. Um who do you want to eat dinner with? If you had a chance to go um meet someone and sit down and talk, get drinks, eat dinner, and pick their brain a little bit. Who would that be? And I think first instinct for a lot of people is like a celebrity or celebrity crush or maybe it's a musician or rock star or a band or maybe it's a political figure. I don't know. Uh and it first gut response was 100% Greg Miller and Colin Moriarty. It was like I have listened to You mean Greg, Nick, Tim, Kevin. And that's the thing. We'll call him Nicole Tan. No, it honestly it honestly clicked that I listen to uh uh podcast beyond. I listen to Game Over Greggy. I used to listen to like weekend review like way back when when I was like 17 18 years old and um IGN is AFK. I know the best part when podcast came out then it was like thanks for",
            "start": 2718.0
        },
        {
            "text": "Gamecube. **** I used to listen to like Weekend Review like way back when when I was like 17 18 years old and um IGN is AFK. I know the best part when podcast came out then it was like thanks for listening to IGN's podcast. IGN's podcast series and it was like a Japanese. It's like they had to tell you what you were listening to cuz podcasts weren't a thing yet. Um, but yeah, so I it clicked in my head that I wanted to uh meet you guys. And that's not a slight to no any of you guys, but it was just Nick and Tim. It's been Which by the way, not to interrupt you real quick. Let's let's pound it real quick. I went to uh to see a movie this weekend and I went with Sean Finnegan and some guy from across the theater goes, \"Hey, hey, Nick, Kevin, Nick, Kevin.\" And I I'm like, \"There's no way someone's screaming towards me saying Nick and Kevin.\" And it's not what I think. And I look over at him and he's like like freaking out. I'm like, \"No, Tim Finnegan. Tim Finnegan.\" He's like, \"I'm so\"",
            "start": 2770.96
        },
        {
            "text": "screaming towards me saying Nick and Kevin.\" And it's not what I think. And I look over at him and he's like freaking out. I'm like, \"No, Tim Gettys. Tim Gettys.\" He's like, \"I'm so sorry. I'm so sorry.\" Like, \"Yeah, we get that a lot.\" Yeah. They're audio listeners. Gotcha. Are you sure that he just wasn't telling you that he likes me and Kevin better than you? I feel like that might have been You tweeted at me later. Thank you for that. I appreciate it. People get that wrong all the time, but it's okay. So, my mom keeps calling my brother my brother's name all the time, so it doesn't matter. Do you ever get that grown up? They call you Tegan. My my mom does the whole date column. Yeah, I get that all the time. I'm like, \"Mom, like you call me Dan all times. Calls me Declan, which is like her oldest grandson.\" It takes a while for them to get to Colin. Yeah. Sorry. But the D and Dana Ally is like my favorite thing ever. I'm like, \"It's just Colin, mom. It's just me. I'm not",
            "start": 2816.56
        },
        {
            "text": "It takes a while for them to get to Colin. Yeah. Sorry. But the D and Dana Ally is like my favorite thing ever. I'm like, \"It's just Colin, mom. It's just me. I'm not even you have two daughters, so you should know that, right? It's not Dana or Ally, right? Uh, go down the line.\" But yeah. Yeah. But anyways, uh I was just thinking that I would ask you guys essentially the same thing. Um this is not going to be necessarily me talking. So why us though instead of a celebrity you know I don't want to be it's his week. He wants just more of it. How did you think what how did my speech affect you at the game? Yeah. You want like what I was feeling though. Uh I think it just like clicks in my head. I've I don't personally have that I don't have that want or need. I maybe it's a lack of free time. Maybe it's a lack of a a crush on a person or an idea or whatever. I just I think that I listen to you guys when I'm like just walking down the street, I'm driving",
            "start": 2854.24
        },
        {
            "text": "I think that I listen to you guys when I'm like just walking down the street, I'm driving, I'm I'm going to bed, I'm doing other things and it's just a consistent it's like I have maybe 10 different podcasts and you guys have always been just like another one of them. And I relate to you guys and obviously you guys have the community, you have this whole empire you're creating and I just thought it's a city state. It's a city state. City state. Yeah. And I just thought it was I thought it would just be a cool moment to um like this is all like I'm sure anyone else can feel this is all super surreal. It's weird. Like I don't get like star struck. I don't get but like seeing familiar things that I've seen before is definitely like very strange and amazing. And how's the other side of the room look like? You imagined? I mean I just it's bubble baths and like it's weird. Like",
            "start": 2896.8
        },
        {
            "text": "things that I've seen before is definitely like very strange and amazing. And how's the other side of the room look like? You imagined? I mean I just it's bubble baths and like it's weird. Like there's some **** happening over there. Portillo knocked that off. Specifically look I mean take you're actually not kidding. looking at Kevin all the time because he gets more I had no idea that was a thing and he's like dropping **** and that's a real he's dropping **** and that's real Kevin distraction in the world around the 40 minute mark I looked over there and his eyelids were heavy and I was waiting to see if he was pizza sleeps were kicking in God bless him God bless him he's lovely but no and I I definitely think that there is relatability that I feel um to start with it was like Colin Moriarty and Greg Miller were definitely the first idea, but like just this as a whole, The GameOverGreggy Show with the five of you guys. It there's relatability. You guys all have so much distinct",
            "start": 2942.72
        },
        {
            "text": "Colin and Greg were definitely the first idea, but like just this as a whole, The GameOverGreggy Show with the five of you guys. It there's relatability. You guys all have so much distinct personalities and characters and like you will say the most heinous stuff and I'm just like that's I will say that tonight. I like that's that same idea. And then you are just like you said this is your week. You are becoming this insane amazing person that I guarantee you thousands if not hundreds of thousands of people soon will be like, \"Dude, you changed their life and you do that every day.\" Colin, you are one of the smartest men ever. I truly could listen to you talk about nothing and everything. Thank you. Yeah. And I truly I like respect that more than anything. It's like so many people talk, me included, for nothing. Like I just talk because I like to hear myself talk and I don't say the smartest stuff and I'm super naive. And when you s when you talk like you you you",
            "start": 2987.92
        },
        {
            "text": "many people talk, me included, for nothing. Like I just talk because I like to hear myself talk and I don't say the smartest **** and I'm super naive. And when you s when you talk like you you you choose to be silent but when you talk you say something that of substance and of meaning and maybe it's your person like your personality or your personal beliefs but I got to get up on this. Greg's yelling. Oh, thank you. That's very nice of you up. And then as for Tim, you wear nice shirts. Thank you. You just have I just like your Mickey Mouse watch and uh Oh, yeah. No, I actually I look at you and uh you're 26, correct? Yes. you're like similar in my age and I look at this group that you are part of and I look at your humor and I look at your style and your idea and your knowledge of like YouTube and like you are very much in my wheelhouse of how I view life. Um, so I know and you're just Greg it's so easy to pick on him. Why is it so easy to pick on him? He can take it",
            "start": 3030.48
        },
        {
            "text": "of like YouTube and like you are very much in my wheelhouse of how I view life. Um, so I know and you're just Greg it's so easy to pick on him. Why is it so easy to pick on him? He can take it because he's shunned into the side. I don't get it. He's our dark horse. He loves it. Watching watching Nick and Tim or Nick and Greg have a uh slap fight on the couch on the love seat before when Nick's like, \"Let me touch you.\" Yeah. Because Greg sat he came and sat down next to me purposely and I'm like, \"I want I'm going to touch.\" Now, that was sat with intent, my friend. You wanted to be touched. Your your body and your your mouth and your every word that came out of it were saying no. But deep down behind those eyes, you wanted my finger somewhere inside you. Oh, and I will say that's the uh that's the moment when I got here. Um it was I want to say somber. Somber is not the right word, but it was quiet. It was like you get here and you don't see behind the scenes and there was no popping",
            "start": 3076.4
        },
        {
            "text": "the moment when I got here. Um it was I want to say somber. Somber is not the right word, but it was quiet. It was like you get here and you don't see behind the scenes and there was no popping circumstance. No one stopped working. We're all like, \"Oh, hey.\" Yeah. What's up? This is a coffee. That was the moment that it clicked. I was like, \"Okay, there there's that's what I was waiting for. I just want a finger in like just something.\" Yeah. I mean the thing is it goes it goes for those of you who don't know who who have never listened to the show before if this is your first entry into our little world here Je is that it goes like this I pick on Kevin picks on Tim and then Tim just takes it and that's how it goes but Tim gets really mad you Greg picks on me and Colin picks on Greg and that's pretty much that's how it goes and if you've never seen this I'm a random guy no it doesn't we're all terrified to pick on you because you'll tear us apart with your mental acuity. But",
            "start": 3123.76
        },
        {
            "text": "who would you guys personally doesn't necessarily have to be dinner or drinks or whatever, but if you had the opportunity, who would you want to with? Someone that's alive that's someone that you like realistically could go meet, who would that be? And I mean, you guys also like are gaining traction. You guys are meeting celebrities and meeting other people. So the crazy thing is like the people you say you could probably definitely meet. I can't say Taylor Swift and go and meet Taylor Swift, but we can we can say I mean yeah hope and dream and we just do it. It's really interesting you say this because like I I often think about this and where I'm at in my life now compared to where I was at even like last year and the year",
            "start": 3168.64
        },
        {
            "text": "and dream and we just do it. It's really interesting you say this because like I I often think about this and where I'm at in my life now compared to where I was at even like last year and the year before that and looking back 5 years 10 years and to see how because I I think about this question and I often think like who do I want to meet? How long till I meet exhibit? How long till he pimps my ride? How long till he pimps my ride? Uh but yeah, so I I kind of think of how could I make these things happen. Uh cuz I'm schemy like that. Like that's kind of always been who I am, right? And so I look at my the list of people over the years that I would have said and I'm really kind of knocking them off like like just one by one. like you're looking at Bernie Sanders, Freddie Wong. Um, all these people are people that I'm now like friends with and I I've received multiple times a year, you know, but at at certain points in my life, they would have been the people that I would have done",
            "start": 3211.92
        },
        {
            "text": "these people are people that I'm now like friends with and I I've received multiple times a year, you know, but at at certain points in my life, they would have been the people that I would have done anything to be like I would love to spend time to just talk to you and get to know you just like you're talking about. It's funny cuz like with Kevin, go get the **** dog. Um, you shut up, you dirty rat. You fit right in. You fit right in. Um, with Freddie in in particular, a long time ago, I he when he first launched a Kickstarter for Video Game High School, one of the the perks was for and I think it was for $2,000, you can go spend a weekend with Freddie, and he'll like teach you how to do video stuff and all this. And this was like Video Game High School season one, so it must have been like 2010ish. And I remember being like, \"This is awesome. Like, this is an opportunity to get him to know who I am, and I know I can prove myself to him. We'll be cool. everything will be fine from",
            "start": 3252.88
        },
        {
            "text": "like 2010ish. And I remember being like, \"This is awesome. Like, this is an opportunity to get him to know who I am, and I know I can prove myself to him. We'll be cool. everything will be fine from there. And I was like, \"All right, I got to do that.\" So, I came up with a brilliant idea to come up with a Kickstarter to fund that 2000 to get me there. Ended up not doing that. That is the most Tim Gettys-esque scheme if I heard one. Um, but I remember talking to Nick and our friend Eric from my GN about this. And I was like, like, hey, I want to do this or whatever. And you were the one that told me like, you know, like I guarantee you that if you just keep doing what you're doing, you'll meet him eventually and it'll it'll just happen. And you were the reason I didn't do that. Now, I don't think that was necessarily would have been a bad decision to do. I mean, you listen to me, so inevitably it's probably the worst decision. No, I mean, but it worked out. And",
            "start": 3296.24
        },
        {
            "text": "do that. Now, I don't think that was necessarily would have been a bad decision to do. I mean, you listen to me, so inevitably it's probably the worst decision. No, I mean, but it worked out. And the thing is, it's like it's cool to me that it's like there's when you have these opportunities, you got to take them or at least look at your options of getting what you want, right, and how you're going to make it happen. And it is cool where you kind of just I found myself falling upwards in that. Um, there's a bunch of people that I'd love to meet like Jay-Z. I think Jay-Z is a very interesting human being. I've always been fascinated in kind of the business of stuff and kind of making yourself a business. That's what we do. And my whole life has been aiming towards doing that. And I think Jay-Z's a perfect example of someone that started from the bottom. Now he's here. You know, Drake. Yeah. Yeah. Absolutely. John Mayer not back. But so now, so now I look at it and I'm like, \"All",
            "start": 3333.04
        },
        {
            "text": "I think Jay-Z's a perfect example of someone that started from the bottom. Now he's here. You know, Drake. Yeah. Yeah. Absolutely. John Mayer back. But so now, so now I look at it and I'm like, \"All right, who would be the person that I want to meet now that I can meet these people that I I would?\" Cuz I'm I'm just like you. I don't need to meet celebrities and stuff like that. Like that's not like meeting a Michael Jordan while cool is not something I'm like that's on my **** list. Michael Jordan with the Hitler mustache. Yeah, I was going to say what what he gets his hands on you. That was the hands. I thought you said I thought you said hands. Michael Jordan's getting touchy. When did this happen? Um but so I I also like I'm a fan of videos and a fan of these things. So I'm like dude it's like I know these people cuz I've listened to them for years so I can relate to them whatever. Um, so those people I just kind of like I feel like I want to meet naturally now be doing what I'm",
            "start": 3370.0
        },
        {
            "text": "It's like I know these people cuz I've listened to them for years so I can relate to them whatever. Um, so those people I just kind of like I feel like I want to meet naturally now be doing what I'm doing. So I'm being the schemy **** I am. It's not, oh, how can I meet a celebrity just so I can hang out with the celebrity I like. It's how can I meet somebody that can become my friend so that we can make more friends, you know, and like network and stuff. So, I'm going to go with Taylor Swift because I do think she's the right answer because if I hung out with with, you know, my girl Tay, I think that we'd hit it off and I think we'd be good friends and I think that that would make Kinda Funny huge because she would tweet about us all the time. We'd do like Tumblr things together. I don't even have a Tumblr, but I'd get one just for Yeah, like Snapchat. I'm already blowing up on Snapchat. Tim Gettys is following me. Um, but I'm sure you know T Swift would make that better.",
            "start": 3411.6
        },
        {
            "text": "I don't even have a Tumblr, but I'd get one just for Yeah, like Snapchat. I'm already blowing up on Snapchat. Tim Gettys' following me. Um, but I'm sure you know Taylor Swift would make that better. Sure. And I just think that she's a good person. I like her. I enjoy her social media persona and I want to be part of that. I gotcha. So, similar stories. Yeah. That we've all started meeting people and doing different things. Like for I think years my answer would have been Kevin Smith and then this year we got to go to Kevin Smith's house and do two podcasts and hang out with him for four hours or whatever it was. That was awesome. And so like now like we because we've done like what celebrity you wanted to meet and stuff like that and I said Bill Murray and what was what was it? We did some topic similar but not this. Who would you want on the show? Something like that. Yeah. Yeah. And I was like, \"No, there was some there was something out there.\" And I'm a big Bill Murray fan, but in",
            "start": 3448.08
        },
        {
            "text": "Matty Kerr (Special Guest) - The GameOverGreggy Show Ep. 106\ntopic similar but not this. Who would you want on the show? Something like that. Yeah. Yeah. And I was like, \"No, there was some there was something out there.\" And I'm a big Bill Murray fan, but in terms of a dinner, like who would I want to chill out with and spend time with and conversate the whole time? Cuz I feel like Bill Murray would be a great interview podcast, but maybe not just chill out for two hours, sit over a bottle of wine. Kee sitting there doing this. I would say I'm going to give runner up to Dan Aykroyd because I would love to talk to Dan Aykroyd because I think it would be about making movies. What's he doing now? UFOs and ghosts and like there's so many things to talk about that aren't just like you're famous and what's that like? You know what I mean? Like he sells a vodka he believes is through filtered through crystals with souls in them. I'd love to speak about that. That's true. Oh, that's real. Crystal skull head. What was the movie? Kingdom of the Crystal Skull",
            "start": 3488.16
        },
        {
            "text": "a vodka he believes is filtered through crystals with souls in them. I'd love to speak about that. That's true. Oh, that's real. Crystal Skull Head. What was the movie? Kingdom of the Crystal Skulls. So, this is Crystal Head Vodka. Yeah, I always screw it up. So, but Crystal Head Vodka comes in a little glass skull. It's good. It is good. I do like it, Greg. If you're looking for gift ideas. Um, but the one I'm gonna go with, hint hint, I'm gonna go with The Rock. Oh, yeah. God damn. That's a good pull. That's a good That's a good pull. And I And it's one of those where this is I do believe The Rock and I are going to cross paths at some point and have him on the show or whatever. And it's one of those like sure I'd love him on the Game Over Greggy Show, but I would love a one-on-one I have two hours with The Rock just to talk to The Rock because it's so there's so",
            "start": 3526.88
        },
        {
            "text": "or whatever. And it's one of those like sure I'd love him on the Game Over Greggy show, but I would love a one-on-one I have two hours with The Rock just to talk to The Rock because it's so there's so much to talk about with The Rock. I you know his childhood and his upbringing and all that. He talks about how rough it was all the time. His wrestling stuff cuz like really the interesting thing about The Rock is is that when he was actively wrestling and I was this is attitude era and I'm watching Yeah. You know, you know, right? And I'm watching it like he was such he was so charismatic and so good in the ring and I did not like him based on the whole feud he had had with Mankind. And I'm talking about like behind the scenes stuff where he didn't like say thank you to Mick Foley after that match. He was a heel though. Correct. But but I'm talking I'm talking about what I knew of him in the business. I'm not even talking about what's happening in front of the screen. I'm talking about",
            "start": 3564.72
        },
        {
            "text": "match. He was a heel though. Correct. But but I'm talking I'm talking about what I knew of him in the business. I'm not even talking about what's happening in front of the screen. I'm talking about backstage. You know what I mean? And so I want to but I was so it was always this weird thing of like I love you in the ring and but I don't like the way you act backstage and d right. And then now he's like not everything you see about this man is that he's genuinely awesome. And so I want to talk to him about like Did you fuse yourself with a tank? How is he so No. See Well, I know. I watched that. I watched that. There's a great video. Oh, I think BuzzFeed did it, right? where they like the one guy eats the rocky meal for a day or two days and does his workout plan and is just like he's eating salmon at like **** seven in the morning and he's like so disgusted with himself and then thrown up by the end of the day. Uh there's that, sure, but I mean I want to know like did I have it",
            "start": 3602.64
        },
        {
            "text": "eating salmon at like seven in the morning and he's like so disgusted with himself and then thrown up by the end of the day. Uh there's that, sure, but I mean I want to know like did I have it wrong or did you really mature or like what you know like what is what was his journey and his growth path to become the person he is today? Cuz like everything I'm like you're amazing you know what I mean? Like whether it's that he's taking selfies with like you know the kids who are like knocking on his mom's house like you know when he's there when they see him there whether it's that he's helping this person doing that and like he's just doing all these things that are marrying people really nice people. Yeah. Marrying Nick Monday. Yeah. Yeah. That was awesome. You know what I mean? That's that's the thing is like he's down for awesome cool internet stuff. He gets he gets where he is and like that's what's like doing his like Instagram battles with uh Kevin Hart.",
            "start": 3642.8
        },
        {
            "text": "That's that's the thing is like he's down for awesome cool internet stuff. He gets he gets where he is and like that's what's like doing his like Instagram battles with uh Kevin Hart. Yeah. **** hilarious. I love him man. And that's the thing is like, yeah, did I have it wrong or did he really mature or like where, you know, I I'm Man, I want to talk to Dwayne \"The Rock\" Johnson and just talk his ear off. That's the best answer. Thank you. I tried. Colin, you want to go next? Sure. I mean, a name came to mind immediately and then I was thinking of other names. I'm going to go with my gut instinct. Barack Obama. Uh, you mean the president, the President of America? Uh, I would like to just go to the White House for just a night and just have dinner with him and beers and just hang out with him and just like just talk to him because I I don't agree with a lot of what Barack Obama says, but he's a really fascinating person and I like him personally. I think I think he's very likable personally. I",
            "start": 3675.84
        },
        {
            "text": "like just talk to him because I I don't agree with a lot of what Barack Obama says, but he's a really fascinating person and I like him personally. I think I think he's very likable personally. I think that's why he was reelected. Um, so um I think it would be just be fun to like and I'm not looking to like get off thereord information from or anything like that, but it would just be fun to like talk to him being like what is this like? you know, like, yeah, you really are one of the more unique presidents we've ever had. And it's not because he's a black man. It's because he was an obscure, inexperienced no one, you know, and and suddenly became this rock star, and destroyed McCain, you know, and destroyed Romney. Like, it would be interesting to just talk to him be like, what has this been like for you? You're you're young. You have a young family. You have aged significantly. I don't know if you saw the the he gave a speech from the the West Wing only his third one about ISIS like",
            "start": 3713.36
        },
        {
            "text": "like for you? You're you're young. You have a young family. You have aged significantly. I don't know if you saw the speech from The West Wing, only his third one about ISIS like a couple days ago and I'm like holy **** like you look so old this job destroys men. I remember and crushes men. I remember on his inauguration day watching uh not the inauguration but like all you know the 12 hours of coverage before and after and them doing like and here's you know how you know he aged him. I remember looking like I was I remember looking at no way and now you look like man this job takes a lot from Tales from the Crypt, the job of the president is is absurdly difficult and I don't think people can relate to that and I don't think you get a lot of access to ask people like very candid questions about it and I I would like to just talk to him about him like what is it like that man has to get up every morning go every morning not not just weekdays",
            "start": 3753.92
        },
        {
            "text": "to ask people very candid questions about it and I I would like to just talk to him about him like what is it like that man has to get up every morning go every morning not not just weekdays not just some days go to an intelligence briefing in the Situation Room in the White House find out all the **** that's **** up around the world, figure out what you're going to do about that. You know, he wakes up and he's like, \"Well, there was a bombing in, you know, Libya and we have, you know, some people died. There are four American hostages in Iran. We have to figure that out and, you know, the North Koreans are doing this and the South Koreans are threatening the South.\" And I'd sit there and be like, \"What the **** are we supposed to do?\" You know, and you just delegate and then you go and then that's probably 8 in the morning. Then he has to go to the West Wing and sit in the Oval Office and just be like, \"Okay, now I have all this **** I have to do. I have all these",
            "start": 3796.24
        },
        {
            "text": "then you go and then that's probably 8 in the morning. Then he has to go to the West Wing and sit in the Oval Office and just be like, \"Okay, now I have all this **** I have to do. I have all these meetings. Maybe have to go on Air Force One and go overseas for a few days or it's like that man never stops. What's that mental fortitude you have to have? It's incredible. Like if I I I always was like I always you know Joe Biden when he would they were talking about him running, you know, which he's not going to they were talking about he was going to make a one-term pledge which no one really has made since uh like Teddy Roosevelt is really the last prominent person who have ever made a one-term pledge and and James Buchanan made it and all that kind of stuff back in the 19th century. But like to for for guys that anticipate the job is going to be so hard or just like get their job done to to want to do it again is like is almost self-hating in a way. Like I don't believe that these these",
            "start": 3828.8
        },
        {
            "text": "to for for guys that anticipate the job is going to be so hard or just like get their job done to to want to do it again is like is almost self-hating in a way. Like I don't believe that these these people that are president end up wanting to be president. I feel like they they think they want to be president and then they feel like they should be and have to be because why do you walk away from it? Yeah. Like how can you walk away from it? Like how could a Barack Obama in 2012 been like I don't want to do this again. Like he's like I have it. I can win and this is the most important job in the world and I've always wanted to do this so I do it. There's just I would just love to sit there across the table from him, drink some beers, have like some cheeseburgers. He's like a really supposed to be like a total down dude. He likes eating like **** He likes drinking like like you you he smokes cigarettes. Smoke would love to have a cigarette. Apparently chain smokes like and like had to",
            "start": 3863.04
        },
        {
            "text": "to be like a total down dude. He likes eating like crap. He likes drinking like, you know, he smokes cigarettes. Smoke would love to have a cigarette. Apparently chain-smoked like and had to give it up. That's the problem with the presidency though - it's like you never get kudos, right? No one ever goes, \"Hey, nailed it today?\" It's always dealing with the shittiest thing that's happening in the world, and you're never going to get it right. No matter what you do, there's going to be some crap out there that's like, \"You messed this up.\" So, it's like a Zack Snyder trailer - it's exactly like one. Sounds like existing. Yeah. Because like it would just be fun to walk into his residence with just a bag of Five Guys or something and like a \n\nNote: I corrected the following errors:\n\n* \"****\" -> \"crap\"\n* \"like like you you\" -> removed unnecessary repetition\n* \"Smoke would love to have a cigarette\" -> added period for clarity\n* \"Zack Snider\" -> \"Zack Snyder\" (corrected name)\n* Added periods at the end of some sentences for clarity and grammar.",
            "start": 3898.0
        },
        {
            "text": "white glove dinner with him or anything like that. I'd love to like walk into his residence upstairs with just a bag of Five Guys or something like that and like a 12-pack because he would be totally down for that probably. And just be like, let's just can I just talk to you for a few hours about let's hash it out, you know? And like I don't I don't want to talk to him about policy. I don't want to talk about what we disagree on. I just want to ask him questions about the job. Like what is this like? Yeah. How awful is this? Well, you know, and especially if you especially if you could speak to him candidly, right? And that's that would be the most fascinating thing if there was for for some reason some mystical power. They're like, \"Okay, no matter what's said in here, it's never going to get out.\" And actually talk to him. Yeah. You turn the switch and you're in the cone of silence and he tells you everything. You like, \"Fuck, like what's really",
            "start": 3932.8
        },
        {
            "text": "in here, it's never going to get out.\" And actually talk to him. Yeah. You turn the switch and you're in the cone of silence and he tells you everything. You like, \"Fuck, like what's really going on in the world?\" How many black ops were you running? Like what's going like what are you really up against? How many terrorist attacks have you never told us about that you guys were thwarted? You know, stuff like that. Yeah, they know credible things. I mean, and the president doesn't even know everything. Like the the the defense secretary is really the one that knows a lot of stuff up there. So it's like and you see that in Independence Day. I was going to say plausible deniability independence day. Um but there's truth to that. Not the alien thing, but the there's truth to like there's truth to siloing information so the president doesn't know certain things um for plausible deniability. But it would be interesting to Yeah. to ask him those questions",
            "start": 3964.48
        },
        {
            "text": "there's truth to siloing information so the president doesn't know certain things um for plausible deniability. But it would be interesting to Yeah. to ask him those questions be like what what was it like? Like they watched Obama or Obama watched Osama bin Laden get killed. Yeah. They all had GoPros on all the commandos. They sat in the situation room and watched him watch the SEALs just murder everyone. Mhm. And then take Bin Laden kill him and throw him in a sea in the ocean. You know what I mean? So it was like what was that like? Where's that footage by the way? I wonder if that footage is ever going to get out. But like he he they know things. They see things as presidents. It's not only unique to him. Everyone I mean George W. Bush would be a fascinating person to talk to or Bill Clinton Bush won. Reagan would have been really interesting too. Carter would be an interesting person to talk to. It's just interesting to get the perspective of Jimmy",
            "start": 3994.48
        },
        {
            "text": "Jimmy Carter would be an interesting person to talk to. It's just interesting to get the perspective of Jimmy Carter would be interesting too, just because like he wanted it and he got destroyed by Ronald Reagan in 1980. I mean, like, rebuked and like thrown in the trash heap of history basically. Um, and that you would almost get a different perspective from him because he's looked at as like one of the worst presidents we've ever had. And it would be interesting to get his perspective on it. It seems to really hurt him like when he when you when you when like people interview him and kind of broach that subject with him. So, that would be an interesting thing. Jimmy Carter is an old man. He's gonna die soon. You know, he's in his 90s. So, it's like it would be fun to meet celebrities or musicians and I'd love that kind of stuff. I'll never forget you know I've met 311. I've met Dredg.",
            "start": 4031.52
        },
        {
            "text": "die soon. You know he's in his 90s. So it's like it would be fun to meet celebrities or musicians and I'd love that kind of stuff. I'll never forget you know I've met 311. I've met Dredg. I've met all like these guys that are my heroes. It's and that's fun. But if we can have a real substantive conversation about something about someone who's like real who like has really seen **** and done **** and I would like to do it with him when he's still in office. I think that would be Oh yeah. Just like totally Fascinating. So, that's my answer. And I know you guys have seen some **** and done some **** As you guys like keep talking, this is uh this is good. I like it. What? There's no You like that we keep talking. No. No. Yes. Absolutely. Kevin is doing It looks like he's giving a **** but he means get close to the microphone. Speaking of uh The Rock, by the way, you would ask You should ask him. Speaking of the Bin Laden raid, he was the first person that knew about it. That's",
            "start": 4062.8
        },
        {
            "text": "but he means get close to the microphone. Speaking of uh The Rock, by the way, you would ask You should ask him. Speaking of the Bin Laden raid, he was the first person that knew about it. That's awesome. And you should ask him how the **** who told him. Oh, he's he's talked about that before. I don't even know what he talked He had like a cousin on the SEAL team or whatever. He probably shouldn't be talking about that since his cousin's probably going to be removed from SE. I mean, I'll you go, but I'll look it up so I have the right answer. Well, who who do you want to what what obscure DP do you want to sit down with? No, I would like I mean, there's a couple a couple people that I would love to sit down with right now. I'd love to have dinner like in the next week with J.J. Abrams. Just be like, \"What is your **** life?\" Like, it's coming. It's coming. All right. Um, that was my first that was my gut instinct was to say like I'd love to talk to him like what has this whole",
            "start": 4100.72
        },
        {
            "text": "Just be like, \"What is your **** life?\" Like, it's coming. It's coming. All right. Um, that was my first that was my gut instinct was to say like I'd love to talk to him like what has this whole process been like? Like tell me truthfully like has it been more of a pain in the ass than you think it's worth or is it like has all the pain been worth it? Cuz you have to imagine that making a Star Wars film has been anything but easy. Anything. Why was he on the poster? You can tell me. There you go. Um, but the other thing that the other thought I had was maybe sitting down with someone like Ridley Scott, right? Who's had really great successes and really big failures, right? And that I think would might be a little bit more fascinating because JJ Abrams really hasn't had a bad film. He had Super 8 that people, it wasn't the most amazing film ever made, but no one really panned. Everyone's like, \"That was pretty cool film.\" Um, you know, he made Mission Impossible 3. Uh, he did, he had",
            "start": 4131.76
        },
        {
            "text": "Eight people thought it wasn't the most amazing film ever made, but no one really panned it. Everyone's like, \"That was a pretty cool film.\" Um, you know, he made Mission Impossible 3. Uh, he did, he had Lost, he had Alias. I mean, he's got a series of hits that have basically led him up to rightfully so directing Star Wars. But I would love to sit with Ridley Scott and be like, what went wrong with Prometheus? Like, where did you talk to? Like I want to know that process because you know I'm fascinated with when films that should be amazing kind of don't live up to that. Um but I think I have to be honest with you guys and say that if Tim's going to go with Jay-Z, I got to go with Kanye just because the Twitter battle would be **** amazing. Oh my god. Of our dinner parties like fighting against each other. I love that. Can we be at the same restaurant? Yes. Back toward each other. Just **** with each other the entire time. I think it would be amazing. That's real good. Yeah. So there,",
            "start": 4173.28
        },
        {
            "text": "each other. I love that. Can we be at the same restaurant? Yes. Back toward each other. Just **** with each other the entire time. I think it would be amazing. That's real good. Yeah. So there, from what I've been able to dig up, no official comment from Dwayne \"The Rock\" Johnson. He said the bubble all this time, but this article here is pointing out the fact that it turns out that Johnson's cousin is a Navy SEAL and reportedly couldn't contain himself with the confidential news. So you assume that's how it was. Yeah. So like you don't know the story like before Bin Laden was ever like the SEALs were going after Bin Laden and Pakistan, obviously the government knew about it. The Pakistani government knew about it. The first person to say anything about it was Dwayne \"The Rock\" Johnson tweeted at 10:24 p.m. Eastern time on Sunday, more than an hour before Obama's speech, which was held at 11:35 p.m. Eastern, that he",
            "start": 4214.4
        },
        {
            "text": "a hem living under a rock and didn't know, Dwayne \"The Rock\" Johnson tweeted at 10:24 p.m. Eastern time on Sunday, more than an hour before Obama's speech, which was held at 11:35 p.m. Eastern, that he quote, \"Just got word that will shock the world, land of the free, home of the brave, damn proud to be an American.\" End quote. And I remember seeing that. Yeah. And then it was Yeah. Obama's well because I remember people were like people saw people connected quickly The Rock's tweet with the fact that Obama like the administration announced they're gonna have a a uh like a late night announce which is weird 11:30 at night in Washington like what it could have only been a few things and people were like well one of the things was like obviously Bin Laden said but there was other things too being like who else did we **** assassinate or what else **** happened. We were so upset because we had gotten burgers from Gatti's Roadside Cafe and we're having a party good to watch uh the food",
            "start": 4253.64
        },
        {
            "text": "being like who else did we assassinate or what else happened. We were so upset because we had gotten burgers from Gus's Roadside Cafe and we're having a party good to watch uh the food truck show finale to find out which was going to get the food truck and a deal and then here we are. President Obama has come out who killed this terrorist. Great. Still never saw that episode of The No, I know who won thanks to time zones and I heard his restaurant's closed. So pretty big deal. So, you know, I'm just saying it was a pretty big deal for the food truck guy who got his barbecue food truck thing and then two food truck things. One was in Mall of America. Can you imagine what that was like, by the way? What? Like the SEALs getting your own food truck? No. The SEALs landed two Blackhawks in Pakistan. One of which like landed on the thing. Yeah. Like it's all messed up. They're like running towards this compound. No one knows they're coming.",
            "start": 4292.4
        },
        {
            "text": "two Blackhawks in Pakistan. One of which like landed on the thing. Yeah. Like it's all **** like some of it's **** up. They're like running towards this compound. No one knows they're coming. They're just **** like **** popping people walk into this building. All of it's on camera being transmitted to Washington DC into the CIA and all this kind of stuff. They **** take Bin Laden's body, run back to the helicopter, detonate the other helicopter, demo like remember how they had to demo that helicopter cuz it falls badass like stealth copters. It's like I was like this is incred like like what an incredible I want that footage to come out and I think the only reason I think the only reason it hasn't is because they're they're afraid it's going to be used as like propaganda. I'm sure. Yeah. That's why we don't that's why we never they never saw the you know Hillary Clinton and everyone saw the picture of the body before they popped it in the ocean. But um they never really said",
            "start": 4334.24
        },
        {
            "text": "Yeah. That's why we don't see that, that's why we never saw the picture of Hillary Clinton and everyone saw the body before they put it in the ocean. But um they never really said either because then that would be a good propaganda tool. I love that kind of Black Ops stuff. This like Call of Duty kind of they just went and killed this dude and everyone was his boss, and just bailed without losing anyone. That scene in Zero Dark Thirty was like that, it was really well done. There's zero music. It's all diegetic sound. It's just them and you're seeing most of it through that night vision, which is always eerie - the green and they're just like Osama, calling for him to mimic, like it's a mess but there is a certain part of that scene where they nailed him, nailed him, I wish we captured him alive.",
            "start": 4370.88
        },
        {
            "text": "to like to mimic like it's it's like it's messed up but there is a certain part of that's like yes nailed him nailed him you buddy I wish we captured I wish we captured him alive that would have even been better Matty Kerr yeah that was a good topic hey thanks thank you for your for. Oh, absolutely. Is there anything you want to plug? We didn't do like the whole intro. You're from Montana. Yeah, I'm from Montana. I'm from Missoula, Montana. Um, you have your own YouTube show? I do. It's uh Matt and Maddie. It's a YouTube.com/mattmatty. We just Don't worry. Kevin just put it up. Oh, hey, thanks. It's really nice. Uh, we also do have a Patreon we just launched. I think we have like $21.40. Congratulations. Hey, thanks. It feels good. No, I know it does. Trust us, we know how it feels. People being nice to you on Patreon. Yeah, absolutely. So, uh, yeah, definitely doing that. That'd be awesome. Um, but I'm just thankful to be here. Oh, we're thankful to have you. We're also",
            "start": 4409.0
        },
        {
            "text": "People being nice to you on Patreon. Yeah, absolutely. So, uh, yeah, definitely doing that. That'd be awesome. Um, but I'm just thankful to be here. Oh, we're thankful to have you. We're also thankful for Loot Crate, who sponsored that topic. Would you classify yourself as a geek, gamer, or pop culture nerd? Then this is the subscription box for you. For less than $20 a month, you get six to eight items of gamer and pop culture licensed gear, apparel, collectibles, unique one-of-a-kind items, and more. Make sure to head to lootcrate.com/kindfunny and enter the offer code kinda funny to save $3 on any new subscription. Not that long ago, and depending on where you live, not so far away, Loot Crate blasted off into a voyage across the galaxy, searching the far reaches of space to find universally awesome gear. Using December Star Wars: The Force Awakens loot as a launchpad, we landed on some equally cosmic items for Halo 5 and more. With an exclusive Funko Pop and an exclusive",
            "start": 4453.04
        },
        {
            "text": "universally awesome gear. Using December Star Wars: The Force Awakens loot as a launchpad, we landed on some equally cosmic items for Halo 5 and more. With an exclusive Funko Pop and an exclusive shirt in this month's crate, this is the loot you're looking for. Basically, Loot Crate is like a friend who knows that what you love and surprises you with an awesome present every month. You have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate. And when the cut off happens, Jack, that's it. It's over. Cracking the voice. You like that? The voice is not back from PSX yet. So, go to lootcrate.com/kindfunny and enter the offer code kindafunny to save $3 on your new subscription today. Colin, yes. What's your topic? I wanted to talk, you know, I've been thinking a lot about friendship lately. Camaraderie. Mum and the par and specifically what the parameters of friendship are for you guys and because I think everyone has like you know we have I think the f",
            "start": 4490.88
        },
        {
            "text": "a lot about friendship lately. Camaraderie. Mum and the par and specifically what the parameters of friendship are for you guys and because I think everyone has like you know we have I think the f the word friend is used a little loosely sometimes right what is a friend what is an acquaintance and and all this um and so I'm curious what you guys like what your parameters are for like friends or good friends are I'll give you an example you know recently not well I guess not too recent now you know I broke up with my girlfriend and it was my choice and it was but it was hard you know like it's hard to do and you know people there's hurt feelings things and there's a lot it's a lot of difficulty and takes you out of the game, you know. And I realized that that um I had great friends that really understood me, including the people sitting in this room, you know, so we would just met, but you know, you know, best friends and uh you know, because this is not something we've you know",
            "start": 4532.56
        },
        {
            "text": "really understood me, including the people sitting in this room, you know, so we would just met, but you know, you know, best friends and uh you know, because this is not something we've you know, talked about with the audience or anything like That's just like something I had to deal with. And you guys you guys knew and you guys were there for me and you and and it it reminded me like that I have good friends that that understand me. One of the parameters that I identified is just like compassion, you know? Um like understanding like when a person needs to just like not be around for a while because they have other **** that they have to deal with. Um, and uh, so you know that the breakup really reminded me that I have it pretty good with my friends and that I have just a core a good core of people that I can really lean on and rely on including you guys. Um, I mean definitely you guys more than anything maybe right now in my life. Um, but I just identified that yeah that that that",
            "start": 4574.32
        },
        {
            "text": "of people that I can really lean on and rely on including you guys. Um, I mean definitely you guys more than anything maybe right now in my life. Um, but I just identified that yeah that that that it's not just about laughs and camaraderie and all those kinds of things. It's that that's important but it's about it is about for me like compassion. It's about loyalty. Like I'm I'm a fiercely loyal friend, which I think that Greg more than almost anyone can speak to in a lot of different ways. Colin is a fiercely loyal friend. Thank you, Greg. You're welcome. I just said that. I know. Uh and so loyalty is another thing that I really look for in like my friends. Like, you know, I don't I'm always I'm I really consider myself there for the people I care about. I'm I'm um you know, I might be like passive and and and stuff like that sometimes, but like when someone really needs me, um I'm there. So So that's another thing I identified. So anyway, I just wanted to open the floor up to you",
            "start": 4621.28
        },
        {
            "text": "like passive and and and stuff like that sometimes, but like when someone really needs me, um I'm there. So So that's another thing I identified. So anyway, I just wanted to open the floor up to you guys and see like what what are the parameters of friendship for you guys because I think it might be different for different people. People different people have different relationships. My my my three closest friends in this world um are Greg, Mike Pope, and Ramon. And I'm friends with them for different reasons and we have three different friendships, but there are common themes between all of them. And it is that like compassion and honesty and loyalty. You know, I know that these three people I can really call on and rely upon for anything um if I really need them. You know, I know that if I really really needed Mike right now, he would come get on a plane and come here. If I really needed Ramon to be here, he would be here, you know. Um, and so there even though like my relationship",
            "start": 4659.84
        },
        {
            "text": "I really really needed Matty right now, he would come get on a plane and come here. If I really needed Colin to be here, he would be here, you know. Um, and so there even though like my relationship with these three people are quite different from one another and and founded in different ways and forged in different ways. My friendship with Matty Kerr is forged when we were children. My my my relationship with Colin Moriarty is forged when we were in college and my relationship with Greg Miller is forged as adults. Um, so they mean different things. um they do have these common themes that these check boxes that I like to to check with my friends and that you know that you have someone in your life that you really care about. So I'm curious what you guys think about that. Yeah, for me it actually took leaving IGN to understand what friends meant to me like what that word meant to me because you know like you were saying there are the different you know eras of your life. There's your childhood. There's",
            "start": 4698.08
        },
        {
            "text": "IGN to understand what friends meant to me like what that word meant to me because you know like you were saying there are the different you know eras of your life. There's your childhood. There's your school. Then there's your post-school. And with all of that I've had a whole bunch of friends over the years and acquaintances and this and that. And there's the core group that's always there and they will always be there and the loyalty and all these checkboxes kind of come into play there. But then there's people that come into your life and they don't have that time to kind of develop with you in the same way. Like you can't have those same experiences because you can't have class together. That's just not a thing we can do anymore in our life because that we're past that, you know. And I think a lot of those experiences kind of meld and form what uh friendship means to you because that's your entire life. Then you start getting acquaintances and people you work with. It's",
            "start": 4732.0
        },
        {
            "text": "I think a lot of those experiences kind of meld and form what uh friendship means to you because that's your entire life. Then you start getting acquaintances and people you work with. It's like, \"Oh, these are the people I hang out with every day. So, we're friends. We're having fun.\" And it's like, \"All right, so to be a friend, you need to have fun with them. You need to want to talk to them. You need to be there for them. You need to whatever.\" But then you start to realize it's like, \"Oh, wait. Does if you are those things, does that equal friend?\" Yep. Or does that just equal people you're around? Convenience. Convenience and all and Exactly. And all that stuff and you're friendly with them. Yes. That's that's a really good way to put it. I've thought a lot about this lately. Yeah. And then you think about like there's some good friends you can have that can kind of be there and they could be a good friend momentarily or even for a while. So it's not necessarily",
            "start": 4767.2
        },
        {
            "text": "Yeah. And then you think about like there's some good friends you can have that can kind of be there and they could be a good friend momentarily or even for a while. So it's not necessarily that there's people that are just acquaintances, but it's like they were a friend from these years of my life and you know maybe I can gain that back or maybe not, but they're gone from my life now in terms of being a friend like that the equation is not equal in terms of that. Um, but it really kind of made me realize that to me, simplifying it to its most basic thing is my friends are the people that I want to eat dinner with. They're the people that I will hit up to get dinner with and to that constantly think I haven't eaten with this person in a while. It doesn't need to be dinner. It can be lunch. It could be whatever. But it's like for us when we go too long without getting like a group lunch, it stops feeling like friendship. It starts feeling more like IGN felt. Sure. where it was just",
            "start": 4806.16
        },
        {
            "text": "It could be whatever. But it's like for us when we go too long without getting like a group lunch, it stops feeling like friendship. It starts feeling more like IGN felt. Sure. Where it was just like whatever because it's like us going to get group lunches is not I mean it is we talk about work and stuff but it's like we're hanging out you know what I mean that's that to me is when we feel most like friends or when we do get dinner it's rare but when we do and I think the leaving IGN thing to me it's like I have so many people that I love at IGN care for in all these different ways but it's the people that I week after week maybe once a month even it doesn't need to be that crazy but I'm like ooh I haven't had dinner with Finnegan in a while I haven't had dinner with Darren or whatever it's These are people that I that they're my friends, so I should eat with them because that is when we can catch up and actually talk and Yeah. I don't know. Dinner. Dinner. That's the theme of the",
            "start": 4846.56
        },
        {
            "text": "It's these are people that I that they're my friends, so I should eat with them because that is when we can catch up and actually talk and yeah. I don't know. Dinner. Dinner. That's the theme of the episode. No, I mean I'm good point. Yeah. God damn it. You're right. No, I mean that was uh yeah, I think that was the same thing for me where I think my definition of friendship's been rocked hard and I'm still trying to come down on what it means anymore. You know what I mean? Because yeah. You would have asked me last year or whatever that yeah. Oh, I have work with all my friends here and da da da. And it's like, no, they really weren't my friends. We're acquaintances. We're friendly together, but it's not like we had the relationship I thought we had because you are in that. You are IGN was always interesting because we were and this is interesting the same way is that we're horsing around having fun like you're talking about. It's fun times and then there are these intense bonding",
            "start": 4886.24
        },
        {
            "text": "was always interesting because we were and this is interesting the same way is that we're horsing around having fun like you're talking about. It's fun times and then there are these intense bonding situations of E3 and this and travel and that time this happened and we're sharing a hotel room and d you know what I mean? And then you get removed from it and it's like well where are they? You know what I mean? Like it's not you know what I mean? Like I don't have to like you know for Po and me it's so natural. You know what I mean? When I'm back in Chicago I'm with Po. You know what I mean? Colin and I live together. So when I'm home, Colin's here. You know what I mean? Like but like and it goes both ways. Of course I haven't reached out to a number of people. You know what I mean? Or we have that casual like, \"Oh man, we should get dinner soon. We should.\" And then it never really comes together, right? But like there's that intense draw and bond when I'm if I'm in Chicago, I got to",
            "start": 4926.8
        },
        {
            "text": "have that casual like, \"Oh man, we should get dinner soon. We should.\" And then it never really comes together, right? But like there's that intense draw and bond when I'm in Chicago, I got to see Po and if when I'm, you know, call and I haven't been around each other, we're going to see each other and be, you know what I mean? Like I'm still struggling with it. I don't have a good answer for it of how it all works out and parameters and stuff like that. I don't know. I'm friendly with tons of people, but it's not like I it's hard to put anything to it, you know what I mean? Like I I've you know, I struggled with a long time of like uh at IGN I always said we were always family, you know what I mean? And we are and there's that the family crest of IGN, you know what I mean? like, you know, it was so cool at the game awards this week to win my award and the next award Dunham won or Rocket League one, you know what I mean? So, he came through with his award and was like, \"Oh my",
            "start": 4963.36
        },
        {
            "text": "you know, it was so cool at the Game Awards this week to win my award and the Rocket League one, you know what I mean? So, he came through with his award and was like, \"Oh my god, look at this. This is not the lives we thought we'd have eight years ago, you know what I mean?\" And it's like that's like that family bond, you know what I mean? Where it's like I'm not running out and getting lunches with Dunham. Granted, he lives far away, but even when I'd roll through San Diego, like I'm rolling through for work or whatever, you know what I mean? Like for me the best like I guess for me personally right now as I struggle with this definition and who's a real friend and who's just an acquaintance and how was it a matter of convenience for this that and the other. The best example I can give is Scott Low and Cindy Tang, right? Is that like we when they lived in San Francisco, Christine and I hung out with them all the time. Scott and I would go do",
            "start": 4994.08
        },
        {
            "text": "best example I can give is Scott and Cindy. Scott Low and Cindy Tang, right? Is that like we when they lived in San Francisco, Tim and I hung out with them all the time. Scott and I would go do stuff and it wasn't like I shouldn't say all the time, right? Because we're super busy. So maybe I'm talking about we actually go and hang out and you know do this once or a month or whatever. And then we went to Japan together. And there's this, that, and the other. You know what I mean? And when they moved to LA, it was like a month later afterwards where it's like, I really miss them. And as I went to text him, he texted me the same thing. And you're like, that's what it's about. You know what I mean? And that's I think a similar thing with Dave Fenolio. You know what I mean? Like Dave and I have hung out in real life five, six times. You know what I mean? But there was that bond where I remember that that Sunday morning. I was like, Dave was awesome. And he looked at",
            "start": 5030.4
        },
        {
            "text": "Dave and I have hung out in real life five, six times. You know what I mean? But there was that bond where I remember that that Sunday morning. I was like, I'm Dave was awesome. And I he looked at my phone, he texted me, \"Hey man, just thinking of you in my backyard.\" But I was like, \"Oh, **** yeah.\" You know what I mean? Like that's the that's like, you know, that's real cool, too, cuz his backyard is amazing. Yeah. There's like this serendipitous thing of like, you know what I mean? You meet these people and you do have that thing. And like you're saying, it's completely different adult friendship, right? You know what I mean? Like Dave Fenoy and I didn't grow up together, you know what I mean? Like Po and I have hours and hours of stories from everything we ever did cuz we were together all the time. You know what I mean? Since 8th grade on or whatever and that we'd known each other longer than that. But like that's real, you know what I mean? There's that real connection",
            "start": 5066.96
        },
        {
            "text": "all the time. You know what I mean? Since 8th grade or whatever and we'd known each other longer than that. But like that's real, you know what I mean? There's that real connection there where you think of each other and you reach out to talk to each other and you connect when you can and do these different things. So yeah, I don't know. It's what are the parameters for friendship? Weird phone conversation text messages when you're both thinking of each other. Yeah. I mean I it's hard too cuz like I think for the most part we're so underwater that it's hard for us to even like deal with any interpersonal relationships cuz we're so busy most of the time dealing with the business aspect of it. But and that's **** it up a lot. You know what I mean? Because that's the whole thing is like I bet I don't reach out because I'm so busy and I bet people don't reach out to me because they know I'm so busy. Yeah. Or they're busy as well, right? And that is the phantom of",
            "start": 5101.76
        },
        {
            "text": "whole thing is like I bet I don't reach out because I'm so busy and I bet people don't reach out to me because they know I'm so busy. Yeah. Or they're busy as well, right? And that's the phantom of where we live as well. Like, and you guys talk about the people we left uh who are still working IGN, but I remember being that person when people would leave and I'd be like, I really this person meant something to me, but I'm just too **** busy to like with the rest of the **** that's happening with the other 30 people that are still here fighting the war with me that like I can't focus on this one person that's coming back into my world now because all of this is too much for me to deal with. Right. And I remember that cuz I remember when Dunham left. I remember when Hillary Clinton left. I remember when Doug Walker left. I remember when all these like Charles Martinet left and I was like oh Charles I was like **** I love hanging out with Charles or Clayman or Brigg and then all of a sudden I I like",
            "start": 5135.52
        },
        {
            "text": "remember when Doug left. I remember when all these like Charles left and I was like oh Charles I was like **** I love hanging out with Charles or Clayman or Brigg and then all of a sudden I I like I saw Brigg one time at E3 and I was like how long has it been since I've **** seen you man it had been like a year I'm like oh **** now and I we're never that hugely close but friendly toward each other. We partyed we drank a lot we did beta breakers like three years in a row together so there was a lot of trauma fire as well. Oh my god. To me I think it's I give people leeway. I give people the benefit of the doubt because I there are friends of mine that I've known since I was in the sixth or seventh grade that I don't see for years and all of a sudden they'll come back into my life and I'll be like that's right. We have a camaraderie. We have this special thing that is just it's hard to put your to put words to. Um but then there's also the idea of of of the loyalty aspect of",
            "start": 5168.88
        },
        {
            "text": "and I'll be like that's right. We have a camaraderie. We have this special thing that is just it's hard to put your finger on. Um but then there's also the idea of of of the loyalty aspect of friendship that I really appreciate and respect. And that's it kind of is that old saying where it's really easy to be a good friend when everything's going well. Yep. You know, when when when times are good and business is good and everything's good, but what I really admire about us specifically was that January and December of last year were really tough. Like that was the time that I had heart palpitations. Like my chest hurt. Granted, I was smoking a lot of cigarettes back then with Kevin because he's a little crazy. But um but that was really that was really and we had and we had we were you know it was hard but that's when I knew we were actually I was like I think we're actually pretty good friends because we got through that because we were there for each other because we",
            "start": 5206.8
        },
        {
            "text": "we were you know it was hard but that's when I knew we were actually I was like I think we're actually pretty good friends because we got through that because we were there for each other because we were we were loyal if not to the cause to the concept that we knew that this was important to all of us in our lives and step we knew it was too late. We already quit even if I didn't I didn't like you guys we're all highly employable and I'll be I'd be willing to bet highly employable. I'd be willing to bet if we were like, you know, if we for any reason had to go back to IGN, we could go back to IGN. And that's not it's not what it was. It was we all believed in each other and we wanted to be there for each other. And that that to me is like like my brother's one of my best friends because he's there for me no matter what, right? You know, he's always going to be. And I'd like to believe that I would be there there for you guys. I know Greg would be there for me just cuz that",
            "start": 5253.36
        },
        {
            "text": "because he's there for me no matter what, right? You know, he's always going to be. And I'd like to believe that I would be there there for you guys. I know Greg would be there for me just cuz that is Greg. Greg, I would be there for you as well, except we're not smoking anymore. So try stop trying to get me to smoke. Greg's the weirdest thing though to me. And I mean I I don't even know how to bring this up or explain it, but like I do not see Greg as a friend. I never have seen Greg as a friend. Like I see Greg as like it's such a weird like family thing that it's like but it's beyond family. Like it's it's more I see Greg to say he as a brother. It's like not even accurate enough. It's we're like just we are joined. I don't know. It's weird. I can't imagine my life without Greg being there for like 20 hours a day of it. You know, he's kind of like when you ever get like when you wear the same Yeah. or when you you wear the same pair of jeans like two or three days in a row and",
            "start": 5289.44
        },
        {
            "text": "being there for like 20 hours a day of it. You know, he's kind of like you ever get like when you wear the same Yeah. or when you you wear the same pair of jeans like two or three days in a row and you get one of those weird ingrown hairs on your ass. That's kind of like Kevin. He's there to remind you to change your jeans every once in a while. A necessity. I uh I met I met Kevin for about 10 minutes and right before we filmed this, he asked me for a cigarette in the hallway. I asked if you smoked because I saw a weird bulge. You're checking out the bulge. Is that a box in your pants? Uh you want to smoke? No. I I think I think to your point, Nick, I mean, you know, I don't know if the a maybe we'll tell the audience stories one day, like when we're older, but I don't think that they can appreciate how really difficult it was for us in the fall of 2004, to come to conclusions and I'll never ever ever forget the conversations we all had together about um should we",
            "start": 5327.68
        },
        {
            "text": "can appreciate how really difficult it was for us in the fall of 20014, to come to conclusions and I'll never ever ever forget the conversations we all had together about um should we stay or should we go? And um Greg had some pretty, you know, I'm not going to get into it, but some pretty stand-up moments for me specifically. Um and um there's that was the sign of friendship for me when some of the things Greg did for me in the fall. Um but it's it's uh you guys really are like my capital F friends, you know, after all that. And I've known you guys for a long time, especially Nick and and um but we went through something that a lot of people can't understand together. And it wasn't easy. It was really hard. It was the best decision we ever made, but we all had to convince each other over and over again that it was the best decision we ever made or that it was the right decision we were making. And then we realized very quickly it was the best decision we could have",
            "start": 5369.04
        },
        {
            "text": "each other over and over again that it was the best decision we ever made or that it was the right decision we were making. And then we realized very quickly it was the best decision we could have possibly made. Um but there's something to that. It's I guess experiential kind of stuff too is part of friendship as well. Um I met Ramon because we both love 311. That's why I met him. You know, I would have never met Ramon if we didn't have that same musical experience of I walked by his dorm room and he was playing 311 on the guitar. Oh man, that's how I met him, you know. So, it's like serendipitous. It's it's weird. There's weird stuff like that that sets precedents that then you're like, well, Ramon is like a brother to me and then isn't that weird that Ramon and Greg love each other? Isn't that strange? There's like something about all of us that's the same. some weird commonality, some weird theme that Ramon and Greg love each other. It's weird. Like they When I say",
            "start": 5419.28
        },
        {
            "text": "each other? Isn't that strange? There's like something about all of us that's the same. Some weird commonality, some weird theme that Greg and Ramon love each other. It's weird. Like they When I say Greg, I do the hand motion for myself. So it's like I like So isn't there isn't also a part isn't it also a part of a Venn diagram of the things that all mean the same things to each other. That's how family works. And I I mean because I don't want to speak for you Colin, but I have a special friend shout out and this is one is Clemens and you know what I mean? Like Clemens like I remember when he got laid off at IGN when that when that wave happened or whatever and I was devastated. and I couldn't stop crying and it was like you at the moment I mean we've been through a lot of layoffs just how companies work or whatever and that was the first time where it was ever like I'm devastated you know what I mean and that was the and part what you hit on earlier was the fact that like",
            "start": 5457.44
        },
        {
            "text": "know companies work or whatever and that was the first time where it was ever like I'm devastated you know what I mean and that was the and part what what you hit on earlier was the fact that like people leave all the time that we like you know what I mean and it's always like yeah we'll catch up and you know you'll see him at E3 or whatever you know what I mean and I didn't want that with him and I didn't know that at the time you know what I mean like I didn't realize him leaving would be that and then when he moved to Oakland it was all **** but like you know you know what I mean what happens when you move to the East Bay it's now that thing where like when I see Clemens and I'm with Clemens, we're right back to it. You know what I mean? It is a Poe kind of thing. It is a calling kind of thing. Yeah. I think that's like what I was saying about the growth Nicole kind of thing, you know? Like Nicole Tan thing. I have friends like my friends like my friend Winnie like she's been one of",
            "start": 5499.04
        },
        {
            "text": "of thing. Yeah. I think that's like what I was saying about the Gwen Stefani kind of thing, you know? Like Nicole Tan thing. I have friends like my friends like my friend Winnie like she's been one of my friends since I first met her in seventh grade and she can be gone for I don't see her. She's been she's so **** smart. So she's like going to all these fancy schools and **** all over the goddamn world. She's at Yale now. No big deal. And I'm like I cannot see her for years and I see her. It's like we're good. We're totally totally right there. And like going back to what you were saying, this is interesting because you know we're talking about like the acquaintancing and working together and convenience and all this stuff. It's like in the same way this is very similar to IGN where it's like I don't think necessarily we'd hang out with each other if it wasn't for Kinda Funny. And I think that Kinda Funny is like bringing us together. And it's like there is that question of would",
            "start": 5529.12
        },
        {
            "text": "like I don't think necessarily we'd hang out with each other if it wasn't for Kinda Funny. And I think that Kinda Funny is like bringing us together. And it's like there is that question of would we hang out outside of this if we weren't doing this together and whatever. And I'd hang out with Greg going back to my uh what I was talking about with the dinners and stuff for the first time ever. We went to dinner together recently and it's like that felt different, you know, like I definitely felt like I hit a level with you where it's like it's the culmination. I don't know the best way to explain this. There's nothing special about the people I go to dinner with at IGN compared to everyone else at IGN. They're all family. It's just those are the family members that went from here to have that one moment that's like now we're friends, you know? Yeah. And it's like it's little things like that that it's like now when I look in the future maybe it's like we get pulled apart",
            "start": 5561.12
        },
        {
            "text": "Here to have that one moment that's like now we're friends, you know? Yeah. And it's like it's little things like that that it's like now when I look in the future maybe it's like we get pulled apart there's an earthquake that like brings us apart and Francisco it's like you are one of those people that I'm like I want to catch up with Colin. Let's get dinner. Let's drink bourbon and do Colin stuff. I feel the same way and it's like that's cool. I I I feel like we really and this is recent. This is like spoiler alert like last week. But like I think we became friends and that's cool in my definition at least. No, I agree. I think that there is something about breaking bread or drinking with someone. And there it's symbolic. It's been eating with someone has been something for thousands of years since since cavemen were sitting around fire. Like it was about the people you trusted and and and it's a primal thing I think actually in in a weird way, you know. Sorry, I can't",
            "start": 5597.2
        },
        {
            "text": "of years since cavemen were sitting around the fire. Like it was about the people you trusted and it's a primal thing, I think actually in a weird way, you know. Sorry, I can't because comedy of air is over here. Drops as usual. He drops the pen then doesn't want to lean into the frame. So he pulls up his arm. Then he reaches his thing down. His shirt pulls up. So, we see his belly. He's just like, \"What is going on?\" As for uh for me, I know you guys are I kind of want to let you guys just all talk because Sorry. No, no, no, no. I mean, I did that on purpose. I want you guys to like You're pulling a column. Yeah. Just sit on the side for a little bit and then get my point across. No, I uh I definitely think that you guys all said very similar things to what I feel. I look at friendship as me as a person. Um I mean, I work customer service. I like to make sure I'm always friendly. I see regulars. I see people I used to go to elementary school. I'm in",
            "start": 5638.08
        },
        {
            "text": "I look at friendship as me as a person. Um, I mean, I work customer service. I like to make sure I'm always friendly. I see regulars. I see people I used to go to elementary school. I'm in a smaller town. It's not like San Francisco, but like every day I see someone like my first grade teacher or I'll see like my old ex-girlfriend or I'll see something and it's just like it doesn't matter. It's a it's a small community and it everyone is just happy and I look at that as that's a lot of acquaintances. It's not like friends. Um, but the way I describe the parameters of friendship are lifelong friends and I have like maybe three just forever just solidify that they can go wherever they go and the moment they come back it's like you said you snaps and you can just pick it back up and you want to know what they're doing. You know that like you said when you're in your worst spot they're there for you. And I think that it's all about trust and loyalty and honestly I just like to",
            "start": 5679.2
        },
        {
            "text": "you want to know what they're doing. You know that like you said when you're in your worst spot they're there for you. And I think that it's all about trust and loyalty and honestly I just like to laugh. If someone can make me laugh and have a good time, like you got to look at life in in the humorous ways and be kind. **** man. This world's **** way too dark in times. Be kind. Yeah. That's the And that goes back full circle to what I was saying in the beginning is that like the the extraordinary kindness showed to me by the people I care about. Yeah. During that particular time was reinforcing just like I was when we left, you know, it was important to me. It showed a a great deal of uh of caring and of loyalty, you know, that people, you know, I know I'm not the easiest person in the world to deal with, you know, you know, no, you're good. Like I I don't think I don't think I'm I don't think I'm as hard as as I make it out to be sometimes because I play up my character quite a",
            "start": 5728.88
        },
        {
            "text": "world to deal with, you know, you know, no, you're good. Like I I don't think I don't think I'm I don't think I'm as hard as as I make it out to be sometimes because I play up my character quite a bit. But um but I know that I have my quirks just like anyone does and like I get into my spaces just like anyone does and it takes this patient kind of person to be able to deal with anyone in those particular situations. So I appreciate it, you know. Mhm. So let me also thank you guys for that as well. Yeah. No, thank you Colin friendship. Tim, yes. What's your topic? So um my topic is playgrounds. Um which might sound like a weird topic and you know No, it makes sense cuz isn't it it's Nick that has to stay like 500 feet away from him at all times. Yes, that is why I'm bringing this up. Uh no. So, the reason I bring this up, for the reason I bring this up is recently on the internet, I came across like someone posted like, \"Oh, for anyone that grew up in SF, like you'll know",
            "start": 5773.12
        },
        {
            "text": "you. Uh no. So, the reason I bring this up is because recently on the internet, I came across someone who posted \"Oh, for anyone that grew up in SF, you'll know this type stuff.\" So, I clicked on it and I'm like, \"Oh my god, this is an old blog post about a children's playground in Golden Gate Park.\" Um, and that's where I grew up. Like, we grew up playing there. Kevin played there. We all... anyone that's from SF has memories of that, like whatever. So, I'm looking through this and I'm like, man, I remember this. I remember this. Every single thing resonated with me in 10,000 stories. Yeah. And the point of it was that it was a literal death trap. Oh, yeah. Like, this thing is insane. I can't believe they let children play on this. I can't believe my parents brought us here and thought this was an okay thing to do. Yeah. And the blog was about how it was crazy and then it was demolished. Now it's like",
            "start": 5815.52
        },
        {
            "text": "let children play on this. I can't believe my parents brought us here and thought this was an okay thing to do. Yeah. And the blog was about how it was crazy and then it was demolished. Now it's like it's it's safer. But all it is is just a new coat of paint on like it's just modern death traps. They put down the rubber and stuff like Yeah. So there's rubber. So it's like great now instead of getting sand over you're **** burning yourself on everything and all this **** But I just wanted to kind of appreciate and I don't know like I I sent Kevin a link of pictures so he might be putting pictures that that of what I'm talking about. If not he's kind of lazy. There's a link in the description at the very least. Make sure you do this of the um that I'm talking about. I want you to do it. So put the link in Kevin. It's so hard over there. This park, there's a lot of playgrounds. All of them have a lot of **** but this one had the all of the crazy dangerous **** in one thing. So",
            "start": 5861.76
        },
        {
            "text": "So put the link in Kevin. It's so hard over there. This park, there's a lot of playgrounds. All of them have a lot of stuff but this one had all of the crazy dangerous stuff in one thing. So, there was the classic very, very, very long cement slide. Cement slides are like slides made of cement. Yes. Yeah. Like really smooth, right? Well, it should be. It should be. Yeah, I know. Like very old '60s or 70s. So, it would be like this: so, it was two slides. It was like pretty much there was a hill and then they would put cement on the hill. It's more of a hill than a mountain, okay, on the hill and then there'd be stairs going up the sides and then there'd be two like it's like a drag race of slides essentially and it's it's uh it's just cement and what kids would do. And so this is a sand playground which is a key thing cuz like there's the sand playgrounds, there's the tanbark playgrounds, there's this like weird recycled rubber stuff",
            "start": 5897.36
        },
        {
            "text": "and what kids would do. And so this is a sand playground which is a key thing cuz like there's the sand playgrounds, there's the tan bark playgrounds, there's these like weird recycled rubber **** playgrounds. So this is a sand playground which means that there's like dead skunks and it's Golden Gate Park. There might be a bum buried around needles. Many bombs. There's needles everywhere. You're walking in a bum arm comes out and tries to stab you with a **** No, but I mean but needles like I remember growing up and needles were a real thing. Like it it was like the number one thing. You go to the playground, your mom's like, \"Hey, if you see a needle, let me know. Stay away from this area.\" And like I just grew up thinking that there was needles everywhere. And there was. Like we maybe one out of every four times like we'd find a **** needle. And it's like that's insane. I had to look out for mountain lions in the sand. We didn't have that. There were skunks. There's a lot of",
            "start": 5941.44
        },
        {
            "text": "one out of every four times like we'd find a **needle**. And it's like that's insane. I had to look out for mountain lions in the sand. We didn't have that. There were skunks. There's a lot of vicious skunks. Um they come out of the sand. Dune. They're just like there's these slides right now. Cement slides on their own. That's pretty dangerous. Like you can crack your **head** open. I'm going to Google cement slides. I don't know. Like highly polished. Can you Google this? So, so this is this is where things got real, right? Is there'd be a bunch of cardboard at the bottom of the slide where the kids would take a little bit of sand, bring it up, and you you get up the stairs, everyone's in this like line, you bring it up like hope you don't lose your **sand** or whatever. Get to the top, put the sand on the top of the slide. It's literally exactly a little bit of co push push the sand down so the sand would kind of just this, right? I mean, just Yeah. Yeah. Yeah. But",
            "start": 5980.64
        },
        {
            "text": "Get to the top, put the sand on the top of the slide. It's literally exactly a little bit of co push push the sand down so the sand would kind of just this, right? I mean, just Yeah. Yeah. Yeah. But it was much longer than this slide was made. Is it this one? Okay, thanks. Yeah, it's like that. So, anyways, anyways, it's uh um then then the sand would kind of like coat the whole thing to get it that nice like so you just shuffle like a shuffle board table. Exact. Exactly. And that it was human shuffle board and you would race the person next to you and the person there'd be someone behind you that would push you down. So, these kids are just flying down this thing until they hit the bottom and then they face plant and skid like face first in the sand, you know? And it's like, all right, so that is the most dangerous thing in the world. How do we make it more dangerous? Oh, it's the '90s, so everyone has rollerblades and skateboards. So, let's rollerblade and skateboard. That's it.",
            "start": 6022.8
        },
        {
            "text": "right, so that is the most dangerous thing in the world. How do we make it more dangerous? Oh, it's the '90s, so everyone has rollerblades and skateboards. So, let's rollerblade and skateboard. That's it. That's it. Yeah. I did some googling here for Golden Gate Park. Watch out. There's a microphone there. Nick. Nick. Nick, don't go to its level. Nick, be the bigger man. Why are these kids tiny? There's like toddlers doing this. That's life, right? Like that's why are these kids tiny? I'm going right going right to Twitter with that with no context. You just expect they're big, beautiful kids and you see some tiny kids. No, but I imagine like they would like when you were playing on this thing, I just always imagine you were like 12. Oh, no. These kids look like they're four and their parents are like this is fine. Yep. But that's totally fine. That's what I'm saying. So then in addition to that, there was a giant uh monster truck tire where it was just the tire and then you can get in the tire",
            "start": 6065.68
        },
        {
            "text": "this is fine. Yep. But that's totally fine. That's what I'm saying. So then in addition to that, there was a giant uh monster truck tire where it was just the tire and then you can get in the tire and just chill. And if the kids were resourceful enough, you can get a couple kids in there, start rocking it back and forth and move the tire from its place where it was supposed to be until it tipped over and probably killed somebody. Wait, are these pictures correct? Is what we're looking at here? Because this looks like Burning Man. This looks like the most dangerous. It looks like a little bit like Thunderdome. I'm just This is Golden Gate Park. Uh, search for playground. Yeah, children's playground is what it's called. There is a link. for the people at home, you can you can click and you can follow along with this. So, in addition to that, there there was the big the big uh uh big wheel thing. Then there was literally just a ramp. So, it was just just a ramp surrounded by sand",
            "start": 6102.48
        },
        {
            "text": "can follow along with this. So, in addition to that, there was the big Big Wheel thing. Then there was literally just a ramp. So, it was just a ramp surrounded by sand and that's it. You showed me a picture of this and it looks like The Simpsons' escalator that goes to nowhere. Yeah. And it's like, what does it expect the kids to do on this? Like it's literally just a launch pad for them to run and just jump off, break their knees off. It's like there's no other purpose for it than that. Then there were just the classic stumps of logs that just go up at different lengths. Oh, you mean The Christian Bale Batman Begins logs where you have to stand on and people punch you in the stomach and you do push-ups? So it's that except there'd be like a bunch of them and it's like what? So the kids are supposed to walk across them and if they slip and fall, oops, you lost the game. So there's that. Then of course there's the metal",
            "start": 6144.88
        },
        {
            "text": "there'd be like a bunch of them and it's like what? So the kids are supposed to walk across them and if they slip and fall, oops, you lost the game. So there's that. Then of course there's the metal merry-go-round, but not the merry-go-round with the stuffed animals and stuff. It's the one where the kids can spin as fast as you can until someone dies. There's a common theme here and it's death. All right. Then there like there's two more things, two more main attractions to this park that I'll just never understand. One is what can only be described as what like the remains of a Twisted Metal fight level or even just like a level in Twisted Metal Black. Like it's an entire play structure that's made of metal bars. So, it's just a bunch of metal bars that look like kind of like this if they just kind of just extended everywhere and it was just like there's color, you know, the like not the igloo. You're not talking about the igloo, are you? Like the the se the",
            "start": 6191.28
        },
        {
            "text": "kind of like this if they just kind of just extended everywhere and it was just like there's color, you know, the like not the igloo. You're not talking about the igloo, are you? Like the the se the hemisphere circle that's all made of metal. See, that's a modern modern thing. What the **** is that? Triforces. So, it's a bunch of triforces essentially. And um it it was made with like um there's a whole bunch of um zip lines where you can like grab a metal thing and zip from one area to the next. And it's like there's so much danger here. Like none of this made any sense. Oh yeah. And so it's all these damn bars. It's kind of similar to the when you go to like the jungle or uh Chuck E. Cheese or McDonald's like the little place, but instead of it being tubes with floors, it's just sticks that you need to like kind of go and if you fall, you're dead. You're **** dead. Now, how can we make it more dangerous? The fact that there's homeless people that just sleep in them. Like that's",
            "start": 6238.56
        },
        {
            "text": "that you need to like kind of go and if you fall, you're dead. You're **dead**. Now, how can we make it more dangerous? The fact that there's homeless people that just sleep in them. Like that's just what they do. And they don't ever clean these and it's **metal**, so it rains and stuff. Rust everywhere. For the record, I don't think the homeless people sleeping in them are part of the design of the playground. That kind of just happens. The designers, or game designers, place three homeless people in it at all times. So there's all this stuff and it's just like I I remember even being little and thinking it was the coolest thing in the world, but also being frightened. I was like, \"This is scary.\" Cuz there'd be the big kids and the big kids were, you know, I'm an 8-year-old and the 12-year-old who might as well have been 30 is running around and I'm like, \"Fuck, that guy's scared. He's zipping on this goddamn thing.\" And then there's the like the",
            "start": 6282.96
        },
        {
            "text": "know, I'm an 8-year-old and the 12-year-old who might as well have been 30 is running around and I'm like, \"Fuck, that guy's scared. He's zipping on this goddamn thing.\" And then there's the like the monkey bars, but the monkey bars that are circle rings that move cuz it's like it's like the advanced level show on G4. What's it called? The uh it's American Ninja Warrior but also Legends of the Hidden Temple. It's like freaking advanced version. We're like holy **** But then there's one last thing that please guys look at this link so you can see this cuz I couldn't make this up if I **** tried. It's like how could you make the merry-go-round where if you run around it any more dangerous than it already is? How about you turn it on its side and instead of it going in circles, it's going in like like a mouse wheel. Like a freaking No, it's not even just a mouse wheel. Like a boat. It like one of the boats. One of those boat ride thing. So what's everyone try to do? Let's **** flip it.",
            "start": 6321.52
        },
        {
            "text": "like a mouse wheel. Like a freaking No, it's not even just a mouse wheel. Like a boat. It like one of the boats. One of those boat rides thing. So what's everyone try to do? Let's flip it. Let's go all the way around and like I can't believe that until they demolish this place, they didn't get rid of Can we get a death toll of kids that died? I can't even imagine. There's a gift there which is really great. So, it's like these kids would get on two sides and then all of a sudden it's like, well, if we can fit two kids, maybe we can fit four kids. Maybe we can fit six kids. And then it became, how many people can use all their force to freaking make this thing go? And then eventually, like, no joke, this is the one thing I joked about a lot of people dying. No one died that I know of. I'm sure someone did, but homeless guy. This was the thing where every single time I went, someone got injured, bad, got wrecked, mangled is the best way to put it. Like they'd fly off this",
            "start": 6359.52
        },
        {
            "text": "I'm sure someone did, but homeless guy. This was the thing where every single time I went, someone got injured, bad, got wrecked, mangled is the best way to put it. Like they'd **** fly off this **** thing into another one of the structures. Like, oh my god, it was a disaster. And now, RIP, cuz it's gone. I'll never be able to see it again. But what are your guys' like childhood playgrounds? When I think you say childhood playground, I immediately jump to Spalding School in unincorporated Glen Ellen, which is where I grew up. Spalding school was like an abandoned school that was in the area that had fields in the back and a playground in the front, and that's where like you'd go sometimes to play, you know what I mean? It was it was like Spalding School was active when like my my my parents were kids, right? I think my dad might have gone there for a couple years, but like this eventually just gets abandoned, has this shitty ass playground out in front and yeah, it was monkey bars over",
            "start": 6401.2
        },
        {
            "text": "were kids, right? I think my dad might have gone there for a couple years, but like this eventually just gets abandoned, has this shitty ass playground out in front and yeah, it's monkey bars over concrete. Like yeah, that's a great idea. Why not? You know what I mean? Like there I I it didn't have it, but I some other playground I remember had the metal half sphere where you crawl out to the top and then if you fall your your leg gets caught and like you break your knee and you're like hanging there in like turmoil. It had when you were talking about the concrete slide. Spalding had the metal slide where you're like, \"Let's go play at the park and the sun has been baking this in the Chicago heat.\" You go like screaming as you go down if you have anything to go down it. You know what I mean? It's like Jesus. The metal is always the worst, too, because you're like, if I'm not sweating, this thing's going to burn me like not not burn like heat, but it's going to get that that",
            "start": 6443.52
        },
        {
            "text": "what I mean? It's like Jesus. The metal is always the worst, too, because you're like, if I'm not sweating, this thing's going to burn me like not not burn like heat, but it's going to get that that nice rub. Stop for a second. Like so. Worse on that is the so eventually this playground had it too but a lot of the other playgrounds had the the mid-90s this is when the rubber and tan bark started coming in but it was those like plastic uh structures like all the structures were plastic so you you if it was hot you get the burn if it rained it was all wet and disgusting um you always got burned no matter what the worst thing was the freaking static that would build up so anything you touch is just shocking you and it's like so it's like the kids would play the ground is lava but you wouldn't even need to cuz it was just everything else is electricity surface sucks. The best best part of that though is because we all had thinking about playgrounds just they were were",
            "start": 6480.48
        },
        {
            "text": "but you wouldn't even need to cuz it was just everything else is electricity surface sucks. The best best part of that though is the because we all had thinking about playgrounds just they were were dangerous like we were the last maybe the last generation I really before the what I'll call the pussification of the United States. Uh where seriously where like parents were just like go play and uh is itation or maybe like smartening up that we're like ruining these children. He's right. I remember I remember distinctly the first time I stepped foot on like a new playground where that cushy it has the cushy bounce to it and I was like what kind of lame ass kid would play on this lame stuff like we had sand or wood chips or concrete. That was it. Wood chips were a part of No, the wood chips were Yeah, but the wood chips were had their own issues where if you caught a wood chip the wrong way, you're picking that crap thing out of your ass. Bamboo shoots up your finger. It's not",
            "start": 6521.2
        },
        {
            "text": "chips were Yeah, but the wood chips were had their own issues where if you caught a wood chip the wrong way, you're picking that **** thing out of your ass. Bamboo shoots up your finger. It's not even I'm not even trying to be political. It's just it is true. Like our parents used to like my parents cared about me. Your parents cared about you, but they were just like go do whatever. **** off and do whatever you want. I used to just go like when I was at my grandma's I' I'd go, you know, in Albertson, Long Island, I would go to this huge elementary school and there was an awesome playground. And I used to play hockey sometimes with these like way older pe like people like I was like maybe like 10 years old and they were 37. They were probably they were definitely like was they were definitely like they were definitely like out of high school and like I used to just like play around with them cuz I could I could play. I mean not as well as they could but I played hockey and they",
            "start": 6563.68
        },
        {
            "text": "definitely like they were definitely like out of high school and like I used to just like play around with them cuz I could I could play. I mean not as well as they could but I played hockey and they recognized that we used to shoot around and uh this was during the days I mean it I'm getting old now. This is during the days of before plastic Gatorade bottles. So this was glass remember glass bottles I don't know. And uh and we line them up like after like we were done and we would shoot pucks at them or whatever and then we would like you know they would sweep them up and you know get rid of them. Um and uh they would sweep them up and get rid of them. They would they would because it was like a you know it was that I do remember they weren't like being hooligans. It was a very nice school. Um and we were probably kicked out of there or whatever. But I remember I was shooting once. It was Mother's Day 1992 maybe. And uh and I shot a puck at one of these glass Gatorade bottles.",
            "start": 6599.36
        },
        {
            "text": "Um and we were probably kicked out of there or whatever. But I remember I was shooting once. It was Mother's Day 1992 maybe. And uh and I shot a puck at one of these glass Gatorade bottles. It exploded. Glass cut me. Like I was far away from it too. I took it was like a wrist shot. I was probably like 15 feet away from it. like this shard of glass just like cut me like right along my eyebrow. You can't even see it anymore. I had like all these stitches like walking around like big boss. Yeah. And I remember I remember walking home and this is emblematic of it. I remember walking back to my grandma's with like my hand over that thing with this blood pouring down me and like what the hell happened to you? And I'm like uh I got like you know an exploded Gatorade bottle in my face and they're like all right let's go to the ER. Was it like this whole like like this like freakout kind of thing? There's no there was no social justice campaign on Twitter to end glass. No, they didn't like try",
            "start": 6635.2
        },
        {
            "text": "like all right let's go to the ER. Was it like this whole like like this like freakout kind of thing? There's no there was no social justice campaign on Twitter to end glass. No, they didn't like try to they didn't like try to sue the kids or try to sue the school or something. It was just like that was that was me being a kid and then and therefore me paying the price for doing stupid things. Loa and it was my fault. And lo and behold, never did that again. No glass uh Gatorade bottles anymore. Um this was the story. This is what broke it. Yeah. So yeah, I remember I remember I I I remember I remember that really well. like it it was there was something special about being a kid on that verge before things changed because they're different now and and we weren't we grew up in the late '80s like and early 90s and it wasn't like that you know really wasn't my parents were like oh you want to go swim you know we had we had an inground pool but all all my friends did",
            "start": 6673.92
        },
        {
            "text": "the late '80s like and early 90s and it wasn't like that you know really wasn't my parents were like oh you want to go swim you know we had we had an inground pool but all all my friends did in our neighborhood and so I was like oh I'm going to go to Tim's to to swim and they're like all right is is uh are their mom and dad home yeah all right that was it like no one no one was calling anyone to be like are are these these eight-year-old drowning in your 8 foot deep pool. Yeah, that's that's the difference now, right? Is that everyone has cell every kid has a cell phone and so like when you were a kid, all you needed to do was convince your parents to let you go somewhere and then all you needed was the time you had to be back and you **** off. There was no they would never know like I'm going to the mall with Stu. That's it. I could leave the mall and go to a crack den for all they **** knew and they would never know. Right. It's awesome cuz they can't they can't",
            "start": 6711.2
        },
        {
            "text": "know like I'm going to the mall with Stew. That's it. I could leave the mall and go to a crack den for all they **** knew and they would never know. Right. It's awesome cuz they can't they can't track you online track your ass. They don't know where they don't know where you are. And now everyone's got locators on them in their pockets, your parents can load the app and like he's he's at the mall. Well, I mean it's worse than that even. It's like even if they don't have the locators, like the fact that they know that they have a phone on them, they know that they can contact them, which means that if they call them and they don't answer, that they're dead. No, there's no in between. They're dead or they're answering the phone. You're so right though, man. It's so nostalgic when you think about it. Like my my my like my I'm going out to play in a summer night, 96, whatever it is, and it's like be home by be home. Yeah. Or or be home by dark. Yeah. And then I get home and it's like",
            "start": 6748.4
        },
        {
            "text": "about it. Like my my my like my I'm going out to play in a summer night, 96, whatever it is, and it's like be home by be home. Yeah. Or or be home by dark. Yeah. And then I get home and it's like kind of dark out and they're like, \"I told you to be home by dark.\" I'm like, \"It's still dusk out. Should have given me a should have given me a more legitimate time, you know?\" And they're like, \"Well, all right.\" You know, go **** off again now that you're here. What's the next thing you're going to go do? What you dumb Matty Kerr? What were playgrounds like in Montana? I imagine. Yeah. What is your guys's idea of Montana? Flat. I've been there, so I'm not going to say. Flat. It's beautiful. I imagine everyone's amazing, man. Rides horses. It's very natural. We just got DSL uh two weeks ago. That's cool. Wait, wait, what? No, that's a lie. Oh my broke me for a second. Montana's gorgeous. Big sky country. Absolutely, man. Well done. Yeah, it's a beautiful No, I Lewis and Clark",
            "start": 6779.2
        },
        {
            "text": "weeks ago. That's cool. Wait, wait, what? No, that's a lie. Oh my god, Montana's gorgeous. Big sky country. Absolutely, man. Well done. Yeah, it's a beautiful place. No, I immediately think of Lewis and Clark Elementary is what pops into my head immediately. And I remember playing like I don't know if you guys called it chicken fights, but we had monkey bars. Yeah, you hang off the monkey bars each other. And I remember doing that from like 8 feet, 10 feet and falling right onto my back and just getting the wind knocked out of me. Well, I mean that's the thing is cuz like when you do that and you wrap your foot around, whoever falls falls either on their back or their neck. I don't want to get hurt or they're taking you with them and you're falling on top of them. Yeah. The one of the worst things I ever did in my entire life cuz I'm a huge idiot was I was hanging upside down on the monkey bars like kids do and I had this awesome vision in my head that I'm going to release my legs. I'm going to",
            "start": 6820.24
        },
        {
            "text": "did in my entire life cuz I'm a **** idiot was I was hanging upside down on the monkey bars like kids do and I had this awesome vision in my head that I'm going to release my legs. I'm going to do a back flip and land on my feet cuz I'm a **** cool ass dude. That's not how that **** went down. I released and went straight down onto my head and I can't believe I'm not dead. Yep. It works that way. My dad had to pick up my like mangled body and like take me home. Um Yeah. And then I also I mean there are so many memories of just like random playing and I don't know, man. I I also do remember having weirdly specific conversations on playgrounds. like we had this curly slide and I remember hanging out with a kid uh his name was Alex King and I remember sitting in yeah I haven't talked to that kid forever but sitting in this little hut and asking him about God and being like what is this God thing and just like no we're 8 years old and like we were just curious kids and we like come",
            "start": 6863.6
        },
        {
            "text": "that kid forever but sitting in this little hut and asking him about God and being like what is this God thing and just like no we're 8 years old and like we were just curious kids and we like come to like some little conclusion or realization of what we thought and then we'd go down the slide and then we come back up and think about something else and I don't know I just think there's like this pure innocence And like it is just it's all nostalgia. It's all like happy feelings whether or not you're breaking your rib or you're cracking your head trying to hang out. We had this there was this little structure that was sort of like a heart. And if you were laying in there with a girl that's that's your wife. That's your that's your girlfriend. You guys are dating. And I remember always trying to get someone. Not letting the guys see I want a girl in there but then trying to get someone in. You want to be that guy that just girls were drawn to you. I tried. I tried. It's not my thing",
            "start": 6906.0
        },
        {
            "text": "to get someone. Not letting the guys see I want a girl in there but then trying to get someone in. You want to be that guy that just girls were drawn to you. I tried. I tried. It's not my thing, dude. They just Oh, I'm just here, man. This is my spot. My god. I love all this just makes me I just realized how bad of a human being I was. Like playgrounds bring out the best and worst in you. Oh, definitely the worst. As you get older, it just becomes worse. Like because when you're a kid, it's like, \"Oh, we're just playing. Yeah, we'll do chicken fights or whatever.\" But once you you became nine, maybe I would say, you just become this evil **** Satan spawn. And once you learn about water balloons, that means anyone that's younger than you on the monkey bars, they're getting hit. And then you start to **** create wars with like the rival gangs that have playgrounds. This is my **** playground. What the hell are you doing here? Worst thing I ever did was uh you know, we had a water",
            "start": 6946.72
        },
        {
            "text": "you start to create wars with like the rival gangs that have playgrounds. This is my playground. What the hell are you doing here? Worst thing I ever did was uh you know, we had a water fight. People were bringing water balloons. So there was the Eminem Minis when those came out. Do you guys remember this? Familiar with M&M Minis, little tubes, hog tubes. We'd fill the tubes with water and pepper. We're using like grenades. People homemade pepper spray. We like we love blinding those little kids. Open the tops of put it on their face. What's with you? That's not our in any of our experiences. Colin had a lovely hockey game. Greg and I were too chubby to monkey bars because I I remember in in you know I went to private school uh until college but the one school I went to St. Peter's. Shout out to Glen Ellyn, Illinois. Uh kindergarten through 8th grade, right? And so I remember getting like there was that weird not by by the time you're",
            "start": 6981.44
        },
        {
            "text": "school I went to St. Peter St. Peter's. Shout out to Glen Ellyn, Illinois. Uh kindergarten through 8th grade, right? And so I remember getting like there was that weird not not by by the time you're in eighth grade, junior high, you're you're aging, you're ready for but that nine-year-old thing where cuz like it was the the the you had recess or whatever, right? Or whatever. But it was just it was prison. You were released into the yard cuz we didn't have a basketball hoop for the longest time. So you just went out into this parking lot and put your hands in your pockets and you're trading Terminator 2 cards and **** But like I people are just running. Sometimes you're playing football and it's not tackle and then it becomes tackle and you're in your uniform, your school uniform is beating the **** out of each other and then it was only good when it was snow days cuz they would plow there when it had snowed because they plow all the snow into the back corner and then you could go play",
            "start": 7027.2
        },
        {
            "text": "**** out of each other and then it was only good when it was snow days cuz they would plow there when it had snowed because they plow all the snow into the back corner and then you could go play King of the Mountain on there or whatever where you're just beating the **** out of whoever's at the top of the mountain. And then not to mention that on the other side of the mountain it was the parking lot was raised so it was already four or five feet up maybe even more and then you were on top of a mountain. So if you ever tumbled off the other way you were **** and it was over. But I remember when you like playing fights out there or something and like I remember distinctly getting into a a fight, but it was it was like something popped off and I don't want to say it was like a bunch of us fighting one guy, but I definitely remember it was it was like we were ganging up on somebody. He was a dick if I remember correctly, but I distinctly remember taking my hand and grabbing his",
            "start": 7062.88
        },
        {
            "text": "of us fighting one guy, but I definitely remember it was we were ganging up on somebody. He was a dick if I remember correctly, but I distinctly remember taking my hand and grabbing his cheek. It's like I had this kid by the cheek cuz like everybody else people were throwing punches and that's all I could get. Like what was I doing? I was like I had to murder this guy. And when I got caught in first grade, here's one for you. Jot it all down. Put a time code here for them. In first grade, I had a teacher named Miss Yon. And she gave out IUS when you did something good in class, right? Or you got answers, right? Or whatever the **** it was. And then you got to trade in the IUS and get stuff, you know, like they they had some crosses, they had bubble gum, you know, they had things you traded them in for, right? I I'm sorry. Tim just made the uh **** to the camera. He made that **** You didn't need to reference it, Nick. They either saw",
            "start": 7096.88
        },
        {
            "text": "you know, they had things you traded them in for, right? I I'm sorry. Tim just made the uh face to the camera. He made that face You didn't need to reference it, Nick. They either saw Why did you do the face thing for the IU's? Yeah. Yeah. Okay. Miss Lao wanted you to know that was inappropriate after your story. Anyways, uh thank you. Thank you for keeping him honest. They were great. Uh, so I, believe it or not, didn't get many IU's. Wasn't doing well in class. Was very funny. He was trying to be a class clown kind of guy or whatever. And there was this kid, Steve Urkel, who got a whole bunch of IU's. He was he was super smart, nerdy guy or just smart, whatever. But he was, you know, you're kids, you know, I was fat and stupid. He was nerdy. Um, but not the comic booky way in the the nerdy school way. He likes school. Urkel. Not to that level. Uh, and I Steve Urkel. And I haven't said I haven't said Gary Morris's name in forever. I wonder what if he he probably turned out to be",
            "start": 7141.6
        },
        {
            "text": "the nerdy school way. He likes school. Urkel. Not to that level. Uh, and I Steve Urkel. And I haven't said I haven't said Gary Marshall's name in forever. I wonder what if he he probably turned out to be a president. Anyways, he had a stack of IU's. Was definitely not president. He had a stack of IU's once and he was leaning over his desk and I came by and stole them all. Stole them all. Not even just one. It gets better. It gets better about this. Steal this entire stack of IU's. Horrible and dumb or whatever, but whatever. I do that to begin with. And then later that day, I'm bragging about how many IU's I have. And Gary, of course, being smart, me being dumb, saw that I had like he had put like designs on his IU's like with crayons and stuff. He's like, \"Those are clearly mine.\" Reports me a t-shirt and I'm I'm it's up. He's like, \"I'm like the jig is up and they're going to like call my parents.\" So, at recess, I flipped myself over the bike rack to hurt myself to send",
            "start": 7182.0
        },
        {
            "text": "Reports me a t-shirt and I'm I'm it's up. He's like, \"I'm like the jig is up and they're going to like call my parents.\" So, at recess, I flip myself over the bike rack to hurt myself to send myself home. Still got caught. Still got caught. Um, but yeah, that was my big plan. I was like I was like, \"How can I do this to get out of here? I need to get out, leave the scene of the crime here.\" And that was what I came up with is that I would sit on top of the thing and then fall backwards. And I did. And it didn't hurt bad. And you acted like it hurt. Just I just want you to just take a step back there, Greg, and just get some perspective on the two major points of those stories. One, you purposely hurt yourself to get out of being persecuted for stealing someone's IUs. Yeah. And even more important, your uh your defense and or offensive uh means of fighting someone was to grab them by the cheek. Again, he was wrapped up with somebody else. What",
            "start": 7228.08
        },
        {
            "text": "someone's IUs. Yeah. And even more important, your uh your defense and or offensive uh uh means of fighting someone was to grab them by the cheek. Again, he was wrapped up with somebody else. What did that look like in your brain before you did it? I don't think there was any. No, there was no like plan to get caught up by the rage. That's what I had. I had a shot at and I was like, I'm going to grab him by the cheek, pinch him like his grandma, and then let him go. Yeah, exactly. I got this. I That's what I would love to go back to that moment and just How long did I hold on to that kid's cheek? How long? With all my fingertips on the cheek. Did he look at me? That kid's at the bottom. That kid's at the bottom. I imagine this kid's at the bottom of a dog pile. Exactly. And he's getting his **** ass handed to him. And to add insult to injury, this little **** white doughy **** comes over to him and grabs him in the cheek for must have been a couple seconds and then just let go.",
            "start": 7274.16
        },
        {
            "text": "I've supported my friend in this. I'm going to go throw myself over a bike rack. All right, guys. I got I got to get out of here. I hurt myself with this bike rag. You are Oh, we're the stories we'll tell. Thanks, man. I can't wait. It's all just perfect. I can't wait. That's a good topic, Tim. Thank you. I didn't believe in it at first. Oh, I believed in it. There's way more where that comes from. Do you want to keep going? No. I'll save it for now. It's a long show. I know. M I want to have a topic about water fights at some point cuz that's a whole I do have good I do have good stories. Somebody keep somebody put that on there thing. Uh, that topic was brought to you by a new sponsor. Kind of ding ding ding ding ding. Now you can",
            "start": 7320.08
        },
        {
            "text": "that's a whole I do have good I do have good stories. Somebody keep somebody put that on there thing. Uh, that topic was brought to you by a new sponsor. Kind of ding ding ding ding ding. Now you can showcase your geek chic style with Level Up, a monthly mystery apparel subscription from Loot Crate. You can get two different pairs of high-quality socks, one to two fashionable accessories, or a wearable item like a long sleeve shirt or lounge pants. Same things as Loot Crate every month, and it serves as a great companion to your loot because there are no repeats. Each month's theme is inspired by all your favorite pop culture brands like Star Wars, Doctor Who, and Fallout 4, and often contains high-quality exclusives. Go to lootcrate.com/funny to learn more. Use the code funny to save 10%. This month's theme is galaxy with Star Wars items perfect for Jedi, Padawans, Rebels, and serious Star Wars fans. I'm going to add in big time Watt fans as well. Maybe you'll get some Watt",
            "start": 7358.16
        },
        {
            "text": "10%. This month's theme is galaxy with Star Wars items perfect for Jedi, Padawans, Rebels, and serious Star Wars fans. I'm going to add in big time Watt fans as well. Maybe you'll get some Watt socks. I would love some. They say this actually sounds cool. I'm into this cuz I like socks. A couple months ago, Luke had the Pokémon socks. Yeah, big fan of those. Good. Nick thinks they're my Spongebob socks, but they're not. You got a lot of Pokémon paraphernalia, and I respect that. Yep. You got that hat yesterday. I did that, by the way. The Grim Hat. Yeah, he got that hat. Yeah, he also has that. I think he invented it. The Dalek hat. Yeah, good call. That's a good one. I went to Chinatown and there's a lot of Pikachu there, ladies and gentlemen. Matty Kerr, thank you for all your support on patreon.com for coming here. You're great. You You were great. You fit right in. Did you have fun? Was it worth it? Oh, man. No. Yeah. No, it absolutely was. Absolutely. Thank you.",
            "start": 7398.48
        },
        {
            "text": "your support on patreon.com for coming here. You're great. You were great. You fit right in. Did you have fun? Was it worth it? Oh, man. No. Yeah. No, it absolutely was. Absolutely. Thank you. Ladies and gentlemen, if you didn't know, this has been the Game Over Greggy Show. Each and every week, four, sometimes five best friends gather on this table. Each bring a random topic discussion for your amusement. If you like that, head over to patreon.com/kindafunny. Toss us a few bucks and you get each and every episode early. If you don't like that, don't worry. We don't need your money. Go to youtube.com/gameovergreggy where we break it out topic by topic day by day before posting the entire show as a big MP3 and video for your amusement. Gentlemen, it's been awesome. Thank you. That was my favorite line of all time, by the way. He went to Chinatown. There's a lot of Pikachu there. I'm glad you like that. It's been okay. Until next time, it's been our pleasure to serve you.",
            "start": 7447.2
        }
    ]
}