{
    "id": 1661,
    "video_id": "hNsJfjhlu3c",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Steve Gaynor (Special Guest) - Kinda Funny Gamescast Ep. 64 (Pt. 4)",
    "description": "At GDC 2016 we had a chance to chat with the one and only Steve Gaynor!\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1459947602,
    "duration": 1696,
    "transcript_chunks": [
        {
            "text": "oh high oh **** I talked over you oh high it's okay you can do that there's no **** rules Greg we don't even we're making this up as we go topic four but it's on the topic Four's days is usually on topic three days because this is a super sized episode of Gamescast this is a weird weird world that we're living in Steve Gaynor is back he was on the Gamescast a couple weeks ago but now you have new questions for him except you don't cuz you weren't on this one I wasn't maybe you were no I think I was I'm pretty sure I was on this one you know what in fact you were cuz I think Nick tapped out at the last second right that's what it was terrified he saw Steve come in he got all scared of him Steve Gaynor of course ladies and gentlemen founder of Fullbright made Gone Home now working on Tacoma we give him a lot of **** in this interview for two reasons number one he delayed Tacoma that I'm not upset about number two he didn't put a platinum trophy in Gone Home so right now well I'm",
            "start": 0.31
        },
        {
            "text": "we give him a lot of **** in this interview for two reasons number one he delayed Tacoma that I'm not upset about number two he didn't put a platinum trophy in Gone Home so right now well I'm going to finish a sentence or two then you're going to hit pause on this and you're going to tweet at Steve Gaynor I love you Steve Gaynor and he's at Fullbright I love you at Fullbright on Twitter even though you didn't put a platinum in Gone Home don't make this a thing it's too late once it's said it's a thing I love you at Fullbright even though you didn't put a platinum in Gone Home period xoxo Gossip Girl (parenthesis) Greg at GameOverGreggy period I mean Greg Miller and I'm sure he's trying to be a gamer 2015 trending gamer 2015 South by Southwest most entertaining online personality of 2016 toys to life ambassador of the year 2016 you might want to just write all this on your phone in notepad screen cap that and tweet that at Fullbright leave a couple leave a couple blanks like",
            "start": 46.0
        },
        {
            "text": "of 2016 Toys to Life Ambassador of the Year 2016 you might want to just write all this on your phone in Notepad, screen cap that and tweet that at Fullbright. Leave a couple leave a couple blanks like underline spaces cuz we know Greg's going to keep winning more **** that's true I'm going to keep winning more awards can Kevin thanks no more 911s minorities are good that's my presidential thing if you don't watch I guess if you don't watch Conor Greg live out of context that seems kind of weird to be fair I left out the part where even in context it is weird I left out the part about burning people alive don't do that I thought we were done with that in the interview Steve Gaynor what's up everybody it's me Greg Miller That's Nick that's Steve Gaynor from Fullbright we are here on YouTube.com/KindaFunnyGames to talk to Steve and see what's happening see I was pretty that was two Greg Millers in the room for a second but before we do that we're going to start with Lightning Reaction game of the",
            "start": 90.96
        },
        {
            "text": "of fun games to talk to Steve Gaynor and see what's happening, see I was pretty sure that was two Greg Millers in the room for a second, but before we do that, we're going to start with Lightning Reaction game of the year. Are you familiar with Lightning Reaction? Game? I feel like I'm about to enter hell. You're ready to play. I don't want to play this again. I know you don't want to, but that's not how that's not how Lightning Reaction works. All right, so you, I'm going to hit the button. I'm pretty sure this is going to lead to a life. I'm going to hit the button; it's going to turn red and play a creepy song. Yeah, when the song stops, it'll turn green. You want to buzz in on your thing and be the first person to buzz in if you are not the first person to buzz in, you will be penalized. If you buzz in early, you are penalized. Okay, so wait, that's like this thing turns green. Yeah, you'll see it. Okay, Greg always wins; not always, most of the time. Damn it, I",
            "start": 138.16
        },
        {
            "text": "you will be penalized if you buzz in early you are penalized okay penalized so wait that's like this thing turns green yeah you'll see it okay Greg always wins not always most of the time damn it I hate this game I **** hate it God **** damn it I lost that you got in my head saying I always win nice try GRE thank you I will say the batteries on this are going because that shock wasn't nearly as bad as the first time they did where my entire arm went numb for about a half an hour holy **** do we have more batteries Kev Kevin's on it don't worry well I shouldn't have said anything you shouldn't have you screwed that one wait did both of you guys get shocked yeah oh everyone who doesn't win gets shocked there can only ever be one winner there you go fix that guy up for me please since when then it'll just one on one V one Nick see he can get F whatever youtube.com/ kindafunnygames there you go you nailed it Tacoma hey everybody the game that's never coming out before we",
            "start": 173.96
        },
        {
            "text": "since when then it'll just one on one V one Nick see he can get F whatever youtube.com/ KindaFunnyGames there you go you nailed it Tacoma hey everybody the game that's never coming out before we get into that I I told you this earlier off camera but I want to say it again I actually finally got a chance to sit down and play Gone Home and it **** blew me away and I loved it and I was like I'm I just I can't I just wanted to thank you for making that game it was really really fun if anyone out there has not played it I can go get it it is great you have no excuse anymore no excuse yeah unless you respect trophies shots fired for Kev I know if I can get Kev I get I get the audience yeah cuz like uh had you you hadn't played it cuz you you don't play PC games as much no yeah that's that's why so when it came to PS4 I was like oh okay I'll give this shot so yeah if you if you've heard of it or whatever you haven't got a chance to play it it's on Xbox and PS4 now so yeah give it a shot",
            "start": 227.72
        },
        {
            "text": "why so when it came to PS4 I was like oh okay I'll give this shot so yeah if you if you've heard of it or whatever you haven't got a chance to play it it's on Xbox and PS4 now so yeah give it a shot than thank you so much for taking the time to to check it out I'm really glad you like absolutely pleasure I don't think we've ever really talked about it we haven't no I know that you liked it yeah but did you go in not knowing anything zero so so what did you think for the first part of the game I I think that means that you empirically don't watch Greg's content he no no I mean I knew I knew enough about it to know kind of I don't want to spoil it for people who haven't played out in the audience but seriously if you haven't played it yet **** you I don't know how many times I got to talk about this game I'm buying this game for kids come on I clearly I like it everybody's Christmas gift that was the one did you see when I broke this kid's heart on Twitter I this one one of our fans",
            "start": 271.48
        },
        {
            "text": "about this game I'm buying this game for kids come on I clearly I like it everybody's Christmas gift that was the one did you see when I broke this kid's heart on Twitter I this one one of our fans tweeted at me and he was like uh Gone Home's on PS I I tweeted out Gone Home is on PS4 and I yeah and he's like I see it's on there is it worth my time and I'm like no I've just been talking about it for 3 years cuz it's a piece of garbage and he deleted his Twitter and then it became a whole thing no yeah well that's what he gets um no I knew I knew sort of the rough like character dynamics of it what it was what it was going to be based off of but going into it I was like w this has a at first I'm like this is a really kind of kooky not kooky a spooky uh kind Jack Tripper um no I didn't really know what to make of it but the Ambiance that it sets where right off the bat the tone that it sets is really awesome and then you kind it kind of draws you into the mystery of what's",
            "start": 310.4
        },
        {
            "text": "I didn't really know what to make of it but the ambiance that it sets, where right off the bat the tone that it sets is really awesome. And then you kind of draw into the mystery of what's happening at first I'm like okay is this going to be a mystery or I thought this more about the relationship dynamics between these two people um and then you just get sucked in. And by the end of it, it really is just a nice... I don't want to say payoff because that seems like the wrong term for it sure yeah it's just a nice sort of... you feel oh God, end of Journey, it is it's a bittersweet end of the journey, it's very bittersweet um and it was and it was cool. And I actually went I played it and then was like wait a minute no I gotta I got it wait what like that the ending kind of had such an impact on me that I'm like I'm gonna I'm gonna go back and do it again I kind of went back and like... I can change this I can change this if I",
            "start": 353.16
        },
        {
            "text": "that the ending kind of like it kind of had such an impact on me that I'm like I'm gonna I'm gonna go back and do it again I kind of went back and like like I can change this I can change this if I get to the room faster because I I wasn't paying attention at the beginning to some of the things that you find in the the front room that you come in so I'm like I'm going to restart this and and uh I think it actually if I remember correctly it resets you and I kind of went back to the yeah you go menu menu kind of went back um so it was cool just to kind of just to kind of tie that and I was like oh this is such good really it's good writing when you look at it because a lot of the setup was there for you and you don't get that until it comes full circle and all those threads come together at the end which that's the thing I admire most about it was I was like God I was like Gainer like he he weaved a good tail that was the funny thing and I don't think we've talked about this but me",
            "start": 391.32
        },
        {
            "text": "at the end which that's the thing I admire most about it was I was like God I was like Gabe Logan (not Gainer) like he he weaved a good tale that was the funny thing and I don't think we've talked about this but me when I went back and did the playthrough on PlayStation 4 that was my first time playing it again since PC it was one of those games the first time I finished it I was like that was my story and that's awesome but I remember and it kind of sounds funny it kind of feels like when you go back to like your elementary school and you're like I remember these desks being so much bigger when I went back and was playing it this time knowing everything like I remember there being so much clutter of so many things I picked up that didn't matter when in reality everything I pick up in that game matters but in the beginning on my PC play through I had no idea I remember you know I remember picking up the photo of Laura (not Lonnie) and just like whatever this isn't what am I looking for you know what I mean you",
            "start": 425.84
        },
        {
            "text": "but in the beginning on my PC playthrough I had no idea I remember you know I remember picking up the photo of Lonnie and just like whatever this isn't what am I looking for you know what I mean you put it all down and then to play through it again you're like oh **** right like from the beginning you've been telling me all these things yeah I you know the game is the same like it's the same stuff in it every time you play it's not like randomized or anything but I I don't think I've ever talked to anybody who played it more than once and didn't like discover new things the second time they play either because they just missed it the first time or because they're like oh I didn't realize that that like had a connection to something and it's cool to hear people you know kind of like go back through with some foreknowledge and and get what the implications are so yeah thanks for playing through it for the second time in three years no problem it's a pleasure have playthrough now",
            "start": 460.16
        },
        {
            "text": "through with some form knowledge and get what the implications are, so yeah, thanks for playing through it for the second time in three years. No problem, it's a pleasure have played through it now I'm going to rock Tacoma. Yeah, I'm beat the **** out of that game when it comes out now I know what to expect. Yeah, yeah, you're going to overanalyze everything in Tacoma looking around doing everything talk to us about Tacoma all right, you you delayed it this week and I'm giving you joshing I don't I don't mind take your time with it make it great. Yeah how hard of a well it's because I mean so okay I'm just gonna you're going to put it out there no I mean we came talked to you guys yeah it's going to take us a while to get that platinum trophy in than we couldn't do it this year with that and I was like I was like we we're going to ship I was like we're going to ship it 2016 we can't get the Platinum I'm going to sh and then and I was like but Greg will be so sad if you can hold off",
            "start": 496.52
        },
        {
            "text": "and I was like, I was like, we were going to ship, I was like, we're going to ship it. 2016, we can't get the Platinum. I'm going to sh and then, and I was like, but Greg will be so sad if you can hold off and get it. I mean, you can push it to 2019 if you get on the PlayStation Vita. I'm just, you do whatever you need to do to make that happen. Well, cuz the thing is, we're launching on Xbox, so like figuring out how to get a platinum trophy on Xbox is like hard, but we're going to be the first, we're going to be the first to do it somehow. It po they're talking about connecting the networks my so it could just be that all of a sudden you ping and you got it, you figured it out, you've done the way to do it. Uh, yeah, no, we were uh, we basically, you know, we were showing it last year, uh came around and showed the stuff we were working on, and between then and now, you know, we had people that we know play it, we had you know people in the press play it, and there were things that we were like",
            "start": 533.36
        },
        {
            "text": "and showed the stuff we were working on, and between then and now, you know we had people that we know play it, we had you know people in the press play it, and there were things that we were like okay, we've pushed what we're doing this far, and if we just take that and be like okay well that's the game, let's just finish it. It was like pointing towards the stuff we really wanted to talk about but wasn't really addressing it fully, you know what I mean? It was like we got it as far as we did and we were like okay, we're doing this like Aug reality stuff, we're doing like stuff with gravity, what do we like now? It's clear this is actually what's important about it, and we need to figure out how to like push further on like what you do as a player and how the game works to support like actually what we're trying to say about those things, and not just have it be like our first idea for what we what we're going to put on screen. So like that me, you know, it's the kind of thing where",
            "start": 570.88
        },
        {
            "text": "what we're trying to say about those things and not just have it be like our first idea for what we want to put on screen and so like that, me, you know, it's the kind of thing where it's like if we had been at a point where we like, \"oh, our first idea is good enough, let's just finish it.\" Yeah, um, that would have been great. Uh, you're not always lucky enough to have that. So we gave it the time it needed to be like, what are we really doing with these augmented reality scenes and how you relate to them, etc., etc. And now we're at a point where we're like, \"this is the thing that this game wants to be,\" what it's trying to get us to make, and now we're making it, and we've got to make the rest of it. So yeah, spring 2017. What I liked about your announcement, and maybe I was just reading between the lines too much, and you can correct me if I'm wrong, but was that you talked about the fact that...",
            "start": 619.76
        },
        {
            "text": "2017 what I what I what I liked about your announcement and maybe I was just reading between the lines too much and you can correct me if I'm wrong but was you talked about the fact that yeah you you know shared it with friends and other devs and whatever and they had played it and you took the feedback and we're going this way with it and what I loved about that statement is that it's a snapshot that you can compare to Gone Home because you talked about it in your interview with me over on YouTube.com/ ofun games oh yeah uh where you said that I was like when did you know you had something with Gone Home and you're like well we sent it out to our friends and devs and they all wanted more and so to see that now not that this is like a that see that you now get the opposite reaction or not maybe the opposite of like **** this game I don't want to play but you know there was something there on those play tests where you're like well now I know that I I want to pump the brakes",
            "start": 660.28
        },
        {
            "text": "or not maybe the opposite of like **** this game I don't want to play but you know there was something there on those play tests where you're like well now I know that I I want to pump the brakes yeah I mean there's a there's a certain point where you know some of it is is we had a lot of very um you know positive like public reaction when we put stuff out and like that's and that's awesome but there were also points like yeah so so we had we had had developers and stuff that play tested and gave us feedback you know one-on-one but also when we took the game around **Depression** and showed it to them you know we we had them have hands- on time with it they played it and then afterwards you know we did like an interview kind of thing and like a few different people played it and then like one of their first questions was like so uh you know what what do you guys uh want to do to really differentiate what you're doing from **Gone Home** and I'm like you shouldn't be asking tell if that's",
            "start": 695.44
        },
        {
            "text": "one of their first questions was like so uh you know what what do you guys uh want to do to really differentiate what you're doing from Gone Home and I'm like you shouldn't be asking tell if that's what you're in then like we aren't pushing ourselves hard enough you know what I mean and so the good thing is I think that when we take what we're working on now get it polish up to a point where where we can you know take it out into the light of day I think when people put their hands on it they will not be thinking about well how is this different it'll be like this is a different thing and let's talk about that you know what I mean so um we're excited about it uh going to be showing more of it later this year let people get hands on it give everyone the elevator pitch for it cuz we haven't done that we're being we're just walking all over hey everybody ever heard of this video game Tacoma um Point your little your there you go we gave those away in the prize bin last year thank you so",
            "start": 735.4
        },
        {
            "text": "done that we're being we're just walking all over hey everybody ever heard of this video game Tacoma? Um, point your little camera there you go. We gave those away in the prize bin last year. Thank you so much, no problem. Um, so uh Tacoma is a first-person story exploration game that's set on a space station. So it's said in the year 2088 and you are a character that is sent to this space station basically to do a job like a very sort of like just kind of do your job don't worry about what's going on here. And as you explore this station, you're finding these uh kind of digital records of things that happened to the crew before you got there. And you as the player are able to interact with them move through the timeline of what happened in these different parts of the Station Move yourself through it and connect all these threads to effectively you know rebuild a picture of like oh so this is what led to the station being the way it is this is why I was sent here this is what's really",
            "start": 776.88
        },
        {
            "text": "through it and connect all these threads to effectively you know rebuild a picture of like oh so this is what led to the station being the way it is this is why I was sent here this is what's really going on under the surface um and that's a big part of of what the two of the biggest things we pushed on were last time we showed the game the whole station was Zero Gravity but you used magnetic boots to walk around and you could like transfer between surfaces and stuff and like that's theoretically cool um and and and it's cool to do and everything but um the a it requires really big spaces for that to be cool and like really big huge spaces are not actually great for like making Gone Home kind of like yeah and like the the density it's just like that's a lot of floor space and then the other part of it is like as we played it we're like it doesn't really talk about what it would be like to be in a situation like this or how this thing would probably be built",
            "start": 825.08
        },
        {
            "text": "part of it is like as we played it we're like it's a cool idea but like it doesn't really talk about what it would be like to be in a situation like this or how this thing would probably be built you know what I mean cuz it's like a place that people have to live for like years at a time I mean you know they they're they get like shore leave or whatever but we're like this doesn't we want the player to feel like oh I I feel like I'm on a space station I feel like I'm I'm I'm like gravity in ways that I can understand is like relevant here so one of the big things that we did is we rebuilt the station to be more of like a 2001 style central hub that's full of zero-gravity just like you're floating you're just free floating around this space and then you transfer out to the arms to the habitable wings and you're in like Earth gravity and so there's this real contrast between like oh I it makes it tangible that you're like I can feel how this station is constructed I'm in the middle and I'm",
            "start": 873.64
        },
        {
            "text": "and you're in like Earth gravity and so there's this real contrast between like oh I like it makes it tangible that you're like I can feel how this station is constructed I'm in the middle and I'm floating and now I'm walking and I can contrast like maybe this is kind of like what it would be like to be on a facility like this and like I am living that through the the character and then the other side of it is yeah when we were showing stuff last time we had those AR scenes the figures that you know that that were recordings um but for the most part they were a pretty localized you know sort of like here's a little scene and B you didn't really you're an observer like you know you're still an observer you're not like whatever character who looks over and like why is he here you're like what yeah you're not like talking to them and doing you know any changing what happens but we have pushed ourselves further to make those scenes much more like kind of uh robust in terms of there's more",
            "start": 916.6
        },
        {
            "text": "yeah you're not like talking to them and doing you know any changing what happens but we have pushed ourselves further to make those scenes much more like kind of uh robust in terms of there's more characters involved in a single scene and you as the player because the cool thing is so like sorry part of the the what we were pushing ourselves towards was like we're in a futuristic setting right so like how does this futuristic technology actually affect like what I do as the player and what my relationship to the game is and so at some point we were like these are digital recordings of what happened to these characters why like why don't we just let the player have control over like Fast Forward rewind oh I think I missed something I'm going to pull it back and pause and I'm going to walk over here okay these two things are happening at the same time unpause and like give you the tools to really pull all those threads together instead of just like okay I'm it's cool that I'm watching",
            "start": 961.68
        },
        {
            "text": "Over here, okay, these two things are happening at the same time. Unpause and give you the tools to really pull all those threads together instead of just like, \"Okay, it's cool that I'm watching a visual audio,\" but that's all that's happening. It's like no, this is in dialogue with how this technology might work and what your involvement with it would be. So anyway, that's the elevator pitch we just went about... uh, 800 stories. No, I mean that's what gets me so excited about it is when you were talking about fast forward, rewind, when you were on the one-on-one interview before with me, where even right now like are you playing The Division? I haven't gotten to play it yet in The Division. You'll walk through and you'll find Echo locations and you Echo, and then it's around you, but it's like... like it's very localized and it's not moving. You know what I mean, and that's like... I always talk about it when I think... when I've mentioned it to you or other people who are into this stuff.",
            "start": 1006.44
        },
        {
            "text": "you but it's like, it's very localized and it's not moving, you know what I mean. And that's like, I always talk about it when I think, when I've mentioned it to you or other people who are fans of, like, it's similar to the one of the favorite games I thought was underutilized in Arkham Knight - rebuilding a crime scene and playing it back. But you again, super small, I can't wait to be there and be listening to this conversation and notice somebody walks away and be like, all right, cool, play the conversation out, stop, rewind, play it, and then just follow that dude, where does he go, what does he... And we have the people who have told us that these really satisfying moments are where it's sort of cuz, like you know, it basically the scenes are still localized to a part of the station, so you're like, okay, when I'm in this area, this is what was going on here. This has kind of like a snapshot of a thing that happened there. Um but it's still like branching enough that yeah you're",
            "start": 1047.6
        },
        {
            "text": "so you're like okay when i'm in this area this is what was going on here this has kind of like a snapshot of a thing that happened there um but it's still like branching enough that yeah you're like okay i'm following these people we got here i watched the rest of the scene i'm going to pull it back and follow those people and like that moment where you follow them back and you just realize like they're sabotaging the space station they're putting rats into the vents that is i mean the the rat vent moment that's a little bit of a spoiler Greg I think you're kind of being I was I was looking forward to that moment again letting you know now I know that there is a rat now we're just going to have to change the rat vent thing oh sorry I didn't mean to it does that mean you get rid of my map no that means we had another **** year on the schedule thanks sorry well gets but you know yeah those moments of like being like Oh I okay i'm back at that point these things have like Recon",
            "start": 1085.28
        },
        {
            "text": "my map no that means we had another tough year on the schedule thanks sorry well gets but you know yeah those moments of like being like Oh I okay I'm back at that point these things have like Recon converged and like just having that kind of like light bulb moment it's it's really cool to see so uh you know still a ways to go but we're excited about the stuff that's been going on in the background sure what is Kevin like I don't know what are you eating over there Kevin got into some of the Marios no Cheetos are they hot cheetos are they Flamin' Hot they don't have that here just talking you Mike these are really good though I haven't had like regular Cheetos in a long time yeah you guys want some cuz you only eat hot cheetos exclusively oh yeah he does only eat hot cheetos did you see that article the other day about the invention of Hot Cheetos and the guy who did it no it was a really inspiring thing where the the they at the corporation or whatever he the like CEO put out like",
            "start": 1121.64
        },
        {
            "text": "that article the other day about the invention of Hot Cheetos and the guy who did it no it was a really inspiring thing where the the they at the Frito-Lay corporation or whatever he the like CEO put out like everybody's part of this team you're all part we're all collaborative here and you know we I want ideas and stuff and d d d and I'm G to get some of this wrong I believe he was just a maintenance worker or whatever and they they **** up some Cheetos that day and they had Cheetos that had none of the powder on them they made too many they were so he took them home and put them down and then he had like a hot sauce there and he put some spice on them and it was really good and so he brought him in like he put together a presentation and he got a suit and like they **** did it and took the idea and like used it and ran with it you find gold like that it behooves you to actually take the idea yeah I'm waiting for Kevin  to come up with the idea for Kinda Funny soon I hope that that guy",
            "start": 1162.88
        },
        {
            "text": "idea and like used it and ran with it you find gold like that it behooves you to actually take the idea yeah I'm waiting for Greg Miller to come up with the idea for Kinda Funny soon I hope that that guy got to benefit from that aside from a shout out got an article an article all the Flaming Hot Cheetos he could eat in an article about him did you you've watched The Wire no I haven't the Showtime show uh HBO yeah yeah you've watched it yeah so there's the whole thing in the first uh okay hey how you doing watch and then yeah the whole thing in the first Supergirl episodes aren't going to watch themselves they won't I don't know about that uh there's a there's a conversation in the first season where he's talking about the guy that invented chicken nuggets Mr. Nugget is like stuck down to the base do you remember this it's one of the one of the guys on the corner is basically uh it's um D'Angelo I think yeah yeah is uh is saying like there's a conversation where they're eating",
            "start": 1197.08
        },
        {
            "text": "to the base do you remember this it's one of the one of the guys on the corner is basically uh it's um D'Angelo I think yeah yeah is uh is saying like there's a conversation where they're eating chicken nuggets and one of the the kids is like ah whoever made whoever invented these must be rich and the guy's like no that's somebody who works in the basement of McDonald's he came up with them they're like nice work come up with something else Mr. Nugget so I hope that guy actually is not just Mr. Nugget in the basement he's not just like okay I guess I'll go back and keep back to being a maintenance guy thanks guys that's cool though I mean that's that's that is awesome that is was somebody who wasn't like I'm a food scientist how do we maximize exactly is it weird that I think that everyone that works at the Cheetos Factory wears like a white coat but then it's always pissed off when they get the Cheetos yeah cuz Kevin's lifting up his filthy little paw covered in cheo's dust right",
            "start": 1241.16
        },
        {
            "text": "that works at the Cheetos Factory wears like a white coat but then it's always pissed off when they get the Cheetos yeah cuz Kevin's lifting up his filthy little paw covered in cheo's dust right now and then he slams it on his pants on his white pants where did you get those all white skinny jeans I licked my fingers first great I'm glad I touch all of your here's the next thing I'm going to toss out yeah you get sick a lot Kevin yeah I don't get sick a lot are you sick right now or were you sick last two weeks ago I was S I was sick last week last week no it was last week do you do a lot of licking your fingers then touching then licking your fingers I certainly do he likes to also touch like park benches and bus benches and pretty much anything get little hands on I I was I was walking I was walking back to the place I'm staying last night and I was on Valencia Street and uh I dropped something and it rolled like like you know just like off to the side or whatever and I got down",
            "start": 1280.88
        },
        {
            "text": "I was walking back to the place I'm staying last night and I was on Valencia Street and uh I dropped something and it rolled like, like you know just like off to the side or whatever and I got down, like crouched down to like find it and I just I had that moment where I was like I put my hands down, I was like I just put both of my hands on all of Valencia Street sidewalk okay. I am not going to the closest place that has soap and water right now - bad idea, bad idea but if you live through it you become stronger exactly. It's great for your immune system, it is. It took me one ComiCon, it was like my second ComiCon, I think in San Diego where I woke up and like couldn't speak and my throat and I was like never again - and ever since then any time you leave the house at a convention, like your hands are biohazard so I just realized. So I'm I did a thing just now so I said I dropped something I was looking for it I thought I saw a rat run under a car and I wanted to see if it was",
            "start": 1327.28
        },
        {
            "text": "your hands are biohazard so I just realized so I'm I I did a thing just now so I said I dropped something I was looking for for it I thought I saw a rat run under a car and I wanted to see if it was really there I I I said the the fake part cuz I was self-conscious and I was like no I was you're in a safe place kind of I thought I saw a rat and I wanted to see if it was under there that was actually why I touched see the only reason why I wouldn't do that and I'm I'm with you on that I have a morbid curiosity of like Critters as well but I have that fear of like the '80s movies fear when you look under thing and it just goes your face and then you lose an eye like Night of the Creeps it like jumps out of the dog's mouth into your mouth it jumps out of the dog's mouth into your mouth n of the Creeps remember n of the Creeps you got creep heard this movie it's a movie where it's like Body Snatchers kind of thing where these aliens crash whatever and they all look like was it",
            "start": 1371.88
        },
        {
            "text": "of the Creeps remember of the Creeps you got creep heard this movie it's a movie where it's like Body Snatchers kind of thing where these aliens crash whatever and they all look like was it a Rottweiler was that the dog no it was a super small dog it's it's all these little worm wormy alien creatures they like they take over they jump into your your mouth and then breed inside you and then eventually you explode but they also can spit out at people and get in their mouths or whatever and so at the end it looks like they beat them all and like the girl like who the guy saved or whatever like no one's watching of the Creeps I'm not ruining this movie they he she oh you survived what Portillo go and shoots it into her mouth and the credits roll it's also where that great line uh the guy opens the the blinds and he goes good news girls your your dates are here bad news they're dead I actually remember that that's funny that sounds like a good movie yeah Tacoma sounds like a good",
            "start": 1410.24
        },
        {
            "text": "guy opens the blinds and he goes good news girls your dates are here bad news they're dead i actually remember that thats funny that sounds like a good movie yeah Tacoma sounds like a good game see how i brought it all back around but that sounded like an extreme ice ball like you were just like that sound oh did it no i thought was i was like up like thats how i would show ladies no you were like Night of the Creeps and i was like that sounds like a good movie and youre like well Tacoma sounds like a good game oh i think T is a really good game you know that i i i know fan boy number one brother i know how many of your fans got walls full of arts and crap at home probably one or two but youre like the best thank you we had Max Landis over the other day for a podcast you know this guy writer director okay uh and he he was talking about firewatch he just played firewatch he disappointed in fire watch and i was like well firewatch is one of these games its a lot like",
            "start": 1448.56
        },
        {
            "text": "know this guy writer director okay uh and he he was talking about Firewatch he just played Firewatch he disappointed in Fire Watch and I was like well Firewatch is one of these games it's a lot like This Game Gone Home and you need to play Gone Home you got to play Gone Home and he looked at the wall he's like oh yeah Gone Home he's like what is this other thing for like nothing don't worry nobody say it I was like nobody say anything so he knows kind of but he doesn't know yeah right and then I think I asked you for a code that I then gave to him oh really nice there you go all right I'm doing it I'm doing God's work spread the word the Gospel one code at a time exactly exactly exactly I I saw a movie um oh my God it's Ghostbusters Ghostbusters 2 Ghostbusters man Steel Superman one Superman 2 I I I think that it's I think the title is Return of the Living Dead I'm H **** yes Return Of The Living Dead you me and Michael Rosenbaum love this",
            "start": 1491.32
        },
        {
            "text": "Return of the Living Dead I'm H **** yes Return Of The Living Dead you me and Michael Rosen mom love this movie yes yeah so you know all the **** do you want a party it's party time yeah they just play that song over and over again like this the only song you could afford yeah no I mean that's as far as like Night of the Creeps just made me think about like movies that are like so here's so return to dead yeah I didn't know about it I A friend of mine brought it over and we watched it last Halloween do you know about it no I mean I've heard them talk about it this is one that's not a Romero film right exact so they took in a totally different direction it's like a kind of like punk rock like it reminds me of like Repo Man with zombies um and it was written and directed by the writer of alien the first alien um and it's it it it's a it's a crazy movie it's good it's really trashy but actually",
            "start": 1527.56
        },
        {
            "text": "me of like Repo Man with zombies um and it was written and directed by the writer of Alien, the first Alien um and it's it it it's a it's a crazy movie it's good it's really trashy but actually good like like it's like in the first 20 minutes there's one of the female characters just like likes to take all her clothes off and she's naked for most of the movie it's like it's like it's not classy to avoid the NC-17 they had to give her a pasty for her vagina really yeah well I mean so she looks like a Kathleen Turner little bit just so you know um and so uh but but yeah written I know wrap it up shut up Kevin written by the by the writer of Alien uh and and you can kind of feel it because like so that movie was the movie that established that zombies want brains like it was the first movie where zombies were like brains and then it became a thing and it's because like the weird thing is you can really feel it cuz the whole movie is based around like basically",
            "start": 1571.24
        },
        {
            "text": "were like brains and then it became a thing and it's because like the weird thing is you can really feel it cuz the whole movie is about like the plot of the movie is based around like basically going through the steps of how a zombie works and how it becomes a zombie and then what it wants after it's a zombie and like why and stuff and it's like oh yeah Alien was about the life cycle of how does this alien work and What stages does it go through and then you really see it in this movie but it's also this weird ridiculous punk rock like you know midnight movie kind of like movie everybody go watch it the soundtrack is **** good it's it's a weird movie and it's totally totally worth watching yeah probably like Tacoma will be totally worth playing when it comes out this spring right next spring well oh I guess it is still this spring you know what I mean I'm I'm thinking already so far ahead 2017 you're wishing no I'm thinking that I'm thinking that we're already in Spring it's already",
            "start": 1619.0
        },
        {
            "text": "well oh i guess it is still this spring you know what i mean im im thinking already so far ahead 2017 youre wishing no im thinking that im thinking that were already in Spring its already popping here when it comes out next year its March a year from now Steve Gaynor is going to be back here well be talking about this game well be saying itll be out in the fall thats thats the spoilers now thats just being a hater its just being a realist about game development Steve thank you for coming by absolutely thank you its always great in here ill shake your hand as well thanks everybody than you lot fun",
            "start": 1659.76
        }
    ]
}