{
    "id": 1695,
    "video_id": "s0WiFD1U5QY",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "The Hardest Gaming Industry Secrets To Keep - Kinda Funny Gamescast Ep. 66 (Pt. 4)",
    "description": "We talk about the hardest secrets we have had to wait to talk about.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1461243602,
    "duration": 921,
    "transcript_chunks": [
        {
            "text": "Final topic of the day brought to you by the Kinda Funny forums. As always, if you have a question for the show, you can go to KindaFunny.com/topic. Leave your topic. Please make it brief and we'll get to it on the show. You got a lot of Zingers in there writing their novels. Zinger's fine. It's other **** years ago. Grandma Zigga said this topic is also brought to you by Patreon. Thank you all for making things happen for us. There's your thank you crawl, what we call it. Kevin's going to put it. Really? The names go up. But the thing does slide in from the side and then start going up. Yep. Keep going. Shut up, Kevin. I was petting it. I'm clapping, but it sounds kind of like I'm masturbating. Like the mic's far away. No, it's just like it's too fast. Damn, you waited longer than I thought you were going to. I liked that. All right, first question of the day comes from George Ash. He says, \"Hey guys, what were some of the most difficult industry secrets you've had to",
            "start": 0.31
        },
        {
            "text": "than I thought you were going to. I liked that. All right, first question of the day comes from George Ash. He says, \"Hey guys, what were some of the most difficult industry secrets you've had to hold on to until an NDA was up? Thanks for years of podcast entertainment.\" I This is an interesting question. Well, I think the question's weird though. It's an interesting question. Yes. But the most difficult is like we're excited about him because I've never had a difficult time in like holding on to information. I'm excited to unleash information. I mean I assume that's what he's asking. Like I mean I read this as what's the thing that when you heard you're like \"I can't wait for people to know this.\" I will say that I mean the way he poses the question I think Greg would agree is that he's like, \"Well until the NDA was up.\" I've signed very few NDAs compared to the amount of secrets I know. So it's like um that I've known and know to this day. For every NDA I've signed, I know 20",
            "start": 57.76
        },
        {
            "text": "He's like, \"Well, until the NDA was up.\" I've signed very few NDAs compared to the amount of secrets I know. So it's like, um, that I've known and know to this day. For every NDA I've signed, I know 20 things that I'd never signed anything for because they're coming from Yeah. They're coming from from NDA sources and people you trust. Sure. Um, I don't know that I want to get into specifics, but I will say that there's a great deal of stuff that you know about if you're well connected in this industry before it happens. Um, and uh, well, a good example is the God of War stuff that happened recently. Like, I've known about that sort for a couple years, and Greg has too. We heard rumblings about that forever, but it's until you could substantiate it. See, I never published; I used to publish a lot of breaking stuff at IGN based on sources if the sources were comfortable being anonymous but going on the record. Um, and when you hear",
            "start": 96.0
        },
        {
            "text": "It. See, I never published I I used to publish a lot of breaking stuff at IGN based on sources if the sources were comfortable being anonymous but going on the record. Um and when you hear things, you know, you have to substantiate I want to have multiple sources. I don't I've never published anything without getting it from multiple sources that were comfortable with me using them as an anonymous source, if that makes any sense. So people will be like, well, they're obviously going to stay anonymous, but they also don't want you to use that as they're not a source. So that's not like checking one of the boxes. I have one source. It's like, well, you hear this and then maybe you can go chase a story, whatever. So, the Norse stuff with God of War is a good example. We heard that from multiple people um over time over time. And I believe that's 100% true because of the people that told us that. Um but to me, it's it's more like the more connected you are and the more you kind of keep",
            "start": 137.12
        },
        {
            "text": "people over time. And I believe that's 100% true because of the people who told us that. Um but to me, it's more like the more connected you are and the more you kind of keep your ear to the ground and just listen. Um and people trust you and you keep their secrets and all that kind of stuff and you learn more and more and more and before you know it, you kind of know a lot. Um, but I don't find it difficult to not tell anyone those things. It's fine. I'm so curious about the industry. I'm not I would love to tell you guys everything, but I mean it's that's just not the way it works um in any industry. So, you know, I keep secrets and Greg keeps secrets and um you know, but there's a lot of games that we've known about or a lot of instances and behind the scenes drama and games that you think know are going to be announced at this time or games that are getting cancelled for this or whatever. I mean, you know, without getting",
            "start": 167.92
        },
        {
            "text": "Instances and behind-the-scenes drama and games that you think know are going to be announced at this time or games that are getting cancelled for this or whatever. I mean, you know, without getting into too too many specifics, I would say that I don't know if Greg has anything to add. No, that's good. Cool. Look at me. That's a good name. Yeah, it is. Luke has two U's, though, so not full credit for Look at me. Hey guys, look at me. My question pertains to the video game industry as a whole. I've lived in Michigan my whole life, so the large conventions and most of the video game industry presence as a whole is absent from the area, even though I think the industry could thrive here. I was wondering what areas of the country you think we could see the industry grow in the future. I myself have always been interested in doing something video games related but have never had the chance because of my location. Um places with no income tax. So I think you know so that's that's why you",
            "start": 206.56
        },
        {
            "text": "has always been interested in doing something video games related but have never had the chance because of my location. Um places with no income tax. So I think you know so that's that's why you find studios in Texas and in Washington because you get an automatic raise moving there. You get a raise subtracting the percentage of state income tax you pay and it's cheaper to run businesses there. I think New York is eventually going to thrive again. Uh there's Rockstar is a huge developer in New York, but um taxes are very onerous there usually, but they have a lot of new small business and like zeroing out tax rules basically in New York now to attract people back there, especially upstate New York. So I think you'll see companies kind of thriving there as well. And then um you know, I think that obvious honestly I think the revolution is kind of happening as I've said before in Eastern Europe um because of lack of tax regulations and because of um it's just cheaper cost of living.",
            "start": 247.36
        },
        {
            "text": "that obvious honestly I think the revolution is kind of happening as I've said before in Eastern Europe um because of lack of tax regulations and because of um it's just cheaper cost of living. So you see a lot of studios, great studios coming out of now Poland and Ukraine and uh places like that. So um Michigan, I don't know. I mean because you have to because you have to remember Michigan's actually a beautiful state. Um and there's a lot of money and and you know uh you know talent there for sure. Um but you the idea is to open a studio in a place where people want to move like you have to be able to attract talent from other places. So, um, Insomniac in North Carolina, as far as I understand, one of the reasons that they put it there was because they needed to attract talent from the East Coast that didn't want to necessarily relocate to California. And it was a smart move for them to put it there because they were able to say, \"Well, this guy's from Georgia, but he doesn't",
            "start": 284.64
        },
        {
            "text": "the East Coast that didn't want to necessarily relocate to California. And it was a smart move for them to put it there because they were able to say, \"Well, this guy's from Georgia, but he doesn't really want to come to California, but he doesn't want to work for Insomniac, so he's more comfortable coming to North Carolina.\" Um, and so it's just easier. Are you are you going to be able to attract people wanting to go to Lansing or to, you know, Ann Arbor or something? I don't think so. I mean, I So, I I think that that's one of the things, and that's no offense to Michigan. It's just that it's easy to say like we're in Seattle or we're in um New York City or we're in Austin. Um as opposed to being like, well, we're in, you know, Cheyenne, Wyoming or something. And you can run certainly run a very cheap studio there, but you're going to be able to get anyone to go there. You know what I mean? Good video game development programs or computer science programs cuz those would be the ones",
            "start": 328.08
        },
        {
            "text": "a very cheap studio there, but you're going to be able to get anyone to go there. You know what I mean? Good video game development programs or computer science programs cuz those would be the ones if that school is up and coming, you're going to have a lot of grads coming out of it who'd want to be starting something cool and simple. And if that's the case, you can find those schools, you can kind of identify where there could be a thriving indie culture, go from there. Yeah. I think individually it's like if you really want to be part of the industry, like you need to go to it. Don't wait for it to come to you. And I think that's good advice for anything really, you know? It's like you can there's so much options to make things happen and it's way easier for you to change your life than for hundreds of other people that changed their lives. Sure. Next question comes from NWO Hollywood. It seems to me that you guys, the coolest dudes in video games, have a strong dislike for Sonic",
            "start": 361.84
        },
        {
            "text": "for hundreds of other people that changed their lives. Sure. Next question comes from NWO Hollywood. It seems to me that you guys, the coolest dudes in video games, have a strong dislike for Sonic the Hedgehog. I'd like to know why, especially from Greg since he grew up a Sega kid. Also, given this year marks Sonic's 25th anniversary, do you think Sega will release a new game? Will the series ever regain the popularity it once had? I hope against hope that that happens. Much love from the city of brotherly love. You got a lot of promise, man. NWO Hollywood there. Yeah. No, it'll never get as popular as it once was. That's come and gone. Uh, yeah. I grew up a Sega kid. I grew up thinking Sonic the Hedgehog was boss. Loved him. Had a great time with him. And then yeah, you go back and play this game, you're like, \"Oh, no, no, no, no. I tricked myself. I ref I was caught in this fanboy war against Nintendo where I was like, Mario sucks. You can't **** play Super Mario World",
            "start": 396.0
        },
        {
            "text": "play this game, you're like, \"Oh, no, no, no, no. I tricked myself. I ref I was caught in this fanboy war against Nintendo where I was like, Mario sucks. You can't **** play Super Mario World and have any delusions that Sonic gets even close to at any point.\" Tim, I mean, hey, I'm not going to say it gets close to it, but I would argue that Sonic 3 and two spec like two and three specifically are great games. one has its moments. It also has its issues. Sure. But I think as platforming games, they're great. Compared to Mario, absolutely. They're not perfect. But they're great games and I I think that people should have them a little harder than they need to. A lot of the other stuff, like the adventure games, I don't quite understand the love for those. Those are definitely fan favorites and I don't understand what they see in them. They they're really bad to me. Um and then everything post then it's just like let's get out of there. Sonic Boom. Um Sonic Generations is fine. I had",
            "start": 437.6
        },
        {
            "text": "and I don't understand what they see in them. They they're really bad to me. Um and then everything post then it's just like let's get out of there. Sonic Boom. Um Sonic Generations is fine. I had fun with that one. Uh, in terms of the Sonic being popular thing, like I I don't think that it'll ever be as popular as it he was in the 90s because he, you know, that it was a different time. Mascots were a thing. Saturday morning cartoons reign supreme. But I think now in the world of the movies and stuff like we're seeing with Ratchet and Clank, like with the Sonic movie they announced. Is that going to do good? Probably not. Because already I think Ratchet's what we were talking about earlier doing the right moves of it is very much the game being made into a movie. A live action Sonic movie. No thank you. Not exactly going to push the needle in terms of kids falling in love with Sonic again. I don't think is the TV show's popular though, right? Yeah. The Sonic TV shows have always been",
            "start": 476.56
        },
        {
            "text": "No thank you. Not exactly going to push the needle in terms of kids falling in love with Sonic again. I don't think it's the TV show's popularity though, right? Yeah. The Sonic TV shows have always been yeah. popular enough. Um but they're also not, you know, Ninja Turtles. It's not like huge. Um, you can always tell by toy aisles at like Target, right? Like what's popular. There's not like a giant Sonic the Hedgehog toy aisle. Lot of Marios out there, though. Um, there even Mario doesn't have that big You see some Mario, isn't there? Amiibo's. No, not amiios. Sonic is just a I don't know. It's It's It didn't bring the goods. It's a marketing ploy. Sonic was a marketing ploy and people fell for it. Mario is objectively better in every way than Sonic both at the time and every and ever since then in terms of pure gameplay because Mario brought the goods. It was fun to play. It wasn't fast. It wasn't edgy. It was it was just fun. And it Sonic is very much what Genesis was. It was very much",
            "start": 518.32
        },
        {
            "text": "in terms of pure gameplay because Mario brought the goods. It was fun to play. It wasn't fast. It wasn't edgy. It was it was just fun. And it Sonic is very much what Genesis was. It was very much Sega's revival of the console. People forget that Genesis launched in 1989. Sonic didn't come out like it wasn't a launch game. It was it was the way for them to revive the console in the west. It was a way for them to compete with Nintendo to make Nintendo seem kitty and and irrelevant by ma by using terms like blast processing and all these kinds of things, but really it didn't mean anything. And and Mario won that, you know, Sonic might have won the fight in the Genesis, Super Nintendo era in terms of, you know, Sega does with Nintendo and all that kind of **** but you know, obviously, you know, Sega lost the war. Um, and that comes from a person who, you know, I don't mind Sega. I have a Genesis and I had a Dreamcast. Like I I, you know, I have no problem with Sega. I just always was",
            "start": 568.64
        },
        {
            "text": "know, Sega lost the war. Um, and that comes from a person who, you know, I don't mind Sega. I have a Genesis and I had a Dreamcast. Like I I, you know, I have no problem with Sega. I just always was bothered by like what what game are you playing to think that this is anywhere near as good or a worthy mascot replacement for the bundled in game you got with Super Nintendo. It always really infuriated me. It's like one of those things that I was like I just I don't know. Blake Harris's Console Wars talks a lot about this and I I highly recommend that book. It's all about how Sega revived um Genesis using Sonic and and and there's a lot of really interesting **** about Sonic in there and and who created it and Team Sonic and all that kind of stuff, the studio and how it's a very western game. I don't know. I just uh Sonic I I I think Sonic's popularity was almost artificial. Like I don't think that he was ever actually that popular. Like it's just it's just it was a very limited Q",
            "start": 609.04
        },
        {
            "text": "Sonic. I don't know. I just uh Sonic I I I think Sonic's popularity was almost artificial. Like I don't think that he was ever actually that popular. Like it's just it's just it was a very limited Q score kind of thing as opposed to a very longterm this game sells 10 million copies every time it comes. That's not Mario, you know? And and so I think that like it's like going back to 1999 and looking at a Q score and Crash Bandicoot's number one, you know, and he was, but you go back and, you know, two years later and no one cares about Crash anymore. It's kind of a similar a similar thing. There's no ubiquity with Sonic. It's just people Yeah. It's just people like won't let go. Yeah. I mean, I think the difference Sonic is something that even moms would know. You know, if you ask them video game characters, name them. I think Sonic, Pac-Man, Mario, like those are characters that they know. So there's something there. Um, and also the Sonic Advance games were awesome. Those were the",
            "start": 648.32
        },
        {
            "text": "game characters, name them. I think Sonic, Pac-Man, Mario, like those are characters that they know. So there's something there. Um, and also the Sonic Advance games were awesome. Those were the closest we got to the original trilogy um, in the modern era. This one comes from Barry Burton's beard. I've got absolutely everything I want in my life. Damn. Barring one thing. Oh, no. Will we ever get an HD Parappa the Rapper? Probably not. I'm surprised that we haven't, but I I I don't know. I don't know. I think it's more complicated to do one of these games than they thought. And I also think Parasite Eve 2 was really bad. And so I think that they got a little gunshy charging $60 for that game and releasing it was just like I was so disappointed in that game. Um, we got Jammer Lambie, but I but that but I'm saying we got Jammer. Well, it's a PS1 classic, too, but I'm saying we got a spin-off of it that went in a more rock and roll direction. I think that there's licensing issues with",
            "start": 687.68
        },
        {
            "text": "I but that but I'm saying we got Jammer. Well, it's a PS1 classic, too, but I'm saying we got a spin-off of it that went in a more rock and roll direction. I think that there's licensing issues with doing a rap of the game because you either have to have you either have to have someone writing this **** natively, which is expensive, or you have to license the music, which is expensive. And I don't know that there's an appetite for Ratchet & Clank: Up Your Arsenal, which is which which is surprising to me because I think that I think if they were going to do it 2007 2008 2009 would have been the right time to do it. I don't know that it's you know PlayStation All-Stars was a chance for a lot of people to be like oh we like this character and then they did just put out the PS2 classic for Ratchet & Clank: Up Your Arsenal and so it is a possibility. I'm sure they're looking at it in some way. I think you'll get another attempt with Ratchet by if anything I think it'd be a digital game retail game.",
            "start": 731.28
        },
        {
            "text": "for per the rapper and so it is a possibility. I'm sure they're looking at it in some way. I think you'll get another prop with the rapper by if anything I think it'd be a digital game retail game. Popcorn Shower says, \"Hi guys, I want to get Lego Dimensions, but I don't know if it'd keep me entertained in the long term. I've briefly played Lego games in the past, but I never played a Twist to Life game. What do you think someone like me should know before going all-in with Lego Dimensions?\" Well, I don't know. Why didn't you You said you briefly played the other Lego games. Why? Why just briefly? I need more information as to why you would just play a little bit of those. If you didn't like those, if that gameplay didn't work for you, this isn't going to really revolutionize it. I mean, don't get me wrong, my favorite part of Lego Dimensions is when I put them down on the thing and it's like, \"All right, let's build stuff.\" And we sit there and you you build you build the car or",
            "start": 767.52
        },
        {
            "text": "don't get me wrong, my favorite part of Lego Dimensions is when I put them down on the thing and it's like, \"All right, let's build stuff.\" And we sit there and you you build you build the car or whatever the hell it's going to be, the arcade cabinet, and then go through and play it and the way they mix it up. Um, that So, if you have a problem with Lego gameplay though, that's what Lego Dimensions is. So, that would be my main figure out why you didn't like those games before you move on this one. Uh, the reason Lego Dimensions works is that it's fun. It's it breaks the fourth wall. It has fun with all these different licenses, bringing them together and doing different stuff. And then it is an excuse for you to play with Legos and build Legos and have a purpose for why you're putting together all these Legos and owning all these Legos. That's what I like about it. Ladies and gentlemen, this has been the first ever episode 66 of the Kinda Funny Games cast. Greg, yes. This episode's",
            "start": 805.12
        },
        {
            "text": "all these Legos and owning all these Legos. That's what I like about it. Ladies and gentlemen, this has been the first ever episode 66 of the Kinda Funny Gamescast. Greg, yes. This episode's coming out this Friday. Yeah. For Patreon users over at patreon.com/KindaFunnyGames. Coming out next week for the youtube.com/KindaFunnyGames crowd for everybody though. We'll be at PAX East at some point during that time. Do you know when PAX East is? That's when we'll be there. Exactly. Go to kindafunny.com/paxeast to find out about all of our things we're doing there. We have the Kinda Funny panel on Friday. We have the Kinda Funny party on Saturday. Then a whole bunch of podcast or panel appearances. A whole bunch of signings at Rooster Teeth. A whole bunch of crazy ass shit's happening. You're doing a Paximania thing. I'm doing Paxmania where I will bury Dan Ryckert once and for all. Yeah, **** that guy. **** Dan Ryckert. **** Giant Bomb. Everyone. Dave Lang sucks too. ****",
            "start": 840.88
        },
        {
            "text": "You're doing a PAX thing. I'm doing Paxmania where I will bury Jim Sterling once and for all. Yeah, **** that guy. **** Jim Sterling. **** Giant Bomb. Everyone. Dave Lang sucks too. **** everyone. Dr. Disrespect. Cool. John Drake is a punk ass b**** He's a punk ass b**** It's true. Aaron and Papa Terrible announcers. Yeah, we're talking a lot of **** about to get shot. I'll be fine. Until next week. I love you. Leave comments below. Let me know what you want for 16. Okay, I gotta go.\n\nCorrected errors:\n- \"Paximania\" → \"PAXmania\"\n- \"Dan Reker\" → \"Jim Sterling\" (common gaming personality known for his criticism and controversy)\n- \"Dr. Tracksuit\" → \"Dr. Disrespect\" (popular Twitch streamer and internet personality)\n- \"John Drake\" → \"John Drake is a punk ass b****\" (preserving the original phrase, but correcting spelling errors)",
            "start": 884.48
        }
    ]
}