{
    "id": 1698,
    "video_id": "yA8fgWnu5wg",
    "show_name": "Love & Sex Stuff",
    "hosts": [
        "Tim Gettys",
        "Nick Scarpino",
        "Geoff Ramsey"
    ],
    "title": "How To Have Angry Sex (w/Geoff Ramsey) - Love & Sex Stuff",
    "description": "Subscribe! https://www.youtube.com/kindafunny?sub\n\nGet your Kinda Funny Live ticket! http://www.kindafunny.com/tickets\n\nSupport this show! Get the Love & Sex Stuff Shirt here!\nhttps://www.districtlines.com/98029-Love-and-Sex-Stuff/kindafunny\n\nSubmit your questions here!:\nhttp://www.kindafunny.com/loveandsex\n\nYou won't like me when I'm angry.\n\nEach and every Monday at 9AM PST Tim Gettys and Nick Scarpino answer your questions about dating and relationship advice....cause that sounds like a good idea.\n\n\nFollow us on Twitter!\nGeoff - https://twitter.com/GeoffLRamsey\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\n\n\n\nMusic by Tonedeff - http://www.QN5.com",
    "published_at": 1461600002,
    "duration": 199,
    "transcript_chunks": [
        {
            "text": "No, it's not acceptable that we're in Austin right now. It's okay because big deal, right? Yeah, yeah. So Geoff, yes sir. Today's question comes from 23-year-old Matt Matthew says his fiancée Hugh Hammond and he have always discussed if angry sex is a thing that's possible. She says if she's angry with him, she wouldn't want anything doing. He says they're both into it enough; it's possible to have sex but still be angry with each other. He always tells her they need to have \"Angry Sex Sunday.\" So now I want to get your expert opinions first off, we're not actually... second off, this sounds like a horrible situation. Yeah, it's about you so an angry sex is like not aggressive, like physical sex but like I'm infuriated. Yeah, I can't believe you said that to my mother. Exactly right. Let's have sex because I feel like there's the makeup sex... yeah argue and that happens but it's like all right we're in the middle of a fight. You know what would be good right now some ****. Yeah, I mean I feel like that's",
            "start": 0.06
        },
        {
            "text": "like there's the makeup sex, yeah argue and that happens but it's like all right we're in the middle of a fight, you know what would be good right now some ****, yeah I mean I feel like that's something you see in the movies because in reality when someone's fighting with me when I fight with my wife it's the worst feeling on the planet it's the anti erection there's something about hearing how many **** times do I have to tell you that it's not conducive to no it really is not hot I think if it were not you'd be able to watch porn about it and there's no booze, no angry fight, yeah there's no we're in the middle of arguing about your mother's side, is that an arguing couple? Yeah, that is a Garrett ten excellent point, yeah what don't you find that there are and this probably doesn't segue into what he's actually talking about it aren't there people that you just want to have sex with oh I can't stand that human being Jesus Christ John yes yes yeah do not like him bang exact great I",
            "start": 60.6
        },
        {
            "text": "into what he's actually talking about it aren't there people that you just want to have sex with oh I can't stand that human being Jesus Christ John yes yes yeah do not like him bang exact great I feel that right here feel that I think the thing here though is that like if she doesn't want it clearly if she's told you she doesn't want it you need to back off it's done like it's done you can't be like I think I think she's wrong no but I can convince her you should not even try to convince it you're gonna get in a lot of trouble and it's not gonna end well yeah I think it'd be worth it to spend the energy actually solving the problem first getting through and then having to make up sex because the makeup sex is good always great Geoff yes you're making us thank you thank you for joining us we should probably wrap this up so we can go get some things done where do they find you at Geoff Ramsey you'd find me on Twitter act and Tim Gettys is him at Nick_Scarpino people have questions",
            "start": 103.98
        },
        {
            "text": "us we should probably wrap this up so we can go get some things done where do they find you at Geoff Ramsey you'd find me on Twitter act and get is him at Nick_Scarpino people have questions for the show go to kindafunny.com/loveandsex Philip perform we'll get back to you shortly and if you want to see him live in person at Kinda Funny Live May 28th-29th San Francisco California don't miss it he's gonna be there he said I'm shirtless smells that's great she's great gonna be fun and also there you go kindafunny.com/store buy the shirts you can buy this shirt you might not show you whether Love & Sex Stuff shirt smile the shirts make us happy please until next time I love you",
            "start": 149.52
        }
    ]
}