{
    "id": 162,
    "video_id": "2O__jnzCKJk",
    "show_name": "A Conversation With Colin",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "If Greg Miller and Colin Moriarty Broke Up, Who'd They Live With? - A Conversation with Colin",
    "description": "If Colin and I broke up, what other IGNer would they room with.\n\nToday's topics were submitted by @Maverickmacd. Leave your suggestions for future conversations in the comments below.\n\nSUBSCRIBE/LIKE/SHARE\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nSubscribe to our channel: http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Tim for filming.",
    "published_at": 1384869602,
    "duration": 343,
    "transcript_chunks": [
        {
            "text": "I I got a great heart. I'm a good person. Yeah, that I know doesn't make me happy. What's up everybody? Welcome to another Conversation With Colin. I'm Greg and this is my roommate, Colin. Now sometimes Colin says crazy stuff, so every Tuesday and Thursday I reach into my random topic pile, pull it out, toss it at him, and we talk it out for your amusement. If you like that, like the video, subscribe to our channel and share it with your friends. Colin, you ready? Today's topic of conversation is if you could be roommates with any other IGN editor, who would it be? Submitted by @MaverickMCD. So you and I work at IGN, we're roommates too. I die, you die, who fills the gap to be the other roommate? You think I know I have enough money to kind of carry this place by myself, so I'm it. I'm your last roommate. I I imagine that when you and I part, yeah, that we will neither of us will live with anyone anymore except for our girlfriends. The three richest kings. Well, I'm just saying like I like we we don't okay, San",
            "start": 0.04
        },
        {
            "text": "that we will neither of us will live with anyone anymore except for our girlfriends. The three richest kings. Well, I'm just saying like I like we we don't okay, San Francisco, very expensive city. Most people have roommates here. So if you're asking why a bunch of 30-year- olds have have roommates, San Francisco is far more expensive than where you live. Uh so so uh so the the whole situation is that this is you're my last roommate. We're not in financially precarious situation at all. Like either of us, we do it because we're trying to save money and like just be a little more responsible comfortably. Yeah, exactly. Like we can because we pay much less in rent than normal people in San Francisco do. By the way, the average rent in San Francisco is about $2,600 a month. Um we uh we mitigate those problems with each other and since we don't hate each other, we can do this and like the whole thing I was talking to Christine about it actually when you were gone where I",
            "start": 48.4
        },
        {
            "text": "about it actually when you were gone where I like Christine Steer is Greg's girlfriend and I was saying like I know Greg kind of wants to leave at some point or whatever and I'm like the fact of the matter is like Greg and I are probably going to live with each other for a lot longer than Greg thinks because because uh we're all profoundly lazy and like outside work like I don't really give a flying **** and B like Greg underestimates how easy it is for him to be able to find a place in the city for like like a situation that's going to allow him to pay for it. Yeah. Um so I think two things. I think that when we leave this apartment it'll be because all of us are leaving, moving out. Yeah. And we'll both not live in San Francisco anymore. You and I'm not saying we're going to leave the bay. I'm just saying like know I go to Alameda or or you",
            "start": 93.84
        },
        {
            "text": ", Oakland or Richmond or something go wherever it is you go and or we go to you know, the valley or something like sure. Um and so I I think that you know there yeah there people I that sure but like I think that if you died nobody steps in huh? No, we'll just we'll just rent your you know room out to a vagabond or something on the street. Okay, like Mike Mitchell. Yeah, I think Andrew Goldfarb would be fun to live with. He'd be easy to live he exactly he seems like our speed. He's quiet, he's into the same things we're into. Yeah, he's like kind of um a nice compliment to us. Yeah. Um so yeah, he would be easy to live with. I like Eric Martin a lot. I think he'd be fun to live with cuz we'd have great conversations with him. However, he's very young. Yeah, still very much likes to party. He's too young too much",
            "start": 132.88
        },
        {
            "text": "likes to party. He's too young too much party. He doesn't understand the world. He doesn't come home like we do beaten by life go to bed at 10 o'clock. No, I I went to bed at 9: the other day. I went at 9 9 o'. That's no good. We look forward to sleeping too much. I love to sleep mostly because I'm just wildly depressed and it's the only way for me to to to uh stay away from the things that uh the bad St the bad things. So yeah, I think you know I think that yeah if you moved out of here without us being ready to leave then we probably just flew up this place by ourselves um with Cheryl and I and Mike if we all decide to leave together then I think that we you would live with Christine I live with Cheryl Mike would live in an alley somewhere sure and we'd you know make that work so okay this is the last roommate situation ever going be unless",
            "start": 179.92
        },
        {
            "text": "so dire that I need to like go home and live with my dad or something like that right right right right well that wouldn't be that bad I guess you know cool like no rent well I think you'd pay him rent you feel like it he'd want rent I don't GJ him he's gonna want some GJ GJ him's a serious dude but the one thing my dad always told me is what he appreciated about me the most yeah when I grew up was I never asked him for anything you know my dad you know my parents you know are fine financially but like they sent me to college and made me pay for it myself because that's what men do and uh you know he always told me he's like I appreciate that you never really asked me for like I could have fallen back on him so many times I never did sure",
            "start": 224.0
        },
        {
            "text": "s like I appreciate that you never really asked me for like I could have fallen back on him so many times I never did sure sure sure and so I'd like to think that if like guy fell on hard times when I was 30 35 years old I was like I got to move in for a long that's oh well that's yeah yeah I think yeah that's fine you know because but I think knowing you you'd be giving him some money when you had it you'd be giving it to him don't act like you're not you're a good guy you act all grumpy and mean and stuff but you're you're a you're a good-hearted guy I am I got a great heart. I'm a good person. Yeah, that I know doesn't make me happy but that's you know that that's you know that's another matter entirely. Okay, well thank you for your time as always, Col. Problem. Maverick MCD, thank you for your question ladies and gentlemen if you have a future topic for Conversation With Colin leave it in the comments below",
            "start": 265.48
        },
        {
            "text": "your question ladies and gentlemen if you have a future topic for Conversation With Colin leave it in the comments below then make sure you like this video subscribe to us on YouTube Share us with your friends until then we'll be back every Tuesday and Thursday so have a conversational day a number cruncher like got an abacus yeah I'm not going to be that guy not going to use an abacus at work every day not going to sit there in front of the Excel spreadsheet and add up you know how much corporate loss we have and what the net gain is I don't even know what business term a lot of business ter out terms what's the Venn diagram intersecting with this parallelogram do of course of course um you sound like someone that has a business background",
            "start": 303.52
        }
    ]
}