{
  "id": 158,
  "video_id": "5PAdoiHWR2o",
  "show_name": "A Conversation With Colin",
  "hosts": ["Greg Miller", "Colin Moriarty"],
  "title": "Greg Miller and Colin Moriarty: The Made for TV Movie - A Conversation with Colin",
  "description": "Clearly, Greg and Colin's story is one for the ages. Who should play them in the movie?\n\nToday's topics were submitted by @Albinoasscheeck. Leave your suggestions for future conversations in the comments below.\n\nSUBSCRIBE/LIKE/SHARE\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nSubscribe to our channel: http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Tim for filming.",
  "published_at": 1384264803,
  "duration": 317,
  "transcript_chunks": [
    {
      "text": "It's funny, like everyone always tells me I look like Anthony Bourdain, so I'd want Anthony Bourdain to play me as Bour, yeah, but have, but have like him, like in, like with dyed hair and like makeup to make him look like he's the, the food guy. Yeah. What's up everybody? Welcome to A Conversation With Colin. I'm Greg and this is my roommate Colin and his shirt. Now sometimes Colin says crazy stuff, so every Tuesday and Thursday I reach into my random topic pile, pulling out, toss it at him, we talk it out for your amusement. If you like that, like this video. I, when you do that, I could hear into your stomach. Oh, sorry. What's wrong? It just **** up. No, you just can't, you can't. What's up everybody? Welcome to A Conversation With Colin. I'm Greg and this is my roommate Colin. Now sometimes Colin says crazy stuff, so every Tuesday and Thursday I reach to my random topic pile, pull one out, toss it at them, we talk it out for your amusement. If you like that, like the video, subscribe to us on YouTube and share us with",
      "start": 1.68
    },
    {
      "text": "every Tuesday and Thursday I reach to my random topic pile, pull one out, toss it at them, we talk it out for your amusement. If you like that, like the video, subscribe to us on YouTube and share us with your friends and family. Colin, are you ready? Yeah. Is there shoe polish on the table? I think it might be from the keyboard. Okay, we toss the keyboard on the table. Uh, what will your inevitable made for television original biopic be like? What actors would you like to portray you guys in a film? This is from Albino Asscheek. I believe the first ever repeat user. We've done a lot of these conversations, so don't quote me on that, but I definitely remember the username Albino Asscheek. Okay, so Colin, what's our TV movie going to be like and who's going to play us? It's going to be, it's going to be like a Behind the Music, right? Like they started from small Beginnings, blah, blah, and then they'll like have like the recreation of our kitchen and us doing these and then whatever we do next, which is huge, but then",
      "start": 46.28
    },
    {
      "text": "the Music, right? Like they started from small Beginnings, blah, blah, and then they'll like have like the recreation of our kitchen and us doing these and then whatever we do next, which is huge, but then they'll be like the drunken fight over like money, like we break up, we don't talk anymore and then we come back together for some reunion conversation with Colin. It's funny, like everyone always tells me I look like Anthony Bourdain, so I'd want Anthony Bourdain to play me as Bour, yeah, but have, but have like him, like in, like with dyed hair and like makeup to make him look like he's the , the food guy. Do you think you look like Anthony B? Let's do a, let's do a side by side here. Why? That's a lot of editing, but Tim's on it, right? Tim, yeah. I've been told that by many people. I don't know if that's a compliment or not, but yeah, I've been told by he's old though, too. Yeah, yeah, not like super old. Don't, don't get mad. I don't mean like that, but I mean like he's out pacing you for sure. Uh, I don't know. I",
      "start": 87.88
    },
    {
      "text": "compliment or not, but yeah, I've been told by he's old though, too. Yeah, yeah, not like super old. Don't, don't get mad. I don't mean like that, but I mean like he's out pacing you for sure. Uh, I don't know. I don't, I, it would be cool to have a, a story of us that is independent of, of each other that tells the stories of and then and then comes together. Oh, kind of like Avengers, like we each have our own movie, our own made for TV movie and then at the, then there's a third movie where we sure. Wow. Who would, who would play you? Probably Jonah Hill. Jonah Hill. Jonah Hill seems a good pick for Greg Miller, right? That's good. Jonah Hill said who's playing me? I would say maybe like a Seth and then you'd be like a Steve Gutenberg. Okay, so Steve Gutenberg for Colin, Seth Rogan for me. You are miscasting the movie doing modern. I, I would go Seth for you, someone else in the, oh, Paul Rudd . Paul Rudd would be amazing. Yeah, with glasses that work. Okay, I can see Rudd you. I don't know why Rogan for me though. He's big and kind of",
      "start": 127.08
    },
    {
      "text": "modern. I, I would go Seth for you, someone else in the, oh, Paul Rudd. Paul Rudd would be amazing. Yeah, with glasses that work. Okay, I can see Rudd you. I don't know why Rogan for me though. He's big and kind of fun and boisterous, so Jonah Hill. Jonah Hill's, I don't see you. When I look at you, I don't see he was a fat guy. Jonah Hill quit team fat fat. Yeah, but they all quit team fat to come back. He came back. So did Seth Rogan, too. He quit team fat, he came back, not hardcore, but he's still there. Yeah, these are still fat Stoners. Think he was a fat guy? I never have. I think he was a big guy. I think big Jonah Hill. I think that's sad. He'll always have that arm fat even if he have to get the arm taken out, you know. Okay, I guess that makes sense. Like, you know, moms in the Midwest, like moms in the Midwest. Yeah, no doubt, no doubt, no doubt. Cool. I still like Anthony Bourdain as me. Anthony Bourdain, you only getting Anthony the earrings, that's it. I'm just saying like the New York accent. Well, I'm just saying that that I, I",
      "start": 167.88
    },
    {
      "text": "no doubt, no doubt, no doubt. Cool. I still like Anthony Bourdain as me. Anthony Bourdain, you only getting Anthony the earrings, that's it. I'm just saying like the New York accent . Well, I'm just saying that that I, I don't see it personally, but I also don't see when people tell me I look like my mom, so it's like, it's like, you know, people have, multiple people unrelated to each other, half dozen have been like, you look like Anthony Bain. See, I'm trying to go skew younger. Who could play young versions of us? But I don't watch any of the MTV shows, so like, yeah, I couldn't do. I know Stephen Lunsford from Teen Wolf. He's a fan of ours . That's the only reason I know him. No offense to him. He's on Teen Wolf. He's on the MTV Teen Wolf show and he likes the show. He's a big IGN fan, watches all the content, watches us, assuming he watches this, too. We'll know soon enough if he tweets about this. That's funny. Mispronounce his last name, but get on something other than Team Wolf. Yeah, I don't, I don't know. I just don't know enough about",
      "start": 212.32
    },
    {
      "text": "this, too. We'll know soon enough if he tweets about this. That's funny. Mispronounce his last name, but get on something other than Team Wolf. Yeah, I don't, I don't know. I just don't know enough about about actors. Stephen, like I'm sure that there's like some obscure Michael Rosenbaum could play you well. Who's that? Lex Luther from Smallville, but now imagine with, don't just write him off cuz he, he shaved his head at Smallville. Okay. Um, yeah, I don't know. All right, it would be great if someone like, uh, someone really handsome played me. Well, sure, it just be a lie, but that's what movies are usually. Coulson, Greg Clark, that could be you. Okay, that's it. Well, thank you for your time, Colin and Nick. Thanks so much. Uh, Albino Asscheek, good question . Ladies and gentlemen, in the comments below, let us know who should play us in a TV biopic movie, then leave your topic for future conversations with Colin down there as well, then like the video, subscribe to the channel and share us with your friends. It means a lot to",
      "start": 252.2
    },
    {
      "text": "play us in a TV biopic movie, then leave your topic for future conversations with Colin down there as well, then like the video, subscribe to the channel and share us with your friends. It means a lot to us and until next Tuesday or Thursday, have a conversational day. If I had it, I'd give him $10 million, make cler, make, make a huge return on that.",
      "start": 295.8
    }
  ]
}
