{
    "id": 153,
    "video_id": "5R1ywuQyHKI",
    "show_name": "Gregway",
    "hosts": [
        "Greg Miller"
    ],
    "title": "Beer Is the Best - Gregway Episode 21",
    "description": "Beer -- it's what's for dinner.\n\nSUBSCRIBE/LIKE/SHARE\n\nLeave your questions for Greg in the comments and check back every Wednesday and Friday to see what he's saying.\n\nSubscribe to Greg's channel: http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nOur Merch Store is live: http://www.districtlines.com/gameovergreggy\n\nThe Vlog playlist: http://www.youtube.com/playlist?list=PLOlEpGVXWUVv1g9oZi6O95CwRHQd0ulT6\n\nSubscribe: http://www.youtube.com/user/GameOverGreggy\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy",
    "published_at": 1383310802,
    "duration": 313,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to a Gregway. Every Wednesday and Friday I take one of your questions from the comments on these very vlogs or a tweet you sent me on Twitter and I make a whole video out of answering it. I'm like, hey, what's up Gregway? Sometimes I bring in guests and you guys don't watch those episodes for some reason, which really hurts my feelings. Anyway, today's question comes from Jared. Jared writes in and says, your favorite alcoholic drink? Well Jared, I'll tell you what it is. It's one that's hard to find. It's called beer. You got to go get a beer somewhere. That's what. Here's the here's the story of Greg Miller falling in love with this funny thing called alcohol. I'm I'm going on this trip to France with all my friends in high school. We we had done, you know, it's like we're going to go on this France trip. It was a school trip. They tell you the whole time. This is this is the summer between my junior and senior year. You know, say everybody saves up their money and gets ready to",
            "start": 0.12
        },
        {
            "text": "to go on this France trip. It was a school trip. They tell you the whole time. This is this is the summer between my junior and senior year. You know, say everybody saves up their money and gets ready to go to this thing and they're all like, you know, don't drink. You we understand there's no drinking age or it's whatever it is in France. I forget. I don't care. That's how much I learned out of French class. Uh, you know, go there. Obviously those kids are going to be drinking. You're not allowed to drink. You guys aren't even 18 yet. Don't do that. We'll kick you out. Of course everyone drinks there though. It's what it's what you do. It's the horror. You wanted to go. You want to go to a foreign country and just break all the American laws. You know, so we go there and I remember me and my friend we'd be talking about it flying out there like what's oh man, what are you going to drink? What? I'm like, I'm going to I'm going to find out what my drink is like when I get there. I I want to discover. I",
            "start": 44.8
        },
        {
            "text": "we'd be talking about it flying out there like what's oh man, what are you going to drink? What? I'm like, I'm going to I'm going to find out what my drink is like when I get there. I I want to discover . I I need to find something I like and I was pretty sure it was going to be a martini and now I don't watched James Bond movies. I've only seen the one where uh Christmas only. I thought Christmas only came once a year. Like that's the only full James Bond movie I've ever seen and I didn't even want to see that. It just happened. I know it's supposed to be a bad one, but whatever. It's like I don't even care any anyways, it wasn't because of that. It was just like something about it sounded like that sounds like something I'd like. So we go to France, we're out there, we finally break away from chaperones, you go to the bar, order a martini and I remember drinking this thing and being like holy this is terrible. Like it just it was rubbing alcohol. All it was was it just just burned and didn't taste and for",
            "start": 76.08
        },
        {
            "text": "go to the bar, order a martini and I remember drinking this thing and being like holy this is terrible. Like it just it was rubbing alcohol. All it was was it just just burned and didn't taste and for some reason again, it's legal for youngans to drink there and I I don't know why I drink it. I'm like this is terrible. So what I do is rather than give it back to the bartender, I we my friends were playing pool. I put it in the ball return of the pool table. Don't know why. Don't know why I thought that was a good idea. I mean clearly the balls probably rolled down there, shattered, would have shattered the glass, somebody cut their hand. It wasn't like I was doing to be mean though or mischief. I was like I was just scared, but luckily there was a guy there, Mike, he was like, I'll drink it and he drank it. He didn't like either, but he's like committed to like drinking. I wasn't there to get I wasn't drinking to get like up. I was just like drinking to see what's drinking like. So I was like all right,",
            "start": 109.8
        },
        {
            "text": "it he didn't like either, but he's like committed to like drinking. I wasn't there to get I wasn't drinking to get like up. I was just like drinking to see what's drinking like. So I was like all right, Martini's out . I got to try something else. I started trying other trying to figure out other things. Nothing it was all terrible. My friends are doing like tequila sunrises. I'm like I don't even know no that's fine. Just it doesn't taste fine. That doesn't taste good. Finally I was like all right fine, like I'll try Heineken or whatever. I forget the glass came and they gave me the glass and they gave me the bottle of beer and I just took the bottle upside down like this and they was just pouring out and it was all head and like this girl next to me who clearly had been drinking way longer than I ever had in high school saying this is my first time. She's like no, she explains how to pour it. I I'm like this is okay. I can I think I this I think this might work for me and so then we went to another bar",
            "start": 148.96
        },
        {
            "text": "in high school saying this is my first time. She's like no, she explains how to pour it. I I'm like this is okay. I can I think I this I think this might work for me and so then we went to another bar and I tried to order a beer there that was something like 152 or something right? That was the name of it. I don't I'm sorry if 1712. I don't know what the beer is, but again, I'm doing this in broken French, right? Like I only have like what three years of high school French in my belt. I'm trying to do it actually two two two and like three weeks dropped out of French three way too hard. Don't suggest it, but I'm trying to do it and he starts pouring me 12 beers like to give me 12. I'm like no and I'm trying to wave him off and so we had like three beers pass those around that was fine and that's where I just discovered that beer was easier to drink that it was easier to order. You knew what it was going to taste like for the most part and then of course you get older, you go to college go and I drink",
            "start": 180.4
        },
        {
            "text": "just discovered that beer was easier to drink that it was easier to order. You knew what it was going to taste like for the most part and then of course you get older, you go to college go and I drink a lot of beer in college. Let me tell you what in there though. I'm just drinking, you know, or whatever. Give me a 30 pack of Stones, Keystone Light, give me a 30 pack. That's terrible beer. Natty Light. I really like Natty Light. Grant, you're buying the cheapest beer possible in college, right? If you don't know, let's see Jared, now you got a kid in your Twitter pick. You're probably old enough. You probably know what I'm talking about. Then you drink the cheap beer in college, but nowadays, you know, they I drink the craft beers, the local stuff San Francisco. I try to go to 21st Amendment. I go I just went on this thing, Brews on the Bay, drink all these crazy beers out on a battleship. It was awesome. Beer's delicious. Beer gets a bad rap. I think it's different now , but even growing up, you know, people talking",
            "start": 220.6
        },
        {
            "text": "this thing, Brews on the Bay, drink all these crazy beers out on a battleship. It was awesome. Beer's delicious. Beer gets a bad rap. I think it's different now, but even growing up, you know, people talking about people with a beer gut. I mean clearly I have that, but I also have Wing gut. So you you you you'll be the judge on which one wins out, but there's so much craft beer, there's so much different stuff. You got the IPAs, you got the Hops now , you got all these different things. Beer is fantastic. Best alcoholic drink beer. So what do you think ladies and gentlemen? What do you drink when you go to the bars or when you go to France and you're way underage? Let me know in the comments. Then make sure you leave your questions for future Gregways so I can read through them and say most of these suck, but I like this one and I answer them here in these videos. You like, you subscribe, you share because you are my friend and you know how much that means to me. Until next time, have a Greg day. Don't like it",
            "start": 254.08
        },
        {
            "text": "I like this one and I answer them here in these videos. You like, you subscribe, you share because you are my friend and you know how much that means to me. Until next time, have a Greg day. Don't like it. [Music] either.",
            "start": 288.8
        }
    ]
}