{
    "id": 2161,
    "video_id": "LDqqiut48mQ",
    "show_name": "PS I Love You XOXO",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "The PS4's Identity Crisis - PS I Love You XOXO Ep. 60",
    "description": "Thanks to Uber for sponsoring this episode! http://www.uber.com/drivenow\n\nIs it an indie machine? A triple-A monster? What's with the free to play stuff? Greg and Colin discuss and act like dummies. (Released 11.08.16)\n\nSubscribe! https://www.youtube.com/user/kindafun...\n\nGet you PS I Love You XOXO shirts and posters: http://www.kindafunny.com/store\n\nListen to today's artist here: https://www.youtube.com/watch?v=ggSfU84CsXg\n\nSubmit questions for the show here: http://www.kindafunny.com/psq\n\nGreg and Colin are back with a weekly PlayStation podcast. Catch it on YouTube and podcast services each and every Tuesday at 9 a.m. PT!\n\nFollow us on Twitter!\n\nGreg - http://www.twitter.com/GameOverGreggy\n\nColin - http://www.twitter.com/NoTaxation\n\nKinda Funny - http://www.twitter.com/KindaFunnyVids",
    "published_at": 1478624401,
    "duration": 7548,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to PSI Love You XOXO Episode 60. I'm one of your hosts, Greg Miller, alongside he only does everything. Call him Moriarty. Take a gander here at myself in the confidence monitor. There it is. Oh man, look at you. Tan as the day is long. I mean, I'm always tan. I got the olive skin. I don't go outside. But I'm very shiny today and I think it's because I've been moving about and kind of taking care of some errands. Because this is all we're doing today is this show. You know, so. Of course. Because we did Extra Life. Exactly, ladies and gentlemen. Thank you so much for your support with Extra Life. What a fucking weekend that was, huh? Of course, the community started streaming as soon as we ended Colin and Greg Live on Friday. And I am with 24 hours of Twitch.tv slash Kind of Funny Games here at the Kind of Funny Studios with the help of Nick, Tim, Kevin, of course, who went above and beyond being here nonstop. Colin, myself, Danny O'Dwyer, Alfredo Diaz,",
            "start": 0.0
        },
        {
            "text": "slash Kind of Funny Games here at the Kind of Funny Studios with the help of Nick, Tim, Kevin, of course, who went above and beyond being here nonstop. Colin, myself, Danny O'Dwyer, Alfredo Diaz, Ashlyn from that there Twitch. Everybody in there pitching out. Not to mention that as soon as we ended the community picked it back up, went for another 12 hours. So far, because this is an ongoing thing, you can still donate if you want to if you want to head to Kind of Funny dot com slash Extra Life. So far, we have raised for the Children Miracle Network and they're the ones to take care of all these different hospitals and take care of sick kids all the time, $74,000. More than $74,000 raised by both your kindness of donating to this great community, this great charity, and of course, how generous you all were with your time and the ability to go out and play stuff and give money, spend time with us, watch us on Twitch. So thank you so much. Team Kind of Funny currently in fourth place.",
            "start": 56.0
        },
        {
            "text": "you all were with your time and the ability to go out and play stuff and give money, spend time with us, watch us on Twitch. So thank you so much. Team Kind of Funny currently in fourth place. Not that that matters, but that's pretty cool. It does matter. And I want to say that that's $20,000 roughly more than we raised last year. So very good work out there, everyone. We appreciate that. Thank you so much. I saw that Greg's got a sort of racket going on. I didn't really notice this with I went I never really went to Kind of Funny or the Kind of Funny dot com slash Extra Life or whatever. And then I just went there to look at the numbers. It's just all funneling to Greg's name. It's not even funneling to the team because I... That's based on a decision last year. No, it goes to the team. I'm saying, but it doesn't go to like a thing where it's like pick your roster of people because that's what I did. Because I made my name. I'm like, oh, I like to raise $250, but here's a link to",
            "start": 97.0
        },
        {
            "text": "I'm saying, but it doesn't go to like a thing where it's like pick your roster of people because that's what I did. Because I made my name. I'm like, oh, I like to raise $250, but here's a link to everyone else. I don't really care. Yeah. I was like, Greg Miller, $20,000 raised. I'm like some chicanery going on. First off, it's $30,000. Some chicanery going on. No, it was the decision we made last year at Extra Life that we wanted everybody to go to one thing. We just wanted to make something to make funny. Yeah, but you keep doing the thing where you make fun of me and you're joking about it and then the audience takes it seriously and then suddenly I got a big ego and a baby dick. All right. I mean that... Ah, you son of a bitch. Last week, it's rare that I wade into the YouTube comments. So many of you are great at coming to me with the Twitter responses or I go to the boards to see what people think of the episode. I was in the YouTube comments yesterday or whatever, last week. So",
            "start": 137.16
        },
        {
            "text": "So many of you are great at coming to me with the Twitter responses or I go to the boards to see what people think of the episode. I was in the YouTube comments yesterday or whatever, last week. So many people thought that you were really genuinely hurt when I was like, I made you or whatever, when we were having this clearly tongue in cheek discussion. People are like, man, blah, blah. I mean, that's the way you really feel. Of course it's the way I really feel. It needed deep, deep dark in your heart. Oh my God, are you kidding? Of course. I read some of those comments. I look back all the time. I read some of those comments. I'm like, come on, Clayborn and say, come on podcast, Vyond. Yeah. What do you got that PlayStation expertise from a Nintendo expert? That's what you were at the time. That's true. That's a good point. Touché. I've been playing PlayStation for 20 years, but no, I didn't take it seriously. I did see the comments. It wasn't serious, but some people saying, it",
            "start": 171.5
        },
        {
            "text": "time. That's true. That's a good point. Touché. I've been playing PlayStation for 20 years, but no, I didn't take it seriously. I did see the comments. It wasn't serious, but some people saying, it might actually go the other way that without me, you would have no credibility in gaming, which is true. I mean, you can just look at the trophies, for instance, in the games we've beaten. Other than that, for instance, I play Titanfall on master difficulty. You play on normal difficulty. I play Battlefield 1 on hard difficulty. You don't even beat it. I play Doom. I don't beat it. I play Dying Light. I talk about how good it is. I never beat the game. Exactly. You have that big ass Uncharted 4 platform. Oh, that's me. That's right. That's me. In other words, rampant inconsistencies. Me. That any argument can be used against one, can be used against all. I mean, if you don't have context, then I can say anything I want and you'll believe it or the audience will believe anything I say. They",
            "start": 202.64
        },
        {
            "text": "argument can be used against one, can be used against all. I mean, if you don't have context, then I can say anything I want and you'll believe it or the audience will believe anything I say. They don't want to fact check. They don't care. Okay. Got to look at the hair sometimes. Just got to worry about being shiny. I got to work on my hair every so often. I am super shiny. My hair is getting a little out of control too, but I'm just, I'm going to the brink because I'll be gone the Thanksgiving week to go home. Introducing Aaron to the family and having some turkey and some ham and some big ziti pasta. The pasta is what's exciting. Oh yeah. Again, Thanksgiving, garbage holiday. Turkey and ham. I can eat that whenever, but I never do. You're a nut job. You're absolutely insane. Who amongst us can look at, you're like, so I was watching that Walking Dead with you last night a little bit. I was reading the politics. You asked for the television. I was like, I, you know, I very nobly and,",
            "start": 247.68
        },
        {
            "text": "us can look at, you're like, so I was watching that Walking Dead with you last night a little bit. I was reading the politics. You asked for the television. I was like, I, you know, I very nobly and, and, and you know, selflessly gave you the television that I own in my living room and you know, my lease on the, you know, my name on the lease. But the thing about it is that there's a king in this that's not really, that's not, he's kind of full of shit. Yeah. And that's kind of like you with team fat because who amongst us, who amongst us would declare, see, this is what I declared about Thanksgiving week. Okay. That I'm on a low carb, high fat diet, right? Yeah. High fat, team fat, high fat diet. Now what I said, what I said, okay. That's a stroke of genius for your campaign. What I said, what I said about Thanksgiving week is that it will be a high fat, high carb diet. You're sitting over here saying Thanksgiving. Who says that? I'm just saying, there's a whole game over a Greg E.",
            "start": 290.66
        },
        {
            "text": "what I said about Thanksgiving week is that it will be a high fat, high carb diet. You're sitting over here saying Thanksgiving. Who says that? I'm just saying, there's a whole game over a Greg E. Show topic about this. It's the same thing. It's Groundhog Day of food over and over and over again. Not in the Moriarty house, but we're going to fucking eat like kings and queens. No, I know, but I'm sad, but it's the same food. The ziti I'd be excited for. And why would I be excited for the ziti? How about the antipasto? Cause it's new. I'm a little gabba ghoul. What do you been playing? Pretty much nothing except for Titanfall two. Right. I've been messing a little bit with Tetris ultimate. I had a heartbreaking moment in Tetris ultimate a few days ago, but it's really not important. What's Tetris ultimate? The game that came out two years ago. I played it all the time. So I'm going to play a Tetris game that's bright because of the friendship. I was signed in on Aaron's console. Well, I",
            "start": 339.26
        },
        {
            "text": "ultimate? The game that came out two years ago. I played it all the time. So I'm going to play a Tetris game that's bright because of the friendship. I was signed in on Aaron's console. Well, I was signed into myself on Aaron's console playing Tetris ultimate. To get endless mode, you have to beat marathon mode and it's really hard. And I fucking beat it. But because I was the guest, it didn't unlock. That game is full of problems. I was like, what the fuck? I was actually feeling like you could see Aaron was like crestfallen because we've been trying to unlock this forever. And it's really fucking hard. Isn't it? Is it to 30 or level 30? It's level 15, but it's heinous at level 15. No, no, I know. And I was like, are you fucking kidding me? Are you kidding me? Yeah. The trophy is also in that game. I was looking all of them 0.1 or 0.2% rarity, except for two of them, which I have. Anyway, Titanfall two is what I played. I beat it last night, late last night on a master difficulty. So",
            "start": 380.18
        },
        {
            "text": "that game. I was looking all of them 0.1 or 0.2% rarity, except for two of them, which I have. Anyway, Titanfall two is what I played. I beat it last night, late last night on a master difficulty. So the hardest difficulty. So I had a little bit of a slower experience than a lot of people did. I think that the gunplay is great. As I said on Twitter, I think whenever I got into a Titan, I was disappointed. I don't like being in the Titan. I think the game feels too good when you're on foot. I understand that's the hallmark of the game. I also will defer to you on Titanfall expertise and the multiplayer because I've never played Titanfall until this game. I feel like there are certain games that I think do first person parkour and first person movement like really well. I think Dying Light is one of them. We mentioned that before. I think that this game does it well as well. But I really I realized that I just don't like playing first person games where I'm jumping around like a moron",
            "start": 417.18
        },
        {
            "text": "is one of them. We mentioned that before. I think that this game does it well as well. But I really I realized that I just don't like playing first person games where I'm jumping around like a moron because you don't have you don't have any feeling of where you are. Yeah. Like I just and the game I think is very forgiving because of that. I see I'm like I'm I'm beaten to death. I want to get to how where you come down because obviously last week on PS I love you XO. So I talked about not seeing why this was so amazing early on in then on the games cast later in the week. I did a whole topic where I've beaten in. Here's what I think. And I came I stand by that I just don't think the single player is that amazing that it's doing anything spectacular. Fun game. I enjoy the game that people are taking this all out of context on Twitter for me. But I do like I've always liked the wall running. I think I like it more than I liked it in the original Titanfall here in Titanfall to running",
            "start": 453.18
        },
        {
            "text": "are taking this all out of context on Twitter for me. But I do like I've always liked the wall running. I think I like it more than I liked it in the original Titanfall here in Titanfall to running along the walls jumping here and there. I think the fact that it is more forgiving makes it more fun in the way of that. I like the ability that if I see a ledge I can jump my way up to and grab it where it's always been such a pain. I'm even right now playing Call of Duty and granted in Call of Duty there are jetpacks again. You are running on walls. It is taking a lot of things from Titanfall's playbook. But there was a part today where I was going like oh there's a ledge and I got to it and then just slid down the wall. Motherfucker. Reach your hand out super soldier man do it. Yeah I haven't played Call of Duty yet. I'll get into that this week and I'll have impressions on that probably next week. I'm looking forward to it. So my feeling on Titanfall 2 is that it's good. I think it's",
            "start": 490.18
        },
        {
            "text": "played Call of Duty yet. I'll get into that this week and I'll have impressions on that probably next week. I'm looking forward to it. So my feeling on Titanfall 2 is that it's good. I think it's very good. I think it's fun. But this is the thing. So on the games cast I talked about the fact that I'm not the first person shooter connoisseur. For me they're once in a while a fun game I get into and then I get out of. So I don't have the breadth of knowledge to sit down and say oh my god this campaign is so much better. But when I was playing it I did not see why people are so fucking crazy for it. You? Same. Because you are Mr. First Person Shooter. Yeah I love shooters. I mean this with all due respect but the hyperbole about this game's campaign is through the fucking roof. It's a good game. It's a great game maybe. Everyone's talking. When I went into it with expectations everyone's really talking this game. I'm like what are you talking about? When I finish the game I'm like I",
            "start": 524.18
        },
        {
            "text": "game. It's a great game maybe. Everyone's talking. When I went into it with expectations everyone's really talking this game. I'm like what are you talking about? When I finish the game I'm like I won't even think about this game a year from now. No offense but the gameplay is fun. The gunplay is good. I like the diversity of guns. I really like that shotgun. There's some pulse rifles and some good sniper rifles. The enemy AI seems not very good. And I was playing it on the master difficulty. I was going to say that's the same on master difficulty. The game has ridiculous spikes. That is on master difficulty. Specifically in boss fights. The fighting with Viper was ridiculous on master difficulty. Like so obnoxious. Way like ten times harder than the last fight. The problem I have is, well I have a few problems. One problem is that the game's campaign introduces these villains that mean nothing. So like you have this fodder, this ability to make an interesting Metal Gear Solid like",
            "start": 562.18
        },
        {
            "text": "I have a few problems. One problem is that the game's campaign introduces these villains that mean nothing. So like you have this fodder, this ability to make an interesting Metal Gear Solid like cast of characters. And they introduce these people and they start talking like oh you seem really cool. I hope I don't learn any more about you. No they're just these avatars talking on the screen then they show up and you fight them and kill them. I don't even know who the fuck the last boss was. Like when I was fighting I'm like what is the significance of this person? I've never even heard of this person. Now maybe I'm not paying close enough attention because I was like halfway through the plot I'm like I'm not even really sure what's going on. Maybe it's because I'm just not paying attention and I don't really care. And that's on me. But there was a, I like, that's why I like Mega Man. I talk about it a lot. That's why I like Castlevania and Metal Gear. The diversity of the enemies. I",
            "start": 603.18
        },
        {
            "text": "and I don't really care. And that's on me. But there was a, I like, that's why I like Mega Man. I talk about it a lot. That's why I like Castlevania and Metal Gear. The diversity of the enemies. I like these groups of enemies that are interesting. And then like one guy that's Wily or... Sure he's in charge of them all. Yeah, or whoever. Liquid or whatever. In this I'm like I don't even know what the hierarchy of these people are. I have no idea what their motivation is. They all have cool titans and they all use, one is kind of like a Ronin type titan, one is a North Star type titan. Exactly. To get you introduced for what you're supposed to do. And I get that too. And that's the thing about it from what I'm talking about. Is the fact that even with the... I did one good night of Call of Duty and then an hour and a half today. Maybe an hour today. You know what I mean? And that's spaced out a while. That's pretty much launch night or whatever and then today which is Monday. I jump",
            "start": 637.18
        },
        {
            "text": "of Duty and then an hour and a half today. Maybe an hour today. You know what I mean? And that's spaced out a while. That's pretty much launch night or whatever and then today which is Monday. I jump back in and I'm like okay I remember exactly what's happening here. We're being invaded. Jon Snow's the bad guy. This guy doesn't like my robot companion. I know these characters. I'm interested in their interactions. I'm way more invested in this campaign than I ever was in Titanfall. Yeah it's a strange... It's strange. I mean that's not the game because I think the game is well above average in terms of shooters. And I think... I don't think it's... I'll say right off the bat I think Battlefield 1 is a much better game than Titanfall. And if I had to recommend one or the other from the EA slate I would absolutely recommend Battlefield 1 ten out of ten times. And I have not played the game online yet. I don't really care about that. I'm talking about story. DICE really did something",
            "start": 674.18
        },
        {
            "text": "EA slate I would absolutely recommend Battlefield 1 ten out of ten times. And I have not played the game online yet. I don't really care about that. I'm talking about story. DICE really did something special. Even though the gameplay is very different. One's very grounded. One's not very grounded. So I just... Would I recommend the game? I don't know. I wouldn't recommend it based only on the single player campaign because I feel like... If you're playing on normal difficulty that game is probably over in what? Six or seven hours? I mean I couldn't imagine it taking longer than that. It took me ten or twelve on Master at the most. And I have almost all the collectibles. I'm going to go back and farm. I'll probably get the platinum if I can. There's one trophy in there in particular that's apparently a pain in the fucking ass. And I don't know if I'm going to be able to do it. Because I'm not that good at the movement. And part of it is on me too because I kept forgetting... I think I",
            "start": 713.18
        },
        {
            "text": "apparently a pain in the fucking ass. And I don't know if I'm going to be able to do it. Because I'm not that good at the movement. And part of it is on me too because I kept forgetting... I think I made the game harder than it was supposed to be for myself as well. And I don't think it was very hard. Battlefield... Both Battlefield and this game on their hardest difficulty levels were just not that hard. Compared to veteran Call of Duty. And I'll see. It's the same thing as always. What we were talking about before. You go around the corner, you get shot. There's a guy there. Yeah, you just have to be patient. And there were times where I was running through the game for twenty minutes or twenty-five minutes at a pot without dying. But to me I feel like... I just feel like that you can make yourself kind of invisible and all those kinds of things. I wasn't really using that very often. That was the thing. When you use that, everything's going so easily. You're in Titan and there's",
            "start": 743.18
        },
        {
            "text": "make yourself kind of invisible and all those kinds of things. I wasn't really using that very often. That was the thing. When you use that, everything's going so easily. You're in Titan and there's just all these different options. I'm just like, I don't know. I kind of went towards the tone. Titan and then I was using Ronin a lot depending on the boss fights. I just felt like there was a lot more potential here for the narrative than was realized. And I thought that was disappointing. The one cool thing I think that the game did amongst a lot of cool things that I think the game did was that the game has a sense of scope. The world is big. The maps are huge. And there are long periods where you're not fighting. And I think that that's kind of cool because it gives you a feeling of realism, I guess, or groundedness in terms of there aren't literally going to be enemies everywhere. And sometimes there's going to be quiet moments. The relationship between BT and the pilot didn't",
            "start": 781.18
        },
        {
            "text": "realism, I guess, or groundedness in terms of there aren't literally going to be enemies everywhere. And sometimes there's going to be quiet moments. The relationship between BT and the pilot didn't resonate with me at all. I don't care. Someone said this to me on Twitter. I don't know who it was, so I don't want to steal your thought. But I do agree with what this person, he or she was saying, which was there seems to be, and I mean this with all due respect again, there seems to be a great desire for this game to be better than it is. And that a lot of it has to do with Call of Duty hatred. And I agree. So not having played Call of Duty, because I don't know how it is, whether it's good or not, I watched you play it a little bit. I'm like, I've seen enough. This looks awesome. And I'll be able to judge that against Doom, against Battlefield 1, because this has been a good year for single player centric shooters. And next year we're going to get Wolfenstein. Oh my God, it's going to",
            "start": 819.18
        },
        {
            "text": "be able to judge that against Doom, against Battlefield 1, because this has been a good year for single player centric shooters. And next year we're going to get Wolfenstein. Oh my God, it's going to be great. But I just feel like there's more to this than meets the eye in terms of why people are rooting for this game. Now, I'm not disrespecting people's ability to like it or love it. If you do, that's great. I love games that people hate, and that's great. Naughty Bear. But, you know, so I respect that there's nothing objective about it. It's a subjective kind of thing. But having been in this industry for a long time, having played many, many, many, many, many games over three decades, having, or nearly three decades, having a lot of love for this particular genre, this is nothing more than an above average shooter. That's what I said in the Gamescast. It felt like one of those mid-tier shooters you'd get. And when I say mid-tier, I mean it's a shooter that's a 7.75, whatever. It's",
            "start": 868.18
        },
        {
            "text": "than an above average shooter. That's what I said in the Gamescast. It felt like one of those mid-tier shooters you'd get. And when I say mid-tier, I mean it's a shooter that's a 7.75, whatever. It's good, yeah, of course. But, yeah, you're not sitting there thinking about it later on. There aren't these, again, I'm early, within three hours, we'll say, give or take, in Call of Duty, right? But I feel like already, I'm playing through that, and there's like, no spoilers, really. This isn't a spoiler. But I get to the moon. What? We start going into this shootout, and it's like, you know, it's this port in between all these different planets, right? And so you go into this one, and I'm going through looking, and I'm in this museum cataloging the exhibits of what the progression of our space program in the moon was. And I'm there, and they have the original lander over there, the original space suits, and then there's this totally fictionalized timeline on the wall, and I'm reading it",
            "start": 889.18
        },
        {
            "text": "program in the moon was. And I'm there, and they have the original lander over there, the original space suits, and then there's this totally fictionalized timeline on the wall, and I'm reading it all, watching. And then you go, and here's the rover that would have been used in 2020 or whatever the hell. And I'm like, this is fucking dope. This is awesome. This environment resonates way more with me than in Titanfall 2, the house that's being built on its side that you're jumping through. I'm like, that was cool, but it didn't matter. Yeah, I agree. And I will say that in between the second to last fight and the last fight in the game, I think actually falls apart. I think that it, maybe not falls apart, but becomes strange. I don't understand why, especially the post-boss fight thing, I'm like, what the fuck is this? This isn't what you want to do after a climactic battle. I don't know, I just feel like it's an above average game. It's good or great, depending on how you look at it.",
            "start": 939.18
        },
        {
            "text": "like, what the fuck is this? This isn't what you want to do after a climactic battle. I don't know, I just feel like it's an above average game. It's good or great, depending on how you look at it. It's just like, I'm seeing this game get this lavish praise, and I'm like, I don't quite understand where this is coming from. And I say this with all due respect as someone who is looking for shooters of all types to resonate with me. I didn't expect to love Doom the way I loved it. I didn't expect to love Battlefield the way I loved it. And I went into Titanfall, and I think, reading the reviews and seeing everyone's impression, I'm like, oh, this is going to be great. And I'm like, I mean, it's certainly not a nine. I agree. So maybe the multiplayer really sells it on a few people on it. Well, that's all back to the games cast to boil it down, is I think multiplayer is a miss for what I wanted out of multiplayer. As a Titanfall 1 fan who was excited for Titanfall 2, was excited for it to",
            "start": 988.18
        },
        {
            "text": "that's all back to the games cast to boil it down, is I think multiplayer is a miss for what I wanted out of multiplayer. As a Titanfall 1 fan who was excited for Titanfall 2, was excited for it to come to PlayStation, three trophies, these modes that are fine, but nothing's blowing me away. And then all people want to talk about is the single player. It's very weird. Yeah, so if you like it or love it, more power to you. I think that's fantastic. You got your money's worth. I just feel like I can't necessarily recommend it wholly based on the campaign alone if you want to spend $60 on the game. I might be worth $30 down the road. Yeah, exactly. And considering that it's apparently selling not very well, it'll probably be $30 or $40 before you know it. Before you know it. So yeah, I'm sorry that that this is the thing that I said on games cast and I think it's important. I can't speak to the multiplayer and I'm not going to. I don't have any expertise in that like you do. To Respawn's",
            "start": 1034.18
        },
        {
            "text": "that that this is the thing that I said on games cast and I think it's important. I can't speak to the multiplayer and I'm not going to. I don't have any expertise in that like you do. To Respawn's credit, this is their Titanfall 1 with a campaign. This is Titanfall 2 with the multiplayer because that was what they were working on. They turned this game around very quickly. So in like two and a half years. So that's a really short amount of time considering they're also working on another game. So there could be some. I'm not trying to make excuses for that. I'm just trying to give them the benefit of the doubt. And it's no less than good anyway. I'm not trying. But I'm just trying to like. You don't have to temper expectations when everyone's talking about how it's one of the great games they are. No, not even fucking close. Are you kidding me? I keep getting tweets like Jim Sterling or somebody will say how even like Lucy O'Brien tweets that she's really enjoying it. Somebody",
            "start": 1074.18
        },
        {
            "text": "games they are. No, not even fucking close. Are you kidding me? I keep getting tweets like Jim Sterling or somebody will say how even like Lucy O'Brien tweets that she's really enjoying it. Somebody responds with me. Well Greg hated it. I'm like I didn't hate it. That's not at all what I said. There's a nuanced argument happening here. I don't think it's nearly as good as anybody saying it is. But it was fun. It was fine. I'm glad I played through it. No, and I can rattle off a ton of shooters the last three or four years that are better. I'm excited for you to play Call of Duty. I've been playing Call of Duty. I really like the story so far. I really like the characters. The guns feel good because it's Call of Duty and stuff. I like where that's going. It'll be interesting. I think we're within striking distance of Watch Dogs 2. When that comes out, that's more of a game for me in terms of a third person. I'm going to run around San Francisco and do open world shit. If that can take",
            "start": 1107.18
        },
        {
            "text": "within striking distance of Watch Dogs 2. When that comes out, that's more of a game for me in terms of a third person. I'm going to run around San Francisco and do open world shit. If that can take me away from Call of Duty, I'll be interested. I'm skeptical. Oh, me too. No, I mean we I played Call of Duty. I'm not skeptical of that at all. I'm skeptical of Watch Dogs. No, me too. I mean we played Watch Dogs 2 at that event. We ran around San Francisco and fucked off and it was great. And I had a lot of fun. And it was really one of those games for me where I was like, oh man, like this is this is akin to like one of me and Justin Davis did like GTA 5 at 5 where we just ran around and fucked around how much fun that was. Will the campaign, the story live up to that? Will unlocking these abilities I'm using work out? Will I ever use these abilities or will it just be me fucking ghost riding cars and standing on top of things and stealing bikes? Ghost rod the whip. Ghost rod the whip.",
            "start": 1138.18
        },
        {
            "text": "abilities I'm using work out? Will I ever use these abilities or will it just be me fucking ghost riding cars and standing on top of things and stealing bikes? Ghost rod the whip. Ghost rod the whip. We'll see. Now, Colin. Yes. The big thing we played during Extra Life was Overcooked. Yep. I got you your gold trophy. You didn't get me. You helped me. I got you a gold trophy. You guys couldn't do with your other friends so you had to get me in there. We just ran out of time. Always got that kid. He's got that kid. Always yak yak yakking over here. Great game. What a great game. Better than Titanfall 2. 100%. Are you kidding me? Overcooked way better than Titanfall 2. All due respect. All due respect. Fabric of my being. Overcooked one of the best games of the year for sure. I agree. I would say I would say top top 10 for sure. Top five probably. You know, for sure. Yeah. I mean, like so much fun. You and I have a great time playing it. We don't like multiplayer stuff, but working on",
            "start": 1158.18
        },
        {
            "text": "say I would say top top 10 for sure. Top five probably. You know, for sure. Yeah. I mean, like so much fun. You and I have a great time playing it. We don't like multiplayer stuff, but working on those things, trying to figure out losing around, not getting the three stars and sitting there and be like, what can we do differently? How do we do? And I feel like it's fair. That's one of the cool things I like about it. The three stars are achievable. It's never like it might just be out of grass, but it's never like I just played that flawlessly. And you know, you screwed up. You know what you did wrong. You know how you can fail. I really like that. Yeah. The interesting thing is that we got to jump in and play a loss morsel. We played through what I assume is all of it. It was one world, a bunch of levels, no trophies. And then when it ended, it just ended. There was no, you did this, no cut scene, no nothing. It's on a retail unit. Right. So that's the gotta be it. I, it was weird.",
            "start": 1216.18
        },
        {
            "text": "a bunch of levels, no trophies. And then when it ended, it just ended. There was no, you did this, no cut scene, no nothing. It's on a retail unit. Right. So that's the gotta be it. I, it was weird. It was six stages. They were harder than the game, the normal game, I would say. Yeah. They ramped way more quick. That was the thing. And we did get three stars on all of them, 18 stars cumulatively, but yeah, never, never, no trophies popped. Which would happen even if the trophies aren't alive, by the way, you just won't be able to see them. Yeah, exactly. And, but they would live on your console and yeah, there was no indication from onion man that the game was done. There was no ending. There was no other island. I don't know. I was, I was a little confused by it. I was a little disappointed. I hope that's not, that's not it. It doesn't seem like it fits. It just seems. And that's the thing. I'm looking back here. We haven't had time. Obviously we were so busy with the extra life. I'm",
            "start": 1245.18
        },
        {
            "text": "I hope that's not, that's not it. It doesn't seem like it fits. It just seems. And that's the thing. I'm looking back here. We haven't had time. Obviously we were so busy with the extra life. I'm seeing if I have anything in here, if it says how many levels there was, because maybe that was the thing. Maybe it was just preview DLC, but I've never heard of that. That's never happened. Where, Hey, you have a retail game. Here's a code for DLC preview. That isn't final. That isn't doing this. So we got here, overcooked DLC. Nope. That was it. Six brand new levels featuring an all new thing. The possibility is that the original game needs to be patched to accommodate this game in a more intimate way. But that would be weird too. According to this, it isn't six brand new levels featuring an all new theme, a desert island world, six brand new wacky chef's Dunlop, which we did. That's disappointing. Cause I could use more. I could totally, they should totally put more in and put more",
            "start": 1274.18
        },
        {
            "text": "an all new theme, a desert island world, six brand new wacky chef's Dunlop, which we did. That's disappointing. Cause I could use more. I could totally, they should totally put more in and put more trophies out every time. Put on DLC preview. Not every time. Put on DLC pack here and there. Really great. If you're listening, overcook do it. What the fuck man call for jump in the show. I need to go through the housekeeping again. Thank you for extra life. Fourth place, 74 thousand dollars. It is important, but I don't want to make it important. You know what I mean. I want to point out the most important part of it. That PSX is happening. The PlayStation experience is happening December that first weekend. That Sunday we will be there at noon. We will be doing PS. I love you. XOXO live from PSX Sunday at noon, twelve four. That's December fourth for somewhere else. You don't understand that. No, it's not April twelfth. If you're in the UK now, here's what I want. Colin. I think I've",
            "start": 1303.18
        },
        {
            "text": "PSX Sunday at noon, twelve four. That's December fourth for somewhere else. You don't understand that. No, it's not April twelfth. If you're in the UK now, here's what I want. Colin. I think I've invented a new segment for the show leading. That's what we really need is another new segment. It's called the PSX profile of the week. Okay, this is where because leading into PSX. This is when the indies hit you up. And they say, we're coming to PSX. We're bringing our game. You know what I mean? And we never have time to go see them all. Right. So we have time to talk about him. Right. This guy hit me up today with his game and I want to talk about it. However, this is his email in full. You read it quietly. It doesn't say anything in there. Like don't talk about this yet or that this is a surprise announcement. This game has been announced for awhile. I was unaware of it. I wasn't sure if you're aware of it, but I hit him back and I was like, cool. Can we get a build of this game? Do a",
            "start": 1353.7
        },
        {
            "text": "announcement. This game has been announced for awhile. I was unaware of it. I wasn't sure if you're aware of it, but I hit him back and I was like, cool. Can we get a build of this game? Do a let's play. And can I talk about on PSX? I'm not going to response, but I don't think it. I don't see why he wouldn't want people to know he's a PSX, right. It seems makes sense to me. You're sending out a press release. I think it's an embargo. You can risk breaking interesting case, Greg, if you wanted to. So ladies and gentlemen, this is PSX profile a week where we tell you about a game coming to PSX that you should go see today. I want to talk to you about at heart. I'm sorry. No heart. Fourth Alicia Colin. Have you been aware of heart for Alicia? No, it looks. It looks. What sounds I got a trailer for you that I'm going to. I'm actually going to do some B roll for PS. I love you, which I never do. So I'm going to put my little notes down here. 2406. Here's the description off the official",
            "start": 1383.7
        },
        {
            "text": "for you that I'm going to. I'm actually going to do some B roll for PS. I love you, which I never do. So I'm going to put my little notes down here. 2406. Here's the description off the official page at heart and heart for the leashes. Core is an O to the classics. Remember the electrifying gameplay of Castlevania, Symphony of the night. Yes, the devious dungeons of the Zelda series and the rich, engaging story of Xenogears. This is a game that was born out of those experiences. It's a nineties inspired Metroidvania RPG about a wizard on her journey to end heaven in break free from its grasp, featuring epic adventure that combines the timeless 16 and 32 bit gameplay, modern mechanics and a complex intertwining narrative to take you on a fantastic journey. This is being developed by Alonzo Martin in Mexico City, Mexico platforms, a whole bunch, but most importantly PlayStation 4 and Vita. And Vita. Nice, because it's just PlayStation 4 on that. There. Oh, well, this is their fact",
            "start": 1416.5
        },
        {
            "text": "Martin in Mexico City, Mexico platforms, a whole bunch, but most importantly PlayStation 4 and Vita. And Vita. Nice, because it's just PlayStation 4 on that. There. Oh, well, this is their fact sheet, which I know, but it says that's what that concerns me. If it doesn't say it. No, no, it says, oh, I guess they're all bringing in all new games. exclusive PS4 demo, but they don't mention it. That's on Vita PSX. Why not? Hold on. So this is the email then that we got here. This is from Logan, who's their marketing. We're going to the end of the Metrovania RPG heart for Alicia. Want to reach out to her for things? Yeah, I think they're here. They're saying they're bringing an all new exclusive PlayStation 4 demo. I understand that. That's on Vita, but that's confusing. We're bringing an all new PlayStation 4 demo that could also be on the Vita, but isn't on the Vita. Just say hard for the leash is coming to PlayStation 4 and PlayStation Vita in 2017. Well, they don't have that",
            "start": 1472.92
        },
        {
            "text": "an all new PlayStation 4 demo that could also be on the Vita, but isn't on the Vita. Just say hard for the leash is coming to PlayStation 4 and PlayStation Vita in 2017. Well, they don't have that information. I mean, I didn't put any of that kind of information on here and then over here on their little fact sheet. It says release date 2016. I'm not confident in that. This is a game. I just found out about today that was kickstarted a long time ago. I went to their wet their blog. Their blog hasn't been updated in awhile. There's a lot of things going on here. Oh, you almost got up. You almost nailed them, but ladies and gentlemen, if you're going to PS, X and Anaheim this December, I suggest checking out heart forth. Alicia seems very cool. I'm glad you liked it when I because when I saw it, it looked like something you'd enjoy, but then when they're like Metrovania RPG sounds like something I enjoyed well, bringing everything together. So it looks great. All right, the trailer",
            "start": 1522.92
        },
        {
            "text": "I saw it, it looked like something you'd enjoy, but then when they're like Metrovania RPG sounds like something I enjoyed well, bringing everything together. So it looks great. All right, the trailer looks great. So everybody check that out again. The trailer, hopefully, if I edited the show right, was running during that and everything's fantastic. And if you are Alonzo Martin in Mexico City, Mexico, who made that game and I just broke your embargo, sorry, your emails need to be more clear call. Let's start the show with what is and forever will be Ropers report for some singular possessive news. It's all my hair. There are sixteen items, a baker's dozen number one knob switch is coming to PlayStation Vita and is due out on November twenty second. That's it. That's up in the news. A game we invented in the in the privacy of the podcast beyond recording studio. Oh, so long ago is actually coming to PlayStation Vita. Yep. Knob switch knob switch. Scott Rody made a sound shapes level.",
            "start": 1551.6
        },
        {
            "text": "we invented in the in the privacy of the podcast beyond recording studio. Oh, so long ago is actually coming to PlayStation Vita. Yep. Knob switch knob switch. Scott Rody made a sound shapes level. This, of course, goes back to when we were making fun of games names and I said, well, you just take a doorknob, take a light switch knob switch. I made a game name. Here we are years later. God only knows how long Mitchell Morgan probably knows, but nobody else does. Here we are. Knob switches a real game coming out next week. Yep. That's insane. It does not look like it does not look like a game I can play. Looks like a game that I might be able to play. It looks like it looks at you guys can go just look it up. I like you know, it's it's a unique game. I can be for everyone. I don't think might not be for anyone. I have no idea. I just thought it was funny that it exists. You can look up the trailers, Google it. People are the guy tweeted at us, too. I said that this was a stroke of",
            "start": 1609.6
        },
        {
            "text": "might not be for anyone. I have no idea. I just thought it was funny that it exists. You can look up the trailers, Google it. People are the guy tweeted at us, too. I said that this was a stroke of genius on his part because he knew we would have to talk about it. Yeah. So there's no way around it. Yeah. So I wanted to put it up at the number one. Number one. So PlayStation Vita game. Yep. So we're gonna make it trend and talk. It'll be the new Taco Master. We're getting it on the if it's good. I'm not going to pay knob switch if it's not good. I'll be the judge of that turns and you decide what notes, what note. As long as I wonder how much it's going to cost, as long as there's video tutorials to get me my trophies, I'm fine. OK, because I'm not going to sit there and try to learn notes myself. I suspect there will be no video tutorials to get you an opposite show. You don't think Brian over a PS four trophies, going to get a bigger fish fry right now. He want. I'm telling you right",
            "start": 1647.64
        },
        {
            "text": "myself. I suspect there will be no video tutorials to get you an opposite show. You don't think Brian over a PS four trophies, going to get a bigger fish fry right now. He want. I'm telling you right now, I'm putting in the request for the trophy video for that. All right, Colin. Yes. Join me as we go down a little bit of a rabbit hole. You ready? Yes. Jose Luis Casillas writes into kind of funny dot com slash PSQ just like you can. It says hi guys. So first they announced knob switch and now we get a my name is Mayo game. What will be the next game inspired from one of your ideas? Love you guys. Jose Luis concealers now are you familiar with this? My name is Mayo game. Yeah, I saw it on the job. Is it coming up later? OK, so yeah, it'll come up later. OK. I don't I'm not sure. I mean, I think I was going to ask you guys about it. I'm not going to ask you guys about a game that you guys like. You guys are going to have a chance to see a game called N. You guys are going to have a",
            "start": 1678.2
        },
        {
            "text": "I think I was going to ask you guys about it. I'm not going to ask you guys about a game that you guys like. You guys are going to have a chance to see a game called N. You guys are going to have a chance to see a game called the N. That you guys are going to have a chance to see. I'm not going to have a chance to see. I'm not going to say it. So what do you guys think is going to happen? You guys are going to have a chance I don't think we can take credit for my name is me. No person. I mean we could we could and actually this be you you take credit for that. I'll take it. I don't switch my you know what I'm going to take right. Okay, you made me. I made knob switch. What's the next game that we need happens from our idea? I think it's pretty simple, some kind of water man game, the water man, just the water man. Yeah, the water man. So if you're a developer out there and you want to make a game, you have a permission to make a game called the water man. Now we can workshop it for",
            "start": 1701.6
        },
        {
            "text": "man, just the water man. Yeah, the water man. So if you're a developer out there and you want to make a game, you have a permission to make a game called the water man. Now we can workshop it for them. We start charging you know on terms of what it's going to be vita exclusive. I feel like it's a survival horror game. I feel like you're hiding from them. I feel like it's like that baby game, but it's better than that baby game. What's the baby game? The baby where you were the baby in the crib and your mom might get murdered and you walk around the teddy bears all creepy. Never something by sleep or sleep. Yeah, that's it. Yeah, something alone. Sleep sleep alone. Sleep. I was gonna say birth by sleep. That's the parts. That's not good either. Yeah, so now we're gonna go down to another question. You ready? Yes, this one comes from Ted. He says greetings. Greg and Colin. I was checked. I was checking exo days as I do every day when I stumbled across a game called my name is male on",
            "start": 1744.56
        },
        {
            "text": "question. You ready? Yes, this one comes from Ted. He says greetings. Greg and Colin. I was checked. I was checking exo days as I do every day when I stumbled across a game called my name is male on the vita and PlayStation four two separate trophy lists, each with a platinum after a quick google google search google. I found that you can obtain the platinum in an hour. Plus it's super cheap. Of course I'm buying this as soon as it shows up Tuesday. If this had 12 bronze trophies, I wouldn't have given this game a second thought. But with two easy platinum, this is a no brainer. Developers need to realize that a platinum trophy is definitely something that needs to go into their games. They're leaving money on the table by not putting one in their game. That's just truth. That's just fact. Yeah, every game should have a platinum. I mean, I think the biggest miss this year was Song of the Deep, which was I mean, it was unfathomable. Do you get it? Real game. I got it. Okay, high five.",
            "start": 1782.24
        },
        {
            "text": "Yeah, every game should have a platinum. I mean, I think the biggest miss this year was Song of the Deep, which was I mean, it was unfathomable. Do you get it? Real game. I got it. Okay, high five. That was a song of the deep. One of my favorite experiences. I love that game so much and so deep and so much to do and long and when it's totally close, when it didn't have a platinum, I was gonna be like a 23 hour game and like, no, no, it's a full on Metroidvania game. Like, oh, like, why the fuck doesn't this have a real platinum? It's very weird. What I've been told by inside sources before, maybe they're developers, maybe they're Shuhei Yoshida, maybe they're Jack Trenton is the fact that if you push just a little, you can get a platinum trophy, but some will say no. And then people go, all right, cool. Cause they don't understand the power of trophies. Would you understand the power of trophies? Put a platinum in the fucking thing. You think Sony would let them know the power of",
            "start": 1822.8
        },
        {
            "text": "all right, cool. Cause they don't understand the power of trophies. Would you understand the power of trophies? Put a platinum in the fucking thing. You think Sony would let them know the power of trophies since I'm sure they have data. I don't know who is working in the trophy department at PlayStation that isn't like nah, whatever they want. They have bigger problems than the trophy department. I'm still saying we're on our own. We joked around for a long time that when we lost our jobs, we would be trophy consultants. I think we could do it now. And we would just have to of course tell people, well, let's just say, well, we'll do it. You'll pay us. You'll pay us good. And we'll do it. Any developer out there that let a lot of developers listen to the show. If you want us to consult triple a, a indie make a trophy list, we'll make the trophy list. Oh, cause the thing about, so here's the thing about knobs, which specifically, yeah, if there isn't a trophy in there, that's called a",
            "start": 1860.92
        },
        {
            "text": "a, a indie make a trophy list, we'll make the trophy list. Oh, cause the thing about, so here's the thing about knobs, which specifically, yeah, if there isn't a trophy in there, that's called a Miller and a trophy called Moriarty. I'm going to be very fucking upset because that was, that is a lost opportunity. I hear you. I'm not, I'm not, I'm not criticizing. So just stick with me for two seconds. What I'm going to say is you are making a very specific trophy request after the game has already been announced. I'm just saying, what if there's some kind of nod to us or beyond or whatever, if the trophy is called beyond, I'm gonna be very upset. Okay. Okay. Because that's the show we used to do. Yeah. The game must've just gone through certification recently. You got to respect where it came from. I suppose. But there, all I'm saying is that there needs to be a nod to us in there somewhere. Now I'm going to thank you. Listen, switch a nod switch. I feel like, well, I'm sure maybe we'll",
            "start": 1894.88
        },
        {
            "text": "from. I suppose. But there, all I'm saying is that there needs to be a nod to us in there somewhere. Now I'm going to thank you. Listen, switch a nod switch. I feel like, well, I'm sure maybe we'll be in the credits as the inspiration inspired by right. So I would like to think so too. If we don't have that, I was in the Axiom Verge, thank you on the Wii U and all these other things. So I'd like to make a second appearance and perhaps a third and fourth appearance in the future as well. Another game. When we got our trophy consulting business off the ground. So we got to get a good name for it. We're dead serious. That opportunity is like, I could make you a trophy list that is phenomenal for any game, any game. I go through games all the time and I'm like, why is the Titanfall 2 is a good example. I'm like, why is the half these things getting, giving me trophies? Like you're just getting trophies sometimes back to back for narrative. I'm like, this is, you guys don't get it. You",
            "start": 1932.24
        },
        {
            "text": "good example. I'm like, why is the half these things getting, giving me trophies? Like you're just getting trophies sometimes back to back for narrative. I'm like, this is, you guys don't get it. You don't understand what, how to pop a trophy. And I'm not, and as a member of this team, I'm not criticizing you not understanding your developers. You're making games, you're working in Maya. You got to worry about, how's the story going? Where are we tightening up the graphics? There's a million things going on. You think trophies are simple trophies. Aren't simple. Just give us a shot to show you how they're meant to be done. All right. And what I'll say is what Colin always says, vote with your wallet. Ladies and gentlemen, if you don't like the trophies in a game, don't buy that game and then write really mean letters to people saying why you didn't don't do that part. Write mean letters to people, not to the developer, just random people. Dear Obama. Number two, EA and BioWare have",
            "start": 1971.2
        },
        {
            "text": "then write really mean letters to people saying why you didn't don't do that part. Write mean letters to people, not to the developer, just random people. Dear Obama. Number two, EA and BioWare have finally told us more about mass effect Andromeda. Primarily by way of a new trailer. We'll leave the trailer watching you out there, but here's what the Amazon page for the game says. Quote, chart your own course in a dangerous new galaxy. Unravel the mysteries of the Andromeda galaxy. As you discover rich alien worlds in search of humanity's new home battle like never before new additions like destructible environments, boosted jumps for added verticality and all new weapons and biotics make combat more thrilling than ever with amazing weapons, powers and tech and much more flexible skill and weapon progression trees. You can replicate your play style to make your own, make you unstoppable against new powerful alien enemies. End quote. The game also apparently includes four player",
            "start": 2006.44
        },
        {
            "text": "and weapon progression trees. You can replicate your play style to make your own, make you unstoppable against new powerful alien enemies. End quote. The game also apparently includes four player multiplayer, though the nature of that is still unknown. I assume it will be co-op, but I don't know. And game reformer has confirmed that loyalty missions, which were popular in mass effect two are returning. Yeah. Stunningly EA hasn't said anything about a release date though. We'll remember doesn't say spring that March 21st, 2017 was the date identified in an accompanying dark horse comic book. And I still think that that is the date. Um, I don't know what, they must not be confident that the game's going to be ready to go. I don't think it was a shot in hell in which case I understand. And seven days a big deal, but this isn't even about N seven. It's about the Andromeda initiative. But that's because that's what they were sent off in. Like it has nothing to do with them anymore. So like",
            "start": 2043.92
        },
        {
            "text": "days a big deal, but this isn't even about N seven. It's about the Andromeda initiative. But that's because that's what they were sent off in. Like it has nothing to do with them anymore. So like this holiday is stupid. That's, that's the thing. Like everyone's like and seven day, November seven. I'm like, that's stupid. It has nothing to do with them anymore. Now it's a new game. All right. So what I'm saying is they didn't have to say anything today. If they're not ready to talk about the game, then don't talk about the game. Here's the counter argument. Colin is that how many video games have holidays that people know are, are, that day is about this thing. Here's the other thing. 95% of the people that play mass effect have no idea that today's a holiday. The dorks do. Oh my God. That Brit Bromrocker, Steimer, they know what's happening. They care about it. They're all over it. And like the thing about it is like, it's, you know, the trailer ends and it still says spring. I'm",
            "start": 2081.28
        },
        {
            "text": "That Brit Bromrocker, Steimer, they know what's happening. They care about it. They're all over it. And like the thing about it is like, it's, you know, the trailer ends and it still says spring. I'm like, no, not a chance in hell. Not a fucking chain unless we're playing loose and fast with this fucking release date. Like we were fast and loose either one. Yeah. Like we like to do in the video game industry, not a chance in hell this is going to hit this is no, you're, you're lucky. You'll be lucky to get this in the fall. March is when I think the game's going to come out. Okay. I mean, it's, it's, I think it's alarming that there's no release date that you still haven't seen that much of the game really of like, like the game play of it today was really cinema based, which is great. But even the cinematics they were showing, didn't look amazing. I thought like I'm excited for more mass effect. I'm gonna be wrong, but I wasn't watching this whole fuck. Oh my God. Yes. Oh, the thing",
            "start": 2115.6
        },
        {
            "text": "even the cinematics they were showing, didn't look amazing. I thought like I'm excited for more mass effect. I'm gonna be wrong, but I wasn't watching this whole fuck. Oh my God. Yes. Oh, the thing is, is that if the game doesn't come out in March or April, then you can't release it until the fall. You can't release mass effect in July. It just doesn't feel right. Yeah. It would be a great time to release these kids are out of school. Everyone's a little kind of low key or whatever you know. Right. But Hey man, let's go to the galaxies. Do the man and drama initiative man. Number three. Sony has revealed new sales figures for PlayStation four as well as new financial data for the PlayStation division and, and Sony as a whole. For starters from June 30th to September 30th of 2016 the company shipped 3.9 million PlayStation four consoles bringing worldwide sales up to 47.4 million units. This puts it a mere 1.6 million units behind super Nintendo. It is currently the eighth best selling",
            "start": 2154.76
        },
        {
            "text": "shipped 3.9 million PlayStation four consoles bringing worldwide sales up to 47.4 million units. This puts it a mere 1.6 million units behind super Nintendo. It is currently the eighth best selling console of all time and one including handhelds. It sits at 13th stunningly with the exception of Vita. It is still the worst selling PlayStation console though. It has only been on the market for three years and will all almost certainly eclipse all but PS two and perhaps PS one sales. PlayStation two sold 155 million units lifetime, making it the best selling console and best selling gaming hardware of all time. While PS one sold 102.5 million units, PlayStation three 83.8 million units and PlayStation portable 82 million units. Sony expects to ship 20 million PS fours by the end of its fiscal year, which will bring PS fours to 60 million units by March, 2017, which is right around where the NES sits lifetime sales at PlayStation slid 11.3% due primarily to foreign exchange rates while",
            "start": 2185.56
        },
        {
            "text": "year, which will bring PS fours to 60 million units by March, 2017, which is right around where the NES sits lifetime sales at PlayStation slid 11.3% due primarily to foreign exchange rates while operating income also fell due mostly to lower PS three sales and PS four price drop. However, PlayStation and Sony remain in the black. I think their operating income was somewhere in the hundreds of millions. Number four PlayStation pro is launching this weekend along with it. Around 30 games will be out of the box compatible or patch to work with the console. In addition, 45 games will work with pro by year's end and many more next year. According to Sony, if you're curious, these are the games that will work with pro on November 10th. So I have a list here for you guys lay it on me in case you're going to buy console. These are the games you can expect to take advantage of pros power, battle zone bound call of duty, black ops three call of duty, infinite warfare called duty. Modern",
            "start": 2225.84
        },
        {
            "text": "you're going to buy console. These are the games you can expect to take advantage of pros power, battle zone bound call of duty, black ops three call of duty, infinite warfare called duty. Modern warfare remastered day sex mankind divided, dishonored to drive club VR, EA sports, FIFA 17 firewatch hell divers, hit man, hit man, hustle Kings, infamous first light, infamous second son, knack mafia three, Mantis burn racing, middle earth, shadow of Mordor, NBA two K 17 neon Chrome, Paragon PlayStation VR worlds, ratchet and clank rez infinite rigs rise of the tomb Raider Robinson, the journey smite superstar dust ultra the elder scrolls online gold edition, the elder scrolls online Tamriel unlimited, the elder scrolls five Skyrim special edition. The last of us remastered, the last of us left behind the place, the playroom VR, thumper Titanfall two, uncharted for a thief's end and told Dawn Russia blood Viking squad wheels of Aurelia world of tanks and X com two pretty good list of games.",
            "start": 2260.32
        },
        {
            "text": "behind the place, the playroom VR, thumper Titanfall two, uncharted for a thief's end and told Dawn Russia blood Viking squad wheels of Aurelia world of tanks and X com two pretty good list of games. I like that Mantis racing is on there and I'm not knocking Mantis racing. Those guys reached out, sent me a code for the game. I still haven't had a chance to play it, but it didn't seem like it was that intensive a game. It's like, well, neither is hell divers. That's why I'm curious. Like what is, I don't know what an arrowhead with hell divers are probably like the game looks like. Yeah, maybe it won't fuck everything. That sucks without having you. That's a real, that's a damn alien nation that sucks too. And there was no excuse for alien nation cause you can only play it on PS four. Number five. It looks like the next tomb Raider game is called shadow of the tomb Raider. At least if a picture of a man's laptop from a Montreal subway is any indication. We, we read it. User triple H",
            "start": 2306.8
        },
        {
            "text": "five. It looks like the next tomb Raider game is called shadow of the tomb Raider. At least if a picture of a man's laptop from a Montreal subway is any indication. We, we read it. User triple H two 80 was apparently riding to work in downtown Montreal one morning when he spotted a man on a laptop working on a presentation for a game called shadow of the tomb Raider. So we took a picture because taco reports that this title sinks with what they've heard and making matters more interesting is that I had asked Montreal according to the taco is the developer working on it. Crystal dynamics, the studio behind two meters resurgence right here in the Bay area is apparently not working on this particular game though it's possible they're working on another one. This is all we know for right now is publisher square annex hasn't set a peep since the leak. I think wisely. So we discussed it at length on the games cast. Interesting. Uh, not, I'm not alarmed. I shouldn't say, but I loved what",
            "start": 2346.4
        },
        {
            "text": "is publisher square annex hasn't set a peep since the leak. I think wisely. So we discussed it at length on the games cast. Interesting. Uh, not, I'm not alarmed. I shouldn't say, but I loved what crystal has been doing with their tomb Raider and I'm not super stoked to see somebody else pick up that torch or maybe it's something different. Maybe it's a different character. Maybe we ran through all these options on the games cast, but if it is all right, cool. This is, you know, the next one after rise of the tomb Raider and we're just picking up. It's like, oh, come here real quick. Take your glasses off. Okay. Make a wish. There you go. Nope. Kevin's still over there. I'm kidding. Kevin. I love you. I fed you lunch today. Number six. Super. Soon as Sunni. Okay. Sony hasn't said too much about PlayStation VR in recent days except for this. According to Sony's chief financial officer, Kenna Chiro Yoshida, it's on track in quotes in terms of sales. Sony initially expected to sell",
            "start": 2378.66
        },
        {
            "text": "much about PlayStation VR in recent days except for this. According to Sony's chief financial officer, Kenna Chiro Yoshida, it's on track in quotes in terms of sales. Sony initially expected to sell hundreds of thousands of units right at launch super data or research group as relayed by game spot reports that Sony could potentially sell 2.6 million PSVR units by the time the calendar reaches 2017. Excitement seems high, but I also feel like no one's talking about it anymore. Thank you. So that was what I wanted to talk about is the fact that we mentioned it a second ago with the pro thing that when, when PSVR came out, I was very excited and happy that all the tweets and all the feedback we're getting from kids is they were excited. They were enjoying it. It wasn't what I was worried about of like, this is it. This is the launch line, blah, blah, blah. I have not heard anyone saying, man, I'm addicted to rigs. I can't stop playing the Valkyrie. Like what happened? Like are you guys",
            "start": 2425.34
        },
        {
            "text": "of like, this is it. This is the launch line, blah, blah, blah. I have not heard anyone saying, man, I'm addicted to rigs. I can't stop playing the Valkyrie. Like what happened? Like are you guys still playing that? I need to know. I wonder if kinaafunny.com slash psq. PSVR selling strong GameStop itself said that it's actually exceeding their expectations. So selling holiday, selling hardware during holiday season is smart, but I wonder if because of the glut of AAA games that take gamers, this isn't a casual thing. Yeah. Casual gamers aren't playing PSVR. The investment is too high financially and all the rest. And I wonder if it's actually a rock and a hard place or a strategic era kind of situation where releasing PSVR when battlefield comes out, call of duty is out, Titan falls out, watchdogs is out, et cetera, et cetera, Skyrim. Like maybe it should have been released in the summer. Maybe it should have been released like at a time when it could have breathed, but then they're",
            "start": 2460.86
        },
        {
            "text": "watchdogs is out, et cetera, et cetera, Skyrim. Like maybe it should have been released in the summer. Maybe it should have been released like at a time when it could have breathed, but then they're going to say, our marketing shows probably that we're going to sell a lot in November. We're going to sell a lot for the holiday season. So I think it's just, what I would be interested to see and we're not going to see it is Sony's back end heat mapping about how this thing is being played because, and the other thing that's gonna be interesting is when they finally do sales charts, including PSVR games on PlayStation blog, if they're going to separate them out or if they're gonna put them in there. And I hope that they put them in with the PlayStation four games to see how they'll stack up on each other. Because you can extrapolate now because MPD takes third party retail day or digital data. And so you can kind of figure out where things would sit. And I also wonder if any of those",
            "start": 2510.7
        },
        {
            "text": "up on each other. Because you can extrapolate now because MPD takes third party retail day or digital data. And so you can kind of figure out where things would sit. And I also wonder if any of those games will appear in MPD at all. And probably the answer is probably so just because retail sales seem to be very top heavy sports heavy, same games over and over again. I wouldn't be surprised to see a PSVR game at number 10 or number nine, you know? So, but I, but I agree, no one's talking about it, but I don't know if that's necessarily a bad thing in the, what you're talking about is that gamers are immediately distracted by all the triple A releases. Cause it could be the what I was worried about the first time around if it was the summer, if it did release with nothing else there where it would be great. I have so much time to invest into PlayStation VR and you get it and it's like, well, this was an experience. This game's making me sick. Like I don't feel like putting it on the",
            "start": 2544.7
        },
        {
            "text": "it would be great. I have so much time to invest into PlayStation VR and you get it and it's like, well, this was an experience. This game's making me sick. Like I don't feel like putting it on the night. Oh, why did I buy this thing? I'm in the, you get that growing. We're here. It is. I had a great weekend with PlayStation VR and I'm excited for the future, but now it is battlefield time. Now it is Titanfall. Now it is Watchdogs. It's, it's an, it's an, it's a novelty item. Um, for some, I don't think it's a, as I said before, I don't think it's a gimmick, a heavy G gimmick, a big G gimmick, big G. Um, but uh, yeah, so we'll see how it all turns out. But I agree that, you know, chatter was high and chatter was positive, which is nice. But I wonder if the naysayers will end up being correct. I don't think so. Uh, but we'll see what happens. I mean, I certainly have been distracted from playing it. There are a bunch of games. I mean, Robinson is, we're going to get into in a little",
            "start": 2578.26
        },
        {
            "text": "I don't think so. Uh, but we'll see what happens. I mean, I certainly have been distracted from playing it. There are a bunch of games. I mean, Robinson is, we're going to get into in a little while. Comes out that game was fucking phenomenal. Um, also the studio that's making it apparently shitting the bed right now. But, uh, that's a cry tech game, right? Robinson. And apparently they have paid people in a long time according to what report again, this sounds familiar. That's how we got home front, the great game called home front, the revolution. Um, so yeah, so we'll see how it all turns out. But I mean, I want to get to eat Valkyrie. I want to get to Stardust. Robinson, uh, battle zone looks fucking great. Uh, there's a bunch of games, but I'm just like, I don't have time. Like I want to play these core experiences first and then clear the plate. And what I'm really excited about is, uh, like I don't care about Watchdogs too. I'll probably, maybe I'll play, I don't want to say",
            "start": 2617.46
        },
        {
            "text": "to play these core experiences first and then clear the plate. And what I'm really excited about is, uh, like I don't care about Watchdogs too. I'll probably, maybe I'll play, I don't want to say probably, maybe I'll play it. There's not that much else coming out this year. So now I have for me, so now I have time last guardian, big old last G last. Guardians gonna be five hours long. Just watch. Okay. We'll be done with it in a day. I hope I'm wrong. I hope it's like a 30 hour open. A little bit fancy 15 final fantasy. All right, so that's one. So that's one game. Definitely play that and some Vita games. A laser, culture amounts, but to me, uh, I'm excited about these, these six or seven weeks that we're going to get where I can just play whatever, because especially the two weeks we have off at the end of the year, because I'm going to fucking go balls in on, on some of these games. One game that I've been, so we, Nick and I were playing Skyrim on the just for a few minutes on the,",
            "start": 2651.42
        },
        {
            "text": "off at the end of the year, because I'm going to fucking go balls in on, on some of these games. One game that I've been, so we, Nick and I were playing Skyrim on the just for a few minutes on the, um, I'm trying to put it on the extra live stream. And, uh, I was like, I don't want to play this now, but part of me is like, you're there. Aren't you? You know, like, I'm like, man, I had a great time. Do I want to really start back over though? I don't remember enough of it to even care. Well, it was, it was never about story really. Right. It was about XP. I mean, I, I, I'll never forget sitting there for 45 minutes while he did Washington's beard with Mark Ryan and sin, where I sat there listening to that and just crouched behind a monk and would hit him and then a seat stand up and he'd sit down and I get an XP point for stealth or whatever. Then I hit him. Couldn't you walk next to people when they were sleeping and get stealth points? Like if you just walk around people's bedrooms,",
            "start": 2689.62
        },
        {
            "text": "down and I get an XP point for stealth or whatever. Then I hit him. Couldn't you walk next to people when they were sleeping and get stealth points? Like if you just walk around people's bedrooms, make something like that. That was the best. Oh yeah. There was videos of people just like walking into people's bedrooms and just walking around and like the bar would fill. Yeah. That's really, the one I've, you want to know one of the ones I've felt this unnatural call to go back to all of a sudden recently and maybe watch dogs derails it and maybe call of duty satiates. Maybe what I'm seeing on the other side of all these games, these two games, the division, I saw this polygon article about how the patches have fixed it and I was like, I wouldn't mind jumping back into, just even if it's just for a night, I ring up old Fran Mirabella. He takes the curlers out of his hair and him and I go back out there. We shoot some people in the face. Just can't remember how to play anymore. I know",
            "start": 2729.42
        },
        {
            "text": "just for a night, I ring up old Fran Mirabella. He takes the curlers out of his hair and him and I go back out there. We shoot some people in the face. Just can't remember how to play anymore. I know that's my concern, but it's just third person shooters. My other thing. Sure. Also we're getting closer and closer to ghost recount wild lands. That's March, right? Hell yeah. I thought you were going to say because you brought up call duty that you're going to say Wolfenstein cause that's, that's a game. I really feel like you're fucking up, you know, like you're actually fucking up. You know, you want like Wolfenstein certainly much better than Titanfall for instance. In terms of single player campaign, I think you're fucking up about playing that game. Number seven, Capcom is expecting very strong sales of resident evil seven, which is launching in late January of 2017 according to an investment Q and a spotted by game spot. Capcom thinks it can sell 4 million copies of the new",
            "start": 2763.34
        },
        {
            "text": "very strong sales of resident evil seven, which is launching in late January of 2017 according to an investment Q and a spotted by game spot. Capcom thinks it can sell 4 million copies of the new survival horror game by the end of its fiscal year. So we'll see how that turns out. I'm super stoked about resident evil seven. That's definitely one of my most anticipated games of next year, especially on PSVR, playable from front to back. Really interested to see how that's going to work out. Yeah. And I think a lot of people are going to get cars. They're kind of sort of things going to happen. Number eight, that game company, the studio behind PlayStation hits flow, flower and journey has revealed its fourth game. Kind of. The studio has been toiling away on a new project since journey launched in 2012 and has revealed an image on its Twitter account of a candle lighting another candle on a light blue background with the text, a game about giving accompanying the picture. The company",
            "start": 2796.02
        },
        {
            "text": "in 2012 and has revealed an image on its Twitter account of a candle lighting another candle on a light blue background with the text, a game about giving accompanying the picture. The company has since confirmed the game will launch in 2017 while releasing some more art, including four kids as white silhouettes holding hands on a light blue background and an image of some sort of monolith on a grassy Hill with clouds behind it. That game company is no longer associated exclusively with Sony having fulfilled its three game contract with the publisher and the developer has yet to confirm where this game will land. So it might not even be on PlayStation. You and I both think it won't be actually. But it's worth noting because that game company's heritage is deep on PlayStation three and we all are regardless of where it lands, hope that it's great and hope that people love it as much as journey. And as I've said before, Jenova Chen looks like looked like a broken man at GBC last year.",
            "start": 2824.42
        },
        {
            "text": "all are regardless of where it lands, hope that it's great and hope that people love it as much as journey. And as I've said before, Jenova Chen looks like looked like a broken man at GBC last year. We asked him how hard, how hard is it to follow up? He's like, are you kidding me? It's incredibly hard to follow up and journey. That's why we've canceled games. We've, we tried to do this. We just can't do it. Yeah. I mean, they have the money and the means to, to hang out. They're privately held so they can take their time. But yeah, I don't envy them and I don't believe that they are. I don't want to say I don't believe they're capable cause I don't think that's the right word, but they're not capable of beating journey on the thing. Simply because that to me is if they can beat journey, then they are maybe the best game developer of all time because journey is certainly a tort of force of it's on a whole nother level. Like, you know, this, this very special and unique experience that",
            "start": 2859.34
        },
        {
            "text": "they are maybe the best game developer of all time because journey is certainly a tort of force of it's on a whole nother level. Like, you know, this, this very special and unique experience that you can only have once, right? Yeah. Even watching other people play it, even playing it again, you don't have it again. You have it once and it's really awesome. And, uh, if you haven't played journey, I mean you're really fucking up. It's on PS four. It's on PS three. Go play it. Um, so I don't envy them. Uh, and I don't think they're going to be able to beat journey. Um, but maybe, I don't know. I, I, I feel for them because it's, it reminds me a lot of like, I mean this is a music anecdote, maybe some people like it reminds me of no doubt with tragic kingdom or green day with Dookie or how do you follow up? I mean, I actually think Nimrod's a better record than Dookie, but for a lot of people, yeah. How do you, how, how do you follow up tragic kingdom? How do you follow up? You know, all",
            "start": 2896.9
        },
        {
            "text": "you follow up? I mean, I actually think Nimrod's a better record than Dookie, but for a lot of people, yeah. How do you, how, how do you follow up tragic kingdom? How do you follow up? You know, all of these things. It's like you don't, you just do the best you can. Like these are lightning in the bottle moments and journey is one of those. So we'll see unless you know, I, I don't know. That's true. Number nine, Titanfall two may be selling poorly, at least according to anecdotal ovens. But EA insists the franchise will continue Blake. Jorgensen of VA confirmed as much in a financial call in which according to game spot, he also said that PS4 and Xbox one sales should be around 80 million units sold by the end of this year and a hundred million sold by the end of 2017 with 33% more units in the wild right now than PS3 and Xbox 360 at this respective point in their cycles. Additionally, and this is an interesting thing, he noted that Jade Raymond's assassins creed light game from EA",
            "start": 2942.5
        },
        {
            "text": "in the wild right now than PS3 and Xbox 360 at this respective point in their cycles. Additionally, and this is an interesting thing, he noted that Jade Raymond's assassins creed light game from EA motive is perhaps three or four years out while battlefields one user base. It was nearly twice that a battlefield fours and it's first week. The interesting thing here is the 33% more PS3s and Xbox 360s for people that pay attention to this. This number is shrinking constantly. And we are starting to reach the point in which the lines are going to intersect pretty soon. Remember for a year it was like 60% 50% 40% now it's 33% saturation, right? People own them and maybe now they go out to run out about those pros for their four K TVs. We'll see. They want to get, make sure they're getting the most graphical fidelity out of hell divers. Got to have that HDR running on hell divers. Bra number 10 drawn to death is no longer free to play according to a post on the PlayStation blog by the one",
            "start": 2978.54
        },
        {
            "text": "most graphical fidelity out of hell divers. Got to have that HDR running on hell divers. Bra number 10 drawn to death is no longer free to play according to a post on the PlayStation blog by the one David Jaffe. Here's what he said in part quote, as you may know, drawn to death has been available in a quasi beta phase that we called limited access. During this time we collected a ton of insightful information from the community. After reviewing everything we learned during the limited access period, we have decided to officially launch drawn to death as a traditional paid title for our limited access fans. We wanted to take this opportunity to confirm that we won't be making any changes to the moment to moment gameplay. Drawing to death is still the skill based hardcore shooter, brawler hybrid that it is always intended to be in quote. You can get more information by reading the PlayStation blog. He did say Colin was right in his on Twitter and people were saying in the comments. I",
            "start": 3018.3
        },
        {
            "text": "hybrid that it is always intended to be in quote. You can get more information by reading the PlayStation blog. He did say Colin was right in his on Twitter and people were saying in the comments. I don't know that I necessarily want to take credit for this one particularly. I'm glad they listened, but I think it's still too late. The, the, so I think, and I think Jaffe knows this. He's a smart man. He's a studied man. He understands the game industry. They overexposed this game, whether it's paid or not. And the, what I suspect that Sony San Diego learned from its sister game, kill strain, which is dead, is that you can't, we can't, we can't send this thing out to die. It's not going to be supported by free to play ads and they're not going to make money on it. I think either way, this game is probably not going to do very well. And that makes me sad to say that because I like David Jaffe. First of all, I think he's a great guy and think the game looks fantastic and I think it's very",
            "start": 3054.18
        },
        {
            "text": "is probably not going to do very well. And that makes me sad to say that because I like David Jaffe. First of all, I think he's a great guy and think the game looks fantastic and I think it's very unique and novel and that really is saying something in an environment where unique novel things are not happening very often. Look around you in the game industry. I just, I just feel like Sony has this very unique power of first party that's only bested by Nintendo, right? And if you don't put everything behind it and make it a big deal that it's a first party exclusive game and make it something that people want and put a lot of love and time into it in terms of marketing and in terms of being careful with it, then I just think it's going to fail. Like kill strain just fucking bombed, you know what I mean? And they really put a lot of time into that. And the same thing happened. The thing, so the thing I get mad, I get nervous about, and I don't know if you can draw this parallel that I",
            "start": 3096.26
        },
        {
            "text": "what I mean? And they really put a lot of time into that. And the same thing happened. The thing, so the thing I get mad, I get nervous about, and I don't know if you can draw this parallel that I am from, from drawing to death is, is the Q games, Soviet game. What the fuck was it called? The Tomorrow Children? The Tomorrow Children was a paid game that went free to play. So it's doing the opposite because no one fucking cared because the game was shown too much. Then it disappeared. Then they just pooped it out. I just don't get, it's fucking frustrating. We've talked about this. We talked to Deathon. We thought that drawing to death had too much exposure. That's been a common theme when we talk about drawing to Deathon. Peace, I love you XOXO. My comment when this went up, we talked about it, was the fact that maybe it is too late, but it is the fact that, you know what? I haven't seen people, Jaffe tweeting about, Hey, get in the beta, get in the beta, get in the beta, get in the",
            "start": 3136.78
        },
        {
            "text": "it, was the fact that maybe it is too late, but it is the fact that, you know what? I haven't seen people, Jaffe tweeting about, Hey, get in the beta, get in the beta, get in the beta, get in the beta. Nor have I seen PlayStation blogs. It seems like it actually, they did cut it off at some point, go radio silent on it. And now they come up. And what I found interesting about this was the fact that we're all right, it's going to be a paid release. Here's everything you'll get when you buy the game released it coming soon. I think that this is going to be like, it's one of my PlayStation. This is going to be one of my PSX predictions that PSX, they're going to be like drawn to death is here it is. It is paid. Jaffe talks about it. We see some new stuff. It's available now and you have to buy it. And I think that is enough of a twist that it won't get, it won't do what guns up did. Where guns up, remember you and I were talking about like, that game is still in beta. We don't, it came",
            "start": 3174.7
        },
        {
            "text": "buy it. And I think that is enough of a twist that it won't get, it won't do what guns up did. Where guns up, remember you and I were talking about like, that game is still in beta. We don't, it came out on trophies and you could get, and everybody's like, not everybody, a couple of people in the comments were like, uh, guys at PSX last year, they announced on stage that that was out. And it's like, oh, well we glossed over. Cause we didn't fucking care about the game. We were, we were already sick of hearing about it at PSX and then suddenly it's out. Right? I played it at E3 two years before that or something. So the thing with the drawn to death is if they do go quiet and they didn't, I mean it was, Hey, here's, here's the bad news out front. You got to pay for this, which isn't bad news, but here's the bad news that you'd see. Like if we did that at PSX, you're less excited. Now you start thinking about, okay, I got to pay for drawn to death if I want to play it. And then they do",
            "start": 3212.82
        },
        {
            "text": "but here's the bad news that you'd see. Like if we did that at PSX, you're less excited. Now you start thinking about, okay, I got to pay for drawn to death if I want to play it. And then they do do something really cool at PSX and show it and say it's available right now. You can go buy it. Maybe even it's available right now and it's going to be PlayStation plus right now. I don't know if they want to throw that out there, but it is another way to be like, give it some kind of, it can't just be quietly put out there. It's not, we don't want it to be tomorrow. Children put out there and then you never know. No marketing, no nothing, no whatever. Who played that game? Like that's the thing is like, I never, I haven't heard one fucking person talk about the tomorrow. Children. When I hear people talk about the tomorrow, children, they talk about, Holy shit that came out of even know like, yeah, just came and went. So that's the thing is like the marketing in general for drawn to death",
            "start": 3246.78
        },
        {
            "text": "people talk about the tomorrow, children, they talk about, Holy shit that came out of even know like, yeah, just came and went. So that's the thing is like the marketing in general for drawn to death can be, Hey, people who played this last year at PSX and loved it cause it always shows well. PSX here it is. It's now it's out right now. Buy it when you get home. For being here, you get free character free, whatever. My question is this, who the fuck is minding the store? And I don't mean the place in short, who's just minding bound fucking irrelevant, right? According to Brian Altano, I saw on Twitter, one of the best PSVR games he's played in terms of beauty and I haven't gotten a chance to play. No one plays it right tomorrow. Children are what I'm saying is these downloadable second party games are coming out bound comes from plastic. The guys that did the Torah and all those guys, you know, linger in shadows. That game comes out and no one talks about it. Q games, which makes",
            "start": 3280.38
        },
        {
            "text": "party games are coming out bound comes from plastic. The guys that did the Torah and all those guys, you know, linger in shadows. That game comes out and no one talks about it. Q games, which makes fucking great games for some reason doesn't make a pixel junk game makes the tomorrow. Children a game no one asked for, right? We love pixel junk. Keep giving us fucking pixel junk games. You guys are revolutionizing all these, all these genres. You know, give us the tomorrow children and we'll just poop that out. That can probably cost more to make than all the other fucking pixel junk games combined. Right? So that comes out. They, uh, for some reason, think putting a free to play MOBA on PlayStation four is a good idea. So they make the mobas because they make kill strain, then fucking lay the entire team off because the game bombs as we all knew it was going to. And now we have drawn to death. This is the fourth game in that list of 2016 kind of, and I'm like, I just get so mad because",
            "start": 3315.62
        },
        {
            "text": "entire team off because the game bombs as we all knew it was going to. And now we have drawn to death. This is the fourth game in that list of 2016 kind of, and I'm like, I just get so mad because these games aren't bad. It's just that they're not putting any marketing behind them. I'm not saying TV commercial. I'm just like, can, can any normal game or even tell me what the fuck bound is? I have it. I know what it is, but why are we, why are we even bothering putting these out? Yeah. Like why is someone even putting any of these games out? What is the point? Just cancel them. I mean, the thing about drawn to death is I think that it granted, maybe it's too late to do anything, make drawn to death, the success, do anything about it. It is them admitting that, okay, it's time to change strategies. They're reading the tea leaves as you always want. I'm not saying drawn to death is, should be canceled by the way. I'm saying these other, these other games, it's like, it's like, it's like,",
            "start": 3352.78
        },
        {
            "text": "They're reading the tea leaves as you always want. I'm not saying drawn to death is, should be canceled by the way. I'm saying these other, these other games, it's like, it's like, it's like, yeah, bound produced by a friend of ours at Sony Santa Monica. We're like, working hard on this game, but then they just don't seem to care. Like I just, I just don't get it. I don't understand how we've fallen so far. Think about PlayStation three's digital ecosystem. There were a lot of great games on there that did very well. And I'm not saying that PlayStation four doesn't have those games. We have a reso gun. We have other games that do well, but and a lot of third party stuff, but like there is no journey. There is no flower. There is no stardust. There is no, yeah, the last guy there. There, you know what I mean? Like taking these, there's no Tokyo jungle. There's no like games that are weird and quirky and different and get mind share and get talked about and get a review on IGM that",
            "start": 3390.3
        },
        {
            "text": "you know what I mean? Like taking these, there's no Tokyo jungle. There's no like games that are weird and quirky and different and get mind share and get talked about and get a review on IGM that matters. I'm just disappointed in it. Like it seems like they're, it seems like they're taking a quantity over quality approach. Now just putting whatever the fuck they want on the con on the console every week, just shitting a bunch of these games out. I just think someone needs to like, like, I think they're, I'm just going to say it straight and I say it straight. And I think I, whether I'm right or wrong, I think they're wrong. I think they're just, they're, they're messing this up. You know, they're messing the digital ecosystem up. They're messing up these $20 games that they could really get. Journey was an investment. You know, we're going to get Edith Finch and all these games from them. But like, well keep in mind, like this is what I think a lot of people walked away from E3",
            "start": 3425.86
        },
        {
            "text": "get. Journey was an investment. You know, we're going to get Edith Finch and all these games from them. But like, well keep in mind, like this is what I think a lot of people walked away from E3 worrying about the worst case scenario is the fact that all of a sudden it seemed like is Sony swinging back to being PlayStation is triple A, triple A, triple A, triple A, triple A. And we're going to leave these things out in the cold and tomorrow children is, you know, granted war out. It's welcome where the fuck is this game? But it had been talked about and pimped really hard when it was, that's the PlayStation we are. We are the PlayStation of these small independent quirky games or the, you know, independent, but you know what I mean? These games that you're going to get nowhere else, these experiences. It just, I think that it's, it's sad and I, I, I'm not saying Sony should invest first party re resources into the, into developing these games at all. That's not what I'm saying. What",
            "start": 3457.5
        },
        {
            "text": "experiences. It just, I think that it's, it's sad and I, I, I'm not saying Sony should invest first party re resources into the, into developing these games at all. That's not what I'm saying. What I'm saying is it's just sad to see these games that are clearly like have talent behind them and clearly have something to them. Kill strain clearly had intelligent design and it clearly had, I don't mean intelligent design, like a God makes things. I mean like, you know, an intelligent design philosophy, people that really knew what they were doing working on it and they owe more to these developers and they owe more to David Jaffe than to like give him a little bit his studio, some money in it and develop a game, like put something behind it. What they should have done with drawn to death two years ago was to say like, stop, we're making this a $60 game. Hire people. We're going to give you money and you're going to make a campaign for your game. We're going to have a campaign and a story",
            "start": 3492.94
        },
        {
            "text": "years ago was to say like, stop, we're making this a $60 game. Hire people. We're going to give you money and you're going to make a campaign for your game. We're going to have a campaign and a story higher. Some people are going to have, we're going to, and we're going to emphasize as multiplayer, but we have something special here, you know, and that's what makes me so sad about, you know, his particular game, Jaffe's particular game is not something that I'm like, you know, really wild about or like looking forward to playing cause it's just not, I don't like multiplayer competitive shooters, but that had a, that had a campaign. Like I said it before, like this is a, you know, this is a truly unique game. Like this is a really unique idea. And it's such a waste that Sony is kind of like at the 11th hour basically be like, Oh no, no, no. Like now we're going to make a pain. I'm like, it's, but it's too late. You know, you guys should have done this a long time ago. Now I'm glad that",
            "start": 3529.5
        },
        {
            "text": "at the 11th hour basically be like, Oh no, no, no. Like now we're going to make a pain. I'm like, it's, but it's too late. You know, you guys should have done this a long time ago. Now I'm glad that they're going to, this is going to be a better scenario for them monetarily and in terms of success than the other way around. Simply because I think if you don't, if you're not willing to charge for your game, you don't really believe in it. I really do believe that from the very bottom of my heart. I don't care what the fuck the game is and I don't care how popular it is. You know, if I know that for every world of tanks or you know, one of these three iOS games that make a lot of money, there are a fucking thousand of them that don't. So I don't, I think those are the anomalies. Those are the outliers and I clearly think that if you put a price on your game, then you at least believe in it. And so I'm glad to say that they believe in it and I think it's going to work for them in some",
            "start": 3562.14
        },
        {
            "text": "the outliers and I clearly think that if you put a price on your game, then you at least believe in it. And so I'm glad to say that they believe in it and I think it's going to work for them in some capacity. But it's just sad to see this kind of a level second party exclusive ecosystem just fucking dying. It's just dying. And uh, I like my triple a games as much as anyone, but I like a diversity of games as well. And so, you know, it just, it bumps me. Yeah, that was the ecosystem we were existing in for so long, right? Where it was once middle tier fell away, that it was the independence, these downloadables, these experience you're getting off the PlayStation store are what's satiating you between triple a experiences. Whereas right now is so much triple a, and then it's this things we don't care about coming out on the PlayStation store necessarily. So yeah, I agree. We'll see how it all works out, but I'm glad we're, I think we're on the same page there. It's, it's definitely, I",
            "start": 3596.86
        },
        {
            "text": "don't care about coming out on the PlayStation store necessarily. So yeah, I agree. We'll see how it all works out, but I'm glad we're, I think we're on the same page there. It's, it's definitely, I mean, we've covered PlayStation for a long time. It's changing. Number 11 in an interview with Sony's, Sean Layden as relayed by dual shockers. Our friend Jeff Keeley asked the head of PlayStation about no man's sky. Here's what he said. Quote, I think hello games, Sean Murray and his team had an incredible vision on what they were going to create something never done before. And a very small team had a very huge ambition. Now they're still working on it. They're still updating it. They're trying to get it closer to what their vision was. I played a lot of it when it came out ellipsis. I think what we learned from that is that we don't want to stifle ambition. We don't want to stifle creativity. We don't want to put people into slots where they must execute against an action adventure path",
            "start": 3632.78
        },
        {
            "text": "what we learned from that is that we don't want to stifle ambition. We don't want to stifle creativity. We don't want to put people into slots where they must execute against an action adventure path or a fighting path or a shooting path ellipsis. Nobody in development wants to say that they can't do a thing, right? No one wants to tell someone, no, I can't do that for you. People are really trying. I think looking at the different industries in which I had the privilege of working in the gaming industry is where everybody has the courage to say yes. And they want to try to realize their ambitions. They want to try to make that vision. No one slinks away from a huge challenge. And sometimes you just don't get all the way there at the first go and quote. So there's nothing much to say about no man's sky. We've beaten it in the ground, but I thought that was an interesting little epilogue. Waiting for them updates. Get them updates out. It's too late. I mean, that game is finished. They",
            "start": 3669.02
        },
        {
            "text": "no man's sky. We've beaten it in the ground, but I thought that was an interesting little epilogue. Waiting for them updates. Get them updates out. It's too late. I mean, that game is finished. They might as well stop. I mean, that's the way I really feel about like the Wells poison. It's the no one's playing it like. If you can if you can look at the steam numbers and guard that as PlayStation for as well, no one is playing the game. So you're just wasting your time. That game will not live again. You know, like it's just it's just over. And they really they I like the way Sean Lane puts it. I appreciate and respect the way Sean Lane puts it. But that's that's a lot of spin. Oh, yeah. So Sony, Sony PR and Sony marketing is complicit in that one hundred percent. And to put it any other way is ridiculous. These people know games. They played this game for years. They must have known that it was not going to meet expectations and they were over promising and listening, you know, because",
            "start": 3699.98
        },
        {
            "text": "is ridiculous. These people know games. They played this game for years. They must have known that it was not going to meet expectations and they were over promising and listening, you know, because I was if you as you remember when when all the stuff and I'm like, oh, wait a minute, let's I'm skeptical that Sean Murray ever said this shit. I'm skeptical that he overpromised. And then Jim Sterling did that really great video. I'm like, oh, OK. Like it was very fair video of everything. And I'm like, OK, yeah, this is bullshit. And I don't know why you guys did this. I don't know why you let this happen. You know, it was out of all the games they could have acquired as a de facto exclusive. That's the one I'm like, all right. So I just wonder where it is similar to the second party conversation, what went wrong? Something is going wrong. Something is going wrong in certain pillars of this PlayStation like castle, especially the trophy pillar. We want to help there. But wouldn't you",
            "start": 3739.1
        },
        {
            "text": "what went wrong? Something is going wrong. Something is going wrong in certain pillars of this PlayStation like castle, especially the trophy pillar. We want to help there. But wouldn't you agree, like something's a little weird with some of the shit that's going on, like there is for sure something's weird. I don't. I think it's that maybe is something wrong. I don't know. They've had more more failures in the limelight, more stumbles in the limelight with the spotlight on them than they have in the past. And I don't know. And I don't know where that comes from. I don't know if it's because the knee jerk reaction for me and for you, some of you who cared about PlayStation followed and covered it for so long is, is it the return of the hubris of the PlayStation 3 era or that PS2 to PS3 era? Is that what it is or is it? Yeah. Somebody, we went off of this thing of what this game was supposed to be and threw all this behind it. And by the time we realized it wasn't going to be that way,",
            "start": 3777.66
        },
        {
            "text": "Is that what it is or is it? Yeah. Somebody, we went off of this thing of what this game was supposed to be and threw all this behind it. And by the time we realized it wasn't going to be that way, but maybe with updates it could be, it was too late to throw it off. And then to jump through like, yeah, like, you know, Sony San Diego is like, we're going to try all this free to play stuff. We're going to try putting these games out, you know, in the weird access things and see how they go from there. And they had said from the beginning that was an experiment. But the problem is that we're paying attention to those experiments so that when it does close up shop and they finally fucking put out Kill Strain and then Kill Strain goes away pretty much immediately. The people who worked on it go away immediately get laid off. That's when it's like, oh fuck. Well, they learned. But then what does that mean for DrawndoDeath? Now here, DrawndoDeath is falling on its sword. And like, what does",
            "start": 3821.54
        },
        {
            "text": "away immediately get laid off. That's when it's like, oh fuck. Well, they learned. But then what does that mean for DrawndoDeath? Now here, DrawndoDeath is falling on its sword. And like, what does that mean? And then it's, and then, okay, well, they were promoting Tomorrow Children forever. What the fuck does that mean? There's so many parallels and lines to draw to it. And then it's back to your argument of like, there's just too much shit on the store. There's too many games released because now I don't have the benefit to be able to like, well, yeah, that's all been going wrong. But what about this PSN game I've been playing recently that's doing really well. That's doing amazing stuff. You know what I mean? Like what are we going to hang our hat on Darkest Dungeon? Like this game that was on PC forever and now it's finally come here and doing well off of the, that's not the same thing as putting out an inside or, you know, and having inside be PlayStation first and we incubated",
            "start": 3856.06
        },
        {
            "text": "was on PC forever and now it's finally come here and doing well off of the, that's not the same thing as putting out an inside or, you know, and having inside be PlayStation first and we incubated and we did this. And when it's the opposite, it seems like where Xbox is banging the drum about inside, but PlayStation is a runaway platform. So our contracts are not going to be like they were for Limbo. Insides out a month and a half later. Right. Yeah. I think I mean, it is interesting. It's it just seems like a mismanagement of sorts or a bad decision making. You know, Q games is a great example with it's like they come, they go to you and they pitch the tomorrow children. That's great, guys. That sounds interesting. Well, maybe we'll see a prototype of that. We want more pixel junk games because people fucking like them, you know? Yeah. And no, no, we don't get that. I mean, like, and then they go to David Jaffe instead of giving him a ton of money and being like, you're David Jaffe,",
            "start": 3889.22
        },
        {
            "text": "because people fucking like them, you know? Yeah. And no, no, we don't get that. I mean, like, and then they go to David Jaffe instead of giving him a ton of money and being like, you're David Jaffe, you know? And you deserve the ability to make a 60 dollar retail game because that's what you do. Maybe you didn't want to do that, but I suspect you probably would have. Yeah. They they they put them down a free to play hole. It just seems like it's like you get the right talent or the right something and then you just kind of break it in half. For the Q games thing, I take issue with that of what you're saying, because I think when we're talking about the callback to PlayStation 3 era of what or how the digital ecosystem evolved, it was very much like, oh, cool, you're a trusted developer. You have an idea. Make that game not we're going to go business on you and keep making pixels on stuff. You want to make some weird ass, whatever one off thing, go ahead for it. And that and that. I",
            "start": 3926.02
        },
        {
            "text": "You have an idea. Make that game not we're going to go business on you and keep making pixels on stuff. You want to make some weird ass, whatever one off thing, go ahead for it. And that and that. I mean, that's not a great example. I guess I'm going to say that game company, but I mean, similar right of like, here's three different games we're going to give you. There's no interconnection you go to. But isn't it not weird to you that I guess it goes all the way through. I'm not trying to be conspiracy there, which is like kind of a dearth of PlayStation 4 exclusives like triple A exclusives. Yeah. NAC was bad Killzone Shadowfall. I liked a lot, but a lot of people didn't. The Order 1886 wasn't a good game. Ratchet and Clank comes out to little fanfare. You know, it's better than almost anything until dawn is awesome. And they barely talk about it or promote it. It's just like I'm like, what are you guys doing? Like what is happening? I no one identified until dawn. As a game where I",
            "start": 3967.42
        },
        {
            "text": "until dawn is awesome. And they barely talk about it or promote it. It's just like I'm like, what are you guys doing? Like what is happening? I no one identified until dawn. As a game where I was like, wait a minute, this game's great. Sure. Let's put some commercials, market it. Let's really sit closer to Halloween. Let's like, everyone's going to shit it out. Just shit out that game. You know, and then let Supermassive go instead of being like, hey, guys, like. The letting the go part is, yes, a mistake on their part. The part before that in terms of marketing, I think goes back to the fact of we, you know, used to see PlayStation waste their money on marketing all the time. Do stupid stuff with it. Right. And is this now what it is in, I guess, 2015 when that game comes out that you don't need to worry about marking that game because it is great. We're going to talk about it. Streamers are going to talk about it. Every Halloween, people are going to stream the shit out of that",
            "start": 4000.86
        },
        {
            "text": "don't need to worry about marking that game because it is great. We're going to talk about it. Streamers are going to talk about it. Every Halloween, people are going to stream the shit out of that through Christmas. That was the game. You know what I mean? People were taking home and playing with their families and doing the different things and talking about it, tweeting about it. And I can't watch my mom's reaction to this. And that's about like until dawn was a success for them. It did. I don't know. I think it could have been cool to put out a commercial and try to sell it during an NBA game or whatever. But I think that that's such a shotgun approach to maybe it'll work, maybe it won't. With your dealing with your marketing budgets, you're doing dealing with budget in general. You're I think maybe played that one right. Whereas they played No Man's Sky so wrong and that thing got out of control. I just feel like there is not trying to be like, you know, super negative about it.",
            "start": 4040.22
        },
        {
            "text": "I think maybe played that one right. Whereas they played No Man's Sky so wrong and that thing got out of control. I just feel like there is not trying to be like, you know, super negative about it. I just think that I think, yeah, Superman. I think that there's just I think everyone knows. I think PlayStation gamers feel it inside them. That's something deep inside them, like deep, deep inside. So deep inside them. So deep inside one of their holes. You know that. Yeah. Tell me more. I just feel like I feel I felt this kind of like in me, like where I'm like. Not everything is running properly here. Right. Like another example is like the last Guardian Gravity Rush to same release day. I'm like, what are you doing? Like, what the fuck are you doing? Like that. You know what I mean? Like it's just like it's like there's these little things where I'm like, I'm I'm not concerned because the PlayStation four is a great console. They have great developers, great leaders, you know, good",
            "start": 4076.86
        },
        {
            "text": "it's just like it's like there's these little things where I'm like, I'm I'm not concerned because the PlayStation four is a great console. They have great developers, great leaders, you know, good minds. We know these people. They're smart. And I just wonder. As the PS4 is now being outsold in the United States by Xbox one from three months in a row, as you know, is going to change that, don't worry. We'll see. I think I'm not being serious. I think like. I just think that like something I want PlayStation to see, I want to wall succeeds. I think it's good for the market. I think it's good for gamers to see them all succeed. But I also want to say, like, you know, let's let's let's reflect in an honest way about we've had a good few years here as PlayStation fans, a really stunning few years even at the end of the PS3 lifecycle with the last was all that was great. But now. Well, no holiday games of any consequence. You got a question from Kyle over, I don't know, I'm kind of funny",
            "start": 4125.54
        },
        {
            "text": "years even at the end of the PS3 lifecycle with the last was all that was great. But now. Well, no holiday games of any consequence. You got a question from Kyle over, I don't know, I'm kind of funny dot com slash PSQ. And he says, hey, guys, do you think worldwide studios, he put in quotes, is finally back to pumping out must play triple-A games horizon days gone in the new God of War certainly look promising. I hope so. But, you know, they're still not pumping them out. They're working on it. They've announced them. They're certainly not people have been working on these games a long time, but they were working on them quietly before as well. Getting them out and getting a release schedule and hitting your dates. That's when it will actually be like you're saying the machine is well oiled and it's producing the content it's supposed to be producing where it feels like we have had not a drought of games, but a drought of first party worldwide studios. Here are all the exclusives.",
            "start": 4162.7
        },
        {
            "text": "oiled and it's producing the content it's supposed to be producing where it feels like we have had not a drought of games, but a drought of first party worldwide studios. Here are all the exclusives. This is why you own this machine. Right, exactly. And that's what I'm trying to say. This goes back. This is a great tie back to what we were saying about second party ecosystems about sending games out to die, about not investing properly in marketing, about not identifying games early enough is that why own a PlayStation 4 if all you're going to play on it is the same games that everyone else is playing. Like there's something special about PlayStation or always has been about the exclusives. I'm not saying those exclusives don't exist. I like Killzone Shadowfall. I think it's actually a great game. I think people are really hard on it. I don't understand why. I really liked that game a lot. I think Ratchet and Clank is phenomenal. Phenomenal. One of the best games of the year. Easily.",
            "start": 4200.94
        },
        {
            "text": "game. I think people are really hard on it. I don't understand why. I really liked that game a lot. I think Ratchet and Clank is phenomenal. Phenomenal. One of the best games of the year. Easily. Right. Uncharted 4 was awesome. And we have a little smaller games like Resogun and etc. and so on. It's just that we got to there has to be more. And I understand that the market speaks in terms of they want to play Call of Duty. They want to play Battlefield. They want to play Mass Effect and all these games you can play on Xbox or on PC. And that's great. But like I'm just talking about the PlayStation exclusive ecosystem, the second party ecosystem, when the second party ecosystem especially is dwindling. It concerns me as a PlayStation gamer because I don't want them to move away from that. That was what made PS3 so special. There was a lot of PS3 games that were really fucking special that you had to download that were five or ten dollars. And I look at the plate, we're going to look at",
            "start": 4237.18
        },
        {
            "text": "was what made PS3 so special. There was a lot of PS3 games that were really fucking special that you had to download that were five or ten dollars. And I look at the plate, we're going to look at the drop again. I look at the set. I'm like, where? Why? My name is Mayo, man. You know, so I know I don't know if this is going to resonate with people. I mean, people get mad at me all the time for being negative or whatever, but I think that we all feel it in some respect. You know, like at least I do. I don't I can't speak for you, but I feel it like where I'm like. I mean, it's definitely I mean, PlayStation's identity is definitely different now than it was for PlayStation 3. Is it good? Is it bad? Is it different? Is it me being in a different spot in my life? I'm not 100 percent sure. But I mean, when we talk about this, you know, we talk about the mismanagement of drawn to death, kill strain, all those different things. I think that's part of an experiment. I think they noticed it",
            "start": 4275.58
        },
        {
            "text": "I mean, when we talk about this, you know, we talk about the mismanagement of drawn to death, kill strain, all those different things. I think that's part of an experiment. I think they noticed it was wrong. I give them credit for trying to change. Correct. Course correct. And maybe it is too late. Maybe it's not. I'm not one to say. I still think that drawn to death, you know, I'm not third person arena shooter guy, right? Drawn to death from what I've played. I'm like, well, I am interested in this. I'm not interested to go beta test it for you and see how the servers are working and get fucked up. You know what I mean? Like, I want trophies. I want to play a full final game. So here's a full final game with a price tag on it. Great. Here's my money. I'll give it to you. Yeah. The free to play stuff never was for me. Like I it was on the one hand, I don't feel like we can say these experiments were the wrong way to go. I like seeing PlayStation experiment. I'm more worried you don't",
            "start": 4308.86
        },
        {
            "text": "play stuff never was for me. Like I it was on the one hand, I don't feel like we can say these experiments were the wrong way to go. I like seeing PlayStation experiment. I'm more worried you don't hear more them talking about it more. And that's the whole thing is if they're going to make these experiments, whether it be this or whether it be a Q games, whether you know, I mean, you have to be committed to it until the end. You have to see it through the entire process. And they did that with killstrand and didn't work out fine. That's great. Drawn to death. Let's get it out and see what happens. But then, yeah, where are the next round of here's what's happening in the PlayStation ecosystem? And what I feel like and it goes back to it is like, just where's that that zeitgeist game? Where is that that downloadable game like Tokyo Jungle or or Journey or something like that where it's like and that's why I was bringing up bound. That's why I was bringing up the tomorrow children. I",
            "start": 4343.54
        },
        {
            "text": "is that that downloadable game like Tokyo Jungle or or Journey or something like that where it's like and that's why I was bringing up bound. That's why I was bringing up the tomorrow children. I was bringing up killstrand. And now that game that that temple digital game. Sure. You know, I mean, I think it's a little something different to talk about. But in thinking and I know we're saying that right now. But remember, we are in the thick of triple A season, right? Like this year we did. I mean, you and I both got really into Enter the Gungeon for a while. Right. But that's that's not an exclusive. That's sure. I'm not diminishing. I'm not diminishing the the value of a non-exclusive game. That's not what I'm saying. I'm just saying that we own a PS4 for specific reasons. Part of that reason is to play some exclusive content. You know, I don't think there's any shame in saying that. So it is. Yeah. Enter the Gungeon was awesome. And the Gungeon is playable on other in other places.",
            "start": 4378.26
        },
        {
            "text": "is to play some exclusive content. You know, I don't think there's any shame in saying that. So it is. Yeah. Enter the Gungeon was awesome. And the Gungeon is playable on other in other places. It has nothing to do with Sony. But I mean, that's the whole thing, too. So this is this is a very nuanced argument. This is topic of the show, by the way. This is we obviously stumbled into this as a nuanced argument of what you're saying. So I guess then even the problem wouldn't be that. It's back to what I was saying, right? It's a different PlayStation, a different identity. It is a PlayStation, I guess. Yeah. Where it is, you own a PlayStation 4 and it's the best selling console up until the last three months or whatever year after year, month after month here because of the fact that it just has the games you want to play. And also those games are available somewhere else. But you don't want to go get them somewhere else. That's the thing. And that's the identity they've lost where it",
            "start": 4415.1
        },
        {
            "text": "has the games you want to play. And also those games are available somewhere else. But you don't want to go get them somewhere else. That's the thing. And that's the identity they've lost where it was before we were this banded together. It's the PlayStation 3 ecosystem. We are the underdogs. We all love PlayStation. Well, we finally got fucking trophies and we have a Stardust. We have these amazing games that are just for us that nobody else gets. And now we don't. Right. And that's what made it so special. So that's what I'm saying is like I need them. I need them to recalibrate a little bit. I think they know that internally. Like what is important to your game or what is important to the player on PlayStation 4? What do they want? Well, the question is, do they understand that? Are they recalibrating to that or are they reading the tea leaves? It doesn't matter that PlayStation continues to sell incredibly well. Sure. Xbox is beating it right now, but Xbox isn't beating it right",
            "start": 4449.86
        },
        {
            "text": "recalibrating to that or are they reading the tea leaves? It doesn't matter that PlayStation continues to sell incredibly well. Sure. Xbox is beating it right now, but Xbox isn't beating it right now because they have these awesome Indies. They are beating us right now because they just put out the Xbox S. Right. And so like that's the whole thing. So it could be maybe they maybe it will continue to be that worst case scenario. People worried about it. E3 where it's like, all right, cool. You know, Adam Boyce is gone. Like that team's in a different place now. What does that mean? Where what are the third party? They're going to go get Spider-Man, make a triple A exclusive that makes it, you know, this kind of thing, but not necessarily have to worry about what you're getting day and date. You're going to still get gun down. Well, I want to say gun boots. You're going to get down well. But yeah, it's going to be after the fact. We laid out this year to get Darkest Dungeon. Sure. You",
            "start": 4484.26
        },
        {
            "text": "You're going to still get gun down. Well, I want to say gun boots. You're going to get down well. But yeah, it's going to be after the fact. We laid out this year to get Darkest Dungeon. Sure. You could have played it somewhere else, but we know you don't care. You want to play it on your Vita. You want to play it on for trophies. Yeah. So, you know, I'm not trying to be too hard on them because I mean, they do it. There is a you know, it goes back to that other thing I was saying was there's just too many games on the console, too much crap, too much garbage, not enough curation, too much of the you were talking about Spreadshot, man. I've never seen anything like that. What the PS4 is doing with how many games are published every week. Like, why? Let's let's focus on what makes it special and fun and good and what draws us to it to begin with. And I don't think that, you know, specifically I when I look at the upcoming list of triple A games, I have no fucking issues with what's",
            "start": 4514.9
        },
        {
            "text": "and fun and good and what draws us to it to begin with. And I don't think that, you know, specifically I when I look at the upcoming list of triple A games, I have no fucking issues with what's going on there. I mean, I think they all look awesome and I have high hopes for every single one of them in 2017 and 2018. All of them exclusive to play stuff. Yeah. Yeah. I mean, there's nothing in there that I'm like, I have a major concern. That's the interesting thing. You know, I just filed the kind of funny ballot for game awards. Right. We're nice enough to be one of the judges this year. And when I went through and added my stuff in there, like I left room for you and Tim to go in and put in so we could have conversations. And I knew certain things you guys would add that I'd want it back. But overall, I was just like, man, like I went through all my trophies and I was like, I mean, don't worry, I had fun this year with games, but I didn't see the games that like last year I look back",
            "start": 4544.5
        },
        {
            "text": "But overall, I was just like, man, like I went through all my trophies and I was like, I mean, don't worry, I had fun this year with games, but I didn't see the games that like last year I look back and I, you know, Metal Gear, fucking Emily's Away, like there were games that I was like, oh my God, this was so fucking incredible. And this year I was like, oh man, like Ratchet and Clank is amazing. Yeah, really, really great game. But I'm not like I didn't feel like I had a giant list of those this year. You know what I mean? Yeah. Anyway, number 12, Call of Duty Infinite Warfare is struggling in sales, at least in the UK. Infinite Warfare has sold about 50 percent as well as Black Ops 3 did last year, according to the GFP chart track as relayed by IGN. As the website notes, the game doesn't have a last gen option, but comparing current gen numbers to current gen numbers sees a drop off of forty three point six percent on its own. But context is important because Call of Duty Infinite",
            "start": 4590.02
        },
        {
            "text": "have a last gen option, but comparing current gen numbers to current gen numbers sees a drop off of forty three point six percent on its own. But context is important because Call of Duty Infinite Warfare still has the second biggest selling launch of the year in the UK behind only FIFA 17 and comfortably ahead of its arch rival, Battlefield 1. According to IGN, Activision did acknowledge that it expects sales of this version to drop off from last year. So this ties in with something we'll talk about in a minute about GameStop. Oh, number 13, Take-Two Interactive has reported new sales numbers indicating that Grand Theft Auto five has now passed an absolutely insane, staggering 70 million copies sold since its launch in late 2013. Additionally, the publisher reported strong sales of NBA 2K 17 and Mafia three, both of which sit at four point five million copies shipped a piece. Mafia three, which was published under the 2K Games moniker, was that imprint's fastest selling game of all",
            "start": 4626.66
        },
        {
            "text": "2K 17 and Mafia three, both of which sit at four point five million copies shipped a piece. Mafia three, which was published under the 2K Games moniker, was that imprint's fastest selling game of all time, even with a weak critical response. Take-Two Straws, Zelnick said, quote, In terms of the review and scores of Mafia three, it was sort of an odd anomaly. The scores were lower than we would have liked, but there were a lot of stellar reviews. I think the most prominent reviewers really loved it and recognized that we were doing what we're doing here from the story, art, character and excitement perspective is really unmatched in the marketplace. So I think we and our competitors are seeing some anomalies in the review system, but we take them as they are and we don't argue with it. End quote. That's a very, very loaded statement. So if you see a positive review from Mafia three, they're one of the most prominent voices inside of gaming. All right. So there's multiple reasons why.",
            "start": 4661.98
        },
        {
            "text": "quote. That's a very, very loaded statement. So if you see a positive review from Mafia three, they're one of the most prominent voices inside of gaming. All right. So there's multiple reasons why. And we talked about this on Colin and Greg a little bit, but this is a very I can't believe he actually said this. Stroud Zelnick said this again. In terms of reviews and scores, it was sort of an odd anomaly. The scores were lower than we would have liked. So first of all, we get for people that don't know, triple A publishers and NDA publishers and indies mock review their games. They pay people to review their games. They pay them a lot of money to sit there and write a real review. And then famously, you know, I heard the last of us, for instance, mock review was well below what the game actually scored. So they're not always right. And clearly their mock reviews of Mafia three are higher. That's what I read from that. But it gets more interesting than that. The scores were lower than",
            "start": 4696.66
        },
        {
            "text": "scored. So they're not always right. And clearly their mock reviews of Mafia three are higher. That's what I read from that. But it gets more interesting than that. The scores were lower than we would have liked, but there were a lot of stellar reviews. And then he says, I think the most prominent reviewers really loved it. So that's a really interesting one. So now he's taking shots at reviewers, which is strange, like the prominent review is actually an almost no prominent reviewer I know actually liked it. Yeah. So there's that. And recognize what we're doing here from this. And this is another one. They recognize what we're doing here from the story, art, character and excitement perspective. What is missing here? Gameplay. Huh. That's interesting. So this is the shit that drives me crazy when we don't like a game. People like, well, you got to give it credit for the end. Like, no, I'm getting like that. I'll give it credit. Good job doing that. It doesn't mean it gets points. It",
            "start": 4732.26
        },
        {
            "text": "when we don't like a game. People like, well, you got to give it credit for the end. Like, no, I'm getting like that. I'll give it credit. Good job doing that. It doesn't mean it gets points. It doesn't mean it gets a pass. It doesn't mean that I'm going to sit there and be like the gameplay was super fucking boring driving down to the bayou and back and forth on all this shit. But fucking really boring. And so he leaves gameplay out of the video game, which is fine. There's some games that don't have gameplay and they're fun, but not Mafia three, not an open world game. And we and the story art and the characters were. People loved that. But he says, so I think we and our competitors are seeing some anomalies in the review system, but we take them as they are and we don't argue with it. That's a really interesting sentence, too. He's referencing Bethesda here, I think. And. I can't think of a statement, someone said in the game industry, more loaded with context and subtext than I've",
            "start": 4768.3
        },
        {
            "text": "a really interesting sentence, too. He's referencing Bethesda here, I think. And. I can't think of a statement, someone said in the game industry, more loaded with context and subtext than I've ever, ever. There's so much subtext in here, it's not even funny. Every fucking word is brimming with subtext. He says thousands of words with the sentence. Here are the things we take away from it. Game mock reviewed higher. This is my take on it. Game mock reviewed higher. We argue that people that reviewed the game didn't like it, don't understand the game. We think that the game is great, even though it's not fun to play. And we recognize that it's not fun to play because we don't bring up gameplay. Yes, we didn't try to defend it. And our competitors are also not liking reviews, but we don't argue about it. There's a lot in there, man. When I saw that, I was like, wow, like I'm surprised, like no news outlet really like. If I was at IGN, I would have wrote a huge op-ed about that. That's",
            "start": 4807.62
        },
        {
            "text": "argue about it. There's a lot in there, man. When I saw that, I was like, wow, like I'm surprised, like no news outlet really like. If I was at IGN, I would have wrote a huge op-ed about that. That's that statement. I don't think he's wrong. I'm just saying that like I'm just saying that he's he's he's taking shots. There's a lot of there's a lot in there, man. In that in that, you know, 50 words, whatever. Yeah. Number 14. EA has confirmed that Star Wars Battlefront 2 is coming in the fall of 2017, saying in a financial call that the game will launch, quote, a year from now, end quote, and that the studio is, quote, working very hard at making sure that it is an extremely deep and engaging offering, end quote. The original Battlefront sold around 14 million copies, making Battlefront 2 a massive game for EA. We'll be looking forward to that, hopefully with campaign in tow. For John Boyega. Number 15. According to GameStop, in a conversation with Games Industry International, a host",
            "start": 4849.54
        },
        {
            "text": "a massive game for EA. We'll be looking forward to that, hopefully with campaign in tow. For John Boyega. Number 15. According to GameStop, in a conversation with Games Industry International, a host of October releases underperformed to retail. The company's CEO, Paul Rains, told the website, quote, Our expectation was that the new titles released in October would provide a catalyst for new software sales. But despite gaining share, the titles underperformed our forecasted sales. While the technology brands and collectible segments continue to go rapidly, they will not offset the decline in gaming this quarter, end quote. We'll have to wait and see how if things rebound, especially with the new consoles iterations coming up, as well as Nintendo's new console and a slew of new games across 2017. This to me says. So. I really feel like games are selling fine. I really feel like they're not selling fine at GameStop. Like what I'd be interested to see is the digital sales. I just wish",
            "start": 4892.42
        },
        {
            "text": "2017. This to me says. So. I really feel like games are selling fine. I really feel like they're not selling fine at GameStop. Like what I'd be interested to see is the digital sales. I just wish these guys were more transparent with numbers. Everyone. That's how we have the UK anecdotal Call of Duty sales and the Titanfall 2 stuff beforehand about how it just fell off a fucking cliff compared to Titanfall 1. Yeah. We just don't have context. So these are just statements and words. But I just don't believe that certain games that came out in October didn't sell well. Like Battlefront, Battlefield 1, I'm sure sold very well. Sure. So I don't know exactly what their expectations are. It's interesting that they're getting more into that. It says technology brands and collectible segments. They're not. GameStop's in a lot of trouble. I mean, like it's it's. Would the argument here be what we're talking about earlier, though, that it like it's just not exciting. Battlefield 1, Call of",
            "start": 4926.66
        },
        {
            "text": "They're not. GameStop's in a lot of trouble. I mean, like it's it's. Would the argument here be what we're talking about earlier, though, that it like it's just not exciting. Battlefield 1, Call of Duty, Titanfall. These are all things you expect. These are what you'd want, right? There. Where are the breakout? Next, you're talking about how we're excited about next year so much because it is the return of. Here's Horizon. Here's God of War. Here's these games. Here's more things like Uncharted. Yeah. Here's even Gears, right? They're like, well, Gears is a known quantity. We know what they're going to do. Yeah, Gears apparently sold soft. Yeah. The. I just don't know what gamers are looking for anymore. Like, well, you're an Xbox fan. You want Gears? Like, I just don't. I'm confused by it. First of all, Gears 4 was awesome. We played it. The. But again, it's not. I'm being devil's advocate to an extent. It's not exciting. It's a known quantity. I know what Gears is going to be. And",
            "start": 4965.66
        },
        {
            "text": "it. First of all, Gears 4 was awesome. We played it. The. But again, it's not. I'm being devil's advocate to an extent. It's not exciting. It's a known quantity. I know what Gears is going to be. And maybe that's the thing where, again, where, you know, it's weird to be in the position where I feel like and I mean, as adults, not in our career as people. And the fact of like you played Mafia. Our friends all played Mafia because they're all reviewers. And I read those reviews and watched you play them. I'm like, I don't play Mafia anymore. Right. You know, I in my gears the same way where it's like Gears was fun for that night playing with you. Right. But like, I'm going to go back to Gears. Like, I'm sure there's gamers out there who are the same way who own one of these consoles. See the games come out that have a three or four after them. And they're like, and what is it? It's not setting the world on fire. It's not doing anything new. What do I care? That's the thing with Call of",
            "start": 5002.1
        },
        {
            "text": "games come out that have a three or four after them. And they're like, and what is it? It's not setting the world on fire. It's not doing anything new. What do I care? That's the thing with Call of Duty. Right. Call of Duty apparently selling worse than last year. Because again, it's just like, there's just no Call of Duty. They're in space. That's fine. But whatever. Yep. Yeah. We'll see. We just missed so much context with no numbers. It's annoying. Finally, number 16. There is no wrap up this week. So this is the last story. There's just no game announcements. If you're looking forward to playing Gran Turismo Sport entirely in PlayStation VR, temper your excitement. Fuck. The head of Sony owned studio Polyphony Digital Kazunori Yamauchi told Eurogamer that PSVR quote will be one part of the game and quote but not the entire thing. Quote, one thing we discovered in developing and doing the VR to do the whole game playable in VR is going to be a strain on the players. You can see in",
            "start": 5035.62
        },
        {
            "text": "the game and quote but not the entire thing. Quote, one thing we discovered in developing and doing the VR to do the whole game playable in VR is going to be a strain on the players. You can see in the demo downstairs, there'll be a VR tour mode that'll be included in the game that showcases the VR effects. End quote. Gran Turismo Sport is due out on PlayStation 4 in 2017. I thought this was interesting, too. It's a strain on the players. Sounds like it's gonna be a strain on your studio to make it all into VR. And I think that's why you did. That's why you didn't do it. I don't necessarily blame them, but I think that's an interesting. That was interesting way of putting it. Playing the whole game in VR is gonna be a strain on the players. I think there's probably plenty of people that would love to play Gran Turismo entirely in VR. A lot of people right now think they're going to want to play all of Resident Evil 7 in VR. When you're puking out your fucking face and your holes and",
            "start": 5067.7
        },
        {
            "text": "would love to play Gran Turismo entirely in VR. A lot of people right now think they're going to want to play all of Resident Evil 7 in VR. When you're puking out your fucking face and your holes and everything's dying, you'll see what you think. You want to die out your ear holes, Colin? Sometimes I just want to die. Period. Damn, that was dark. Yeah, I always thought that was weird. I just wish that these guys had said things that made more sense. Old Gran Turismo is going to be playing a little VR that's going to be a strain on the player. That might be true, but that's a weird thing to say. There are probably a significant portion of people looking forward to that game that want to play in PSVR. Just say you don't have time. Like, we've got to get the game out. We don't want to do it in VR. It's not a priority. We don't want you puking out your face holes. Yeah. Colin. Yes. I don't give a fine fuck about GT Sport, but a lot of people do. Me neither. However, it's so far away in",
            "start": 5096.5
        },
        {
            "text": "in VR. It's not a priority. We don't want you puking out your face holes. Yeah. Colin. Yes. I don't give a fine fuck about GT Sport, but a lot of people do. Me neither. However, it's so far away in 2017. If people want to know what came to the mom and grop shops, both digital and retail, where would they go? You go to the upcoming list of PlayStation 4, PlayStation 3, PlayStation Vita, PlayStation VR, and sometimes PSV software by the kind of funny co-founders. Let's see here. OK. Here are the games that are coming out this week. Cartoon Network Battle Crashers comes to PlayStation 4 digital and retail. Use each character's unique attacks and special moves to conquer the elements. Fight your way through all the levels and beat some brutal boss battles. Replay maps with special modifiers to switch up the fun and unlock bonus rooms along the way. OK. Dishonored 2 comes out on PlayStation 4 digital and retail. This is out on Friday. I was about to say. Reprise your role as a supernatural",
            "start": 5134.38
        },
        {
            "text": "switch up the fun and unlock bonus rooms along the way. OK. Dishonored 2 comes out on PlayStation 4 digital and retail. This is out on Friday. I was about to say. Reprise your role as a supernatural assassin in Dishonored 2, the next chapter in the award winning Dishonored Saga by Arkane Studios. Play your way in a world where mysticism and industry collide. Will you choose to play as Empress Emily Kaldwin or the royal protector Corvo Attano? Take back what's yours? I find it hard to believe that's out this week. I mean, I know it is. But in this is I know somebody wrote in, I think, two weeks ago about why aren't we talking about Dishonored? And we're not that big a fan. I keep looking at Dishonored on my shelf, the original, and I'm like, meh. But it's like I and I saw commercials during football and stuff or sporting events in general. People didn't like the commercial. It was during World Series. That's it. I didn't realize it was this close, which is a bad sign. I should I should",
            "start": 5177.98
        },
        {
            "text": "football and stuff or sporting events in general. People didn't like the commercial. It was during World Series. That's it. I didn't realize it was this close, which is a bad sign. I should I should know that kind of thing, seeing as how my job is to talk about video games. But I didn't realize it was this week because whatever. Agreed. I know Watch Dogs next week. I'll be interested to see how Dishonored 2 is. Yeah. Eagle Flight comes to PSVR digital and retail. Developed exclusively for VR, Eagle Flight sends you to the skies of Paris to experience the freedom of flying like never before. 50 years after humans vanished from the face of the earth, nature has reclaimed the city of Paris, leaving a breathtaking playground. You think there'll be some baguettes for us to pick up? I hope so. Un pommes d'etre. Croque, monsieur. Handball 17 comes to PS4 and PS3 digital. It's out the 11th of Friday. Handball 17 features entirely redesigned controls, dynamic artificial intelligence, single",
            "start": 5214.7
        },
        {
            "text": "Un pommes d'etre. Croque, monsieur. Handball 17 comes to PS4 and PS3 digital. It's out the 11th of Friday. Handball 17 features entirely redesigned controls, dynamic artificial intelligence, single player season and career modes, local and online multiplayer modes and several levels of difficulty for an experience that is as close as it gets to the real thing. Yeah. Marvel Pinball Epic Collection Volume 1 comes to PS4 retail. From the Pinball Wizards at Zen Studios comes Marvel Pinball Epic Collection Volume 1, a thrilling collection that bundles together 10 classic Marvel pinball tables based on some of the greatest heroes and storylines in the Marvel universe. That's another one, right? Man, remember how people used to get so excited for Zen pinballs? And I was just like, all right, we get it. It's more pinball. And then that other pinball game came out that was like realistic and they were like competing with each other. Yeah, that was a good Vita game. Played at the DMV once.",
            "start": 5252.94
        },
        {
            "text": "we get it. It's more pinball. And then that other pinball game came out that was like realistic and they were like competing with each other. Yeah, that was a good Vita game. Played at the DMV once. Pinball Arcade. Arcade, yeah. My Name is Mayo comes to PlayStation 4 and PlayStation Vita digital cross by. If you're looking for a next generation gameplay experience in an engrossing open world environment, well, this is not that game. This is the touching story about a mayo jar. This is a clicking adventure that stimulates the real life tapping of a mayo jar. You will unveil its story and maybe you will learn from it. You're excited? That's a really that's a really great write up. Are you going to get the two platinum's for this one? Well, I don't know. I'm going to play it. I don't know if I'm gonna get two platinum's. We'll see. Robinson the Journey comes to PlayStation VR digital and retail. When the Esmeralda crashes on Tyson three, a boy named Robin is left stranded. He must rely",
            "start": 5289.1
        },
        {
            "text": "I'm gonna get two platinum's. We'll see. Robinson the Journey comes to PlayStation VR digital and retail. When the Esmeralda crashes on Tyson three, a boy named Robin is left stranded. He must rely on his wits and Higgs and A.I. companion from the ship to survive as he searches for the lost crew and comes face to face with dinosaurs. Robin discovers that Tyson three is not the paradise once promised. That game looks really fun. Yeah, that's great since we saw that debut trailer. I've been looking forward to it. I can't believe it's another one's here already. But exciting reason to dust off PlayStation VR if you haven't used it. Indeed. Root Letter comes to PlayStation 4 and PS Vita digital and retail out the 10th. That's a Thursday release. Root Letter is the first in a brand new Kadokawa game mystery series, a collection of visual novels with exceptionally high production values set in Shinmei Prefecture, a place rich in history, culture and natural beauty. Root Letter revolves",
            "start": 5322.38
        },
        {
            "text": "game mystery series, a collection of visual novels with exceptionally high production values set in Shinmei Prefecture, a place rich in history, culture and natural beauty. Root Letter revolves around the mystery of Fumino Aya, your old high school pen friend, pen friend, I think you can tell. Your pen friend. Who went missing 15 years ago. Kevin's my pen 15 club friend. Small radios, big televisions comes to PlayStation 4 digital descend into abandoned factories in search of lost cassette tapes that hold boundless virtual worlds. Explore, manipulate and distort the tapes to make them reveal their secrets. Solve mechanical puzzles and map the winding halls of these empty monoliths. Will you be able to find the way out? Probably not. And finally, Sword Art Online Hollow Realization comes to PlayStation 4 digital and retail. Links start into Sword Art Online Hollow Realization, an exciting new action RPG written under the watchful supervision of Sword Art Online creator Ricky Kawahara.",
            "start": 5357.7
        },
        {
            "text": "PlayStation 4 digital and retail. Links start into Sword Art Online Hollow Realization, an exciting new action RPG written under the watchful supervision of Sword Art Online creator Ricky Kawahara. Kirito receives a single mysterious message, a cryptic I am back to end crowd and is drawn once again into a familiar world in which he was once trapped. That's it. That's it. Those are the games. What's your pick of the week? Gotta be Robinson. Yeah. Do you think it's going to pan out? I'm worried about it because Eagle Flight did really well, too, in terms of people enjoying that one coming up. Dishonored is going to be it for a lot of people. I think My Name Is Mayo, if it's an hour long platinum, is pretty fucking... We'll get to the trophies on that shortly, because who knows how long it's actually going to take. I mean, this guy says, I mean, you're telling me I can't trust Kyle? I'm saying that you can't trust anyone. Oh, my God. Even you? What about Kevin? What about him? I thought",
            "start": 5397.58
        },
        {
            "text": "actually going to take. I mean, this guy says, I mean, you're telling me I can't trust Kyle? I'm saying that you can't trust anyone. Oh, my God. Even you? What about Kevin? What about him? I thought you wished him away. No, but he's right there. So he can never leave me. I love you, Kevin. He gave me a thumbs up. Colin. Yes. What's happening, Trove Time? I'm talking to you about Trove Time. Let's start. Oh, Jesus Christ. I'm going to do something I've never done on PSI Love You XOXO. I got to pee. Really? This has been an hour and a half. This is usually the full length of a show. We've just been having such a great show, but I've been drinking so much fluid today, I guess. So I'm going to pee. All right. Do you want Kevin to vamp with you? No, let's just cut this out. We'll say we'll cut it out, but you won't do it. Yeah, I was going to say, I'll make a note, but fuck you to see if I actually do it. I'm going to read while you're gone. I peed. Colin. Yes. Troveys. Let's start with My",
            "start": 5433.3
        },
        {
            "text": "it out, but you won't do it. Yeah, I was going to say, I'll make a note, but fuck you to see if I actually do it. I'm going to read while you're gone. I peed. Colin. Yes. Troveys. Let's start with My Name is Mayo. Yeah, let's do it. Forty-six bronze trophies, zero silver trophies, four gold trophies and a platinum. So is this really? All right. So there are a bunch of bronze trophies hit. You can see the hits. Hit the Mayo five times, hit 20 times, hit 50 times, 200 times, 350 times, 500 times, 550 times, 700 times, 1500 times, 3000 times, 5000 times, 8000 times, 10,000 times. So those are a bunch of the trophies. Damn. Unlock all the rewards as a goal trophy. Wow, this is a joke. So this will cheer you up. Hit Mayo 75 times where the bikini hit this 50 times. Keep wearing the leopard hit this 500 or 100 times. Tap it wild and free. There's a bunch of these, so you just have to hit the Mayo jar apparently. Jesus Christ. All right, I don't really get it. Dishonored two, 38 bronze, 10",
            "start": 5478.58
        },
        {
            "text": "this 500 or 100 times. Tap it wild and free. There's a bunch of these, so you just have to hit the Mayo jar apparently. Jesus Christ. All right, I don't really get it. Dishonored two, 38 bronze, 10 silver, two gold and a platinum. I was looking at these trophies because I remember one of the things about Dishonored that I thought was like crazy was that you had to get through the game without being seen. There's one of those in this one as well. So there's a bunch of story related ones here, but then the biggest one that I thought was interesting was complete the game without killing anyone as a goal trophy and then complete the game in high chaos, complete the game in low chaos, finish the game with Emily, finish the game with Corvo. So you have to beat the game at least twice. Complete the game without any supernatural powers. Finish the game without being spotted. This is a hard trophy list. Sure. And maybe too hard. But this is more towards the end in which I like it as opposed to",
            "start": 5531.62
        },
        {
            "text": "game without any supernatural powers. Finish the game without being spotted. This is a hard trophy list. Sure. And maybe too hard. But this is more towards the end in which I like it as opposed to these easy ass. Because Erin brought up a good point. She's new right to the trophies to PlayStation. And she's like, but why does it not mean anything if a gold trophy in this game is easy and a gold trophy like they're the same thing? And I'm like, that's true. I can't explain it. That's just the that's just what we that's how we exist. There's no like arbiter being like, this is too hard for a gold trophy or whatever. As we said, the trophy department of PlayStation not doing their job. I agree. Cartoon Network Battle Crashers has no platinum, 11 bronze, two silver and a gold. Which is shocking. This one basically says that you have one for a visit. All the rooms in the bonus rooms defeat the final boss. You get a gold trophy. There seems to be some character related ones as well. And",
            "start": 5572.18
        },
        {
            "text": "This one basically says that you have one for a visit. All the rooms in the bonus rooms defeat the final boss. You get a gold trophy. There seems to be some character related ones as well. And then finally, Robinson, the journey. Twelve bronze, thirteen silver, five gold and a platinum. So you get trophies for finding and scanning construction units, science units, etc. And so on. It's basically a lot of like discovery, building, finding are basically all of the kinds of things in here. So locate something, build something, scan something, reveal something, etc., etc. Interesting. OK, I hope this game is good. I hope this pans out. Me too. And that's it for trophies. There's not too much else of interest to going up this week. Well, don't figure out trophy hook yet. By the way, I'm sorry. Call of Duty. We talked about Infinite Warfare last week and I was like, I don't understand what these specific trophies are all about. At the bottom of the list, they're for Zombie mode or whatever",
            "start": 5614.1
        },
        {
            "text": "Call of Duty. We talked about Infinite Warfare last week and I was like, I don't understand what these specific trophies are all about. At the bottom of the list, they're for Zombie mode or whatever they're going to call them. Does that make you excited or not excited? I like Zombie mode. So yeah, that's good. Super Cerberus wrote in just like you can to KindaFunny.com slash p.s. Q and says, Hey, Grawlin, I've got a quick question that you guys can talk and toss into trophy time. A new update for the Xbox one added a small but sweet detail. Ultra rare achievements now trigger a more dramatic sound and appear with a new diamond icon. So you know that you earn something extra special. Would you guys like to see this feature or a feature such as this be implemented on PlayStation 4 to make those platinum or other trophies more satisfying? It's a cool idea. Yeah, it is. I'm fine with I'm fine with the ping as it is. The one thing that confuses me, Greg, and we've talked about this in the",
            "start": 5657.58
        },
        {
            "text": "platinum or other trophies more satisfying? It's a cool idea. Yeah, it is. I'm fine with I'm fine with the ping as it is. The one thing that confuses me, Greg, and we've talked about this in the past, is the screenshot shit where they get. Yeah, this loading screen is really great. Terrible. Open a treasure chest. Just a shot of treasure. Like, why is this a good idea? It would be like a good idea if somehow it took screenshot and this would be impossible. Obviously screenshots for like the last 30 seconds, like around where it wants to take it. Because, yeah, it's always just you standing there looking at something, loading screens, just nothing. I just don't get it. A grenade explosion. It's like, whatever. Yeah, I would say one out of every 30 is like, OK, that's a cool screenshot. But otherwise, yeah, why the hell are you doing this? I think it's a cool idea. I'm not a big. I mean, I think the trophy pops always been something that could be improved on. I think the newest update",
            "start": 5691.34
        },
        {
            "text": "otherwise, yeah, why the hell are you doing this? I think it's a cool idea. I'm not a big. I mean, I think the trophy pops always been something that could be improved on. I think the newest update didn't do much for it. I don't like it being on the white. It gives you less information now, it feels like, too. It's like, what the hell is going on? It is cool that you can see by going into the trophy and pressing square now, you can see the hidden trophies, which is pretty neat. But yeah, I'm fine with it as it is. I'm not doing it for the fucking spectacle of the pop. I'm doing it because I just like it. Sure, but I like the little thing of like, hey, not even so much as like, I don't need a special pop for the platinum. I think it'd be cool if it was showing you an extra special trophy. Like we talk about rarity and you go, you know, PSN profiles, you see what's your most rare trophy, how this all happens. It'd be cool if something popped up and it was like, hey, heads up, you just",
            "start": 5733.3
        },
        {
            "text": "Like we talk about rarity and you go, you know, PSN profiles, you see what's your most rare trophy, how this all happens. It'd be cool if something popped up and it was like, hey, heads up, you just got a trophy that is ultra rare, that only, you know, point one percent of the playing population has actually gotten. Right. Because I do like that stat. I love that when you pop in. Yeah, it's cool. PSN profiles. What we realize about PSN profiles for as much as I love that site is that their statistics are totally wrong. Sure. Because they're only looking at their own player base of people that manually put their name in to ingest in the system. The trophies are always way rare, way, way, way, way, way rare on the PSN. And I always like looking at the trophy that you have to get in the game and seeing how many people never even got to that point. So like 97.4 percent. That's when you see like when you're playing a story based game and you can see when people started dropping off and",
            "start": 5768.38
        },
        {
            "text": "and seeing how many people never even got to that point. So like 97.4 percent. That's when you see like when you're playing a story based game and you can see when people started dropping off and just like, you know, it's good information. Yeah, it's like that's the thing is most people, people bust our ball sometimes for not finishing games. We finish games when we can and we finish a lot more games than normal person, I assume. But it's not at all uncommon. I mean, we're talking about like 10 percent of people are really finishing the games they buy. So it's just people just drop out. They have other things to do. But it's interesting to see that with statistics, you know. Anth Anonymous wrote in to kindofunny.com slash psq just like you can. It says, greetings Miller and Moriarty. At the time of writing, there were about 100 mods for Skyrim special edition on PlayStation 4. Regardless of the whole controversy involving Bethesda and Sony with the availability of the mods on the",
            "start": 5800.42
        },
        {
            "text": "At the time of writing, there were about 100 mods for Skyrim special edition on PlayStation 4. Regardless of the whole controversy involving Bethesda and Sony with the availability of the mods on the PlayStation 4, there's something else I want to pick your brains about. Mods on Skyrim PS4 disable all trophies. Part of me is upset because I want my trophies, but I understand why. I've never used mods on games, but I would like to see what the fuss is all about. How does this play into the way the industry is going? E.G. PS4 Pro, Scorpio, iterative consoles between generations. Do you think console mods will be a thing of the future and how would trophies be affected? Spanx guys, he says, which I'm not a big fan of. P.S. I love you, but don't tell my fiance. I'm not a big fan of that either. I think that sucks. I haven't looked into it, obviously. I'm done with Fallout. The DLCs, no bueno. Didn't have a fun time jumping back in. Really? Even the one where you go to main? Yeah, no, no.",
            "start": 5837.5
        },
        {
            "text": "I think that sucks. I haven't looked into it, obviously. I'm done with Fallout. The DLCs, no bueno. Didn't have a fun time jumping back in. Really? Even the one where you go to main? Yeah, no, no. I put all that in there and I was just like, I don't know. We talked about this on the show, I think, where I just jumped in and it's been so long. I'm so disconnected from that character. All of the role-playing aspect is so removed now where it's like, all right, well, I have the platinum and there's no, I don't care who I'm, who did I side with? What did I do? Why did I do that? The game, it's hard to jump back in. Yeah, exactly. And I think it's that thing where the game was like, as much as I, you know, I had a great time with Fallout 4, don't get me wrong, but it's like we talked about where Fallout 4 is special edition, Fallout 3, which isn't bad, you know, but it's again, not exciting. And so I'm no longer invested in, I don't sit here and tell you like, oh man, I debated this",
            "start": 5878.22
        },
        {
            "text": "where Fallout 4 is special edition, Fallout 3, which isn't bad, you know, but it's again, not exciting. And so I'm no longer invested in, I don't sit here and tell you like, oh man, I debated this decision. How did I do this? But I was like, now I remember running around, I had some cool outfits, Taylor Swift looked funny. I fucking hated the fucking community building trophy and trying to get my happiness. You know what I mean? Like there's no like, when I jumped back and I'm like, all right, I was with the railroad because of X, Y, and Z and da da da da da da da. It's like, all right, whatever. Yeah. As far as the mods are concerned, I really am a firm believer and I think we're going to find out with Pro, with Scorpio, with some mod support. I really do feel like this is kind of, all of this goes against what console gaming is all about. Simplicity, static experiences. I don't mean static in a pejorative way. I mean, it's a static experience, but the game works on all of our",
            "start": 5909.78
        },
        {
            "text": "all of this goes against what console gaming is all about. Simplicity, static experiences. I don't mean static in a pejorative way. I mean, it's a static experience, but the game works on all of our consoles and has the same content, all that kind of stuff. I just don't think that people play console games for deep customization. Otherwise you play on PC. So my assumption is that mod support is not going to be all that important in either of those games. But they're very important on PC. I'm saying on console. I don't think you're going to see this light a fire where all of a sudden everybody needs what they want, right? They need to have all these different things. They need to get mods. They need to get out the door. No, it's not going to happen. That's not what we play these games for. Yeah. So we'll see. We have some good data. It seemed like Bethesda had to jump through some hoops to get it on PS4 in particular. I just don't know if that's necessarily worth it for them to do. I",
            "start": 5948.7
        },
        {
            "text": "Yeah. So we'll see. We have some good data. It seemed like Bethesda had to jump through some hoops to get it on PS4 in particular. I just don't know if that's necessarily worth it for them to do. I just don't think people have never been like, I wish I can mod this on. I just I appreciate what they're trying to do. People say that, but I don't think they actually care. People say a lot of things. People say they use the optical port on PS4 and then they got rid of it. True. True, true, true, true. So clearly people weren't using it. I got a dear Shuhei for you, Colin. OK. This one came, of course, to kindoffunny.com slash psu where you can ask your question or in this case leave a message for Shuhei Yoshida. Or whoever from PlayStation listens and see if you want something changed. Hi Colin and Greg. My name's 007. I have a dear Shuhei request. While I browse the PS store, I usually add games to my wish list because I'm interested and not ready to buy. Now sometimes these games go on",
            "start": 5988.42
        },
        {
            "text": "and Greg. My name's 007. I have a dear Shuhei request. While I browse the PS store, I usually add games to my wish list because I'm interested and not ready to buy. Now sometimes these games go on sale and I completely forget they're on my wish list. This happened to me with the order 1886. I didn't want to pay full price, but when I was on sale for $7 and I would have been all over that, I missed it. The only I only heard about it from watching your show the following week. Do you think Sony should could set up a service where you can get an alert or maybe an email when one of your games on the wish list goes on sale? Thanks for all the great content. They could. They shh. They won't. They won't because they have a million other fucking things on fire over there that they need to worry about. This is not one of them at all. And also from a business perspective, I'm sure they don't want you doing that at all. They're not going to give you a tool to be like, hey, instead of buying the",
            "start": 6023.78
        },
        {
            "text": "This is not one of them at all. And also from a business perspective, I'm sure they don't want you doing that at all. They're not going to give you a tool to be like, hey, instead of buying the game right now for X amount of money and giving us X percent of the money, we're going to give you a chance to wait for it to go on sale. And like totally, totally encourage you to do that. No, very pro consumer. But yeah, it doesn't make any sense from a business perspective. I agree. Yeah. So nice idea though. It is a nice idea. Man, we've been going a while. Let's do, let's do some hot issue reader mail though. Right. Okay. As always, I want to give a shout out to Jericho over on kind of funny forums.com who goes through and organizes these questions and make sure the thread goes up and puts up everything about the show and does all these awesome things. And he cries. Does he cry? I heard he cries. Wraps himself up in a blanket at night. The fetal position and just cries. Until the next",
            "start": 6065.7
        },
        {
            "text": "up everything about the show and does all these awesome things. And he cries. Does he cry? I heard he cries. Wraps himself up in a blanket at night. The fetal position and just cries. Until the next episode comes up. All right. Good to know. I did not know that about that. We should. You should probably get some help. You should probably get some research and you know, talk to just cries and cries and Jericho don't cry so much. I know you're in Germany over there, but it's okay. You'll go back to us one day in the United States of America, the best country in the world. See how this election is going to go today. Oh, thank you very much. Bio shocking the world wrote into kind of funny.com slash p s q and says, what's up guys? I have a question about the walking dead season three, aka new frontier or whatever the fuck. My question is simple. Where is it? The game is set to release in fall 2016 and the developer said it would really sometime in November. I haven't heard anything about",
            "start": 6092.18
        },
        {
            "text": "frontier or whatever the fuck. My question is simple. Where is it? The game is set to release in fall 2016 and the developer said it would really sometime in November. I haven't heard anything about it since E3. So do you guys think it will be pushed to 2017? Thanks you guys for everything you do. P.S. I will always love you. Even Kevin by how shocking the world. I don't remember them saying the November part. I remember 2016 for sure. This is totally, I still think you're going to get episode one in 2016. That's telltale style that they won't talk about the game until it's a week before they release it. Just like you pay attention to the Batman episodes. It's the same thing, right? We'll drop a trailer and then it'll be out the next week or the week and a half. So it'll be the same thing here where when they're finally ready to ramp up and be like, yeah, walking dead is still happening. Here's episode one. I think you'll get episode one before the end of the year, but I would think",
            "start": 6132.98
        },
        {
            "text": "here where when they're finally ready to ramp up and be like, yeah, walking dead is still happening. Here's episode one. I think you'll get episode one before the end of the year, but I would think that is happening. Walking dead is happening, but at this point I'd imagine you're going to get it in December rather than here. Colin, would you like some completely untested app advice? I suppose. My cool wrote in the kind of funny.com slash p s q and says, hi Greg and Colin. I keep hearing in recent shows how you are both iPhone users and why should the coolest dudes in video games use superior phones? Well, I feel it's my duty to share with you and all of our best friends. Some must have iPhone apps that every PlayStation enthusiasts should know about. They might not. They might be available on Android, but who even cares? I agree. Number one. Yeah. PSN app. That's why a PSN app, a great app for tracking your trophies and your fellow best friends with guys to assist you in your hunting.",
            "start": 6174.46
        },
        {
            "text": "on Android, but who even cares? I agree. Number one. Yeah. PSN app. That's why a PSN app, a great app for tracking your trophies and your fellow best friends with guys to assist you in your hunting. The second one he puts up is PS deals. Awesome app to see what the latest deals in the PlayStation store are with the functionality that you can set up a wish list with notifications when a game goes on sale. The he says the plus version has no ads. Both apps are beautiful and I'm sorry, both apps have beautiful design worthy of the iPhone. Let me know what you think and enjoy. Well, my cool. I read this about two hours ago when I put it in there, so I haven't tested those episodes, but they sound cool, especially the one about the wish list thing, which actually answers something we already talked about in the show. So jump into that. Ladies and gentlemen, get excited about that. How about some more help today? The best friends are just helping each other out. Mako soldier writes in and",
            "start": 6216.62
        },
        {
            "text": "talked about in the show. So jump into that. Ladies and gentlemen, get excited about that. How about some more help today? The best friends are just helping each other out. Mako soldier writes in and says, Hey guys, I'd like to shed some light on some information regarding the PSN that the community should know before they buy a pro or even a second second, a second standard PS4. For those of us who already have embraced the digital future, PSN has huge restrictions on how it handles a second console. Currently, you can link your account to a PS4 as a primary console and everyone who signs into that system, such as your family, can play your games. However, on a second console that you sign into, only you can play the games you own, unlike PlayStation 3. So in a household with two PS4s of any type, your primary would have to be the family console and your secondary PS4 would have to be only used by yourself. However, this effectively locks you out of your automatic cloud saves, remote",
            "start": 6250.1
        },
        {
            "text": "any type, your primary would have to be the family console and your secondary PS4 would have to be only used by yourself. However, this effectively locks you out of your automatic cloud saves, remote downloading of other games via PSN app or the web and remote play, since those can only be done with your primary. Prepare to do everything manually on the non-primary PS4. Please, Shuhei, let us have two primary PS4s. Mako soldier. That'd be really nice. That's not going to happen because of the rampant fucking abuse of the PS3 system. Remember when you're all game trading nonstop? You could have five primary PS3s. I wish I could have two primary PS4s, but I understand completely why they were. I mean, if I was them, I would have locked out on a PS3 a long time ago and I would have definitely not made PS4 with it. It's a great thing. It's one of those things I always forget the weird shit you and I run into and like the industry at large run into with having multiple PlayStation 4s in a",
            "start": 6306.9
        },
        {
            "text": "not made PS4 with it. It's a great thing. It's one of those things I always forget the weird shit you and I run into and like the industry at large run into with having multiple PlayStation 4s in a way nobody else does. Where it is that thing like, fuck, wait, did that? I have to, I'm in my bedroom, so I have to automatically upload it. But if I play in the living room on my primary PS4, that goes up. And if I bring a thing here and dot to dot and then which save is my real save? What do I want to upload? How do I want to do that? And then, yeah, the fact of if you even if you only have one PS4 and you ever run into any problems with it, make sure you go in and identify that as your primary system. Because if you remember a while back when the PSN went down, a couple of our friends were online, be like, I'm locked out on my games. What the fuck? And like most of the responses were like, we got to activate it. This is my only piece for you, but you actually have to go in and say this",
            "start": 6344.14
        },
        {
            "text": "online, be like, I'm locked out on my games. What the fuck? And like most of the responses were like, we got to activate it. This is my only piece for you, but you actually have to go in and say this is your primary PS4 to be able to play your downloaded games on that hard drive without without having an internet connection. Yeah, without the always online stuff in the little things to do. Colin, would you like to talk or hear a question based on alienation? It is not about alienation. Sure, download a digital copy or PlayStation, all stars, battle rail to touch. There's no alienation is fine. I can't talk about that game anymore. It's not going to happen. Kyle writes in and says, Hey, guys, hope this finds you well. Recently, I've been playing a lot of Alien Nation, and I can't help feeling like Colin wrote off this game too soon. It has all the polish and gameplay perfection that Colin praises out of other housemarked games with gorgeous explosions of color, fantastic leaderboards",
            "start": 6380.3
        },
        {
            "text": "like Colin wrote off this game too soon. It has all the polish and gameplay perfection that Colin praises out of other housemarked games with gorgeous explosions of color, fantastic leaderboards and recently added leagues that encourage continual play. I typically trust Colin's judgment, but I feel like this game deserves another chance to win his esteem. I guess this leads me to my main question. Has there ever been a game you simply couldn't get into, even though you knew the game was a great game? Thanks for all you do, Kyle. Yeah, it happens all the time. I think we've talked about that a lot. I don't want to fucking thread on the forums about how we keep answering the same questions. Right. Oh, the free podcast is too good. It's too fucking good. They're answering too many of our questions. We're fucking around. Don't get all pissy. But Kevin, Kevin, he's about to die. OK, Kevin, are you dying? He's shaking his head. Yeah, he's dying. He's dying. Yeah, I mean, for me, it's always",
            "start": 6422.26
        },
        {
            "text": "We're fucking around. Don't get all pissy. But Kevin, Kevin, he's about to die. OK, Kevin, are you dying? He's shaking his head. Yeah, he's dying. He's dying. Yeah, I mean, for me, it's always the Half-Life games I go back to where I'm just like, I don't I think these games are good, but I understand everybody else says they're amazing. So I'm wrong, whatever. But fine. Have it your way. Yeah. Grim Fandango, all the adventure games are those guys. Oh, yeah. That's not a good one to portal and portal to I was like, oh, but I know, but I know that people really love them. I'm not. I bet they're just not for me. Sure. It's funny because Alienation is on that short list of my mind of games where I'm like, you know, when we talk about like when things free up, you know, it's Final Fantasy 15, I guess. Well, I do. And that's one of those games where I'm like, I really should probably go back. You're not going to, though, because you're safe again. You're still the 100 friends. They were",
            "start": 6463.74
        },
        {
            "text": "I guess. Well, I do. And that's one of those games where I'm like, I really should probably go back. You're not going to, though, because you're safe again. You're still the 100 friends. They were patched that who the hell knows? Probably not. You want to roll the dice? Housemarque patches those things. There are other companies like, you know, Ubisoft, for instance, they'll patch their digital games. But I don't know if they ever did for Alienation. I don't know how to look at the notes. All right. Okay. I'll reach out to my friends at Housemarque and inquire directly. How's that for you? I'd like that. I would appreciate that. But I think they would have emailed me because I was the one walking them through it and the problem was they were just like, no, they don't like you. Well, I know they don't like me. I'm aware I'm the guy who breaks all their games and then bitches about it online. You just look past and you're like, best fucking other. They should buy these guys. Why haven't",
            "start": 6489.86
        },
        {
            "text": "they don't like me. I'm aware I'm the guy who breaks all their games and then bitches about it online. You just look past and you're like, best fucking other. They should buy these guys. Why haven't they bought them? That's you. Yeah, I mean, that's Housemarque's dick. First it started as your dick. Game Housemarque's dick. They told me whenever I'm in Finland, I can stay. I can hang out at their office whenever I want to do work. And I'm like, I'm like, I'm going to do fucking work if I come through. It's dark at 1230 in the afternoon in Finland, so I'll probably have a lot of work to do. Thank you for the offer. Appreciate you guys. That's what the sticker is on my laptop, by the way. A lot of people ask what the mystery fifth sticker is. Right there. Housemarque's logo. Okay. Greg. Unbiased though, huh? Gamergate. Final question. Tobias. You have to. Housemarque bought you off. With this sticker and the games you always talk about how they keep releasing broken. Journalist. We've",
            "start": 6523.02
        },
        {
            "text": "though, huh? Gamergate. Final question. Tobias. You have to. Housemarque bought you off. With this sticker and the games you always talk about how they keep releasing broken. Journalist. We've talked a little bit about PSX at the beginning of the show. Remember, ladies and gentlemen, PSX is coming up. We'll be there Sunday at noon. That is December 4th with PS. I love you. XOXO. And remember, I pimp the game. Heartforth, Alicia. You should go see because it sounds interesting. If you are a developer who has a game at PSX, please make sure you keep hitting us up, letting us know about other games so we can tell people to go see them. But what I want to do here is talk to Nick. Nick wrote into kindofunny.com slash p.s. Q and says, Hey, Greg and Colin, I'm Nick. Last episode, you asked what guests we thought you should invite for PSX because remember, I want to have some people on the panel. We had Shu He before we've had comments before we've had said before we had that G of course you",
            "start": 6560.54
        },
        {
            "text": "guests we thought you should invite for PSX because remember, I want to have some people on the panel. We had Shu He before we've had comments before we've had said before we had that G of course you before. Who would you guys like to see? Surprisingly, only Nick reached out at least on the forums. I looked through the comments. Didn't see anything there. Didn't see any tweets either. Much lazy. You're all fucking slacking. Well, guess you thought we should invite for PSX, although not directly PlayStation related. Michael Condrey has been someone who I've admired for a long time. I think it'd be awesome if he was there to give his insight on the show. Thanks a heap for all the incredible and amazing stuff you do. Nick from London. PS. I love you. XOXO. Not necessarily PlayStation related, but it's that's the thing. Condrey, of course. Sledgehammer games. Working on the Call of Duty stuff now had worked on Dead Space. Great dude. Friend of the show. Friend, a friend of a kind of funny",
            "start": 6601.62
        },
        {
            "text": "but it's that's the thing. Condrey, of course. Sledgehammer games. Working on the Call of Duty stuff now had worked on Dead Space. Great dude. Friend of the show. Friend, a friend of a kind of funny in general. Yeah, that's the thing. I don't know if he'll be at PSX, but he's a good pick. And since that's the short list, I doubt he'll be up. That's the short list. Now, do we want to have Sledgehammers? Michael Condrey on there. We're open to more suggestions. I mean, I'm trying to think like I would actually love Jaffe. Yeah. David Jaffe listens to the show. Yeah, he does. David Jaffe. He'll be there. I'm sure he'll be there. Are you a fucking coward, Jaffe? Do you want to finally don't say that? Bring that fucking sweet ass to the PlayStation. I love you show everyone Jaffe wouldn't say beyond. Yeah, that was. And then he apologized. I don't know. That was so awesome. He is a man, but he's a man enough to come on this show live. I'd love that piece. I can really pick his brain. I",
            "start": 6636.5
        },
        {
            "text": "beyond. Yeah, that was. And then he apologized. I don't know. That was so awesome. He is a man, but he's a man enough to come on this show live. I'd love that piece. I can really pick his brain. I mean, that's why I love. I love guys like David Jaffe, Cliffy B, these OGs that you just pick their brain about almost anything. We don't even have to talk about drawn to death. He might not want to talk about that game anyway. Like you might want to talk about other things. Well, it'll just been released, so it won't matter because it'll be PSX stage. Here's drawn to death out now. Ironically, he's going to come out of an ice cream truck when they announce it. Hey guys, remember this? Maybe you'll remember my new game. That was awesome. So Jaffe, I guess there you go. That's what we're proposing you. If you're man enough, we also play the man Jaffe. Bring if you're man enough, bring your PlayStation Vita to. We can finally do that Tower Fall Ascension match where I was talking about.",
            "start": 6675.62
        },
        {
            "text": "you. If you're man enough, we also play the man Jaffe. Bring if you're man enough, bring your PlayStation Vita to. We can finally do that Tower Fall Ascension match where I was talking about. Remember, that was an old thing, an old cut. Maybe a little ad hoc Tower Fall. Yeah, why not? A little old ad hoc. Yeah, everybody bring it. We'll have one giant tower. We're going to have a Tower Fall minute break. Bring your Vita to PSX. Like two things. If you don't have a Vita, don't even come to PSX. I don't want to see you. Sure. Number two, I don't want to look at your face. All right. I don't even want you in Orange County, anywhere in Orange County, if you don't have a Vita. Okay? Get out. Yeah. Yeah. Number two, just bring your Vita. Here's no, and number three. Don't bring your 3DS. Actually, this isn't even number three. This is between you and me, I guess. What I've been kicking around in my shower time, my play time, what I've been kicking around is, I think, and this is a tall",
            "start": 6711.18
        },
        {
            "text": "this isn't even number three. This is between you and me, I guess. What I've been kicking around in my shower time, my play time, what I've been kicking around is, I think, and this is a tall order, but I think we can do it. I think at PSX, during our panel, PS, I love you, XOXO, Sunday, noon, we debut the video for the PlayStation Vita relocation program. Okay. Now that means we have to film the video for the PlayStation. I have to write it. No, I was going to write it. You don't even know what you're doing. Yours will be way too long winded. It'll be fucking four paragraphs in before we say Vita relocation program. Ken Burns, they got them. I definitely am the Ken Burns of podcast stories. You're the one of writing. But I think we should do that. Part two before we even know what the hell the podcast is about. What is going on? Connor, are you ready to meet your best friend of the week? Yes. This is PS. I love this best friend, XOXO. This is where one of you beautiful bastards",
            "start": 6752.9
        },
        {
            "text": "hell the podcast is about. What is going on? Connor, are you ready to meet your best friend of the week? Yes. This is PS. I love this best friend, XOXO. This is where one of you beautiful bastards writes in to the kind of funny forums. You go to there. You put your PSN name in. We send you friends because you tell us who you like to play. We have a success story. Actually, before we jump in, you might remember Ruby Juice or the PSN name Blacky Moo. He wrote in looking for friends to play farming simulator with. How could I forget? Yeah, of course. I remember they want to play Lumberjack. Wherever the fuck that other thing is. I want to play forestry simulator, so I think it'll be simpler than fucking farming simulator because this is just trees. That's easy. Anyways, though, Blacky Moo, we got him some PSN friends. Great things. He was one of the people streaming last night for the community section of Extra Life. And it turned out when I was talking to him because he was playing",
            "start": 6802.82
        },
        {
            "text": "we got him some PSN friends. Great things. He was one of the people streaming last night for the community section of Extra Life. And it turned out when I was talking to him because he was playing farming simulator, that the people who make farming simulator listen to PS I love you XOXO. Heard him call out farming simulator and his thing, and they send him the game for free. Oh, that's very nice. So there you go. Shout out to them. Shout out to them. Nothing like a farming simulator stream to get you to want to go out into the field and be an actor. He was listening to the country music while he did it. And I think that might be all he streams or plays this farming simulator because his little logo for Ruby Juice was farming as well. Oh, interesting. It's very interesting. Do you like can I call you an Aggie agriculturalist? I think you can call me. I'll allow that. No, you. I want to call you and you can't call me because I'm a Mizzou tiger. I can't be a Texas A&M Aggie. Sorry. Can't",
            "start": 6839.86
        },
        {
            "text": "I call you an Aggie agriculturalist? I think you can call me. I'll allow that. No, you. I want to call you and you can't call me because I'm a Mizzou tiger. I can't be a Texas A&M Aggie. Sorry. Can't do that. Anyways, this week's PSN name is one of those dumb ones that I got to read because it doesn't make any sense. R R D I I I three eyes to my best friends. R R D I I I. Oh, okay. To all my best friends, I began my gaming career on the SNES, made the jump to PlayStation, and have been a loyal follower to Sony ever since. Unfortunately, I was late to fall in love with online multiplayer and have ultimately found myself with barely any beautiful PSN friends. I could use the PS. I love this best friend XO XO shout out to meet some awesome people around the globe. I adore the PS four, my precious Vita, and even my old PS three still when I'm gaming in my five year old stepdaughters room, because that's where the PS three lives. Now it took me a second. I thought that's only where he",
            "start": 6876.5
        },
        {
            "text": "precious Vita, and even my old PS three still when I'm gaming in my five year old stepdaughters room, because that's where the PS three lives. Now it took me a second. I thought that's only where he games would be weird. Yes, that would be strange. Some favorite games include Bloodborne, GTA five, Doom, Alien Nation, Far Cry, Far Cry four, and Primal, and I just downloaded Battlefield one. My PSN name is R R D I I I. Got to do something about that. That's not going to work for me. You got to roll in. Please let him change his name. You know what I mean? Yeah, that's not going to work for me. Sorry, Colin. Yes, this best friend is brought to you by Uber. Nice. We love Uber. We ride here in a few minutes. Exactly. We've all taken jobs to earn extra cash. Back in the day, Colin was a landscaper. That's true, but I've got a better way. You can earn extra money on the side. It's so much easier today. Thanks to Uber. Uber is the ultimate side hustle. Driving with Uber is a new way. You can",
            "start": 6922.02
        },
        {
            "text": "That's true, but I've got a better way. You can earn extra money on the side. It's so much easier today. Thanks to Uber. Uber is the ultimate side hustle. Driving with Uber is a new way. You can earn extra cash whenever you want. It's not just another job. It's a totally flexible way to earn. You can turn it off and on just like your car. Man, something about you need a key. It's something about the way the copy is written that gets me every time. Isn't this working? It's because you don't have a key to put in your phone. Oh, my gosh. I'm so silly. If you have a few spare hours here and there, you can drive with Uber. Have you ever wanted to be your own boss? Well, now you can with Uber. If you're driving right now, you should be earning right now. I do it. It says with an exclamation mark. I don't know if I would if I had a car. I thought about it, though. If I had a lot of free time, would I Uber if I had a car? Because they want a story. You know, but I could do like a podcast from",
            "start": 6970.66
        },
        {
            "text": "I don't know if I would if I had a car. I thought about it, though. If I had a lot of free time, would I Uber if I had a car? Because they want a story. You know, but I could do like a podcast from it. We can have a little camera. We just have content to make. There was a guy that put like, I'm sure it's not that unique, but put a guest book of some sort in the back of his car and then published it. Oh, that is like it's stories from a lift or something like that. I don't know. Yeah, that's good. That's good. Stories from Uber, something of this nature. I don't know. Every day is payday when you drive with Uber because you can cash out any time with instant pay with access to instant pay. Cash out your earnings up to five times a day with no minimum amount required. Listen, if you enjoy earning extra cash, if there's something special you'd like to buy, your car can start making you money. Go ahead. Get your side hustle on. Drive. No, that's not right. Sign up to drive with Uber",
            "start": 7010.78
        },
        {
            "text": "earning extra cash, if there's something special you'd like to buy, your car can start making you money. Go ahead. Get your side hustle on. Drive. No, that's not right. Sign up to drive with Uber today. Just drive. I'm driving. I've been driving for 48 hours. I haven't earned any money. Are you using Uber? Ah, damn it. Go to Uber dot com slash drive. Now that's Uber dot com slash drive. Now Uber dot com slash drive. Now they asked me to spell out Uber, but I'm you have to know there's no code. No, just drive. Now is the code. I don't like it. I need a code. Go to got to put it insert. Uber dot com slash drive. Now and in the notes field, tell them call more. He already sent you large Marge. This week's forgotten. Play station game comes from T Bone. Taylor. T Bone. Howdy, lads. T Bone here. I'd like to put forward a suggestion for this week's forgotten PlayStation game. With the hype train already on its way for next fall's Red Dead game and the PSN rerelease of Red Dead Revolver, I",
            "start": 7039.58
        },
        {
            "text": "I'd like to put forward a suggestion for this week's forgotten PlayStation game. With the hype train already on its way for next fall's Red Dead game and the PSN rerelease of Red Dead Revolver, I nominate Neversoft's gun from way back in 2005. Although it didn't have the polish of Revolver gun scratched the Wild West. It's left behind from Rockstar. The sound effects were crisp. The gameplay fantastic and generally found being a cowboy again. Very enjoyable. People need to play this if they haven't already done so. Respect always. T Bone. T Bone. Was it Coco the monkey? Yeah, Coco. Did you play gun? No, I played gun. I liked gun a lot at the time. Gun is actually a defining moment for my most important relationship of all time. Portilla, where I had gotten Porty as a puppy and he was at the house. He is old. He is old as hell. And I was sitting there playing gun on my PlayStation two and I was in a boss battle and Porty came over and got my lap and looked up at me and I was like, oh,",
            "start": 7095.34
        },
        {
            "text": "house. He is old. He is old as hell. And I was sitting there playing gun on my PlayStation two and I was in a boss battle and Porty came over and got my lap and looked up at me and I was like, oh, you got to go outside. I'm like, let me finish this boss battle. And then I kept going, kept going, kept going. I'm like, I'm almost there. Hold on. Let me finish this boss battle. And finally he just looked up at me again, just pissed in my lap. And I was like, I had that coming. That's on me. That was on me. I'm a bad dog, dad. And I took him outside. Then it's kind of like when Lola woke me up a couple months ago. I thought she was just being very friendly. Yeah. Then just shit all over the rug. So that was nice. I'll do that. Just diarrhea just everywhere. My fault, though, because I gave her I didn't know that you got to give them the consistent food. I thought you got to get whatever I want. You got to switch them in the food. You can't just dump them. Don't know anything. I don't know",
            "start": 7138.74
        },
        {
            "text": "I didn't know that you got to give them the consistent food. I thought you got to get whatever I want. You got to switch them in the food. You can't just dump them. Don't know anything. I don't know anything about canines. This is how you learn. This is how you learn getting this shit on the rug. Time for PSN's worst name of the week. This is where one of you writes in show is still going to kind of funny dot com slash forums. Yeah, you go to our board. You put it in there. You know what the fuck's up. You know how to do this. Before we jump into this week's, though, Jericho writes in our good friend, Jericho puts this all together and cries and cries for seven days in between shows. The people have decided, Jericho writes. 963 best friends looked at the four contenders of the first ever championship of PSN's worst name of the year and have voted. Here are the results. Winner of Quarter three and ranked number four with 13.3% of the votes. Don't shoot. I'm gay. Winner of Quarter four",
            "start": 7176.74
        },
        {
            "text": "championship of PSN's worst name of the year and have voted. Here are the results. Winner of Quarter three and ranked number four with 13.3% of the votes. Don't shoot. I'm gay. Winner of Quarter four nominated twice as PSN's worst name of the week. Ranked number three with 15.9% of the votes. Anime tit lover. He puts a side note band. Winner of Quarter two, my personal favorite of the four finalists, ranked number two with 27.8% of the vote. Come honor chest underscore. That's honor like for honor. And last but not least, actually first in the race of the first PSN's worst name of the year for 2015 slash 2016 and maybe the most ironic pick we have as this actually came from a Rocket League match. Anyway, 43% of the population chose not gay, but $5 is $5. Congratulations to the winner for choosing such a bad name. Never forget, please, Shuhei, let us change our names. Anime tit lover, I think was the best of that group. You should have gotten out there and campaigned. Stumped a bit.",
            "start": 7213.54
        },
        {
            "text": "choosing such a bad name. Never forget, please, Shuhei, let us change our names. Anime tit lover, I think was the best of that group. You should have gotten out there and campaigned. Stumped a bit. Campania. Did you rock the vote? I will tomorrow or today. Today when this is up. Yeah, I'm excited to see how that all nets out. This week's going to be close. Worst PlayStation Network name comes from Johnny Quest. Oh. Sup fellas. Have I got a doozy for you. When I created my PSN profile, I struggled to find a username because I detest having numbers in it. Eventually, I saddled down. He says saddled down, but he means settled down with I am Johnny Quest. Underscores between all those words. Not only is it a mouthful and a pain to type out, I am not in fact Johnny Quest. My username is based off an incredibly racist cartoon from the 60s. It features hits like Damn Dirty Heathens. And in one episode, the titular character rolls a gong down a staircase into some Asian goons and yells out,",
            "start": 7265.38
        },
        {
            "text": "off an incredibly racist cartoon from the 60s. It features hits like Damn Dirty Heathens. And in one episode, the titular character rolls a gong down a staircase into some Asian goons and yells out, here comes the Oriental Express. A story I had to look up and that's true about Johnny Quest. I did not know that. So not only am I a little blonde haired devil, I've had to deal with it from people in real life too. My friends heard it and almost immediately called me Johnny Questicles. And that nickname has survived to this day. I am addressed as Questicles in public. Shuhei. Man, help me the fuck out. I don't want to be a racist set of testicles anymore. Let me and I guess other people change our names. Thank you for your time. I enjoy all the content you all put out. Johnny Quest for now. Apparently. Always. Deep man. Not crazy about that one. I'll tell you what. I was disappointed this week. Lots of crap PSN names. Just like I got too many zeros in it. I'm like, well, that's maybe",
            "start": 7309.66
        },
        {
            "text": "Apparently. Always. Deep man. Not crazy about that one. I'll tell you what. I was disappointed this week. Lots of crap PSN names. Just like I got too many zeros in it. I'm like, well, that's maybe we've gone all through all the bad PSN names. Because here's the thing. People take the screen caps all the time, right? They see Questicles in the thing like, please, Shuhei, let us change our names. I don't know if Questicles wants to change the name. They could be very happy with that name. It's you coming to KindaFunny.com slash forums and confessing your bad PSN name. That's the real thing. That's true. Ladies and gentlemen, this has been PSI Love You XOXO. It is KindaFunny.com PlayStation podcast. It is the number one PlayStation podcast on the Internet, and it posts every Tuesday at 9 a.m. Pacific on YouTube.com slash Kinda Funny Games and podcast services around the globe. Please subscribe, share and like it wherever you get it. Make sure you tell your friends and come see us at PSX",
            "start": 7351.94
        },
        {
            "text": "Pacific on YouTube.com slash Kinda Funny Games and podcast services around the globe. Please subscribe, share and like it wherever you get it. Make sure you tell your friends and come see us at PSX Sunday noon. We're doing a panel. Will David Jaffe finally fucking man up? Get out of there. Will he rise from the grave? Come out of there like a fucking Dracula. Come up there and talk to us. Or will he be a fucking coward and stay behind in San Diego? I guess we'll have to find out if David Jaffe is a man or if he is a little baby who likes to lay in a casket like Dracula. Every episode of PSI Love You XOXO. Ends in a song in a segment we call Singing a Shoe. This is where one of you marvelous motherfuckers goes to KindaFunny.com slash PSM. You give me a YouTube link to your video because I annotate at the end of our video and an MP3 download link so I can download your MP3. Now, here's what I'm going to tell you about. I'm going to tell you about a band here, Colin. Right. Their name,",
            "start": 7393.66
        },
        {
            "text": "annotate at the end of our video and an MP3 download link so I can download your MP3. Now, here's what I'm going to tell you about. I'm going to tell you about a band here, Colin. Right. Their name, My Body Sings Electric. Their song, Ocean Crest. I watched the YouTube video and I did a completion. I was like, man, because last time I put songs in here, I'm like, maybe not my type of music, but I want to have a thing. I like this song. So I'm like, I'm going to go download it. I went to their little page on the SoundCloud. You know what I mean? Click the download button. I got to buy it. And you know what I said? I like this enough to buy it. And I went and bought it on iTunes. That's very nice of you. So here you go. This one. This comes from Eggtree on the forums. Greetings. I play and write music for a band here in Denver called My Body Sings Electric. We are a group of five best friends who have dedicated some serious time out of our lives to compose and perform our music. We've",
            "start": 7438.34
        },
        {
            "text": "write music for a band here in Denver called My Body Sings Electric. We are a group of five best friends who have dedicated some serious time out of our lives to compose and perform our music. We've released a few albums and we have recorded some music videos and we have even gone on little tours here and there. I have been a huge fan of Kinda Funny ever since its birth. And I love what you guys do for all of us best friends. It would be a dream come true to hear one of our songs on the show. The song is called Ocean Crest and I hope you guys like it. Well, Eggtree, I liked it enough to buy it. Ladies and gentlemen, this is My Body Sings Electric with Ocean Crest. And until next time, it's been our pleasure to serve you. David Jaffe is a Dracula vampire baby. Are you mad enough, Jaffe? Time to go.",
            "start": 7480.5
        }
    ]
}