{
    "id": 2166,
    "video_id": "qYdz3l-wikk",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Brand Loyalty - The GameOverGreggy Show Ep. 153 (Pt. 3)",
    "description": "What are we brand loyal to?\n\nThanks to Dollar Shave Club for sponsoring this episode. Go to http://www.dollarshaveclub.com/greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1478678405,
    "duration": 1682,
    "transcript_chunks": [
        {
            "text": "Guys, you don't need to choose between price and quality to get an amazing and affordable shave. Dollarshaveclub.com is the answer. To prove how amazing their shave really is, right now they are going to give you your first month free to join the club. Dollarshaveclub.com delivers amazing razors right to Tim Gettys' door for a third of the price of what the greedy razor corporations charge. Join the club like Tim did and stop dealing with the drugstore hassle in battle of the locked up razor fortress ever again. See why over 3 million members like Tim Getty's, that's right, the pure one himself, love Dollar Shave Club. They're so confident in the quality of all their products. Now you can get your first month of the club for free. Just pay shipping. After that, it's just a few bucks a month. No long-term commitment, no hidden fees. Go to dollarshaveclub.com/gregy. That's dollarshaveclub.com/greggy and shave your face. I made that up. That's not their tagline, but I think they should",
            "start": 0.16
        },
        {
            "text": "No long-term commitment, no hidden fees. Go to dollarshaveclub.com/gregy. That's dollarshaveclub.com/greggy and shave your face. I made that up. That's not their tagline, but I think they should use it. But I guess you could shave any. Hold on. and shave whatever. [Music] What's your topic? Uh, I want to talk about brand loyalty. I was thinking I was thinking about this and I want to talk about it in a deeper sense than um than what we might than what we might uh be thinking. We, for instance, the four of us and and I don't know if you feel the same way. We're all huge Apple fans, right? You don't use, you're an Android person. Yes. Okay. So, you're more like So, the four of us are are big Apple big Apple users. We like um we cut our videos on Premiere. We uh is not Apple. No, I'm saying we cut our It's Adobe. I'm saying we we we have, you know, some sort of brand loyalty to a specific product. Yeah. Uh we um we like to uh you know, go to the movies at Alamo Draft House. Well, I'm",
            "start": 38.96
        },
        {
            "text": "we cut our It's Adobe. I'm saying we we we have, you know, some sort of brand loyalty to a specific product. Yeah. Uh we um we like to uh you know, go to the movies at Alamo Draft House. Well, I'm thinking about more um uh like the minutian. The reason that this came up was I was I was I really like Italian dressing, right? I use Italian dressing. Yeah, you do. Hell yeah, Big C man. But I like wishbone Italian dressing and 10 out of 10 times, 100 out of 100 times, I'll buy wishbone dressing and if it doesn't if it's not there, I just won't eat Italian dressing. Yeah. So, I'm curious like what you guys like what your what your what your not Jesus God almighty what your not so standard kind of um brand loyalties are and um I want to see how deep and weird we can get with this in terms of like well how how how deep down the rabbit hole can we get with like the things that you like where you'll only buy something from a specific brand or you have a loyalty to another brand that's not",
            "start": 97.44
        },
        {
            "text": "like well how how how deep down the rabbit hole can we get with like the things that you like where you'll only buy something from a specific brand or you have a loyalty to another brand that's not maybe like Greg and I with Sony like we know sure you know but but we'll play other things but we're preferred there for sure Nick when we do a game over GI show on November 1st. What's the only brand we wear? Filthy casual. God damn it. Uh, no, this is a great topic and it's funny to think about what brands you are loyal to and stuff, right? I mean, for me, and this actually stems a little bit from our conversation in the first topic about like Catholic school and stuff, right? I'm extremely unwaveringly loyal to Converse All-Star, right? The Converse brand or whatever. Converse high tops, black in particular with, you know, now I'm trying out these new the new two version one, but it's still Converse, whatever, right? And it was that thing of going to Catholic school for so long, I always",
            "start": 143.76
        },
        {
            "text": "in particular with, you know, now I'm trying out these new the new two version one, but it's still Converse, whatever, right? And it was that thing of going to Catholic school for so long, I always felt that boot on my neck of not being able to express myself and having to wear the, you know, I'd be like, you're sent home from school for your hair. I'd be sent home from uh dress up days for wearing new Converse kicks or whatever, for wearing a brand new, you know, perfectly mint, nothing's wrong with them. And when I got out, that was my thing, my stance of like, [ __ ] this. I'm wearing Converse the rest of my life and no one will ever tell me I'm not allowed to. I wear, you know, I mean, if it's a wedding, if it's a funeral, I got married in Converse, you know what I mean? Brand new Converse. When I go to a wedding now and I'm in a nice suit or whatever, I'll buy a new pair if I don't have a dress pair of cons ready to go. But I'll do it for funerals. I'll do it for whatever. It's",
            "start": 184.56
        },
        {
            "text": "When I go to a wedding now and I'm in a nice suit or whatever, I'll buy a new pair if I don't have a dress pair of cons ready to go. But I'll do it for funerals. I'll do it for whatever. It's that's what I wear. That's what I like. That's the style I enjoy. And I I would I remember one time putting on another pair of shoes like after the fact of wearing them putting on and like they felt like I was wearing clown shoes cuz Converse are so molded to your feet cuz they're just canvas canvas and rubber. You put these things on, they felt huge. Like oh my god, I could never ever stop. I could never go back that way and do something differently. I'm the same way with Vans. I've been buying vans since I was a kid. There's a there was a brief period I think in the 90s where I dropped out of the van phenomena, but then I came back strong uh in the early 2000s. And I think, oddly enough, it was I mean, when you start kind of going back through the era of or the the ages and try to figure out",
            "start": 220.72
        },
        {
            "text": "van phenomena, but then I came back strong uh in the early 2000s. And I think, oddly enough, it was I mean, when you start kind of going back through the era of or the the ages and try to figure out why you have these things, I think I remember going to the Van store in Riverside, California for the first time and looking at a wall of colorful shoes and one of them was checkered. And I was like, they'll let you wear checkered shoes. Like that's a thing you can do? Like I didn't know you could do that. That's like But like when you're a kid, you're like, I I just like this like a checkered shoe blows your [ __ ] mind. Yeah. shoes come home or you go there and your parents pick them and that's what they are, right? That's what it was. My mom used to like, you know, when we were kids, they would go to the cheapest place possible cuz when you're a kid, you're growing. So, like you're growing out of the shoes in 6 months anyway. You're not going to like chances are you're growing out",
            "start": 255.12
        },
        {
            "text": "would go to the cheapest place possible cuz when you're a kid, you're growing. So, like you're growing out of the shoes in 6 months anyway. You're not going to like chances are you're growing out before or or I had my hand-me-downs for my brother. Um, but Vans were always the one thing we got to go and because you wear through them so fast cuz you only have one pair. You got to do them every like every like three or four months. You'd be back to the Van store like, \"So, I got a chance on that. I'll get the gray checker this time and then on that one I'll get the lime checker and then I'll get a slip-on also cuz I love slip-ons cuz they remind me of ninja shoes. Um of course naturally. Um so I've been a pretty big like I love Vans. Um I think I'll probably always have a pair of Vans somewhere. And recently I've bought the exact same pair of Vans. I [ __ ] you not like nine times. Oh no. I mean come on. I just walk in and I say yeah black Converse high top. Yeah. And I need them 11s.",
            "start": 290.88
        },
        {
            "text": "And recently I've bought the exact same pair of Vans. I [ __ ] you not like nine times. Oh no. I mean come on. I just walk in and I say yeah black Converse high top. Yeah. And I need them 11s. They're like you want to try them on? I'm like no trust me I know. I'm fine with this one. But it's the same thing of like my the origin of that is that going to get my first pair of lace up shoes at Geishi's shoes down in Glennel in Illinois and going in there and seeing a red high top Converse like and I remember I if you now of course Converse are everywhere and they're so they're trendy or whatever you want to call them but like forever in every movie at least one character is wearing Converse high tops. You know what I mean? their gym shoes and so it was always kids wearing them and monster squatter or whatever or Tom Hanks and the man with one red shoe and all these different things like there's so many instances of that was such an iconic thing growing up that I knew I wanted that. Yeah,",
            "start": 322.32
        },
        {
            "text": "or whatever or Tom Hanks and the man with one red shoe and all these different things like there's so many instances of that was such an iconic thing growing up that I knew I wanted that. Yeah, I mean those are you're talking about a classic too. Like those shoes have been around for a long time. Um I'm trying to think what else. I mean obviously I have a a pretty big allegiance to Apple. Um no real reason behind that other than um good stuff. No, they do make they do make stuff that I that I find is is I've had I mean I've had really pricey when you know I've had projects that I've edited on PCs and Mac and like I've had problems with both. So I'm not going to sit here and say like one platform has been historically better for me than the other. I think really with that it just boils down to aesthetics. Like you when you open up a Mac laptop and you look at that and you you you handle it, there's a level of artistry that goes into that that I just really really appreciate and it",
            "start": 360.72
        },
        {
            "text": "down to aesthetics. Like you when you open up a Mac laptop and you look at that and you you you handle it, there's a level of artistry that goes into that that I just really really appreciate and it actually inspires me every time I open up my machine to create better art. whatever I'm doing, if I'm writing, if I'm designing something and I'm looking at this beautiful thing, that's probably what I I don't think anyone could argue was probably the height of industrial design. Um, go ahead and argue, you piece of garbage. Okay, it's okay. I'll give you design for sure. Design for sure. I mean, don't get me wrong, they're overpriced. They're underpowered. I'm not going You can't argue those. You just physically can't. I just specked one out the other day for shits and giggles that was like $4,700 for a laptop. A garbage laptop. Yeah, it's not great. But um and and unfortunately they've they've destroyed the design aesthetic that I've loved so much for so long. Um I think my generation",
            "start": 395.92
        },
        {
            "text": "$4,700 for a laptop. A garbage laptop. Yeah, it's not great. But um and and unfortunately they've they've destroyed the design aesthetic that I've loved so much for so long. Um I think my generation MacBook Pro is probably the best. It will go down in history. It's gorgeous. It's got, you know, Thunderbolts, USBs, everything you buy, the HDMI, a retina display, an amazing touchpad that doesn't have a 18 button touch thing in it. Like it's just a normal touchpad. So it it still works perfectly. Um but those are things that are like that to me is a pleasure to use. I look forward to using that and when I have to work those long hours, that extra little bit of inspiration that I look at this thing and and think how many hours went into designing this and like this thing is like they they've put these things in like mo the MoMA, you know, like the these are in museums because they're they're just heralded as these [ __ ] amazing pieces of art that are also tools, you know? Um, so I really",
            "start": 431.28
        },
        {
            "text": "these things in like mo the MoMA, you know, like the these are in museums because they're they're just heralded as these [ __ ] amazing pieces of art that are also tools, you know? Um, so I really respect that and you contrast that to a lot of PC design and they just they've never hit the mark. So, you know, regardless of what's happening inside the machine, I just I look at PCs or laptops or PC towers and I just think, \"Oh, that's that's just not my aesthetic. That's that's not my way of thinking. That's not my simple, clean design aesthetic.\" They'll be getting closer in the last couple years. I just I can't think of one. I mean, again, granted, I'm not going out I'm not going to the Windows store every day looking at surfaces, looking at these things. Like, I think that's cool. Um, I'm sure that there are there I don't want to get into a Mac versus PC debate. I'm just saying this is why I I love Why you gravitating, you know? I I pull it out. It's a beautiful design. The logo",
            "start": 474.08
        },
        {
            "text": "I'm sure that there are there I don't want to get into a Mac versus PC debate. I'm just saying this is why I I love Why you gravitating, you know? I I pull it out. It's a beautiful design. The logo itself means something, right? That bite out of the apple means something, right? Um, means something to him. It does. You want to say anything about that? You Richard, what brands are What are you loyal to? Well, with the brand loyalty thing, it's more of a security thing for me. So, like it's like kind of like a security blanket. So, the only thing I could really think of is there's this like Chinese restaurant that I always go to. I don't even bloody know the name of the place. It's the Chinese restaurant. the Chinese restaurant. And I know objectively it's not the best Chinese food in in the city, but it's what I grew up on. So, it's kind of like it it brings back the memory. So, it's essentially brand loyalty for me is just things that get linked to past events that make you feel",
            "start": 508.32
        },
        {
            "text": "in the city, but it's what I grew up on. So, it's kind of like it it brings back the memory. So, it's essentially brand loyalty for me is just things that get linked to past events that make you feel better about yourself. Also, to go along with the shoe thing, um for a long period of time, I only wore Adidas just because when I was growing up, you had like Nike uh Nike, sorry, Adidas, and then like a couple of skate brands. And Adidas was the only one where you didn't feel kind of bad for not being into a certain sport or activity for wearing. So like if you I did though. I used to wear like their soccer shoes every once in a while. I'm like, I can't play soccer. Really? Oh, with the weird flop down tongue thing. Yeah. Yeah. I used to love those. Oh, the cleats. The sambas. No, they weren't sambas. That's what they were. Oh, gotcha. Yeah. But then all my cuz all my friends played soccer. They played club soccer growing up and they all had them and they had the Adidas jackets. You",
            "start": 553.76
        },
        {
            "text": "sambas. That's what they were. Oh, gotcha. Yeah. But then all my cuz all my friends played soccer. They played club soccer growing up and they all had them and they had the Adidas jackets. You remember those? when those things hit and I was like, I want one of those so bad and then I started wearing it and I immediately felt like a poser. I'm like, I don't play soccer. Yeah, you feel really weird. Like I I felt the same way the first time I tried on a pair of Nikes and then all my friends play basketball and it's just like I don't I don't do this guys. Like it feels really odd. And they were just like, \"Oh, you want to come play?\" I'm like, \"I really don't. Don't invite me. I just like them because I look nice.\" Like no, I'm with you. But it's just one of those things where I just it's one of those things where I just find things that go back to my childhood and I just kind of stick with it like you know. No, totally. I mean you bring up the Chinese food the other the other one",
            "start": 597.44
        },
        {
            "text": "one of those things where I just find things that go back to my childhood and I just kind of stick with it like you know. No, totally. I mean you bring up the Chinese food the other the other one there's two other ones for me. DC Comics which is obvious but then Portillos right. Portillos is the brand I'm incredibly loyal to and that's the thing of it's always interesting when I talk about this you know this is home to me. This is you know Portillos Hot Dogs. this is Chicago and then kids will hit me up like they're usually new to the show or me or whatever and be like, \"Well, what about Jean and Judes or what about Wiener Circle or what?\" I'm like, \"No, no, you're missing the point. I'm not saying that I love Chicago hot dogs.\" I'm saying that I love Portillos. Like that is a place and a thing to me that yeah, when I go home, you know, to Chicago for three or four days, I'm eating there four or five times. And it's the thing of like people are like, \"Well, there's this new restaurant",
            "start": 629.92
        },
        {
            "text": "thing to me that yeah, when I go home, you know, to Chicago for three or four days, I'm eating there four or five times. And it's the thing of like people are like, \"Well, there's this new restaurant that just opened here and there's this.\" Or I'm like, \"No, I don't. No, we're not going to Al's beef is better. Great. Big [ __ ] deal. I don't give a [ __ ] I'm going to Portillos.\" It's the same thing every time I start talking about Taco Bell, right? They was like, \"How could you like Taco Bell or something?\" I'm like, \"You're missing the point. I'm not I'm not saying Taco Bell is the best food on the planet, right? I love Taco Bell because back in the day, my aunt and uncle used to work at a Taco Bell.\" Like, it was the only Taco Bell in Riverside and we knew the owner of the franchise and he would hire he would he hired my aunt uncle. We used to go there, we get hooked up. It was like all these happy memories linked. That was the place we'd go when my mom was like, \"I don't feel like",
            "start": 666.0
        },
        {
            "text": "he would hire he would he hired my aunt uncle. We used to go there, we get hooked up. It was like all these happy memories linked. That was the place we'd go when my mom was like, \"I don't feel like cooking. Where do you guys want to go?\" And I was like, \"Oh, Taco Bell, no [ __ ] brainer.\" Right. And even though the Taco Bell is gone from my neighborhood, never far from my brain. I mean, that's the thing with Portillos, right? It's like, yeah, for me, Portillos is my parents waking me up when the original Portillos on North A shouldn't say the original, but the original Portillos on North Avenue was on fire. You know what I mean? And then it's it's half days where grandma would pick me up from school and we would go to Portillos and she would get the filt of fish or whatever, the fish sandwich they serve there. Jesus, I'm really loyal to a million things. Like I feel like my entire that's my life. It's kind of my brand is brand loyalty. Coca-Cola obviously is a big one. Obviously",
            "start": 699.6
        },
        {
            "text": "sandwich they serve there. Jesus, I'm really loyal to a million things. Like I feel like my entire that's my life. It's kind of my brand is brand loyalty. Coca-Cola obviously is a big one. Obviously Nintendo PlayStation also like when it comes to the PlayStation vers Xbox thing for sure. Um the color blue if that was a brand I think that's definitely definitely in there. Uh but I I feel like I'm also just averse to a lot of things. Jordans for shoes definitely that is like but like Nikes or just Jordans? Jordans like it's it's always Jordans. I've always always only bought Jordans. Dunks are the only exception but Dunks and Jordan ones are very similar. Where do you come down on air? On what? Nike Airs. Just like Air Maxes and stuff. They're cool, but like they're not really my What about those shoes you pumped up? Pumps. You pumped them up. Remember the pumps? That was the jam. They still make those. They're cool. Not my brand. So, what about those ones that lit up? Night LA gear.",
            "start": 730.24
        },
        {
            "text": "those shoes you pumped up? Pumps. You pumped them up. Remember the pumps? That was the jam. They still make those. They're cool. Not my brand. So, what about those ones that lit up? Night LA gear. Yeah. Big fan of those. What about the wheelies? The Healies. Oh, man. [ __ ] Healies were legit. How many times Royalty Watch Kevin just completely eat [ __ ] wearing those Healies? None. Never. Never. You never saw it, but it happened a lot. Yeah. You know, Helios were [ __ ] legit, but I that was back in the [ __ ] day. I'm talking about that was like at least 5 years ago. Yeah, at least 5 years ago. Um, but I think there's a lot of things that I'm like the opposite of brand loyalty to that I just [ __ ] hate. Like Pepsi or Arrowhead. Um, I get really angry. Arrowhead water [ __ ] sucks. Wow. It It's the [ __ ] worst. It's the absol It's not It tastes bad. It tastes bad. There's Fiji water and then there's just everything else. Fiji water kind of sucks, too. You're [ __ ] crazy. Fiji.",
            "start": 772.24
        },
        {
            "text": "It It's the [ __ ] worst. It's the absol It's not It tastes bad. It tastes bad. There's Fiji water and then there's just everything else. Fiji water kind of sucks, too. You're [ __ ] crazy. Fiji. Fiji sucks. Smart water is the better. Smart water is awesome. You've had too much. You've had too much coke. It's ruining the Yeah, dude. Dani especially sucks. Dani makes a little noise when you open it. You know something's [ __ ] up. Yeah, I know. Is making the studio. Halloween's over, Kevin. It's been a long day. You know, it's been like especially a long day when this happens cuz I walked in fresh and you got I'm like, \"Oh, y'all [ __ ] are burned out right now. Marvel is another one. And uh Marvel and Windows I think are really good examples to me where I'm definitely like I'm loyal to them. I love them. And I I have a weird sense of if someone were to be like Apple's better or DC's better, I'm like no it's not, you know? And I feel like that is what the things that I'm brand loyal to",
            "start": 814.32
        },
        {
            "text": "I love them. And I I have a weird sense of if someone were to be like Apple's better or DC's better, I'm like no it's not, you know? And I feel like that is what the things that I'm brand loyal to is because I get this like instant fight mechanic even though it's like I'm fine. Like Apple products to an extent I really do like. Um but Mac OS, [ __ ] that [ __ ] Why do I feel that way? It's not that much worse than than Windows. It is worse. But uh then then with like Marvel or DC, it's the same thing where I'm just like, how can you say that DC characters are better than Marvel? You're [ __ ] crazy. Great. You got three. I'll give you three. But besides that, Marvel has all these characters. I'm just like, why do I care so much? It's like also I love DC. Yeah. Exactly. That's the other thing, too, right? Where it is that thing of like where I'm always like, I'm jokingly, [ __ ] Marvel most of the time. You know what I mean? And then I'll sit there and be like, I can't wait for",
            "start": 861.04
        },
        {
            "text": "thing, too, right? Where it is that thing of like where I'm always like, I'm jokingly, [ __ ] Marvel most of the time. You know what I mean? And then I'll sit there and be like, I can't wait for Spider-Man. Can't wait for this. You know, I'm so excited about Logan looks great. You know what I mean? A lot. And to Colin, like to really get to your thing about like the more obscure [ __ ] I feel like I'd really have to think about all the things, but like all the [ __ ] in my life I feel like and it it ever changes where over time like with headphones, I feel like I'm I've always been loyal to to Sony. They've made great headphones and I've been great in in certain extents when it comes to earbuds and stuff, but then Audio Technica kind of kills it now. So I'm like that shifted. Things kind of change over time. Um, but I do result to resort to defaults for a lot of things. And I think that's where the brand loyalty comes in when it's like shampoo or um American crew hair products, which",
            "start": 899.92
        },
        {
            "text": "of change over time. Um, but I do result to resort to defaults for a lot of things. And I think that's where the brand loyalty comes in when it's like shampoo or um American crew hair products, which is fantastic. Um or Uber. I'm loyal to Uber. [ __ ] Lyft. Yep. I've never used Lyft. I don't know why I'm so Exactly. No, the same way. But [ __ ] them. I Last night I I was get I was trying to order dinner and I was going to use Postmates and I was like, \"All right, Uber Eats. I always do that. I'll just try it.\" I was like, it felt so wrong and then they [ __ ] me over. I'm like, \"Well, this just proved my point.\" Like, \"Fuck this. Postmates for life. Even though Postmates kind of sucks. They turn kind of sucks, too. And let's be honest, Uber kind of sucks, too, a little bit sometimes. [ __ ] you. No, it does not. Uber. Everything sucks all the time. Well, here's here's why I don't like this. I mean, I'm again the same. I'm going to I'm going to sit here and bash Uber, but I'm clearly",
            "start": 931.28
        },
        {
            "text": "you. No, it does not. Uber. Everything sucks all the time. Well, here's here's why I don't like this. I mean, I'm again the same. I'm going to I'm going to sit here and bash Uber, but I'm clearly Uber over Lift. I've never taken a lift. I couldn't even imagine downloading the app, right? It's never going to happen except I think we did it one time. We were forced to do it one time in Austin because Uber's No, remember it's not. It's like some other [ __ ] totally sucked. They went out of business. Um, but yeah, with Uber I'm like, \"God, man, every time I drive, there's always a [ __ ] Uber driver getting in my way, not parked poorly, double parked. They don't know where the [ __ ] they're going. I've got all these complaints against them, and yet still I will not try lift.\" Dude, it's Uber is was one of my examples is an amazing service. Really, really amazing service. They're innovators, though. They started that. So, it's like I understand why you would be when they go public, I'm",
            "start": 968.56
        },
        {
            "text": "is was one of my examples is an amazing service. Really, really amazing service. They're innovators, though. They started that. So, it's like I understand why you would be when they go public, I'm all over that. Oh, yeah. Um, yeah. I don't think so. Shut up, Tax Mania. So, uh, I don't know. We Everyone remembers Zaki the we little man. We did. This is It was a god damn it. You remember a We little man was he remember he climbed way up in a sycamore tree for Jesus Christ to see. We remember the song. We remember the song. Yeah. Unfortunately, we remember it. The one example I'm surprised you didn't use and that I've been loyal to since they they started in 2008 is Virgin America. Um I flew Virgin America literally the first week on like that they were ever out and it was the worst experience I ever had on an airline in my entire life. It was terrible. And for some reason, it was so cheap because they were getting off the ground that I just kept sticking with it. And and before I knew",
            "start": 1001.04
        },
        {
            "text": "I ever had on an airline in my entire life. It was terrible. And for some reason, it was so cheap because they were getting off the ground that I just kept sticking with it. And and before I knew it, I was just to the point where I I don't I literally, you know, Erin's always like, \"Well, why don't you go on Expedia or something?\" And I'm like, \"No.\" Like I I literally don't I'm like I literally don't even care how much anyone else is charging. Like I fly I fly Virgin America. That's what I fly. I have my points. I got my television. I got my nice atmosphere, you know? Like London on United. Oh, United [ __ ] sucks. And that plane was so [ __ ] old. It had, I [ __ ] you not, it was one of those where it was just a TV that was embedded in the wall and you had like you had to just watch whatever the [ __ ] was on. Dude, United is the worst. Like, although they have the cool thing where you can like log on to their app and watch your [ __ ] through your smartphone too much. United is a",
            "start": 1040.48
        },
        {
            "text": "the [ __ ] was on. Dude, United is the worst. Like, although they have the cool thing where you can like log on to their app and watch your [ __ ] through your smartphone too much. United is a great example of an airline that's way too big that has like they clearly have logistics problems up the ass and that that airline like it's it's a sight to behold how bad they can [ __ ] everything up all the time. Yep. Um, like I I don't understand how that airline hasn't just gone out of business. Like they just they just they just [ __ ] they just [ __ ] everything up. It's funny because Alexa, our friend Alexa tweeted out a couple weeks ago about how she had a terrible United experience and I'm like and I tweeted back and I'm like you like I'm like I try not to say these kind of things with United there but I'm like United [ __ ] sucks, you know? And they tweeted at me being like well we we're sorry you feel this way. What can we do? And I I didn't answer them but I'm like I'm not even a",
            "start": 1078.88
        },
        {
            "text": "there but I'm like United [ __ ] sucks, you know? And they tweeted at me being like well we we're sorry you feel this way. What can we do? And I I didn't answer them but I'm like I'm not even a customer of yours. You can't do anything. You've had a million chances. I've been on your Japanese flights. I've been on your European flights. I've been on your your inter, you know, your your domestic flights. You [ __ ] suck, you know? So, that's the antibrand loyalty. I'm like, never, unless I absolutely have to. We flew United to Anaheim, didn't we? And and that that that gate was a [ __ ] sight to behold. And you know that that was their fault, too, because of all sorts of [ __ ] [ __ ] that was going on there. Oh, that was horrible. That was like one of the worst things I'd ever seen in my life. So, that was bad. Uh, but on the more minute, because I wanted to get into more than minute stuff, like I was thinking about Yeah. Like I said, a wishbone dial, the orange dial soap is uh is",
            "start": 1115.12
        },
        {
            "text": "my life. So, that was bad. Uh, but on the more minute, because I wanted to get into more than minute stuff, like I was thinking about Yeah. Like I said, a wishbone dial, the orange dial soap is uh is super nostalgic. Like so smell is the thing most closely associated with old memories. Uh the smell of that soap reminds me of childhood and I just buy it whenever I can. Like I just love it. Just reminds me being young. I don't know why. Crest toothpaste is one. Yeah, Crest Pro Health. [ __ ] your Colgate. [ __ ] Colgate. Get the hell out of Aquaresh [ __ ] Oh my god. The funniest thing is when we had that conversation about toothpaste, uh, I went home and I was like, \"Babe, did you know that [ __ ] no one likes Aquar?\" And she's like, \"What are you talking about?\" And I'm like, \"No, it's like it's like the like the number like 19th best sold.\" I'm like, \"We're using this [ __ ] up like toothpaste.\" Did you do you ban ship or you loyal? [ __ ] I had to stay cuz like that that to me is I",
            "start": 1146.72
        },
        {
            "text": "it's like the like the number like 19th best sold.\" I'm like, \"We're using this [ __ ] up like toothpaste.\" Did you do you ban ship or you loyal? [ __ ] I had to stay cuz like that that to me is I don't like the taste of most toothpastes. I had a bad uh I had a bad uh experience with Crest one time cuz they had this like super minty Crest that they did where it was like uber mint and the mint stays in your mouth like all day. I'm like I can't I called it I called it a nuke cuz it was I I bought a bottle of it by mistake and I started using it and yeah and sure enough I'd be like lunchtime and I'm like I still can't taste anything. Yeah, it was [ __ ] terrible. Uh it was like the the first and last time I used the condom with that numbing agent into it. Never doing that again. Um condoms though. Trojans. Trojans. I was going to go Trojans. Um, weirdly I was thinking I my mind went to candy, right? Because there's always always like the either way or candy. No. Well, ms are good. I",
            "start": 1185.52
        },
        {
            "text": "though. Trojans. Trojans. I was going to go Trojans. Um, weirdly I was thinking I my mind went to candy, right? Because there's always always like the either way or candy. No. Well, ms are good. I don't I don't I don't care one way or the other. I'm enjoy. I'll take them. I'll take either of them. Um, filthy casual. Um, where it comes down to where I really am divided though is is the great uh Twizzler red vine. There's no divide. Now, here's why. Red vines are death. I love I love red vines. I like the taste of Twizzlers more, but I will always, for some reason, always buy the red vines. I will never buy Twizzlers. Twizzlers. Twizzlers are [ __ ] disgusting. Like, honestly, I think Twizzlers are lower than Pepsi on my [ __ ] shots. Those are words you can't take back to. No, man. Twizzlers [ __ ] suck. They They're like you you're eating red rubber. Like, red vines are legit. Red vines are awesome. They're sweet. They have a taste to them. They're fantastic. Twizzlers are like this",
            "start": 1223.76
        },
        {
            "text": "[ __ ] suck. They They're like you you're eating red rubber. Like, red vines are legit. Red vines are awesome. They're sweet. They have a taste to them. They're fantastic. Twizzlers are like this [ __ ] nasty joke. We can't I don't I don't know how it is anymore, but I I was unaware of Redvines really till I came out here for IGN because Twizzlers are the East Coast Midwest thing and it was that Yeah. Po would eat Twizzlers at the movies or whatever and I it was enough to turn me I was like I'm not going to buy these. These are this is no good. This isn't a good candy. This sir is no whoppers. But then you come out to California and they got the Red Vines and that was I mean that if I don't you were old enough you're old enough obviously to remember this but at IGN I used to have that giant Red Vines tub on my desk that I pop off. I love that tub. I love that tub had one. I have it because there was the thing like you know again going back to happy memories my wife was talking about",
            "start": 1270.8
        },
        {
            "text": "Red Vines tub on my desk that I pop off. I love that tub. I love that tub had one. I have it because there was the thing like you know again going back to happy memories my wife was talking about how she used to be in TV and film when she was young. Um and she would say every time she'd go on set they'd have the big tub of red vines and that I I picked up on that. I'm like that is a great happy memory. So now every time I do a shoot that's big that needs craft service, I have someone get that big [ __ ] tab of red vines and no matter what it's always like it always makes people happy. They'll look over at it and be like, \"Oh.\" And they'll take a red vine and they'll go and they'll do what they got to do on the shoot and and it and it, you know, works out. Big Kev dog, order up a big tub of red vines. This office needs a big tub of red vines. I'm confused. You need a big You open saying red vines are death. Red vines or death. I'm saying I'm death. Well, we were all I was upset. I was",
            "start": 1308.4
        },
        {
            "text": "red vines. This office needs a big tub of red vines. I'm confused. You need a big You open saying red vines are death. Red vines or death. I'm saying I'm death. Well, we were all I was upset. I was real upset. Raise me to Red Vines. Let me give a few closing shout outs real quick. Uh Best Foods if you're on the West Coast, Cullman's if you're on the East Coast. Um same company. Uh if you buy any other mayonnaise, you're out you're out of your [ __ ] mind. What do you That's number What about ketchup? Is it Hines or B? Ketchup is Hines or Bust. Now, I've met a few people that like Delonte ketchup and I and so I've tried Delonte ketchup a few times and it's not bad. I understand why they like it. It It's not as sweet as Hines. Um but Hines ketchup really is the gold standard. Hines. Hines is the gold standard. That's what ketchup is. Let me ask you this. I feel like it's it's, you know, kind of just went past any of the like the the labels and stuff. That is ketchup. Anything else is",
            "start": 1343.12
        },
        {
            "text": "is the gold standard. That's what ketchup is. Let me ask you this. I feel like it's it's, you know, kind of just went past any of the like the the labels and stuff. That is ketchup. Anything else is variations. Uh Landelakes uh for butter specifically. I don't buy it anymore cuz I don't eat a lot of like bagels or like English muffins these days like actually for years. But I used to buy I used to go through Landelakes whipped butter. Like it was going out of [ __ ] style. Are you aware that you you like every product that's the most popular in the genre and probably had the biggest marketing budgets in the ' 80s and '90s? We so on the east I don't know about here but on the east coast we had a brand of butter I don't think you even had it here called breakstones which is which it comes in blue like tubs and blue boxes that was more popular than land I never buy the whipped butter anymore we just buy butter sticks I cook with that I never spread stuff on bread is so good but when",
            "start": 1385.68
        },
        {
            "text": "in blue like tubs and blue boxes that was more popular than land I never buy the whipped butter anymore we just buy butter sticks I cook with that I never spread stuff on bread is so good but when growing up my parents loved it and I loved the commercials and we were super into it crunch country croc country croc we used to call it country crotch brown like the commercials were all just the hands walking around. Not like this, Tim. They were human hands and they were having a conversation up here, but the framing was just the hand. I [ __ ] hate that [ __ ] I can't believe you even brought that up. I mean, with all due respect, I bet in a butter taste test, I would have no idea what one is one is the other. Oh my god, Greg. Yes, you would. That [ __ ] doesn't taste like anything like that. So, we have to do Mark this down, Kevin. A water taste test and a butter taste test during the same episode. All right, so speaking of water, it's a taste test episode. Speaking of water, uh Poland",
            "start": 1418.48
        },
        {
            "text": "So, we have to do Mark this down, Kevin. A water taste test and a butter taste test during the same episode. All right, so speaking of water, it's a taste test episode. Speaking of water, uh Poland I have I have a huge loyalty to Poland Spring, but we can't get that out here. Uh Arrowhead is like the ubiquitous water out here, but in the East Coast, Poland Spring is the ubiquitous water from Maine and it's really really [ __ ] great uh water. That's what I like when I see something like a Poland Spring bottle in like a show or something. I'm like here on East Coast. Um so those things and then like I it only I only broke recently. For many years I was all about Irish Spring. Oh, I was going to ask about the soap. Uh, Irish Spring. Uh, I use Head and Shoulders because I like the combined uh, maximize your time. Yeah, exactly. The We talked about conditioner one. Uh, also like my my my hair gets my head gets itchy. I don't get really flaky. I guess I would if I let it go long enough,",
            "start": 1463.04
        },
        {
            "text": "uh, maximize your time. Yeah, exactly. The We talked about conditioner one. Uh, also like my my my hair gets my head gets itchy. I don't get really flaky. I guess I would if I let it go long enough, but it gets itchy and that's the only one that really helps. So I I I'm a head and shoulders guy through and through. We talked about the Crest toothpaste. Obviously I'm there. Uh, what does it do for your shoulders though? That's my question. Keeps the keeps off the off the shoulders apparently is the whole idea. So it's not so much as doing something for your shoulders. It should be called head. Hey, give me some head. Um, so but also uh I'm surprised what you had brought up Richard, but the you know when I'm home uh on the island like I I have a pizza place, I have a Chinese food place, I have a hero place, and I'm not talking about people get confused. I'm talking about Hero Sandwiches, HRO. Um, and you know, all these kinds of things, a bagel place. Incredibly diehard loyal to these",
            "start": 1498.08
        },
        {
            "text": "have a hero place, and I'm not talking about people get confused. I'm talking about Hero Sandwiches, HRO. Um, and you know, all these kinds of things, a bagel place. Incredibly diehard loyal to these places even though I'm not in that ecosystem anymore. And I'm sure that there are better examples of literally all four of those things. I have a hard time believing this is better pizza than rag time. But um but like I'm not there anymore, but like I'll go home and people be like, \"Oh, let's go to Tony's for pizza.\" I'm like, \"Why the [ __ ] would we go to Tony's? I'm on a clock here, sir. I'm here forever.\" That's how it happens though. I mean for me and Kevin like we're we're still in the same place. So we still have that loyalty to whatever places we go. Senores and like for me Gordos Burritos and stuff. But it goes even further than that where we have like loyalty to specific wines where it's like Target. There's the two targets next to each other. [ __ ] sucks. [ __ ] ceremoni",
            "start": 1537.04
        },
        {
            "text": "Burritos and stuff. But it goes even further than that where we have like loyalty to specific wines where it's like Target. There's the two targets next to each other. [ __ ] sucks. [ __ ] ceremoni target. It's Cole Target or [ __ ] bucks. Co Target's awesome because it's a it's I feel like it's a mystery to a lot of people, you know, like the Well, the one at Camonte is just a scene, you know, like because everyone's there. Everyone so weirdly laid out and it feels like a prison if I'm thinking the right one. It's horrible. It's absolutely horrible. Yeah, I think Yeah, we used to go there. We used to go there and walk around there every day at lunch. Don't even get me started on Tampa and Target. But Target in general, I'm a huge fan of. I'll spend time in Target. I don't even need anything at a Target. No, that's really Best Buy. Best [ __ ] buy. Best buys are sad. Now, by the way, no, they're not. They're awesome. They're fantastic. Before we move on to this topic, I need to say",
            "start": 1571.2
        },
        {
            "text": "at a Target. No, that's really Best Buy. Best [ __ ] buy. Best buys are sad. Now, by the way, no, they're not. They're awesome. They're fantastic. Before we move on to this topic, I need to say this, girls. I'm going to be really upset at myself. Lego. Lego over [ __ ] Mega Bloks. If you like Mega Bloks, no one likes Mega Blossom. There's got to be a Mega. I'm telling you, there's probably a Mega Blok afficionado out there. You can leave. I don't want you here. I don't want your money. I don't want your views. I don't want your attention. I don't want anything. I don't want anything to do with you. Mega Star nasty and not a good nasty, a bad nasty. [ __ ] you, Shasta Mcnasty. Kevin switching up the shot every 5 seconds there. He wants to give as many seizures as possible. God forbid he stays in the wide. I thought Nick was going to say I was going to say something, but Tim was on a good [ __ ] line. But that's the problem. Nick is always going to say something. If you give him If you",
            "start": 1608.08
        },
        {
            "text": "in the wide. I thought Nick was going to say I was going to say something, but Tim was on a good [ __ ] line. But that's the problem. Nick is always going to say something. If you give him If you give him the one shot, it the topic continues. I thought he was going to say something good. Also, Logitech MX brand mouses are the best. Yeah, Logite A lot of the Logitech performance Yeah, they do. They really do. PSP like case that was fant. Best PSP case. Mhm. Undestructible. Mhm. Unable to be destructive. Please remember that. Please remember that. We'll put out a book one",
            "start": 1648.32
        }
    ]
}