{
    "id": 14049,
    "video_id": "-FXMD6ycDhM",
    "show_name": "Gameplay",
    "hosts": [
        "Nick Scarpino",
        "Kevin Coello",
        "Andy Cortez",
        "Mike Howard"
    ],
    "title": "The HUNT for Lugia! - Pokemon Nicklocke 2.0",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page - https://store.steampowered.com/app/1377700/Empyreal/ \nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nThis episode is sponsored by BetterHelp — go to http://betterhelp.com/kindafunny to get 10% off your first month.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1746576189,
    "duration": 9123,
    "transcript_chunks": [
        {
            "text": "[Music] Hello Pokemon trainers. Welcome back to another kind of funny games afternoon stream for your lovely Tuesday, May 6, 2025. We are back with Pokemon. The hunt for Red October begins. Yeah. Yeah, that's it right there. For Lugia begin for Lugia. We are on the back nine of this game. We have Mike has assured me we have 10 to 15 minutes left of play of this game and we are going to finish it today before 5:00 pm where all of us are going to unceremoniously go home. I've had so much anxiety coming back to this world. For a second I was like maybe they just thought maybe they forgot that we didn't finish this game. You were hoping the audience would be like oh we never played Pokémon. I was trying so hard to make Tarov entertaining for them. and you try so that they would revolt against us coming back to Pokémon. Never have to play this again. There was a small uprise. People started to like it. Yeah. And they did. We were winning them over. Yeah. We're going to get it back. We're",
            "start": 0.0
        },
        {
            "text": "us coming back to Pokémon. Never have to play this again. There was a small uprise. People started to like it. Yeah. And they did. We were winning them over. Yeah. We're going to get it back. We're going to get back. We'll get it back. We'll get it back. The problem with this game as opposed to Pokemon Fire Red. Yeah. Is that Fire Red had a difficulty curve that went like this. A nice, you know, little little bell curve, but not too crazy. Not too crazy. Upward like, you know, a little slog. Yeah. Yeah. like a logarithmic curve. Yeah, this game is peaks and valleys where one second I'm like this is really easy and then the next second I was like what is why why is what why am I my wife it's Radicate [ __ ] Radicate now it's funny because I went out this weekend and I was telling somebody about your story you know our story here is that we learned a lot about ourselves especially Radicate and how Radicate ensures that you can change Pokemon or leave at any time. Radicate is the",
            "start": 47.52
        },
        {
            "text": "about your story you know our story here is that we learned a lot about ourselves especially Radicate and how Radicate ensures that you can change Pokemon or leave at any time. Radicate is the dominator. Okay. He's the destructor. We've lost a lot of the Radicator. I only believe that that um Oppenheimer also created a Radicate. He was like, I have two things that I'm working on right now. Oh, god damn it. He's [ __ ] rolling things. Throw them away. On the ground. Get them on there. They're everywhere. They're nice. Hold on. Do you need these? Is this a pencil that you need? I don't know. Kind of funny. Best friends, we are back with more Pokémon. Of course, we have a lot of fun things going on when we talk about the Pokemon world. We are nearing the finish line. We aren't there yet. As many of you know, if you look at my strategy guide, we're moving. We're still moving. We got a lot. We're a solid 3/4 of the way through this game. We're like, if we win, if we were perfect four",
            "start": 92.64
        },
        {
            "text": "As many of you know, if you look at my strategy guide, we're moving. We're still moving. We got a lot. We're a solid 3/4 of the way through this game. We're like, if we win, if we were perfect four streams. Okay. If we were perfect, I think we do. I think we just see where we net out today. Yeah. Yeah. And then we ask the audience at large, hey, is that enough Pokemon? Yeah. Yeah. Have we done enough for you? And then you know my birthday wish was to get us all back in the room. Your birthday today. That was my tomorrow is my birthday tomorrow. My birthday wish was to put us all back together. Well, y'all has to stop talking on your damn podcast. We were having so much fun though. And look at my watch. 12:30 comes by. 12:45 12:48. I mean, it's GTA is a big day. GTA is a big day. It's a trailer. I want to show you the trailer. They hit you with some good music, Nick. You would like the music. I'll watch it. You guys, they have some banging music. All right. So, we have uh we're do we",
            "start": 135.76
        },
        {
            "text": "I want to show you the trailer. They hit you with some good music, Nick. You would like the music. I'll watch it. You guys, they have some banging music. All right. So, we have uh we're do we pull the curtain back? We're cheesing this just a little bit. Yeah. So, to pull the curtain back for you, of course, as you know, kind of funny. Best friends, we have uh lost the sauce for a couple of weeks here with Pokemon. And it was my goal to try to get Nick up to fighting strength and level because it got a little awkward there. We were fighting level 23 Pokémons were the highest Pokemons we were encountering and we were level 35 and beyond. So, it wasn't really uh fun to watch. It was a lot of grinding and so I grinded a lot for Nick and then Andy came in and said, \"Mike, let me help you.\" And Andy gave us a bunch of rare candies. And so that has allowed Nick here to, you know, we're at 40. I think 42 is probably good enough for right now, but of course, as I look at our handy dandy",
            "start": 181.92
        },
        {
            "text": "And Andy gave us a bunch of rare candies. And so that has allowed Nick here to, you know, we're at 40. I think 42 is probably good enough for right now, but of course, as I look at our handy dandy notebook, I know we probably need to be in the 45 to 50 window to have a easy time without losing Pokémon. And look it, folks. Yeah. Okay. There's a lot of economic instability in the world right now. A whole lot of it all over the place. Okay. So, I don't need this heartache and pain right now. Okay. I asked Andy to put, and this is why Andy's a great person. I asked him to put three rare candies in the game. Just three. Yeah. And he put 900. Well, he said that that doesn't work like that. Yeah. It's just It's just a It's just a cheat. It wasn't me doing what I did last time. It was me just typing in a code into the emulator being like, I hope this works. I don't know. It sure did. So, I just upgraded uh I leveled up uh Milk Mommy to 41. And the question is now uh she can learn. He can",
            "start": 221.04
        },
        {
            "text": "typing in a code into the emulator being like, I hope this works. I don't know. It sure did. So, I just upgraded uh I leveled up uh Milk Mommy to 41. And the question is now uh she can learn. He can learn. She can learn a uh a steel move. Do we want milk mommy to have gyro ball? Chat, sound off. Yes or no? Gyro ball sound off. Of course, as you take a look at gyro ball, we have power, accuracy, 100 there. the user tackles the foe uh with a high-speed spin. The slower user, the greater the damage. So, that means more of the heavier hitters might take more damage. Her speed is 105. But it's the it's the uh person's speed. Oh, no. The slower slower the user, the greater the damage. Okay. So, yeah, her speed. Kevin was right there. Wait, it's her speed or the person you're using it on. The slower the user, the greater the damage. What's her speed here? or speed 105 not good or is it great? Oh, speed's one great. Okay. I don't know. I don't know if 105 is good or not. I mean 105 is a big",
            "start": 274.56
        },
        {
            "text": "the user, the greater the damage. What's her speed here? or speed 105 not good or is it great? Oh, speed's one great. Okay. I don't know. I don't know if 105 is good or not. I mean 105 is a big number, right? We don't know how lower or higher. Is it 105 out of 800? Exactly. Sorry. My speed's too high for this. So, we're never going to Yeah, it's not good. 105 is high, says Mr. Man. Mr. Man. Yeah, that's high. That's high. Well, the speed being higher is worse for the move. Yeah, we don't want So, we want it to be lower for her. Yes. Yes. And so, as you can see, Nick's uh starting six are all 40s. We've uh applied some rare candies to Dudikoff and the crew to get them to about 42. Of course, chat, you can help guide the guide, aka me, with where they need to be. But, of course, as I take a look at my handy dandy notebook provided by one Chris Anka, thank you for Chris Ananka for bringing us this gift. Uh, we're in Blackthorn City. We need to go through the dragon's den. Then, we might",
            "start": 328.48
        },
        {
            "text": "look at my handy dandy notebook provided by one Chris Anka, thank you for Chris Ananka for bringing us this gift. Uh, we're in Blackthorn City. We need to go through the dragon's den. Then, we might take on the Magikarp challenge. Who can catch the biggest Magikarp? pretty pretty awesome. We're going to take that [ __ ] back. I think that [ __ ] [ __ ] the grill later, dog. And then we have routes 45 and 46. Then that takes us to the bell tower. And then we get to the whirl islands, which will allow us to battle an ancient bird. The bird the go. So I don't know if we should be at 45 already, but Oh, hyper. If you encourage Nick to get the 45, we'll just put everybody at 45. It's probably the safest bet. Kito, I say 45 and then we don't use any rare candies beyond that. Yeah, but you're only saying that right now. Yeah, you Well, you know what? Get them all at 45. All right. Uh, do I want Ooh, look. I got a new move. Hydro pump, 5 PP, accuracy, 120 damage. It's the goat, though. It's",
            "start": 375.2
        },
        {
            "text": "saying that right now. Yeah, you Well, you know what? Get them all at 45. All right. Uh, do I want Ooh, look. I got a new move. Hydro pump, 5 PP, accuracy, 120 damage. It's the goat, though. It's the goat. That's not dam. Fair. I don't know what that means. Yeah, there's like some Eric 889 says no hydro pump. Yeah, accuracy not worth it. Fam says learn hydro pump. No, no, no. Inaccurate with and oh, it's special damage. Okay, what's my special attack? Ooh, 65. Oh, man. We're going to have to relearn a lot of this. We went over it this morning. I gave you a pop quiz. Okay. Yeah. So, we're not learning that. Forget it. Sorry. Not worth it. We don't We're We are shooters here. We shoot. We don't take We don't strategize [ __ ] We don't stun people. We just shoot. We're in Tarov. We just run out into the open. We [ __ ] shoot each other. We die. Yeah. You really missed out, Andy. We wish you were there. You would have had fun with us. We really We're excited to teach you. Andy, you're",
            "start": 424.8
        },
        {
            "text": "out into the open. We [ __ ] shoot each other. We die. Yeah. You really missed out, Andy. We wish you were there. You would have had fun with us. We really We're excited to teach you. Andy, you're going to love it when you play with us. When you have nothing better to do with Yeah. When you have nothing better to do in life, you'll come up. Andy, would you believe that Nick bought thousands of the wrong bullets multiple times? I was watching him being like, I keep buying the wrong [ __ ] guns. Well, because they you can buy any guns, but you can't buy ammo for the guns until you're level 15 in Tarov. And you have to and it's very punishing with how you level up. You have to actually extract and do missions. So, when he gets to level 15, he's going to be so sad. No, I sold them all. I'm so poor in that game. So poor. Crazy poor. You got to get out of it. You're crazy poor, bro. We got to get you up, bro. Well, guns cost $30,000. Crazy. That's That's That's your nut right Tell you what,",
            "start": 475.36
        },
        {
            "text": "poor in that game. So poor. Crazy poor. You got to get out of it. You're crazy poor, bro. We got to get you up, bro. Well, guns cost $30,000. Crazy. That's That's That's your nut right Tell you what, we had a good time in Arc Raiders, though. Oh, Mike asking me to go save him in the middle of a field. That was great. That was great. Crazy. That's That's come and gone, man. A dark [ __ ] Accuracy 100. His attack. Okay, now Mike did talk [ __ ] about you, Nick. I need you to know that. Okay, I defended you. Of course, I gave a really funny one, Nick. You would have done I I I definitely defended you. But his Mike was dying in the middle of a field. He's like, \"Andy, I need you. Andy, come [ __ ] arrest me.\" I was like, \"Mike, you're way too far, dude. You're in the middle of the open. There's like What game was this?\" Arc Raiders. Okay. And I was like, \"You're way out there, Mike. I cannot.\" He was like, \"Andy, you [ __ ] run over here.\" I was like, \"I'm running out of stamina.\" He was",
            "start": 519.84
        },
        {
            "text": "like What game was this?\" Arc Raiders. Okay. And I was like, \"You're way out there, Mike. I cannot.\" He was like, \"Andy, you [ __ ] run over here.\" I was like, \"I'm running out of stamina.\" He was like, \"Don't you [ __ ] walk on me.\" And I finally get out there. I'm like, \"Oh my god, I'm in the middle of a field.\" I finally start resing him. I get start getting shot from both angles. I was like, \"God [ __ ] damn it, Mike.\" And he goes, \"I pulled a nick. I'm sorry. I pulled a nick.\" I said, \"Res me. I'm resable. I just want to be a part of the game.\" Exactly. I didn't want to miss out on the game, dude. That's all I was. I hate when I'm not resed. Res me. All right, sucker punch. Should I swap out sucker punch for dark faint or for faint attack? Yes. Oh. Oh. What do you think? I don't have any other dark moves. I have a rock smash, which is actual first person to chime says I would keep faint attack is what? Keep faint attack. What does faint do for you? And I miss hearing about dark",
            "start": 563.2
        },
        {
            "text": "any other dark moves. I have a rock smash, which is actual first person to chime says I would keep faint attack is what? Keep faint attack. What does faint do for you? And I miss hearing about dark bite. The user draws up the the foe disarmingly then throws a sucker punch. It hits without fail. Okay. But it's like only 60 power. This is 80 power. 100% accuracy. I would keep attack. Okay. What should I leave [Music] then? What would you leave? It can't miss. Bann can't miss, which is cool. That's great. That's sick. But I mean, this has 100% accuracy, too. Look at that. We have a little hype train going on right now to our Pokemon. Not understanding knowing. I feel like sucker punch is better than faint attack, you know, but I always give bad advice according to waffles. So, well, I'm wondering if I just keep I can keep faint attack. It's just inconsistent if they if if they use a status move, it doesn't Oh, so fant attack works no matter what. Yeah. So, even if I have a status move.",
            "start": 601.92
        },
        {
            "text": "if I just keep I can keep faint attack. It's just inconsistent if they if if they use a status move, it doesn't Oh, so fant attack works no matter what. Yeah. So, even if I have a status move. Okay. So, we just won't we won't work this. Got it. Okay. It's five of five PP. Yeah. Thank you to Ken Jr. and Kaos both. [Music] Thank you two for supporting Pokemon stream. Welcome back. Thing is like, have we even fought with Not Nick Dick? No, he's just in our starter pack. Yeah, we've we've recruited a rag tag group. Yeah, this is like remember when Chris was like, \"Don't worry, it doesn't matter. None of these guys are going to make it to your final six.\" Yeah. And now, guess what? They are our final six. I was like, Chris, clearly you don't understand how stupid I am and how bad at this game I am. This is going to be our final six. We've lost people. This is not like you do this. This is what you're when you're a movie studio head and these are your actors and you go a [ __ ] it's just",
            "start": 653.04
        },
        {
            "text": "I am. This is going to be our final six. We've lost people. This is not like you do this. This is what you're when you're a movie studio head and these are your actors and you go a [ __ ] it's just nothing but Nick Cage's circa 5 years ago. We're going to put out a Netflix movie off. Yeah, we got to have this. All right, so let's see who moved. We'll go through one by one cuz at 41 everyone seems to learn. Yeah, everyone 41 to 42 learning to move. I'll tell you what, Mike, I would love for you to pick another name to win. Do you know the last drawing that you did? You want to shout them out? The last drawing, the last drawing I did, I You said you wanted 45. 45. Who was it? It was uh Greninja. Greninja. Oh, okay. I don't know where the drawings are, by the way. They're right behind you. Uh on the desk on the far side by Nick's desk. We're back, J Money. We're back. Your boy Mike has done a lot of cleaning in the office. Thanks, Mike. I appreciate that. You know, Mike's tell people the",
            "start": 694.64
        },
        {
            "text": "on the desk on the far side by Nick's desk. We're back, J Money. We're back. Your boy Mike has done a lot of cleaning in the office. Thanks, Mike. I appreciate that. You know, Mike's tell people the spiel, you know, all your labels are pretty. Yes. So, of course, if you have won, you know what? I will say the spiel because, of course, we're going to do another raffle drawing. And as you know, we have brought to you, we have brought Pokémon to you, of course, to help keep the lights and mics on and get you all involved by saying thank you and of course appreciating your support on Twitch with Twitch subs where if you gift 10 tier one subs, you had the opportunity to enter the raffle to name a Pokemon and also win a one of one Andy Cortez drawing alongside the possible big Pokemon poster, which we've had Chris Anka draw on and members of the team. Now, as you can see, Andy is drawing away on these one of ones. Uh maybe don't show people's addresses when you get to those, but put them on",
            "start": 742.08
        },
        {
            "text": "we've had Chris Anka draw on and members of the team. Now, as you can see, Andy is drawing away on these one of ones. Uh maybe don't show people's addresses when you get to those, but put them on the back. I have reached out to a number of you who have won and said, \"Hey, give me your address. We're ready to send these off as we near the end of Pokémon.\" So, of course, if you win today, you will have the opportunity to have this sent to you. I think Andy probably might be good for two more maximum. So, these are really going to be down to the wire here of who gets these final Andy Cortez oneof ones out there. So, of course, if you won, make sure to check your Twitch whispers, respond to me with your name, mailing address so I can ship these out to you, uh, and get them to you as soon as possible. But with that, Kevin, are you ready to pick a winner then, big dog? Oh, you want me to pick a winner? No, I I I just want you to be ready. We'll we'll say the name together. Ready for what?",
            "start": 790.0
        },
        {
            "text": "possible. But with that, Kevin, are you ready to pick a winner then, big dog? Oh, you want me to pick a winner? No, I I I just want you to be ready. We'll we'll say the name together. Ready for what? We'll say the name together. We'll say the name together. So, we have 379 raffle tickets. Random number generator 1 through 379. No dragon dance, right, Chad? Dragon. So, just to be clear, you don't want me to do anything, right? Well, I want you to say the name with me. I like when you look up the number, you got to say it with him, Kevin. I just said it. Say it with him. Number 52, Kevin. Number 52. You want me to look it up? Just tell me. I want you to look it up. I'm looking it up on my side as well. 52. So, the uh Golden Spider 666. Congratulations. Golden Spider. Golden Spider, you are the winner of this Andy Cortez one of one. We'll look up the the Pokemon that you want Andy to draw and he's going to get to drawing. Congratulations. What was the command for that? Slash user and",
            "start": 837.04
        },
        {
            "text": "the winner of this Andy Cortez one of one. We'll look up the the Pokemon that you want Andy to draw and he's going to get to drawing. Congratulations. What was the command for that? Slash user and then Golden Spider 666. [Music] Oh my god, it's been weeks. Ghost fighter, if you're here, you might as well tell us what you want right now. We're going to pick for you. The opportunity of Kevin fighting this is going to be a long time. So, you're not looking. No, no, no, Kevin. That's you, Kevin. That's you, Kevin. Kevin, you got to look for it. [Music] I'll tell you what, I did get started on today's Gregway. I started a special one, not part of the raffle, but for our good friend Chris Anka, who wanted a feral alligator. Oh wow. Chris Ana was like, \"How much to how much uh would you charge for a for alligator?\" And I said, \"For real for for Ralph.\" And I said, \"No charge. No charge for this guy.\" Oo, he's going to use roofs now. But he also wants a Tyranitar. I don't know if I can draw",
            "start": 887.12
        },
        {
            "text": "for a for alligator?\" And I said, \"For real for for Ralph.\" And I said, \"No charge. No charge for this guy.\" Oo, he's going to use roofs now. But he also wants a Tyranitar. I don't know if I can draw both. You got you got time. I don't know if I got time for both. Let this move. Nope. Roost. Couple people out there. When do we start this? Started a long time ago cuz he was number 52. So that's really that was a day one. That was a long time ago. Uh a lot of people are saying uh they're they're worried about the second half. Chad, we all know about the second half of the game. Nick will be playing the second half of the game. We will beat the first half and then we'll move on later on. So, you can best believe we will get to that later on, but we all know about it. We're very excited about it. We were not there yet. It would have broke. I like Do we need roof? This doesn't do anything. It just destroys my HP. Come on, not bad. Ah. All right. I guess whirlwind sucks. [Music] Like, look",
            "start": 942.16
        },
        {
            "text": "it. We were not there yet. It would have broke. I like Do we need roof? This doesn't do anything. It just destroys my HP. Come on, not bad. Ah. All right. I guess whirlwind sucks. [Music] Like, look up if whirlwind's good. I mean, it's just it's not it just it's whirlwind is the thing where you go and then it switches out the right golden spider using use that chat. What do you think? That seems like it's re that seems like it's really good against PvP. [Music] Yeah. Whirlwind is so rare situational. I'll tell you what, I'm so pumped for freaking Pokemon saw. I mean, Roost could be cool. It could be cool to really need that. I could just do use a Here's the thing. I can just use a move that's basically I just heal myself that turn. Why wouldn't I just use a full heal spider talks a lot, huh? Yeah, I'm a fan, dude. A big fan. Supporter. Big supporter. It would be cool if he also every couple messages said, \"I want this Pokemon.\" Scrolled all the way up. Like 90. I like I like this",
            "start": 993.84
        },
        {
            "text": "huh? Yeah, I'm a fan, dude. A big fan. Supporter. Big supporter. It would be cool if he also every couple messages said, \"I want this Pokemon.\" Scrolled all the way up. Like 90. I like I like this message from Golden Spider. Classic streamer. They never do the tutorials or read anything. That's about you and I. [ __ ] everybody. They know us. They know us so well. Yeah. If you just like keep on scrolling and then maybe hit it with an F control F. I mean, but look how small this window is. And I think it searches in this one, not that one. You know what I'm saying? Also, what am I control F or I don't know the Pokemon? Um, you could type in Pokemon. Yeah. Yeah, you control F Pokémon. Yeah, but that would mean that he's you are you're in Blackthornne City, Nick. Yeah. Welcome to Blackthorn City. Nick, you need to get up to the dragon's den. Okay. Got to go back into the That's where the drug deals happen. Welcome to the den. So, now I got to go over here, right? Oh. Oh, that's just an",
            "start": 1053.4
        },
        {
            "text": "City. Nick, you need to get up to the dragon's den. Okay. Got to go back into the That's where the drug deals happen. Welcome to the den. So, now I got to go over here, right? Oh. Oh, that's just an accident. I got to do the puzzle again. Oh god, we had a good time with this one. Remember you spin it with a little Oh, yeah. Happy birthday, Kev Dog. How long ago? Ah, how far did you go back? I don't know. I need to just go. Happy birthday, Kev Talk. But it could have There was a joke years ago. Oh, no. That was March 28th. Like, somebody made a joke where it was my birthday and everyone was saying happy birthday. Oh, Lord. When's the first day we did the stream? Anybody know that? The top of their head. Uh, the first day we did the stream, January 6th. No, we kept it was around March, right? So, I'm guessing that sounds about right. March 24th. Was that just an interest? No, it was like our anniversary stream. Anniversary. I can't remember. No, it wasn't then. It was months later. Was",
            "start": 1103.2
        },
        {
            "text": "So, I'm guessing that sounds about right. March 24th. Was that just an interest? No, it was like our anniversary stream. Anniversary. I can't remember. No, it wasn't then. It was months later. Was it? I think it was March. I think it was originally going to be in March 14th. You check on the on the Mike. You got to navigate or read the chat. No, Kevin has me helping him with golden spider. Have you told me you weren't helping? You can [ __ ] help him for You told me you weren't helping. I'm literally writing Golden Spider directly. I could also do that for [ __ ] Yeah, we're off the rail. Off the rails, everybody. Well, it's funny cuz Andy needs to draw it now. I'm drawing Chris's. Oh, never mind. I mean, I would prefer to start camera on that. Heads up, man. I just did that perfectly. Remember how long I said this last night? Yeah. Jesus Christ. We learned. We've gotten better. I'm god here. Yeah. All right. So, I got to talk to Homie right now. Yeah. Mike, don't reach out to him",
            "start": 1161.44
        },
        {
            "text": "Remember how long I said this last night? Yeah. Jesus Christ. We learned. We've gotten better. I'm god here. Yeah. All right. So, I got to talk to Homie right now. Yeah. Mike, don't reach out to him because I'm I'll I'll once I'm done I'll I'll Well, I've already reached out. You can keep searching, but it's just there just in case as a backup. What have you changed? Go behind this person. What do you go to the dragon's layer? Yeah, I thought the dragon's layer was through here. Okay, I guess I'm not in the right spot. Only select trainers can enter the dragon's den, a place for training and meditation. Let's see how outside the gym. Got See the concern? Yeah. You got to find the one guy who's blocking the hole. Oh, he's got to block the hole. Yeah, I remember he was blocking the hole and he was like, \"You can't go in here unless you master the dragon's way.\" That sounds sick. Yeah, this exactly how it went down. That sounds awesome. Got to master the dragon's way. Pretty sweet. Is it",
            "start": 1210.72
        },
        {
            "text": "he was like, \"You can't go in here unless you master the dragon's way.\" That sounds sick. Yeah, this exactly how it went down. That sounds awesome. Got to master the dragon's way. Pretty sweet. Is it this guy? Are you going to master Oh man, I found it. [ __ ] Kevin found it. Never did this for my entry. So Andy, draw tortara. Oh, okay. Tort Terra. That's the the turtle. It looks like a big land mass. Now, Mike, you want me to add I'm already writing it right now. You're good. Sick. That's called teamwork, Chad. Okay. I mean, I'm pretty sure I just did all the argument. That's called What part of that was team? You all couldn't do that without each other. I don't think he literally midway through searching for it was like, \"Ah, Kevin, you help me.\" It's like, you know what? When we play the next one, you're navigator. I sit over there. We're going to switch spots. You do. I'll do the same job. When we play it, Kevin's going to be in the Pokemon. Kevin's going to actually get there and",
            "start": 1249.36
        },
        {
            "text": "next one, you're navigator. I sit over there. We're going to switch spots. You do. I'll do the same job. When we play it, Kevin's going to be in the Pokemon. Kevin's going to actually get there and we're all going to be over there. All right. I don't like that deal. Deal. That's it. That's it. I've decided. It's so hard to kill 14 of my Pokemon. Where's this Where's I was looking at the dead. Where's this dude at? Okay, let's take a look. Where's this dude? Did he kill more last time or more this time? He killed so many. Uh, way more this time. The dragon's den is up and behind the cave. So, here's the gym. You got to surf it. You got to go up and see the old man. Man, shout out to Chris Anker's [ __ ] book, bro. This tells you all. How long you think Chris Ang has had that book? Since he was a kid or Yeah, he said since the beginning. Yeah. Yeah. He did say, \"Please give it back.\" So, we're not going to [ __ ] it up. I like drink water, right? Let's get into it, guys. First one back.",
            "start": 1296.24
        },
        {
            "text": "was a kid or Yeah, he said since the beginning. Yeah. Yeah. He did say, \"Please give it back.\" So, we're not going to [ __ ] it up. I like drink water, right? Let's get into it, guys. First one back. Magikarp level 14. Great. This will really level us up. I sat here murdered level 22 Pokemon and I thought to myself, this is going to be this is going to be the death of me right here. Now, are you signaling? Uh oh, that's so small. What were you going to say? Just Kevin talking. Yeah. [Music] Uh, forgot what I was going to say. I tweaked my back. Oh man. You lift up the baby wrong, huh? Lift up that baby wrong. What' you do? Sleeping like on the couch. It was a work injury. Oh [ __ ] It's a work injury. That's [ __ ] real. You can't be saying that on content like that. That's major. No. No. Calling Anna Fog. Can I call something wrong? Something wrong. on F. All right. Now, do we need Mike's for the next part or Well, I mean, you got to talk to him and then we go into it. So, yeah,",
            "start": 1342.16
        },
        {
            "text": "No. Calling Anna Fog. Can I call something wrong? Something wrong. on F. All right. Now, do we need Mike's for the next part or Well, I mean, you got to talk to him and then we go into it. So, yeah, we're we're going to talk it out. Okay. What do I need out front? After the dragon's den, get a call from Professor Elm. Yeah. Now, we go into the dragon's den. I can't believe I found that. Very impressive. Good job, you had it. We don't have to panic. We got it. We got it. Pick your battles. Pick up your items. Mike, give me a check on Dragon Arrow. Now Mike's doing that. Okay. Dragon Air. Mike's my strategy there. I'm all over the place, baby. Dragon Air. Uh I thought last time we played I was like silver. Got it. Messing around. I'll do this. All right. Dragon Air. Let's take a look. Dragon Air on the special website everybody loves is a dragon type Pokemon. Straight up dragon. Just straight up dragon. It's a dragon type Pokemon. Where's our sheet? Oh, yes. Oh, it comes with a book as",
            "start": 1408.64
        },
        {
            "text": "Air on the special website everybody loves is a dragon type Pokemon. Straight up dragon. Just straight up dragon. It's a dragon type Pokemon. Where's our sheet? Oh, yes. Oh, it comes with a book as well. Okay, there it goes. Stuck in here. Got a little little sticky. Yeah. So, we don't have anything that can beat that. So, I'm just going to have to go have to do this. Well, you do have a six an eight level advantage, so we should be pretty strong. I think it'll be fine. People are saying get Koulito and use Ice Fang or just electrocute. Okay, this guy is pretty powerful. [Music] All right, we are right back. Here we go. We are right back into the [ __ ] fight, y'all. Kita Icebang. Okay, so I should swap out Kita for Icebang. Signal beam. I can try it. No. A bug type. Bug types aren't strong against dragon. Yeah, you thought of that for psychic and flying, which is Lugia. Ice strong against dragon. You have Yeah, ice is strong against dragon. I don't have an ice type Pokemon on. That's",
            "start": 1464.64
        },
        {
            "text": "against dragon. Yeah, you thought of that for psychic and flying, which is Lugia. Ice strong against dragon. You have Yeah, ice is strong against dragon. I don't have an ice type Pokemon on. That's right. Well, you have an ice type move, too. You know, I'll just discharge. Oh, easy. Oh, he's got the bell on, man. Nothing [ __ ] freaks me out more than us playing Pokemon. You know what I mean? My heart starts to pound a little bit. I get a little worried cuz it could be any fun. You start to question anything. Everything. It could be any funny. Well, the second someone hits you and they're five or seven levels below you and they take down a quarter of your [ __ ] What the [ __ ] is happening? What's happening? If someone's going to roll out on me, what's going on? Okay. Okay. Okay. We're back. We're back. Reset. Trying to, you know, we're deep inside the dragon's dead. There's uncharted territory here. You just found like some uh people tied up by the Dragon's Den gang. You know what",
            "start": 1530.16
        },
        {
            "text": "back. We're back. Reset. Trying to, you know, we're deep inside the dragon's dead. There's uncharted territory here. You just found like some uh people tied up by the Dragon's Den gang. You know what do we do? Retrace my steps. Call my boss. Man, could we have gotten for alligator in this game? Yeah, we can. What a crazy time. What do you get for all the to That's one of the opening Pokemon guy. Huh. All right. So, if you go to the Yeah. So, we're trying to get to a whirlpool on the left hand side. Audio is loud. Well, we'll get Kevin to do it once she comes back. I can do You know what? Shout out to um So, there's Yeah. So that's So you can battle that person. I'm going to battle. Okay. Get my feet wet here. Okay. I like that. You don't y'all need a mod to teach Whirlpool? Shout out to uh Bone Spider for asking for Tort Terra. That's a cool guy. He needs Aman to teach Whirlpool to or he needs Whirlpool cuz I don't have any Whirlpool reference until I'm on a Whirlpool until the Whirl",
            "start": 1578.4
        },
        {
            "text": "Bone Spider for asking for Tort Terra. That's a cool guy. He needs Aman to teach Whirlpool to or he needs Whirlpool cuz I don't have any Whirlpool reference until I'm on a Whirlpool until the Whirl Islands. But you're probably right here. Yeah. Oh, we saw the animation. Oh, yeah. I remember that was like going seven times speed on the camera. [Music] Is the mod to know whirlpool in here? It's an HM. I have it. I have the teacher. Okay, that's fine. Well, we only have six Pokemons. Guess what? He gets all them. I think I have that. You've been chosen. Tell him it's an HM, they say. Don't teach it to Kito, though. It's bad. Teach it to some disposable water Pokémon in the PC. When I got my cam, but I have to go back to the freaking PC. We got nothing but time. Well, you know, we got nothing but time. Also, there's four moves, Andy. You know what I mean? One move could be bad. You know, like, let's be real. Let's be real. Nick is known to use one move. You're so right. You're so right,",
            "start": 1653.12
        },
        {
            "text": "but time. Also, there's four moves, Andy. You know what I mean? One move could be bad. You know, like, let's be real. Let's be real. Nick is known to use one move. You're so right. You're so right, Mike. That's a really good point. Like you throw me off, homie. Like Mike's the most strategic person ever. He's used to just using one. It's all good. It's okay. You know what I mean? Not everyone has to be a winner. Now people are saying, \"Whip out the portable PC.\" I have a portable PC. You have a laptop? Well, we're learning this. We're learning right now. I did not know I had a portable. There's no way. There has to be trolling us. That would be nuts, right? That would be nuts. That would be awesome. Oh my god. Oh, that's a joke people are saying. Okay, well, don't [ __ ] joke with us, okay? We're both We don't know what's [ __ ] noobs. We're trying our best. Kito has two water ATMs. The good ones. Don't put another one on. I'm still thinking about how some bikinis are supposed to act.",
            "start": 1727.6
        },
        {
            "text": "We're both We don't know what's [ __ ] noobs. We're trying our best. Kito has two water ATMs. The good ones. Don't put another one on. I'm still thinking about how some bikinis are supposed to act. Yes, straight up. Uh, dragon straight up. Weak to ice. Yeah. I mean, you're 10 levels ahead of them. Let's just b [Music] It's crazy how uh how long we went on today's shows cuz I was like I'm going to piece out of three to go keep reviewing Doom, but that'll be 2 hours worth. [Music] Yeah, we're about 20 minutes into the stream. It's 3:00. Andy, we've had a fun Tuesday. I had a real sad moment yesterday, Mike, cuz I woke up to a text from Roger saying, \"Can you make the thumbnails and I was like, uh, yeah, no problem.\" But I was like, weird thing. Why didn't he ask me on Monday? Why is he choosing today? Yeah, yesterday was Monday. I woke up yesterday thinking it was Sunday. Like another weekend, I was like ready to just kind of chill out. It was Saturday night and I took out the trash",
            "start": 1779.44
        },
        {
            "text": "today? Yeah, yesterday was Monday. I woke up yesterday thinking it was Sunday. Like another weekend, I was like ready to just kind of chill out. It was Saturday night and I took out the trash cans, but trash night is Sunday night. And Candy, my roommate, stared right at me, didn't say anything. Like, \"Hey, Mike, you're a day early on this. Why are you moving the trash cans, put them out, thought it was Sunday night on Saturday? My world has been [Music] rocked. Fly didn't hit the last, did it not?\" No, it didn't hit. Why not hit maybe? Are they immune to flying attacks? Weird. So, what did you kill him with? Another ice fang. You went double ice fang. Yeah, but that was he was doing good damage. Should I rewind the tape? No. Tell me. I'm going to rewind the tape. I'll take a look. Throw up the challenge. [Music] addict. It was a great moment playing our creators. Mike starts making friends with randos. What's up, homies? Yeah, let's go. Let's [ __ ] tagle this [ __ ] on, dude. Yeah,",
            "start": 1864.48
        },
        {
            "text": "up the challenge. [Music] addict. It was a great moment playing our creators. Mike starts making friends with randos. What's up, homies? Yeah, let's go. Let's [ __ ] tagle this [ __ ] on, dude. Yeah, we're not we're not going to fight. We're going to fight you. And my game was kind of crashing, but then as I'm like getting joining back into the game, I said, \"Yeah, yeah. Oh, [ __ ] yeah. Yeah, let's [ __ ] hang out.\" I can't hear him at all. I'm not in the game. And then I just hear Mike getting real close to the microphone. I do. We're gonna [ __ ] kill them. Awesome. You're such a decent. But we ended up Fly did hit me. Ended up killing him. Fly killed that that Pokemon. Did it? Yeah. No, cuz I used fly, came back down, just killed that whole thing. So remember, he flies up for a move, skips a whole move. Play it back. I'm playing it back here on the big screen. Ready? So if we rewind this tape, right, you go. Ready? Hold up. No, because I struck first. No. So Kito hit the left one,",
            "start": 1920.04
        },
        {
            "text": "a whole move. Play it back. I'm playing it back here on the big screen. Ready? So if we rewind this tape, right, you go. Ready? Hold up. No, because I struck first. No. So Kito hit the left one, right? And then you went fly on the right one, right? And so one first move, a hyper fang kills that one. Iceman gone. Yeah. Fly strike next. No, fly. Fly. You have to move up in the air, then fly down. Wait for it. Wait for it. Yeah. Yeah. 230. Yep. Keep wet. Wet. 250. Exactly. Awesome. So, as opposed to Thunder, right? Super. Yep. Cuz you're currently in fly. Yeah. You're up in the air. You got to get in the air. And then he just came down and killed him right there. Oh, okay. I got you. So, boom. Got me. Yeah. So, Fly didn't hit. Didn't have a chance. No, Fly did hit. Fly hit. Fly killed that Pokemon. No, no, I killed I killed the Pokemon with ice. No. See, it says what to do next. Kito is going to be up next, but first it's Fly. Kev Kev used fly. See right there. Wow. Okay. [Music] Yeah,",
            "start": 1983.04
        },
        {
            "text": "Pokemon. No, no, I killed I killed the Pokemon with ice. No. See, it says what to do next. Kito is going to be up next, but first it's Fly. Kev Kev used fly. See right there. Wow. Okay. [Music] Yeah, we got a replay. This is this what it's all about. This is what reviewing the tape to become the best Pokemon. Give someone whirlwind so I can get through this world. We need to give somebody a whirl world pool to get through the whirlpool is right. Wait, didn't we just get rid of whirlpool? No, we got rid of our W world wind. Oh, I'm in this little pagod right now. I'm much uh the pigod is B. What's in the B? B has things inside of it. Photographer Cameron. I can't get on the other side. Oh, he's available Monday and Thursdays. Isn't it crazy that they added days into this [ __ ] game? What a weird thing, bro. What a weird idea. You couldn't play that one game cuz we the days were all Remember that? We didn't do the bug contest ever cuz we had no idea what was We were trying to play",
            "start": 2036.4
        },
        {
            "text": "a weird thing, bro. What a weird idea. You couldn't play that one game cuz we the days were all Remember that? We didn't do the bug contest ever cuz we had no idea what was We were trying to play Marathon and was like, \"Nick, go do the bug contest. Do the bug cont.\" We're trying to play Marathon and Marathon was like not working on Mike's PC. We're like, \"What the [ __ ] is going on?\" I was like, \"Oh, Mike's PC is sent to Friday instead of like today, Tuesday. That's probably chipping up the ante.\" That's exactly what it was. Only took like 30 minutes to figure that out. We downloaded it twice. People are saying my mic is very quiet. I thought like I heard that but then your audio was coming in clean. Will you see talk? Hello. Check check check. This is me talking still. Still talking. Is it off? Is my mic not on? No, it's it's on. I'm hearing your audio. I'm going to tap it. Not yet. I can see it. Yep. Everything looks like it's working there. So it's chat's just [ __ ] on us, man.",
            "start": 2096.16
        },
        {
            "text": "it off? Is my mic not on? No, it's it's on. I'm hearing your audio. I'm going to tap it. Not yet. I can see it. Yep. Everything looks like it's working there. So it's chat's just [ __ ] on us, man. God damn it, Chad. I don't think they're [ __ ] Andy, you barely came in. Is there a compressor on the mic? Um, yes, but that's like necessary. No, I'm saying that. Yeah, that's good. Yeah. Yeah. I mean, I I I messed with everyone's compression level, so the ending was coming real hot when we started. M real hot. Look at Tort Terra. There's a cool This is a cool Pokemon. Remember he was in the movie? Did you fight Pikachu? Yeah, he was. Great. Was he? Yeah. He was like the big land mass started moving. Yeah, that was cool. That's it. That was sick as hell. That was crazy. Like, look, talk about it. Why haven't we just had a serious Pokemon movie? JJ says the mics are way more quiet than the games. We dropped the game audio down a little bit. Okay, why not double down on that? Detective",
            "start": 2145.96
        },
        {
            "text": "it. Why haven't we just had a serious Pokemon movie? JJ says the mics are way more quiet than the games. We dropped the game audio down a little bit. Okay, why not double down on that? Detective Pikachu was so cool. It's the kids dreams. Let's just Let's go. Okay. It's cool because of because we saw things realized that we never thought we'd see realized, but just make a Pokemon movie that isn't about a weird kind of gimmick of a Poke. Like, make it just a kid trying to become the very best with all of these insane visuals and battles and like feels like a Netflix guaranteed win. Why? Why hasn't Netflix done that, you know? Yeah. What is Rock, right? Pseudo Woodoo is the one that we're like, we don't really need. I don't think I need him or Cap Keep wet wet for this. I'm just trying to figure out who to put in for this. That's not Well, keep kept wet wet cuz he he flies, right? That's not really like useful against Neither of these are useful against dragons and ice. You ever think",
            "start": 2191.72
        },
        {
            "text": "figure out who to put in for this. That's not Well, keep kept wet wet cuz he he flies, right? That's not really like useful against Neither of these are useful against dragons and ice. You ever think that fly should be good against Magikarps like fish? You know what I mean? If you're a fish Pokemon, fly eagle claws. Yeah, eagle claws. Yeah, climbing down. That should be a win. Andy, you're driving this fast. Looks so good. Thanks, bro. Yeah. I mean, they're they're super easy when the shapes are very easy to kind of get down. Like, it's just it's essentially it's it's [ __ ] an oval with an oval head and a tail. You know what I mean? Like, the shapes are very easy to kind of figure out. Here's a crazy You ready for this comment? Rusty Pond says, \"I'll say it again. I think you should check if Miltank can learn Whirlpool before switching anybody out. If that [ __ ] cow can learn whirlpool, my mind will explode live on. It'll be the new dills. Exactly. Like, let's check it out. Excuse",
            "start": 2244.24
        },
        {
            "text": "if Miltank can learn Whirlpool before switching anybody out. If that [ __ ] cow can learn whirlpool, my mind will explode live on. It'll be the new dills. Exactly. Like, let's check it out. Excuse me. Let's check it out. Let's check it out. This [ __ ] Miltech is all can also learn Turboax. It's a notary as [Music] well. Oh, you didn't know Miltech? need to learn flamethrower. He can learn it. Oh my god. He can [ __ ] learn it. That's incredible. What move are we losing though? But why would we teach that that we will pass this? Uh for Lugia, we will. Okay. But like, you know, it's not like that big a deal. I don't think that's amazing. That's that cow can do it all. Good for the cat. Yeah. I mean, let's see what we can get rid of. This beautiful cow can do it all. Let's see what we can get rid of. What am I keeping him in there if it's a good move? What a beautiful species. It's a water move. Look at this. That's weird. Power 15. It's a dog water. Oh my god. Accuracy 70. Oh, P. Not",
            "start": 2288.96
        },
        {
            "text": "get rid of. What am I keeping him in there if it's a good move? What a beautiful species. It's a water move. Look at this. That's weird. Power 15. It's a dog water. Oh my god. Accuracy 70. Oh, P. Not [ __ ] this. No. What are the other like what what are some moves we can lose? Well, body slam is great. Yeah, but you're not drinking milk that much. Well, I wouldn't drink milk because I'm thinking there's no point to drinking milk now that I have you have to heal. I don't really need that. You might not need milk drink anymore. He could theoretically he could theoretically if he ran a doubles match heal one of my other partners. Yeah, but you just throw but then it sucks it sucks his healing down. Right. Somebody in chat saying go to there's a move deleter in the town. You can delete whirlpool when you're done with it. Yeah, but then I have to put something else on. I can't get milk drink back. Yeah, you won't get milk drink back. No. Yeah, you're right. But I don't really use milk",
            "start": 2348.04
        },
        {
            "text": "when you're done with it. Yeah, but then I have to put something else on. I can't get milk drink back. Yeah, you won't get milk drink back. No. Yeah, you're right. But I don't really use milk drink. I don't think I'm going to use it. You don't ever drink milk. quickly replace Poliworld for Well, I'm going to probably quit. Yeah, Poliworld is going right back. Get wet back in now that I can teach milk tank the That's crazy, bro. Now, Mike, what if you can get extra powered if you drink chocolate milk with a ham sandwich? I mean, some some say at 5:30 p.m. when I thought that was going to be a good idea, I would be [ __ ] fueled up for the night. Okay. Now, by 6:30, my stomach said otherwise. Demonic level 45 off. I gota turn off my stream. Why? Uh the chocolate milk and turkey sandwich on hit and right. All right. Is Is this a good idea? Nick's doing something. I think it's fine. Nick, you let's remember. We've had We've had 30 plus hours of Pokemon experience. How many times have you",
            "start": 2395.32
        },
        {
            "text": "hit and right. All right. Is Is this a good idea? Nick's doing something. I think it's fine. Nick, you let's remember. We've had We've had 30 plus hours of Pokemon experience. How many times have you used milk drink? Like twice. I think that's the answer. You know what I mean? Well, I could just teach him to Sexy Brisket. Sexy Biscuit is here for a reason. That's right. Sexy Biscuit's there for a reason. Forgot that was a Pokemon. But like, how beautiful would it be if Milk Mommy of all people could use Whirlpool and just be that Pokemon for us? I mean, I want it. Yeah, that's what I'm saying. Have some fun. That seems a lot like a wasted move. Just a utility infielder, you know? Exactly. Just do it all type of cool. Let's see what Let's see what our Poliw has on it. Like, you got to question after learning that Milk Mommy aka Miltank can do anything. It's like, why wasn't this a cover star? You know what I mean? We didn't put the cow on the front of a a Pokemon. No. Am I adding",
            "start": 2439.44
        },
        {
            "text": "question after learning that Milk Mommy aka Miltank can do anything. It's like, why wasn't this a cover star? You know what I mean? We didn't put the cow on the front of a a Pokemon. No. Am I adding Whirlpool to uh the the sidebar or are we just leaving it wet catch? No. Well, let's hold for a second. Wait until he moves. You We'll figure it out. He's He's deciding. He's thinking it over what he likes. Get rid of that body stuff, right? Or wait, no, wait. Well, this is No, this now I'm going back and forth as to whether or not I should have this. You're covering your mic. Rain dance. You'll probably never use. Yeah. Yeah, definitely. Hollywood World is just back up like, \"Oh [ __ ] things have gone ary. We got sexy brisket there. Just do it.\" There you go. That's going to be our HME. I should teach it surf too and just give Surf's pretty good move. Yeah, surf's really strong, especially though. Yeah. Yeah. Well, I could evolve that using a water stone right now. Should I do that?",
            "start": 2485.84
        },
        {
            "text": "I should teach it surf too and just give Surf's pretty good move. Yeah, surf's really strong, especially though. Yeah. Yeah. Well, I could evolve that using a water stone right now. Should I do that? Yeah, you got one. You might have every item in everything. I want to see what that looks like. Oh, man. I don't think he gave you items. [Music] I think this is just stuff you have. Uh, I typed in one code and he gave you 900 of everything. I have something a lot of. Yeah, we have things we've never had. But I don't see any I don't see any stone. I think it's fur. Yeah, I don't know if they're stones. There may not be stones. I We could find one though. We'll keep that in the back. We'll keep that in the back. You want me to search that out? No, we'll keep it in the back pocket if we on the odd chance that both of our gyroses go out of business here. Okay. Got a commission. I'll see who's calling. Ian's calling. Let's see what he wants. What's up? Oh, man. Do you know where your cool",
            "start": 2539.12
        },
        {
            "text": "odd chance that both of our gyroses go out of business here. Okay. Got a commission. I'll see who's calling. Ian's calling. Let's see what he wants. What's up? Oh, man. Do you know where your cool stones are? Hey, bro. You haven't [ __ ] been answering my calls for 3 weeks. Where Where'd you go? Should we check in and see what our toga pie is? No. Oh, we definitely should. Well, we haven't. My mom My mom took my P my Game Boy. I haven't played in 3 weeks. I mean, I was stepping, so there's a chance he's a little bit higher. Sometimes you forget about I mean, now this was another great call by us. Yeah, this made some great Reddit me. This is like Andy's secret Snickers. Exactly. Get excited. That's what this Pokemon is. 53 Jesus Christ. Jesus Christ. That means he's a destroyer. He's a destructor. Destroyer of worlds. Togepi has no good moves. Oh my god. Oh my god. Yeah. Zero. I want it to be that when you go back to the to the uh daycare that they're like, look, they call you and",
            "start": 2583.6
        },
        {
            "text": "destructor. Destroyer of worlds. Togepi has no good moves. Oh my god. Oh my god. Yeah. Zero. I want it to be that when you go back to the to the uh daycare that they're like, look, they call you and they're like, Togepi is negotiating with us. That's how weap is now our boss. Oh, it's us. Oh my god, that's so funny. Mike has some unaccounted for hours. Uh, minivan, he's got some unaccounted for hours. He's been leveling [ __ ] up off stream. Yeah, I got a lot of unaccounted for hours. Speaking of unaccounted for hours, somebody in the chat asked me if I've been watching the rehearsal and yes, yesterday's episode was one of the most amazing things I've ever watched. Should I watch it? Cuz you got me on the season one I watched for you. I tried this one and then it was about planes and I got a little worried. cuz you were talking about pilots and planes. I was like, \"Oh [ __ ] is this guy going to crash a plane or something crazy?\" So, I got a little worried. It uh dude, yesterday's",
            "start": 2639.36
        },
        {
            "text": "got a little worried. cuz you were talking about pilots and planes. I was like, \"Oh [ __ ] is this guy going to crash a plane or something crazy?\" So, I got a little worried. It uh dude, yesterday's episode is like the hardest I've laughed in a long time. Probably since, honestly, since Seth Rogan fell through that [ __ ] table in that one, the one shot episode. I love that. That was the funniest [ __ ] What show was that? The studio. I haven't I'm not caught up. I haven't watched uh The Last You know what the best part about today is? Mhm. New episode of the studio tonight. I'm caught up. I really enjoy it. And we got renewed for season 2. Wa. Yeah, we'll get more studio. That's exciting. My first time using it. Whoa. I'm very excited. Oh, you just power through across it. What a dumb thing to have in the game. Now you can reach the south entrance of the shrine. Well, do I go in? Yep. To press. Answer the master's questions. Going to ask you five questions. Okay. You have to select",
            "start": 2686.64
        },
        {
            "text": "to have in the game. Now you can reach the south entrance of the shrine. Well, do I go in? Yep. To press. Answer the master's questions. Going to ask you five questions. Okay. You have to select them on the touch screen. Okay. That's going to be hard. I think that's I think that's going to come down. Be hard. It's going to be tough. We're so bad. What are Pokemon to you? Allies, friends, junior. I would say well you were you were because you were tapping on friends the the I don't know if we have to get these right or not. I have no I mean I guess I keep reading battles. That's so funny to me. What helps you win battles? Mostly strategy. Um Andy's rare candies. I don't think I can do this. You don't need to do this. What type of trainer do you wish to battle? Strong. Only strong. Just say strong. Only strong. So I can mark the [ __ ] What is important? What is the most important phrasing knowledge? [Music] Now Chad, the guide book, the guide book doesn't have the answers. Okay, Chad,",
            "start": 2736.64
        },
        {
            "text": "strong. Only strong. So I can mark the [ __ ] What is important? What is the most important phrasing knowledge? [Music] Now Chad, the guide book, the guide book doesn't have the answers. Okay, Chad, calm down. The guide book doesn't have the answers. Everybody relax. You have to know the answers within. Mhm. I guess you got that one wrong, huh? Guess [Music] so. You just pretend you didn't say the wrong answer. Yeah, right. This guy's like, \"What?\" Wink wink. No. No. Try that one again. Oh [ __ ] He's on me, dude. Oh [ __ ] No, you got it right. You did it. This dude's back. Claire. That was me. Oh, Claire's pissed, dude. Dude, I'm better than Claire. I'm the last dragon. [Music] Yeah, going to get dragon pulse. Dang. Oh [ __ ] This guy's going to have a sick lance on Claire. Claire doesn't admit defeat. You don't want to [ __ ] around with Lance. Give me the badge, Claire. No [ __ ] around. That's my last badge, everyone. We did it. Until next time, it's been our pleasure to serve",
            "start": 2806.36
        },
        {
            "text": "admit defeat. You don't want to [ __ ] around with Lance. Give me the badge, Claire. No [ __ ] around. That's my last badge, everyone. We did it. Until next time, it's been our pleasure to serve you. No more Pokemon for me. Kevin will now return for the second half of this playthrough. [Music] Some music. Thanks, man. By the way, have you heard of Lugia? Between Olive Vine and Sinwood are islands called Wool Island. There is a huge world waterfall deep in the cave there. It is said that Lubia rests in the deep of the waterfall basin. You need a silver wing to reach the waterfall basin. I've heard I got to go find a silver wing. Mike, I think that's a Pokemon. Really? Yeah. I believe that's a Pokemon. It's a flying Pokemon. Silverwing. Yeah, silver. No, never mind. That's Scarmony. Scarmony. I guarantee you didn't pronounce any of anything right. You are aware. Oh [ __ ] I missed that. You're the [ __ ] You're the best. I missed this [ __ ] Oh my god. Just roasting each other forever",
            "start": 2869.36
        },
        {
            "text": "I guarantee you didn't pronounce any of anything right. You are aware. Oh [ __ ] I missed that. You're the [ __ ] You're the best. I missed this [ __ ] Oh my god. Just roasting each other forever playing Pokemon. Oh my god. Like, why would you read that out of order? I'm like, why would I read that out of order? Clearly goes in ascending rank. It doesn't matter. I didn't even do that much today. My god, you [ __ ] today. Can you go up there? I think I might need to go this way. I haven't even caught one. Oh, I haven't caught one. You haven't caught a jatini. Whoa, good call. Let's start throwing balls at it. You got one of them quick balls. Oh, I don't have a ton of balls, though. Throw a quick ball at it. Sure. Now, is this the one for catching quick Pokemon or the first move? I don't know. We'll find out. It is. Yeah. The fast ball is the one for fast Pokemon. Got it. Thank you, Andy. Mhm. Holy [ __ ] This thing is powerful. That thing is 15 and just did that to a 45 Pokemon. That's",
            "start": 2934.48
        },
        {
            "text": "We'll find out. It is. Yeah. The fast ball is the one for fast Pokemon. Got it. Thank you, Andy. Mhm. Holy [ __ ] This thing is powerful. That thing is 15 and just did that to a 45 Pokemon. That's crazy. Just a 40 damage. 40 damage. No. The problem is if he hits it at all. Yeah, but I'm gonna what I'm gonna do is I'm gonna swap out for the dude, right? Cuz he's got Oh, the one that they can't move. Thunder wave or whatever the [ __ ] it is. What's the dude's HP? Oh, it's enough. I don't Oh, yeah. Yeah, it's right there. This guy's just enjoying the fight here. Thunder wave. Your team is a dragon type. [Music] I don't think you need to use quick balls anymore. Oh, I don't know about ultra. Probably want to save those for when you're trying to catch this. Oh, this thing is just free. Now, is this Where did you find this? In the water. In the water? Yeah. Oh, interesting. Cuz if you go back and talk to the old guy, he'll give you a free one of these. Really? It looks like it. Yeah, it",
            "start": 3005.92
        },
        {
            "text": "is this Where did you find this? In the water. In the water? Yeah. Oh, interesting. Cuz if you go back and talk to the old guy, he'll give you a free one of these. Really? It looks like it. Yeah, it looks like it. Just hit it in. He gives you a free one. [Music] What was the one where I was like, just throw an ultimate ball at it. That was the ultimate ball. [ __ ] done sparse. Oh yeah, that was good. That was a good one. Oh my god. Damn [Music] it. Was Duncars part of It was part of the Suicide Squad, right? Oh, yeah. That went to the Suicide Squad. That gave its life. Dun Spars was our most expensive. I got this funny. Oh my god, that's funny. You got to catch it. I don't know how I don't have anything like stats. Oh, I guess I could light it on fire and burn it. Well, it's dragon, so fire damage. Yeah, but I just need to start taking it down a little bit. Yeah, but what I'm saying is like your fire attacks will only do half damage, too. [Music] I didn't know that. That's cool.",
            "start": 3070.96
        },
        {
            "text": "so fire damage. Yeah, but I just need to start taking it down a little bit. Yeah, but what I'm saying is like your fire attacks will only do half damage, too. [Music] I didn't know that. That's cool. Thanks. You know a lot about this game, Kevin. I have the Pokemon database website open. That's all you need, man. Let's Let's give him some prime time. I'm already paralyzed. You can't burn it now. I can just hit it though, right? If I hit it with level 45, they die. Now, here's a good Pokemon right here. That's prime time. That Ninetailes. That's Oh, yeah. Right there. That's the one where we got when we evolved the Ninetails, we were like, we're [ __ ] back. And we left. We never came back for it. Oh man. Maybe use the [ __ ] ball. Maybe use an ultra ball. This thing's got to die. I'm wasting my [ __ ] time on this. I mean, we're having fun. Throw one ultra ball. I did already. Oh, you did? Yeah. I'm throwing three different types of balls at this thing. Eat them in death. Oh, weird.",
            "start": 3133.04
        },
        {
            "text": "my [ __ ] time on this. I mean, we're having fun. Throw one ultra ball. I did already. Oh, you did? Yeah. I'm throwing three different types of balls at this thing. Eat them in death. Oh, weird. It didn't give us a bunch of balls. Do another ultra ball. Isn't that fun? It was just those [Music] [ __ ] ass. Oh, that thing doesn't care. Murder. That thing doesn't care. Poliwhirl is weakest. Water does half damage to it, too. Uh, we can try Poliworld. Sexy risky. The half damage is still going [Music] to punch this thing in the face so quick. You should just have like the actual trainer Johnny ace go up and like hit it. Whirlpool kind of sucks as a million, right? It has like a 70% accuracy. Yeah. Wasn't it 15 power and 70 accuracy? Yeah, they're trying to soften it up. They say that's good. Oh, we're going to really soften. That was really [ __ ] soft. Yeah, we're going to we're going to take our time with this one. It's okay. It's all right. Yeah, it's okay. We want to catch it. We're",
            "start": 3192.24
        },
        {
            "text": "Oh, we're going to really soften. That was really [ __ ] soft. Yeah, we're going to we're going to take our time with this one. It's okay. It's all right. Yeah, it's okay. We want to catch it. We're going to sweet talk this TV here for a second. Mhm. I just wasted $75,000 worth of Pokeballs on this stupid thing. Oh [ __ ] He's no longer He's not paralyzing. Oh my god. Big problem. Big problem. Big problem. Big problem. It's level 15. So, the dragon the dragon rage will always do 40 damage. Oh, you got it now. You're in you're in the ballpark. Holy [ __ ] Okay. Okay. That's what I'm saying, dude. This thing is Holy [ __ ] That was crazy. This thing's nuts. [Music] This thing's cracked. Why are they so powerful? This is a child soldier. Insanity. The [ __ ] a lava cookie? Oh my god. [Music] This is paralle restore. No, it's what I want. I want milk, right? I mean, any of them would work, right? I want this. I'm in the wrong spot. That did more than 40 damage, chat. What are you talking",
            "start": 3254.32
        },
        {
            "text": "This is paralle restore. No, it's what I want. I want milk, right? I mean, any of them would work, right? I want this. I'm in the wrong spot. That did more than 40 damage, chat. What are you talking about? Insane. 101 to 57 is more than 40 damage. You told me 40 damage, chat. I I think I said 40 damage on the the one. No, the chat said it, too. Oh, really? Just throw. There's 40. I just got to throw a [ __ ] ball at this thing. Roll the dice. Sexy Biscuit dies. He dies. Fair. I mean, Mil Tank Mil Tank can learn Whirlpool. We'll be fine. Our level 37 sexy brisket. [Music] All right, that got a little spicy for a couple of minutes there. Level 15s route this thing up. Put this thing in. Uh Mike, do we want to Kevin? Give me a number. Let's draw a number right now. Our winner is number 80. Kevin. 80. Number 80. Ones. Uh it's Windo. It says Windigo again, but I think we've already named it Windo before. Have we named it Windo? Okay. So 80's already been selected. Let me get you a new",
            "start": 3318.64
        },
        {
            "text": "Kevin. 80. Number 80. Ones. Uh it's Windo. It says Windigo again, but I think we've already named it Windo before. Have we named it Windo? Okay. So 80's already been selected. Let me get you a new number. Kevin Windigo did Windo Stark did like 10 Windo. Oh, Windo. Yeah, Windo is great. Windo. Some of them are misspelled. Windo. You like that? Yeah. Yeah. I don't know if that was you or not. I think I just stopped putting in Jesus. Right. Here we go. We'll pull another one right now. Kevin, ready? Okay, go for it. Number 349. Take yourself all the way down to the bottom, Kevin. That's what I like to see. 349. Benny. Benny. Benny. That's a good name. I like that. That's a good name right there. Benny in the They don't make it like that anymore. It was I Oh [ __ ] Was it? Yeah. [Music] You go up all the way and then on the right. No, cuz it's a cliff. [Music] Magic car hanging in my ass. Level 13. Why are we just running? Cuz we have to establish dominance inside of the dragon. Who's",
            "start": 3374.48
        },
        {
            "text": "go up all the way and then on the right. No, cuz it's a cliff. [Music] Magic car hanging in my ass. Level 13. Why are we just running? Cuz we have to establish dominance inside of the dragon. Who's boss? We have the left. I don't bow down to fish. Also, now you don't have to go to uh does the the milk this one? Does the milk also restore PP? I don't know. I don't think so. All right, we got some cool [ __ ] to do. So, we caught the Dratini. So, we're not going to go back and see the old man who gives Well, maybe he gives me a better Dratini. No, it's a weaker one. Is it gives you a rare valuable Dratini? It It knows extra speed, but only if you correctly answer every single one of the masters questions, but we didn't do that. So, yeah, you [ __ ] me up. He really got you with that one. But first, back to Blackthorn City. Let's go on back. [Music] things in this magazine. Damn, they got me going back pages. That's [ __ ] crazy. How the hell's Dudikov paralyzed? What did he get",
            "start": 3430.56
        },
        {
            "text": "one. But first, back to Blackthorn City. Let's go on back. [Music] things in this magazine. Damn, they got me going back pages. That's [ __ ] crazy. How the hell's Dudikov paralyzed? What did he get paralyzed with? Snowboarding accident. Jesus. Oh, wow. That went dark. Wow. That's [Music] crazy. Oh my god. Bloody big [ __ ] moment coming up. Here we go. I don't know what that means. I don't know what you're looting. Get the [ __ ] out of here. [Music] See, like end game. These are 16. What are we doing here? I don't know. What are we doing here? Magikarp. This is why we had to cheat. It's their fault. [Music] How much is he giving out? 45. 45 nothing. You know, not bad. All right. So, maybe I have to go up here. Hold on. Let's take a look. I'll give this one more shot of [Music] him. Is that Oh, I can walk up that little way. Yeah, I have to be able to [Music] [Music] [Applause] [Music] walk when you're looking forward to the next moment. Like is it story related or Yeah, it's our boy",
            "start": 3499.92
        },
        {
            "text": "Oh, I can walk up that little way. Yeah, I have to be able to [Music] [Music] [Applause] [Music] walk when you're looking forward to the next moment. Like is it story related or Yeah, it's our boy Professor Elm's going to give us a little ring and a ding and he's going to give us a special Pokeball. Oh, the Master Ball. Oh, sick. It can catch any Pokemon, Andy. No matter. Choose wisely. I want Lugio. I just keep hearing about this Lugio guy. Lugia. Lugio. I want Lugia. Thank you. Look at this [ __ ] Thank you. Thank you. Oh man, baby. Baby, dude. I'm all about it, bro. You see the Rizzler meet uh meet the cast of the Thunderbolt. Yeah, she killed me. [ __ ] uh what's her face? Louis uh Julia Lou Drifus being like I I felt bad. I don't know who that child was. This child was the wrestler. You shouldn't, Julia. You should not. You're They go You went kind of You went You went semiviral today. Did you know that? Oh, I heard about that, but I don't know why. Oh, you met the Rizzler. Oh,",
            "start": 3608.44
        },
        {
            "text": "You shouldn't, Julia. You should not. You're They go You went kind of You went You went semiviral today. Did you know that? Oh, I heard about that, but I don't know why. Oh, you met the Rizzler. Oh, you mean that child? The is more than just a child. Julie Drifus. The statement [Music] Oh [ __ ] Come on. Shake going on. Oh, she apologized to me and gave me 1059. What's 59? Oh, dragon pulse. Sick. Huge gener. You don't want it. You don't have to take it. I'll take it. What's the matter? If you are headed to Pokemon League, go back to New Bark Town and surf along Route 27. Your face is telling me about has an unfinished business. Come on. Whatever you have to face from now on. Don't dare give up. Worry about having lost you. Give it your all. I think man. Dragon pulse. Do I need it? Chat, let me know. She's been way too like encouraging for having just met you. She's in. She likes the Oh, here it comes out. Oh, yay. I've gotten hold of something neat. Swing by the lab. Pick it up. See",
            "start": 3693.08
        },
        {
            "text": "let me know. She's been way too like encouraging for having just met you. She's in. She likes the Oh, here it comes out. Oh, yay. I've gotten hold of something neat. Swing by the lab. Pick it up. See you later. Bye. I hate myself right now. Why? Cuz the only Pokemon I have fly is not in my Well, guess what the cool part is? Is you can take the road less traveled. You could fly straight to New Bark Town to meet Professor Addio, but south of Blackthornne City is a route you haven't explored yet. The route ends up near New Bark Town, so you might as well head south from Route 45. Head south. I am going to take Polar out of my squad, though, because I do that back in. Let me take a look. I think you have some time, is Rice. Yeah, you got a while until you [Music] How old is the Rizzler? I think nine. Very young. Yeah. Yeah. Yeah. You see a special room makeover with the Avengers stuff. He's got a slide in his room. That's sick. So cool. And Jarvis talks to him. Nice. The Rizzler. One of",
            "start": 3779.2
        },
        {
            "text": "nine. Very young. Yeah. Yeah. Yeah. You see a special room makeover with the Avengers stuff. He's got a slide in his room. That's sick. So cool. And Jarvis talks to him. Nice. The Rizzler. One of the Avengers, he says. Do you think he likes that or do you think he just at this point wants to be left alone? The Rizzler. Yeah. I think he just wants to play Fortnite and just be be a child. But like just leave me alone. So go back to the left. Back to the left. And then down between those two dead trees is your way. Actually, thank you everyone. Yeah, I don't I don't see the Rizzers being God damn it. We'll need Polywolf to get the island. Well, yeah, but we're not on the island yet, though, chat. We still got Route 45 and 46 to go through and a bell tower. Nick talk. Check. This is Nick talking. This is Nick talking. I'm here. This is my voice. I don't see the Rizzers being kind of over it or jaded. Check. Oh, wow. No, I think he's having a great time. The kid some of the times here just",
            "start": 3847.12
        },
        {
            "text": "This is Nick talking. I'm here. This is my voice. I don't see the Rizzers being kind of over it or jaded. Check. Oh, wow. No, I think he's having a great time. The kid some of the times here just audio is not coming in. It's so weird. Talk a little more. Hello. Check. This is me. I mean, it's uh I don't know. Is it a gate issue? Is the gate too strong? That's a great question. It might not be catching my audio. No, the gate set super low. Does it have anything to do with when all our computers were exploding? Didn't I do this whole path already? Which one? Have you been down this path? Yeah. Yeah. Yeah. You go down this path. I definitely ripped this for like an hour. You rip this? I think so. Well, if you go down all the Really? I've never seen this. Okay. Interesting. Yeah. If you go down this all the way to the bottom, you should arrive at a dark cave or Route 29 to New Bark Town. So, it's completely up to you. If you want to just fly and see Mr. Addio, you can do that to save you",
            "start": 3903.6
        },
        {
            "text": "this all the way to the bottom, you should arrive at a dark cave or Route 29 to New Bark Town. So, it's completely up to you. If you want to just fly and see Mr. Addio, you can do that to save you time. Or you can rip it and rip it. I'm pretty sure I did all these right. Okay, we got Ace trainer Ryan Kelly. I definitely grind here. Like grind here the [ __ ] out of this. Okay, then let's dip out. See this homies like what's up? Oh yeah, he said I don't give a [ __ ] Let's do it. All right, new bark town it is. [Music] Yeah, I think there's not a spot on this map that I haven't affected. You think so? Okay. Yeah, it was when you were away. I think you were doing something like flying to Japan or some [ __ ] like that. I was flying to Japan. I don't know where you go, Mike, but I don't like you not being here. I don't like for hours. And I invite you to hang out with me all the time. Lot of unaccounted for hours from Mike. Lot of anaconda for hours. That's so cool. turkey sandwich and",
            "start": 3950.96
        },
        {
            "text": "you not being here. I don't like for hours. And I invite you to hang out with me all the time. Lot of unaccounted for hours from Mike. Lot of anaconda for hours. That's so cool. turkey sandwich and jug of milk. They're getting after me. It's true. Sorry to [ __ ] your brain up. My favorite was so late at night. I've been really enjoying turkey with some cheese and two slices of bread. So, a sandwich, Michael. So, he's making a sandwich. Is that what they call it? Take this as a token of my appreciation. Master ball. Hell yeah. Don't Don't lose it. Hey, put the Master Ball in his pocket. The Master Ball is the best. It's the ultimate Pokeball. It'll catch any Pokemon without fail. It's only but it it's given only to one noted Pokemon researcher. So think you can make much better use of it than I can. By the way, we just had a group of beautiful kimono girls looking for you. Oh, so get this [ __ ] People are talking about you running away from you, right? That's a kimono girl. Maybe I",
            "start": 4006.4
        },
        {
            "text": "than I can. By the way, we just had a group of beautiful kimono girls looking for you. Oh, so get this [ __ ] People are talking about you running away from you, right? That's a kimono girl. Maybe I don't know. So the bell tower is only hard gold. So yeah, we are going to the whirl islands now. Okay, it's time to catch Lugia. We might be able to catch Luga before the end of today's stream. We could cut you down from four streams to only two streams. Whoa. You could you could be done with Pokemon by tomorrow afternoon. Wa. Yeah, right. Just letting you know what could happen. Too excited. What if I What if I spent the rest of this stream taking all 900 of those rare candies and distributing it so I was just invincible? How would you feel about that, Mike? Oh, man. You know what? I I would turn my head and not even look at it. I won't even say it. Where am I flying to? You can now explore the deepest parts of the whirl island if you're playing Pokemon Soul Silver. It's said that Silver",
            "start": 4051.2
        },
        {
            "text": "turn my head and not even look at it. I won't even say it. Where am I flying to? You can now explore the deepest parts of the whirl island if you're playing Pokemon Soul Silver. It's said that Silver Ring, Silver Wing can call forth the legendary Pokemon Lugia from its slumber. Do I have Silver Wing? Someone was saying I already have that. Do you have Silver Wing? I don't know if that's Pokemon or it's a Pokemon, but I think it's definitely a move. It doesn't sound like a Pokemon. I can look. I can look. Uh, I mean it would be uh wet cab, right? Well, let me check my TMs and see. Maybe a key item. Silver. What's it called? Silver wing. Check items. It's a key item. People are saying Oh, it's a key item. Okay. The silver wing allow silver wing. Got it. Oh, I got it. Okay. So, that will allow you to call forth Lugia. So, we need to go to route 41. Do I need to move it to someone's Do I need to put it on a Pokemon? No, I think you just use it. He's going to like whistle into it. Woo.",
            "start": 4098.64
        },
        {
            "text": "allow you to call forth Lugia. So, we need to go to route 41. Do I need to move it to someone's Do I need to put it on a Pokemon? No, I think you just use it. He's going to like whistle into it. Woo. Okay. All right. Uh, I need Whirlpool back. I should have given into the Mil Tank. I should have listened to you. That [ __ ] would have been really funny. Would have been awesome. Thank you to Sunny Nolles who just gifted out 10 tier one subs. Oh, Sunny Nles. Sunny Nles. Thanks. Thank you for that. Thank you for celebrating Pokemon and the return of Pokemon. Oh, thank thank you, Sunny Nles. Thank you. Thank you. Thank you. I'll tell you what, I missed you guys over the weekend. Saw Nick and his cool Star Wars Gilo. You went great. I went to Star Wars day at the uh ballpark, Andy. Oh, nice. Great. Uh Sunday afternoon. Uh no, they said it was the fastest giveaway they've ever done. Damn. 15,000 journey in jerseys. Wa. There was a sold out crowd of 40,000 at the ballpark. Uh, but it was",
            "start": 4147.76
        },
        {
            "text": "Great. Uh Sunday afternoon. Uh no, they said it was the fastest giveaway they've ever done. Damn. 15,000 journey in jerseys. Wa. There was a sold out crowd of 40,000 at the ballpark. Uh, but it was packed and I was there an hour and 15 early and uh they were already done giving them away. Crazy. Did you take Cool Greg with you and say like soak it in. Soak it in. This is it. This is it. This is it for our A's. Then he looked at me. He goes, \"Can we rip off the chairs?\" I said, \"No, we can't rip the chairs off.\" He wanted one of those chairs. I wanted one of the chairs, too, really badly. All right. From Oakland A's. Mike, I'm going to go to the restroom real quick and we're going to go find ourselves a Lugia. This is a massive. Let's Let's run an ad. Let's celebrate and we'll see you all back here in a moment. Hold on one second before I run the ad cuz it's going to go to the wrong thing. I'm I haven't laughed this long in a minute. You know what I mean? Like got me dying over here",
            "start": 4200.96
        },
        {
            "text": "back here in a moment. Hold on one second before I run the ad cuz it's going to go to the wrong thing. I'm I haven't laughed this long in a minute. You know what I mean? Like got me dying over here laughing. This episode is brought to you by Imperial. We've told you all how important it is to developers to wishlist games that you're interested in. So, if this sounds cool to you, make sure you wishlist it. Imperial is a complex, featurerich action RPG where you'll be sent to a planet in a far-off corner of the galaxy to explore an imposing monolith. As an elite mercenary, you'll join the expedition tasked with unearthing the secrets of the monolith and face off against the deadly automatons within. In Imperial, you'll explore four vastly different quadrants of the monolith. Accessible only by using mysterious artifacts known as cardoggrams. Each cardoggram affects which enemies. Boss fights and loot will appear when you enter the monolith, so no two excursions will be the same. Find",
            "start": 4247.52
        },
        {
            "text": "by using mysterious artifacts known as cardoggrams. Each cardoggram affects which enemies. Boss fights and loot will appear when you enter the monolith, so no two excursions will be the same. Find even more cardoggrams to explore by looting defeated enemies, or buy them from other players online at the trading post. Imperial features three weapon archetypes: the fast-paced acrobatic glaive, the defense focused mason shield, or the devastating cannon with a range of customizable skills and abilities that can make short work of the awaiting automatons. Your weapons and abilities can be changed before any excursion into a cardoggram. So, if a loadout isn't working for you, you can mix things up to create the perfect play style. Help the members of the expedition in deep branching quests and aid other players in asynchronous multiplayer. Get ready, mercenaries, the monolith awaits. Imperial is available May 8th on PC, Xbox Series X and PS5. Wishlist now. It helps so much. Wishlist",
            "start": 4288.08
        },
        {
            "text": "and aid other players in asynchronous multiplayer. Get ready, mercenaries, the monolith awaits. Imperial is available May 8th on PC, Xbox Series X and PS5. Wishlist now. It helps so much. Wishlist Imperial. This episode is brought to you by Auraframes. If you haven't called your mom in a while, here is your reminder to do it. But then you want to go above and beyond. Mother's Day is coming up and I have the perfect gift idea. Aura Frames are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preload it with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special they'll use it every day. Greg, Kevin, and a ton of people here at Kind of Funny are obsessed with their Aura frames. It takes about 2 minutes to set up a frame using the Aura app. So, the next time you need to call your mom, you can also send her a new pick of you",
            "start": 4329.84
        },
        {
            "text": "Kind of Funny are obsessed with their Aura frames. It takes about 2 minutes to set up a frame using the Aura app. So, the next time you need to call your mom, you can also send her a new pick of you from that trip you're telling her all about. Aura has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting aura.com to get $35 off plus free shipping on their bestselling Carver matte frame. That's a rafra.com. on promo code kind of funny. Support the show by mentioning us at checkout. Terms and conditions apply. The show is sponsored by BetterHelp. It's super great that mental health awareness is growing, but there's still progress to be made. 26% of Americans who participated in a recent survey say they've avoided seeking mental health support due to fear of judgment. We can do better. No reason for fear. BetterHelp has over 10 years of experience matching people with the right therapist from the diverse network of more than 30,000",
            "start": 4377.68
        },
        {
            "text": "support due to fear of judgment. We can do better. No reason for fear. BetterHelp has over 10 years of experience matching people with the right therapist from the diverse network of more than 30,000 licensed therapists with a wide range of specialties. Some of my best friends use BetterHelp and love how helpful it can be for learning positive coping skills and how to set boundaries. It empowers you to be the best version of yourself. It isn't just for those who've experienced major trauma. If you're thinking of starting therapy, give BetterHelp a try. It's entirely online, designed to be convenient, flexible, and suited to your schedule. We're all better with help. Visit betterhelp.com/kindfunn to get 10% off your first month. That's betterhelp hp.com/kindfunn. better betterhelp.com/kindfunn. Axel just said the same thing. Yeah, Axel Axel wants us to know that we have to go to a theater. So, fly us through that theater and it Okay. How do you say the name of that city? How do you say",
            "start": 4422.24
        },
        {
            "text": "Axel just said the same thing. Yeah, Axel Axel wants us to know that we have to go to a theater. So, fly us through that theater and it Okay. How do you say the name of that city? How do you say the name of that city? Andy, I guess you've played You've been on this more than me. I don't know what the [ __ ] this city. You think Nick has read out one city name since we started this video game? He's burned through dialogue so fast I can't even read out the words on there. I'm going to look I'm going to look up a map. I'm trying to find a map on my big thing. I mean, why don't you just grab the L and You got it. That's the only one. Grab just grabbed the Lugia. Uh that's all the way at the tippy top. It is uh top left between 38 and 42 uh next to Lake [Music] Rage. It's got the bell tower and the Burned Tower. Oh, I remember. And the dance theater. Okay, we already went to the burn tower, right? [Music] What's going on at the mall? That's a great question. We haven't checked it in at the",
            "start": 4473.92
        },
        {
            "text": "the Burned Tower. Oh, I remember. And the dance theater. Okay, we already went to the burn tower, right? [Music] What's going on at the mall? That's a great question. We haven't checked it in at the mall in episode. We don't have to go to the mall. And we need to check on the mall. They they recently opened a new lids. I mean, like we should go to the mall and check on it because like Andy gave us a a boost. We could sell some of that stuff. Get more Pokeballs. Oh Jesus. Help him out with the ball cuz he is low on balls. He is low on ball. And like what would this play through be without a visit to the mall? Yeah. Okay. They got there's a new champ sports Cheeto dust on my knuckles. Are you eating Cheetos out there? I thought you just went to the restroom. What happened? I got him two bags of Cheetos. Oh, nice. Get into it. You know what he does? He brings like five B. He goes, \"Here, this is for you.\" And he gives you a monster bag of Cheetos and then I have to eat the whole [ __ ]",
            "start": 4528.04
        },
        {
            "text": "of Cheetos. Oh, nice. Get into it. You know what he does? He brings like five B. He goes, \"Here, this is for you.\" And he gives you a monster bag of Cheetos and then I have to eat the whole [ __ ] thing. Oh, I was wondering why you bought those. We were escaping from Tarov and we they had snacks in it that were crunchy and Mike wanted a crunchy snack. Gotcha. [ __ ] Tarov, bro. So much. Andy, boot up Tarov tonight with us. Give it a try, bro. Give it a try. 9:00. It was fun, dude. It was fun. You have to download it from a a Russian site, though. So, just be with me. Yeah. Only only give them 50. Don't give them the 70 like I did. Okay. Liz is calling me. They still owe me 20. They owe me 20. And you're not getting any of that back. I'm not going to message him either, so I don't care. Oh, Liz wants to battle again. Oh, that's cool. They're actually wants to runs finally matter. So, Nick, we have to fly to a different city now. We're not going to go to the World Islands yet. Why not?",
            "start": 4584.16
        },
        {
            "text": "Liz wants to battle again. Oh, that's cool. They're actually wants to runs finally matter. So, Nick, we have to fly to a different city now. We're not going to go to the World Islands yet. Why not? The people have said we have to awaken Lugia. I'll tell you what, real good news for me on a personal front. Yeah. Um, I got my Oh my god. I got my new registration in. What the [ __ ] is that? Oh, look. It's You didn't have your car registration? No, I got stopped by a cop the other day. And what? You didn't have the right sticker on? No, he didn't have Yeah. Well, he didn't have his car smog, so he couldn't get a sticker. You didn't get smog? Didn't get a smoke. How many years has it been since you registered? It was uh 2024 because I like I It was one of those things where I'm like, \"Oh [ __ ] I have the wrong registration.\" Yeah, I'm going to I didn't realize this this whole time. I thought I paid for it. It never happened. Look at [ __ ] Roger. [ __ ] Roger. Remember when [ __ ] Roger",
            "start": 4626.56
        },
        {
            "text": "I have the wrong registration.\" Yeah, I'm going to I didn't realize this this whole time. I thought I paid for it. It never happened. Look at [ __ ] Roger. [ __ ] Roger. Remember when [ __ ] Roger was our guy at the beginning and then we just watched him die Roger. So you're telling me where am I flying? You're flying here or right? You said middle. Yeah. Dead ahead. Top middle. Right up right there. That one. Um. Did you get your brakes fixed? No. He said it was fine. And then I'm in the In-N-Out part. I mean, you get in that going, you know what I mean? It's your It's probably your ABS system. But like, let me tell you what, break just fine. Okay. I mean, as long as you don't die. Breaks be fine. It's always fun to have a little Yeah. moment. Mike dies. No big deal. When I when I give this up and sell for this plot of land in Acret Tech City and then build myself a [ __ ] This is our home. Now, you got to drive with the risk, you know. So, now the chat's saying the chat's saying you",
            "start": 4670.48
        },
        {
            "text": "up and sell for this plot of land in Acret Tech City and then build myself a [ __ ] This is our home. Now, you got to drive with the risk, you know. So, now the chat's saying the chat's saying you got to go somewhere. I don't see this in my notes at all, so I can't help you on this one. I thought you were the navigator. I Well, it says says go to the tower, but that's for that's for heart gold. You can enter the bell tower and heart gold. It said you can use rainbow wing here to summon ho ho. But the other one you got hoo big building dance theater. The theater. Okay, I got the theater. We got it. No, I I mean, didn't didn't the lesson tell you to go do something? Oh, he just gave me a master. Yeah, he gave us a master ball, which we're going to use on Lugia. N challenge. Oh, Christ. I thought we were out of this Tim ship. Fine. This Pokemon level. I got to beat five Komodo girls. I don't think you should hit. You thought we were out of the Tim. We haven't beaten the game. What? He",
            "start": 4719.6
        },
        {
            "text": "thought we were out of this Tim ship. Fine. This Pokemon level. I got to beat five Komodo girls. I don't think you should hit. You thought we were out of the Tim. We haven't beaten the game. What? He kept saying we would beat the game. Andy, what do you think about this? Oh, damn. Just pushed me, dude. Too small. Just He's getting physical now. Replace the whole draw. Put it on top of these kimono, bro. Too small. Put it on top of the draw your drawing. Your beautiful drawing. Yeah. Hello, ladies. Yeah. Yeah. Oh, yeah. Oh, yeah. Welcome to Zuki. I mentioned previously in Violet City. In order to bring back Lugia, we need something with the right bond with Pokémon. We asked mystery egg to whoever showed true potential. The egg was eventually handed from Mr. Pokemon to Professor Ideo and to then to you. However, being pure alone with not sufficient to face the power of the Pokemon. I must test you. Are you ready? Yeah, you're this strategy. God, she was talking about our egg. Yeah.",
            "start": 4776.16
        },
        {
            "text": "to then to you. However, being pure alone with not sufficient to face the power of the Pokemon. I must test you. Are you ready? Yeah, you're this strategy. God, she was talking about our egg. Yeah. Yeah. Do I got to get the Togepi out? That would be pretty sick if we showed these ladies a level 55 [ __ ] Togepi. Oh [ __ ] I got to fight them. I don't like this. Who do they got? Mike, you failed me. Yeah, this is not in my book. You got an Umbria. Oh, what is this thing? This is not in the book. [ __ ] Oh my god. We were trying to get that for so long. Yeah, we were trying to get that and then we That one got lost to eradicate. That's Umbreon. Dark. That is the dark Eevee evolution. Yeah. All right. So, it's not I have nothing that can beat this. Uh, no. You got bite on uh D. Uh, right. I have bite on I have do I do have bite. Let's go ahead on tank. Dark. No, dark's half fighting. Fighting a bug. I got bug on. We got a bug move on this guy. Yeah, let's try that. Let's try single beam.",
            "start": 4821.12
        },
        {
            "text": "bite on I have do I do have bite. Let's go ahead on tank. Dark. No, dark's half fighting. Fighting a bug. I got bug on. We got a bug move on this guy. Yeah, let's try that. Let's try single beam. Nice. Do a lot. It's super effective. Cop is confused. I mean, it's also level 38, I think. No matter what you're going to do, hit it with a discharge. Remember when our Eevee died? Try to discharge it. Yeah, that really sucks. I don't know what discharge does. That's your strongest move, right? Oh, okay. But not as strong as the other one. Yeah. No, he's paralyzed. I think we Yeah, probably stick with the bug type move. You know what I mean? If it's weak to bug. I'm paralyzed also now. Okay. Okay. Well, it's not doing this. This guy's got a lot of health. This guy's got stamina. 152. He's got a lot of [ __ ] health. That paralyzed. Well, he got hit for the 30. All right. always be healing. Yeah, he's also paralyzed so he can't do [ __ ] Got to tap him. That's a good looking Pokemon right",
            "start": 4870.72
        },
        {
            "text": "a lot of [ __ ] health. That paralyzed. Well, he got hit for the 30. All right. always be healing. Yeah, he's also paralyzed so he can't do [ __ ] Got to tap him. That's a good looking Pokemon right there. Yeah. What happened to Ari Eevee? How did that Eevee die? Don't worry about it, Mike. Oh, was that the one I missed? That you guys don't worry about it. That's when I was in Japan. Every week we do her hair. Yeah, we treated her right. We loved her, dude. We were getting pictures done with her. Remember, Chris, I tell you, you got to learn friendship. You got to teach, you got to give these Pokemon friendship meters. Yeah, we never did that. We never did. You got to look up these ladies who I'm putting out here. These ladies are not in the book. It just somehow appeared. They are not in the book. I think Andy hacked us into the game. I got all these. I don't know where the [ __ ] these ladies came from. They are not in this book. Why the [ __ ] am I fighting five of these ladies?",
            "start": 4918.48
        },
        {
            "text": "in the book. I think Andy hacked us into the game. I got all these. I don't know where the [ __ ] these ladies came from. They are not in this book. Why the [ __ ] am I fighting five of these ladies? Espeon. Jesus Christ. Another dart. Yeah. No, that is a psychic. Psychic. Psychic. Okay, look at this. I get it. Like ESP. Oh, bug. Okay. Well, I just I'm just going to keep doing this. Yeah, Bug's doing two damage to it. Two twice the damage. What was the girl at the end of Mean Girls? She's like, I have ESP. Although Gyarados has the dark has bite. Gyarados. Yeah, but I guess they're probably the same, right? Uh well, no. No, cuz Dark Oh, Darkos times two. Yeah, dark would work in this case, but I mean what's the worst case scenario? The cops just tasted the [ __ ] heart right now. Okay, swap there. Oh, there massive damage. You're fine. You're fine. I'm going to heal real quick. I'm going to get heal off. [Music] Every once in a while, Mike just got a brilliant idea. What? Go to the",
            "start": 4976.48
        },
        {
            "text": "swap there. Oh, there massive damage. You're fine. You're fine. I'm going to heal real quick. I'm going to get heal off. [Music] Every once in a while, Mike just got a brilliant idea. What? Go to the store and sell a bunch of your stuff. Well, the chat came up with that. That was all the chat. Yeah. Yeah, the chat did that. But we'll be returning. [ __ ] Okay, I have to put another Pokemon in. What do you mean? I have to go. I have four more battles. And they're locking me in. I can't leave. Oh, you can't? No, I can't leave. Oh, massive [ __ ] XP. A lot of XP. Yeah, 1500 XP. That's most XP we've seen in about 13 hours of gameplay. I'm going to have to swap out Pokemon on this. Do you think it's going to be all the Eevees? That would be sick. Oh, I hope so. Five evolutions. Yeah, that'd be cool. Evolution. I know you're training. Just get it over with. What do you got for me? Got to swap this out with someone. Who you got? You probably just heal. I guess I can't, but they're they're",
            "start": 5024.92
        },
        {
            "text": "be cool. Evolution. I know you're training. Just get it over with. What do you got for me? Got to swap this out with someone. Who you got? You probably just heal. I guess I can't, but they're they're hitting a lot. Sick. This is cool. Baron's a good looking Pokemon. I'm assuming that's fire, right? Yeah. [Music] What gave it away? The everything themed fire element. Yes. This isn't in the book. I feel like this should be in the book. Not in the book, surprisingly. Not anywhere in this book. [Music] I really hope Chris Anka texts me soon. I was like, \"It's in the [Music] book.\" I hate to see it. See, now they're in the book. Okay, let me let me let me circle back. Okay. Are they in the book, B? knew it. They're in the book. They're in the book, but they're on top of the tower. Isn't Muilk doesn't do all statuses, too? Does it? [Music] No. No. Sorry. God, I knew it. One that does both, though. Uh, full [Music] restore right there. [Music] Now, does this Is Kito going to stay in the",
            "start": 5086.96
        },
        {
            "text": "doesn't do all statuses, too? Does it? [Music] No. No. Sorry. God, I knew it. One that does both, though. Uh, full [Music] restore right there. [Music] Now, does this Is Kito going to stay in the first spot now? I don't know. I don't know. The question [Music] is probably going to see Jolon. You'll probably get Vaporeon and Jolon to finish this out, right? Cuz those would be the big three here. Well, I mean, now Chad, don't don't get on me here, okay? Don't get on me here. How did you not see it? I'm just saying they're on the rooftop. I'm gonna have Andy officially weigh in on this. Andy, please look at this page and look at the next page. Tell me if you see this fight on the stage. Don't you [ __ ] with me now, now? They're in the book. Yeah. Okay. Maybe they're in the book. Maybe they're in the book. Maybe they're in the book. You're ridiculous. And you know, the next statement is going to be like, \"But here's my excuse for.\" Okay, Joel. All right. Do I This is a question for you.",
            "start": 5158.08
        },
        {
            "text": "in the book. Maybe they're in the book. You're ridiculous. And you know, the next statement is going to be like, \"But here's my excuse for.\" Okay, Joel. All right. Do I This is a question for you. You heal, right? Well, I don't need Jolon. I should put Gyarados back up against Jolon, but she gets a free hit if I do that. Now, I'm still not to not to, you know, derail us. Still confused on water and lightning. You know what I mean? Shall we chug right? Lightning hurts water. Lightning is hurts water. Okay. So, we want to go. Lightning is only ground, but we got rid of uh Right. Right. Right. No kito. No kito. So, the water get hurt. Yeah. So, it turns out I saved us. You really did, Mike. That was really smart. Thank you. Be lightning, right? I could. Yeah, I could just heal Dunikov and the lightning be lightning. Or flying would work. Yeah, cuz flying is No, no, no. Flying. What are you guys saying? [ __ ] flying. Remember Alexander Graanbell's kite got the lighting. Milk mommy. Yeah.",
            "start": 5228.08
        },
        {
            "text": "lightning be lightning. Or flying would work. Yeah, cuz flying is No, no, no. Flying. What are you guys saying? [ __ ] flying. Remember Alexander Graanbell's kite got the lighting. Milk mommy. Yeah. Oh, Dudikov as well. If you heal. Yeah, I might just do Dudikov and heal. that we I think Judikov is a one-on-one pretty solid choice if you full heal right now. What's milk mommy? Milk mommy does milk mommy has a ground. Uh milk mommy's weird normal. I bet you milk mommy's a normal type Pokemon but can learn a bunch. Definitely [Music] normal. All right, let's see what he does. Oh, he uses double team evasion rose. That was a big mistake. That was a big mistake. [Music] Damn. He's just literally I can't hit him. Yeah, that's all right. [ __ ] him. He can dance all he wants. I mean, I think I'm paralyzed. What the [ __ ] is happening right now? It just absorbed it. It's It can't get hit by electricity. It's got one of them. Can he hit me? Yeah. Oh, yeah. Cuz like that's one of the like",
            "start": 5276.24
        },
        {
            "text": "I'm paralyzed. What the [ __ ] is happening right now? It just absorbed it. It's It can't get hit by electricity. It's got one of them. Can he hit me? Yeah. Oh, yeah. Cuz like that's one of the like special abilities, right, that Pokemon randomly get that this Pokemon all of a sudden can't be hit by electricity moves. Really? Is it? Maybe. Ultron's ability means it can't be hit by electricity. There you go. That's what Rusty Pon says. Well, you got hit by signal beast. Well, you got [ __ ] hit by a bug type move. Thank god I got that. I I mean I I feel like switching them out makes the most sense though. Uh, it could, but he's just going to keep paralyzing my other guys. I'm also Well, he's not doing any damage to me right now. He does interval. Okay, we got me. Love it. Yeah. Why am I getting [ __ ] paralyzed? [Music] Okay. You never like a You never like the words last resort. You know what I mean? That's one of those you take a deep breath on. He can use last resort twice. Isn't",
            "start": 5342.88
        },
        {
            "text": "getting [ __ ] paralyzed? [Music] Okay. You never like a You never like the words last resort. You know what I mean? That's one of those you take a deep breath on. He can use last resort twice. Isn't that fun? Yeah. It's not his last resort then, is it? Cut my life into pieces. This is my last resort. [Music] He's good. Unicop's getting [ __ ] up. No, he's No, he's fine. He's a big boy. Shots. This [ __ ] naked sheep is a monster. thing is nasty. Someone was just freaking me off, dude. I'm going to try to hit it. Wait, its head looks weird, right? Dudacov. No, Jolon. Oh, I think I think Jolan looks great. He's one of my favorite Pokemon, so I love Yeah, me too. Just don't like how the sprite looks. There he is. Water. So, now we're going to go water. So, now we're going to go He's going to be water is my guess. I mean it's got to be matter. I got to keep my I got to keep him in anyway. Is there Leaf one? Leafeon or is that later? I don't know. Yeah, I don't know. I don't know where we",
            "start": 5392.56
        },
        {
            "text": "be water is my guess. I mean it's got to be matter. I got to keep my I got to keep him in anyway. Is there Leaf one? Leafeon or is that later? I don't know. Yeah, I don't know. I don't know where we are in this. Leafeon's in this. Maybe add on a number. What's crazy to me is Mike was like, \"You got four more streams left. We got so much more game.\" It didn't know about this massive. I'm just telling you it's not in this. You already found it. It's not in the book though. It's not in the book. It's It's in in the appendages. And Chris ain't good for It's probably somewhere deep in the book. You know what I mean? Just got here who died. Come on. Don't Don't put that out there. Oh yeah. Don't put that out there. All right. You're really funny, but we're You think you're funny? Okay. It's water. Thank god the punch. I'm going to discharge it. Oh, damn. This This book's got every single Pokemon in the game. That's kind of lit. You just have to learn how to read it. Scari Scari. You have to",
            "start": 5469.04
        },
        {
            "text": "Thank god the punch. I'm going to discharge it. Oh, damn. This This book's got every single Pokemon in the game. That's kind of lit. You just have to learn how to read it. Scari Scari. You have to learn how to read. Scari, you're such a [ __ ] weirdo. That was Scarminy. Scarmon. Scar. Scari. Anthony Scarmoni. [Music] Car. Okay, I really [ __ ] have to go. Andy, you're having so much fun. We're about to go get Lugia so much fun. We're going to get Lugia. Oh [ __ ] something's happening. This little girl right up big sisters. Lugia is here. Lugia has returned, baby. He's back, baby. Goodbye, gamers. [Music] Bye. already stay. [Music] That looks really He did that so fast. What's that? The thing he made, that looks really good. Yeah. Oh, yeah. All right, Mike. That was huge. That was it. That was it. Like, it was Did they say some [ __ ] like we're going to call Lugia now? Well, Lugia, they said there's a the little girl ran up and said there's a massive shadow in the world pool islands.",
            "start": 5513.08
        },
        {
            "text": "was it. Like, it was Did they say some [ __ ] like we're going to call Lugia now? Well, Lugia, they said there's a the little girl ran up and said there's a massive shadow in the world pool islands. Okay, so now we go to the whirlpool islands here. Lugia is ready. Damn, that would have been bad if we had gone. Let's get out to the islands. Found him. It would have just wasted hours and hours till Mike put his reading glasses on. Don't It's not in the book. It weren't in Okay, maybe maybe there. Let me see that page in the book you were looking at. You Yes, you can clear my name. Look at this page. Tell me that fight is in the book there. because that fight you just participated in was not in that book. And look at the second page, [Music] too. Now, I only figured that out because I looked at the tower and somehow these ladies are up on top of the tower. Oh, yeah. But that's for the other game. That's the other game. You're right, Mike. They're not in the book. They're not in the book.",
            "start": 5606.32
        },
        {
            "text": "at the tower and somehow these ladies are up on top of the tower. Oh, yeah. But that's for the other game. That's the other game. You're right, Mike. They're not in the book. They're not in the book. Well, we they're not in the book. We We pivoted and we had a good time. But they're in the book. But they're not in the book. All [Music] right, we're going to go find Lugia. We're finding Lugia. I think this could Are we in for an hour? We going to tear this up? I mean, how long does Lugia take to hit? Got a master ball. Don't I just throw the master ball at it and take That's all you got to do. I mean, that's that's what I'm seeing here. Or do I have to wear his ass down? If I waste his master ball at him, I'll kill him. I don't think you have to. I don't think you have to. I think you just throw the master ball at him. That's it, right? [Music] Oh, check this out. No Lugia, no problem. Don't panic if you accidentally knock Lugia out instead of catching it post Hall of Fame. You can",
            "start": 5648.32
        },
        {
            "text": "throw the master ball at him. That's it, right? [Music] Oh, check this out. No Lugia, no problem. Don't panic if you accidentally knock Lugia out instead of catching it post Hall of Fame. You can return to the World Islands and take on another one to catch him. So yeah, if we kill this guy, don't worry about it. You know what I mean? No big deal. I think that's like very far away. Oh yeah, but it doesn't matter. You know what I mean? Lugia is not part of the six. Do we need Lugia? Oh, Lugia is definitely going to be part of the six. Lugia would be a big move if it's psychic flying type. Yeah, we're getting rid of would be definitely a big upgrade for us so we are going for the top left one which if you just came in from away just run away discharge his ass. But you're going to run out of discharges. You got some ether on you. How many how many? Yeah, I got to fight. Now remember Dunov I think is the Lugia fighter, right? Yeah. Is that Bad or good? Well, like maybe just be mindful of",
            "start": 5685.76
        },
        {
            "text": "discharges. You got some ether on you. How many how many? Yeah, I got to fight. Now remember Dunov I think is the Lugia fighter, right? Yeah. Is that Bad or good? Well, like maybe just be mindful of his PPS. But I got a ton of ether. Oh, okay then. Yeah, [ __ ] it. Do you have a ton of ether? Let's just double check that. Pretty sure. Let's see. Let's You know, it's just one of these things that we check and then we know for sure. We don't have to be pretty 900 ether. Excellent. 900 elixir. 900 max. You know, we have a revival herb that I don't even know what it does. I just like to keep it. We're lucky we didn't even go to the mall. Y'all lucked out. We were supposed to go to the mall. We were going to sell all those revival herbs. We're going to sell all those. We're going to make so much money off the right way. Yeah, I think to the right now. And then Oh, what is that then? That's a guy. That's a person. Yeah, someone's swimming. I saw the back of his head. I thought it was a",
            "start": 5740.4
        },
        {
            "text": "much money off the right way. Yeah, I think to the right now. And then Oh, what is that then? That's a guy. That's a person. Yeah, someone's swimming. I saw the back of his head. I thought it was a [ __ ] Vaporeon sitting in there swimming. Yeah, I believe it's the top right one, which the whirlpool is right past that girl swimming. [Music] Easy. God damn it. Easy. You can sell the revives and buy repels. I could do that. [Music] Oh yeah, the dogs. Yeah, I don't know where the dogs are in the map. The dog. Well, the bongs the dogs are just in areas. You have to open up the map and it'll show you kind of and then go [ __ ] around in that area. Yeah, but it's odd that like the book hasn't said like now it's time to catch the dogs. You know what I mean? That's a you believe in thing. What's the Psyduck? Psyduck. Psychic. You want me to look it up? Yeah, look it up. Might be psychic water. Probably with psychic though. I think it's just water, right? And then gold dug itself. Oh, you're",
            "start": 5780.24
        },
        {
            "text": "the Psyduck? Psyduck. Psychic. You want me to look it up? Yeah, look it up. Might be psychic water. Probably with psychic though. I think it's just water, right? And then gold dug itself. Oh, you're right, Kevin. Yeah. Yeah. Look at that cute sprite, though. Now, beautiful Pokemon. Is it like Oh, I level 20. I guess that's a good question. Are the dogs better than the cats? Are they cats or dogs? Nobody knows. I thought they were the three famous dogs. Yeah, they're the dogs. They're dogs. So, would it be better to have one of them than wasting it on? No. You tell me we only get one Master Ball a game. Yeah. I don't know. I never seen one. You can't buy one. Okay. I thought we were buying one. Three famous dogs. Yeah. But we can catch the three famous dogs with other techniques. Yeah. Quick balls. We can fight them. Wear them down. Yeah. Yeah. What do you think? No. Catch the Lugia. Yeah. But do I have to catch it with the master ball? Yes. Right. Maxwell Luga D Cooper says, \"All",
            "start": 5829.84
        },
        {
            "text": "Quick balls. We can fight them. Wear them down. Yeah. Yeah. What do you think? No. Catch the Lugia. Yeah. But do I have to catch it with the master ball? Yes. Right. Maxwell Luga D Cooper says, \"All right, [ __ ] it.\" One person in chat says, \"And you're like, \"Yep, I'm in.\" Oh my god, this guy's got five. Oh, it's too many. He's a trainer. What do you want me to do? I can't run. I don't want you think I'm a [ __ ] Great. Yeah, he's going to he's going to be like, \"Tell everyone he's a [ __ ] [Music] You excited about naming this? What the hell is a remorade? Uh, look. Keep battling. Uh, it's like a dumb fish. It's a I was going to say it's got to be. Oh, that's ugly. Oh, look at that little fish game. That's hideous. That is not right. That's an abomination. Yeah, it's dead now, though. We have to kill that thing. Yep. You did it. I'm I'm assuming all of these are [Music] water. [ __ ] evolves into an octopus. That's stupid. [Music] Oh, that's a cute looking octopus. DC hard rocker",
            "start": 5880.24
        },
        {
            "text": "We have to kill that thing. Yep. You did it. I'm I'm assuming all of these are [Music] water. [ __ ] evolves into an octopus. That's stupid. [Music] Oh, that's a cute looking octopus. DC hard rocker brings a great question. Maybe use a basketball and a don sparse. Now, that'd be a fun clip. That would be a fantastic clip. hit the basketball and use it at level five. That would transfer our Nick Nuzlocke that we've done so far. Just trying our [Music] best. Is uh the Lugia worth putting on our team though? Uh yeah, I think so. I think it can I think it can uh fill in a number of gaps. It could also replace just Kev Ke wet. Yeah. Uh probably to be honest with you the probably the best call is just to replace pseudo wood. I'm just having Yeah. To say see a wood man. Yeah. What what's the point of keeping wet cap which is better than kev cap or the wood man? No cuz here's the thing. Uh pseudo wood uh has a ground is a ground type. That's true. You know what I mean? Why have two flying",
            "start": 5947.76
        },
        {
            "text": "point of keeping wet cap which is better than kev cap or the wood man? No cuz here's the thing. Uh pseudo wood uh has a ground is a ground type. That's true. You know what I mean? Why have two flying when we can have one flying/ psychic? Yeah. Pretty much Lugia is the best Pokemon in the game and everybody else below him is not good. So, we can replace any of them. Yeah. Yeah. We had a lot of Pokemon that are shitty. Yeah. He's just in our way. Yeah. Murder. I wish you could have your Pokemon hit him once, too. Just like grab my attention. [Music] It's psychic flying. You can learn water moves. Damn. It's like the mill tank of Pokemon. [ __ ] mill tank, dude. And then Yeah, you take that whirlpool right there. Okay, I'm going to refill my PP real quick. You should Where did you [ __ ] find that guy? He was hanging out right there. Okay. [Music] You going to refill all the moves? No, I'm just going to double check. I did the right one. Getting them up. Yep. Discharge the only move you",
            "start": 6012.08
        },
        {
            "text": "that guy? He was hanging out right there. Okay. [Music] You going to refill all the moves? No, I'm just going to double check. I did the right one. Getting them up. Yep. Discharge the only move you move. Used. I want to call people out. Yeah. But like I did notice someone here just a moment ago, grabbed their belongings, walk out the door, and didn't say goodbye to us. Okay. And like I'm staring right at him all day at the desk. Roger. Yeah. Yeah, he's a big piece of [ __ ] Didn't want to come say goodbye to us. On pizza day Tuesday of all days. He made me buy him pizza. I didn't want to. I didn't want to buy pizza. He made you he worked you to buy that pizza came in. There was a lot of discussion of like they were excited. They're like, \"We're getting pizza today cuz it's just Nick.\" Yeah. And he walked away. Didn't even didn't even say goodbye. Didn't say thanks for pizza. Thanks for thanks for treating the team to pizza today. Nick made a fantastic pizza on the ground for no",
            "start": 6070.28
        },
        {
            "text": "Yeah. And he walked away. Didn't even didn't even say goodbye. Didn't say thanks for pizza. Thanks for thanks for treating the team to pizza today. Nick made a fantastic pizza on the ground for no reason. He was like, \"I disrespect those two.\" He said to me, \"I disrespect you.\" After having a great podcast with you, too. Don't miss out on the newest kind of funny podcast. Nick sits down with Roger and Bless and asks the question that you need to know. This is a kind of funny civil war cover. Has Greg gone too far? Gone too far? What side will you be? What side are you picking? Cuz there's only two sides or three if me and Kevin go our own way. I'm assuming I got to go into here. Go into that cave. Nick, if you if you want, you can start the prank wars and we'll get them good. I mean, it'll backfire on me so bad somehow. Oh [ __ ] Why is we need a flash for this? I don't have any flash. Don't worry about it. It's fine. Just guide me through my All right, go straight down. No, not the",
            "start": 6128.16
        },
        {
            "text": "backfire on me so bad somehow. Oh [ __ ] Why is we need a flash for this? I don't have any flash. Don't worry about it. It's fine. Just guide me through my All right, go straight down. No, not the stairs. Not the stairs. No. Yeah, the stair. No, no, not the stairs. Not the stairs. Not the stairs. Jesus. It's a whole nightmare map. Don't worry. Just go down the stairs. Should go down the stairs. I hate this. I'm going to use a repel. We don't have flash. I don't I don't think I have flash. Whatever Pokemon had it, I think we killed a long time ago in the galaxy far far away. Yeah. Which side are you going to be on? Are you going to be on Captain Tim Rogers side or Greg Stark in the in the kind of funny Civil War? Um I think that uh Tim was Cap and Greg was the other one. That's what I said. I You just said that. Captain Tim Rogers or Greg Stark. That's so funny cuz I just ignored everything you said. Sorry. I only have one Max Chapel. I'm going to use it. Just trash it. You don't need",
            "start": 6171.68
        },
        {
            "text": "I You just said that. Captain Tim Rogers or Greg Stark. That's so funny cuz I just ignored everything you said. Sorry. I only have one Max Chapel. I'm going to use it. Just trash it. You don't need Well, I'm just going to go buy more after this. I have 900 of everything. Okay, Mike. Down the stairs. Yes. Okay. So, here's what I want you to do. Go back to that ladder that we started at. Okay. Stop. To the left. Go to the left now. Down. Directly down. Okay. That's where I want it. Let's stick down there. Just keep going down. Keep going down. Mhm. All the way down. And then you'll take a small right. Yep. Here. Then down. There's going to be stairs there. Then we're going to take a a right. There's a Pokeball to our left, but I don't think we need it. We have everything. So, let's go there. Take a take a right. Stairs up above us. Up. Okay. To the right. Down. To the left. Hold on a second. Ladder. Welcome to the entrance of the waterfall basin. Oh, wow. Look at all the Pokéballs. Max",
            "start": 6224.08
        },
        {
            "text": "Take a take a right. Stairs up above us. Up. Okay. To the right. Down. To the left. Hold on a second. Ladder. Welcome to the entrance of the waterfall basin. Oh, wow. Look at all the Pokéballs. Max elixir. Oh, they're getting you ready. I'm ready. But they don't even know we got the master. You should be able to go up. You will see a ladder in front of you. We're not going to take that ladder. He just went down that ladder. No, no, there's Oh, what's up with that rock? Yeah, headbutt those rocks or break those rocks. You got rock smash. I don't have headbutt anymore. Oh, yeah, I do. No, cuz it would pop up and be like, you need to smash these rocks. How do I get around these things? Are you sure you brought me to the right spot? Um. Oh, I can hop down. Maybe. Let me work. Let me work. Let me see. I got to go. So, there's an L ladder. I got to go up L. I found L. Okay. So, go back. Yeah. Go back into the cave. I'm in the cave. Back to I. We need to rewalk the same path you just went.",
            "start": 6265.36
        },
        {
            "text": "me see. I got to go. So, there's an L ladder. I got to go up L. I found L. Okay. So, go back. Yeah. Go back into the cave. I'm in the cave. Back to I. We need to rewalk the same path you just went. So, rewalk. Go back up the ladder. Now to the right. Up. And then to the left, down the stairs. To the left. Okay. Down the stairs. Okay. Now you go up the stairs. Up above you. Yep. Straight forward. Little to the left. And then straight forward again. Little to the left. Now we're going to take a right at the ladder. Down the stairs. Take a right high. Up. Right. Yeah. Up and then right. And then down. We're going to go down. Down. You're going up. We're going to take a right at the end of that. Go straight away. Pause. Hold on. Okay. Good. I need I need a track. Oh, look at this thing. I already have one. You have it. You have it. Hate it. Ugly. Just run away at this point. Well, Mike Mike needs a beat anyway. Yeah, I need to look anyway, so it's good for me. Look forward. He's wasted",
            "start": 6311.44
        },
        {
            "text": "have one. You have it. You have it. Hate it. Ugly. Just run away at this point. Well, Mike Mike needs a beat anyway. Yeah, I need to look anyway, so it's good for me. Look forward. He's wasted bandwidth. Well, what are the odds we're going to remember where we were as soon as we get out of this battle? I know where to. Yeah, I know where to go to the right a little bit. There's a stone right here now. Yeah, I know where you're at. So, keep going. Keep going. There's a stair to my left. Yeah, the stair doesn't take us anywhere. H K to L. So, yeah, we're going to go up those stairs right behind you. If this works out for us the right way. They have like the weird little mini walls that you hop over, but you can't tell which ones are which on a 2D plane here, you know. If I just have another repel somewhere. You don't Oh, well, maybe not a max repel. super repel. I'll just use that real quick. I have another repel. So, I'm going up up those stairs. Up the stairs to the left. Up at the",
            "start": 6368.96
        },
        {
            "text": "repel somewhere. You don't Oh, well, maybe not a max repel. super repel. I'll just use that real quick. I have another repel. So, I'm going up up those stairs. Up the stairs to the left. Up at the end of the walkway. Yep. Keep going up and then take a right when you're at the next spot. Keep going. There will be a staircase to your right underneath you. Yep. Go down. Now, hold. Right. Yeah. Down that staircase. Yeah, you're right. There it is. Okay. Now, to the right. We want to try to hop over these little guard. Boom. Perfect. Boom. All right. Keep going straight. Go up the ladder as H. How close am I to the thing? Uh, you still got a while. Okay. Okay. Now we're at H. And it gets you to K. So, if you go back to the right, well, on this walkway. Okay. If you go up to the wall right there, we need to get up there. So, we're going to go down the stairs. Okay. We're going to take a left. Hop over that wall. No. Okay. Go back up the stairs. Hop off. Maybe I need to go to J. I need to",
            "start": 6419.04
        },
        {
            "text": "we need to get up there. So, we're going to go down the stairs. Okay. We're going to take a left. Hop over that wall. No. Okay. Go back up the stairs. Hop off. Maybe I need to go to J. I need to get to J now. J. So, yeah, that the stairc the ladder we want is this. What's the name of this map or what's called World Islands and you can probably type in Lugia Cave, I bet. It doesn't have an official cave name. Royal Island map. Soul Silver. Okay, let's work in reverse. Literally, we want to go to L, but we need the K to L. And I don't know where K is. I don't see a K. I mean, we're looking at different maps now, Mike. Yeah, of course I know. Where? Where? Yeah, I I can't even How is K? How do I get the K? So, we need to go through J. J is an entrance way. Jay is a cave entrance. Where's Where's Jay? Hey, the cave entrance. Let's see. Where's that hole come [Music] from? I don't have a J on any of these maps. That would be the entrance. Did we go into the right? You see what I'm talking",
            "start": 6478.32
        },
        {
            "text": "Jay? Hey, the cave entrance. Let's see. Where's that hole come [Music] from? I don't have a J on any of these maps. That would be the entrance. Did we go into the right? You see what I'm talking about? So, we go through here, you and I, we went down here. So, our end all be all goal is that L since you don't have rock breaker here, right? So, we want to be on that L. I'm reading L over here. But the only way to get to L is from this K going down, right? And so to get to K, you have to go up the H here. So here's where we just were. And you couldn't get past that, right? I can't get off that. So I need to get over to J here. But I'm not seeing a J. So find me a J entrance. Well, there's another I need to go to J. Yeah. So I got to go through K. No. No. So you go J, jump over that. Walk this way to K. Which will take us where we need to be. So there should be a J somewhere else that I'm not seeing. There's only one J on here. Yeah. Weird, right? So, why can't you jump over this? Or why",
            "start": 6539.12
        },
        {
            "text": "way to K. Which will take us where we need to be. So there should be a J somewhere else that I'm not seeing. There's only one J on here. Yeah. Weird, right? So, why can't you jump over this? Or why can't you jump over that? Weird, right? I don't think I can jump down. Yeah, you can't jump over that. You can't jump down. Let me try jumping down H one more time and see. Maybe go back to H. So, I got to go down and jump over. Maybe I Maybe this is a little burn. And then Yeah, you should see. Yeah, it's the wrong way. So, yeah, we want to go from J, but I don't see J on this. Yeah, cuz I definitely and I'm on other pages. I don't see a I don't see a J. So, right now you're on. What's down? I haven't gone down yet. What's down from here? So, here's the issue is if you go down from here, you're going to go over here, then you go over there, and you've been I took you to I already, so I is out. If you go down here, you have C. C takes you to C, A, and B. None of those have what we want. But",
            "start": 6585.6
        },
        {
            "text": "going to go over here, then you go over there, and you've been I took you to I already, so I is out. If you go down here, you have C. C takes you to C, A, and B. None of those have what we want. But how do I get to Lugia? Wait, wait. We're We're So going up right now will take you to C, right? Well, yours might be different than ours. Yeah. So that but that's where we're at right now. Yes. We're on your C. That's his H. Okay. Okay. So C is H, but we need to get to J. But there's only one J. We've already been to I. Let me see where C takes you. Is it island C? J is another island. Jay is that island out there. You see this? You're right. Boom. Okay. So Jay is all the way out there. But the question is, is that where Lugia is? Cuz that's where I'm aiming for Lugia. I would zoom out, right? So like we have to get to this L. So yeah, J is another island all the way over here. So you're here. You need to get to this island J. Walk in. Hope that we can cut across right here to K. Okay.",
            "start": 6636.16
        },
        {
            "text": "So like we have to get to this L. So yeah, J is another island all the way over here. So you're here. You need to get to this island J. Walk in. Hope that we can cut across right here to K. Okay. Take us. Wait. Hope. I don't like that part. We just cracked the code up. So you need Now you're at H, Nick. So we're going to go down and then to the left. I [ __ ] up. I use an escape rope. Oh [ __ ] No, that's fine. That's That's perfect. All right. So now you got to get over to J. Here's what we're going to do first. Tell me. I hate to tell you this, Mike. I hate to tell you this. Tell me. We got to go to the mall. Yeah, we do. Cuz I want to get to the mall. I want to get 30 more escape ropes and more [ __ ] max repels. Let's go to the mall, dude. I got to go to the mall, guys. I'm sorry. I got to go to the mall. Kevin, you can go get him ready and bring him to the mall with us. It's going to be fun. The job rods. Oh my god. We're soaked back, baby. We are back into Pokemon. This could be",
            "start": 6691.28
        },
        {
            "text": "to go to the mall. Kevin, you can go get him ready and bring him to the mall with us. It's going to be fun. The job rods. Oh my god. We're soaked back, baby. We are back into Pokemon. This could be the final two days, too. And we get [ __ ] Lugia. It's over, Chad. It's over. We get Lugia. I'm [ __ ] dominating this entire squad. We had so much rare candy. We'll go to the Elite 4. We'll cheat the [ __ ] out of that one. It'll be over. You I You guys leave me today for 15 minutes with this game. You come back. All these guys be level 100. All of them. Why is everybody 99? What happened here? All right, get ultra balls. Get a bunch of balls as well. Sell everything you've never seen before. Sell [ __ ] we don't. Revives. I don't even need to sell. I have $100,000. If we go to island B. Oh [ __ ] he gave us money. I know. I just See, I don't have a I think I've just been eating everyone. so senseless that I have a ton of money. I have an AFJ E. So you have a different for L-shaped one is",
            "start": 6739.28
        },
        {
            "text": "he gave us money. I know. I just See, I don't have a I think I've just been eating everyone. so senseless that I have a ton of money. I have an AFJ E. So you have a different for L-shaped one is island B for me. Okay. No, I'm looking at if you're looking at the four straight away. Hold on. Hold on. I'm going to send you this. Okay. Yeah, send it to me. I'll tell you. Yeah, I got my slack. Well, I mean, let's just use the same map. Well, yeah. I'm going to I'll tell you what. Yeah, you send me yours and I'll tell you I'll tell you your numbers. All right. Excellent. I I just sent you the map. So, from what I see, island B, you're going through island B. You hit the left side. Yes. So, you're looking exactly what I'm looking for. Down to H and then you're set golden. What's the best ball? You're going from island B into B. Down B all the way down to H. H down. Battle that guy at the staircase down to Lugia. Exactly. Kevin, where's I on my map? On my map. You see Lugia? And there's an I.",
            "start": 6790.72
        },
        {
            "text": "going from island B into B. Down B all the way down to H. H down. Battle that guy at the staircase down to Lugia. Exactly. Kevin, where's I on my map? On my map. You see Lugia? And there's an I. I is another hole. It's called M for me. Oh, yeah. I see it. You found it. You go in there. There was like a Pokeball. Oh, okay then. [ __ ] that. No, I mean Well, we just So, you need to go back one and see like the actual island map, Kevin. Yeah. The four islands. You should see four islands. The four islands. We're going for the top right one. If you're tracking what I'm tracking, that's island B according to our Yes, you're island B. Correct. Yeah. How many ultra balls should I get chat sound off right now? A million. Get me your money like that. $100,000. Yeah. As many as you'd like, bro. Why are there two multipliers there? Oh, 20. 50. Let's do it. You're 50. Look at us working, chat. You got 30. Oh, I had I bought 20 prior. Oh, okay. And I think I have like 60 now. And then you get",
            "start": 6831.36
        },
        {
            "text": "Why are there two multipliers there? Oh, 20. 50. Let's do it. You're 50. Look at us working, chat. You got 30. Oh, I had I bought 20 prior. Oh, okay. And I think I have like 60 now. And then you get repels. Max repels. Max repels. And I got escape ropes. Sick. I don't think I really need more than 10. But yeah, you you don't you want these max repels. I'm going be real with you. Tired of fighting this [ __ ] I'm just going to anytime I go surf or anything, I'm just going to pop one. You're the max repel guy. You stink. Nobody wants the immunity. [Music] Let me catch this [ __ ] bro. This [ __ ] is lit. I want this guy on my squad. We're this guy's like this guy's like the number one draft pick coming out of college and I This is fullcourt press. We're not getting This is like when Andy free agent. We want Michael Jordan. We want We wanted Andy on our team, but he always keeps 10% to himself. And we know the entrance to island. Is that correct? No, we're going to have to figure that",
            "start": 6886.64
        },
        {
            "text": "free agent. We want Michael Jordan. We want We wanted Andy on our team, but he always keeps 10% to himself. And we know the entrance to island. Is that correct? No, we're going to have to figure that one out. Yeah, I'm tracking it now. What the [ __ ] are these energy roots, Kevin? Do I need this or the reverb heels? What? Revival heel. Do I need either of these? I don't think you need revival heels. You can get rid of it for sure cuz you really cuz I don't revive [ __ ] right? The whole thing. I I don't think this is going to work out the way you want. That's going to be lit. Let's see if what happens when we hit 100. I think you only sell 99 at a time, right? Lit. 138,000. Remember when we were scrging up pennies to buy lemonade? Andy really hooked us up. Look at us now. Look at us now. You do that eight more times. He really hooked us up on that. Look at us now. We said we talked about [ __ ] about Andy leaving earlier, even though I know it wasn't about Andy, about Roger. I know,",
            "start": 6943.76
        },
        {
            "text": "You do that eight more times. He really hooked us up on that. Look at us now. We said we talked about [ __ ] about Andy leaving earlier, even though I know it wasn't about Andy, about Roger. I know, but Andy did just be like, \"Bye.\" Yeah, he did leave us. But he did hook us up. Supposed to leave like an hour ago. I Well, I asked for my Pokemon wish for us just to be in the room to finish Pokemon. And he said, \"Yeah, no problem.\" But he only gives us 5 minutes at a time. He always keeps 10% for It's like It must be like when it's like hanging out with [ __ ] Brad Pitt, right? Yeah. Hey Brad, you want to get a cup of coffee? Don't think that's enough money. That's what Brad says. I actually want to sell all these, Kevin, only because it's annoying to have this many everything in my space. Now, Kevin, if you want to go back to the island map, I don't know if you can actually see the four islands. It's not giving me an island map on this website unless are you finding uh type in route 41.",
            "start": 6994.32
        },
        {
            "text": "Kevin, if you want to go back to the island map, I don't know if you can actually see the four islands. It's not giving me an island map on this website unless are you finding uh type in route 41. I think some 41 on like your on your Google page. Just type in route 41 soul silver and it should probably give it to you. 41 soul silver. I mean, once we go in it, we'll know. Well, no. So, we have to come at Jay a little bit differently. What do you mean? I don't know what Jay is. You keep saying uh the island. You're island B. So, you're top right. Top right. So, you notice on the top right how you can come from We can get to the other three from the left hand side, but I think the top right you have to come at it from above. Yeah. See the waterway? Yeah. So, I need Nick to somehow come at it from above. I mean, can we just figure out how to get there from A? You have max money, too. It's so sick. I have max money. [ __ ] All right. Well, well, I mean, whatever. It doesn't matter. Yeah, I",
            "start": 7031.6
        },
        {
            "text": "from above. I mean, can we just figure out how to get there from A? You have max money, too. It's so sick. I have max money. [ __ ] All right. Well, well, I mean, whatever. It doesn't matter. Yeah, I might as well just keep them. I mean, why the [ __ ] not in case I decide to go ham on Oh, Joy's calling. Kev, what did you say? Something probably good. It's Joey. How are you? Oh, yeah. I sent out a Pidgey in the wall the other day. It was Cakewalk. Well, I guess it can't be helped being so tough. All right. Later. Bye. Hold on. Look, look, look. Mike, go back to the first page. The the link I sent you. Uh-huh. Look, if you go through A, go down, uh, go down, hit a right, go up, go down, G, we're right there. No, that's the one I took him on. Yeah, we can't break that. That's the one we did. Yeah. Yeah. Break that rock. You're right. You're right. I'm wrong. Um, it's like, \"Fuck you, Joey. You're battling a Pidgey. I'm out here battling the legendary bird.\" Okay, [ __ ] That I'm beyond",
            "start": 7074.0
        },
        {
            "text": "Yeah. Yeah. Break that rock. You're right. You're right. I'm wrong. Um, it's like, \"Fuck you, Joey. You're battling a Pidgey. I'm out here battling the legendary bird.\" Okay, [ __ ] That I'm beyond you. The chaos that you were like, \"Hey, do you want to go to open mic already?\" I'm like, \"Fuck you. [Music] Why is this website so damn just tell me how to get 200 point I should probably keep that route okay 900 I have 900 full restores guys I'm [ __ ] yeah dude all right let's fly out kept wetweight doesn't even know he's training as replacement poor kev so where were you at I went here and then You need to go up to the north one. I need to go that. No, no, to the north. Uh, yeah, that one. Cuz I need you to come down. Okay. Yeah. North to south on this. We were coming from west to east. I need this. Let's do it. West to east. He's just giving it away. Yeah. Waste of bandwidth. Said, \"Did uh did y'all need flash?\" I don't know who we could flip flash on. Yeah. But at this point, we",
            "start": 7119.44
        },
        {
            "text": "I need this. Let's do it. West to east. He's just giving it away. Yeah. Waste of bandwidth. Said, \"Did uh did y'all need flash?\" I don't know who we could flip flash on. Yeah. But at this point, we don't need we we got so many maps out, you don't even know. I got to repel. We're doing it for you. We're going to [ __ ] finish this video game. Give Nick a break from all things Pokemon for a long time. This isn't right. That doorway to the left. Is it? Maybe. Maybe. I don't think I know. This is a pure. Well, I mean, that's a mat, but like here's the guy he's going to be like, \"Yo.\" And it's like, \"Oh, we're just trying to send off, sir.\" Yeah. I can't get I can't out this way. I got to get through the other dude. Maybe I can pay him. I do have a billion dollars. Hello, friends. Oh, oh, what? Have a boat. We're not ready to rock yet. Beach together. Nice secret in town. Oh yeah. [ __ ] yeah. Hit that max repel as well before. Oh yeah, I hate that max repel. [Music] I wish you can just",
            "start": 7172.72
        },
        {
            "text": "Have a boat. We're not ready to rock yet. Beach together. Nice secret in town. Oh yeah. [ __ ] yeah. Hit that max repel as well before. Oh yeah, I hate that max repel. [Music] I wish you can just take all of them and be like, I'm good for the rest of the game thing. I would love to just take 900 of them and it just stacks. [Music] You don't want to go in eye and find out what the secret is there? What's that? What do you mean? Uh, let me see yours. I thought you said you just looked at that and it was just a Pokéball. Well, I mean, yeah, but it doesn't tell me what it is. Oh, really? It doesn't tell you what it is. All right, Mike. Do I need to go right or left here? Uh, you need to go down. You're going south. North to south. Grape serve. Well, I'm seeing all the items, Kevin, in the in this area, and no matter what it is, it's not anything special. Okay. Check me, Mike. I'm still on route 41. This is it. Hold up. The first little So, you have come down route 41. Let me take a look.",
            "start": 7220.2
        },
        {
            "text": "this area, and no matter what it is, it's not anything special. Okay. Check me, Mike. I'm still on route 41. This is it. Hold up. The first little So, you have come down route 41. Let me take a look. Okay. So, here. No, you got to go on the far right side. Just swing that where that guy's just swimming. Yeah. Go, go, go. And this No, up. Yeah. Go up. There you go. To the right. You did it. Hard right. That's it. Hard right. Keep going. Keep going. Bang. Down. Go down. You're going to get to fight that brick. You got to fight this [ __ ] dude. Knock his teeth so deep. Mike wants to go home so bad. Get this [ __ ] dude out of our face, bro. This guy's in our [ __ ] grill. Three. Hurry up. Three down. That ugly [ __ ] thing. What do you think that smells like in between it shells to punch you right in the face? Shell protect itself. Oh, what? What? I just clowned you out. Yeah, he really jked me on that one. Not cool. Nick went left. He should have gone went right. Is that right? No, I",
            "start": 7270.4
        },
        {
            "text": "right in the face? Shell protect itself. Oh, what? What? I just clowned you out. Yeah, he really jked me on that one. Not cool. Nick went left. He should have gone went right. Is that right? No, I think we No, we're perfect. Yeah, he's No, I went left originally. But it's funny, Kevin, because you know what? We could have gone the original route cuz he went that way and there was two rocks he just split. So, we could have gone the original route, but this way is just fine. Did he? Yeah. He split those two rocks, oddly enough, where that guy was swimming. Oh yeah. If you look right there, that northern side right there, he split two rocks where that guy was swimming back and forth. We're like, \"Oh, no. Go back right.\" Yeah, that's odd. I didn't know there was a gap there. It's hard to tell on these tiny little So [Music] hardc like imagine if you had some sort of device that made those words focus for God's sakes. It would be really cool. Kevin, jump on my on my side on this. He's",
            "start": 7325.64
        },
        {
            "text": "tell on these tiny little So [Music] hardc like imagine if you had some sort of device that made those words focus for God's sakes. It would be really cool. Kevin, jump on my on my side on this. He's already I don't know where the [ __ ] my glasses are. And I made a promise to people I would try, but I don't know where you glasses that are this big. So, everybody look paint the [ __ ] paint the clarity for you. Oh, this guy's stretching. What an a-hole. Who was interested in getting LASIK? Who talked about LASIC with Tim? It's a really good question. Was it blessing though? Someone maybe in the um on the Oh, it was on the happy hour. Happy area. Maybe I should get Lasic with them. Well, if you could, you probably should. What are you doing? Uh I'm going to uh max elixir myself just so I'm ready for that. Before I forget. There's a lot going on. We won't forget. We will all say max elixir. I mean, you're almost there. Just [ __ ] popping off. You already do that. There you go. And why",
            "start": 7377.52
        },
        {
            "text": "ready for that. Before I forget. There's a lot going on. We won't forget. We will all say max elixir. I mean, you're almost there. Just [ __ ] popping off. You already do that. There you go. And why are you using the baby one if you got a thousand of the Twitch chat? Are you still awake over there? Twitch chat, come talk to me. No, they left. I think we killed Twitch chat. JG's over there on the YouTube chat. you. There's so much before we even get there. No, you got time. You're fine. You're going to have to fight an old dude. I think we're going to fight an old guy. Yeah, we maybe we don't know about the old, but yeah, probably standing there. The old guy is definitely in our way that dude. All right, hit that world. Get to the world pool. Me and Kevin [ __ ] navigated the [ __ ] out of this. You guys did a great job. Where's Jay? Where the [ __ ] is this Jay? Oh, we found it. Yeah, we should. We just used that. Oh [ __ ] You got to go You got to go south to north on that. Oh, I got",
            "start": 7428.08
        },
        {
            "text": "this. You guys did a great job. Where's Jay? Where the [ __ ] is this Jay? Oh, we found it. Yeah, we should. We just used that. Oh [ __ ] You got to go You got to go south to north on that. Oh, I got to go this way on. Yeah, you got I was like, \"What the fuck?\" You repel War, by the way. Thanks, Poly World. Now, hit that repel one more time. Wrong way. What's What are sacred ash? Lemon Bendy says we have 900 sacred ash. What does that mean? Is that cool? One way to find out, we click on it, see what happens. smear it on your Pokemon. [Music] Went to go see Thunderbolts this week. What' you think, man? Oh, yeah. It was good. Was fine. Okay, let's cool our jets a little bit. It was fun. It was a good time. Now, you know what excited me? Predator Badlands on the big screen trailer. Looked uh pretty nasty. Pretty [ __ ] got pretty excited about that one. I'll tell you what, some good trailers out there. Some good trailers. Okay. What time you mind? It revolves all fainted Pokemon. Okay.",
            "start": 7469.28
        },
        {
            "text": "pretty nasty. Pretty [ __ ] got pretty excited about that one. I'll tell you what, some good trailers out there. Some good trailers. Okay. What time you mind? It revolves all fainted Pokemon. Okay. Yeah, we can't. Yeah, we don't do that. We don't do that here. They die. They die here. They die. They die. We have 900 rare HP up though. We have 900 HP up. No, you got to go all the way around and swim again. No [ __ ] I I'm pretty sure that's I was trying to grab your attention. Yeah, they really [ __ ] [ __ ] really stupid. Yeah, like just put some shoreline there, you know? [Music] Jesus, my repels. I don't have to fight level 15 tentacles. I use that. Oh, it's still happening on her. I thought I I didn't just say it ran out. Uh, no. I We're good now. All right, we're here. So now this is the cave we've been in, funny enough. So you're going to go forward. Forward all the way to the top. Take a right. Ride it. Keep going. Just ride it all the way. And then up. And there's our ladder.",
            "start": 7530.32
        },
        {
            "text": "the cave we've been in, funny enough. So you're going to go forward. Forward all the way to the top. Take a right. Ride it. Keep going. Just ride it all the way. And then up. And there's our ladder. And that's going to take us outside to the waterfall basin. No, hold up. Hold up. Hold up. No, no, no. You to go down. Okay, we go down and to the left. Yeah, down to the left. [ __ ] yeah, Kim. when he gets us back on track. To the left now. Okay. Yeah. Down again. To the left. Keep going all the way. Quick zigzag. Then we're going to go down again. One more zigzag to the left. Down again. To the right. To the right. Ladder. We're here. Yeah. Grab the Pokeball. [ __ ] it. [ __ ] We got to have all this [ __ ] That's how you stay rich, dude. It's how you stay rich. Uh down and to the right. Talk to this guy. Protect me, old man. Oh, we had to tell him we got that on his face. I communicate through wind like me and Greg. Did you feel that, Greg? He says, \"Oh my god, I got a boop. Do I need",
            "start": 7596.72
        },
        {
            "text": "to this guy. Protect me, old man. Oh, we had to tell him we got that on his face. I communicate through wind like me and Greg. Did you feel that, Greg? He says, \"Oh my god, I got a boop. Do I need to go here or do I just go in there? Go in there.\" Pokeheaded. It's right there. Something I don't know what this is. Oh. Oh. Okay. This is the top. Gorgeous. Oh, look at that. This is the top. Okay. Oh, a rare can. Now you have a rare candy to use. Now I'm back up to 999. That's crazy. Wink wink, chat. Sorry. I mean, wa. That's great. Exciting. Easier on the way down way out. Way up. [ __ ] I think he flies you out on the way out. Oh yeah. He burst right through that waterfall with you on back. Are we ready? We stepping in. Yeah, we're stepping in. These ladies. How did these ladies get here? Get the [ __ ] out. I'm not fighting them again. I'm not fighting them. Okay, real quick. Elixir up. There you go. There you go. So, you remembered me. What the hell is old? What is that? Click on it.",
            "start": 7654.32
        },
        {
            "text": "the [ __ ] out. I'm not fighting them again. I'm not fighting them. Okay, real quick. Elixir up. There you go. There you go. So, you remembered me. What the hell is old? What is that? Click on it. What does it do? Old chateau. Oh, wow. Lot of old uh gate. Give him a brick. He gave a brick. He's [ __ ] bllicked up. Oh, you know what? Sage brings up a good point. Maybe we saved. Yeah, I think that's a great idea. It's been a long day. I don't remember if we've ever saved. I've saved a few times. Okay. Yeah. You also don't have to fight, right? You just, you know, we're not sure. Oh, you can just full catch Pokemon like that. Wait, we have the ma the master ball. That's And it just full catches them. That's what people are saying. I didn't know that. Oh, okay. That's why we were asking if we should use it now or you want to look up the other pages in your analog strategy guide. Trying to find these. Let's see if we need if the dog is better. But I'm I'm so committed to getting Lugia that",
            "start": 7710.32
        },
        {
            "text": "should use it now or you want to look up the other pages in your analog strategy guide. Trying to find these. Let's see if we need if the dog is better. But I'm I'm so committed to getting Lugia that I think once we get in, we've won the game. We don't have to play ever again. I mean, we're so close. No, we have to play tomorrow for Mike's birthday. We are so close. Hello, man. Oh, they're going to dance for me. The title the Taco Bell bell dance. [Applause] The [ __ ] is that? They're going to That's this bell. Fuia's bell. They're going to [Music] dance. [ __ ] They're calling him. This is wild. They do this on a game boy. [Music] That's the bell. That's the bell. Now, the real question is, do we try to catch him without the Master Ball? I mean, we could we could try to work it or we don't lose any Pokemon to the He is He is 45. That's So, he is quite strong. Mhm. And he's a psychic flying type. He has Okay. I I see his four moves though. Mhm. He has hydrop pump, rain dance,",
            "start": 7767.68
        },
        {
            "text": "we don't lose any Pokemon to the He is He is 45. That's So, he is quite strong. Mhm. And he's a psychic flying type. He has Okay. I I see his four moves though. Mhm. He has hydrop pump, rain dance, aeroblast, and extra sensory sensory. So he's got hydrop pump. Hydrop pump was a water move. Rain dance is water. And Aeroblast is probably flying. So I might be able to just knock. But here's the thing. I got to catch him. I have to catch him. Yeah. Oh, he's beautiful. And Dudikov. Oh, I need him. Dudikov is weak to water moves, right? Oh, he's strong against water moves. Is that right? Yeah. You throw the toaster in the bathtub, it electrifies the bathtub. Electricity is only um weak to ground moves. So gorgeous. Oh [ __ ] he's intimidating. It might be a love chat. I catch him with a master ball. Now I want you to know grind it out. Nico Gaming writes in and says it can take hours if you don't use a master ball. That's That's an insane statement. How does he heal? Yeah, that just heals",
            "start": 7834.72
        },
        {
            "text": "ball. Now I want you to know grind it out. Nico Gaming writes in and says it can take hours if you don't use a master ball. That's That's an insane statement. How does he heal? Yeah, that just heals himself. He's the He's the Lugia. How does he heal? He doesn't have any heals. He's a bird. Imagine. Start off by using super effective electric, ice, or rock type moves to drop Lugia's HP down to size. Then gradually lower its HP with grass, fighting, and psychic type moves, which only do half or a quarter damage. Oh, these [ __ ] is teaching you how to do it without the master ball. But still promote a master ball. But we have the master ball. We do. Chris just texted me. Oh, yeah. Chris talking a lot of [ __ ] about a book that's saving your all your sanity. It's true. Chrisenko, it's okay. Yes, it's not the book. It's the fact that it's analog and my is the one in charge of it. I don't think you ever get any dog/cat without master ball. I mean, tell Chris I get this to call us. Chris,",
            "start": 7895.08
        },
        {
            "text": "Yes, it's not the book. It's the fact that it's analog and my is the one in charge of it. I don't think you ever get any dog/cat without master ball. I mean, tell Chris I get this to call us. Chris, do I use the master ball? Do I grind this thing down? Chris, be our Pokemon train. Chris says, \"What are you talking about? Just use the master ball.\" Okay. Okay. Well, Chris [ __ ] I think I can [ __ ] look sick as [ __ ] I really think I can [ __ ] take this thing by myself. I Okay, do it. No, big man. No. Talking big game. Oh, look at the master ball. What do you think, Mike? Let's take a test for the three of us. Master ball or no master ball? We can always use the master ball anytime. He might kill Dudikov though. It's not like he's not going to fight back. He's going to fight back. I don't know. I was against this. Like I said, if Chris says throw the ball, Snowike Mike says throw ball. Everyone is saying throw the ball. Put a one in the chat if you want me to throw this ball right",
            "start": 7946.96
        },
        {
            "text": "know. I was against this. Like I said, if Chris says throw the ball, Snowike Mike says throw ball. Everyone is saying throw the ball. Put a one in the chat if you want me to throw this ball right now for you. Yep. Yep. Yep. Oh, quick ball. That's a great ball. One quick ball for the hell of it. No, cuz we're afraid that he hits you and you die. He might one shot. Yeah. And it's not like you have white kev out there. We don't have a replacement. Barrett's in the room. The Pokemon master himself is in the room. Barrett, do I throw the ball or do we battle this thing? And if it die, Barrett, if you say don't throw the ball and he dies, that death's on you. You have to get a tattoo of Dudikov with the name Dudikov underneath. And then a URL to Michael Dudikov's IMDb page so everyone knows who is to throw the ball. Throw the ball. Damn. Bunch of cows. Yeah, it's crazy that you guys would throw for content like that. Can I try the quick ball first? Look, you know, I don't know where the",
            "start": 7993.52
        },
        {
            "text": "who is to throw the ball. Throw the ball. Damn. Bunch of cows. Yeah, it's crazy that you guys would throw for content like that. Can I try the quick ball first? Look, you know, I don't know where the quick ball idea came from. Okay, just throwing out the quick ball idea. This is This is the Pokémon you would want to use this on. Yeah, here we go, baby. Let's go. We do. We finish it. That's crazy that like shakes out of it. Yeah, you can auto catch this guy. Like, what's the ball always works? I got him. Well, that was anti name. Damn, this is a big name. This this is probably the biggest name in all of our Pokemon. There's a lot of [ __ ] blank spots. So, let's And there's a lot of names. Here we go. Let's find out. Kevin, you ready? This guy hits like a truck. I'm not letting him take a swing at me. That's huge, guys. Thanks to your support, you all have the opportunity to name the incredible. This is what it's all about right here, Mike. This is it right here. All of your support on",
            "start": 8036.56
        },
        {
            "text": "at me. That's huge, guys. Thanks to your support, you all have the opportunity to name the incredible. This is what it's all about right here, Mike. This is it right here. All of your support on all those days, including Suicide Squad day, got us here. Mike, who's the lucky winner? Take me to 264. [Music] 264 is blanket. It's blank. It is prime time. Oh, prime time already won. Prime time already name. We already got a prime time name. This is a great name for this one, though. Prime time. Prime time is an awesome name for Isn't prime time still alive? Yeah, we have another prime time. Yeah. Yeah. Yeah. Give me another name. Another name. Kevin, take me to 89. Best number. Oh, 89. 89. We got one. Sheriff name. Sheriff. What? Sheriff. That's the name. The sheriff. Oh my god. Well, they they named it sheriff and then No, I wrote name next to it because I was going to do Pokemon after you. The sheriff. The sheriff. That's a great name. That is a badass name for this Pokemon. Shout out to",
            "start": 8083.28
        },
        {
            "text": "named it sheriff and then No, I wrote name next to it because I was going to do Pokemon after you. The sheriff. The sheriff. That's a great name. That is a badass name for this Pokemon. Shout out to Sundad who named this Pokemon Shundad. Sheriff. Congratulations. You have named Not the Sheriff, just sheriff. I mean, it's just sheriff, but you can name the sheriff. I think you could put the sheriff. You could definitely put the sheriff on that. What do we think, Chad? I think the the sheriff is [ __ ] I think the sheriff is great. Shout out to Sundad out there. Wow. Sorry, Prime Time. You already got one. Prime Time's great, though. Prime Time is our go-to. Is Prime Time in the group? Yeah. Which one's Prime Fire? That's my fire Pokemon. My Nail. Oh, yes. Uh-huh. The Ninetailes. Wow, chat, we did it. We have caught Lugia, the legendary bird, the cover athletes. What if we baseball sheriff? E R I F. What if we just restart it and fight it? It would be make for better content. Well, we",
            "start": 8138.08
        },
        {
            "text": "we did it. We have caught Lugia, the legendary bird, the cover athletes. What if we baseball sheriff? E R I F. What if we just restart it and fight it? It would be make for better content. Well, we could try. We could see if we can take it. I didn't save right beforehand for that. Oh, I thought you did. I saved like maybe a 5600 for the K. We can try. No, I thought you said I thought you saved right before like when right there before they did the dance. No. All right. All right. Never mind. We can We can take a look real quick. It's fine. For anecdotally, I I'm curious to see if we could. Okay, thank you. Wow. Maybe it does need to be just sheriff. Yeah. Yeah. I think it's better. I mean, you got to respect this. Got to respect the bird. I think we could have battled it. I mean, I definitely It would have been one a hell of a story. This is better. Dude cop would have died. I can feel it. I don't know. I mean, I can So, check your last save file. It'll tell you the time. Okay. How do",
            "start": 8183.12
        },
        {
            "text": "It would have been one a hell of a story. This is better. Dude cop would have died. I can feel it. I don't know. I mean, I can So, check your last save file. It'll tell you the time. Okay. How do we check our last save file? Let's get back up here. Let me talk to these ladies real quick. Okay, so Oh, no. You just saved. Let's see. No, I haven't saved [ __ ] Uh, so it was 332. No, I mean, look, I could legitimately just start from the other save and see where we're at cuz all it is, all I have to do is come back down here and get this thing. It's fine. It's not that big of a deal. So, we can try, but I want a doover on this. Cheers. You want me to restart it? It's up to Kevin. We have 20 minutes until five o'clock. I have nowhere to be. You know that. It's up to you, too. And maybe the audience. I mean, we do have to battle the other legendaries. Well, that I don't know if we'll do before the elite, but maybe we maybe we can go find it. Like, right now, if I closed this, I don't know",
            "start": 8254.48
        },
        {
            "text": "I mean, we do have to battle the other legendaries. Well, that I don't know if we'll do before the elite, but maybe we maybe we can go find it. Like, right now, if I closed this, I don't know where that other save was, though. I don't think I saved right before this. I might have. It's It's weird cuz I asked you to save and you were like, \"Oh, I saved recently.\" You I said I've saved a lot recently and I don't remember if I had saved here. You haven't saved. You were like, \"It's been a long ass time since I saved.\" That was me saying that. I mean, you can roll the tape back and see. I can roll the tape back. Let's see if I saved right at the entrance. If I saved at the entrance, we're going to give it one good whack. Okay. I love that. I love We're going to give it a whack. But this doesn't count. This is This is another story. Chris can make a lot of sense in the chat. What did he say? Don't let Kevin's intrusive thoughts in. What are we doing? This is one of those things that like",
            "start": 8307.52
        },
        {
            "text": "count. This is This is another story. Chris can make a lot of sense in the chat. What did he say? Don't let Kevin's intrusive thoughts in. What are we doing? This is one of those things that like we could always go back to that same, you know, throw basketball at it. Where is he? I want the dude. You got to go back. I want to see it. Nick did save right at the doorway. So, wait. He goes to save. He hits yes. He waits. Let's see. He overrides it. He just kind of looking at it for a second. He hit yes. He did save right at the doorway. It is confirmed. Chris says if you Chris is the arbiter of the weapons arbit if you do this it has to be real. Whoever dies dies. Wow. Mike, are you willing to take this chance? I'm willing to take this chance. [ __ ] you. I'm not. We We got a thousand [ __ ] rare candies. The dude. You love I know you love the dude. We're [ __ ] doing this. Run it up, dude. Let's make some content. We're making some content. I mean, Chris is right though. If we do this,",
            "start": 8342.96
        },
        {
            "text": "rare candies. The dude. You love I know you love the dude. We're [ __ ] doing this. Run it up, dude. Let's make some content. We're making some content. I mean, Chris is right though. If we do this, it counts. It's got to count. I love it. I love it. I have no problem with that. Let's lock the [ __ ] in for a good battle. So, re do it or not, Nick. I need you to tell me. It's up to you, Nick. You're You're the Pokemon trainer. I can't guide you which way or left. [ __ ] this is tough. Let's see. A lot of people say not worth the risk. Yeah. I mean, he could wipe the whole squad right now. He could wipe the whole squad. And if it's for real like that, guess what? That's suicide squad number two. Who are we? But then I might kill him. You might kill Lugia. You think about it too much. You made it fun. Let's move on. That's the problem. You overthought it. Yeah, that's right. You either go in there and you [ __ ] battle this Pokemon. We see what happens. We come out with one hell of a",
            "start": 8398.24
        },
        {
            "text": "made it fun. Let's move on. That's the problem. You overthought it. Yeah, that's right. You either go in there and you [ __ ] battle this Pokemon. We see what happens. We come out with one hell of a tail or we [ __ ] skip it. Lemon Bendy says that your ancestors took a risk by crossing an ocean to build life from another continent. That was two generations ago. Lemon Bendy, my mom was born in Italy. Yeah. They didn't even She came up. I think she flew over actually. I don't She took a boat. It was like a United flight. All right, with that. Save the game. Let's get the [ __ ] out of here. Save the game. Chat, congratulations. We have now captured Lugia, which means we are one moment away from continuing to finish the fight. Nick is nearing the Elite 4. I think we'll take them on tomorrow for my birthday to hopefully just finish Pokemon, the first half of Pokemon as you already know, uh, with Nick's Nuzlocke stream. Congratulations, Nick Sundad. Our winner of today's Andy's gone. Take",
            "start": 8450.48
        },
        {
            "text": "for my birthday to hopefully just finish Pokemon, the first half of Pokemon as you already know, uh, with Nick's Nuzlocke stream. Congratulations, Nick Sundad. Our winner of today's Andy's gone. Take this [ __ ] thing. Maybe tomorrow. Maybe tomorrow. Run it up right now for the people. All right. It doesn't If you're going to do it, we do it tonight. It doesn't count then. I just want to see if I can Nick. Let's just say this. No one's going to die. Run it, Kevin. No one's gonna die. Run it. [ __ ] it. No one's gonna die. No one's gonna die. And if it if everybody dies, we'll turn the stream off. Nobody will know what happens. I want to see if I can take this [ __ ] thing. This is a bad idea. I want to see if I can take it. I'm all about it. Reacting to this? Are they freaking out? Cuz I'm freaking out. We're doing it. Run it. People say turn it the [ __ ] on. I just want to know. I just want to know what how hard this guy is. Now it starts and it's the f like the the same place we",
            "start": 8495.44
        },
        {
            "text": "I'm freaking out. We're doing it. Run it. People say turn it the [ __ ] on. I just want to know. I just want to know what how hard this guy is. Now it starts and it's the f like the the same place we started at today. If they die and we see them tomorrow, no one should tune in for Mike's birthday. That would be great. We click it on. You see these Pokemon, you turn it off right away. Me, Nick, and Annie will just finish this. Don't worry. We end this. All right, here we go. Okay, it was right here, too. It was right here, bro. Oh, now we have to watch this stupid video. We got to do the Carol. All right, this thing is 45. You're 47. Bos [ __ ] Should we have started with the [ __ ] All right, we're good, right? I can get up, dude. That dude's already up front. Dude's already up front. I'm going to hit him with just nothing but ultra ball. I have 50 ultra balls. I'm going hit him with ultra ball. Ultra ball. Ultra ball. Ultra ball. One of them's got to hit, right? Well, we got to get",
            "start": 8544.24
        },
        {
            "text": "going to hit him with just nothing but ultra ball. I have 50 ultra balls. I'm going hit him with ultra ball. Ultra ball. Ultra ball. Ultra ball. One of them's got to hit, right? Well, we got to get him low. Do we? You're just going to hit him full strength. I'm just going to throw. He's alive though. He's going to keep hitting Dudikov. Then you're going to get He's got to shake that. He loses the turn when he shakes. We got to get him low. He shakes it off. He loses the turn. No [ __ ] Unless he's faster than me, which he might be. So you can just keep chucking balls at him. I don't think that's Keep him in a cycle. Can you skip this? No. No. It's a beautiful dance. It's a beautiful dance. You have to respect the dance. You have to respect these Pokemon. I can't believe we're doing this. I'm so glad Andy's not here for this. Oh, Andy would quickly back down to this one. Yeah, we're not afraid of a challenge. We supposed to stop. We're making content here. You have our phone numbers",
            "start": 8589.04
        },
        {
            "text": "I'm so glad Andy's not here for this. Oh, Andy would quickly back down to this one. Yeah, we're not afraid of a challenge. We supposed to stop. We're making content here. You have our phone numbers for a reason. Be really funny if we just throw the master ball. Great job, everybody. Okay, let's earn this. Sheriff, he's already got an ace. Oh, that was really cool. I didn't see that the first time. It's an alternate re This is an alternate universe. Can you stand me? It's an alternate universe. Where have we gone? Here it goes. The fight of our liv. This This is probably the fight of our lives. This is the fight of our lives. We should have eaten a bunch of red candy. Yeah, we've been here. We've been here. Yeah. Get out of our face. We're here to fight. I'm just going to Yeah, that's a smart state. That's a very smart state. We have to doubt this back for any reason. If it Yeah. If Nick wants to pull the plug on this any is so mad at us. This is going to be good, y'all. This is going",
            "start": 8623.52
        },
        {
            "text": "state. That's a very smart state. We have to doubt this back for any reason. If it Yeah. If Nick wants to pull the plug on this any is so mad at us. This is going to be good, y'all. This is going to be good. Oh, [ __ ] that. This is See, Chris wants us to be can cuz he wants us to fight. He wants us to get better. I know he does. Step into the pool. I already This is the dumbest idea I've ever had. I don't know who came I didn't come up with this idea. So nervous. My idea. I didn't go People be yelling at me all the time. This wasn't Mike's idea. Keep burping up. All right, here it is. What does this fight look like? All right. So, do we start up by throwing him a quick ball just for funsies? No, I think we I think we paralyze his ass. Paralyze his ass. But I but if I hit him with a thunder punch, he will get paralyzed. Okay. It might paralyze him. Well, that's good cuz we want to lower him down. We want to get him. We want to fight him like a normal Pokemon. If this kills him, we'll",
            "start": 8686.08
        },
        {
            "text": "punch, he will get paralyzed. Okay. It might paralyze him. Well, that's good cuz we want to lower him down. We want to get him. We want to fight him like a normal Pokemon. If this kills him, we'll restart, right? If this Well, we've been having some electrical problems in the studio. So, if if the computer goes out, I we have to load the last save. Yeah. Yeah. Yeah. Yeah. Yeah. Punch the [ __ ] out of this one. This guy. Oh, this was okay. It's fine. Extra sensory. Okay. Remember that move. Oh, that actually hurt. Oh, dude. We're [ __ ] in this fight. Okay. [Music] I mean, come on. This is the easiest game on planet Earth. What the [ __ ] is happening here? I'm going to hit him with Thunderwave. I'm going to see if I can hit him with Thunder. Really? Really? Oh, wow. Okay. You know what? But the balls might not work. I mean, we're just going to start spam. We just spam up ultra balls. Yeah, we spam them up on this guy. [Music] Okay. Okay. Oh, okay. Didn't Didn't do a single shake",
            "start": 8732.08
        },
        {
            "text": "But the balls might not work. I mean, we're just going to start spam. We just spam up ultra balls. Yeah, we spam them up on this guy. [Music] Okay. Okay. Oh, okay. Didn't Didn't do a single shake here. Okay. Not a single shake. We're fine. You want to heal? That's the He's got a little bell. It'll heal between every round. This might not go our way. Okay, this is getting a little scary. Okay, that was [ __ ] insane. He missed the hydro pump on you. Insane moment. I hydrop pump really low. Hydrop pump is bad against electricity, so it's not going to it's not going to go crazy, but I mean I could heal real quick. I would heal. I would heal. You know what I mean? If it takes us out with 158 health, it earned it. Okay. But like, you know. So, is this what they were talking about that it's just going to take a,000 balls? Yeah. No, I think they were saying on the old version it would heal itself. Well, he might not on the new version. Why would I not use the right heal? That's all right.",
            "start": 8785.84
        },
        {
            "text": "going to take a,000 balls? Yeah. No, I think they were saying on the old version it would heal itself. Well, he might not on the new version. Why would I not use the right heal? That's all right. It's a far away. Hydro pump is still strong. Did they give anyone false swipe? We did not give anyone false swipe. We don't got it like I mean, we we're super low already. We're going to hit this thing with 48 balls. We don't care. We're here all night. We're made of money. [ __ ] It's not even shaking. Shaking. God damn it. It just takes a lot of tries. That's fine. We're here. We got 50 balls. We got max money. We can go back to the mall tomorrow. Buy everything we ever spend. Try a heavy ball. I can try. [Music] He's really not shaking. It's not even shaking. I just got to get him down more, but I don't know how to. It's all right. I don't think you got to get him down more. You're in You're in critical territory. I don't think you Yeah. Yeah. I think I think you're fine. I think the next",
            "start": 8843.28
        },
        {
            "text": "I don't know how to. It's all right. I don't think you got to get him down more. You're in You're in critical territory. I don't think you Yeah. Yeah. I think I think you're fine. I think the next tap it's going to come down to just being a lucky Okay. No more fresh water. Yeah, we have better things than that. Well, I need 50. Yeah, that's a good point. Just use it. Use the super potion. Yes. All right. No, no, no. Yeah, that's right. Why is super potion 50? Cuz again, myth needs a max potion. Yeah, there we go. That's what we're using. Isn't that full restore even better? [Music] Yeah, we're back in this. We're back in this. We're just throwing balls. We're just throwing balls. Should I try a heavy ball? I mean, yeah, you can try different balls. Yeah. How about this master ball? Should I try this one? Now, that would be some funny [ __ ] if you did that. Just got his ass. Oh. Get the [ __ ] out of town, guys. I told you that's canona. It's canon. That's for cryinga. That's what I'm",
            "start": 8898.48
        },
        {
            "text": "I try this one? Now, that would be some funny [ __ ] if you did that. Just got his ass. Oh. Get the [ __ ] out of town, guys. I told you that's canona. It's canon. That's for cryinga. That's what I'm talking about. Canon. Never doubt us. Make us better all the time. Chris Sheriff on his put sheriff on the name and save it. We did it. Did it. We so did it. Cowards out there. That's canon. And guess what? Take five hours. It took That took less time to throw the master ball. And now you Now you go catch a dog. I'm going to catch myself a [ __ ] dog. Go catch. We're going to have a murder squad for this this last people. Guess what? That was wild. That was I think the chat, by the way. Huh? The chat might be paused for us over here. Everything changes now. Chad, get ready. Oh my god. I got a master ball. That was insane. That was insane. [ __ ] put it in your face, dude. In your face. Sheriff. Heavy ball, man. I got to get more of those. And that was cuz he's a heavy Pokemon. Yeah. Yeah.",
            "start": 8941.92
        },
        {
            "text": "master ball. That was insane. That was insane. [ __ ] put it in your face, dude. In your face. Sheriff. Heavy ball, man. I got to get more of those. And that was cuz he's a heavy Pokemon. Yeah. Yeah. That's 450 lbs. And that puts us right at the end here. And we didn't take the easy road, everyone. Take the hard way. We did not take the road. We took the road less traveled. We battled to get to these Pokemon levels. I had to beat those four kimono girls. They were harder than this Lugia. And guess what? That puts us on the route to finish the game tomorrow. I cannot believe Chris ain't got that. The Elite 4 start tomorrow and we finish this video game. I'm going to I'm going to save it right here while I'm riding this Dolphin. And I want to remember this moment. Koga, Bruno, Karen, Lance. We'll see you tomorrow for the finale of Nick Nuzlock 2.0. Like to introduce them to the sheriff. Over. No, we got to catch a dog before we go. Yeah, wait. If you want to catch a dog, we can catch a",
            "start": 8994.4
        },
        {
            "text": "We'll see you tomorrow for the finale of Nick Nuzlock 2.0. Like to introduce them to the sheriff. Over. No, we got to catch a dog before we go. Yeah, wait. If you want to catch a dog, we can catch a dog. Can you look up the stats on the dogs? Ah, that was insane. Maybe we did. Axel took the easy route at first, but then we turn around to the hard road. Yeah. And if a hard If you rob a bang, you take the money back. Yeah. They can't. What are they gonna do? We took the money back. What jury in the planet's gonna And then we robbed them again. Exactly. Robes. They're not going to convict. That was fun. Thanks everyone for a great stream. That is our return to Pokemon. I know it's been a long time, but we're happy to get Nick in here and we built up the confidence to return for tomorrow to hopefully finish the game. That's right. We will try to go down to victory road and beat this game once and for all. It's been a long journey, but it wouldn't be possible without each and every one of",
            "start": 9044.64
        },
        {
            "text": "finish the game. That's right. We will try to go down to victory road and beat this game once and for all. It's been a long journey, but it wouldn't be possible without each and every one of you. Thank you so much for the support. We'll catch you here tomorrow for more streaming fun. Will Nick catch one of these legendary dogs tomorrow? It's a maybe. It's a maybe. I want one. Good luck. I want one so bad. Bye. Goodbye. Bye. [Music]",
            "start": 9090.96
        }
    ]
}