{
    "id": 14163,
    "video_id": "1UBWacJVso0",
    "show_name": "Screencast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino"
    ],
    "title": "The Last of Us Season 2 FINALE Spoilercast",
    "description": "Go to https://mood.com and use code KINDAFUNNY to get 20% off your first order.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\n00:00:00 - Start\n00:02:10 - Housekeeping\n00:03:05 - Nick’s thoughts\n00:04:00 - Greg’s thoughts\n00:07:03 - Tim’s Thoughts\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1748377574,
    "duration": 2304,
    "transcript_chunks": [
        {
            "text": "[Music] [Music] What's up and welcome back to the final Last of Us Season 2 spoiler cast kind of funny breakdown of course. I'm your host Tim Gettys. I'm joined today by Greg Miller. Hi Tim and the producer/droducer Nick Scarpina. Hello Tim. Hello Nick. How you doing? I'm doing well. How are you doing? I'm good. Excited to talk about Last of Us. I'm very excited to talk about Last of Us. We got the finale. Finale. You excited Greg? I'm excited to talk about it. There is an excitement in the air everybody. We're having a banger day already. Had a great games daily. Had a fantastic games cast saying goodbye to Mario Kart 8 Deluxe. And after this, we're doing a fun little sponsor stream of Subway Surfers where the three of us are hanging out with Roger Porny. A combination that I don't think has ever happened before. I don't think so on any show. That's kind of cool. I've been I've been trying to make an effort to hang out more with Blessing. And it's made my life so much better. And it's",
            "start": 0.34
        },
        {
            "text": "ever happened before. I don't think so on any show. That's kind of cool. I've been I've been trying to make an effort to hang out more with Blessing. And it's made my life so much better. And it's also showed me a lot of holes in my life. I need more stuff on my desk. I'll put it that way. I'll never forget last. Were you on the you listen to the podcast last night? I I've seen the comments from the podcast. Yeah. one point where Blessing was like, \"Uh, Nick's desk is so clean. I thought he quit.\" Kind of funny. That's not good. That's the way it's always been. It's always less coffee. Three Post-it notes. Chicken Scratch. Yeah. Okay. Okay. It's legible. It's legible. Oh, everyone. This is our screencast. This is our series where we break down the latest in TV, movies, and trailers. You can also get our show in review on this same podcast feed or, of course, watch on YouTube or live on Twitch if you would like to do that instead. Uh right now and in review, we're doing a whole bunch",
            "start": 65.6
        },
        {
            "text": "can also get our show in review on this same podcast feed or, of course, watch on YouTube or live on Twitch if you would like to do that instead. Uh right now and in review, we're doing a whole bunch of different things. This week we are going back to Karate Kid where we will be reviewing Karate Kid Legends as well as a little bonus extra credit homework without a full review. Just our thoughts on The Karate Kid 2010. Did you watch it yet? I watched it last night. Oh my god, I watched it last night, too. I can't find a way to talk about this later on. Jackie Chan, baby. Oh, baby. Really doing a lot of the heavy lifting in that movie. A lot of the heavy lifting. A lot of it. Yes. Uh very long movie. Um, but anyway, you'll get our thoughts on that long thoughts on that later. Um, and then Karate Kid Legends as well. Um, if you love what we do, please get the kind of funny membership. You can get that on Patreon, YouTube, Spotify, or Apple podcast. You get all our shows ad free. You also",
            "start": 105.84
        },
        {
            "text": "Kid Legends as well. Um, if you love what we do, please get the kind of funny membership. You can get that on Patreon, YouTube, Spotify, or Apple podcast. You get all our shows ad free. You also get a daily exclusive Greg way that today is 27 minutes about Greg having Superman fever. We're almost there, everybody. July 11th. July 11th. Countdown the days till 7-Eleven. Oh, thank heaven. That's what they say. That's what they say. They do say that. Get your Keebler cookies now. Mhm. Uh, thank you to our Patreon producers, Carl Jacobs, Omega Buster, and Delaney Twining. Today, we are brought to you by Mood, but we'll tell you about that later. Let's get into our review of the finale of season two of The Last of Us. Who do I want to start with? Is anyone jumping? Is anyone ready? I'll start with Nicholas. I thought the finale overall was strong. I'm glad this season's over. And I'm And I'll tell you why. because I have cooled to the Ellie story to the point where I've started to I've",
            "start": 146.8
        },
        {
            "text": "with Nicholas. I thought the finale overall was strong. I'm glad this season's over. And I'm And I'll tell you why. because I have cooled to the Ellie story to the point where I've started to I've started to look very much forward to it switching perspective over to Aby's story uh in that I forgot how many horrible decisions Ellie makes and how by this point in the game you kind of like I I don't I don't remember if I sympathize with her still in the game but I sure don't anymore by the end of this episode. I sure if I were This is one of those characters that I look at I'm like if I were you uh uh part of your team, I would have left you behind a long time ago because you're making some poor choices and you're doing some really heinous [ __ ] But I think that's the whole point. And right when it picks up at the end and we kind of see where where the next season's going to take us, I get very very excited for that. Gregory, I think you know you start who's chomping at the bit to go",
            "start": 188.32
        },
        {
            "text": "when it picks up at the end and we kind of see where where the next season's going to take us, I get very very excited for that. Gregory, I think you know you start who's chomping at the bit to go off and talk about it. I'm not. And that's the thing where I'm like it's over and it's like okay cool. Like I don't know. I'm going to have to decompress I guess to figure out why that's the feeling of it. But I don't have the feeling of season 1 where I was like they [ __ ] nailed this. They crushed this. It's not that this is bad, but I think it's probably part because this isn't a full story. Maybe that's there too. Some of the choices they made here I appreciated in terms of like the little stuff of giving us more Jesse, giving him more information. It's an interesting choice to have Ellie open up to Dena and tell her way more way earlier. But then there's stuff to, you know, Nick's point here of like, are you an Ellie fan here? Are you back? Like going from the game and being on sticks",
            "start": 230.08
        },
        {
            "text": "up to Dena and tell her way more way earlier. But then there's stuff to, you know, Nick's point here of like, are you an Ellie fan here? Are you back? Like going from the game and being on sticks and again when you're in it and you're playing a video game, it's so easy to look past how out crazy and outlandish all the choices are to get here and have it be like Ellie gets to the shore and sees a boat and sees two guys and raises her pistol like she's about to shoot at them from 150 yards away. then sees all these boats and goes back down and then she's still like I'm getting on that rowboat to go all the way over there in the pitch black darkness. Then gets knocked out of the boat, washes up on Sarafi Island, which I feel like is a lot further down all the way over there in the pitch black. Gets into a two second jam there. Gets out gets back in the boat and goes all the way. It's like I'm This is feeling a little far-fetched right here. And again, it's that mashup of what we know and",
            "start": 269.36
        },
        {
            "text": "Gets into a two second jam there. Gets out gets back in the boat and goes all the way. It's like I'm This is feeling a little far-fetched right here. And again, it's that mashup of what we know and all these different things of the Bella Ramsay Ellie just doesn't seem to have the bloodthirsty I am out for [ __ ] revenge that our Ellie in the video game did. So, it's even more like, but would you do that here? You wouldn't stop being the water and the thing. And yeah, I'm with you. I think that I think there is a there is a limit to when you're watching an actual human being Yeah. act and you're seeing the like the more reality. I don't want to say that the video game doesn't create a great reality because it absolutely does, but there's a difference in how you're experiencing when you're playing through it. You're watching someone make these decisions and after a certain point you start thinking to yourself, why am I supporting this person's poor decisionm and you get you get to that",
            "start": 316.32
        },
        {
            "text": "playing through it. You're watching someone make these decisions and after a certain point you start thinking to yourself, why am I supporting this person's poor decisionm and you get you get to that point where she's like, you know, you get to a point where she where she, you know, kills Owen and kills not Abby Mel. and you're like, \"This would be it for me personally.\" I think I'd be like, \"You know what? Let's just let's go. Let's let's let's go home after this.\" Actually, probably when when my friend said that she was pregnant and I was putting her life in danger, I'd be like, \"Maybe we we rethink this, right?\" And then we get that conversation at the end where where Jesse's sort of like, \"Hey, you know, I know you'd move heaven and earth for me.\" I'm like, \"She just proved she wouldn't. She literally just proved that she would leave Tommy behind. Tommy, her surrogate uncle, to go do this thing that doesn't even need to be done.\" And so after a certain point after decision",
            "start": 361.12
        },
        {
            "text": "wouldn't. She literally just proved that she would leave Tommy behind. Tommy, her surrogate uncle, to go do this thing that doesn't even need to be done.\" And so after a certain point after decision decision decision and you see all the vi you see all that stuff I just go to myself I don't know that I want to be in Ellie's world anymore. I really don't. I really don't. And then we switch over to Abby and I'm like yes that's the world I want to be in now. What about you from a top level? It's it's a tough one for me where I'm kind of with you guys in the sense that like it being over I'm not like thrilled. Uh I I I wish we were getting I'm different than Nick that I wish we were getting more right now. Um, but I also just feel like at the end of the day, this being seven episodes, now that we've seen all the changes they made, most of which I was in support of and still am in support of, I do feel we were kind of robbed of an extended look at Ellie's time in Seattle. I feel like the",
            "start": 398.96
        },
        {
            "text": "we've seen all the changes they made, most of which I was in support of and still am in support of, I do feel we were kind of robbed of an extended look at Ellie's time in Seattle. I feel like the Ellie in Seattle stuff happened a little too fast. Um, and to get to where we we are uh in the story here, like meeting back at the the theater and stuff, like I am reminded of how much I preferred the Abbeby story in the game. Um, whereas the Ellie stuff was just there was so much mystery. And it's it's once you know the story of this game, it's hard to go back to seeing Ellie stuff. And I think it's uh interesting because not too much happens with Ellie. And I think that's evidenced in the show covering the major beats and not that much happening, right? But I think that it's not until we get the context of who Owen is in Aby's thing that his death matters at all. So I feel like I understand people being a little bit let down by this because from what people know currently, it is just kind",
            "start": 437.44
        },
        {
            "text": "context of who Owen is in Aby's thing that his death matters at all. So I feel like I understand people being a little bit let down by this because from what people know currently, it is just kind of like, okay, she killed a couple people. Who gives a [ __ ] Like she kills they killed a whole bunch of people. I feel like it kind of loses that weight. But I think the show did a good job of the Ellie not being bloodthirsty enough or whatever. I don't agree with that personally. Like I feel like her the extents to which she is throwing herself at this problem. I think they show in the show a a very good version of Ellie doing that and just going way too far. And I'm with you, Nick, of like I'm not in support of this Ellie, but I felt that way in the game, too. But I feel like with the show, I'm an extra not. And I feel like seeing Jesse and them walk in and dealing with the pregnancy bit more, like dealing with her not being able to save the baby and Mel like begging her to and seeing",
            "start": 479.92
        },
        {
            "text": "I'm an extra not. And I feel like seeing Jesse and them walk in and dealing with the pregnancy bit more, like dealing with her not being able to save the baby and Mel like begging her to and seeing the look on Jesse's face when he sees all that happening. I thought that stuff really, really, really hit. It's just I think the biggest problem that I have with this season and this episode in particular is the fact that we have to wait so long for a season 3 and to get Aby's story and then potentially even a season 4 to move on from the moment we're at at the end of this potentially. And I think that while I can deal with that, I don't think the majority of people can. And I think that's going to be really to the detriment of the overall experience of the show and how people think about it and talk about it. Last of Us 2 the game was incredibly divisive and controversial for people that were able to play through the entire story in one sitting. Uh breaking it up this way I think is going",
            "start": 519.44
        },
        {
            "text": "talk about it. Last of Us 2 the game was incredibly divisive and controversial for people that were able to play through the entire story in one sitting. Uh breaking it up this way I think is going to be a real tough cell. Having said that, Caitlyn De at the end of this nailed it. I thought that while I still feel like she should be buff and I don't like that change in the story, I think that she is so imposing and the the shot of her walking out into the arena, I'm like the way she's acting, her final speech in the theater, I'm like that's [ __ ] Abby. Yeah. Yeah, 100%. Yeah, they crush that a lot too. I think to your point of the bloodthirsty Ellie and and her throwing at it, I think it's the idea that when we were playing it and I was like, \"No, no, no, no, don't do this, Ellie. Don't do this, Ellie.\" I felt like even outside of the moments of going for revenge, it weighed on her and it felt like it was on top of her shoulders the entire time and she wasn't the Ellie we knew from",
            "start": 562.16
        },
        {
            "text": "do this, Ellie.\" I felt like even outside of the moments of going for revenge, it weighed on her and it felt like it was on top of her shoulders the entire time and she wasn't the Ellie we knew from before. My counterpoint here in season two, right, with Bella Ramsey, who I think does a great job of interpreting this character and working with what she has is that Ellie is still very Ellie at time. Like she's still very wise, cracky, she's enjoying life, but then she remembers that she's mad or she has to go and then so it's just like there's two tones there that I think in the game there was one tone and then a lot of melancholy that surrounded that. And that then that's for me the disconnect of I just don't buy what Bella Ramsay's been giving us and then looking at the pitch black ocean in the middle of a [ __ ] crazy ass thunderstorm gigantic [ __ ] waves getting watch. I just don't buy that she wouldn't be like this isn't worth it. I need to go back and have it, you know, change.",
            "start": 601.44
        },
        {
            "text": "in the middle of a [ __ ] crazy ass thunderstorm gigantic [ __ ] waves getting watch. I just don't buy that she wouldn't be like this isn't worth it. I need to go back and have it, you know, change. They've changed so much so many little things. I wonder how they I would have liked to have seen them massage this. I feel I would agree with what you're saying, but to me the turning point was a couple episodes ago when they're in the little Sarapite forest and she ditches Jesse and Dena after like she had now reunited with with the squad. I feel like that was the turn the point of no return of just like, oh, she's gone from this. Like she is gone. She is going to finish this mission if it means she succeeds or dies. And I think that her throwing herself into the scariest freaking ocean in the world, like that's proof of that of she's gone, you know? Um, and I I feel like in the the game version of it for me, the Ellie part of the story, I wasn't really feeling and buying the like, oh",
            "start": 649.04
        },
        {
            "text": "the world, like that's proof of that of she's gone, you know? Um, and I I feel like in the the game version of it for me, the Ellie part of the story, I wasn't really feeling and buying the like, oh man, like she's gone too far or whatever, it's a video game and I'm playing it and I really felt like I got to kill everybody because they're the bad guys. And it wasn't until we get the contextualization of the Abby side of it that you start to really I personally be like, \"Oh man, like I'm seeing Ellie from a completely different perspective.\" Whereas playing as Ellie, it's just like this how video games work, you know? Yeah. Yeah. And I think that I think a lot of that again you're not in the story so long, right? You are there are those moments where you're traversing. There's the boat moments. There's the and correct me if I'm wrong, but when you were in when they were trying to get away from the Sarah fights, that was that was a lot of sneak and running around and like trying to get",
            "start": 691.2
        },
        {
            "text": "There's the and correct me if I'm wrong, but when you were in when they were trying to get away from the Sarah fights, that was that was a lot of sneak and running around and like trying to get away from them, right? Like that was a whole level that you got to play. And so you're in there and you're scared and you're seeing that you're you're with that violence way more than we are with this character. Whereas we're just sort of like getting more of a skin deep look at what Ellie's going through. But I'm with Greg on this, right? like I don't I don't think that we've seen quite the depths of that rage um that you that you need to in order to justify me really being bought into this journey for Ellie. Yeah. Yeah. Yeah. And I just think it's overall it's a bummer that we end here cuz it's like it's going to be a while till we get the next season. And then you got to imagine the next season is going to be the Abby story up to a certain part. And if that is just up to where we're at,",
            "start": 730.88
        },
        {
            "text": "like it's going to be a while till we get the next season. And then you got to imagine the next season is going to be the Abby story up to a certain part. And if that is just up to where we're at, that's going to be even more frustrating for general audiences. And I think even people familiar with the game, it's just going to draw out the conversation people are having. So So we're assuming season 4 is going to be I don't know the sort of epilog. I don't know. I mean cuz like like you know jumping into that conversation because we're here. It's like I I feel like at the very least it gets up to the theater moment, right? It's got to get past that. Yeah. I think I think there's so much more Aby's story than Ellie's story though. So unless they speed through the [ __ ] through that which Have they said how many season or episodes next season is though? No. They said that it's probably going to be more than this. But even then like like I feel like you get to the theater mode, you have",
            "start": 768.32
        },
        {
            "text": "they said how many season or episodes next season is though? No. They said that it's probably going to be more than this. But even then like like I feel like you get to the theater mode, you have the whole fight and then it's the aftermath of that. I don't know if you jump straight to the farm if it is just like the video game, right? cuz we're on a [ __ ] tractor with JJ or whatever and that's where we go. I imagine that's where we leave them. Yeah. If you're going to do if that's how we're going to approach season 4, which I don't know if we actually are. Yeah, totally. Potentially. Yeah, maybe season four is a little shorter potentially. Who knows? Yeah, I've got at that point you're like, \"All right, well, if you're going to do a four episode season 4, then just tack four episodes onto season 3, right?\" I mean, potentially. I don't know. Yeah. And that again, I just think that's where this gets rough because to your point, it's Last of Us season 1 I feel like has uh it's so much",
            "start": 805.76
        },
        {
            "text": "season 3, right?\" I mean, potentially. I don't know. Yeah. And that again, I just think that's where this gets rough because to your point, it's Last of Us season 1 I feel like has uh it's so much easier for it to be better than season 2 because it's a complete story, a complete game and us knowing that story. It from beginning to end, it's like it is every character arc is completed. Whereas with this, it's like no one's character arc is completed at all. It's they're just starting, right? It would be absolutely wild and I know they're going to do a season four. Um, but it would be absolutely wild if they did one more season and and they didn't do that last part of the game where it just ends with like the the basically Dina being like if you leave like I'm not going to be here when you come back. Right. Oh, interesting. Abby just walks off and that's the end of the show. That would be [ __ ] unbelievable. Yeah. I mean, [ __ ] I I feel like you the moments like if you want to see how",
            "start": 838.8
        },
        {
            "text": "back. Right. Oh, interesting. Abby just walks off and that's the end of the show. That would be [ __ ] unbelievable. Yeah. I mean, [ __ ] I I feel like you the moments like if you want to see how it ends, play the video. Neil's perfect plan. He's like, I got to get everyone here to buy more copies of it. I don't know. Uh, I want to keep talking about this, but first I want to take a quick word from our sponsors. This episode's brought to you by Mood. Let me tell you about the online cannabis company that's revolutionizing how we deal with life's challenges. From sleepless nights to stressfilled days, Mood.com has created an entire line of functional gummies that target specific health concerns with 100% federally legal THC blends. They'll deliver them discreetly right to your doorstep and you can get 20% off your first order at mood.com with promo code kind of funny. I've been having a great time trying out their different gummies and I'm loving how each one feels. Their Sleepy Time",
            "start": 878.4
        },
        {
            "text": "you can get 20% off your first order at mood.com with promo code kind of funny. I've been having a great time trying out their different gummies and I'm loving how each one feels. Their Sleepy Time gummies will knock you out in about 15 minutes flat. No hangovers, no groggginess. Not only does Mood stand behind everything with an industry-leading 100-day satisfaction guarantee, but as I mentioned, listeners get 20% off their first order with code kind of funny. So, head to mood.com, browse their amazing selection of functional gummies, and find the perfect gummy for whatever you are dealing with. And please remember to use promo code kind of funny at checkout to save 20% on your first order. Again, that's mood.com, promo code kind of funny for 20% off. And we're back. I got chills with Seattle Day One at the end. Yeah, I thought that hit I expected them to just end with the the theater moment in her uh little speech and like the cut to black. But yeah, getting a little bit of a tease",
            "start": 924.24
        },
        {
            "text": "Day One at the end. Yeah, I thought that hit I expected them to just end with the the theater moment in her uh little speech and like the cut to black. But yeah, getting a little bit of a tease like I thought that was so awesome. And with G who does not know the story, she was like, \"Oh shit.\" Like locked in wanting more, but she's not gonna get it from Yeah. What was her reaction knowing nothing about She [ __ ] loved it. She [ __ ] loves the show. And it's like I feel like that's cool. Somebody that is not at all familiar with the the real stuff and like getting into it, but I do think it is going to be a problem for her of like two years till the next season and then getting the refresher and then we get this whole other side and who the hell knows where it all goes. But again, I think that there's real legitimate problems with the way this is being released because it's not doing the show favors because it's based on a game that I feel a lot of HBO watchers are uh have experienced",
            "start": 976.48
        },
        {
            "text": "that there's real legitimate problems with the way this is being released because it's not doing the show favors because it's based on a game that I feel a lot of HBO watchers are uh have experienced and like are able to do the book reader thing of like, oh, the book's better than the movie, you know what I mean? Better than the show and all the problems. But gamers are also a lot more obnoxious than book readers when it comes to their opinions on things. So, I feel like it's it's a tough place for them to be in. And I also don't think they're doing themselves favors with a lot of the choices that they made and changes that they they made and stuff cuz people want things to be one for one. Then there's another group that wants things to be completely different and not one for one at all. And I feel like this season in particular was kind of uh pleasing the least amount of people in those two categories. Yeah. How you going to do it though? You know what I mean? How are you going to",
            "start": 1016.64
        },
        {
            "text": "And I feel like this season in particular was kind of uh pleasing the least amount of people in those two categories. Yeah. How you going to do it though? You know what I mean? How are you going to make anybody happy? I honestly I think sitting here and having these uh conversations we've had the only change that I don't and I'm I mean I could easily eat these words and you could point something I've said in a show before but the only change I'm like ah that just doesn't work for me is Ellie showing getting washed up on the serified island last night for me last night I was watching. So why why not like because I I want to talk a little bit more about that just is a bridge really upset about it. I don't know anything about that. The Greg Miller perspective is I just found it all way too convenient. way too convenient again of like I'm an idiot so I maybe I misinterpreted but it really felt like when Isaac and crew were getting picked when Isaac was picking up the crew they were for",
            "start": 1054.48
        },
        {
            "text": "convenient. way too convenient again of like I'm an idiot so I maybe I misinterpreted but it really felt like when Isaac and crew were getting picked when Isaac was picking up the crew they were for lack they were heading to what I would call north up the shore but it's probably south but they're they're heading the opposite direction of uh the aquarium right okay correct so it feels like they're and it looked far away maybe it was one of those things where you know you take off SFO for whatever reason they go the opposite way and then they got to come this way it it looked like they were going far in opposite direction. So, for Ellie to get in the boat, then get put into a title wave or just a gigantic wave, right? First off, my first thought is, \"Oh my god, is she?\" Even though I know she's not, but is she going to drown? That's what I'm worried about. And instead, it becomes, no, she didn't drown. She washed up 300, 400 yards, if not more, away over there alongside her very",
            "start": 1092.24
        },
        {
            "text": "know she's not, but is she going to drown? That's what I'm worried about. And instead, it becomes, no, she didn't drown. She washed up 300, 400 yards, if not more, away over there alongside her very conveniently placed boat. Unless I'm supposed to believe that's the Serif. It looked like the same boat. They all got washed up right over there to where she signed up to where there was one kid who immediately found her, who immediately brought her in, who immediately put her in the news, who immediately had the explosion, who immediately just left. And it's just like, this is all way too convenient. And then she gets back on the boat and goes, and then we're into a place where it's like, it's not. But I'm like, okay, this could have been the same footage of her on the boat again, like doing it. Like I understand the point here is her motivation to get there and how we how I want her to be. I don't want her. I mean, but I mean, for this makes her she needs to be bloodthirsty, but it was",
            "start": 1132.64
        },
        {
            "text": "it. Like I understand the point here is her motivation to get there and how we how I want her to be. I don't want her. I mean, but I mean, for this makes her she needs to be bloodthirsty, but it was just like I feel like that made that section weaker. I think her going into the [ __ ] pitch black darkness fighting on like the crazy storm. That was enough of I get it. Her washing over there and the other people just drop her. I'd be like I mean kill her. Exactly right. Why? Like what am I doing? Like is she not one of the invaders we're thinking is doing? She's not one of us. So by definition she's an enemy. The whole that whole section just felt so convenient and yeah rush. Yeah. Do you think that the Sarapites though have like a Barrett or a Kevin who was just like, \"No, we should just keep the noose up the entire time for whenever we need it. We don't know when Nintendo's going to announce the new thing, so let's just keep the lights on kind of thing.\" I mean, yeah. I think that",
            "start": 1170.48
        },
        {
            "text": "keep the noose up the entire time for whenever we need it. We don't know when Nintendo's going to announce the new thing, so let's just keep the lights on kind of thing.\" I mean, yeah. I think that they're sacrificing it to their god, right? Like I feel like they're they do have I just mean like the news was like set up. I was like, \"Oh god, you all just have that there all the time.\" I think they do. That's their spot, man. I think they have multiple spots like that. I feel like that's the whole what what is it? Fear her fear she her she fears. Um feel her love. Yeah, feel her love. I was not fear at all. Feel her love. Like all that stuff. But yeah, like I to an extent I do think like most things in the show it was rush to get there. The logistics of how far everything was. I didn't even think about that. Like I was not thinking like oh they're going a different direction to me. I was like oh the island's close to the if I can jump in there. Right. It was the fact that to me they've",
            "start": 1212.96
        },
        {
            "text": "think about that. Like I was not thinking like oh they're going a different direction to me. I was like oh the island's close to the if I can jump in there. Right. It was the fact that to me they've already set up how intimidating the storm is just from Isaac and the one woman from the detective show the outsider talking is there going to be a supertorm whatever. I was like okay [ __ ] and then get there and to see it and be like that is so [ __ ] crazy to then have it be that we also set up how far away it is in this. I was like yeah I just I missed the how set up far away it was. I really like story-wise of this. And again, I think this is all going to be stuff that is better when we get the second half of this story and being able to see how it interwines with the interweavves with the Abbeby story cuz I do feel like the Ellie part of the game was lacking the Sarapite stuff and getting to that the Sarafite war [ __ ] the island war that we get in the end of Abby story, I wish that",
            "start": 1249.52
        },
        {
            "text": "Abbeby story cuz I do feel like the Ellie part of the game was lacking the Sarapite stuff and getting to that the Sarafite war [ __ ] the island war that we get in the end of Abby story, I wish that we got more set up for in Ellie's side. And so here, I at least appreciate that we're we're getting um some of those touchstones to touch back to later. But I also really liked the story elements of her just trying to save a saraphy kid and then now a Sarafi kid is the reason that she almost died would have died had the alarm not went off with all of that. Like I just feel like there was there's a lot of good symbolism going on in terms of the character themes and what they're trying to get across of not just like the oh when you seek revenge it's all this stuff. It's the violence overall and it's like when these kids are being taught the violence like there's us and them and how that all comes down to the last of us and all of that. Like I think that it worked. I just feel like the level",
            "start": 1290.0
        },
        {
            "text": "it's like when these kids are being taught the violence like there's us and them and how that all comes down to the last of us and all of that. Like I think that it worked. I just feel like the level of a human being thrown through this water. It felt weird in the game too. Like it felt like I remember playing the game during that part where you're like crossing and the waves are crashing. I'm just like this girl is [ __ ] She's very very cold, you know? But it's a video game. So when you adapt it to real life, it's like you lose some of that uh suspension of disbelief. So, I think it just gets more unbelievable to watch her in this shitty little rowboat go across this deadly ass cold ass storm water, you know? Yeah. And I think that's one of the interesting problems for them in the writer room of how much you adique issue to run into with a video game adaptation of, okay, we're adapt we're adapting something that when you're on sticks and you're the character and you're doing the",
            "start": 1330.32
        },
        {
            "text": "room of how much you adique issue to run into with a video game adaptation of, okay, we're adapt we're adapting something that when you're on sticks and you're the character and you're doing the thing, you're not thinking as much about it because you've already done so many crazy ass things, right? Like I mean think about you've also died, right? You've also died multiple times. You go back and go it doesn't really matter death that means something totally different in video games. Yeah. You touched on an interesting scene that I wanted to go back to though, right? The scene with where with with her wanting to save the teen Sarah fight. That was that was a moment where I really started losing touch with the character because that seemed so out of pocket for where she should have been emotionally at that point. Like she knows she's in danger. She she's not dumb. She's been she's a soldier for all intents and purposes. She's like, \"No, we got to go save this guy.\" And Jess is like,",
            "start": 1370.72
        },
        {
            "text": "emotionally at that point. Like she knows she's in danger. She she's not dumb. She's been she's a soldier for all intents and purposes. She's like, \"No, we got to go save this guy.\" And Jess is like, \"There's six of them. Where where are you right now?\" And moments like that, like I know that that was that was written for a specific reason and it was supposed to come back later, but I just look at that and I'm like, man, this again, this doesn't this is not endearing this Ellie character to me to have her act this immature in this moment and have there be absolutely no reason for why she would want to save this person. I mean, see, my thing is I feel like this Ellie is dumb and I think that they show that the entire season of Dena being the one like without Dena, I feel like Ellie would have died way earlier and you don't feel that in the game. I feel like with this one, it's like Ellie is a look before leap before you look. I always get that back with you so leap before you look and",
            "start": 1409.6
        },
        {
            "text": "died way earlier and you don't feel that in the game. I feel like with this one, it's like Ellie is a look before leap before you look. I always get that back with you so leap before you look and like just run out there and figure it all out. And I think it's a lot of this little girl that grew up in this world and then learned from Joel and I saw the way that Joel handled things um and either saved people or didn't save people over the course of Last of Us one and then the adventures in between. But I feel like with where we're at um in in the show, I think that that scene was very in line with this version of Ellie. Do I like this version of Ellie? No. Like I don't. But I didn't from the jump really. And I think that that's kind of by design. I think it the Ellie that we got in season 1 was a different person and I feel like this show did a good job of explaining why. But I I understand not liking that because I don't think you're supposed to like it but it feels like you're",
            "start": 1447.76
        },
        {
            "text": "1 was a different person and I feel like this show did a good job of explaining why. But I I understand not liking that because I don't think you're supposed to like it but it feels like you're supposed to. You know that Yeah. It's at odds, right? It's it's uh why are we along the like there there is a there is a point that or a threshold rather for as a viewer you're watching a character for so long and you have to ask yourself like am I am I am I invested in this character's journey? And by the end of the season, I can honestly say I'm I'm not invested in Ellie's journey anymore. And I I kind of felt that with the game, too, honestly. Like, there was a part of the game I remember finishing the game being like, I understand. I get why people like this. I never want this experience ever again. And I and I and I was hoping that at the end of this season, I would not feel that. And I honestly think like I'm glad I watched it. I think everyone should watch this. I think it's a",
            "start": 1488.48
        },
        {
            "text": "ever again. And I and I and I was hoping that at the end of this season, I would not feel that. And I honestly think like I'm glad I watched it. I think everyone should watch this. I think it's a beautifully made show. I will never watch this season ever again of of The Last of Us. Having said that, the second we get to Abby being like saying the line, which is I let you live, you wasted it. And then go back to day one, I was like, I will watch season 3. I will absolutely watch this. And I think to your earlier point, I do think it was a disservice. I do think it's a disservice that we don't know Abby well by this. And I know that's how the game was broken up. I'm presuming as well. I don't remember the game that well, but I do think it would have been like the touchstones that I had of this season, the things that kept me watching were the Jeffrey Wrights, were the Abby moments, were the wolf, was that that sort of, for lack of a better term, sort of like classic Walking Dead, we",
            "start": 1524.96
        },
        {
            "text": "this season, the things that kept me watching were the Jeffrey Wrights, were the Abby moments, were the wolf, was that that sort of, for lack of a better term, sort of like classic Walking Dead, we have to go kill the killers sort of like we're doing bad things, but because we're protecting our own people sort of vibe, right? And so the more of that we got, I think the better the season overall would have been. And this is just kind of where we want. I think we just spent way too much time with Ellie and the revenge kick. And I would have liked to have seen those characters fleshed out more so that by the time we did shoot because by the time we get to the point where, you know, we see what what Owen was to Abby, it's going to be eight episodes from now. You're not going to remember the emotional impact of either of them dying at this point. And if you do, they're going to show you a flashback. Who cares? We've already seen it. Well, I mean, that's the I think Well, it's going to",
            "start": 1565.52
        },
        {
            "text": "emotional impact of either of them dying at this point. And if you do, they're going to show you a flashback. Who cares? We've already seen it. Well, I mean, that's the I think Well, it's going to build up to that moment and we're going to see them die by Ellie. You get what I'm saying? Like seen it though, right? Like we've already know it's happened. So the so the punch by definition is is a little bit it's going to be lesser for me because I don't have an emotional connection to OE or Mel Owen and Mel, right? I don't care about them because they're just two people I've seen for 20 minutes on screen all told. Right now you jump on now. Yeah. Now. Yeah. Exactly. Yeah. Yeah. Yeah. Then and then I feel like that is the bigger problem is it's like that's how it was in the game too. But you did not know these characters at all. You just killed them. Uh you saw them once in the beginning of the game and then that's pretty much it. So, uh, I I'm very interested in in getting to know them",
            "start": 1603.44
        },
        {
            "text": "did not know these characters at all. You just killed them. Uh you saw them once in the beginning of the game and then that's pretty much it. So, uh, I I'm very interested in in getting to know them more and seeing like how more impactful it's going to be able to see all these events from the other perspective. I think the biggest problem though when I now I'm thinking really about the Ellie versus Abby sides of the story. Aby's just had so much more story. Like I feel like Ellie's focused so much on that what is it Seattle day one where it's like the open world part of Seattle. That's some gameplay [ __ ] you know? That is really the like go explore and find a bunch of things and like interact with things in cool fun ways with your PlayStation controller and learn little bits of story beats of like Dena and all that stuff, but like translating that I think is not as easy as Last of Us one that was a linear story. And I feel like Abby doesn't have those big open world moments. So I",
            "start": 1636.0
        },
        {
            "text": "beats of like Dena and all that stuff, but like translating that I think is not as easy as Last of Us one that was a linear story. And I feel like Abby doesn't have those big open world moments. So I think it's going to just because of that and also just because I think there's a lot more story beats to cover. Compelling, you think? I think it's going to be more compelling and I think it's going to be a lot uh better of a adaptation because of just the sheer story of it all whereas the story of Ellie's part is pretty simple. It's pretty simple to just she goes on this bloodthirsty Exactly. and and it happens real fast in the show and I don't think it feels like now that the whole season's done I don't think it feels that satisfying but I think that when we had the context of Aby's it is going to and I say that not just oh man I hope it's like well I know because that's how it was in the game too so the same feelings I I didn't even think about Owen and Mel in the game I just killed",
            "start": 1674.08
        },
        {
            "text": "going to and I say that not just oh man I hope it's like well I know because that's how it was in the game too so the same feelings I I didn't even think about Owen and Mel in the game I just killed sure yeah and it wasn't until a couple hours later I get their backstory and know so so it's like that's that it's it's rough you know what I mean 100% % with you, right? When I think about the things that I want to see more of, I want to see more of that story. And that's why I'm very I'm excited for season 3 in that regard. Yeah. Um, let me see if we got any super chats. We do. Dana says, \"This Ellie just overall seems incapable of the revenge she's going after. Also, the time she's escaped death this season. Uh, it's also come down to purely luck instead of skill.\" Yeah, I agree. Yeah. Yeah. I mean, there's no Yeah, there's no big arguments. Oh, I was sorry. I had a point that I was going to make earlier. I totally forgot then you started talking than I remembered. I think I'm much more",
            "start": 1715.68
        },
        {
            "text": "I mean, there's no Yeah, there's no big arguments. Oh, I was sorry. I had a point that I was going to make earlier. I totally forgot then you started talking than I remembered. I think I'm much more interested. I think you you talk about is this compelling? Is is Ellie story compelling? And I don't think it necessarily was nailed by the end of this, but I'm so interested in Owen and in Mel and in Abby and in Isaac and in all these characters. I definitely want to go back to that. So, I do this thing that speaks of volumes for like how they're setting up the third season. Like when I see Owen, I'm like I want to know who he is. This is cool. I want to see what their world's like. I want to see their fight with the Sarah five and we're going to get that. But it's back to the thing you raised here, right? And it's also the, you know, conundrum and quagmire that we all know from the walking dead, right? Of just like, okay, but for a mainstream audience, is this not having those answers",
            "start": 1760.76
        },
        {
            "text": "here, right? And it's also the, you know, conundrum and quagmire that we all know from the walking dead, right? Of just like, okay, but for a mainstream audience, is this not having those answers and not knowing who they are and this that the other and qu if they if they are even questioning like we are here, is that enough that they're going to come back for a season 3? Are they going to be like, \"Ah, I didn't love season 2, so I'm not even going to tune in. They're like, here's really good or something like that.\" We'll see. We'll have not our problem, obviously. Just I think H I think HBO the HBO mark carries a lot of weight, though. I do think HBO does such a good job of putting these shows in front of you and treating them like they're a premium piece of like good show, not I don't want to say content, but like a good show that I think they'll get a majority of people back. Yeah. Again, to that point, it's tough because they're not going to have Joel for the next one. Like they",
            "start": 1795.36
        },
        {
            "text": "want to say content, but like a good show that I think they'll get a majority of people back. Yeah. Again, to that point, it's tough because they're not going to have Joel for the next one. Like they had Joel for this. And I do think that's another reason why the story happened the way it did is we don't get Owen and Mel and them in this part of the game. We get Joel flashbacks. you know, we get a lot more time with the birthday stuff and just like with having to deal with even the patio and all that. So, I feel like that taking up quote unquote screen time of the season, the progressing the story forward stuff is uh tough because looking at it, it's like I feel like most people don't really like the main story of season 2, but they really liked the flashback stuff of season 2 that just take up uh took up a lot of the time. So, it's it's tough there. Whereas I feel like the Abbeby stuff, it's not flashbacks. It's all new story. So I feel like it's going to be a little a lot cleaner",
            "start": 1831.36
        },
        {
            "text": "take up uh took up a lot of the time. So, it's it's tough there. Whereas I feel like the Abbeby stuff, it's not flashbacks. It's all new story. So I feel like it's going to be a little a lot cleaner actually to to get there. But to Greg's point, like will people show up? I don't know. I think they will. I I definitely think that they will. I think they should, too. Especially talking about Gia, who's who is who I'm we're hypothesizing about. Yeah. I I I think for me and and you know, in my household, having Danielle's watched this whole thing with me, she enjoyed it. Um she's very excited. She likes Caitlyn De and she loves Jeffrey Wright. And so I think putting those two characters on screen for me. I know that they might not be they're not Hollywood A-listers. Not going to certainly not going to appear in Fantastic 4's first steps. Maybe they do. Who knows? That'd be amazing. But for me, these are actors actors and I'm very very excited to watch them share screen time together in",
            "start": 1870.0
        },
        {
            "text": "going to appear in Fantastic 4's first steps. Maybe they do. Who knows? That'd be amazing. But for me, these are actors actors and I'm very very excited to watch them share screen time together in season 3. And I think Danielle is as well. Yeah. Uh Calvin Perez says, \"Now that we're done, I think Isaac as the alternate point of view this season was a mistake. It took up real estate for Ellie when he could have been pushed uh to the next season.\" Honestly, I kind of agree there. Like I I do think that that was one of the We didn't even know about him yet in the game or know him yet in the game. Yeah, I do think that that was a misstep because I I feel that we should have focused more on Ellie's story in Seattle whereas like the WLF stuff that is a next season thing. That is Ellie or Aby's story. And like I get that they it only makes sense to me because they also introduced the Sarah fights more hardcore here than they did. I do think that introducing um Isaac and going back into his",
            "start": 1909.12
        },
        {
            "text": "story. And like I get that they it only makes sense to me because they also introduced the Sarah fights more hardcore here than they did. I do think that introducing um Isaac and going back into his stuff as a setup in this season is going to allow hopefully for more clever interactions in the next season. And I think that is something that I'm hopeful for because the game doesn't really interact story to story as much as I expected it to. You see, yeah, I would disagree with that comment though. I think Isaac's an incredibly compelling character and I think I think the the compelling characters from the story maybe don't necessarily translate over and this is exactly what we're talking about, right? I wanted more of him. I wanted more of that dynamic. Like I wanted more of what's going on in the thing. I wanted I wanted I want way more of that story and way less of Ellie getting rained on and you know having to sacrifice all of her friends to go on this revenge kick that we all know",
            "start": 1948.16
        },
        {
            "text": "in the thing. I wanted I wanted I want way more of that story and way less of Ellie getting rained on and you know having to sacrifice all of her friends to go on this revenge kick that we all know she shouldn't be on. I think their point though is their hope would be sacrificing Isaac would get you more of Ellie and make you care more. I know you I know you don't. And there's not more there. There's no more meat on that bone. Let's be perfectly honest, right? Like it's just she's mad because Joel's dead now. She's going to go kill these people. how hard I mean, you know, seven seven episodes later, you know, she's that one friend that you're just like, the party's over. You know, we can't drink anymore. We got to go home at a certain point. I really like Jeffrey Jeffrey Wright in this as well. But I and I think obviously they they put it in there for backbone, right? Because if Ellie washes up on Sarifi Island, there's this explosion. They don't like there's just so much of not",
            "start": 1986.8
        },
        {
            "text": "as well. But I and I think obviously they they put it in there for backbone, right? Because if Ellie washes up on Sarifi Island, there's this explosion. They don't like there's just so much of not knowing, let alone also I think introducing Jeffrey, right? To your point, he may not be Mr. Fantastic. He's just Commissioner Gordon. It does give you an avenue for promotion of season 3 of well he's here he's and you liked him a lot and you saw what you did here we gave you a bunch of interesting tidbits right even the end here in this episode right where he's talking to his general or whatever and she's just and he word from Abby and they go into this whole thing I was like why is he asking about Abby right he's talking about her crew I'm like oh okay they're doing this so we as a viewer would be set up they're like wait why isn't Abby with why isn't Abby doing the assault or whatever you're planning yeah uh CJ spliton says season two HBO slump House of the Dragon WW and this Westworld.",
            "start": 2024.0
        },
        {
            "text": "be set up they're like wait why isn't Abby with why isn't Abby doing the assault or whatever you're planning yeah uh CJ spliton says season two HBO slump House of the Dragon WW and this Westworld. Westworld. Westworld season 2 was so bad. House of the Dragon season 2 rocked. What are you talking about? Oh, West I never I never watched season two of House Dragon, but Westworld season 2 was a You did season two? I think so. That just come out. I mean, at least a year ago, not I've only seen I only remember seeing season one. Yeah, cuz I if we don't if we didn't review it, I I probably didn't make it a point to watch it. But yeah, Westworld was Westworld season 1 was one of the best seasons of like sci-fi television HBO's ever freaking done. And then season two, you're like, \"Huh, they really dropped the ball on that one.\" And then season 3 was weird cuz like Aaron Paul got involved in all that stuff, but whatever. Also, personally, I would not call this a slump at all. I do not think",
            "start": 2060.64
        },
        {
            "text": "dropped the ball on that one.\" And then season 3 was weird cuz like Aaron Paul got involved in all that stuff, but whatever. Also, personally, I would not call this a slump at all. I do not think it's as good as season criticizing it and saying it's not as good as season one, but I still enjoyed this ride. I was looking forward to the show, everything. I'm I'm looking forward to next everything every week, and I'm looking forward to next season for sure. I I think here's where I'm at with this. I would bet that if season 2 of Last of Us was 20 episodes and it just covered the entirety of the game, I think I'd be in love with it. Absolutely. I just think that it being split up this way, there's no way this could have lived up to season one. I think that's actually impossible just because of how incomplete part one of a multi-part story is. It's tough though because this is an act two, right? So like you know you have you look at trilogies and the act two is either the strongest or the",
            "start": 2104.24
        },
        {
            "text": "how incomplete part one of a multi-part story is. It's tough though because this is an act two, right? So like you know you have you look at trilogies and the act two is either the strongest or the weakest act in most of them, right? Hopefully this is the weakest act and the third the third act of this whole thing is going to really you know be a banger of some sort. But yeah, I mean I I almost don't even see it that way. Like I really I look at Last of Us 2 as a threeact thing that is like a complete See, I look at it I look at season one as act one, season two or this as the middle part of it. By the time they get to the theater, that's three. And then four is the epilogue where she has to go down and do what she's got to do in my opinion. But I also don't again remember the game very very poorly. Uh so I don't remember the experience completely at all. Birdman 13 says, \"Ellie's story in part two was always lacking plot and character development. Aby's stories was more of a journey",
            "start": 2141.68
        },
        {
            "text": "poorly. Uh so I don't remember the experience completely at all. Birdman 13 says, \"Ellie's story in part two was always lacking plot and character development. Aby's stories was more of a journey story with more plot and character change. It was the much more interesting story in my opinion, as I've already said a couple times.\" I completely agree with you. Um that's all we got there. Any final thoughts, Greg? I enjoyed the ride. Like I said, I think we're being I'm being critical of this last episode and maybe Ellie's journey, but yeah, I enjoyed the ride for sure. It did what it's supposed to. Season 1 was nearly perfect, if not perfect, right? So, it'll be interesting to see what they do with this next one. And again, all the questions we had even about this one of how you going to do it? What are you going to break it up? What does a season 3 and possibly season 4 look like? Yeah, Nick. Same for me. Uh enjoyed it. It's a beautifully made show. Uh it's full of great moments.",
            "start": 2184.48
        },
        {
            "text": "to do it? What are you going to break it up? What does a season 3 and possibly season 4 look like? Yeah, Nick. Same for me. Uh enjoyed it. It's a beautifully made show. Uh it's full of great moments. Everyone should watch it if you're on the fence. Uh and I'm excited for the next season. I'm excited to be on that ride with Abby. Yeah. Yeah. Are you excited about July 11th? Uh, so much so excited that HBO is doing the thing where you can watch the trailer. Have you seen that? If you go to HBO, like if you go on your app on TV or whatever, they have the trailer for you. Go watch the trailer. And I was like, D, go watch this. And man, I'll tell you what, when your wife's not into something, it really it really is a web. Like, she goes, this is what she said. She watched the whole thing. She goes, is that dog CG? I was like, well, yeah, but like he's got a cute ear. She's like, \"Yeah, I'll pass on that one.\" Just walk out of the room. It's like, \"Damn it.\" Very sad. My My final thoughts",
            "start": 2219.36
        },
        {
            "text": "goes, is that dog CG? I was like, well, yeah, but like he's got a cute ear. She's like, \"Yeah, I'll pass on that one.\" Just walk out of the room. It's like, \"Damn it.\" Very sad. My My final thoughts on this are I I really love the show. I think that the game does a lot of things better. I think the show does some things better. I'm really bummed at how it's being split up because I think it's really not going to do a service to the overall experience for for the game. But can't wait for season 3. Um let us know in the comments below what you think of The Last of Us on HBO. Uh after this, we're about to do our Subway Surfer stream. This the three of us with Roger Picorny. It's about to be a blast. Uh but until next time, I love you all. Goodbye.",
            "start": 2257.36
        }
    ]
}