{
    "id": 14058,
    "video_id": "4IspwDv1Aq0",
    "show_name": "Highlights",
    "hosts": [
        "Blessing Adeoye Jr.",
        "Mike Howard"
    ],
    "title": "$50?! In This Economy?!",
    "description": "From KFGD: https://www.youtube.com/watch?v=hQ6IUYkx2f8&t=1261s  Wishlist Now!\nEmpyreal Steam Page - https://nwzo.io/click/dzexr/\nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299\nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\nThis episode is sponsored by BetterHelp — go to http://betterhelp.com/kindafunny to get 10% off your first month.\"\n\nFOLLOW US ON EVERYWHERE!\n---------------------------------------------------  \nYouTube: Youtube.com/KindaFunnyGames\nTwitch: https://www.twitch.tv/kindafunnygames\nPatreon: https://www.patreon.com/kindafunny/\nTwitter: https://twitter.com/KindaFunnyVids\nInstagram: https://www.instagram.com/kindafunnyvids/\nTikTok:  https://www.tiktok.com/@kindafunnygames?lang=en",
    "published_at": 1746746900,
    "duration": 806,
    "transcript_chunks": [
        {
            "text": "Story number three, Mafia, the old country promises a return to the old ways and less openw world bloat. This is Michael Mcurder at Polygon. And you know what? How much time have we got? Uh, I was going to say let's live react, but let's maybe just play the trailer in the background. Watch it as we read through the story that breaks things down. 2K Games and developer Hangar 13 revealed a longer look at gameplay from Mafia: The Old Country on Thursday, showing how the origin story for the Mafia franchise stands apart from the open world organized crime competition. In fact, Hangar 13 is hinting strongly that it has no intent in intentions to make Mafia: The Old Country your next forever game. Instead, the game's creators called The Old Country, quote, \"a focused, linear experience that combines quality storytelling, authentic era immersion, and a refined take on the familiar mafia gameplay.\" Hangar 13 President Nick Baines said in a news release that the smaller, more linear approach",
            "start": 0.08
        },
        {
            "text": "quality storytelling, authentic era immersion, and a refined take on the familiar mafia gameplay.\" Hangar 13 President Nick Baines said in a news release that the smaller, more linear approach allows us to deliver a story that's gritty, grounded, brutal, and emotional. Further reinforcing the smaller, less bloated design of Mafia: The Old Country is this statement from the president of Publisher 2K, David Ismier, who said, quote, \"We think there's a large audience for compelling stories that don't require massive time commitments.\" Ismalier is is Mailor said uh that the old country quote can easily complement the other more persistent games our players also love and engage with on a more consistent basis end quote. The strongest evidence of Mafia: The Old Country scope is its price. 2K is selling the base game for $49.99. There's a deluxe edition that costs $59.99 and includes a bunch of extras naturally, but the asking price is certainly atypical of AAA game releases in 2025. So, if",
            "start": 43.2
        },
        {
            "text": "selling the base game for $49.99. There's a deluxe edition that costs $59.99 and includes a bunch of extras naturally, but the asking price is certainly atypical of AAA game releases in 2025. So, if you're in for a leaner, more classic mafia experience, check out the newly released gameplay video that shows protagonist Enzo Favara as he takes the oath, works his way up uh Don Teresi's crime family, and shoots up 1900's Sicily. Mafia: The Old Country is coming to PS5, Windows PC, and Xbox Series X on August 8th. Bear Courtney, you're the mafia leader here. The godfather. You're the godfather. the the boss. What you need today, Poppy. Said what you need today, Poppy. Oh, man. He's doing it. He's doing it. Tell me what you think about this news. Uh I I I adore this. Uh everything they're saying, uh I think is um the right path for another mafia. I'm honestly still to this day dumbfounded that Hangar 13 is still around. They came out with Mafia 3 back in I I can also hold I won't make",
            "start": 88.16
        },
        {
            "text": "saying, uh I think is um the right path for another mafia. I'm honestly still to this day dumbfounded that Hangar 13 is still around. They came out with Mafia 3 back in I I can also hold I won't make this uh um they came out with Mafia 3 back in 2016. It was like my first year I think at IGN and it came out to a lot of shrugs. I still hold uh true that the story and the vibe of Mafia 3 is like top tier from the last generation of consoles. The openw worldness of it though was very uninspired and at times bad um a lot of the times bad. But if you shifted through that you got something really special from the studio. Hangar 13, that was their first uh Mafia game uh that they made, right? The other Mafia games were 2K check. Um and so that was a lot of learning from them and they took a lot of, you know, they they built off of a lot of what Mafia 2 was, which was much more open world, a bit more of that GTA kind of vibe. Yeah, Mafia was always a GTA like GTA clone for me. That's why I",
            "start": 144.24
        },
        {
            "text": "of, you know, they they built off of a lot of what Mafia 2 was, which was much more open world, a bit more of that GTA kind of vibe. Yeah, Mafia was always a GTA like GTA clone for me. That's why I loved it so much. But Mafia 1, and this is why I highly recommend for people if they want to get a taste of kind of what the scope of this game is probably going to be, especially seeing from these trailers, go play Mafia 1, the uh definitive uh edition, which is the remake of the first Mafia that Hangar 13 worked on. And I think you're going to get clued in on like the scale, the scope, the length of the game. Um, and that remake is also like really freaking good. And that was one that like they brought in new actors for it and all this stuff. Like that is 100% worth your time. If you're excited for a new mafia uh and you want something that's a bit more of like the classic mafia you know and love before we go to the old country, uh I highly recommend uh playing that cuz it's also it's not",
            "start": 196.8
        },
        {
            "text": "for a new mafia uh and you want something that's a bit more of like the classic mafia you know and love before we go to the old country, uh I highly recommend uh playing that cuz it's also it's not that long too. And I'd be if this is 50 bucks and it's not open world and it's a bit more of like that linear stuff that's kind of like it presents like it's open but not really. Um and it's like 8 hours. [ __ ] yeah, man. They do so good in story and if that's what they're focusing on like that's going to be a contender for me. Wow. So I should start shifting my mind to more of like a an uncharted experience. You think cuz like I am think I I go to Mafia 4 a GTA like clone. I want that open world experience. I like that. I mean that was only two and three. Yeah. Like Mafia 1 is not that really. Um, and so yeah, I would I would say if it it's like if GTA presentation had a baby with linearity of Uncharted, I guess, is kind of the vibe there. So, you're saying that this game is going to be",
            "start": 244.48
        },
        {
            "text": "Um, and so yeah, I would I would say if it it's like if GTA presentation had a baby with linearity of Uncharted, I guess, is kind of the vibe there. So, you're saying that this game is going to be like GTA combined with Uncharted, the greatest video game of all time. Let's [ __ ] go. We did it. We did it. We created the dream video game for you guys. Story number. Actually, before I actually move on, because we should shout out the $50 price point. That's wild. That's wild. Yeah. Taking a chance. very exciting. This this goes back to what I was talking about yesterday when we were talking about EA and how EA was was saying that like you know the thing about value which is PR speak but also like nice PR speak I guess as far as what they're saying. Uh I think that a lot of publishers right now are probably looking at the prices of their games and going how do we take advantage of a situation that is in flux right now? Right? Everybody's moving up to $80. Hey like Mafia coming out at 50",
            "start": 288.4
        },
        {
            "text": "now are probably looking at the prices of their games and going how do we take advantage of a situation that is in flux right now? Right? Everybody's moving up to $80. Hey like Mafia coming out at 50 bucks is going to be so [ __ ] good for it. I think I want a AAA experience that like, you know, I'm going to be able to fall in love with that. I'm going to get like a, you know, third person action game. Oh, 50 bucks. Yeah, I'm going to buy that over whatever random $80 game is on the shelf right now. Um, I hope we see quite a bit of that. I hope we see people people exploring the scale. Explore the scale a bit more. It will be exciting. I want to see more Mafia. I'm not fully sold on the Old Country yet, so it'll be interesting to see once we get up there. What's it like? Do I vibe with this one? This episode is brought to you by Imperial. We've told you all how important it is to developers to wishlist games that you're interested in. So, if this sounds cool to you, make sure you",
            "start": 333.84
        },
        {
            "text": "this one? This episode is brought to you by Imperial. We've told you all how important it is to developers to wishlist games that you're interested in. So, if this sounds cool to you, make sure you wishlist it. Imperial is a complex, featurerich action RPG where you'll be sent to a planet in a far-off corner of the galaxy to explore an imposing monolith. As an elite mercenary, you'll join the expedition tasked with unearthing the secrets of the monolith and face off against the deadly automatons within. In Imperial, you'll explore four vastly different quadrants of the monolith, accessible only by using mysterious artifacts known as cardoggrams. Each cardgram affects which enemies, boss fights, and loot will appear when you enter the monolith, so no two excursions will be the same. Find even more cardoggrams to explore by looting defeated enemies, or buy them from other players online at the trading post. Imperial features three weapon archetypes. The fast-paced acrobatic glaive, the",
            "start": 376.24
        },
        {
            "text": "more cardoggrams to explore by looting defeated enemies, or buy them from other players online at the trading post. Imperial features three weapon archetypes. The fast-paced acrobatic glaive, the defense focused mason shield, or the devastating cannon with a range of customizable skills and abilities that can make short work of the awaiting automatons. Your weapons and abilities can be changed before any excursion into a cardoggram. So, if a loadout isn't working for you, you can mix things up to create the perfect play style. Help the members of the expedition in deep branching quests and aid other players in asynchronous multiplayer. Get ready, mercenaries. The monolith awaits. Imperial is available May 8th on PC, Xbox Series X and PS5. Wishlist now. It helps so much. Wishlist Imperial. This episode is brought to you by Auraframes. If you haven't called your mom in a while, here is your reminder to do it. But then you want to go above and beyond. Mother's Day is coming up and I have",
            "start": 417.84
        },
        {
            "text": "This episode is brought to you by Auraframes. If you haven't called your mom in a while, here is your reminder to do it. But then you want to go above and beyond. Mother's Day is coming up and I have the perfect gift. idea. Aura Frames are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preload it with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special, they'll use it every day. Greg, Kevin, and a ton of people here at Kind of Funny are obsessed with their Aura frames. It takes about 2 minutes to set up a frame using the Aura app. So the next time you need to call your mom, you could also send her a new pick of you from that trip that you're telling her all about. Ara has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting oruraframes.com to get $35 off plus free",
            "start": 464.56
        },
        {
            "text": "that trip that you're telling her all about. Ara has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting oruraframes.com to get $35 off plus free shipping on their bestselling Carver Matt frame. That's a rare frames.com, promo code kind of funny. Support the show by mentioning us at checkout. Terms and conditions apply. The show is sponsored by BetterHelp. It's super great that mental health awareness is growing, but there's still progress to be made. 26% of Americans who participated in a recent survey say they have avoided seeking mental health support due to fear of judgment. We can do better. No reason for fear. BetterHelp has over 10 years of experience matching people with the right therapist from the diverse network of more than 30,000 licensed therapists with a wide range of specialties. Some of my best friends use BetterHelp and love how helpful it can be for learning positive coping skills and how to set boundaries. It",
            "start": 505.76
        },
        {
            "text": "30,000 licensed therapists with a wide range of specialties. Some of my best friends use BetterHelp and love how helpful it can be for learning positive coping skills and how to set boundaries. It empowers you to be the best version of yourself. It isn't just for those who've experienced major trauma. If you're thinking of starting therapy, give BetterHelp a try. It's entirely online, designed to be convenient, flexible, and suited to your schedule. We're all better with help. Visit betterhelp.com/kindfunn to get 10% off your first month. That's betterhelp hp.com/kindofunn betterhelp.com/kindaffunn because I do have a footnote here again. This is put the little note there. This is this is more from the Cojima interview. I'm sourcing directly from VGC reporting and I'm just going to call this one Roger did it everybody. I'm reading directly from video games chronicle here. How did you approach building the soundtrack for DS2? That was one of the questions written in there during the",
            "start": 551.36
        },
        {
            "text": "this one Roger did it everybody. I'm reading directly from video games chronicle here. How did you approach building the soundtrack for DS2? That was one of the questions written in there during the interview. Cojima responds, \"For the soundtrack, we worked with Levik for Forcell and I've also put WoodKit songs into the game. All the other musicians are those that I listen to on a daily basis and whom I like. Same as with actor casting. I contact them directly and I ask them if we can use their songs or sometimes they tell me they want to write a song for the game and we go back and forth. I was listening to Carolyn Polichek last year and became a big fan of hers. After I put that on my Instagram, she contacted me and then we DM'd. We kept in touch and eventually met up in Paris and that's when she told me she wanted to write a new song for Death Stranding 2. She works very fast. You heard her song when you saw the plate gate. It's called On the Beach. Oh my god. No way. No way.",
            "start": 602.0
        },
        {
            "text": "that's when she told me she wanted to write a new song for Death Stranding 2. She works very fast. You heard her song when you saw the plate gate. It's called On the Beach. Oh my god. No way. No way. Roger. Roger is joining us on the set right now. The Tastemaker. The Tastemaker. Roger, how does it feel? Um, it's emotional. Like, it's weird. I I mean I No, for real. Like, I I woke up this morning. I saw I saw that um someone tweeted out that that little uh part of the article right there. And I was like, \"Okay, cool.\" And I I freaked out. I I went ranted and I started reading it and then I got choked up when I read On the Beach. Like the fact that it it it is apparently a title song. Like literally the title literally the title like making a James Bond song is right. This is a big deal. Yeah. No, this is this is incredible. I mean really quick just to catch anyone up that doesn't know uh back in August uh you, me, and Leonza went to Japan. Uh you and I were going to go see Astrobata.",
            "start": 647.2
        },
        {
            "text": "No, this is this is incredible. I mean really quick just to catch anyone up that doesn't know uh back in August uh you, me, and Leonza went to Japan. Uh you and I were going to go see Astrobata. Uh and then while we were there we went to Cojima Productions. We said hi to Cojima and we brought him a bunch of gifts from everyone in the office. Of course. Mike, what did you bring? I brought the official Snowike Mike DVD. Yeah. I mean, hit me up. Did you watch it? I need to know. You might be in the game. We never know. We don't know. We don't know. A lot a lot of people hit me up and they were like, \"Did you ask Cojima if you watch the Snow Egg?\" I'm like, \"How much time do y'all think I got to talk to Cojima? I'm there to play a game.\" Uh, so yeah, we brought him a bunch of gifts and I made sure since I was building out the box of all the gifts to put Caroline's album right at the top. Just kind of seated that right there. Uh, because Caroline Polo is one of my favorite artists of all",
            "start": 694.4
        },
        {
            "text": "sure since I was building out the box of all the gifts to put Caroline's album right at the top. Just kind of seated that right there. Uh, because Caroline Polo is one of my favorite artists of all time. She's incredible and I knew that they would for sure get along and it would be his type of music. Uh, so I put that right at the top. And as he was looking through it, I made sure to be like, \"Hey, Cojima, you would like this one specifically.\" And he kind of looked at me, looked at it, and just kind of put it aside. And I was like, \"Okay, that's the end of this.\" And then a few days later, he just posted on his Instagram that he's listening to her, and then more and more and more, and they followed each other, and then they were messaging each other, and then they were doing Zoom calls, and then they're in Paris, and they're hanging out, and then now she's in the game. So, um, yeah, I'm I'm super happy. And I wrote in the little message that, uh, she would make a great theme song for",
            "start": 733.76
        },
        {
            "text": "then they're in Paris, and they're hanging out, and then now she's in the game. So, um, yeah, I'm I'm super happy. And I wrote in the little message that, uh, she would make a great theme song for OD. So, I got I was close. I was If I wrote DS2, I would have been able to. You're [ __ ] crazy, man. So closer. Um, so yeah. No, it just it just makes me really emotional. I'm very excited and I'm excited to hear the song, man. Holy [ __ ] I'm sure it's going to be really great. I like it. Sadly, I can't say anything more because I'm not allowed to talk about licensed music. Uh, but yeah, thank you so much, BGC, for the reporting. And yeah, come on, man. Let's [ __ ] go. You did it, Roger. Roger, that's crazy. I just want a special thanks in the credits. That's all I need. Give this man a special thanks. That's amazing. That's amazing.",
            "start": 763.28
        }
    ]
}