{
    "id": 14126,
    "video_id": "a8nA8IdPKxA",
    "show_name": "Kinda Funny Podcast",
    "hosts": [
        "Nick Scarpino",
        "Andy Cortez",
        "Joey Noelle",
        "Blessing Adeoye Jr."
    ],
    "title": "WTF is a Labubu?! - The Kinda Funny Podcast",
    "description": "Go to https://bit.ly/m/KindaFunnyXSubwaySurfers?r=qr to get special rewards and download it now!\n\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\nWe almost got taken by counterfit Labubus. This is our story. \n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\n00:00:00 - Start\n00:00:45 - Housekeeping\n00:01:35 - Bless thinks the cleaners are stealing!\n00:10:40 - Joey asks about the Doritos bag?\n00:18:00 -  SPRITE TEA REACTION!\n00:21:50 - Nick’s Silver Alert and  other Shitty Stories\n00:33:22 - What is up with Roger?\n00:40:00 - LaBUBU\n00:49:00 - We discuss Andy’s inappropriate sweater\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1747690311,
    "duration": 3344,
    "transcript_chunks": [
        {
            "text": "[Music] [Music] Every podcast, every podcast here is hurting cats. Every podcast is all of us try to be professional until something piqus our curiosity and then it goes completely off the rails. And ladies and gentlemen, that's what the kind of funny podcast is here for. where each and every week four sometimes five sometimes three best friends gather around this table each bringing topics for your amusement that's right blessing Jr. is joining us right now and I said I want to bring topics back to the show. You've got a topic. Kevin has a topic for us. I have a topic and Joey I have a topic for you about Andy sweatshirt. But we're going to get to that a little bit later. Housekeeping right now. Ladies and gentlemen, Mission Impossible in review. The final reckoning will continue this week on Thursdays. Will Ethan Hunt die or will he just continue to dye his hair more? Ethan Ethan Hunt. I've been thinking about it. I can't wait. Ethan Hunt is different. I'm so upset that I missed",
            "start": 0.04
        },
        {
            "text": "week on Thursdays. Will Ethan Hunt die or will he just continue to dye his hair more? Ethan Ethan Hunt. I've been thinking about it. I can't wait. Ethan Hunt is different. I'm so upset that I missed this. Tune in this Thursday after Games Cast to find out. Also happy shout out to our Patreon producers James Hasting, Carl Jacobs, Omega Buster, and Delaney Twinning. Uh we are here for you guys. And today we're brought to you by Subway Surfers and Factory, but we'll talk about that a little bit later. Speaking of housekeeping. Yeah, Blessing has Andy's having issues. He's watching the podcast. You're on. I don't know why I just popped up. Blessing has a theory. Which theory about the housekeepers? Oh, yes. What what is this conspiracy problem that's happening right now? Because I So during the Deathstrating 2 stream, I presume they bought a big box of all like the Lays chips, which I've asked them never to buy again. I was wondering where those came from. Yeah, I don't. I've gained 5 lbs",
            "start": 53.76
        },
        {
            "text": "Deathstrating 2 stream, I presume they bought a big box of all like the Lays chips, which I've asked them never to buy again. I was wondering where those came from. Yeah, I don't. I've gained 5 lbs because of that box. It has been like very detrimental because when they're that small, you just eat like I just like I'll just do one bag of Cheetos. I just did two bags of of Fritos right now. Just took them to the face. So, the thing is uh that that box has lasted through the week and on Friday I looked in there and I saw a Lays a bag of Lays potato chips and I was like, \"Oh, I haven't had one of these yet.\" And I saw that it was the last one, but I als I already ate multiple bags of chips. So, I'm like, \"I'm not going to eat it right now.\" And so, I took it and I put it on my desk and I was like, \"I'll have it as a treat when I get in on Monday.\" Like a secret Snickers. Exactly. Like a secret Snickers. And then I got in and the Lays was gone. And I'm not going to blame anybody at this",
            "start": 100.32
        },
        {
            "text": "like, \"I'll have it as a treat when I get in on Monday.\" Like a secret Snickers. Exactly. Like a secret Snickers. And then I got in and the Lays was gone. And I'm not going to blame anybody at this company because I think it's the cleaners. You think the cleaners are doing it? I think the cleaners have kids. They do have kids that come through and take things cuz also here's another complaint I have. And I I respect the cleaners. I love the clean cleaners. We're not talking [ __ ] about the cleaners. I'm not talking [ __ ] about the cleaners. We're not talking [ __ ] about the cleaners. They're very lovely. But is there a way I can keep them away from my desk? I mean, why what do they do to your desk? They move They move things. They clean your desk. Yeah, but like sometimes I'll come back and toys will be disassembled. I sound insane saying it shouldn't be as big of a problem. I promise I'm not like the kind of person that's like, \"Oh, don't touch my action figures.\" I'm not that",
            "start": 140.16
        },
        {
            "text": "back and toys will be disassembled. I sound insane saying it shouldn't be as big of a problem. I promise I'm not like the kind of person that's like, \"Oh, don't touch my action figures.\" I'm not that kind of person. You're creeping up to the line there. You're creeping up to the line. Come back and like apart and I'm like, why? I feel like I need like a more tangible. You're not doing a whole lot to fight. He's got a Goku. my case. No, cuz I have a So, I have a Sonic plushy, right? And those and there was one day I came back and it was on Cool Greg's desk and I was like, why why do you need to move the Sonic plushy? Cuz they clean your desk. But like, can you wipe around? Oh, they got to lift it up. Clean. Cleaning your desk. Well, you just have to wipe around. And also, like there'll be times where I come back and my laptop's unplugged. Not even times. Most of the time I come back my laptops unplugged from like a Friday or Monday. Interesting. I'm just saying does anybody else have",
            "start": 176.8
        },
        {
            "text": "times where I come back and my laptop's unplugged. Not even times. Most of the time I come back my laptops unplugged from like a Friday or Monday. Interesting. I'm just saying does anybody else have this beef? Joseph Griggsby in the YouTube chat says don't touch my drums from step bros. Nick, I want you to know that I absolutely hate that I have to sit here and be like, \"Fuck, is this actually warrant messaging the house?\" No, it does. But like 100%. Where is the line? Cuz cool Greg had Legos and they kept getting broken. The line is the line. I'm going to say my Lego flowers sometimes have a petal that falls off. But I blame the Lego flowers. Not I'm I'm going to say something that's going to sound like it's an incredibly insulting thing to say to all of the people that work here. And I don't mean this to sound bad, but if y'all just cleaned your desks occasionally, this wouldn't be a problem. Oh, I'm down to do that. We have a clean desk policy. We do have a clean desk policy.",
            "start": 227.04
        },
        {
            "text": "I don't mean this to sound bad, but if y'all just cleaned your desks occasionally, this wouldn't be a problem. Oh, I'm down to do that. We have a clean desk policy. We do have a clean desk policy. Nobody adheres to that. Greg Miller, biggest offender of that. How many monitors can Greg put on his desk? I think Tim right now potentially is a contender. No, between Andy and Tim and your desk on his desk. It's weird because he never does. You know what? I never look at I never look at Tim's desk cuz it's not it's not on my route. Same. It's not on the way to anything. You know what I mean? Like if you ask me, \"Can you drop me off a Tim?\" I'm like, \"Dude, that's not on my way home.\" Like, it's a really tough commute for me. I get it. Wait, real quick. I don't want to leave this conversation without mentioning Nick's desk cuz for a while it was a normal desk and then maybe like 4 months ago it was like oh [ __ ] is Nick going to quit cuz he's clear off everything on his desk and he's just",
            "start": 267.12
        },
        {
            "text": "mentioning Nick's desk cuz for a while it was a normal desk and then maybe like 4 months ago it was like oh [ __ ] is Nick going to quit cuz he's clear off everything on his desk and he's just he's got a clip on the side where his work gloves go and that's it and it's like oh [ __ ] is he leaving? But me and Nick's schedules are like we don't cross over whatsoever unless I force myself onto a KP like I did or else like everyone's out of the office and I have to go on Gamescast. Yeah. So like as I'm getting off of Games Cast, Nick is going onto a a screencast or a KP or a stream or something. So I there'll be weeks where I will not see this man in the office and I'll have the same response of like, does Nick still work? Did I miss a weekly meeting? Yeah. Legitimately I'm like, did I miss the memo that Nick isn't here anymore? You know, you know what it is? It's just that I got a monitor on my desk right now and it's just taking up so much of the real estate on my desk that I just can't",
            "start": 307.44
        },
        {
            "text": "memo that Nick isn't here anymore? You know, you know what it is? It's just that I got a monitor on my desk right now and it's just taking up so much of the real estate on my desk that I just can't I'm actually like at a point where I'm like do I have too many pens on my desk? Should I should I cut back some of the I have all those Nutter Butters still from that time that we almost broke Greg with the Nutter Butter prank in Kansas City or wherever we were. So RTX RTX I just like a clean desk. And again, I know that my level of OCD is like on a different level from everyone else's. Yeah. But like a clean desk. I like it. I like I don't I I don't like anything to be on my desk that I don't need. So, like I have a power, I have a mouse, I have some pens, I have one little uh uh coffee mug that I keep pens in, but it's also a coffee mug that that Joey and I are developing to potentially put out someday. So, I stare at that and that to me is like still working. So, you don't like whimsy?",
            "start": 352.48
        },
        {
            "text": "I keep pens in, but it's also a coffee mug that that Joey and I are developing to potentially put out someday. So, I stare at that and that to me is like still working. So, you don't like whimsy? It's not that I don't like whimsy, it's that I have a whole let's play lab for whimsy. So, like me and Mike, whenever something fun comes in or like Andy, someone comes in, we just go, we put it in there and it's fun and that's already getting cluttered and that's kind of where the clutter needs to go cuz I think it looks cool with the lighting and stuff like that. And we could always pair that back a little bit. But you have to also understand this. And again, I'm not throwing shade at anyone in this office. And I don't know because I don't even know what your desk looks like. Okay. You're You talk about Andy's talking about how Tim's not on his route at home or his room at work. You're in a different state for me. I don't see anybody's desk. I don't I sometimes I see Roger in Barrett's desk",
            "start": 390.72
        },
        {
            "text": "about Andy's talking about how Tim's not on his route at home or his room at work. You're in a different state for me. I don't see anybody's desk. I don't I sometimes I see Roger in Barrett's desk and that's about it. I never see Barrett's desk. I never see Barrett's desk. I see a little bit of Cool Greg's desk. way too much of Kevin at Andy's desk and Tim's Pokemon cards. That's all I see. He's built a wall of Pokemon cards up so I can't make eye contact with him anymore. And I'm real [ __ ] salty. I didn't even know he had Pokemon cards. Yeah. Oh, yeah. Exact. Well, he's got multiple. I'll give you some. Can I tell you? Notice. So, I feel like my desk used to be a lot I guess tidier or it didn't have as many like toys and trinkets and things like that, but the chachki. Chach keys. I learned what that was last week. Spell it. So, I I don't know how to spell it, but obviously it's something that I with a T. I remember it from Guardians of the Galaxy 2 when they're, you know, the",
            "start": 423.04
        },
        {
            "text": "I learned what that was last week. Spell it. So, I I don't know how to spell it, but obviously it's something that I with a T. I remember it from Guardians of the Galaxy 2 when they're, you know, the little chachki that he puts on his uh inside of the cockpit or whatever. And then Sage Ryan kind of brought it back into our lexicon when we went to the Nintendo store and she was talking about how she wanted to buy little things for Anthony Carboni and she bought a chachki and cuz Carbon kept saying, \"I have too many chachki.\" brought up this word several times and when we were in LA last week, me and Blessing goes, \"I got to confess something to you.\" When St. Giant kept on bringing up the word chachki, I just nodded and like agreed as if I knew what it was. I have no idea what went on. I've been scared like that multiple times. We have the the three contenders for best spellers. They're often saying that they're better spellers than everyone else. Can anyone spell the word Chsky? I'll",
            "start": 462.24
        },
        {
            "text": "been scared like that multiple times. We have the the three contenders for best spellers. They're often saying that they're better spellers than everyone else. Can anyone spell the word Chsky? I'll try. Who? I think I think someone spelled it correctly in the chat, so I'll I'll I'll verify. Go look. I didn't see it. I didn't see it. Go for it. You said it started with a T. It does. See, I wouldn't have guessed that. T. Yep. C H. Mhm. A. Nope. What? Already gone. All right. Am I done? You're done. You're done. You're done. Game over. Is chachki a word that's in the dictionary? Yeah. No way. Yeah. I mean, urban dictionary, maybe. Yiddish. Can we define a chachki? Can I get a definition? We'll look it up. The question is, can you spell the word chhatsky? Yeah, exactly. Kevin, don't let him out of this. You know what? It's like Schlotsky's I bet. Is it t I don't know what that is. You don't know what Schlotskys is. Okay. A small object that is decorative rather than strictly functional. A",
            "start": 505.12
        },
        {
            "text": "of this. You know what? It's like Schlotsky's I bet. Is it t I don't know what that is. You don't know what Schlotskys is. Okay. A small object that is decorative rather than strictly functional. A trinket. You never heard of Schlotskys. It's a restaurant. It's ak It's a burger. Not a burger. A sandwich place. It's like a That is I was thinking. I'm going to say TC H. You said A, right? That' be O. Oski. TC H O. Oh, this gets tough because is there another T? I'm going to say a T. Yeah. T H O T. Mhm. C. C. Yeah. C. T C H O T C H. K I E S. N. So close. K. K E. The question is, Joey, did you know it? I would have gotten. That's I would have gotten mixed up somewhere in the TCHK area. What a great word. What a great word. I hope that we have another chance to test their three best spellers to find out who is the best. The reason why I think why I got it wrong is like when Joey asked the question, \"Is it Yiddish?\" That's what really good spellers go, \"Oh, it's Yiddish.\" That means that",
            "start": 548.16
        },
        {
            "text": "to find out who is the best. The reason why I think why I got it wrong is like when Joey asked the question, \"Is it Yiddish?\" That's what really good spellers go, \"Oh, it's Yiddish.\" That means that the they, you know, the words are spelled usually like this or whatever. And I don't Here's a great excuse. I'm really impressed. But like, no one got it right. So, don't worry. You guys are still equal at this point. Kevin, can you look up some spelling B words? I don't We don't want to do a Well, yeah, we're not doing that right now. I mean, we can topic. We have topics for the show. I forgot my topic. I know what your topic is. I wrote it down. Oh, perfect. I wrote everyone's topic down. We're gonna start with my topic of the show. Can I have a subtopic? Absolutely. The blessings topic. Of course. Do you remember what blessings topic was? No, I'm going off of this current topic. Okay. This is a different topic. This will be your topic. The chips topic. The great chip conspiracy of 2025.",
            "start": 605.84
        },
        {
            "text": "Do you remember what blessings topic was? No, I'm going off of this current topic. Okay. This is a different topic. This will be your topic. The chips topic. The great chip conspiracy of 2025. When you walked into work this morning, did you per chance have a little breakfast bag of Doritos that you left by the printer? No. Okay. I haven't I don't eat the Doritos. I went to the bathroom today and I look over and there was, you know, these little tiny the little bags that Mike and Roger got for the Death Stranding thing, right? The ones that were stolen off, the little kids bag, like lunch bags. Yeah. Snack size or whatever. I look over and someone just and it it wasn't there Friday when I left. Someone just left a halfeaten bag of that which isn't sold cuz it's already a half bag at best. And I'm thinking to myself the same thing Joey is. What kind of a-hole would just leave this by the printer for me to see? And for the audience at home, the printer table is also right by the",
            "start": 639.76
        },
        {
            "text": "best. And I'm thinking to myself the same thing Joey is. What kind of a-hole would just leave this by the printer for me to see? And for the audience at home, the printer table is also right by the bathrooms. So it usually becomes like a gathering ground of things that people are dropping and picking back. Yes. Wait, so do we currently not know or are you I don't know. Oh, okay. No, I guess it's Mike. It has to be snow. I have great evidence because a little while ago I just mentioned I [ __ ] up and I ate Taco Bell because like I want I was like should I if I eat maybe it's going to make me tired. I was like, \"But if I go to the kind of funny podcast without eating for that long, cuz I haven't eaten anything all day until uh Last of Us podcast and I went out to go get Taco Bell.\" So it wasn't your It wasn't your Doritos. No. And it wasn't Well, Roger and I were having the discussion originally. We thought it could have been blessing. I would never do that, but we didn't. Based on the",
            "start": 680.16
        },
        {
            "text": "your It wasn't your Doritos. No. And it wasn't Well, Roger and I were having the discussion originally. We thought it could have been blessing. I would never do that, but we didn't. Based on the timing of the shows, we didn't think that it was you. You could pretty much guarantee that if it's not a flaming hot little baby bag of chip, I won't touch it. I mean, it's You want to talk about desks, right? We We can't We can't talk about desks without talking about Snowike Mike, who somehow moved his desk without anyone knowing. You allowed him over to the bathroom. Yeah. Yeah. And now is taking over, I'd say, a sizable amount of the office space in this office with Xbox uh themed Buzz set that he has yet to shoot on. Snowike Mike, I know you're in this [ __ ] room. Don't not respond to me. I can see you. I can see you over there. He definitely ate those chips. Those were his chips. Here he's walking. Those are his chips. What kind? Can I get a What kind of chips are they? Doritos. Nacho",
            "start": 723.28
        },
        {
            "text": "can see you. I can see you over there. He definitely ate those chips. Those were his chips. Here he's walking. Those are his chips. What kind? Can I get a What kind of chips are they? Doritos. Nacho cheese. [Laughter] When the when the question of this happened today? Today. They were there today. The question is nacho cheese. It was my This episode of KF Court is adjourned. We have figured out. We figured it out. It was the It wasn't that much of a exact thought. I'd like to request a ranking of desks. Not today. Not tomorrow. A ranking of desks. Mike's desk number one. Mike has a sofa. Hold on. He made the sound back there right now that he made the other day during the Death Stranding stream when I posted a video and sent it to Roger and Mike. And I'm going to I'm going to repost this clip so Kevin can hopefully bring it up because it's one of the funniest sounding things. What's up? Where are you posting it? I'm going to put it in assets. Yeah. Um because it's one of the funniest",
            "start": 766.72
        },
        {
            "text": "clip so Kevin can hopefully bring it up because it's one of the funniest sounding things. What's up? Where are you posting it? I'm going to put it in assets. Yeah. Um because it's one of the funniest things ever where him and Roger were laughing hysterically during this Death Stranding stream. They were trying to figure out what to eat for lunch. They could not decide on it. And they have a moment where Mike kind of I'll send Nugies through it in the chat as well on their Twitch if you guys want to watch that. Mike kind of Mike kind of like jumps at Roger cuz he goes, \"What are you going to get, Roger?\" And Roger goes, \"I'm probably a burger.\" He goes, \"Oh, you're going to get a burger.\" And Roger's like, \"Why do you [ __ ] ask it like that? Why'd you come and be like that?\" And they both laugh about it. And then the sound happens. And the sound is now in assets. Kevin, if you want to bring that up, cuz it's just We don't need a visual, right? No, we just need a visual. Wait, a",
            "start": 825.68
        },
        {
            "text": "both laugh about it. And then the sound happens. And the sound is now in assets. Kevin, if you want to bring that up, cuz it's just We don't need a visual, right? No, we just need a visual. Wait, a burger. Yeah, you're going to get a burger. [Laughter] I never want to hear that. That's the sound of walking sleep apnnea. I never want to hear that again. What the [ __ ] is that noise? He just he had the handheld mic right to his face and maybe forgot to put it away for a bit. But let's do one more time. Oh my god. Can we have it one more time, please? I hate seeing his heart rate also going. And that's what that's a noise he did a little while ago off mic where we're already moving on with the conversation. You just hear it's cuz he sat down. It took him It took him so much energy just to sit down in a chair. God bless you, Mike. I love it. The muscles are so sore from the walking, man. I mean, he walked for 48 hours straight. Yeah, give or take give or take 15 hours of old KFA",
            "start": 862.72
        },
        {
            "text": "to sit down in a chair. God bless you, Mike. I love it. The muscles are so sore from the walking, man. I mean, he walked for 48 hours straight. Yeah, give or take give or take 15 hours of old KFA episodes. 700,000. Also, I saw y'all got a lot of KF. Yeah. I'm not going to say they did they do a great job, but you and I did a lot of the heavy lifting of that. I just want you to know, Mike, y'all got Red Robin on that stream, right? I think I ordered Red Robin at the exact same time you guys did. Nice. Really? Yeah. Yeah. Yeah, cuz Red Robin got two orders and I like, \"Holy [ __ ] this is twice the amount of orders we ever get.\" Mike, I need you to just appeared on the Door Dash app. That's why chat keep getting mad at me. You like Red Robin? Uh, well, that was the reason why I ordered it is I don't think I've ever encountered anybody in my life that has mentioned Red Robin like in just a sense. I was about to offer to like introduce or to invite you to the Red Robin crew. Wait, we went",
            "start": 924.72
        },
        {
            "text": "I don't think I've ever encountered anybody in my life that has mentioned Red Robin like in just a sense. I was about to offer to like introduce or to invite you to the Red Robin crew. Wait, we went one time. Me and Katie really like Robin? Yeah, we all went as a company one time. It was before a movie. James and Elise. It was Blessing was still here for sure. Probably that probably didn't go. I think it was Scream. Didn't we take I don't think I've been to Red there once or was that Red Lobster? We just lobster. Yeah, Red Lobster has those [ __ ] I don't think I've been to Red Robin since 2013. Well, Katie and I really like Red Lobster. And there's one by our house. Wait, Robin. Robin. Sorry. Oh, Chad kept getting angry at me. You just let us know. I'm officially inviting you on a lunch date. We're going to go to a Red Robin. Oh, let's go. I'm going with Nick Dick. I'm sorry. I'm sorry. Chad kept getting angry at me, Nick, during during the Death Stranding stream. A lot of people",
            "start": 961.44
        },
        {
            "text": "date. We're going to go to a Red Robin. Oh, let's go. I'm going with Nick Dick. I'm sorry. I'm sorry. Chad kept getting angry at me, Nick, during during the Death Stranding stream. A lot of people going, \"Andy, why won't you go eat lunch with or eat dinner with Roger and Mike? Why won't you go join your friends?\" And it's because it's the studio is just far away enough from me. Oh, it's too far from you. Like I I'm not the the Daily City crew that can, you know, 4minute drive over. Like it's annoying. It's a lot It's a lot of stop lights. It's It sucks. And so that's I I kept telling Chad like I'd be there legitimately. I would have dropped by if I lived closer. So sorry to Mike and Roger for letting me down. Did you answer their phone call? Yeah, I answered Well, no, I didn't answer Rogers, but I called him right back cuz I noticed it a little too late. And that's when he realized that Mike had blocked him. Hell yeah. I I saw the call and I was just like I shook my hand my head. I",
            "start": 1002.16
        },
        {
            "text": "but I called him right back cuz I noticed it a little too late. And that's when he realized that Mike had blocked him. Hell yeah. I I saw the call and I was just like I shook my hand my head. I was like, I ain't answering this [ __ ] Oh, I I did answer that call. I answered both calls. I was on stream when that happened. Yeah. When he was calling everybody. Yeah. I got a text from Roger B and he was very sweet. He was like, \"Oh, sorry. Just wanted to call you because we're doing a thing with the super with the um chat.\" You think that he copy and pasted the same message,00 I almost replied to him and I I I was almost like, \"Don't text this number during non-work hours.\" Like that was almost what I told him. Michael, I need you to do me a favor. We're going to move on to Kevin's topic of the show right now. There is a Sprite that is in the refrigerator. Can you bring that to us with with as many glasses as people would like to try this Sprite? This was provided to us by Sprite. It is a",
            "start": 1044.96
        },
        {
            "text": "show right now. There is a Sprite that is in the refrigerator. Can you bring that to us with with as many glasses as people would like to try this Sprite? This was provided to us by Sprite. It is a Sprite/ iced tea and it looks god awful. And we are going to try that on this show as we continue to talk. It's a legitimate product. A legitimately. They hit They hit up Tim and Sprite was like, \"Would you like us to send some product?\" They sent us a can of Sprite. Oh, here we are. Okay. I love this. We're going to drink this. What does it say? Sprite. Sprite tea. Oh, wow. It says Sprite tea. So, it's like an Arnold Palmer almost tea, I guess. Doesn't it look good? It looks good, right? excited for this. Really good. You remember Tivana? Tivana is still That's what it looks like. They turned into Carvana. They switched to Carvana. Oh, that's a better Starbucks or they they're owned by Starbucks. I think Starbucks own T E J A V A T. Well, I know Starbucks owns a tea brand. I'm not sure if",
            "start": 1082.64
        },
        {
            "text": "into Carvana. They switched to Carvana. Oh, that's a better Starbucks or they they're owned by Starbucks. I think Starbucks own T E J A V A T. Well, I know Starbucks owns a tea brand. I'm not sure if it's that one or not. I think Starbucks like half tea, half coffee. I'm pretty sure Starbucks owns Tana. I think Starbucks owns everything. I used to work at Starbucks and they had I'm pretty sure they had Tana product. Smells like fruit fruity pills. Kevin, you are you going to try some of this? That's yours? Oh, uh, yeah, I would love to. Um, I don't know why this picture. I'm a Sprite guy. I'll fight a Sprite occasionally. You give me an ice cold Sprite with a little vodka in it. Yeah, Sprite should be mad at it. Yeah, it's got to have the vodka. There we go. Oh, that's different. That's different. This is what that reminds me of. All right, let's try this. Cheers, everybody. Happy Monday. Mike, do you want to try this? Cheers. Cheers. Let's go. I don't like the smell. Oh, damn. I",
            "start": 1124.88
        },
        {
            "text": "different. This is what that reminds me of. All right, let's try this. Cheers, everybody. Happy Monday. Mike, do you want to try this? Cheers. Cheers. Let's go. I don't like the smell. Oh, damn. I don't like that. I like it. Oh, I don't like that. Oh, I like it. Those don't go together. No, I like that. This is good. Damn. Tastes like spray. No, this tastes like a twisted tea with no alcohol. This tastes like when I pour a soda into an old coffee cup. You know what I mean? Where like I have a little coffee left. Yeah. I'll have like a little bit left and I'm like I'll throw a [ __ ] DC in there just to get all the rest of the caffeine in me. It's not. This is good. Don't think I'm the weird one here. Your better half is leaving Doritos bags everywhere all over the place. And I ate those Doritos. They were good. Nacho cheese. This is good. I like it. This is good. I like this. This gets the seal of approval. I'm I love twisted tea, so I like this. But I know that I'm a trash human",
            "start": 1167.12
        },
        {
            "text": "Doritos. They were good. Nacho cheese. This is good. I like it. This is good. I like this. This gets the seal of approval. I'm I love twisted tea, so I like this. But I know that I'm a trash human being. So you get through the carbonation and then all that makes your taste buds is the tea. Kevin a little bit. It tastes like It does taste like You know what it tastes like? Cuz an Arizona iced tea. Yeah. It tastes like a very like weirdly chem like sugar. But what I love about it is I'm not used to having the the carbonated bubbles with tea. That's something I didn't know I wanted. Yeah, maybe you do. I want it. Maybe you do. And I have it. I had a fet with soda the other day and I was like bubbly fet cuz it's really good. Actually's disgusting. You mix a little bubbles into it. Pretty pretty good. You know what? Interesting. Let's see what Kevin's thoughts are. I just had this and I gotta say I think a lot of times Andy's drink takes insane. They're garbage. Yeah, but like he's not",
            "start": 1209.92
        },
        {
            "text": "good. You know what? Interesting. Let's see what Kevin's thoughts are. I just had this and I gotta say I think a lot of times Andy's drink takes insane. They're garbage. Yeah, but like he's not wrong. How so? Yeah. The whole like, oh, I'm going to drink a diet drink, but I'm going to put a little bit of regular in it or leaving a can open for 10 days just so it quote mellows out and then mixing that with something else. Whenever I get a super duper burger, Nick, I always do about 70% Diet Coke, 30% Coke or replace a 30% Coke with 30% root beer. Okay. See, so thank you for proving exactly what I was just talking about. Is not wrong on this one. But this time, this is pretty good. It is. Yeah, this isn't bad. Yeah, I like this. Okay. All right. I think I'm the I might be the outlier here. I think I might be the only person that didn't particularly care for this. Roger's with me. Roger shrugging his shoulders. Uh I got a story for you, though. Wait, real quick. Roger's response was",
            "start": 1253.12
        },
        {
            "text": "I think I might be the only person that didn't particularly care for this. Roger's with me. Roger shrugging his shoulders. Uh I got a story for you, though. Wait, real quick. Roger's response was insane cuz he was just like, \"Oh, it just tastes like regular Sprite.\" It most certainly does not. It doesn't taste like regular. That's what I Insane is the right word. That is insane. Kevin's not wrong on this one. Kevin's two for two. I thought about you, Andy. very forward tea taste at the end. I went to our uh the Starbucks that I saw you at last time and you guys don't remember this. Is it now your Starbucks? Well, I saw Andy was walking down the street and I saw him and I got really nervous. Like you like when you see your principal out of school, I was like legitimately like starruck. I was like, \"Holy [ __ ] Andy's here. What?\" I was like, \"What do I\" And I was with my wife. I was like, \"What do I say?\" She goes, \"What the [ __ ] are you talking about? Say hi. Let's move on. We have",
            "start": 1297.12
        },
        {
            "text": "like, \"Holy [ __ ] Andy's here. What?\" I was like, \"What do I\" And I was with my wife. I was like, \"What do I say?\" She goes, \"What the [ __ ] are you talking about? Say hi. Let's move on. We have [ __ ] to do.\" But the other day we were sitting at Starbucks. Now I just equate that with you cuz we have I have to I drop her off at the peach. She doesn't like Starbucks. Then she walks down with the pizza. Ball her move to walk into a Starbucks with a pizza. What does Starbucks think about that? Uh we know everyone at the Starbucks because we know everyone at every Starbucks now. So, uh the person that runs that used to run another one. And so she's super cool. She's so cool that if my wife didn't like the matcha cuz they just turned they just uh traded to a different matcha. And so she's like working with my wife like like a hair stylist to find the correct proportions of matcha to like sugar-free vanilla to put into it. They're awesome at that Starbucks. But that's not what this is",
            "start": 1336.0
        },
        {
            "text": "like working with my wife like like a hair stylist to find the correct proportions of matcha to like sugar-free vanilla to put into it. They're awesome at that Starbucks. But that's not what this is about. You guys are on the inside track. I'm I I walk into the Bucks, right, by myself and I look over, there's one table open, and I was like, \"Perfect. We'll sit there.\" Right next to a gray-haired, an older gentleman who's got his back toward me, right? He's coughing a little bit, but I'm like, \"I'm measuring it out in my brain. I'm like, I'm six feet away. I'm sure it's going to be okay.\" And this is the only table that's open is near the sun. I don't want to sit around by the by the bathroom in like the little tunnel area. Social distancing, right? So, I sit down. My wife comes in. And the second she sits down, both of our phones light up. Everyone's phone's in Starbucks. Like, silver alert, right? I look at this. So loud. I look at my phone and it's a picture of a maybe a guy in his",
            "start": 1366.64
        },
        {
            "text": "second she sits down, both of our phones light up. Everyone's phone's in Starbucks. Like, silver alert, right? I look at this. So loud. I look at my phone and it's a picture of a maybe a guy in his mid80s. Black eye, wild hair, looks like a mug shot. Like this dude's been living a [ __ ] life. Well, you got an image. Yeah, I got an image on the link. Oh, yeah. Click the link to Twitter. For reference, he said black eye, not black guy. Yeah, black eye. He said it fast. Sorry, my apologies. Half the listeners are like, oh, black eye, white dude with a black eye. So I was like I also did not click didn't even think there when you click the link it's Yeah. It's a Twitter post. It's a Twitter post. Weird. It takes you to Twitter. You got to click the link. You got to click the link and then you got to look at the know there was a link cuz all the replies are people on Twitter being like, \"Yo, this scared the [ __ ] out of me.\" Yeah. It's terrifying. And then you go to a picture of a guy",
            "start": 1401.92
        },
        {
            "text": "you got to look at the know there was a link cuz all the replies are people on Twitter being like, \"Yo, this scared the [ __ ] out of me.\" Yeah. It's terrifying. And then you go to a picture of a guy that looks like he's [ __ ] he's going through it. Yeah. The app. It really is the everything. Like I'm like how do you have the black eye? Oh post has been deleted. So apparently Oh no. Maybe they found him. But not no thanks to me because I look over to my right and I'm like well there is an old white guy there but I can't see his eye. So Danielle's like what the [ __ ] are you doing? And I was like this like trying to look for like trying to gauge from the back of his head whether he's this old guy. By the way this guy's sitting in a Starbucks and order had the sense to order a Starbucks. If it was him I I don't I would follow the link I guess. What do you do? I don't even call 911. be like he's here and he might be deranged and he's coughing a lot so someone bring a mask for him or",
            "start": 1445.68
        },
        {
            "text": "If it was him I I don't I would follow the link I guess. What do you do? I don't even call 911. be like he's here and he might be deranged and he's coughing a lot so someone bring a mask for him or something but Nick out loud going like anybody been punched recently trying to find this guy's eye it's so funny you bring that up just in that area of little events that have happened because I was walking down that street on Saturday but you did not see Nick didn't see Nick uh didn't see an old man but did see a woman stemming the biggest piece of [ __ ] yep the biggest piece The dog [ __ ] Holy. It was like 4 feet in front of me. Dog [ __ ] Okay. I've got my headphones on and it was such a I really wish I had Did you break the smell barrier when she stepped on it? No, but I had to really not try to laugh cuz I had I wish I had Greg's Ray-B band glasses or something cuz this lady like this lady walks out of a store. I'm walking. She walks out of the store and I look down and I see all the",
            "start": 1482.48
        },
        {
            "text": "try to laugh cuz I had I wish I had Greg's Ray-B band glasses or something cuz this lady like this lady walks out of a store. I'm walking. She walks out of the store and I look down and I see all the pieces. I see like larger than golf ball size [ __ ] turds. Like these these things are fresh looking. And I'll tell you why they are fresh. Because the old lady with the dog in question with the perpetrator is about 4 feet in front of the pieces of [ __ ] on the sidewalk. Mhm. And the old lady like I I put together all of this story in my head afterwards, but lady walks out um and just with her boot [ __ ] almost eats it almost like legitimately almost eats it cuz it's like she she slips on the piece of [ __ ] and there's a bit of a oh god damn I'm almost going to fall and she goes oh my god what the [ __ ] And then about 4 ft in front of her is this old lady with a German Shepherd that just took all of these shits. And the old lady seems kind of like frazzled. Like why is this [ __ ] so",
            "start": 1529.84
        },
        {
            "text": "what the [ __ ] And then about 4 ft in front of her is this old lady with a German Shepherd that just took all of these shits. And the old lady seems kind of like frazzled. Like why is this [ __ ] so much right now? Like it didn't look like this was planned. You know what I mean? Like she didn't have she didn't have the [ __ ] Oh, she didn't have the bag. She didn't have the bags or anything like she was just like kind of freaking out. And then she turns around upon hearing the other lady go, \"What the fuck?\" And she's like, \"Oh my god, I'm so sorry.\" And the other lady's like, \"Oh god, it's it's all right.\" But like, dude, I saw the lady when she stepped on this piece of [ __ ] did not know how much [ __ ] was in the shoe, but I had the perfect view of how much covered up the whole heel. Is the shoe done? And yeah, I texted so like Mike and that's like that's a situation where you put the What did you throw the shoe out? You put I was like, \"Dude, a lady just took the took a step",
            "start": 1586.08
        },
        {
            "text": "Is the shoe done? And yeah, I texted so like Mike and that's like that's a situation where you put the What did you throw the shoe out? You put I was like, \"Dude, a lady just took the took a step into the biggest piece of [ __ ] I've ever seen.\" And because it reminded me of when he stepped in in [ __ ] and didn't want to get in your car. Do you see right there Nick tried to not make it his fault? My question to you, if you saw that much [ __ ] on a shoe, do you throw the shoe out or do you try to clean the shoe after it's been sitting in your car and smells up your car the entire time? I think maybe you don't just put it in a bush and walk away. I mean, okay. But to Mike's, he had a separate pair of shoes. He did have Well, Mike always has five pairs of shoes that don't fit him. He had a duplicate. That is fair. Um, but yeah, it was I think it was wearing the boots with the heels. Whatever happened to those? The Which one? The the the ones that made him small ones. Well, they were I",
            "start": 1626.8
        },
        {
            "text": "duplicate. That is fair. Um, but yeah, it was I think it was wearing the boots with the heels. Whatever happened to those? The Which one? The the the ones that made him small ones. Well, they were I think they were a kid size small. Tik Tok. The Tik Tok ones. Yeah. What happened to the Timberlands, though? Does he still wear those? Mike, you still wearing those Tims? He still wears a Tim. That's good. He said the biggest mistake he made was taking those Tims to one of these events cuz he was walking around. Oh, yeah. Yeah. That's what it was. Yeah. Terrible. if you were the lady with the dog cuz like one thing I was thinking about when as you're telling as you're telling the story is like what level of hit and run am I do I find acceptable cuz I would never hit and run with a car but like but like if I if I turn around and I see somebody just slipped on some [ __ ] that my dog just did turn I think I do I think I do some mental calculus of like if I keep walking and act like it wasn't",
            "start": 1667.68
        },
        {
            "text": "but like if I if I turn around and I see somebody just slipped on some [ __ ] that my dog just did turn I think I do I think I do some mental calculus of like if I keep walking and act like it wasn't my dog No no no no here's the thing the lady isn't in any way walking in this moment The old lady with the dog is 4 feet in front of about the four different. So, it's like when a horse is liked is on the parade and just shits and and she's like huddled in like next to a building with the dog taking care like you know caring forward because she's probably confused as to why it's [ __ ] so much right now. And so this wasn't a it's walking and then you go oh [ __ ] He's like oh ignoring the fact she's like saying she's mortified by this ch saying [ __ ] and run. Exactly earlier instead of been on one like you know if I had front row seats for this debacle. She was in the second row. You know what I mean? She's right there to see all of it. I felt so bad. All you can really do is apologize.",
            "start": 1702.52
        },
        {
            "text": "on one like you know if I had front row seats for this debacle. She was in the second row. You know what I mean? She's right there to see all of it. I felt so bad. All you can really do is apologize. I mean, you got to apologize and maybe depending on like how bad the shoe is. Just take help her put it in the bush. Um, I'm gonna I'm gonna I'm gonna go you one better and then we're going to go to ads and I'm sure our sponsors are going to love this story that comes out of my mouth before, right? We go I I come home from a show the other night. It's like 1:00 in the morning, right? Pull my car in, hit the elevator button in my building and I'm I live in a building that's got two elevators. Hit it. Elevator opens up. Boof, smell of dog [ __ ] Look down. somebody's dog had [ __ ] in the elevator and they had picked it up but did the smear thing and then just left it. So there was just a a runway of dog poop in there and I'm like and it was like a Sunday night. I think I was coming home",
            "start": 1754.64
        },
        {
            "text": "and they had picked it up but did the smear thing and then just left it. So there was just a a runway of dog poop in there and I'm like and it was like a Sunday night. I think I was coming home from like cheaper or punish probably punch line actually on the Lord's day on the Lord's Jesus Christ's day. And I go to myself dude my wife wakes up super early in the morning. She's probably gonna be one of the first people to see this and she's gonna be so mad. And I can't let this I can't just let this thing marinate overnight in this elevator because God knows, you know, who's gonna step on it and trounce it all over the place. So I go into my house, take off my shirt, I'm in like a white shirt, put latex gloves on, and grab a bunch of cleaning products and I serial killer Nick and I start cleaning this. I start cleaning this and I don't with I'm just like it'll be fine. I'm just cleaning a stationary thing. Surely it doesn't move up and down. Surely no one's going to call this elevator at",
            "start": 1796.8
        },
        {
            "text": "this. I start cleaning this and I don't with I'm just like it'll be fine. I'm just cleaning a stationary thing. Surely it doesn't move up and down. Surely no one's going to call this elevator at 1:00 in the morning. I hear the I I hear it like jiggle and then start to move and I'm like, \"Oh no.\" I'm on my hands and knees like like I just killed someone and I'm trying to like what? I have a trash bag. I have gloves on. My hair's frazzled. Like it's my door opens. It wasn't me. Yeah. I literally The guy would open up. There was this dude like what the [ __ ] is going on? All of cops. I was like I was like take the next one. I just let it close and went back. Ladies and gentlemen, we're going to take a second to hear from our sponsors. This episode is sponsored by Subway Servers. The goated endless runner that carried me through middle school, high school, college, and now adulthood is celebrating their 13th birthday, which also marks their 200th World Tour update. And they're going big",
            "start": 1835.2
        },
        {
            "text": "endless runner that carried me through middle school, high school, college, and now adulthood is celebrating their 13th birthday, which also marks their 200th World Tour update. And they're going big because Subway servers decided to travel to not one, not two, but 21 different locations in their 200th World Tour special event. As kind of funny as Resident Zoomer, I can seriously say that I adore Subway Surfers. It's one of my favorite comfort games. Grabbing items, completing challenges, and pulling out a hoverboard right as I'm about to hit a train feels just as good now as it did when I was sitting in the back of Mr. Coburn's Spanish class. Play through all 21 destinations to unlock amazing rewards such as characters, hoverboards, and in-game currency. Just tap the 200th World Tour button on the screen to start playing. On top of that, Subway Surfers has made a special QR code just for the best friends to get even more rewards. The update ends on June 1st, so scan that QR code,",
            "start": 1875.6
        },
        {
            "text": "button on the screen to start playing. On top of that, Subway Surfers has made a special QR code just for the best friends to get even more rewards. The update ends on June 1st, so scan that QR code, download Subway Surfers, and start running if you don't want to miss out on all the rewards. I already did. This episode is brought to you by Factor. When life gets busy, food can sometimes feel like a chore. And the fast food trips can go from a weekly to daily occurrence very, very fast. So, buck those trends and make this season your best with nutritious 2-minute meals from Factor. Eating well has never been this easy. Just heat up and enjoy, giving you more time to do what you want. With 45 weekly menu options, you can pick gourmet meals that fit your goals. Truths from Calorie Smart, Protein Plus, Keto, and more. We at Kind of Funny Love Factor Meals. Bless and Greg love it for a quick lunch in between shows and I adore it as a healthier alternative instead of the dreaded hump day",
            "start": 1919.52
        },
        {
            "text": "Plus, Keto, and more. We at Kind of Funny Love Factor Meals. Bless and Greg love it for a quick lunch in between shows and I adore it as a healthier alternative instead of the dreaded hump day too tired to cook drive-thru run helping me to get on track with my goals. Get started at factormeals.com/kindafoney5050 off and use code kind of funny 50 off to get 50% off plus free shipping on your first box. That's code kind of funny50 off at factormeals.com/kindfunny5050 off for 50% off plus free shipping. factormeals.com/kindfunny50 off blessing. What's your topic? Uh what's up with Roger, man? That's my topic. Cuz he he sends a a slack out to the general Slack and he's like, \"Hey, nobody's read it.\" Yeah. Yeah. Let's pull it up. I'll pull it up. I'll pull it up here. He says, and I quote, \"Hello, everyone. No one's in trouble. No one's in trouble.\" Which is a very Greg Miller thing to say, but it's by Roger. But it's by Roger. Roger posted this in our Slack, but no, not one person noticed",
            "start": 1964.72
        },
        {
            "text": "everyone. No one's in trouble. No one's in trouble.\" Which is a very Greg Miller thing to say, but it's by Roger. But it's by Roger. Roger posted this in our Slack, but no, not one person noticed I got my ears pierced. This is upsetting because I look much cooler now. I would like a written apology from every single person I talked to on at my desk today by end of day. Uh, both Gregs are exempt because both Gregs are currently out of their office. I didn't notice. I I have I have quite a few. You didn't know what that he didn't that he got into? I also didn't notice. And is it is it possibly because of his anatomy? cuz he he I don't know that he has earlobes and they kind of tuck back a little and you can't really see it. He has a loless ear and they go into his thing. A loless ear. But he also and I'll say this, he also did the thing that you do when like you get engaged but you don't have a lot of money. The earring is so small that I'm like is it even an earring? Like he dipped a",
            "start": 2018.88
        },
        {
            "text": "he also and I'll say this, he also did the thing that you do when like you get engaged but you don't have a lot of money. The earring is so small that I'm like is it even an earring? Like he dipped a toe into the earring, but it had if he came with like giant like studs, I'd have like you can't have those when you get pierced. Yeah. I think for the first 6 months you need just like oh you got to have a little baby one. That makes sense. But here's my thing is I don't like to get that close to Roger to be able to see that because then I start the closer I get to Roger when I talk to him the more I annoy him. So I like to keep on Mondays I keep a 20 foot radius from him. No, it's true. He said that before. You think that it is directly correlated to how much you throw the football at him though too? Well now I throw it to Mike because Mike can actually catch it. Yeah, he catches it. So my my followup question with this is is Roger trying to be me? Because I' i've noticed this I've",
            "start": 2060.08
        },
        {
            "text": "though too? Well now I throw it to Mike because Mike can actually catch it. Yeah, he catches it. So my my followup question with this is is Roger trying to be me? Because I' i've noticed this I've noticed this through the years. Wow. Where all do a thing and then Roger just happens, you know, to do to do the same thing. Do we have more like concrete examples? Yeah. What are the other examples? Um a couple weeks ago I put up a a Gregway that was the way Blessie just looked up by the way. It's like man he's about to go into some [ __ ] right here. He's going into the fourth dimension. He's been waiting for this. I've been accumulating the evidence for sure. A couple weeks ago I put up a Gregway. Uhhuh. It was during my Death Rating 2 preview in Japan where after every session I played the game. I came back and I talked about my thoughts and I put it up as like an an almost hourong diary of me playing death rating 2 during this preview session. Guess what the Gregway was the very next",
            "start": 2100.72
        },
        {
            "text": "game. I came back and I talked about my thoughts and I put it up as like an an almost hourong diary of me playing death rating 2 during this preview session. Guess what the Gregway was the very next day. It was it was Roger. Oh, I remember about Death Ring one talking about uh Doom: The Dark Ages every single day. Wow. He recorded a diary after his time playing the game. Put that up. And of course, you know, these things happen. coincidences. Parallel thought we call it in parallel thought. You know, we're a team. We work together. We we share ideas. Joey. Yes. Is this just not a ripoff of when Greg did that with the last game? Don't worry. Joey, we're not saying the time is weird. That's too far back. That's too far. Weird. That's too far back. I I would say maybe you you got something if he got his ears pierced on Friday or if you got your ear ears pierced on Thursday or Friday and he walked in Monday with ears pierced. Yeah. Then we've got a single white female situation going on.",
            "start": 2137.44
        },
        {
            "text": "he got his ears pierced on Friday or if you got your ear ears pierced on Thursday or Friday and he walked in Monday with ears pierced. Yeah. Then we've got a single white female situation going on. I don't know what that means. Have you ever seen the movie Nikki? It's Jennifer Jason Lee and uh Bridget Fonda and they get basically she becomes her friend. Is it Abby Plaza kind of remade it? Uh Ingred goes west. Yeah, kind of. But this girl puts out a roommate ad and then the girl moves in and then slowly becomes her gets the same haircut, starts to want her boyfriend hooks up with a boyfriend and he's like like he's kind of drunk and it's like he's like oh that's and then realizes it's not her and he's like what the [ __ ] is going on? Pretty crazy. So basically like um Here's the thing. I've also seen him wearing chains and I'm like, when did that start? Oh, wow. When did that start? Are you wearing a chain right now? Not a Tim. Not right now. But you do wear chains. Here's what I'll",
            "start": 2181.12
        },
        {
            "text": "also seen him wearing chains and I'm like, when did that start? Oh, wow. When did that start? Are you wearing a chain right now? Not a Tim. Not right now. But you do wear chains. Here's what I'll say to combat that. Bless. What's up? I I I would say that upon read meeting uh Roger's younger brother. Roger's younger brother. Very hip. So cool. Bunch of rings. Has like the chain from one piercing to the other. Like just just in like a Final Fantasy character in a sense, right? A lot of buckles. I don't know if there was buckles. The shoes were The shoes were big. His shoes were huge. At least two times the size of a shoe needed to be. He looked like Anom. And I'd always heard Roger go, \"Man, my younger brother's like, well, he's so cool. What a cool what a cool kid.\" And the more I think of it, the more I think Roger's like jealous of his younger brother's look. And it's like, man, I should employ some of these sort of tactics. You know what I mean? Well, I'm also curious because Nick",
            "start": 2220.32
        },
        {
            "text": "it, the more I think Roger's like jealous of his younger brother's look. And it's like, man, I should employ some of these sort of tactics. You know what I mean? Well, I'm also curious because Nick also mentioned that Roger seemingly is trying to be Mike as See, that's my thing is my my counter to that. Yes. I don't think he's trying to be you. I think he's becoming Mike. And I don't think he wants to do this, but I think he is. This this slack is step one in the official them melding to be the exact same person cuz Roger has never wanted for other people's approval. But you know, of course, classic snowbike Mike is doing something, getting pissed off that that thing either got too much attention or not enough attention, and then never doing the thing again, but then continue to to do the thing secretly, but just to spend money on the thing. It's the first time he shaved his goatee and said nobody talked about it. Nobody talked about it. And that was his reason was, \"Yeah, nobody was",
            "start": 2262.24
        },
        {
            "text": "thing secretly, but just to spend money on the thing. It's the first time he shaved his goatee and said nobody talked about it. Nobody talked about it. And that was his reason was, \"Yeah, nobody was mentioning.\" And then I tell him, \"You look amazing with just a mustache.\" And he goes, \"I got to have the goatee, Slappy. I got to have the goatee.\" Interesting. A lot of allegations here. a lot of I'm surprised he hasn't bursted in to like defend himself. Yeah, I'm I'm really shocked. He's busy. He's got a lot of stuff that he's working on right now. He's probably busy. I would like to Why don't you go whip out a thumbnail for me right there? KFB thumbnail. You know what I'm saying? Oh, while you're out there. Snake chat says I blocked Roger cuz he would go out to lunch with bless and not me. I mean, Roger says I refuse to come out. He's not coming out. I did witness Mike desperately try to get Roger to go to In-N-Out with him earlier and Roger was like, \"No.\" I don't know the last time",
            "start": 2307.04
        },
        {
            "text": "I mean, Roger says I refuse to come out. He's not coming out. I did witness Mike desperately try to get Roger to go to In-N-Out with him earlier and Roger was like, \"No.\" I don't know the last time I went to lunch with Roger. Wow. I took him to lunch. Today, Roger, join us at Red Robin. Yeah. Roger, you want to go to the Red Robin? Robin, remember when Greg was like, I'm going to secretly take out everybody for lunch one day. Oh, yeah. And then promptly never did it. I think he took Roger to lunch. He took out Mike, right? And he took out Blessing. Did he take me out to lunch? I'm pretty sure I remember this. I've been I think he took me to lunch for like our one-on-one meeting. Yeah, that's different. Oh, then he he took Mike and he took Roger. That's probably Yeah, I remember those In-N-Out photos out there. My topic for the show. Andy, what's your topic? What's laboo? Why Why am I suddenly seeing all these laboos? What the What's this? Is this the liquor store thing? Yes. Yeah. So,",
            "start": 2344.56
        },
        {
            "text": "photos out there. My topic for the show. Andy, what's your topic? What's laboo? Why Why am I suddenly seeing all these laboos? What the What's this? Is this the liquor store thing? Yes. Yeah. So, I cut So, I don't I just heard this word. This look I miss a lot in this office. I miss a lot in this office and then I catch up and then by the time I catch up on I'm like I don't even want to know what Laboo is. But I think I caught peak leuoo and I don't I still don't know what the hell freaking it means but it's apparently something that's being sold at the liquor store. This like but but is it legal? These guys. Yes. Wait, I don't know anything about a liquor store. I'm talking about just like looking at Yes. Okay. Could someone spell it? Could someone l a buu? So we're over there and Hold on. Did you tell a story? You can't you can't respond to my question of what is a little vu bite. Oh, it's pretty much a michi. I defin When I typed it in to spell to spell it, I put L like French like",
            "start": 2387.36
        },
        {
            "text": "Did you tell a story? You can't you can't respond to my question of what is a little vu bite. Oh, it's pretty much a michi. I defin When I typed it in to spell to spell it, I put L like French like L E and then boo and then like B O B O space. It popped up though, right? I thought it was a French thing. Yeah, it popped up. So there I mean now type in manichi and tell me how how this is not just a ripoff. Do do another tab. I think I'm thinking of munchi. No way. What is that? What's a mic? I'm pretty sure we had them at at home. I think my sister had the mic. Yeah. Just I think it's like one word. Yeah. I mean it's the exact same [ __ ] thing as little boooo. They are they're little dolls. So apparently our liquor store is selling them. So they're outside of the liquor store. I don't know anything about the liquor. I think they're like beanie babies. I think it's like a crazy thing. They come in blind boxes. So then it's like it's like this and Sunny Angel and like all of those like",
            "start": 2438.88
        },
        {
            "text": "anything about the liquor. I think they're like beanie babies. I think it's like a crazy thing. They come in blind boxes. So then it's like it's like this and Sunny Angel and like all of those like vaguely Sunny Angel. S O N Y Angel. Oh, it's like all of these uh figurines and stuff like that. These are scary. I know. And people get little ones and then you can like balance them on the top of your phone. And I find them a little bit offputting, but that's fine. Dude, if ever become the craze, I'm going to become a billionaire. I have I have like 78 figurines. Okay, so Laboo is the new Beanie Baby. It's a lot of Yeah. Elmo and like you can get little charms and they come in a lot of Oh yeah. Like they are like lines out the door people like raiding uh what is it? Something Mart is No, that's not what it's called. Is this Is this because tariffs are going to affect That's brings Roger in. Oh, now Roger wants to talk about this finally. I was like PopMart. Thank you. PopMart. I don't",
            "start": 2484.16
        },
        {
            "text": "not what it's called. Is this Is this because tariffs are going to affect That's brings Roger in. Oh, now Roger wants to talk about this finally. I was like PopMart. Thank you. PopMart. I don't know what that is either. It's like another figurine store. kind of like a Okay. Yeah, there's one in there's one in Stonestown. Uh oh. Popart. Yeah, PopMart. And Lana loves PopMart. And we went to one we went to one I think it was like the beginning of the Lubu phase craze rather. When was this? What would you call it? Four months ago. Four months ago. It's been a while. Uh and we walk out. She was she wanted to get a different figurine. We walk out and a guy aostas walks up to us and says, \"Hey man, I got Laboos for Lolo. I got it. I got one right. I can get you some right now.\" like he was like ready to like take me to his car to give me leoo, but there's a huge fake market and a huge theft market for labu just getting them like snipped off of their purses. Yeah. So Leansa has a mici on her",
            "start": 2528.92
        },
        {
            "text": "ready to like take me to his car to give me leoo, but there's a huge fake market and a huge theft market for labu just getting them like snipped off of their purses. Yeah. So Leansa has a mici on her bag. Uh which you know Nick knows about. Uh that scared the [ __ ] out of Lansa by the way because Lance was wearing a Michi on her bag and then Nick goes, \"Oh my god, is that a Miichi?\" And she didn't know that these were old. Like she didn't know that these were like an old retro thing that came back. So she just thought that Nick was really in on it. He just got everything. She was like, \"Oh, this thing's not cool anymore.\" Uh, but yeah, so we uh Yeah. So, we has a Oh, yeah. So, she's scared of uh uh getting her michi stolen cuz she thinks people are going to think it's a labu. Um Jared Jared. She's scared of she's scared of getting her michi stolen cuz she worries that people are going to think it's a labu. These are actually Yeah, Laboo are huge. These are kind of lit, dude. Yeah,",
            "start": 2571.36
        },
        {
            "text": "Jared. She's scared of she's scared of getting her michi stolen cuz she worries that people are going to think it's a labu. These are actually Yeah, Laboo are huge. These are kind of lit, dude. Yeah, these are kind of more of like the these are the these are like the toy version of it. Um Jared Green in the chat saying, \"Laboo on the low is crazy.\" Yeah. Uh but we we Mike and I we had a a fun interaction yesterday. He almost tripped and [ __ ] died just like Get a [ __ ] mic and get on the set right now. Mike, get get a mic and get on the set right now. Uh I don't want to blow up the spot, but I will blow up the spot. the uh but yeahve it was incredible across the street at the at the liquor store, right? We walk in and uh of course there's always there's always something new there. They're always trying something new. And uh the guy that works there who only talks to Mike even though I'm there, right? He loves me. He he gives me a little fist bump, but then he only looks at Mike and",
            "start": 2614.96
        },
        {
            "text": "always trying something new. And uh the guy that works there who only talks to Mike even though I'm there, right? He loves me. He he gives me a little fist bump, but then he only looks at Mike and says Mike, he's just like he's just Mike immediately looks at the laboo on the on the counter and he's like, \"Oh, you got you got these little things. You got these little [ __ ] things.\" He's just like, \"Mike, these are fake as [ __ ] Mike.\" Yeah. Yep. Mikey, these are fake as [ __ ] Mikey. And then he's like, \"Really? You guys are doing that?\" He's like, \"I hate my boss. He's making me sell these.\" And then he he looks at us. He's like, \"Dude, it's becoming an issue, man. I think I might lose my life over this.\" We're like, \"What?\" He's like, \"Yeah.\" To this morning, this guy comes in. No, yesterday this guy comes in and he's like, \"Are these real? Are these fake?\" And then I didn't want to get in trouble. So then I just say I just say, \"I don't know, man. They are they real? Are they",
            "start": 2661.6
        },
        {
            "text": "yesterday this guy comes in and he's like, \"Are these real? Are these fake?\" And then I didn't want to get in trouble. So then I just say I just say, \"I don't know, man. They are they real? Are they fake? I can't tell. I can't tell.\" I know. And then and then he looks at Mike. He's just like, \"Mike, there's 7-Eleven's selling these things for $90. We're selling these for $20. Look at the tape on this.\" He's like, \"These are [ __ ] fake as [ __ ] Mikey. These are fake as fuck.\" And the guy, of course, buys two. And then he comes in this morning and he's like, \"I'm going to shoot up this place. I'm going to shoot you again. I'm going to shoot up this place. I need I need I need a refund right now. I need a refund right now. For $20, I'm going to threaten to kill everyone in this liquor park.\" And then the guy's scared. He's like He's like, \"Man,\" and this is where we had the Well, here's here's the best one. No, no, you should finish that cuz I'll tell you what happened today. Oh,",
            "start": 2698.56
        },
        {
            "text": "park.\" And then the guy's scared. He's like He's like, \"Man,\" and this is where we had the Well, here's here's the best one. No, no, you should finish that cuz I'll tell you what happened today. Oh, [ __ ] Okay. Okay. I like the update. But then it got me excited cuz Mike, uh, Nick, you and I I ex vapor, right? I used to vape back in the day. And I I still have that like in me a little bit, right? Where I think about it every day. I'm like, man, what if I just go across the street and get a vape? Nick with a cigarette. Yeah, exactly. What if I could just do this? But then it just it he freed me because then he looked at me and he says, it's not just a little boo boo, Mikey. We got fake vapes. He said all of our vapes are from China and they're and they're fake and they're illegal and they're and people are coming in. They're coughing. Mike coughing. They coughing. No, like real talk. Real talk. Last month the same guy I was like he looked like he was having one, right? He was having a",
            "start": 2737.12
        },
        {
            "text": "and people are coming in. They're coughing. Mike coughing. They coughing. No, like real talk. Real talk. Last month the same guy I was like he looked like he was having one, right? He was having a bad day and I was like, \"Hey man, you okay?\" And he goes, \"We got we got busted by the ATF.\" Oh [ __ ] And I was like, \"What?\" And he goes, he goes, \"Nick, I didn't even know what the ATF was.\" does. I was like, \"You work at a liquor store and you don't know what the alcohol, tobacco, and firearms division of our government does.\" And he was like, \"Yeah, I sold the fake they have these like behind the counter vapes that are illegal cuz they're from they're not like regulated at all cuz they're from China.\" What makes them unregulate? Like safety or they're safety? Yeah, they're unsafe. They have there's one chemical in them specifically that's like dy that causes extraordinarily bad. You voted for all the flavored fun things to be out me and my commit. Yeah, me and my But it's not just that.",
            "start": 2771.6
        },
        {
            "text": "there's one chemical in them specifically that's like dy that causes extraordinarily bad. You voted for all the flavored fun things to be out me and my commit. Yeah, me and my But it's not just that. It's like specifically the ones that are knockoffs, like they don't know what the [ __ ] in them. So, why didn't Why did Mike say popcorn lung? What does that mean? If you get if you inhale this specific like these chemicals that are in these knockoff vapes, it like [ __ ] it like hardens your lung. Oh [ __ ] And you can't like it won't it's f it's a really bad respiratory problem that never goes away. You can't there's no there's I'm sure getting it. I was I was in a lot of Chinese chemicals back then. A lot of Roger's one of Roger's lungs is already gone. Yeah, it's done. But he goes like this. He goes, he goes, \"This this sweet girl came in. This sweet girl came in. I swear to God, Nick, she looked like she was just, you know, 20 years old. 20 years old. I swear to God.\" And she goes,",
            "start": 2809.92
        },
        {
            "text": "He goes, he goes, \"This this sweet girl came in. This sweet girl came in. I swear to God, Nick, she looked like she was just, you know, 20 years old. 20 years old. I swear to God.\" And she goes, \"Hey, do you guys have any any vapes?\" And he goes, \"You know, my my my boss makes me keep the vapes back. I don't want to sell them, but he makes me keep the\" And so he goes, \"So I so I I go underneath and anytime you have to go underneath the counter for something, it's like this is this is counterfeit or this is like, you know, this is not legal.\" So I guess he sold her when she took out her ATF badge and was like, \"I need your ID and I need the B the the name of that owns this place.\" [ __ ] Hit him with a fine and hit the the place with like something with a fine. He hit him personally with like a $2,500 fine and then the place got hit with a 50k fine. Damn, man. And so now they're not selling vaping anymore. Now they're selling off brandand market. And so after getting this life",
            "start": 2849.68
        },
        {
            "text": "with like a $2,500 fine and then the place got hit with a 50k fine. Damn, man. And so now they're not selling vaping anymore. Now they're selling off brandand market. And so after getting this life threatened last week, I walk in today. We got double laboo. There's so much, dude. The laboos are everywhere on the counter now. We've gotten more laboo in stock. Broken containment. Broken containment. It's a huge business now. I'm so glad I asked about Labou. Yeah, that was so much. Holy cow. Wasn't expecting any of that. But it is also an issue because they're going to be really expensive with the tariffs. Okay. Cuz that that's I think that's where I started hearing about them of hey because the tariffs are going to they're kind of looming over everything. They're going to get crazy expensive in the next couple of months. So the time to get them is like now. Yeah. Cutie Cinderella has been talking about it on Fear and Oh, maybe that's where I heard of it. Yeah, cuz she buys the little",
            "start": 2882.16
        },
        {
            "text": "in the next couple of months. So the time to get them is like now. Yeah. Cutie Cinderella has been talking about it on Fear and Oh, maybe that's where I heard of it. Yeah, cuz she buys the little charmers for her little Deco Den shop. Okay. Wow, they're so cute. The boo boos, man. We got You had a question about my sweater. Well, that was going to be Joey's topic. Oh, yeah. I have a topic brought to you by Nick. Joey, I'll I'll spitball on this because I have it written down here. Um, is Andy's sweatshirt an appropriate color for a Monday? To me, this is more like a dad Sunday sweatshirt. This is a weird qu like I like that sweatshirt a lot by the way. You didn't Yeah. Can you tell me about the sweatshirt? I don't know anything about Bulma from um Dragon Ball. Okay. Yeah. But she's so cute cuz the way that Nick presented it was I I want to talk about Andy's sweater and talk about whether it's appropriate or not. Whether the color is appropriate. Well, okay. And then I was like, I",
            "start": 2929.04
        },
        {
            "text": "cute cuz the way that Nick presented it was I I want to talk about Andy's sweater and talk about whether it's appropriate or not. Whether the color is appropriate. Well, okay. And then I was like, I don't know what that means. And then he said, cuz honestly, Andy, I look at that, I go, that should be for a Sunday. And I don't know what that means. It's very like LZ fair. It's got like the collars not so tight. You're showing a little more neck than I'm used to you see seeing. And it's it's very much like a Yeah. He's like, I notice him. I notice more neck. It's like a normal amount of neck. Well, he's got like pushed up. It's inappropriate for the workplace. For the workplace. Yeah. For the workplace. Acting like he's I'll wear this at home on like a leisurely Saturday. You look like a divorced dad that just went out on his first like Chardonnay lunch date and you're trying to get laid with a Bulma. Yeah, you're putting out a vibe right now. Well, here's the thing. I also bought a",
            "start": 2971.44
        },
        {
            "text": "divorced dad that just went out on his first like Chardonnay lunch date and you're trying to get laid with a Bulma. Yeah, you're putting out a vibe right now. Well, here's the thing. I also bought a t-shirt version of this as well and it's not this color blue. It's it's um Do you remember the old kind of funny t-shirt we had with the games covers? Yes. Uh like that really really kind of aquamarine. It's pretty much that color. Five, two, three. Yeah, I think so. Yeah. Very, very bright kind of teal color, but with the same sort of design on it. Real talk though, I'm talking mostly [ __ ] I love Is that a periwinkle? I love that sweatshirt. I just, you know why I like the color of the sweatshirt? And this is going to sound like it's an insult. It is not. It is not a good color, but it's a great color. You see it, you go, I don't like that color, but I want it on my body. Does that make sense? I like that. My wife has a tracksuit, aloe tracksuit that's that exact same color. And every",
            "start": 3016.08
        },
        {
            "text": "great color. You see it, you go, I don't like that color, but I want it on my body. Does that make sense? I like that. My wife has a tracksuit, aloe tracksuit that's that exact same color. And every time she asked me, she's like, does this look good? I'm like, I can't honestly tell you, but it's evocative. I miss my bright color stuff. I used to, you know, I had a a very kind of like a I had a very sort of aquamarine hoodie at one point. I had a very um coral sort of like orangish pinkish hoodie at one point. You used to be like the bright color guy. They're harder to get because if y'all notice, I usually wear the [ __ ] that I make cuz it's the stuff that I want to wear. But the unfortunate thing about that is the blanks aren't always, you know, there's it's usually like a lot of custom stuff. Pretty much basic like here's a black uh sweater, here's a white one, here's can't get the good colors, dark. And it's like, man, I want like this color purple or that whatever. Yeah. So, I",
            "start": 3058.4
        },
        {
            "text": "stuff. Pretty much basic like here's a black uh sweater, here's a white one, here's can't get the good colors, dark. And it's like, man, I want like this color purple or that whatever. Yeah. So, I had to I saw this and I was like, I got to I got to buy that. Actually, I really like it. Here's the thing. We have access to the fun colors. So, let's design more fun color stuff for us. Okay. Well, I do this [ __ ] in my free time. That's a hard pass. That's a That's the answer. Do you have I do this [ __ ] at home. I hope you get those colors. You're going to Well, I was going to ask where you discovered this. I think the Yeti. The Yeti. Okay. The Yeti. Is that just another store? Yee t e. Oh, yeah. You say they do a bunch of gaming nerd [ __ ] But this was one of those that it they do a weird thing where like once a week they post whatever the design of the week is and it's it's too affordable. Like what's going on here where the t-shirts are $17? And then all of the other [ __ ] they",
            "start": 3104.4
        },
        {
            "text": "thing where like once a week they post whatever the design of the week is and it's it's too affordable. Like what's going on here where the t-shirts are $17? And then all of the other [ __ ] they sell, the t-shirts are 28, 27. What do you would expect, you know? Yeah, but like the weekly stuff is always crazy crazy good uh discounts. Uh in the chat, uh Bionic Pulga says, \"Reminds me of alternate Skittles, you know, when they do like a like a pastel Skittles.\" Ah, like an Easter Skittles. Yes, like an Easter Skittle. Dress code for work. What kind of funny? I think we have one. I think it's bomber jack. I think it's whatever. Where's Nick? Whatever Tim's wearing. Yeah, whatever. What would the dress code be? Take us out with the official kind of funny dress code. Um, a black t-shirt. Yep. With a bomber jacket over it. Timberlins. Some jeans. Some Timberlands. So uncomfortable in my staying desk with the Timlins on. A chain. Yeah. What's Are you just describing what Tim wears every day?",
            "start": 3147.04
        },
        {
            "text": "a bomber jacket over it. Timberlins. Some jeans. Some Timberlands. So uncomfortable in my staying desk with the Timlins on. A chain. Yeah. What's Are you just describing what Tim wears every day? Yeah. What's the shirt of the week right now? Uh, yeah. Click into that. What's the price? Blue eyes. Cuz this has got to be the shirt of the week. And I bet you the price is like crazy. Look how cute it is. They do a bunch of cute [ __ ] Yeah, these are adorable. Want a burnt orange jacket? How much? It doesn't say the price anymore. Oh, you got to click the size, I believe, to get the size. Oh, 18. That's a great deal. All right. New website for me. Well, ladies and gentlemen, that has been your kind of funny podcast for today. Thank you guys so much for joining us live. If you guys are joining us not live, please leave a comment uh in the comment field. Let us know if you like Andy sweatshirt. And if you don't, let us know exactly why you don't. Uh, I want I want to take us out with the",
            "start": 3191.68
        },
        {
            "text": "us not live, please leave a comment uh in the comment field. Let us know if you like Andy sweatshirt. And if you don't, let us know exactly why you don't. Uh, I want I want to take us out with the Miichi title, like the the song from the the cartoon. There was a song, but I'm worried cartoon. Yeah, it was a cartoon. Well, everything was a cartoon. If they saw the toy in the 80s, it had to have a cartoon with it. That's how they sold it to kids cuz a kid watch cartoon. Like, I need I assume it was like a San Rio type situation. Uh, no. I I remember being 1983 is what this is. I'm actually going to I'm going to slack a different one here. It's weird that like I know San Rio is massive, but I always think like that could be Kirby. No, wait, hold on. Let's Let's go with that thought that you started with. Maybe we shouldn't. I think Kirby does have like a lot of a lot of people will buy buy [ __ ] especially the like 2D flat version. I just received like Michael Ham loves Kirby. Like you",
            "start": 3232.56
        },
        {
            "text": "started with. Maybe we shouldn't. I think Kirby does have like a lot of a lot of people will buy buy [ __ ] especially the like 2D flat version. I just received like Michael Ham loves Kirby. Like you go into our apartments, a lot of Kirby [ __ ] I think maybe we just skip the video. Kirby and we don't get in trouble with you. This a wild combination. I'm just going to play it here. The Nintendo section was like, you're just going to do it on your own. Perfect San Rio [ __ ] He's playing the song. Oh, we can't hear the We can't hear it. I'm sorry. It's not coming through microphone. Okay. Yeah, we'll play it later off screen. Ladies and gentlemen, of course, we're waiting. That's about all we needed to hear. That's all we need. Ladies and gentlemen, that is the kind of funny podcast. If you guys are watching live with us, by the way, uh please stay tuned because Snowbike Mike and Tim Gettys are going to unpack some Final Fantasy cards. Is that right, man? Magic. Magic the Final",
            "start": 3267.92
        },
        {
            "text": "If you guys are watching live with us, by the way, uh please stay tuned because Snowbike Mike and Tim Gettys are going to unpack some Final Fantasy cards. Is that right, man? Magic. Magic the Final Fantasy. They're just kind of going through the list. They're going to go through the list and blessings going to be there and I might be playing Doom right next to them off camera. Uh you guys have been amazing. Until next time, it's been our pleasure to serve you. Like I've been on three things today. [Music]",
            "start": 3305.28
        }
    ]
}