{
    "id": 14162,
    "video_id": "aLN_ItvG5Y0",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Roger Pokorny"
    ],
    "title": "Greg, Tim, or Nick - Who's the Most GOATED at Subway Surfers? #sponsored",
    "description": "Go to http://Kindafunny.com/SubwaySurfers to get special rewards and download it now!\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1748385545,
    "duration": 7251,
    "transcript_chunks": [
        {
            "text": "What's up and welcome to a very special kind of funny stream. Today we are streaming Subway Surfers. For the last almost 10 years, we've had a kind of funny best friend in the chats in the comments of our videos with the Subway Surfers name and it's like, how is this possible? How is it possible? The biggest mobile game of all time. How are why are they here right now? Uh it is because our homie Christian is a best friend and uh he is also in charge of a lot of the marketing over at Subway Surfers. And so we're finally officially partnering and working together for this celebrating uh the 13th birthday of Subway Surfers, which is absolutely wild. Very long time coming for this here, the 200th world tour that we've went on. Of course, I am Tim Gettys. I'm joined today by Greg Miller. I started my subway surfing career today. Nick Scarpino. Hello Tim. And Roger Picornney. 13 years ago. How old was I? 13 years ago. I was 13 years old when subway surfers came out. Perfect prime time. Get",
            "start": 10.96
        },
        {
            "text": "my subway surfing career today. Nick Scarpino. Hello Tim. And Roger Picornney. 13 years ago. How old was I? 13 years ago. I was 13 years old when subway surfers came out. Perfect prime time. Get me excited. I'm So you you've been surfing the subways for 13 years. Literally since the first year it came out. I remember uh I don't know if we can speak about competitors, but I remember a Temple Run back in the day. That was a big deal. And then Subway Surfers immediately took over as the bigger one, as the better one. Uh, and I stand by it. It is the goated endless runner runner. Uh, it is the game that I played so much of uh, back in the day in middle school, high school, college, and now adulthood. I stand by it as an adult doing it professionally. Now, what I love about this is uh, we had to do it like all the kids do, right? We're just going to kind of have hang out and have a conversation, do a podcast while Roger is playing Subway Surfers over here because if you've ever seen Subway",
            "start": 60.0
        },
        {
            "text": "do it like all the kids do, right? We're just going to kind of have hang out and have a conversation, do a podcast while Roger is playing Subway Surfers over here because if you've ever seen Subway Surfers pop up on your TikTok, this is kind of what it looks like. Maybe a slightly different orientation. Yeah, usually down low, right, in the Europe cuz of the vertical business. Yeah. Um, so we're having fun here. But of course, everybody, there is a QR code on the screen right now that you could scan and it'll get you 10,000 coins, five score boosters, and a metal hoverboard uh that you can get. If you have Subway servers, please do that. Of course, it helps support us. It helps prove to subway servers this was all worth doing. And if you don't have Subway servers, it is a free game. you're always saying you want to support Kind of funny and help us out. Scan the damn code and get the game and try it out. It's fun. Amen, everybody. Um, but yeah, a couple things that I want to get",
            "start": 99.12
        },
        {
            "text": "you're always saying you want to support Kind of funny and help us out. Scan the damn code and get the game and try it out. It's fun. Amen, everybody. Um, but yeah, a couple things that I want to get through real quick. This is Subway Service 13th birthday. Uh, it marks their 200th World Tour update. They're going big. They decided to travel to not one, not two, but 21 different locations in their 200th World Tour special event. Um, so we have Roger here to represent the subway surfer fandom to show us what he is made of when it comes to surfing through the subway here. Starting in in London, I guess making it all the way around the world. Yeah, I already screwed up because I love Subway Surfers so much where anytime I open up this game, I just lose all my time. So, I booted up this game earlier just to make sure it worked and make sure, you know, everything was good for the stream. I was like, \"Let me try out the World Tour.\" Cuz I've been holding off on it cuz I knew we were going",
            "start": 141.36
        },
        {
            "text": "earlier just to make sure it worked and make sure, you know, everything was good for the stream. I was like, \"Let me try out the World Tour.\" Cuz I've been holding off on it cuz I knew we were going to do the stream. I booted up the first one and I was like, \"Okay, well, the whole objective is to get 10 briefcase in all the cases in each run, 10 of them.\" And I uh went through and I was like, \"Okay, I got three. I can stop. Let me get five. Let me get let me see what happens if I get eight and I bounce out. Like, will it stay?\" And then I got 10 and then I was just like, \"I'm already here.\" And then I screwed up and now it's gone, right? Because I already finished that one. So, uh yeah, there was I believe it was Japan was the last one before that. But yeah, I'm I'm obsessed with it. I'm having a great time. Let's Let's jump in. I want to just I want to start by just watching it play. Let's see. Let's blow Nick Scarpino's mind. Nick doesn't know how good games could look. Roger, you",
            "start": 185.76
        },
        {
            "text": "having a great time. Let's Let's jump in. I want to just I want to start by just watching it play. Let's see. Let's blow Nick Scarpino's mind. Nick doesn't know how good games could look. Roger, you already blew my mind today by telling us how young he is and how it's kind of weird when you think of it, Greg. It's like, you know, Roger's an employee. He's an amazing coworker, but we're also in in sort of a way we've we've sort of raised him. Yeah. Kevin says, \"It's cool seeing this boy get to spend time with his dad even if he's glued to his phone.\" So, this is definitely an authentic family experience with just looking down here. I was just like, \"Yeah, I used to listen to you guys when I was in grammar school or whatever it was.\" I'm like, \"God, kill me now.\" Nobody says grammar school. What do they say? Grade school. What is grammar school? Yeah, grade school. Oh, is it really? Is it like a regional thing? I don't know. Or is it like a time? Yeah. Oh, yeah. Look. Cuz it always",
            "start": 216.8
        },
        {
            "text": "What do they say? Grade school. What is grammar school? Yeah, grade school. Oh, is it really? Is it like a regional thing? I don't know. Or is it like a time? Yeah. Oh, yeah. Look. Cuz it always threw me off that like in New York all the Maybe not all, but a lot of the elementary schools had Yeah. The PS18. Hey, PS59Q. Everybody, is that you? There's a way to just rip away their value as human beings down to a little number. No wonder everybody comes out as a bunch of racist people and having to change it in like 30 years. Dude, San Francisco in the last couple years has just been it's been one of the bigger things. Every school's being renamed cuz everyone's problematic. Like one by one they're changing. My favorite still is when uh we go to the Academy of Sciences and you know it's out there in Golden. I went to adjust my glasses. We're doing no continued mistake. Let them fall off your face next time. We're restarting. Uh is that one statue they tore down at where the you know the",
            "start": 255.92
        },
        {
            "text": "there in Golden. I went to adjust my glasses. We're doing no continued mistake. Let them fall off your face next time. We're restarting. Uh is that one statue they tore down at where the you know the ferris wheel used to be. There was a statue when they were tearing all the statues down for all the racist and slave owners or whatever. And the fact they just tore it down and then was just like all right. And then never put anything back up. They just sanded off the words on the just weird. We don't want to stand by anybody. Oh, I got another one. That's just how it is. So, Ro, you're cruising here. Yeah. How you feeling? Uh, I'm feeling great. Uh, well, you already choked under the pressure. I mean, I'm better at him than game one. All right. Greg does. Greg, get the buttons with your old man reflexes. Yeah, there's no controller here. Greg, I know how to play, buddy. You're the one slamming into the wall. Well, do you know this fell off the pro strats? What are the pro strats? Uh,",
            "start": 305.04
        },
        {
            "text": "man reflexes. Yeah, there's no controller here. Greg, I know how to play, buddy. You're the one slamming into the wall. Well, do you know this fell off the pro strats? What are the pro strats? Uh, when you're in midair, you got to be doing a um a little roll so you can go down faster. It's kind of like a down B in Sonic. Uh, specifically Shadow Generations. Uh, that's why I've really connected with that game so much is cuz it's so much like Subway Surfers. And you're being genuine with that being said that to me months ago when you spent real so many hours of your life sranking everything in Sonic Cross Shadow Generations. Yeah. Um, but yeah, that those are the pro strats right there. Honestly, uh it's kind of a trap when you get the uh super boots, the the little the boots that make you make you go super high in the air because you seem it seems like a good idea, but then you can go too high and hit the ceiling. So, so sometimes sometimes I avoid that on board. Why aren't you using",
            "start": 343.68
        },
        {
            "text": "make you go super high in the air because you seem it seems like a good idea, but then you can go too high and hit the ceiling. So, so sometimes sometimes I avoid that on board. Why aren't you using your hoverboard ever? Uh because, you know, I I back in the day, I used to be a hoverboard guy. I used to use the hoverboard to try to keep on keep my run and try to beat people in the leaderboards, but now it's just for personal uh vindication, right? I want to know that you're playing beloved game now. Yeah, exactly. Cuz the hoverboard allows you to get one. Oh, see this is the the little jump here that I'm talking about, which is cool. You can't be doing that all day long. Yeah, exactly. It's cool, but it it screws up the the the gravity of it all, right? And you kind of got to figure out your your life a little bit. Uh but yeah, the hoverboard is nice if you really want to push for those super high scores, but um it it I don't know, not that cheating, but like you know, I want to I",
            "start": 384.0
        },
        {
            "text": "your your life a little bit. Uh but yeah, the hoverboard is nice if you really want to push for those super high scores, but um it it I don't know, not that cheating, but like you know, I want to I want to get that pure S rank. Is the hoverboard mainly like to go fast and then collect? Uh, so basically it is the same. It's the same speed. I have a super hoverboard right there. Look, it's a little coin. Um, this is the one you can get by scanning the QR code. Exactly. And uh, but like see right here, I'm going to hit something. Boom. I can uh I get a free uh ability to hit something. Yeah, that's great. The hoverboard saved you there. Hovering power, but doing a clutch hoverboard. That those were always the big moments, right? What does that mean? When you're just, you know, a train's about to hit you and you do it split second, you double tap in. You feel like you did it and you actually did eating a whole ship. I'm alive to to survive another. Are these levels are they",
            "start": 416.08
        },
        {
            "text": "a train's about to hit you and you do it split second, you double tap in. You feel like you did it and you actually did eating a whole ship. I'm alive to to survive another. Are these levels are they semi-procedurally generated or is it kind of they're all going to the Oh, no. Yeah, they're they're they're semi procedurally generated. Oh, so you you haven't memorized this level. You don't understand what's going on. I thought you were like I thought you were so deep into it that you're like, \"Oh, yeah. Left turn. Left hand. Left turn. Dude got busy.\" Oh [ __ ] Here's the magnet. Get the magnet. No [ __ ] Yeah. You never know what you're going to get. That's exciting. It is. Oh [ __ ] See, look at that. See? See? That's with the with the hover with the jump boots. Uh, you have to kind of be always swiping down in order to make sure that you're on top of the strains. This is wild, man. It's hypnotic. Yeah, it is. I mean, this is why it's How long we've been going for? 10 hours. This is",
            "start": 455.52
        },
        {
            "text": "always swiping down in order to make sure that you're on top of the strains. This is wild, man. It's hypnotic. Yeah, it is. I mean, this is why it's How long we've been going for? 10 hours. This is why it's below so many podcasts cuz I'll just be watching that instead of podcast. Yeah, this is so fun. Stay here all day. How much Subway servers did you ever get in your life, Greg? Literally. Oh, how much have I seen or played? Play. Just download it today. Oh, okay. Okay. I'm I'm new to I I watched it a lot on the the Tik Tok as well. I I serve those. But no, I I playing I had it started today and I was shocked that I was so much better than Roger at it. All right. Yeah. I I didn't get a a smartphone until a little later in my life, but once I did, Subway Surfers was high on my list of of games. Yeah. Yeah. So, I never got too far into it, but I was uh very into it for never played it, but he loves the vibes. Of course. That's cuz he hears spray paint right at the beginning and he's",
            "start": 489.84
        },
        {
            "text": "games. Yeah. Yeah. So, I never got too far into it, but I was uh very into it for never played it, but he loves the vibes. Of course. That's cuz he hears spray paint right at the beginning and he's like, \"What's going on, Jim?\" Should I start passing this around or should I keep on going? a little more. I already did London. We already We already moved past there. It's my Monday. I'm not going to be as fresh. You know, I'm not as fresh as if it was like a Wednesday. We will get Nick on it at some point. It's a Tuesday. Is it It's my Monday. It's all of our Mondays, actually. That was that was embarrassing. Maybe keep your comments to yourself now, Roger. You just focus on the gameplay. Dad says, Dad said it. Listen to your father's. I walked in today. They were having a What was the conversation about who's more normal? Oh, yeah. Mike. Mike uh says that he is the most normal person at kind of funny. We really have to debate this again. Yeah. Did we debate this yet? I feel like we have",
            "start": 529.44
        },
        {
            "text": "about who's more normal? Oh, yeah. Mike. Mike uh says that he is the most normal person at kind of funny. We really have to debate this again. Yeah. Did we debate this yet? I feel like we have talked about this, but like definitively Mike is not normal. Mike is not normal. Positive things. Normal is just not a word you use. That's not the word I'd use for it. When your name's Snow Bike Mike, you can't be normal. You know, with Earl the Squirrel. Yeah. It's kind of, you know, and under under the sinks, you've never you don't like eggs. Who is the most normal person here? That's a great question. I think when we last had this debate, I think we decided on Joey. Yeah, Joey's Joey's lost that one now. She reads too many books. Joey's lost that one for sure. The more I know about Joey, the more I know she is not normal. Still on Nick. So you you're definitively like Joey's lost it. How did Joey lose it? Yeah, Joey lo it. Joey, did she ever have it? I don't think she ever had it, dude. I",
            "start": 569.44
        },
        {
            "text": "I know she is not normal. Still on Nick. So you you're definitively like Joey's lost it. How did Joey lose it? Yeah, Joey lo it. Joey, did she ever have it? I don't think she ever had it, dude. I think she fronted that she was normal. And I think by by com she we put this on her. I don't think she ever claimed it, you know. But I work very closely with Jonah cuz I help her take care of a lot of the uh the Patreon fulfillment stuff and the merch stuff. And when she leaves this with this office, I think things get wacky for me. I really do. She travels a lot. She don't tell me what happens, you know? And then I catch little pieces of it and I'm like, that was some crazy [ __ ] that you The YouTube chat's popping off saying Blessing. And I'll tell you right now, Blessing's a Sonic fan. What else do I have to say? Yeah, I think I honestly think Blessing might be most franchise. I think I would say Tim, but I know Tim too well as well. I know Tim's like his I know the things that Tim's",
            "start": 610.64
        },
        {
            "text": "else do I have to say? Yeah, I think I honestly think Blessing might be most franchise. I think I would say Tim, but I know Tim too well as well. I know Tim's like his I know the things that Tim's into. Like we were just having a conversation about some sort of home stereo and you're so into that [ __ ] that that can't possibly be normal. You're not a normal human being when it comes to that. You made a joke about it. There's dozens of us. Yeah, there's dozens of us. He knows he's not normal. Greg is for sure the opposite end of that spectrum. You might be the least normal. go out of my way to tell people I'm not normal. Yeah, we went to a a little playd date on uh for uh no, Saturday night with some of uh Ben's friends from the nanny group that he hasn't seen in a while or whatever. And so it was the first time having the actual bandwidth cuz now the kids can entertain themselves to talk to the other parents. And at one point this one, you know, you know, tech guy or whatever. Yeah.",
            "start": 653.44
        },
        {
            "text": "so it was the first time having the actual bandwidth cuz now the kids can entertain themselves to talk to the other parents. And at one point this one, you know, you know, tech guy or whatever. Yeah. ignore me. The other parents are like, \"If you were a country, what country do you think best describes you?\" And they're going on very detailed answers and they got to me and Jen's like, \"Oh, America.\" For him, I'm like, \"Oh, yeah. You guys don't know me, but I'm weird and loud.\" Like, don't worry about that. There's a lot of me. Yeah. That is a conversation that I'm so happy I wasn't a part of cuz like I can't even imagine having to sit there as somebody like I think that I am Switzerland. Like, get go [ __ ] yourself. You know what I mean? I don't want to hang out with somebody that like identifies that way like in Switzerland. Well, I mean they were they were pinned down. This wasn't like you know they were like you know like if you say I understand and it nobody was like oh well I'm",
            "start": 695.28
        },
        {
            "text": "that way like in Switzerland. Well, I mean they were they were pinned down. This wasn't like you know they were like you know like if you say I understand and it nobody was like oh well I'm Timbuktu because the my global economy like they didn't have like these weren't you know maybe we all read the New York Times but we don't know what the hell we're talking about here. It wasn't like that. Sure. I mean we're all definitely America%. Well you're you could be Italy. I don't know, you know, honestly, I don't know enough about the like the actual like societal aspect of Italy to to claim Italy. You know what I mean? Like I've never like I don't know how people are there. I've only been there a handful of times and this last time was really the first time I actually got to experience it as a tourist and then see my family there. And they're all amazing and they're lovely human beings, but I definitely think I'm way more America than I would be Italy. Italy, I think, USA. They are, you",
            "start": 734.88
        },
        {
            "text": "a tourist and then see my family there. And they're all amazing and they're lovely human beings, but I definitely think I'm way more America than I would be Italy. Italy, I think, USA. They are, you know, my family's from a really small town in like central Italy and they they they hold family values like pretty pretty sacred to them and I haven't seen my mom in like 8 months. So I I don't know that I'm the best repping Italy hard. Yeah. Like I call my parents and they're like, \"Hey.\" And I was like, \"Hey, we haven't talked in 8 months.\" They're like, \"Oh yeah, that's the extent of that conversation.\" That's America right there. They're not interesting and they wonder why you don't call. You know what I mean? Come on. Oh no. My parents are doing the opposite thing now where I can't pin them down cuz they're partying. Oh, okay. either they're retired and every once in a while like I I'll never forget year into my dad's retirement. It actually is hypnotic to watch. It's hypnotic, right?",
            "start": 774.72
        },
        {
            "text": "down cuz they're partying. Oh, okay. either they're retired and every once in a while like I I'll never forget year into my dad's retirement. It actually is hypnotic to watch. It's hypnotic, right? I got to stop staring at what Roger is doing. Yeah, Raj's killing it. That zealot guy in the chat says, \"This is legit a KF podcast with the Subway Surfers to keep us watching and I love it.\" That was the goal. So, here we are. I'm going to say this. I'm going to say something controversial. I think we should always have Roger playing Subway Surfers more podcast. This is crazy. I'm not ADD at all. Um, yeah. I remember calling my mom one time being like, it's like it was like 2:00 in the afternoon on a Saturday and she answered and it took a couple times and normally she answers like right off the rip. Sometimes she doesn't hear the phone or whatever and my dad usually whatever. So, I got to call him a couple times. She answers finally. I was like, \"Hey, what do you is there a party",
            "start": 811.84
        },
        {
            "text": "off the rip. Sometimes she doesn't hear the phone or whatever and my dad usually whatever. So, I got to call him a couple times. She answers finally. I was like, \"Hey, what do you is there a party happening in the background?\" She goes, \"Oh, yeah. We're just having we're at a bar.\" I'm like, \"Hey, hold on. Are you drunk right now?\" slurring the speech a little bit. 2:00 in the afternoon on a Saturday. I was like, \"I don't think Hell yeah, Elena. Hey, young lady. Yeah. How are you getting home today? Tables of turn. How are you getting home today? We're probably going to call your brother. He'll come pick us up. I was like, yeah. I was like, yeah, like Matt's not drunk at 2:00 in the afternoon on Sunday. Jesus Christ, I got to worry about them now. There's a good There's a good idea out here in the chat. Uh 7.62. Kami says, \"Would I see the kind of funny as a jury for some kind of jury duty shenanigans?\" That's a great idea that I'd love to put out to the edition system. We It's always",
            "start": 852.24
        },
        {
            "text": "in the chat. Uh 7.62. Kami says, \"Would I see the kind of funny as a jury for some kind of jury duty shenanigans?\" That's a great idea that I'd love to put out to the edition system. We It's always a pain when one of us gets jury duty, but if we can turn it into content, you know what I mean? There's 11 of us and we'll bring in Man, Lucy not a citizen. Tam not a citizen. I can't do those angry man. Yeah. You know what? [ __ ] it. We'll bring in Paula. You know what I mean? Well, Gary's not Gary's a citizen now. I was going to say Fran. Fran could be a love head, but God, we need to decide getting out. Yeah. Yeah. I thought the content was going to be like um how long can we stay in the room or or like who actually gets picked as a juror and base that on who's the [ __ ] weirdest every day we get to record a podcast about what we think of the trial so far. Can you imagine if you guys you guys have done at least the first couple stages of right? You have not. Okay. Uh jury selection is",
            "start": 886.48
        },
        {
            "text": "we get to record a podcast about what we think of the trial so far. Can you imagine if you guys you guys have done at least the first couple stages of right? You have not. Okay. Uh jury selection is an interesting but a little timeconsuming process that can be a little arduous, right? It's not it's not fun. You wait in the thing for a long time. Then they call you into the court and then the judge has a bunch of stuff and then eventually they go, \"Okay, well now they're going to call you one by one of the [ __ ] thing and ask you this question.\" I never got called and at least call and every single person does the exact same thing where they try to have an answer that gets them out of jail, right? racist where like does anyone does anyone have law enforcement that works that you work with like in your family or whatever and you're racking your brain like well one time I dated someone whose dad was law enforcement you know [ __ ] like that right can you imagine how long it would take",
            "start": 938.08
        },
        {
            "text": "like in your family or whatever and you're racking your brain like well one time I dated someone whose dad was law enforcement you know [ __ ] like that right can you imagine how long it would take if if you were asking fan questions about that I would love to film that I would love to film that I would love to film that as a marathon stream and see how long marathon stream like a rever like a reverse marathon stream like a reverse marathon stream was like the more subs we get the fewer questions you ask friend and see how long this goes lemon many calls out we could just do small claims mediation we could be mediators and just turn into a show judge duty you know what I mean do we get to wear the big puffy wigs though if they were over in that fun it's choice on what you want to wear as your judge that's great I'd be judge dread oh that's sick is not the are you watching the cowardly tactics he didn't want to use the hoverboard to do fast he's not even get last coin before the All so",
            "start": 977.68
        },
        {
            "text": "judge that's great I'd be judge dread oh that's sick is not the are you watching the cowardly tactics he didn't want to use the hoverboard to do fast he's not even get last coin before the All so scared this kid. All right. This kid, it's crazy to see uh somebody who used to be Michael Jordan, you know, and look at him now playing like Spud Webb. I thought you were going to say Spud McKenzie. I do like this is a kind of funny podcast idea for a great idea. Upload this as a kind of funny podcast. Just roasting Roger in the corner when you have nothing to talk about. I love this. Did uh did either did anybody watch Jewelry Duty on um Poly Shore? Hell yeah. on uh Amazon Prime. That was the one with James Marson. Yes, I know. But I but I remember you talking about it. I watched the clip. Yeah. Incredible incredible show that uh is getting Sonic at at some at some point which is uh very very amazing cuz season 1 is essentially there is a a fake jury duty happening and uh there's one person",
            "start": 1020.88
        },
        {
            "text": "Incredible incredible show that uh is getting Sonic at at some at some point which is uh very very amazing cuz season 1 is essentially there is a a fake jury duty happening and uh there's one person that is not an actor. Everyone else involved is an actor. Um, and it's this guy, I think his name's Ronald, and he's one of the greatest gets in reality TV show history of just this normal guy that just handled this entire situation just so perfectly, like so earnestly like dealing with the random [ __ ] happening around him, just trying to be a good human being. Yeah. Did you go for it? No, no, no, please. I'm I'm going to stay in the same lane, but switch. Well, just Yeah. James Marsden, the actor as James Marsden is one of the characters. Uh, and it's just the greatest thing ever cuz he just gets to act as this like over-the-top James Mars and this guy's just dealing with it and they become best friends and it's a beautiful story. I hope they still hang out with each other to this day.",
            "start": 1068.08
        },
        {
            "text": "gets to act as this like over-the-top James Mars and this guy's just dealing with it and they become best friends and it's a beautiful story. I hope they still hang out with each other to this day. They I think they do. This guy became a a big deal. This Ronald Ronald was on one of those rand which is on Amazon Prime that also has Justice Judy I believe. No, that's God. Can we can we talk about my weekend for a second? You want to talk about great to bad content. I'm watching this show and I want to claim this one, Greg, cuz 6 months from now you're going to watch it and you're you got more than I do and you get to do all the cool stuff. Even though, you know, we all know, we can all agree, Roger. We've talked multiple times. I do all the heavy lifting in this company. Can we talk about Roger leaving these last coins? Oh my god, Roger, you're lagging behind. Why is this rat afraid of the cookie jar? I want to get in that cookie jar, but it's so big and imposing. Is this rat of the",
            "start": 1113.68
        },
        {
            "text": "Roger leaving these last coins? Oh my god, Roger, you're lagging behind. Why is this rat afraid of the cookie jar? I want to get in that cookie jar, but it's so big and imposing. Is this rat of the cookie jar? Get in the cookie jar. Raj, give me the lid. Give a rat a cookie. I'm watching your friends and neighbors, which is phenomenal. Great show. Great show. Missou, Amanda Pete, great great great show. One of my new favorite shows. Really, really good. Cool concept. But it's not done, right? There's one more episode left in the season. So, I was like, \"Oh, man. What are we going to watch next? Can you give me sorry real quick though? Can you give me the the one the one pitch looks like he's a robber. Is that right? No, he is a well, yes, but he the con of the show is that John Ham is uber wealthy 1% Hampton's uh finance guy, you know, uh not finance, uh investment banker guy, right? Does all the stocks, all that stuff. Uh gets screwed over his Corbin Bernson who plays his boss.",
            "start": 1159.04
        },
        {
            "text": "uber wealthy 1% Hampton's uh finance guy, you know, uh not finance, uh investment banker guy, right? Does all the stocks, all that stuff. Uh gets screwed over his Corbin Bernson who plays his boss. Corbin Bernson in this place LA Corbin Bernson fires major leagues. basically fires him uh takes his uh takes his book basically takes all his clients and says you have you know you have an 18-month like uh non-compete you're screwed right and so but he's going through a divorce uh his his his wife is uh sleeping with like his best friend basically because he was you know it's a lot a lot of backstory but he needs money and he realizes that all of his uber wealthy friends have a bunch of [ __ ] that they don't even remember they have so he starts robbing them yeah nice like he like one of his friends has a Rishard Mill watch that's worth like $250,000. And he goes, \"I bet this guy doesn't even know he has this.\" And so he just starts and they don't have security cuz they live in this uber",
            "start": 1204.8
        },
        {
            "text": "friends has a Rishard Mill watch that's worth like $250,000. And he goes, \"I bet this guy doesn't even know he has this.\" And so he just starts and they don't have security cuz they live in this uber wealthy place where no crime ever happened. So he just like one by one starts robbing them. And it spirals. Drag your husband. I'm live on a show. I'm we're making a note. We're going to watch Friends and Neighbors with Missou's John Ham. Thank you very Corbin Burton it too. Babe, you don't know who that is though. So I watched this. It's great. Tim ain't interesting. It ain't fun. You know what I mean? John Ham's great in it. Olivia Mun's [ __ ] great in it, man. Everyone's good. A man of Pete's phenomenal, right? So, I was like, \"Oh, what's what's Apple TV Plus going to recommend for me to watch next?\" Man, we're on we're on a hot street right here. I had that cool show, The Agency, that I watched that I told Roger to watch, even though we didn't with Michael Fbender. Every show you",
            "start": 1253.92
        },
        {
            "text": "to watch next?\" Man, we're on we're on a hot street right here. I had that cool show, The Agency, that I watched that I told Roger to watch, even though we didn't with Michael Fbender. Every show you murder. I haven't watched that one yet, but I do like that Scarsgard character. And so, I go, \"Oh, I'll just let the TV decide.\" It starts playing the fountain of youth. Did you know this is a movie? Yes, I do. Because every time I watch an episode of the studio, they really want you to watch this. They really want you to watch this movie, Tim. I [ __ ] with Leonzo where we were watching the trailer and I was like, \"It's a live action Tintin movie.\" And she was like, \"Really?\" I'm like, \"Yeah, look at it. It might as well be.\" Start strong. Watch. Yeah. You actually What? You You didn't start strong. Okay. Letici is playing this kind of weird character, but it's fun. Uh I want to say Eliza Gonzalez is in it. I want to say that's her name. She's from a baby driver, I think. Fast. Yeah.",
            "start": 1291.2
        },
        {
            "text": "strong. Okay. Letici is playing this kind of weird character, but it's fun. Uh I want to say Eliza Gonzalez is in it. I want to say that's her name. She's from a baby driver, I think. Fast. Yeah. She's in it and it starts weird. It starts cool and then Natalie Portman's character is introduced and you're like, \"That's interesting. I wonder if she she's his sister and they're sisters of a treasure hunter.\" And it just starts going so incredibly weird and boring that by the end of it, you go, I I didn't pay for this. I mean, I kind of did cuz you you pay for Amazon. Yeah. Yeah. But you don't really pay. But that's the best part about Apple. Every every month they just take money from me. I'm like, you deserve it. I guess. I don't know. Yeah, I don't I tell you what, they don't deserve it for this one. This one went off the rails very, very quickly and just it just became literally the last 30 minutes of Indiana Jones in the Last Crusade, but done so much worse. Yeah, but I'll tell you,",
            "start": 1328.56
        },
        {
            "text": "this one. This one went off the rails very, very quickly and just it just became literally the last 30 minutes of Indiana Jones in the Last Crusade, but done so much worse. Yeah, but I'll tell you, that's a bummer. Yeah, it's a bummer. It starts really It starts strong. You're going to watch this and go, \"Nick's crazy.\" But then by the end of it, you're going to go, \"Oh, I don't even remember what happened the last 20 minutes.\" Great. It's one week before SGF. Please leave me alone. All right. That's great. We'll watch something. You turn around. See, he's you know Ham's good looking still. Oh my god. Are you kidding me? One of the best looking men ever. Some of us have fallen off, but he is very good looking. He's very good. He's the one that doesn't wear underwear. Uh he's always walking around with Oh, he's got a He's got a big sch. He's known for having a big dog. Oh yeah, I saw one of his friends made a joke about that with him recently on something. Well, there was a there was a",
            "start": 1369.68
        },
        {
            "text": "around with Oh, he's got a He's got a big sch. He's known for having a big dog. Oh yeah, I saw one of his friends made a joke about that with him recently on something. Well, there was a there was a whole a bunch of memes going around where he was just walking around some loose fitting. Uh yeah, that's old, right? Oh my god. I was thinking about the hammock. He Let's just put it this way. He was He was He was entering the room before John Ham was entering the room if you know what I mean. Yeah. We got to talk about it. Haven't finished it yet. No spoilers. No spoilers. What was your thought on the fin the whole It's fantastic. They nailed it. But the the show is amazing and it the the finale is spectacular. Like the last two are kind of like a two-parter and they are just such a beautiful bow on such a great season and with such creative ideas. Like I think the studio is utterly fantastic and it is a very special show that is that perfect combination of it doesn't need to go on. It is",
            "start": 1410.56
        },
        {
            "text": "bow on such a great season and with such creative ideas. Like I think the studio is utterly fantastic and it is a very special show that is that perfect combination of it doesn't need to go on. It is going on and I'm very happy about that. Season two they did uh but this season is so good and it the creatives involved have all the right connections that anything is possible. Well, that's what's so fun about the show is that Seth Rogan, he's been he's been a celebrity 30 [ __ ] years and so he knows everyone. He get all these incredible people. Don't spoil it for me cuz I saw the headline like they got a whale of some sort. Oh, I mean I'm not I'm not even referring to anybody overall as the season like they just got I just hope it's like Dave I hope it's like the last season of Dave like what how did he get that? It reminds me of Dave uh in the sense of anything can happen and will happen because of the connections they pull and people's buy in on the show. I think that's like the most",
            "start": 1451.92
        },
        {
            "text": "how did he get that? It reminds me of Dave uh in the sense of anything can happen and will happen because of the connections they pull and people's buy in on the show. I think that's like the most important thing is like everyone like [ __ ] it. But Seth Rogan though, it's different, man. Like Seth does not get enough credit for things. And I know he gets a lot of credit, but he as a producer, I personally give him a lot of credit. When you look at you, he doesn't talk to me at all. In the last couple years, it's mindblowing that even like Ninja Turtles, Mutant Man, Invincible, right? Like he's just able to attach himself and get projects off the ground uh that no one else can really do. And I feel like the studio is such an amazing example of the the form and factor meeting in such a great place where making a show about making shows and movies is always fun, but the level of craftsmanship of camera work in this is non-stop amazing like the one shot. We talked about one episode, but",
            "start": 1494.24
        },
        {
            "text": "place where making a show about making shows and movies is always fun, but the level of craftsmanship of camera work in this is non-stop amazing like the one shot. We talked about one episode, but when you start looking at the amount of one shots throughout the entire show, the whole thing's filmed. Yeah. It's kinetic. You know what I mean? like the motion of this show like that first episode that was about oneshots obviously but like you realize oh my god like this isn't I thought you were like you know how you'll have that episode of TV where it's all following and you're like oh my god they did one shot did you know and then it was like oh that this entire show is like that even if it's not technically one shot right it's this constant we you are hurdling through these episodes as these curb your enthusiasm like events happen every time awesome I like it I like I like that specifically because it allows your actors to act. You let them be in the scene. It's almost like a play, like",
            "start": 1536.4
        },
        {
            "text": "curb your enthusiasm like events happen every time awesome I like it I like I like that specifically because it allows your actors to act. You let them be in the scene. It's almost like a play, like a comedy play, and that's how you feel about this a lot where the blocking and how the camera moves and how we're moving with them. Feels like you're watching a very, very tight stage play. Um, what are you laughing at? You have a lot of coins. This kid keeps learning. Leave him alone. He's learning. You see how many coins I have? Great. He was born 13 years ago. So close. You're going to pick this up. Where's my He's the doogieer of subway servers. You know what I mean? Yeah. Roger. Rogers locked in right now. Remember everyone, Subway Surfers is sponsoring this uh event stream that we are doing currently. Um you get out of the way. This event stream, three guys doing a kind of money podcast and you too can support this time by using the QR code there. uh download Subway Surfers and get a",
            "start": 1580.96
        },
        {
            "text": "currently. Um you get out of the way. This event stream, three guys doing a kind of money podcast and you too can support this time by using the QR code there. uh download Subway Surfers and get a whole bunch of free stuff, including a 10,000 coins, five score boosters, and the the metal hoverboard that uh Raj has been using here. And we're going to keep going. Um yeah, sorry. Continue, Greg. You were talking about something. We were still talking about Studio Kinetic Energy. It's really Yeah. Studio is one of those shows that even before Tim started telling me I had to watch it, I was watching the clips they put up of how they shot the shot. Yeah. Yeah, you know what I mean? So like I know things are coming up with like beans or whatever chili maybe or something and I was watching how they god damn that's awesome. Now to be in it doing it so so much fun and simultaneously like I just feel like we're in such a good time for TV right now where the amount of like prestige drama stuff",
            "start": 1622.4
        },
        {
            "text": "they god damn that's awesome. Now to be in it doing it so so much fun and simultaneously like I just feel like we're in such a good time for TV right now where the amount of like prestige drama stuff happening that is just off the charts is so cool. But the amount of incredibly high quality comedies, I don't think I've lived through a time that I have been this fulfilled by comedy shows week to week. Like studio running alongside hacks. Unbelievable. Don't get me started on hacks. Holy [ __ ] Let's get you started on hacks. Let's start. Oh my gosh. Let's start coin before the pillar. Why? You did it again. Roger. Roger. I'm trying to keep JK Simmons. You're Miles Teller. [ __ ] get the coin. Not quite my beat. Not quite my tempo. Roger. Um, hacks. I mean, I'm right there with you, Tim. We're back, right? There was a while where I was like, \"Oh, is this is this whole premium content thing going to keep going?\" Yeah, it's going to keep going cuz Hacks, no. I love this show. Very dark",
            "start": 1670.8
        },
        {
            "text": "We're back, right? There was a while where I was like, \"Oh, is this is this whole premium content thing going to keep going?\" Yeah, it's going to keep going cuz Hacks, no. I love this show. Very dark this season. Yeah. Almost to the point where I was like, we're making a misstep here. We got to get these characters back together cuz they work together. You got to get them laughing. Uh, the way it ends though. Well, phenomenal. Here's the thing, Nick. Oh, that's right. There is. All signs point to there being another episode. And I just don't understand that. I'm really scared cuz I I have a dark feeling that they're just going to be like, \"Oh, by the way, after this episode comes out, that was the last episode ever.\" No, I maybe that's what they did. I mean, I know there's a different circumstance. Let's not spoil anything for people. Yeah, of course. But but that's what they did for Winning Time. Winning Time was canceled, right? But they didn't tell us until literally the finale",
            "start": 1719.36
        },
        {
            "text": "circumstance. Let's not spoil anything for people. Yeah, of course. But but that's what they did for Winning Time. Winning Time was canceled, right? But they didn't tell us until literally the finale happened. I That was like very fast when it got cancelled. Well, no. They literally can't like they had it already added to the finale of like they do like a post-redit thing of like, oh, this is what happens to all these players and they and then they just release it as the episode ended. This is the last episode it's different. Winning time being cancel. I first off, I hope you're wrong. I hope this is not the last episode. I hope they do one more. I think they can do one more season and I would be very happy with it. So happy. Having said that, actually, if they did wrap it up in this episode, I actually would give them kudos for that cuz I think the story has I think they've done what they need to do with it. I I agree, but I also want to have that next year of like I just like the",
            "start": 1755.28
        },
        {
            "text": "I actually would give them kudos for that cuz I think the story has I think they've done what they need to do with it. I I agree, but I also want to have that next year of like I just like the characters. I just want to I like looking forward to a final season like Succession final season like watching that week to week every Sunday like that was premier television and I I haven't been tuning in like every single week final season. I've been uh tuning in week to week with this one Raj and like I'm with you that like if it ends I'd be okay with it but them promoting a final season of this and sticking to it I think they can pull off some really really cool stuff cuz they just they they are so talented and uh Hannah is so good. I just watched her stand up for the first time and was really impressed by it. Like I I feel like she is incredibly funny and is one of the main writers of Hacks and I think her style of humor is a big part of what makes Hack so damn good. Like it's just such a",
            "start": 1788.64
        },
        {
            "text": "impressed by it. Like I I feel like she is incredibly funny and is one of the main writers of Hacks and I think her style of humor is a big part of what makes Hack so damn good. Like it's just such a standout because they make you care about every damn they make you care about Kayla and Kayla is the best character. She's she went from being my least favorite character and I think this was by design to being the best character on the lassie [ __ ] Yeah. Spit another one. So good. It's so good. Mike walking in. Scanning that code. What are you doing, dude? I love that shirt, by the way. Mike, I'm scanning the code. Mike, everybody. Mike, can you do me a favor? Yeah. Can you get me um a bunch of Cheetos and a cup and a Diet Coke? Yes, that's the breakfast of changes. He's doing this right. That's what I'm looking at. Get out of that, Roger. Get out of the guy. Why is he I know that you're a busy dad man at this point. Uh did you ever give Hack a shot? We did. Yeah. Season one we got deep",
            "start": 1829.6
        },
        {
            "text": "what I'm looking at. Get out of that, Roger. Get out of the guy. Why is he I know that you're a busy dad man at this point. Uh did you ever give Hack a shot? We did. Yeah. Season one we got deep into and just got sidetracked. Liked it, you know. Now, now of course Danny's on season two. Danny Jalice is on season two. It's so amazing. I think he's coming to I think he's going to be at COBS soon. He is. Yeah. Yeah. Yeah. Yeah. Yeah. I'm very excited. This is not season two, by the way. Season three of hacks. We're in season three, right? I think we're four. Is this season four? Yeah, season four. Crazy. Wow. Pretty sure. Interesting. Wild stuff. We are deep into this. We've There's been a lot of stories. There's been There's been so many times where I'm like, \"Oh, this is definitely going to get cancelled this season.\" Like like I remember when the whole Max merger happened or whatever I was like a man if they can't dude seeing Danny though seeing him pop up you know me I'm dumb I don't",
            "start": 1873.04
        },
        {
            "text": "get cancelled this season.\" Like like I remember when the whole Max merger happened or whatever I was like a man if they can't dude seeing Danny though seeing him pop up you know me I'm dumb I don't follow anything if I didn't have YouTube in my life I be [ __ ] I would be lost I'm like how do I get in my car so I had no idea he was going to be on I'm sure people did beforehand I'm sure some he had tweeted about hey guys tonight but he popped up and I freaked out and D was like what's wrong with you I was like that's the problem I was like he's been in the studio I've he's been we've been on show You don't understand. That's like I'm practically on hacks now. They ever say, \"Do you need do you know any who's funny who streams? He's going to say Nick Scarpino.\" Yeah, this guy's great. We need a 46-y old guy to be in this writing room like I'll be the guy that says the stuff. He will be the guy that says the stuff. Dude, what an awesome opportunity for him. And and and obviously just",
            "start": 1908.56
        },
        {
            "text": "need a 46-y old guy to be in this writing room like I'll be the guy that says the stuff. He will be the guy that says the stuff. Dude, what an awesome opportunity for him. And and and obviously just like what a cool thing to be a part of cuz this this this is going to go down as one of those shows. You talk about like a show that that talks about like I I'm a sucker for any show that makes is about a show, right? That's why we like the the studio. That's why I loved Entourage, even though Entourage definitely hasn't aged well. But I'm a sucker for Hollywood shows about Hollywood. And I think Hack does it so right and it does it so right from a comedy perspective also where I think it just has so much respect for standups. And the fact that all the people in the writer room I think for the most part are like wore standups or have had some connection to that and Danny being on it is just so freaking wonder I saw the clip I'm more the clip person on hacks or whatever but the I've been",
            "start": 1949.84
        },
        {
            "text": "most part are like wore standups or have had some connection to that and Danny being on it is just so freaking wonder I saw the clip I'm more the clip person on hacks or whatever but the I've been financing table food whatever the [ __ ] it was. Mr. Table Mr. Table. Yeah. Yeah. I it's also like I don't know like it's it's it's almost like um it's nice to see the way that they've built that uh character progression of Gene Smart's character of like how it it isn't it isn't clean and it is very like messy the way the way that she grows but she does grow season to season and it's almost like it's almost fantastical right like just a little bit like you know what I mean like somebody that is so deep in the trenches and has such a huge community like usually that doesn't really happen but so it's nice to see that happen in a show like that and the way they built that out was great. Well, it's it's interesting because that, you know, they broached the topic of late night and its relevancy",
            "start": 1988.16
        },
        {
            "text": "it's nice to see that happen in a show like that and the way they built that out was great. Well, it's it's interesting because that, you know, they broached the topic of late night and its relevancy and I think they do that very very well. Very well. Um, and that's where I want to transition this conversation to something that I think is very important to talk about and that is the future nay present of late night television and everybody's live with John Melany which is a show that I have been champion championing since day one debuted last year as um everybody lives in LA. Everybody's in LA. Everyone's in LA. Um, and it was a five or six episode run of every night back to back to back. Um, they would have a John Malanyled live show that was actually live on Netflix, like really live. You can call in and you do call in and John Molainy talks [ __ ] at you and that's pretty much it. Uh, asks you what type of car you drive and hangs up and it is utter chaos uh, as a show, but it's",
            "start": 2028.88
        },
        {
            "text": "You can call in and you do call in and John Molainy talks [ __ ] at you and that's pretty much it. Uh, asks you what type of car you drive and hangs up and it is utter chaos uh, as a show, but it's really just the concept of late night shows redefined. And it's funny because Hax kind of deals with that. Yeah. Hax kind of deals with like, hey, we don't need to do the topical timely stuff. It can just be fun everywhere. We just need to have our She literally says that. She goes, I just want to have my friends on that I like and just have them on and hang out and do crazy weird stuff. Yeah. So true. Thank you, Mikey. And so the the concept of um everybody's in LA and now everybody's live with John Laney on on Netflix is now it's a weekly show but he bring there's a topic a big topic and he brings on one expert for the topic and then just a menagerie of comedian guests and the whole point of it is it's not supposed to make sense. The people that he brings on are random as hell and some of",
            "start": 2074.24
        },
        {
            "text": "on one expert for the topic and then just a menagerie of comedian guests and the whole point of it is it's not supposed to make sense. The people that he brings on are random as hell and some of them are kind of funny. Honestly, it kind of is. And it's really crazy watching the show because it does remind me more of what we do than anything I've ever seen otherwise. It is just cuz they're actually live and you just have to roll with the punches and be entertaining and try to do different random gags and like different scenarios and stuff and there's these like recurring jokes uh that happen week to week and the insanity of bits just not working but they're there so they have to commit, right? It just it's so satisfying and it results in not every episode being the funniest thing ever. And I would honestly say like just watching it, the more you sit in it and kind of deal with when it's awkward and bad, it makes the good moments that much better. And that is not a writing it off of",
            "start": 2115.04
        },
        {
            "text": "And I would honestly say like just watching it, the more you sit in it and kind of deal with when it's awkward and bad, it makes the good moments that much better. And that is not a writing it off of like, oh, just get through stuff. It's it it is. And there's something beautiful about when the show comes together because when it gets to the point that it's hitting, it's euphoric. Like there is nothing I give this a watch. The insanity of it. I got Roger on it and he's like freaking binge through it all. It's incredible. Yeah, it's it's also like the way that he does his monologue where it is it is just him just doing standup and trying jokes out for the first time clearly and the stories that he's building out there. It's it's it's really good stuff and he has some of the best writers uh on on any light nature. I forget the oh [ __ ] I forget that duo that's there um that I forget their names but I've been following them for years on on Twitter beforehand and they just made very",
            "start": 2158.96
        },
        {
            "text": "uh on on any light nature. I forget the oh [ __ ] I forget that duo that's there um that I forget their names but I've been following them for years on on Twitter beforehand and they just made very niche and very specific comedy on Twitter that I was like oh man they're really great but no one really talks about them and the fact that they're writing for John Molany on this show and have been for a while it's it's really great. Yeah and it's it's such a brilliant show cuz anything can and will happen. His like right-hand man is Richard Kind who is one of the funniest I met him at a sketch fest party which is wild like absolutely wild. He's so funny and adds so much to the show. Um, no no you, baby. But, uh, one of the the greatest things that happened on the show this season is, uh, like two weeks ago, um, this wasn't even the topic of the show at all, but he was blindfolded the entire episode and for an hour live. The host of this show is blindfolded. a man that normally is reading",
            "start": 2199.12
        },
        {
            "text": "two weeks ago, um, this wasn't even the topic of the show at all, but he was blindfolded the entire episode and for an hour live. The host of this show is blindfolded. a man that normally is reading off of Q cards and normally has a clipboard that can refer to the things he's going to do on the show, but instead for an hour long, he has to go through this show that's already chaotic and hard to control blindfolded on stage. He has somebody walking him around and it's not like we're cutting away from things like we're live on him the whole time. So, we see him kind of like looking the wrong way and having to get adjusted and he just like sticks with it. But what's so funny is it doesn't stop the rest of the show from happening. So all the video clips that they cut to, all the bits they normally do in the show. So he's blindfolded, not knowing what the audience is seeing for a lot of the stuff. Can't see it. Is so funny cuz in the classic like old school sitcom version of late night",
            "start": 2237.6
        },
        {
            "text": "normally do in the show. So he's blindfolded, not knowing what the audience is seeing for a lot of the stuff. Can't see it. Is so funny cuz in the classic like old school sitcom version of late night shows, they always do that. There's going to later tonight there's going to be a Daredevil stunt stunt that we see that has never been done before. And there's this like uh robot controlled like you know in LA there's those like little um ao but for like food delivery. They have one named Samo and it's kind of like a character on the show and they build up the whole time and try to jump over a bunch of cars and they're just explaining all this while John Menni is blindfolded so he just has no idea what's actually happening and they actually do it like so he's like continuing to have to like just kind of keep the show going not knowing if the things are actually happening or not. It is a fever dream that is so hard to explain but it all just comes together as as art. There's no other way",
            "start": 2280.72
        },
        {
            "text": "just kind of keep the show going not knowing if the things are actually happening or not. It is a fever dream that is so hard to explain but it all just comes together as as art. There's no other way to put it. And I need to let you know one last thing. Yes. Because I'm rambling on this and it's important for you to know, Nick specifically. Yes. I'm listening. I'm watching Roger, but I'm listening to your words. Look at that bug go. That as he's been uh getting this uh season going. There's been a lot of bits that just simply didn't work. Uh one of the main bits throughout the season that they they were pushing was called Know Your H. Uh which has been uh your height. Oh, that's Yeah, but know your age was the Is this what they think they got to get guys that are the exact know? It was an epidemic that um Hey, Raj, why don't you do me a favor and focus on the [ __ ] game? All right, how about that? Don't worry about the I'm excited for to see you get your hands on this. I need you to",
            "start": 2325.36
        },
        {
            "text": "epidemic that um Hey, Raj, why don't you do me a favor and focus on the [ __ ] game? All right, how about that? Don't worry about the I'm excited for to see you get your hands on this. I need you to eat some of those. I need you to Also, I feel so bad for Mike cuz I said Cheetos and I meant to say Cheezits and then also I said diet coke and he still went across the street and bought me a diet coke. Even though we have a lot of diet coke, he would have done that. Come on. Cheeits, note action. It's not so much the cheeses. I the diet coke. Remember everyone, we are presented by Subway Surfers. Please use the QR code, download the game, and get a whole bunch of free stuff. They're nice though. Birthday. Here you go, Greg. I got these for you. I don't want those. I'm your best friend. Damn. Roger said, \"Mike, go get me Cheetos and Diet Coke.\" And I said, \"Okay, well, I got Diet Coke here.\" And then I went to the cupboard. Nick and I ate all the Cheetos last week. Did we eat all No",
            "start": 2364.8
        },
        {
            "text": "Damn. Roger said, \"Mike, go get me Cheetos and Diet Coke.\" And I said, \"Okay, well, I got Diet Coke here.\" And then I went to the cupboard. Nick and I ate all the Cheetos last week. Did we eat all No Cheeits? No. I know, but he said Cheetos. And I was You ate all the I also ate all of Course I'll go next door and I'll buy some. No, no. Go to my desk. You not have any Cheezits? Yeah. Break out two packs from my desk. He wants Cheezits now. He wants Cheezits now. Got to pick a lane, Roger. Pick a freaking lane, Roger. I feel like I was high right there. I don't know what was happening. That was incredible. That's the high of subway service that you can experience for free right now and get a whole bunch of different stuff with the code. The thing Yeah. Do the do the QR code, everybody. It's important. Uh, no. Johny thing again. Another show you tried to get me to watch when it was on before. I never had time. And then a couple weeks ago, I got served the Tik Tok of him explaining the uh",
            "start": 2400.64
        },
        {
            "text": "important. Uh, no. Johny thing again. Another show you tried to get me to watch when it was on before. I never had time. And then a couple weeks ago, I got served the Tik Tok of him explaining the uh not boys to men [ __ ] [ __ ] Oh, back boys. Bone thugs in harmony. How they were supposed to come on the show. And uh yeah, that was the funniest [ __ ] I've ever seen, which then led to me now just watching a million different clips. Really appreciated the one where he mentioned his uh kids and he's like, \"Yeah, you know, uh the first one y'all did not like that I had, but the second one you've been cool with.\" I was like, \"Yeah, hell yeah.\" It's so freaking Again, Greg, this is the most Greg Miller show possible. like the level of insanity and chaos and how it all comes together and it just being live and just rolling with it like it reminds me of you and I've never seen anybody besides you act this way and do these things and seeing John Molany do it somebody who I very much respect",
            "start": 2439.6
        },
        {
            "text": "being live and just rolling with it like it reminds me of you and I've never seen anybody besides you act this way and do these things and seeing John Molany do it somebody who I very much respect his work when it comes to his stand um but some of the times when his other more like him writing things I'm not the biggest fan of this is kind of like such a bizarre like this is not his stand up specials it is very very different has he fought the kids yet I know that was okay so that's the is the big bit this season. The big bit this season has been uh to that men need to know exactly how tall they are cuz nobody either knows or they're lying about. They're lying about. Yeah. And so we we tried to get to the bottom of that and eventually he got a perfect line from I think it was uh 5t tall to 7t tall men in a perfect diagonal line down. Now what is he? He's 6'3 and a half 63 and a half. See this is Mike's got in there. Yeah. And then Jimmy Kimmel was like the missing piece. like there",
            "start": 2480.96
        },
        {
            "text": "to 7t tall men in a perfect diagonal line down. Now what is he? He's 6'3 and a half 63 and a half. See this is Mike's got in there. Yeah. And then Jimmy Kimmel was like the missing piece. like there was one height they couldn't get and then people just out of nowhere walks in stands and just completes it allang so stupid and the bit went on way too many weeks and wasn't that funny. Um but the fact that it wasn't funny made it funny but then when they introduced the next bit that they were building to which is by the way everybody tomorrow night is the season finale. Tomorrow night is when it goes down. um the last couple weeks he uh has introduced the idea that for the finale he is going to fight three 13-year-old boy 14-year-old boys. Uh he's convinced he can take threeon-one in hand to hand combat. And uh when he said this all he was like I don't know the legalities of this. We're looking into it all. We're going to try to make sure it's on the up and up but we're not so sure. And",
            "start": 2521.12
        },
        {
            "text": "hand combat. And uh when he said this all he was like I don't know the legalities of this. We're looking into it all. We're going to try to make sure it's on the up and up but we're not so sure. And then the last couple weeks have been uh ending with a video package introducing the 14-year-old kids. they're going to fight him. What's hilarious is I've been on following John Maloney's Reddit just to see what people are thinking of the show so far and uh the amount of people that submitted their little brothers to fight and people that were upset that they didn't get it. It was literally like a email that was like I want to fight John Molini atgmail.com or something. Yes. And so a lot of people were campaigning for this and uh we got our three kids now and one by one they're introduced to him and on the show it's a live reaction from John Molany watching these kids essentially cut promos on him and then you see him have to deal with reacting and talking [ __ ] to these 14-year-old boys",
            "start": 2568.04
        },
        {
            "text": "and on the show it's a live reaction from John Molany watching these kids essentially cut promos on him and then you see him have to deal with reacting and talking [ __ ] to these 14-year-old boys and he is so confident that he's going to take them on and it's going to be the [ __ ] funniest thing. So is it bare knuckle? What are they? So that's well next week they're going to put tomorrow we're going to find out exactly what the rules are. But last week they did a full on uh mockumentary style thing of them coming up with this idea and like dealing with looking through the legalities of it all and they're like we're doing it. So we'll see tomorrow what ends up happening. But I will be there. Oh Mikey, they tricked me. It's harder than it looks. Let's see what I got. I can't wait for one of these kids who was 14 to have been training jiu-jitsu since he was like five and he just murders John Mady. Well, what in the kids got some weight on him, dude? Like 14-year-old is Oh, he's like",
            "start": 2612.0
        },
        {
            "text": "of these kids who was 14 to have been training jiu-jitsu since he was like five and he just murders John Mady. Well, what in the kids got some weight on him, dude? Like 14-year-old is Oh, he's like the He's the big kid in class. He's that kid that got his armpit hair. I forgot like what the weight was, but when they said it, I was like, \"Oh [ __ ] dude.\" Like there's Well, if John is 6'3, he's really 6'3. Yeah, he's like Greg. Yeah, he's he's got to be like 200 lb now. Yeah, he's he's he's going to screw one of these kids up. One of these kids is not Yeah. Cameron Kenny says, \"One kid is 226 lbs.\" How much is When they said that I looked at that kid, I'm like, \"I don't think you're 226, dude.\" Well, I was I was probably 220 when I was in when I was like 14, 15, but I'm not like I was like short. I was just, you know, kind of squatty. Yeah. I don't know. But I I can't wait, man. And the problem is Raj talked about this earlier with I forget what show, but like I can't believe we got",
            "start": 2657.68
        },
        {
            "text": "short. I was just, you know, kind of squatty. Yeah. I don't know. But I I can't wait, man. And the problem is Raj talked about this earlier with I forget what show, but like I can't believe we got more of this show after last. Yeah, this is definitely the last time we're getting another season of this right now. And I'm like that's my thing. I'm like, there's no way Netflix is going to keep supporting us. But I hope that they do cuz it is beautiful chaos. We need to react to this fight live. How do we do this? When When is it on? We need I want to watch this. Ah, it's too late. I want to watch this live with you, Tim. And I want to watch this happen cuz he's going to be so If if they put the 225 kid up, he's going to be so tired after this kid that he's going to get clowned out by the other two kids. Yeah. This kid's video here, we're watching a sign. I've never seen it, but he's he's it pops up with him and a ghee. I don't know. I don't think he's rolling. Let me see the gate. Give",
            "start": 2696.32
        },
        {
            "text": "two kids. Yeah. This kid's video here, we're watching a sign. I've never seen it, but he's he's it pops up with him and a ghee. I don't know. I don't think he's rolling. Let me see the gate. Give it a second. Okay, so this kid's uhoh. Give a second. Okay, he's 56 109 56. He's 109. Taekwond do. Uh Taekwond do. I mean, he could head kick him. Yeah, if there's head kicks allowed. In one of the recent episodes, just to kind of uh prepare the production and filming of all of this, they um set a fake version of it with um stunt actresses dressed as 14-year-old and they like really like surprised him and they genuinely surprised him by just jumping him. Awesome. On the production line. It's not going to go well for Jud, dude. I mean, based on watching this, it's not going to go well, but it's going to be hilarious. He kind of held his own a little bit in this fake fight. He's I mean, look, dude, he's a he's a big dude. Mhm. And that goes a long way. Like I've often tal like I thought run",
            "start": 2734.4
        },
        {
            "text": "going to be hilarious. He kind of held his own a little bit in this fake fight. He's I mean, look, dude, he's a he's a big dude. Mhm. And that goes a long way. Like I've often tal like I thought run through the litany of who I'd want to fight in this office. Roger of course number one, right? I'm just doesn't go for the last coin. You know, he doesn't have that killer. Roger can't get that last coin. I'll risk it for the biscuit. He was just Oh, he left three right there. Oh my god. Well, I'll never forget. Mike, come take the cheese back. He doesn't deserve them. Yeah, Mike. He doesn't get free cheese. I'll never forget the one time that I arm wrestled Greg and I was like, dang, you have bear strength. You're a big dude. Remember we there was one time in IGM where I was like I'm going to take I'm going to take Greg and I like grabbed you throw you and you just kind of like lifted me up and I was like that's a big boy right there. Yeah man, very excited for this John lady business.",
            "start": 2781.52
        },
        {
            "text": "to take I'm going to take Greg and I like grabbed you throw you and you just kind of like lifted me up and I was like that's a big boy right there. Yeah man, very excited for this John lady business. Nectori says, \"So is this the podcast this week?\" No, this is just us hanging out while Roger doesn't get the last coin. Greg, I'm going to give it this to you. I got to go pee. Oh [ __ ] Bring back a problem. Greg, he's doing the dance. He's chicken dancing it. Remember everyone, we are presented by Subway Surfers. That's why this fake kind of funny podcast/real Subway Surfer stream is happening right now. We're hanging out having a great time while Roger Surfs the subway. You can do that, too. Celebrating 13 years of Subway Surfers with the 200th World Tour update. Scan the QR code now uh to get 10,000 coins, five score boosters, and the metal hoverboard that Roger has been using. Cool stuff. Roger, give us the hoverboard. Let me do the hoverboard. Give us the board, Roger. Look at",
            "start": 2815.36
        },
        {
            "text": "uh to get 10,000 coins, five score boosters, and the metal hoverboard that Roger has been using. Cool stuff. Roger, give us the hoverboard. Let me do the hoverboard. Give us the board, Roger. Look at that. Look at that. That's nasty. Rainbow right there. That's sick nasty. That's sick nasty right there, Tim. Yeah. Oh. Oh Jesus. Say no is for you, by the way, Nick. Oh, thank you. How excited are we for Karate Kid Legends this week? You know, it's complicated, Nick. It's very [ __ ] complicated. Cuz I don't want to get too far into this cuz of course we are doing Karate Kid Legends in review later this week. We have not seen Legends yet. We're going to watch it Thursday night when it comes out in theaters. Um, but we're also going to be talking about uh a little optional extra credit homework of watching Karate Kid 2010, the Jackie Chan one. Your focus needs more focus. Um, as well, just for context, cuz Jackie Chan is in Legends. That's the one that I haven't seen up until last night.",
            "start": 2856.56
        },
        {
            "text": "of watching Karate Kid 2010, the Jackie Chan one. Your focus needs more focus. Um, as well, just for context, cuz Jackie Chan is in Legends. That's the one that I haven't seen up until last night. And I don't want to spoil too much, but I will say I am now more excited for Legends than I was. Me, too. Me, too. And And there's two words why. Jackie Chan. Mr. Jackie Chan is just a pleasure to watch on screen. I was reading trivia about this cuz I I love to read the IMDb trivia while we watch movies. And Danielle likes it, too, because she says she doesn't, but she likes it when I say facts randomly. Apparently, there's scenes in this there's scenes in this movie that were shot in like the uh uh I want to say it's called the Forbidden City. Mhm. Uh that no one had ever like hadn't shot in there since like 1987. But because Jackie Chan is so well respected in China, they were like, \"You can do this.\" That's the kind of weight he's pulling. And you forget comedically, dramatically, how",
            "start": 2903.04
        },
        {
            "text": "there since like 1987. But because Jackie Chan is so well respected in China, they were like, \"You can do this.\" That's the kind of weight he's pulling. And you forget comedically, dramatically, how freaking good Jackie is good, man. And I'll say something that might be wild, too. I'll say something about might be wild, too. I will say something that might be wild. I'm strapped in. I think they should make a sequel to this film. I mean, aren't they? No, no, no. I think they should catch up with Den. Yeah, I I be like, where's he at now? I would be very interested. I I know Jaden I know Jaden Smith and the Smiths are very different world. They're different worlds. Again, I don't want to talk too much about this movie cuz we do have the interview later, but like I Jaden Smith is a 12-year-old boy in this movie and I appreciate that he is a 12-year-old boy fighting other 12-year-old boys and I believe it. crack at each other's [ __ ] schools, doing [ __ ] that I I be like, as a mom, I'd",
            "start": 2948.08
        },
        {
            "text": "boy in this movie and I appreciate that he is a 12-year-old boy fighting other 12-year-old boys and I believe it. crack at each other's [ __ ] schools, doing [ __ ] that I I be like, as a mom, I'd be like, \"No.\" Yeah. No, you're not. I'm not letting my child do this. Very surprised at the quality of this film. Not saying it's amazing. It is way too long. It is literally a one for one remake in a way that's kind of ridiculous. Um, but like, hey, not nearly as bad as I thought going into it. That was our assessment as well. Yeah. So, I heard you mention in review, I want you everyone to know out there. All right. And first off, download Subway Servers. Scan the thing. It's free. Help us out. What I want everybody to know is I've been doing some dry runs at Superman review in my head and it's going to be a good good series of podcast. Give me a little no things I want to call out the facts. I got the weird Greg stories about this scene. I'm all over it. I'll tell you right now that uh",
            "start": 2994.56
        },
        {
            "text": "going to be a good good series of podcast. Give me a little no things I want to call out the facts. I got the weird Greg stories about this scene. I'm all over it. I'll tell you right now that uh this week is Karate Kid Legends. Um, and we still got some production schedule stuff to figure out, but it does seem like Superman in review starts next week. Have you seen the first Superman? I have not. The only of these Superman movies I've seen is Returns, and I saw it once. Uh, the second Superman. Yeah. Uh, no. Oh, you mean the the the Superman Returns? The Brandon. Brandon Ralph. Yeah. Uh, man, you're in for it. You're in you're in for a ride, my friend. I think you're really going to enjoy them. I don't know that you'll like them, but I think you'll enjoy them. You think you'll enjoy number one or two? I think he'll enjoy parts of one, okay, which is a bit longer, and there's sequences in it where you're like, hm, is this a poem that they wrote? Yeah, it is. Um, shut up. They're in",
            "start": 3035.84
        },
        {
            "text": "one or two? I think he'll enjoy parts of one, okay, which is a bit longer, and there's sequences in it where you're like, hm, is this a poem that they wrote? Yeah, it is. Um, shut up. They're in love. And then I think he'll get to two and go, \"Wow, this movie is What was that? That was like such a like a jump scare.\" You see what happened? I I I went to the side and I I accidentally paused it and there was a train coming. I [ __ ] up there. Um, I think Son of Dead says Tim didn't see Man of Steel. Remember, DCU is not part of Superman. That's been reviewed in DCU, but we have. Yeah, we reviewed Man of Steel. Um, I think he'll get to he'll he'll go to one and be like, \"Wow, this is a really cool movie.\" Uh, a sign of its time, but cool. I think he'll get to two and really appreciate that and really enjoy the heck out of it. And then he we'll have a lot of questions about three and four. Yeah, that's question about Go, right? That sounds just like the Batman movies. Uh, it's 89 returns,",
            "start": 3083.36
        },
        {
            "text": "really enjoy the heck out of it. And then he we'll have a lot of questions about three and four. Yeah, that's question about Go, right? That sounds just like the Batman movies. Uh, it's 89 returns, right? But I I'm sure they'll be there's a couple characters. There's an actor specifically that was featured predominantly in in in three where you're like that was a bold choice and make him a secondary character in this. We'll see. It's fine. Pet shush. It's on the poster. But like uh a lot of chat asking about Alien versus Predator that is on pause now until we get back to uh we have a lot of uh Fantastic 4, Superman, a couple other franchises. Remember we try to do in review leading up to the release of a movie. So, Superman and Fantastic 4 being on the docket so close in July, we need to start watching those movies. We have time till the next Predator or Alien, right? Yeah. The next is it Predator Prey. No, Badlands. Bad Lands. Bad Lands. Well, there's two actually. There's uh that",
            "start": 3126.16
        },
        {
            "text": "start watching those movies. We have time till the next Predator or Alien, right? Yeah. The next is it Predator Prey. No, Badlands. Bad Lands. Bad Lands. Well, there's two actually. There's uh that and then there's the Well, we're not doing it cuz that's a TV show. We're going to watch it cuz it's cool. I'm I'm planning on watching that. Um also, it's the Dan the Dan Trackenberg thing is Badlands, right? That's Badlands. Yeah. But there's also a Predator the anime movie coming that looks nasty. It looks really cool on Hulu. Uh we will be doing that. That's Have you guys ever seen Badlands Chugs? He's this guy on YouTube. He chugs a bunch of stuff. His name is Badland Chug. He's a Long Islander guy. Pretty cool. Chugs a bunch of stuff. Chug stuff. He won the uh the lemonade drinking contest. Did you know that that existed? No, I did not. With with the uh hot dog eating contest. Yeah, they do a lemonade one. Wow. This is such a 13-year-old being at the dinner table and finally chiming",
            "start": 3168.08
        },
        {
            "text": "Did you know that that existed? No, I did not. With with the uh hot dog eating contest. Yeah, they do a lemonade one. Wow. This is such a 13-year-old being at the dinner table and finally chiming in. Just want to let you know completely taking the conversation that I recognize as I watch YouTuber stuff. I know you don't know this because you're you're the producer for a lot of our more serious content. But this is literally the conversation that happens in the office when you guys are doing Games Cast every freaking day. I send Mike a bunch of dumb stuff that he's seen 6 months ago and he pretends like he hasn't seen it. And then they show me these clips and we have just a great time, you know? It's really, it's the subway surfers of it all that's really pulling this uh this vibe together cuz I do witness that all the time, Nick. I will do and I respect I respect your you abstaining from all of those conversations. You're the one person in this office that you're a tough nut to crack.",
            "start": 3208.64
        },
        {
            "text": "cuz I do witness that all the time, Nick. I will do and I respect I respect your you abstaining from all of those conversations. You're the one person in this office that you're a tough nut to crack. We don't get you. We don't get you in the shenanigans that often. Yeah. You got blessing in the car today, though. I got blessing in the car today. Blessing and I are slowly but surely becoming best friends. Oh my god, Tim, what happened there? Oh, I thought I thought you were dipping under some sort of wire. I was like, is there just puking over there? [Laughter] Having a fun time. We're having a great time. This is fun. Subway Surfies do this more often. Yeah, we got to have fun. Maybe I'll call the game. Subway Surfers. Subway Safies. Subway Safeties. So, uh, what if they just sponsored every kind of funny podcast? Yeah, I was going to say one of the official podcast sponsors. You guys got the money, right? This seems like it's been a popular game. Yeah, people are liking it. I'm",
            "start": 3247.44
        },
        {
            "text": "every kind of funny podcast? Yeah, I was going to say one of the official podcast sponsors. You guys got the money, right? This seems like it's been a popular game. Yeah, people are liking it. I'm liking it. Christian, make it happen. All right. Well, see, even Neoi says it. You guys should do every kind of funny podcast with the subway surfers on the side going forward. Oh [ __ ] I don't want this one on my permanent record. I wasn't. This is my I give me a warm up there. You just handed me the phone like a crazy. Lot of coins. Lot of coins. Jump into it. I just told you respect that I need to warm up. Roger. He's got a lot of coins actually. He's doing pretty good. You can dish it, but he can't take it. Yeah, exactly. If you know what I mean. You shot your [ __ ] face. You're on my side. All right. The only mobile game he's played is that DC one. You don't know. Also, the thing about it this way, Greg, if you do well here, it actually reflects on Roger. So, if you tank it, it makes",
            "start": 3294.16
        },
        {
            "text": "All right. The only mobile game he's played is that DC one. You don't know. Also, the thing about it this way, Greg, if you do well here, it actually reflects on Roger. So, if you tank it, it makes it look like Roger did. Yeah. Yeah. No, no, no. I wouldn't play. What kind of phone is this? It's a Google Pixel. Okay. Mhm. You like it? I want to know if you like it. I mean, I don't You thinking about getting out of the uh Not a chance. Not a chance. Are you kidding me for life? Of course. See, I did that thing where I was an iPhone person, then I went to Android, and then I was like, I want to go back to iPhone pretty recently. And then I just immediately abandoned ship really fast. Yeah. Why do you want to go back to iPhone? I did want to go cuz I was like, oh, it's like the ecosystem. I can get I can get a MacBook that has the M1 chip. I can do it all. But then I just was there and I was like, \"Oh, I can't customize basic [ __ ] about my phone.\" Okay, I'm done. I'm done. I just Yeah,",
            "start": 3334.48
        },
        {
            "text": "get I can get a MacBook that has the M1 chip. I can do it all. But then I just was there and I was like, \"Oh, I can't customize basic [ __ ] about my phone.\" Okay, I'm done. I'm done. I just Yeah, but some would argue that if you can't customize, it's cuz you don't need to customize. Yeah, exactly. Cuz it's a waste of your time. Let a corporate overlord let me know what's happen. I can I can answer my text messages on my p my computer. It's great. Yeah, I turn that off cuz it's annoying. That's all I want. What that's the literally the only reason I want I keep Well, not the only reason you I can't podcast to do it. It's hard. It's hard everybody. I take back 90% of what I said about Roger, but I had an extra 10 because he's short. Oh, whoa. I'm not short. So now you're 20. Know your age? What's your age? I'm not and a half. Um but I was going somewhere. You know that if I added half that's not right. I'm lying right there. Try it one more time. You got this. No, no. I want to",
            "start": 3372.0
        },
        {
            "text": "age? What's your age? I'm not and a half. Um but I was going somewhere. You know that if I added half that's not right. I'm lying right there. Try it one more time. You got this. No, no. I want to Whatever we were just talking about, I wanted to keep talking. You're talking about handoff for the iPhone like answering texts on your laptop. Anyways, yeah, I love that. That's Oh, it's not the only reason I use it. Yeah. Yeah. So if I didn't have Gregway every day where I put do it on my phone and then wirelessly send it over. So I do and then if I the text the text is what kills me cuz it's just so much of business for this company happens on the phone. It just drives me crazy when I I had to have like whip out the phone over and over again. I I'm with you. I should do that down B movie you're talking about. That is a little roll right there. I'm with you for the most part. But I've had a new phone. I got this phone probably about a year ago. Uhhuh. And ever since it synced to my laptop",
            "start": 3409.12
        },
        {
            "text": "talking about. That is a little roll right there. I'm with you for the most part. But I've had a new phone. I got this phone probably about a year ago. Uhhuh. And ever since it synced to my laptop in a way that I don't think I'll ever understand. And by that I mean my laptop desperately desperately wants to use my phone for the microphone for everything I ever do and I cannot figure out how to turn it off and it's beating me down. It's to the point where I just I'm I'm I'm legitimately thinking like should I just buy a new laptop and not sign into it? Laptop everywhere you can just talk to your phone. No, it's But like there have been so many times where I'll be on like a Discord call and they'll be like, \"I can't hear you.\" I'm like, \"I just don't understand why.\" But like it sounds really muffled and I'm like, \"Oh, it's cuz my stupid phone's in my pocket and it wants my phone to talk through it.\" You turn that shot. I figured out eventually. It's probably a hand off, but it took it",
            "start": 3449.04
        },
        {
            "text": "muffled and I'm like, \"Oh, it's cuz my stupid phone's in my pocket and it wants my phone to talk through it.\" You turn that shot. I figured out eventually. It's probably a hand off, but it took it took a second. But I was It's one of those like it's not that big of a I could have figured out until I figured it out. Well, it was just a little bit of a nuisance. So, you punt it and then it was a little bit You punt it. You punt it and finally I had to sit down and just do it. Man, you're actually I'll say this. First off, I did better than Roger did. That was a better run than Roger did on his fourth run. So, just put that out there. Put them side by side, everybody. That's crazy how you skipped New York and you went straight to Hollywood. Wow. Westollywood. West Coast. West Coast. Hey, I'm in New York. I ride the subway. Hey, life. That's New York. I love it. All the Giants. Hey, the Jets. It snows and I complain all the time about the snow. Best city in the world. Hey, we put our",
            "start": 3492.0
        },
        {
            "text": "I'm in New York. I ride the subway. Hey, life. That's New York. I love it. All the Giants. Hey, the Jets. It snows and I complain all the time about the snow. Best city in the world. Hey, we put our trash right out of the street. We don't do that, right? As soon as I moved here, I was like, \"Oh, this is what a normal city should be.\" Insane. It's disgusting to do anything else. Just Eric Adams doing the do the thing where he's Jesus Christ, the [ __ ] hot Cheetos got me. [ __ ] Help him. Help him, Mike. Eric Adams like posing next to a [ __ ] uh the recycling bins and the trash bins that they just recently got. He's the mayor of New York. He's the one that had Didn't he have some controversy? Yeah. Yeah. They were like, \"Oh, yeah. He's in the pocket of the Turkish government.\" Yeah. Whatever. The rules don't exist anymore. Don't worry about it. Eric Adam. Maybe we like Russia. Maybe we hate Russia. We don't know. We don't know where the hell we're at with Russia. We don't know what we",
            "start": 3526.88
        },
        {
            "text": "The rules don't exist anymore. Don't worry about it. Eric Adam. Maybe we like Russia. Maybe we hate Russia. We don't know. We don't know where the hell we're at with Russia. We don't know what we think about him. Putin, very bad guy. I love him. He's my best. It's my favorite. Oh god. Greg, you're freaking it. Is that what freaking it is? Yeah, that is what freaking is. You killed it. Is that the definition of freaking it? You just see a freaking it moment. Can you jump over those little hurdles? Yeah. But you choose to go underneath them. Well, because there's ones that look suspiciously like those that you have to go underneath. So, I've trained my mind to go. Yeah, exactly. To go low. Cuz shorty got low low. What's the What's the poem, Greg? Where are you? Why do you fly? You fly like a bird. Shut up. We always talk about no future spoilers. All right. Shut your [ __ ] face right now. Don't you hate that? No. Tim will love it. Tim understands products of the time and he won't",
            "start": 3572.08
        },
        {
            "text": "like a bird. Shut up. We always talk about no future spoilers. All right. Shut your [ __ ] face right now. Don't you hate that? No. Tim will love it. Tim understands products of the time and he won't appreciate it. I mean, he's not going to vote it like the best movie of all time, but nor should he. He'll be respectful of it, but secretly well, he'll hate it. Oh, [ __ ] Why did I do that? I was feeling good about that, though. I got 15 cases on. You did a great job. Here. You want to try, Nick? No, thank you. Get out there. I need to hydrate. What's my water? What? What do I What am I doing here? Do do New York. I'll give it a shot. I know you will. I like to watch Tim do it first. Why is this phone so heavy? Cuz it's a Google Pixel. because you could change the color of the the He had a phone that was really good, but he decided since he couldn't change it from gingerbread to cookie dough, he was like, \"Well, I got to get out of here.\" It sucks because you're so right. How to change",
            "start": 3613.6
        },
        {
            "text": "phone that was really good, but he decided since he couldn't change it from gingerbread to cookie dough, he was like, \"Well, I got to get out of here.\" It sucks because you're so right. How to change a background on a phone. So [ __ ] right. Oh my god. I needed to customize everything. I did pick up Leonza's phone recently and I just couldn't believe how light it was. I was like, \"Wow, this is what a phone could feel like. I don't know why. Why the [ __ ] my phone? This is like the the newest one. Is it cuz it have a massive hard drive in it?\" No, this is the newest one. This is like the Pixel. This is their version of the iPhone. This is the Google Pixel 9 or whatever. I don't know why it's so heavy. I just thought that that's what phones are. Is that not part of the what you pay for? No, I just I just thought I was getting a nice little phone. Yeah, it's nice. That heft is what allows the customization you love so much. They put the chips in there that you could use. That's when you",
            "start": 3654.96
        },
        {
            "text": "I just I just thought I was getting a nice little phone. Yeah, it's nice. That heft is what allows the customization you love so much. They put the chips in there that you could use. That's when you can't jump over the chips. Oh, no. Tip. Uh Sacho says, \"Are the Superman movies on a streaming service?\" Uh yeah, they're on HBO Max. Yeah, I'm pretty sure they are. Him just [ __ ] up. But I own all the DVDs if you want to come. You call this [ __ ] it up? Look at me getting my goddamn coin. You could have gotten the magnet, though. You didn't have to do that. Yeah, don't worry about it. Remember when he kept leaving those coins? Don't listen. See, now he got the magnet. Look at him. He's going to feel like a new person. Oh, dude. I feel like a new person. I don't like we're doing this on his phone. We're getting Roger all the credit. We could do it on your phone. Yeah. You want to You want to fire it up on your cool iPhone? No, I got nudes on there. I got a a nude on there. I know. You",
            "start": 3687.36
        },
        {
            "text": "phone. We're getting Roger all the credit. We could do it on your phone. Yeah. You want to You want to fire it up on your cool iPhone? No, I got nudes on there. I got a a nude on there. I know. You send it to me monthly. My wife's tip. All right, let me try this. How do I do this? Are you doing it? I'm going to try. Yeah, I'm draw. He's going to freak it. And then you just choose. You could do the New York try to finish off. Uh J67 in the chat says, \"Every time I'm confronted with an Apple device, I have an allergic reaction.\" J, shut your [ __ ] face and stay in the basement. Oh, you should go left. Yeah, and then you can roll down. These [ __ ] losers watch us go up. On the real though, the conversation between Android and iOS uh I I feel like is simultaneously at the most and least interesting point it's ever been at. No, absolutely. Where just like uh the consoles, right, with like Xbox and PlayStation, it's like, \"All right, cool. We're just at a point that it's so similar. We're",
            "start": 3725.36
        },
        {
            "text": "point it's ever been at. No, absolutely. Where just like uh the consoles, right, with like Xbox and PlayStation, it's like, \"All right, cool. We're just at a point that it's so similar. We're talking about just like little differences and like sheer things where undeniably it's better here or better there.\" But I feel like a lot of it is just whatever side you've leaned into more is going to be the better experience. And also like the thing about iPhone, it's not a knock. Does not mean [ __ ] on it, but it's true. Like eventually they're going to get all the cool Android features, right? They're going to do an Apple big deal when we get them. And that's kind of where it's at now, right? Like I feel like we're already we've been at I think for years at the point that phones are just great. Like it's like even the lower entry phones are like everything you really need. So if you get the high-end Android versus high-end iPhone, they're essentially the exact same experience. It's just are",
            "start": 3776.24
        },
        {
            "text": "Like it's like even the lower entry phones are like everything you really need. So if you get the high-end Android versus high-end iPhone, they're essentially the exact same experience. It's just are do you get the uh continuity and handoff that Apple has or do you get the ability to dive deeper into customization? But at this point, iPhone does have 90% of the customization [ __ ] anybody would want to do unless you're trying to do some legal [ __ ] Oh, right. I don't know about that. You know what I mean? Some there, you know, different launchers and stuff, you know. For the record in the chat, Jay hasn't written back yet because he tried to and it it crashed cuz it's not an iPhone. Yeah, I can't do that. No, you can't. You have to roll down. Oh, you have to roll down. How do I backwards? Uh, just Yeah. Down. Uh, Shantra says, \"And Android handoff's not that bad, too.\" I'm not saying it is at all. In fact, I'm saying like I feel like both are equally great. It's just if you have a",
            "start": 3811.04
        },
        {
            "text": "Uh, just Yeah. Down. Uh, Shantra says, \"And Android handoff's not that bad, too.\" I'm not saying it is at all. In fact, I'm saying like I feel like both are equally great. It's just if you have a Mac, an iPhone is better. Like there's just no denying that because of how the continuity works. Sure. Yeah. And also like AirPods, like I am such a audio file guy. I care about headphone tech more than most techs besides OLED, which you guys already know about how much of a sicko I am there. But like the reality is like this is a straight up fact. I own very nice, very expensive earphones. Like the best of the best. And four out of five times I end up using the AirPod Pros instead. AirPod Pro 2 are so damn good. The noise cancelling, the level of quality that it has, like it's that perfect definition of it's good enough. I'd say it's great enough and just the ease of use and how it can connect to your different devices. I am blown away at how impressive. That was the biggest loss when I",
            "start": 3851.12
        },
        {
            "text": "of it's good enough. I'd say it's great enough and just the ease of use and how it can connect to your different devices. I am blown away at how impressive. That was the biggest loss when I moved away from iPhone was going to there and being like, \"Oh, I can use my headphones, my my AirPods, but they don't do like the automatic turn off when I take them off or whatever.\" I don't know. It sucks. Yeah. Well, you went to the Kansas of phones. That's on you. All right. All right. You know, look, see how heavy my phone is? Come on. So much technology. It's crazy how like slow like we've just kind of petered off in terms of like excitement in terms of the phones market and updates where I was watching a MKBHD video where he was like breaking down iOS 19 and I was like a man let's so excited to see what I'm going to get and he's talking about for most of it animations of the swiping up uh to switch between different apps. I'm like damn that's where we're at now. perfected me. And that's the",
            "start": 3901.12
        },
        {
            "text": "see what I'm going to get and he's talking about for most of it animations of the swiping up uh to switch between different apps. I'm like damn that's where we're at now. perfected me. And that's the thing is like we really did get to a point where like so much of the the tech in it is so crazy advanced and like things that we never thought we'd get on a mobile side. Like the 120 Hz refresh rate on phones, it is such a difference maker. Like going back to like an iPad mini that is 60 Hz, just sliding through the different uh like pages of your just doing this, you feel the difference and you just get used to that 120 Hz and it's like, do you need it? No. But the second you have it and it's now readily available, it really kind of breaks you and it's like, \"Oh, wow. This is like the standard of where we're at with these things.\" I say that I like nod at you, it's true. But also, I have my phone at 60 Hz, I believe, just cuz of battery life. The battery life. Yeah. I just I just My",
            "start": 3946.64
        },
        {
            "text": "of where we're at with these things.\" I say that I like nod at you, it's true. But also, I have my phone at 60 Hz, I believe, just cuz of battery life. The battery life. Yeah. I just I just My phone never needs to be charged, but it's cool. I mean, real time. I cannot believe how long my battery lasts on my phone. And in addition to that, how easy it is to charge it. Like if I like this whether it's wireless or just plug in USBC so damn fast. No I Yeah, it's true. It's true. Tim, what do you think is next in technology? Holograms. I mean, I think it's AR. I I really think that it's all the Yeah, the uh people in the chat asking about the XR glasses. I think that that is we're already and it's just going to iterate. I feel like when once the glasses become wireless and work as well as like XR currently does um I really feel like that's going to be the biggest real quick just to say this uh Google did its IO event last week which was their like their GDC for tech stuff where it's like",
            "start": 3988.32
        },
        {
            "text": "XR currently does um I really feel like that's going to be the biggest real quick just to say this uh Google did its IO event last week which was their like their GDC for tech stuff where it's like it's more like on the developer side of things and they were they redebuted but like for the first time really committed to Android XR which is their version of this and it's just like glasses is, but you have a heads-up display like giving you like maps to where you're going or your your notifications or whatever. And like that is going to be the next step that I think is going to take over everything and just become normal. It's not going to be like a weird crazy outside thing. It's like just expected to be there. I can't wait to see how much less I pay attention to my wife when she talks. If I when I have those things in my life, you're going to be a nightmare. You are going to be a nightmare. You'll have you'll be on podcast. We'll be buying pants. One time I was looking at P. It just",
            "start": 4033.84
        },
        {
            "text": "I when I have those things in my life, you're going to be a nightmare. You are going to be a nightmare. You'll have you'll be on podcast. We'll be buying pants. One time I was looking at P. It just was in an email. I was checking my email. You're on your site. I got emails all the pants. That was a very compelling ad. Oh, Roger freaking it. Look at Roger freaking it. Rosel says, \"Can't you already use XR with Android?\" Yes, you can. But Android XR is like more of a I'd say right now Xal glasses are more of just like hey having a big external monitor as a screen. The XR stuff is more working in the ecosystem of your phone already of like giving you working more like a watch your smartwatch is worth at this point. Yeah. This is the promise of Google Glass come to fruition. Hell yeah. Thank you for looking like dorks with it to get us here. Tell you what, got a good soundtrack this game. You can see how people play. It's very fun. It's funny. When Google Glass was first like being",
            "start": 4081.68
        },
        {
            "text": "Thank you for looking like dorks with it to get us here. Tell you what, got a good soundtrack this game. You can see how people play. It's very fun. It's funny. When Google Glass was first like being introduced, one of my first thoughts as a kid was, \"Oh my gosh, like what's going to happen people go to movies? Like they're just going to record entire movies.\" But now like the Minecraft movie, people just just take out their phone. No one gives a [ __ ] Who cares? Record everything. Did you watch the Minecraft movie? Yeah, I did. I did a review. I liked it. Mike watched it last night, too. Did he? Yeah. How many How many parts did he watch it on TikTok? I think he just bought the entire thing. Oh, he just bought it. Bought it in. He's having a weekend. Talk about a weekend. Biggest Memorial Day weekend for movies. Last one in a long time. Yeah, I saw that. I went crazy. I saw so many movies. You watch movies? Did not watch Friendship still. I didn't watch Friendship. I watched Final",
            "start": 4130.4
        },
        {
            "text": "Day weekend for movies. Last one in a long time. Yeah, I saw that. I went crazy. I saw so many movies. You watch movies? Did not watch Friendship still. I didn't watch Friendship. I watched Final Destination Bloodlines, Willow and Stitch, and Mission Impossible again. Oh wow. How was Final Destination? Final Destination was [ __ ] incredible. I want to see it. Unfortunately, it's not 40x anymore cuz of Mission Impossible and Lilo and Stitch. Yeah, I'm really upset. Real talk, I want to watch it again. It is such a theater movie and we saw in a pack theater. Thank god the reactions to this [ __ ] I think it's the best Final Destination movie. It's goofy as hell, but godamn. It delivers in every way possible. As you know, I make Danielle watch horror movies all October. Just starting the first one. I actually I start the psychological trauma a week ahead of time. One or two weeks. I starting them up and then she doesn't know it and then eventually when she looks at all of our cues and",
            "start": 4173.92
        },
        {
            "text": "one. I actually I start the psychological trauma a week ahead of time. One or two weeks. I starting them up and then she doesn't know it and then eventually when she looks at all of our cues and they're just horror movies, she understands that it's coming. But that's definitely one that I'm excited to watch and I think she'll really enjoy. It is a perfect example of how you do a Final Destination in 2025 where it's like you don't need to know anything about the old ones. It totally works on its own. The connections it does have are very clear and you don't need to watch any freaking recap or anything to understand it. It's just like it's embedded in it and enhances it, I think. But just the sheer plot of this one, I think, is as complicated as it needs to be, but not a step further. Like, it is like perfect to get you where you need to go. The amount of creative deaths in it is utterly insane. Like, it's they they really really cooked with this one. I don't remember where we left off.",
            "start": 4219.44
        },
        {
            "text": "it is like perfect to get you where you need to go. The amount of creative deaths in it is utterly insane. Like, it's they they really really cooked with this one. I don't remember where we left off. What was What happened in the last Final Destination? Do you remember? Spoilers for the last one. Uh, that's the one where is it the log one? No, that was number two. This is the one that is revealed that it connects to the first one. It's actually a prequel and at the very end they're getting onto the plane that Deon Saul was on. Oh, that's such that's such good storytelling. That's awesome. Yeah, I thought there would have been one in between that and this. No, Timy's subway surfers in the chat. What up? What up? Thanks for making it happen, Christian. Remember everyone, we are presented by Subway Serpers because a a best friend just like you uh works there and loves it and loves us. So, if you love us, support them. That's how that works. Free game download. Scan the QR code, get the",
            "start": 4260.16
        },
        {
            "text": "Subway Serpers because a a best friend just like you uh works there and loves it and loves us. So, if you love us, support them. That's how that works. Free game download. Scan the QR code, get the free game, and get a whole bunch of cool stuff, including 10,000 coins, five score boosters, and the awesome metal hoverboard that Roger's been using in this fun little stream here. Uh, but yeah, Fall Destination Bloodlines, I haven't stopped thinking about it. Like, I I just need a group of people. We need Here, I'm going to say something crazy, Tim. And uh, you started half of your sentences today with that. I'm going to tell you something crazy. I'm going to say something a little crazy. You need to focus on your game before officer McGre's over there put you in Subway Surfer jail again. What are you going to say? The state the state of good horror movies that are coming out right now could be better. I want more. I want more. Could be better. I don't know about that. We're kind of in a",
            "start": 4311.76
        },
        {
            "text": "are you going to say? The state the state of good horror movies that are coming out right now could be better. I want more. I want more. Could be better. I don't know about that. We're kind of in a great spot. They just keep coming out. I want more. We get the movie uh the next director movie by the people that made Talk to Me. Yeah. Yeah. Which I'm very scared about. Did you watch the um the the Hugh Grant one? Herodic. Was it good? That movie sucked. Okay. I It's It's one that I watched the trailer a bunch. I'm like, \"Not tonight.\" Maybe one day. Good to know. He does a Jar Binks accent in it, though. Oh, he does a full on Oh, he says, \"You should say Mr. People going to die.\" Pretty close, actually. Yeah. Crazy. Get in there. Great. The whole thing. I say, I'm going to go to Hawaii this time. Oh, speaking of, how was Lilo and Stitch? Lilo and Stitch was great. I think easily the best of the live action remakes. They make some, without spoiling anything, pretty wild changes. I think",
            "start": 4353.92
        },
        {
            "text": "time. Oh, speaking of, how was Lilo and Stitch? Lilo and Stitch was great. I think easily the best of the live action remakes. They make some, without spoiling anything, pretty wild changes. I think that people are incredibly being overly dramatic about it. It's a different thing, but I understand some people being rubbed the wrong way about certain choices, but I feel like majority of people didn't watch the movie and are just commenting based on a headline that it's like, okay, that lacks any of the context of the of the movie. Having said that, just watch the animated one. Like, I feel like it's it is just better. Oh, no. Yeah. No, Ben likes the animated one. So, we know I know Lilo is stitching it, but the actress that plays Lilo in the movie is freaking fantastic. And I think she's going to be a star. Like, there's something about her. She just has that it factor. God damn it. Um, and if you don't watch the movie, just watch press interviews she does about the movie. It's",
            "start": 4398.4
        },
        {
            "text": "she's going to be a star. Like, there's something about her. She just has that it factor. God damn it. Um, and if you don't watch the movie, just watch press interviews she does about the movie. It's incredible. Lean in my ear and tell me the the the spoiler thing. No, it's way too complicated. What do you mean? You said it was a headline. Yeah, tell me the headline version. But the implications of Tell me the headline. Tim, I won't get mad at Lilo and Stitch. Tell me the headline. No. No. Nick, go find out. You know what, Greg? I got you on this one. I'm going to do a cursory search on this and then render an opinion. Why are people not Tim could step in right now and save this company, but instead I'm going to render my opinion on the concert. We will grind this Subway Surfer stream to a halt until I know if I should be mad at Lilo and Stitch. Can I tell you something? Is it the [ __ ] headline? Cuz that's what I asked you to find. You've done nothing. I I'm I'm in a mood where I",
            "start": 4437.76
        },
        {
            "text": "a halt until I know if I should be mad at Lilo and Stitch. Can I tell you something? Is it the [ __ ] headline? Cuz that's what I asked you to find. You've done nothing. I I'm I'm in a mood where I don't want to torture Tim. We torture him enough. You're weak. I know. I'm sorry. I am very so much so weak. So freaking weak. I never Lilo and Stitch. I just never got into it. It was way way too far after my time of being in this movie. But I never watched it. So Ben wanted to watch. What? I was going to die. There's nowhere to go there. That's a bug. Yeah, there's a bug. Subway there. What's happening? Tell the subway. You can do a hoverboard if you double double tap. Would that got me over the It would have Yeah, you get one free obstacle. Yeah. I I watched Fallen Nation Bloodline and then Lilo and Stitch was a back toback. Did you see Mission Impossible again? Uh what did you watch Mission Impossible? Yeah. 40X. No, just normal. But I watched the two the Final Nation and Lilo Stitch",
            "start": 4481.52
        },
        {
            "text": "Lilo and Stitch was a back toback. Did you see Mission Impossible again? Uh what did you watch Mission Impossible? Yeah. 40X. No, just normal. But I watched the two the Final Nation and Lilo Stitch literally back to back. Oh, wow. One ended and I was just like, do we want to go to the next one? [ __ ] it. Let's do it. And uh I I think that that uh was not great because Final Destination, I walked out, we were like, \"Fuck yeah, let's go. Movies are back. They didn't go anywhere, but they're [ __ ] back.\" And then watching Lilo and Stitch leaving, it was just like What time you walk out of both of those movies? Like what was the 1000 p.m. was the walk out of Final Destination? Lilo and Stitch was a little after midnight. You watched Lilo and Stitch at a 10:30 showing. That's crazy. That's when you want to make sure there's no kids at the show. Yeah, there were kids though. Oh yeah, there are some bad parents out there. I always I always channel I always channel my I don't have kids",
            "start": 4521.36
        },
        {
            "text": "when you want to make sure there's no kids at the show. Yeah, there were kids though. Oh yeah, there are some bad parents out there. I always I always channel I always channel my I don't have kids relationship. Whenever I see a kid that's out past 8:00, I'm like, \"What are these parents thinking? How are your kids should be in bed right now?\" I don't know what time kids are supposed to go to bed as soon as as early as possible. Is that Yeah, that's what you do. Why don't you keep them up till 2:00 in the morning so they wake up on your time? The kid can miss first period. I almost had it. I almost had it. Are you one of those people that thinks that kids start too early? That I think they wake up too Well, there was a whole there's a whole movement right now of like in like in education where they're like, \"Why why do kids supposed to freaking be at school at 7:00 in the morning?\" Dude, it's disgusting [ __ ] It's bad. Yeah. Like I I think thinking back to high school like the Why do",
            "start": 4562.4
        },
        {
            "text": "they're like, \"Why why do kids supposed to freaking be at school at 7:00 in the morning?\" Dude, it's disgusting [ __ ] It's bad. Yeah. Like I I think thinking back to high school like the Why do we have to wake up to get a kid across the city to like my first uh in high school, you eventually you can choose your classes and like not do this. As soon as I could start at 8:45, I did start later. But there was like two semesters where I was expected to be there and it started at 6:45. Insane. And I had to take a bus to get there that was like a 45minute journey. That [ __ ] was crazy. And everything everything that all the science is like oh kids need like 10 hours of sleep and you should not be like you know depriving them of that. And then all of a sudden they're like yeah we we got to get this kid to school at 3:30 in the morning. What is happening? Yeah. like that those times. And in addition to starting at 6:45, we would then get out at like 1:15. Yeah. What are Why is a 16-year-old",
            "start": 4600.8
        },
        {
            "text": "this kid to school at 3:30 in the morning. What is happening? Yeah. like that those times. And in addition to starting at 6:45, we would then get out at like 1:15. Yeah. What are Why is a 16-year-old freaking out at 1:15? So, you can go you can go uh steal some [ __ ] from a Walgreens. That's what we used to do. That's what they all used to do in uh when I lived in the marina. You just watch it, but you just wait. Yeah. Getting out is 3 3:15. Like, what? Why did we counterprogram the No, your parents could pick up, right? Oh, no. 5:00 work a day. Yeah. If I had my dr wave a magic wand and go back and do like kids don't have to report your school till 11:00 and you go till 600. That's it. Like, you know, be great. You solved it. Easy. I solved it. 6. Yeah. 6 is a little too late. Well, how long was school? School was 8 for me. It was 8 to 3, right? [ __ ] it. Have them figured out. 11:00 a.m. 3:00 p.m. I mean, school in. Get out. Can any adult focus on [ __ ] more than that? Why are we",
            "start": 4645.28
        },
        {
            "text": "long was school? School was 8 for me. It was 8 to 3, right? [ __ ] it. Have them figured out. 11:00 a.m. 3:00 p.m. I mean, school in. Get out. Can any adult focus on [ __ ] more than that? Why are we asking kids to do what we are not willing to do, sir? Exactly. Well, he's flying. He's doing the thing, man. He's jetpacking around. If I gave you a blank map of the United States, how many states can you Greg can do all 50 of them? We do. No, no, we do. This is a kind of funny podcast. Yeah, I I got like 47 of them maybe, right? Jared Petty claimed he got them all. Jared Petty started with Russ. Somebody watched in the comments like he actually got one wrong and he's a cheating lying bastard. And that's why we're like, \"Jared, you're never on the show again.\" Yeah, that's why we never had him back. I got like Danny talks about ham too much. I got like 10. Leonza got like five. That uh uh our dinner guests, they both got like 47 48 something like that. The way he said that, that sounds",
            "start": 4694.4
        },
        {
            "text": "him back. I got like Danny talks about ham too much. I got like 10. Leonza got like five. That uh uh our dinner guests, they both got like 47 48 something like that. The way he said that, that sounds like he's having a very nice dinner. And then Mike, our dinner guests I made I made lasagna. It was huge. It was huge. Way too much cheese. We were So, let me ask you this question. Bathroom is awkward. You invite you invite some people over to be your dinner guest. You say you you entice them with homemade lasagna and then you make them fill out a map. Oh, they wanted to. They were They were They're huge nerds. They were very excited. You got some dorky ass friends. Oh, yeah. I do. As soon as I mentioned cuz Mike and I did that during the stream. Um Mike got 46, by the way. Mike did great. No way. Yeah, Mike got 46. No way. He loves this land. He was It was incredible. It was It was incredible. Patriot here. It was a moment. I I would hope he would uh be able to cuz he walked it across",
            "start": 4732.08
        },
        {
            "text": "No way. Yeah, Mike got 46. No way. He loves this land. He was It was incredible. It was It was incredible. Patriot here. It was a moment. I I would hope he would uh be able to cuz he walked it across all of America. He did. The biggest issue though, one of one of the states that he [ __ ] up, but he just didn't know. He just didn't know that New Jersey was a state. Very few people do. Is Rhode Island a state? We don't know. Yeah, we don't know. That's up in the air. Is Washington DC one? We don't know. It's not. It's a Providence. The District of Columbia people. Unless, you know, Isn't that one of the things Trump wanted to rename to? Called the Called the District of America. Oh, I thought it was a state. No, it's it's a weird little It's like the Vatican. It's like a city within a city. God damn it. How's that new pope doing? He's from Chicago, so that's pretty cool. We got an American pope now. Yeah. Yeah. Pretty sweet. He's anti- AI. So that's Does he speak English? No. That",
            "start": 4773.44
        },
        {
            "text": "city. God damn it. How's that new pope doing? He's from Chicago, so that's pretty cool. We got an American pope now. Yeah. Yeah. Pretty sweet. He's anti- AI. So that's Does he speak English? No. That sounded bad. When he does anything at the Vatican, does he speak English? Uh that I don't know. I watched the first um like the first two um speeches he did, he didn't speak in English, but then he like had a little thing where he said like a sentence or something. Okay. Doesn't he speak He speaks quite a few languages, right? Well, yeah, but I mean I didn't know if he had to do everything Latin over there. I I meant very not specifically does this man know how to speak English. I mean does as he still does everything in life. Hell yeah. Christian Subway Surfers in the chat says my heart is so full right now. Thank you so much for everything you've done for me. Heart Christian, you are the best. Christian, thank you for being awesome to work with. Remember everyone, we are presented by",
            "start": 4813.52
        },
        {
            "text": "so full right now. Thank you so much for everything you've done for me. Heart Christian, you are the best. Christian, thank you for being awesome to work with. Remember everyone, we are presented by Subway Surfers. Scan the QR code, get all the cool stuff, including the metal hoverboard that Roger's been using. A whole bunch of coins. There it is. Look at that. You can be that cool, too. Remember, it's free just like the game is free. So, you should do it even if you're never going to play the game again. So, we help Christian. But you should play the game cuz it's really good. You should play the game cuz it's good. And then, as you said earlier, maybe they maybe Christian sponsors every kind of funny podcast and we just dunk on Roger the entire time. I would love that. Can I turn the attention toward Chris Anka? Oh, wow. Oh my god. Let's just air the grievances with this Tracer. You know, as you guys know, we wrapped up our Pokemon stream last week. Yeah. Congratulations. Woo. Beat",
            "start": 4854.24
        },
        {
            "text": "toward Chris Anka? Oh, wow. Oh my god. Let's just air the grievances with this Tracer. You know, as you guys know, we wrapped up our Pokemon stream last week. Yeah. Congratulations. Woo. Beat the Elite 4. It's a little cumbersome, but we had a good time. I've come to rely on Chris Ank as the weapons arbiter, and I've come to rely on him basically for his friendship as confident. You know, he's a confidant. We talk a lot about Mike offline and just say, \"What are we going to do with our problem child?\" True, he can name 46 states, but does he know that there's Diet Coke in the other fridge? We don't know. I'm playing Cyberpunk last night and I get to a crossroads. Now, as you know, Cyber Punk has been through a lot of iterations, right? They've they've uh retoled the game and I I I haven't played it since probably the version 1.0. Check. Sure. So, I get to a crossroads where there's a skill check. Mhm. And you have to be level 17 to make a decision and I go, I know Chris Anka has",
            "start": 4889.28
        },
        {
            "text": "played it since probably the version 1.0. Check. Sure. So, I get to a crossroads where there's a skill check. Mhm. And you have to be level 17 to make a decision and I go, I know Chris Anka has played this game nine times. I bet I'm like, should I respe my character and make this choice? Is it important enough to do that? So, I text him and I wait and he's playing Marvel Rivals or whatever as he always is, you know. And I see Mike in there too on the Discord and I was like I don't want to jump in Marvel but I won't make a movie. I'll just play it. Yeah, that's Chris Anka watch. There's more mustache happening. He loves it. But I text him. I say Chris urgent. I need you. I have ma massive decision paralysis right now. Do I respspec my character right now? Cuz you only do it once. They go you can do this one time and you can redo all your points basically if you had the old character whatever basically. So you can replay it. You want to do netrunner run. You want to do whatever. Doesn't",
            "start": 4929.84
        },
        {
            "text": "can do this one time and you can redo all your points basically if you had the old character whatever basically. So you can replay it. You want to do netrunner run. You want to do whatever. Doesn't get back to me. finally gets back to me. Lol. I never did that side mission. That's all I got. Big fan. That's all I got from him. You hate to see it, you know, from a man who works maybe 45 minutes a day. Most of it's just ideation, too. Roger. It's not drawing, you know. I put pen to page. So, I put up on his social this Spider-Man shrine the other day. I was like, man, third movie would look good there if that was done. Why don't you go draw that? Deleted your comment. I just said it out loud. Show it to Ben. I'm like, look at this guy. That's pretty good. Ben, you're going to laugh about this in 30 years. God, monsters. Oh, I know. Don't be like that. What it is. Don't be like that. Don't be like that, Tim. Tim, give into your hate. We're your Palpatines. Let us be your Palpatines.",
            "start": 4974.32
        },
        {
            "text": "this in 30 years. God, monsters. Oh, I know. Don't be like that. What it is. Don't be like that. Don't be like that, Tim. Tim, give into your hate. We're your Palpatines. Let us be your Palpatines. We're your palyps. Oh, man. Oh, I got to get a colonoscopy this year. Yeah. You're not there yet. You're four years, do you? Yeah. You want to go together? Yeah. Greg was supposed to get with me, but he but he whisted out of that. We're going. No, it's just that we didn't find the no the no touch basectomy or whatever. The no touch basecto. [Applause] What? What? Do they just incept it into your brain? What is this? No. No. No cut. A no cut vasectomy, right? Where they like can do it like Wait, what? You can do that? Yeah. Yeah. What? Sorry. Then I went and like Jen didn't come with me. So the doctor gave me all and I came. She's like, \"How'd it go?\" I'm like, \"Oh, it's great. It's scheduled for this day.\" She's like, \"Fantastic. What did they say?\" I'm like, \"Oh, well, they're going to",
            "start": 5021.04
        },
        {
            "text": "doctor gave me all and I came. She's like, \"How'd it go?\" I'm like, \"Oh, it's great. It's scheduled for this day.\" She's like, \"Fantastic. What did they say?\" I'm like, \"Oh, well, they're going to give me, you know, general anesthesia and knock me out and then they're going to give me three cuts.\" She's like, \"That is not how this should go. You do not need to go under They do not need to knock you out, right? Going under anesthesia is incredibly dangerous. You do not need to do that for this procedure.\" So, we cancel my guy and I've never done it again. So, you're just live. You're shooting live rounds now. Jesus. We call it we call it Russian roulette. We sure do. We sure do. Talking about Greg's basectomy was a a weirdly huge conversation point this weekend. Nice. Uh or yesterday, I guess. We were at for Kevin's birthday um with a group of people for for a very nice lunch. And um somehow Greg's wiener working came up. I talk about all the time. You know what I mean? Not in that",
            "start": 5069.84
        },
        {
            "text": "guess. We were at for Kevin's birthday um with a group of people for for a very nice lunch. And um somehow Greg's wiener working came up. I talk about all the time. You know what I mean? Not in that way. There's not a day goes by think about your your piece of work. I appreciate that. I appreciate And then it it was just one of those classic situations, the classic Tim and Kevin situation of one of us saying something and then the other one correcting what the first person said to a degree that did not matter at all. And I've never had that seen that happen. I'm taking credit here. I'm taking credit as the wrong one. Was I? I don't know. But I'm taking credit for it for the sake of this conversation. Um but what was just a statement that wasn't even supposed to be the topic of conversation. It was just more of just like a a thing that was said where if I remember correctly it was just like oh yeah like I think what was said was Greg's going to get a Greg got a vasectomy getting a",
            "start": 5106.08
        },
        {
            "text": "It was just more of just like a a thing that was said where if I remember correctly it was just like oh yeah like I think what was said was Greg's going to get a Greg got a vasectomy getting a basectomy something like that continuing going on and then there was the correction of like well no he was going to but this didn't happen next thing you know we're 30 minutes into time about Greg's peak shik okay just staring at you yeah people don't even know Greg you know what I mean I think G is the only person there that that knew Greg at this point so it's just like all right here we are having way too detailed conversation that none of us are full on the memories of how It happened, right? Anyway. Oh, interesting. So, there late great Henry in the chat says that sort of vasectomy is easier to reverse. We don't need that [ __ ] reversed. No, it's just more that I just Yeah. Once I sell this car, I'm never I'm never going to get the car back. Exactly. I don't need I don't need to drive.",
            "start": 5149.68
        },
        {
            "text": "to reverse. We don't need that [ __ ] reversed. No, it's just more that I just Yeah. Once I sell this car, I'm never I'm never going to get the car back. Exactly. I don't need I don't need to drive. Yeah, exactly. Exactly. That's where I'm at, too. I'm think I'm trying to think I got to do the colonoscopy. I think I want to do the vasectomy this year as well. At the same time, I'm thinking I'm like I'm out. You got to put me out. I'm out, right? I'm on my side. Just Just pull my other leg up and get in there and scrap it out. Front and back. Front and back. Yeah, get the front and the back. I think they call it a double team. You know what I mean? This is a great Jean Clive Damn movie. The double team. Oh, I'm fine. The cops on you, bro. It's the inspector. Inspector. Yeah, inspect my gadget. Wolf Fox. Uh, Greg was second to be brought to you by Subway Surfers. Christian, if you want to talk, I'll you can be in there. We let you sponsor. I'll be playing the whole time. You can sponsor",
            "start": 5188.4
        },
        {
            "text": "Wolf Fox. Uh, Greg was second to be brought to you by Subway Surfers. Christian, if you want to talk, I'll you can be in there. We let you sponsor. I'll be playing the whole time. You can sponsor my colonoscopy if you want. That's a real Subway surf. [Laughter] Get out of here. That was good. That was good. Oh lord. Yes. You know it was Roger. You're not focusing on me right now. I hate it. Oh Nick. Oh Nick. Oh everyone. It is transfixing. It's not. It really is. It really is. Time has stood still. Zach Brown says, \"Can Kevin figure out the streaming capabilities for Nick's colonoscopy?\" I wonder, are we allowed to show Brett and Link got a colonoscopy together and they did it like as content? I don't know like what degree they like. I got to talk to him, but you can get it done. Yeah. Well, we went and got Mike's uh vision check done and we were able to film that. They were very lovely. But I think that's I'm sure we'll be allowed to film it to some extent, but like are we allowed to",
            "start": 5224.92
        },
        {
            "text": "we went and got Mike's uh vision check done and we were able to film that. They were very lovely. But I think that's I'm sure we'll be allowed to film it to some extent, but like are we allowed to show the inside of Nick? Why not? It's medical as long as you use the correct terminology. These kids want to learn something. You can't call it You can't call it my my dark tunnel or anything like that. You got to refer to it as my lower and upper colon. It's got to be educational. It has to be educational. Tunnel. We can't talk about Tim Greg's piece of leak anymore. We have to use the proper term, massive hog. The clinical term. Thank you. Yeah, the street term. Okay, what am I on today? Oh god, that's what we needed for this stream. It's fun. I'm having a good time with you guys. Oh, this could be the kind of funny podcast. We don't need Andy. We just need Subway Surfers and Roger. Roger. That's it. Give me something. We need our teen son Roger streaming Subway Surfers. I'd love it if",
            "start": 5288.96
        },
        {
            "text": "could be the kind of funny podcast. We don't need Andy. We just need Subway Surfers and Roger. Roger. That's it. Give me something. We need our teen son Roger streaming Subway Surfers. I'd love it if Roger was my kid. That'd be I'd love it, man. I'd be so proud of myself if you were my kid. Well, can you think of a better son than Roger? I have one. Yeah. I mean, I like my son a lot. I don't have a son. Roger is a woodworker. He works with his hands sometimes. He's so good. How's the table going, Ro? It's going well. Actually, I'll have it done by Thursday. I thought about you. I thought about you uh uh yesterday when I was on on on the John cuz I was scrolling through some reels on Instagram that were 10 years old and some guy was talking about how he tried to make a table to get make some extra cash on Facebook Marketplace and it's all wonky and [ __ ] and no one wants to buy it. I was like, \"Yeah, that's what I would do.\" That's Roger. That's Roger. Are you going to sell the table",
            "start": 5336.96
        },
        {
            "text": "extra cash on Facebook Marketplace and it's all wonky and [ __ ] and no one wants to buy it. I was like, \"Yeah, that's what I would do.\" That's Roger. That's Roger. Are you going to sell the table or is it going to go in someone's house? Uh it's going in uh When do you guys When do you When do you graduate to chairs? Uh I could I could go cuz I went to wood one, which is the table, right? And then I did wood too, which I could have made a stool, but I didn't want a stool. A table's harder than a stool. Um, bigger. No. And then uh then I went back to Wait, no. To what part? No. I feel like a a chair would be harder cuz then it's more structural. But a stool is a table. Stool table. It's just a mini table, but it's like round. That's the issue. A table can be round. But like this table is not round, right? So it's which is rectangular. Yeah. So it's just Yeah. Yeah. You're just you're just slapping together. Yeah, slapping together uh some piece pieces of woody glue together. So, yeah,",
            "start": 5380.48
        },
        {
            "text": "round, right? So it's which is rectangular. Yeah. So it's just Yeah. Yeah. You're just you're just slapping together. Yeah, slapping together uh some piece pieces of woody glue together. So, yeah, if you think about that. Yeah. So, I'm sorry. I went from table and I went to making the thing and then now table. Didn't you go to Marrakesh? I did. Me. I was going to send you to Marsh, but now I'm playing this cuz for me, I did go to Marrakesh. We'll go there next. But I could have made this table as a as a chair. That's what he he he looked at us and he winked at us. He was like, \"If you don't want a table, you could make it a very small table that you can sit on.\" You're like, \"What is there a governing body that's going to step in here and be mad that you're It was weird. I was He was It was like kind of like a don't talk about it, but like you can make you can make a little chair.\" And I was like, \"That's weird.\" Like what what's that about? I want to go to one I I would love to have",
            "start": 5426.32
        },
        {
            "text": "like kind of like a don't talk about it, but like you can make you can make a little chair.\" And I was like, \"That's weird.\" Like what what's that about? I want to go to one I I would love to have more time to do woodworking stuff. That does sound fun. You should come with us next time. I would You think Leansa would like to spend more time with me? Yes. Yeah, I think so. Yeah. We get along very well. We get along very well. She talks about you all the time, hanging out with you. She talks about your brother all the time. Oh, I'm sorry. See, I don't like that. See, that's where it starts getting scary. No, she loves it. She She's having the best time of her life. Jen's doing a bunch of work with your brother as you probably know. Yes, I do. And so, it's very hilarious to see she's like slowly wakes up to who Matt Scarpino is. Yeah, I love Matt. He's so professional. Then she'll be another be like, I don't know. He's such a call. I'm like, yeah, Matt's weirdo. Matt, when Matt starts",
            "start": 5466.96
        },
        {
            "text": "slowly wakes up to who Matt Scarpino is. Yeah, I love Matt. He's so professional. Then she'll be another be like, I don't know. He's such a call. I'm like, yeah, Matt's weirdo. Matt, when Matt starts getting to know you, I was like, \"Yeah, just wait.\" When he starts getting to know you, when he starts feeling comfortable, that's when the real Matt comes out. Oh my god. My brother at your wedding was just something else. Yeah, I was going to say he was very comfortable. Something else. I look I look over and he's just It's night. He's hanging out outside with Andrew, Renee, and Joey smoking cigarettes. I'm like, \"What are you doing? What are you doing? You're 50 for Christ's sake. You can't be doing stuff like that.\" Meanwhile, Roger won't give me a vape. I wish we had a babe. Subway have an office vape. In the chat says, \"Uh, when you get all the suitcases, just crash and go to the next city.\" Well, Greg just did that a little early, but yeah, just a little early. Go to Marrakesh now,",
            "start": 5502.24
        },
        {
            "text": "office vape. In the chat says, \"Uh, when you get all the suitcases, just crash and go to the next city.\" Well, Greg just did that a little early, but yeah, just a little early. Go to Marrakesh now, though. Yeah, you can just keep on going. Yeah, you can try out Vancouver. I want to do Marrakesh. Have I said that enough? Okay, I'm sorry. You like saying that word? Marriesh. Marrikesh. Indiana Jones went to Marrikesh. Did he? I don't know. I feel like he said Marsh in one of the movies for sure. Perhaps. I should know because I was on most of Indiana Jones and Review. How did you like Did you like Did you enjoy that piece of content for yourself? I had a lot of fun. Bye, Roger. Bye, Roger. All right, but I miss Andy. You know, I said a lot of things out there. I didn't mean I want Andy. I really meant that. I wish Andy was my son. If Andy No, hold on. Don't get too ahead of yourself. If we If you know, God forbid somebody steps in like you got to adopt one of them. You're not adopting",
            "start": 5545.04
        },
        {
            "text": "really meant that. I wish Andy was my son. If Andy No, hold on. Don't get too ahead of yourself. If we If you know, God forbid somebody steps in like you got to adopt one of them. You're not adopting Andy. No, no, no. I don't think not for God forbid. Not for my sake, for Andy's sake. I think Andy really I think Andy has a threshold with me. That has lessened over the years. I think that is true. Whereas I think Roger genuinely enjoys hanging out with me because the gonzo nature of it. Not cuz it makes it better, but because I think that Roger spends the majority of his life living by like a strict code with like discipline and then he hangs out with old Uncle Nick. And it it begs the question, how many times can you go to Starbucks in one day? 10, 15? I appreciate you say a strict code of discipline when it's really like Roger lives by a lastditch effort at discipline and it takes the softest of breezes to blow him completely off royal. Roger complained to me the other day. He goes,",
            "start": 5586.8
        },
        {
            "text": "discipline when it's really like Roger lives by a lastditch effort at discipline and it takes the softest of breezes to blow him completely off royal. Roger complained to me the other day. He goes, \"We have he's like people need to stop bringing donuts into the office.\" The next day he slacks general. I'm bringing donuts in the office. No one bring donuts. And then Greg was like, \"I already brought donuts in the office so don't bother getting the donuts.\" I'm like, \"Roger, you crumbled so fast.\" Yeah, I crumble really fast. You're the problem is great gets me. That's actually the truest thing that I've ever heard said about me on any podcast. Oh, thought I had it. You got 420 though. 420. Let's go Paris. Who do you think's the most disciplined person in office? We know we know too much about each other. We know all of the times we've all fallen. Yeah. And why do we fall? Master Roof. We get back up. I'm going say Barrett. I'm going to say Barrett also. I think it is Barrett. I was",
            "start": 5626.96
        },
        {
            "text": "about each other. We know all of the times we've all fallen. Yeah. And why do we fall? Master Roof. We get back up. I'm going say Barrett. I'm going to say Barrett also. I think it is Barrett. I was going to say Nick, weirdly. No. No. Let's shut that down. That's not That's not it to me. We can see. But yeah. What's your case for me there, Rod? I was going to think I was saying comedy. I I work ethic for comedy. That's true. That's true. And also, you know, you've kept the weight off. I have kept the weight off. Yeah, I see I see you eating I see you eating ground beef and and avocado. I've got some in the fridge. Don't think I'm not eyeballing. The other day, you know, here's the thing about Mike. First off, we can all agree Mike's the least disciplined. Yes. Second off, he's such a a little son of a [ __ ] We're We're hang Roger tells him the story. They're hanging out and what what was the context for him? It was uh during the marathon stream, right? They're ordering food. Yes. And",
            "start": 5676.48
        },
        {
            "text": "son of a [ __ ] We're We're hang Roger tells him the story. They're hanging out and what what was the context for him? It was uh during the marathon stream, right? They're ordering food. Yes. And and and Roger goes, \"Should we get a salad like Nick would?\" And Mike laughs at me and goes, \"Oh, poor Nick.\" Like it's some albatross, some bane of my existence that I'm trying to eat healthfully. Yeah. While they're ordering Denny's at 2:00 in the morning on purpose. On purpose. Not accidentally. God. Jesus Christ. We had so much fun. I'm excited to see what we're going to order next time. Oh god. I'm excited for you guys. We keep on We keep on dancing around Red Lobster, but I get scared. Ordering Red Lobster is like such a choice that I'm concerned about. It's a bad choice. It's fine. Nothing travels worse than fish. Yeah, it can't be that bad. You have to get fish. What if it's lobster, which is a crustation and not a fish? Oh, look at the big brain on Greg. God, this is hypnotizer.",
            "start": 5726.88
        },
        {
            "text": "travels worse than fish. Yeah, it can't be that bad. You have to get fish. What if it's lobster, which is a crustation and not a fish? Oh, look at the big brain on Greg. God, this is hypnotizer. Yeah, it is funny how like we'll be talking all of a sudden all three of us or four of us just looking at it. [ __ ] is Greg's doing. Oh [ __ ] Oh [ __ ] Jesus Christ. The jump boots. It's the jump boots. We're playing it easy down here. We're playing it easy. Manuel says you can taste the bankruptcy at Red Lobster. Oh my god. Once they took away the endless shrimp, it's over. They're back now, baby. You think the endless shrimp helped or aided in the bankruptcy? Still a thing. They said it aided. Yeah. Oh, I don't doubt it. Endless anything is just not a great idea. Yeah. They were like, they just had this economy. We just had a bunch of people just sitting sitting at tables ordering endless shrimp. Not a good idea. Oh, that's a terrible idea. I used to go there every year for my wedding bar.",
            "start": 5779.28
        },
        {
            "text": "had this economy. We just had a bunch of people just sitting sitting at tables ordering endless shrimp. Not a good idea. Oh, that's a terrible idea. I used to go there every year for my wedding bar. That was my birthday dinner. Just endless shrimp at Red Lobster. The other ones with the biscuits. Yeah. I got those biscuits. Got to risk it for the biscuit. I think the only time I've ever been to Red Lobster is when we took Meg. Yeah. And we ate those biscuits and you guys wouldn't shut up about the biscuits and I was like, they can't be that good. They were. They're good. They were good. Ah, [ __ ] me. I'm very anti- Red Lobster. We're continuing. Oh, wow. It's been one of the He's anti Red Lobster. I just am, man. I've had very bad experiences. You're more of a red. I don't think I've ever had a Oh, yeah. Oh, Red Robin to this day. I rock with To this day. To this day. Oh, yeah. What are you ordering? Cuz what we ordered that was a mistake. You get burgers. Well, yeah, of course.",
            "start": 5826.8
        },
        {
            "text": "ever had a Oh, yeah. Oh, Red Robin to this day. I rock with To this day. To this day. Oh, yeah. What are you ordering? Cuz what we ordered that was a mistake. You get burgers. Well, yeah, of course. Also, do you get the pizza sometimes? That's what I'm saying. No, no, no, no. You get the burgers, right? What's the burger you order? I get the smokehouse burger there. I think I order the same thing, too. It was like just a double bacon cheeseburger essentially kind of. But it has barbecue sauce on. Yeah. And it's the special bun or whatever. Yeah. Big fan of that. Big fan of their their endless fries. Yeah. Good quality fries. Good stuff though. They are. That was crazy. You're crazy. I was thinking about Olive Garden, but Olive Garden isn't around here. Well, Olive Garden will always have a special place in our heart. You missed out on the glory days. You missed out on the glory days of my stones. Whenever the season would come for the never- ending pasta. Oh, baby. It changed people.",
            "start": 5866.24
        },
        {
            "text": "a special place in our heart. You missed out on the glory days. You missed out on the glory days of my stones. Whenever the season would come for the never- ending pasta. Oh, baby. It changed people. Whenever Andrew Renee came over, she wanted to go. You guys want to go to I couldn't say no. There was a moment where we flirted with going to Chevys instead and then we all agreed Chevys is not that good. Every time we've done it, it's been Yeah. very disappointing. I'm I am now firmly never going to Chevys again. Me and Roger went to the Outback Steakhouse. It's exactly the same. Hell yeah. Kind of terrible. Mhm. And just super The best that could be said about the Outback Steakhouse is it's very easy to get a seat. And their bread's all good. The bread's so good. Their wings are good, too. I mean, you guys want to go to bed? I'll take it out. We splitting a bluin. Oh my god. Can you do a half blooming now? That's crazy. Why would you do a half? Why would they even bother? Your your",
            "start": 5901.04
        },
        {
            "text": "I mean, you guys want to go to bed? I'll take it out. We splitting a bluin. Oh my god. Can you do a half blooming now? That's crazy. Why would you do a half? Why would they even bother? Your your arteries are already fogged. You might stay back, cop. Freaked out. Damn it. Where am I? This shit's happening through me. Good job. Good job. Jesus Christ. I felt that. I was alive. I was alive. That was loud. Try Rio. Jessica says, \"I can't do Outback.\" Longhorn. Yes. Longhorn Steakhouse. There's one for you. I don't I don't even know what that is. That's a They had that in Chicago, but when Outback was happening, it was Longhorn was our local one that we went to. Not local, but you know, it's still chain room. Where's Texas Roadhouse? Anybody have an opinion about that? Never been to one. We went there. Yeah, we went to one when we went skydiving. Indoor skydiving. A better way to polish the skydive. Yeah. Yeah, it was fine. She did before. And then you told me the story of how um was it",
            "start": 5939.28
        },
        {
            "text": "went there. Yeah, we went to one when we went skydiving. Indoor skydiving. A better way to polish the skydive. Yeah. Yeah, it was fine. She did before. And then you told me the story of how um was it at Texas? It has. It was just a separate I went to one in Texas. Yeah. No, that's not the story. The story you were telling me is how Kevin would mod his PSP and hack into other TV other TVs to fix them. Yeah. Like, so I mean this is not going to surprise any of you guys, but whenever Kevin is in a public place and a TV is not on the right channel or has a much display on or too remote, anything that's like wrong about the TV, Kevin feels the need to fix it. And back in the day, he had his PSP, his [ __ ] not Vita, not his PSP modded to be a universal remote and he would use it to like change the inputs on TVs at a freaking Texas Roadhouse or whatever. Dude, that is that is what you would see in like a Disney Channel original movie. The fact that that was real and that was your life is",
            "start": 6003.36
        },
        {
            "text": "the inputs on TVs at a freaking Texas Roadhouse or whatever. Dude, that is that is what you would see in like a Disney Channel original movie. The fact that that was real and that was your life is insane. So funny. And like to be clear, he wasn't like causing chaos. He was like trying to solve a problem. Yeah. Uses his knowledge for good. I support that. I support anytime you turn true motion off of a TV. This TV over here just keeps on turning it back on. I don't know what's happening. Oh, that's my nightmare. Bring in PS bring in the PSP. Yeah, bring in cabin's PSP. Do you have a PSP lying around? Yeah, he never not has PSP. Yeah, he has 14 of them. Uh, I mean, if you don't I think it the only I have a double of a PSP Go if you don't mind a PSP Go. No, not the same. I can't It can't be used as a universal remote. I got to play Splinter on it. Gotcha. I got to do you already have the UMD for No, I'm gonna buy them all. I'm gonna buy every Splinter Cell game. I want to like have them",
            "start": 6043.52
        },
        {
            "text": "used as a universal remote. I got to play Splinter on it. Gotcha. I got to do you already have the UMD for No, I'm gonna buy them all. I'm gonna buy every Splinter Cell game. I want to like have them all in every console. I'm thinking about getting an endgauge, too. I feel like those have to be rare, right? Yeah, definitely. They're rare, but I'm pretty sure they're easy to get. Okay. You know, I just think by definition of sheer quantity of them out there, I wonder what happened to all the PSPs I left at IGN. Totally theirs, don't me wrong, but like what where are they at now? Yeah, I mean, they're in a bin somewhere probably. I'm going to text Dave Tulle. You ever seen the end of Indiana Jones won? Yeah, that's what it looks like. That's what it looks like. Yeah, text and see if you can get a picture for us today. It's during my time at IGN, which was a long time, the organization and just like upkeep and preservation of all the games they had was so unbelievably abysmal. And I just",
            "start": 6095.84
        },
        {
            "text": "get a picture for us today. It's during my time at IGN, which was a long time, the organization and just like upkeep and preservation of all the games they had was so unbelievably abysmal. And I just I could never believe that nobody was taking it seriously enough with the amount of things that they had. Raj, I'm walking around looking at him like they have every GameCube game ever. I'm like, These things are worth thousands of [ __ ] dollars and they're just sitting here like some of them I skew, some of them like just open or whatever. Shout out to uh cuz I was on the gameplay capture team so that like library of games was kind of like uh ours kind of like upkeep and stuff. Uh the person who started with me back at IGN, uh Joshua Moy, I think was might have been the first person in years to take that [ __ ] seriously and he spent like any of his free time organizing the [ __ ] out of that library. He got into a pretty good place cuz yeah, when I went back years later, it was so much",
            "start": 6141.68
        },
        {
            "text": "to take that [ __ ] seriously and he spent like any of his free time organizing the [ __ ] out of that library. He got into a pretty good place cuz yeah, when I went back years later, it was so much better and people actually cared. And it was like so funny cuz clearly it was a generation of kids that work there now that like grew up with YouTube which had a very different mind when it comes to video games and like retro games and just like the value of them and all I think than the people that were working there currently who could not give a [ __ ] less. And man, it was crazy ass times there. I'm not going to say what was taken or wasn't taken from that room, but some people might have took some things, you know. I mean, it happens, right? Like, you know, I used to sell the game. You just need 10 copies of bad. Give me nine of those. Literally 10 of these. There is so much [ __ ] God damn, dude. Oh man. God. Incredible. Oh, look at you. Look at these little pictures of you. I love",
            "start": 6185.28
        },
        {
            "text": "need 10 copies of bad. Give me nine of those. Literally 10 of these. There is so much [ __ ] God damn, dude. Oh man. God. Incredible. Oh, look at you. Look at these little pictures of you. I love I'm sending you an asset drop of the IGN library from I remember them making No, that's not right. I remember them making the library and thinking to myself, \"Wow, this happened way too late.\" Well, I have a lot to say about this. I've just been digging for this one thing. So, hold on. Let me get this out and I'll start [ __ ] laying out some truth. Please lay out some truth. Uh Baron, I'm sending it to kind of control. Sorry I couldn't get in. Um, so when I got there to your point of selling the games, this is an old Greg story that's true. Remember in on the Brisbane office, we had those giant metal cabinets behind us where you'd review a game or after you reviewed a game on your test unit, they'd send the box copy and you'd shove it in there. And so when I got hired, it was just",
            "start": 6240.6
        },
        {
            "text": "giant metal cabinets behind us where you'd review a game or after you reviewed a game on your test unit, they'd send the box copy and you'd shove it in there. And so when I got hired, it was just nightmarish. This is me and Anthony Gayos in the downtown SF IGN game library. As you can see, this is one of the better iterations of the game library, I would say. I don't know where this falls in the timeline for you in terms of not the shirtless part, just the actual library. Yeah. I mean, know this this this was uh when I first started like this is what it at least as you see they're alphabetical. Yes. Cuz like when I'm talking about the big metal cabinets behind me. Thanks. You can throw it down. Uh there was no organization. And so yeah, one of the young Greg's stories there goes Roper was like, \"Hey, you know there's [ __ ] dick all games coming out. We pay you full time to sit there. Why don't you go through and organize the library?\" I'm like, \"Sure, add it.\" And I did it for like a",
            "start": 6294.32
        },
        {
            "text": "like, \"Hey, you know there's [ __ ] dick all games coming out. We pay you full time to sit there. Why don't you go through and organize the library?\" I'm like, \"Sure, add it.\" And I did it for like a couple hours. Then I came back and I was like, \"Hey, now that I'm doing this and organizing in alphabetical, a lot of duplicates, triplicates, and quadruples. You know that I'm too broke to buy a PlayStation 3 on my own, would you feel okay if I took duplicates and traded them in and did it?\" And Roer sat there and took a long pause and went, \"Yes, but lay them all out and let me have first dibs on.\" And he took he would take copies to go sell and also Oh, yeah. Which was at the time totally endorsed. This wasn't like a Oh, yeah. Yeah, they put the kaibash on it because people figured that out. So then when Yeah. Go ahead. So yeah, then yeah, people just started Well, then it got weird about how many copies you were getting because I've told the story too. You know, it used to be like",
            "start": 6336.56
        },
        {
            "text": "out. So then when Yeah. Go ahead. So yeah, then yeah, people just started Well, then it got weird about how many copies you were getting because I've told the story too. You know, it used to be like I'll never forget this day of I reviewed Smackdown versus Raw, whatever the [ __ ] the number was. And that day of release, every IGN editor got a box this big by that big and it had every version of that year Smackdown. And so it was like Xbox and Xbox 360, PlayStation 2 and play DS, you know, ev every version of the [ __ ] game. And literally that box came in. I took out my copy and put the review copy away. And then every other editor went to GameStop at the lunch and traded them brand new. Brand [ __ ] new. Traded. Nobody wanted these. Why are you sending everybody every version of this game, THQ? No wonder you went out of goddamn business. Anyways though, then when we moved downtown game library, like they just threw everything boxes, so just garbage factory. And so I'm getting this",
            "start": 6375.44
        },
        {
            "text": "THQ? No wonder you went out of goddamn business. Anyways though, then when we moved downtown game library, like they just threw everything boxes, so just garbage factory. And so I'm getting this right. Before we moved into that room, we had so much space in the original one that the game library was a freestanding open air game library. That was like when you came by what would be the signature. Well, yeah. Downstairs. Yeah. When we were still on the two floors, when you came by where the editorial pool started, one section of that was just shelves of games. And we had an intern who will remain nameless because he was the only it was like literally like oh for a long time we couldn't do interns because of some California law which really was just IGM being too stupid to figure it out. So I was like whatever. And so finally they got we became a real business and they were like all right now we're going to do interns again. And they got this kid and I don't know who was in charge of",
            "start": 6424.24
        },
        {
            "text": "So I was like whatever. And so finally they got we became a real business and they were like all right now we're going to do interns again. And they got this kid and I don't know who was in charge of picking the intern but they picked the least motivated worst. Like you think about the people who want to come intern at IGN. It's their dream to be this kid could not give two shits. He had a skateboard and he [ __ ] What did he say all the time? He Yes. Sick. What' he say? Oh, that's sick. Sick. I do. I don't know who you're talking about. I'll tell it won't help you at all. I'll tell you later. Yeah, he was the one before me. And I remember it was that right before me. No, there was one that was right before that was really good. For some reason, that was a video intern. It had rolled down the hill enough to where Christine Steey had to be his like like giving him tasks. And so finally she was like just organize the library please just and he just couldn't even do that. And so it's",
            "start": 6469.92
        },
        {
            "text": "the hill enough to where Christine Steey had to be his like like giving him tasks. And so finally she was like just organize the library please just and he just couldn't even do that. And so it's just shenanigans until finally they were like we have too much space. who were closing up floors and combining people with the game library's got to move into that shack that Anthony and Gregor are just shirtless in. That was it. That's That's a long winding road there of it. Do you Are you pulling up a video? I'm not going to, but like I'm trying to find it just to remind Nick of it, but whatever. I was going to say I was going to If you pull this up, that'd be huge. I was trying to find one today. Um, oh, we were talking about Mario Kart and uh when we when a Mario Kart Wii launched, it launched on my birthday and I threw a party, my birthday party slash a Wii uh thing and it was Andre and it was Media Mike and it was Craig Harris and it was Steeyr and there was all these people at my",
            "start": 6510.16
        },
        {
            "text": "on my birthday and I threw a party, my birthday party slash a Wii uh thing and it was Andre and it was Media Mike and it was Craig Harris and it was Steeyr and there was all these people at my original original apartment and it was just like we we put it up on the IG and around the office channel rather than the Mario Kart thing. So, it's like I think it's lost the time because I think they just deleted that object. So, now wherever those videos are just lost. project. Good job. You're doing great, son. Thank you so much, Ow. Ow. This has been a lot of fun. I've had a great time. Thank you, Subwizzer. Thank you, Subway. We appreciate you. Thank you for sponsoring this and bringing us all together again. Thanks for giving everybody a second kind of funny podcast. Yeah, it's pretty fun. Even less rambling or even more rambly. I want to see if I can find the one. Are these just skits? You see this guy? Look at this guy. God, there I am. Greg's the best. I'm going to live forever. Is that",
            "start": 6554.8
        },
        {
            "text": "less rambling or even more rambly. I want to see if I can find the one. Are these just skits? You see this guy? Look at this guy. God, there I am. Greg's the best. I'm going to live forever. Is that what it's from? No, that was from that was an episode. I just never forget. I You never cease to surprise me. Oh, sorry. By the way, oh [ __ ] Okay. I unfair was there. All right. So, hold on. I want make sure this is all right. Cool. Everybody, here's I've here's my text to pair followed by P's responses. Okay. Pair, I'm on a live stream. Where do you think all the PSPs I used to have when I was at IGNR? Just in a box somewhere. Can I have them? I'll dig through your boxes for them. Thank you. Separate message from me to pair. So, Roger would like to So, Roger would like an end gauge if you have a box of them. Pair responds in four parts. Oh, [ __ ] They were either donated to a hospital/children's foundation or they're in storage. If it was labeled Greg Miller, then we likely burned it",
            "start": 6602.64
        },
        {
            "text": "have a box of them. Pair responds in four parts. Oh, [ __ ] They were either donated to a hospital/children's foundation or they're in storage. If it was labeled Greg Miller, then we likely burned it on a p while chanting, \"I find it kind of funny. I find it kind of sad.\" Yeah, I was just going to tell Roger to just buy an endgauge on eBay because ours are buried under layers of other consoles, but then I saw they're going for like $100 now on eBay. What the [ __ ] We'll eventually get all of our consoles out of storage and we'll build an awesome museum display. There we go. I would like to request Get one. I have Crohn's disease. Come on. Subway Surfers in the chat midnight here, so I got to go to bed. Thank you from the bottom of my heart. Thank you, Christian. Thank you so much. This has been awesome. I hope everyone is enjoying this stream presented by Subway Surfers. Scan the QR code, download Subway Servers, get a bunch of cool stuff for free. Support this show, support Subway",
            "start": 6658.64
        },
        {
            "text": "has been awesome. I hope everyone is enjoying this stream presented by Subway Surfers. Scan the QR code, download Subway Servers, get a bunch of cool stuff for free. Support this show, support Subway Surfers. Hopefully more cool stuff can happen in the future. God, you're a baby. I was a baby. They were starting to do like a a cool display. I think it was maybe like a year into me being at IGN where uh I don't know if y'all remember when visiting like they started doing a cool display of like history of like Nintendo and stuff and they had a bunch of cool like um consoles and stuff that IGN had collected over the years. It was it was [ __ ] rad. I would love if they uh did that at full scale and gave Roger no end gauges. Just give me one end gauge. A copy of They need all of them. All right. Get it, Roger. Roger. Got it. I got it. Get it. Get it. Get it. Get it. Get it. Get it. Get it. Get it. Get it. Get it. Kiwi. It's already Tuesday. It's crazy. This week's going by. Closer and",
            "start": 6697.2
        },
        {
            "text": "right. Get it, Roger. Roger. Got it. I got it. Get it. Get it. Get it. Get it. Get it. Get it. Get it. Get it. Get it. Get it. Kiwi. It's already Tuesday. It's crazy. This week's going by. Closer and closer to that switch though. I know. Are you guys excited? Oh yeah. Play some Mario Kart. Hate it. God, you're such a dud. You guys want to play some Mario Kart? Mario Kart. You're going to play your little Nintendo. When's the new Pokemon coming out? I hear it's 3D. Roger just told me that today. Yeah, I was very excited. Locked in. I'm so locked. He's so locked. He's soaking. He's freaking freaking ducky donuts this morning. I'm locked in. Roger. We got to talk about it. We're letting it go. I just had I mean all I had was a donut and also a bacon, egg, and cheese and also you know that you are my accountability and when you fail I fail. You can't fail. No, but you got to fail with me. I don't want to fail. I want to succeed with you. Oh, I've been failing upward my entire life. That",
            "start": 6742.4
        },
        {
            "text": "are my accountability and when you fail I fail. You can't fail. No, but you got to fail with me. I don't want to fail. I want to succeed with you. Oh, I've been failing upward my entire life. That makes Scarpino story. Yeah, that's my one skill. Fail upward. Oh, look at you. God, you're good. Do the shoes just let you jump high whenever you want. That's sick. until the timer goes out. I mean, the Dunkin Donuts wouldn't have been that bad, but then she accidentally ordered me a bacon, egg, and cheese. Like, the woman that behind the counter, she gave she like mixed it up and then she gave us both like bacon, egg, and cheese. So, I'm not going to not eat it. I find it offensive that we have Dunkin Donuts here. What? Okay. I find it offensive. Why? Because it's such an East Coast thing. Stay on your lane. I don't want you here. We have Allstar Donuts. Well, it's always, you know, we have We have Yum Yums Donuts from Riverside, California. Sure. Sure. Sure. But it's just it's the",
            "start": 6808.96
        },
        {
            "text": "Stay on your lane. I don't want you here. We have Allstar Donuts. Well, it's always, you know, we have We have Yum Yums Donuts from Riverside, California. Sure. Sure. Sure. But it's just it's the traditional thing that everybody from New York loves New York so much that they get out of it as fast as they can and so then and then they have to bring all their crab donuts here. Yeah. Okay. Those donuts are way better than crispy cream. We got to talk about it. That's accurate. That's accurate. Crispy cream donuts are just way too sweet. They're inedible at a certain point. Are you kid, dude? We're going to do a test. We'll AB test it next week. I'm going to blind test you. My problem with We're not going We're not going off the rails if it's for content. You know, I'm seeing your favorite whipped cream have their own unique taste to them. Like I feel like I can understand them being too sweet for you. Like you're just drinking a donut. I get it. And I I there's no good [ __ ] sucks.",
            "start": 6851.44
        },
        {
            "text": "whipped cream have their own unique taste to them. Like I feel like I can understand them being too sweet for you. Like you're just drinking a donut. I get it. And I I there's no good [ __ ] sucks. Sorry. I'm sorry. I got some black [ __ ] on my burnt orange jacket. Nasty. It's just it's just over burnt orange. Yeah. Um but the crispy cream donuts, they're just they're their own thing. Dunkin Donuts donuts just taste like the knockoff donuts. Yeah. Yeah. It's a problem. It's like a movie problem. Why is it a problem? But it's at every It's at every corner. You know what it is, right? Yeah. This is just why New York's the best for pizza, cuz there's a lot of pizza around. Is it good? Not necessarily, but it's there. Which you respect a lot, cuz then you can be a Ninja Turtle. I like how New York you get uh when you're defending uh East Coast, Roger, what's the problem? What's the problem? Greg is not wrong. Like, actually, that is my pitch of New York pizza. Everyone's trying to find",
            "start": 6887.72
        },
        {
            "text": "York you get uh when you're defending uh East Coast, Roger, what's the problem? What's the problem? Greg is not wrong. Like, actually, that is my pitch of New York pizza. Everyone's trying to find the best pizza place. It's like, no, it's a it's a street food. It's a very consistent level of good, and then you can get it anywhere, and that's awesome. And you got two [ __ ] sick. But New Yorkers a lot of times don't want to hear that. No. Yeah. What are you talking about? Now you got a John Ble. That's why I left. That's why I live here. But it's only the Spider-Man the Hudson. We I like pretending that I'm a Knicks fan now that they're winning. You know what I mean? Like that I even care. Like I don't give a [ __ ] Ben wears a Ben wears a Warriors hat. Oh, sick. Cuz we're going to race him, right? You know, to be like, you know, cheer for the home team or whatever. But the amount of people who say, \"Yeah, yeah, warriors to him.\" And he'll go, \"Yeah.\" And then they'll ask him a [ __ ]",
            "start": 6926.0
        },
        {
            "text": "right? You know, to be like, you know, cheer for the home team or whatever. But the amount of people who say, \"Yeah, yeah, warriors to him.\" And he'll go, \"Yeah.\" And then they'll ask him a [ __ ] He's three years old. He has no idea what's going on. He doesn't know what's [ __ ] going. I don't know what's going on in this series. That's hilarious. Oh my god. I thought you were taking a note. I was like, \"What scribbled on this note?\" I was thinking in the car or this weekend. I don't know. I was having to be dad stuff and I was like, \"You know what? I haven't done anything crazy in a while. I haven't got to do something crazy on I thought about I thought about texting you and Andy so much over this weekend, but I ran it through the Danielle filter and she vetoed every single one of them. Every one of them because you can't text people that. And I was like, you don't understand our special relationship me and Greg have and how much we like to torture Andy. Yeah, it's true. Second only",
            "start": 6967.12
        },
        {
            "text": "Every one of them because you can't text people that. And I was like, you don't understand our special relationship me and Greg have and how much we like to torture Andy. Yeah, it's true. Second only perhaps to torturing Tim. But we do that live on content. We make content on that. We do. We do. Last couple minutes of the stream here. Yes. Is there anything crazy out of your system? And Roger. This isn't crazy. I just need Nick's help. All right. As you know, I've said it for years. You have magic fingers. 100%. Something something I did with holding van. I'm I'm this this up here this shoulder area. Cuz on top of carrying the [ __ ] company on my shoulders, I'm carrying this goddamn family. Do you know this? Yeah. Yeah. Oh god. Oh my god. Ladies, gentlemen, you you wish you were here. You know what I mean? I don't I mean just you know it's a ch Oh my god. I see why you need the table. You need a table right now. Lay on the table. Oh, we're in deep now. It hurts. But it feels good.",
            "start": 7011.6
        },
        {
            "text": "You know what I mean? I don't I mean just you know it's a ch Oh my god. I see why you need the table. You need a table right now. Lay on the table. Oh, we're in deep now. It hurts. But it feels good. It's a good hurt. See, that's the only thing about Tim. You like massage? He has tracks. Roger, you're more normal. Do you like massage? Yeah, I do. Yeah. Jen loves them and I'll do them with her, don't get me wrong. But it's like I don't love them. I don't You know what I mean? Like I'm What do I usually say? Focus on my hands and my feet. What do they do? Same [ __ ] they always do. It's like same [ __ ] they always do. He says straight to the dick. Always go straight to the dick, dude. No, they don't. What are you talking about? What places are you going to? I when I was in Mexico. Okay. Oh, this is what happened. Not literally, but way too close. Way too close. That's when they started and I was like, \"Oh my god, I didn't expect this.\" There's been there's been massages that I've had",
            "start": 7060.96
        },
        {
            "text": "this is what happened. Not literally, but way too close. Way too close. That's when they started and I was like, \"Oh my god, I didn't expect this.\" There's been there's been massages that I've had in other countries. Other countries have different cultures. Mhm. Where, you know, they'll pull the they'll pull the sheet down. And I remember one massage specifically. I can't remember what country was. They might have been actually in America where I was just like wh I am uh I'm now just naked on this table and it was legit. It was a legit thing but they were like we don't care like being naked buns up on a table. We did I did a massage one time with with is a couple's massage with D and I think we were in Japan actually and they were like cool we don't they're like I like do we need robes and I looked there's like no uh uh towel whatsoever nothing to cover yourself with. They just gave us little tiny like speedos, but they were mesh. And I was like, hm. I was like, this is not leaving",
            "start": 7116.88
        },
        {
            "text": "and I looked there's like no uh uh towel whatsoever nothing to cover yourself with. They just gave us little tiny like speedos, but they were mesh. And I was like, hm. I was like, this is not leaving much to be desired. There was like a scrub thing, so they're like, no, we have to have you do the scrub thing. I was like, [ __ ] But it was fine. Yeah. Yeah. What about Mexico now? No. I mean, hey, it is what it is. I I'm not the biggest fan of uh massages. You don't like being touched. You don't like You know what's weird about you, too? Is you don't like your hair being I love someone shampooing my hair. You don't like it in my hair at all. I'll rub your skull for you right now. I wish. Bro, I want to get one of those. What is it? The the metal ones that scratch your head or whatever. Bad for you. It's bad for you. Bad for you. Oh, that shit's bad for you. Give him a scum roll, everybody. Count all in one. Well, this has been our super fun Subway Surfers stream. Thank you so much for",
            "start": 7156.24
        },
        {
            "text": "for you. It's bad for you. Bad for you. Oh, that shit's bad for you. Give him a scum roll, everybody. Count all in one. Well, this has been our super fun Subway Surfers stream. Thank you so much for joining us as we introduce many people to Brain Rot. Um, I have been Tim Gettys. That's Greg. That's Nick. That is Roger Piccorn. best there ever was or ever will be when it comes to surfing those subways. I love you. Um, if you liked this, please let us know. And more importantly, please download Subway Surfers. Use this QR code. It will help us out a lot. Hopefully, we get more cool opportunities to partner with Subway Surfers who have been way too good to us over the years. Um, but till next time, I love you all. Goodbye. Surfing. Keep surfing.",
            "start": 7193.76
        }
    ]
}