{
    "id": 14093,
    "video_id": "APolmSqRMKo",
    "show_name": "Gamescast",
    "hosts": [
        "Tim Gettys",
        "Nick Scarpino",
        "Mike Howard",
        "Roger Pokorny"
    ],
    "title": "We Played FBC: Firebreak! - Kinda Funny Gamescast",
    "description": "Go to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on\ntheir best-selling Carver Mat frame.\n\nGo to http://rocketmoney.com/KINDAFUNNY to cancel your unwanted subscriptions and reach your financial goals faster with Rocket Money.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1747250034,
    "duration": 2946,
    "transcript_chunks": [
        {
            "text": "[Music] What's up and welcome back to the kind of funny games cast live for Wednesday, May 14th, 2025. Of course, I'm your host, Tim Gettys. I'm joined today by Snowike Mike. Hi, Tim. It's nice to see you. Nice color t-shirt, you and I. I like it. Uh, and I hope you're doing well. I haven't seen much of you in this past week. Is there an energy to what you're saying? Why is what the what you're saying a press conference right now? Sounds like a press conference refusatory. I just don't get enough Tim time right now and I'm I'm going to talk about it, you know. Okay. Okay. Joining us as well, of course, we have the literal taste maker, Roger Picorny. Uh, it's nice to see you, Tim. Um, I haven't seen you in a while. We had our first 101 in a while. Um, it's really good to see you and, um, it's good to see Nick here. Yeah. And rounding out the group is of course the producer/seducer. Of course is a weird thing to say. Another rare appearance on the kind of funny games cast. And I feel",
            "start": 4.69
        },
        {
            "text": "it's good to see Nick here. Yeah. And rounding out the group is of course the producer/seducer. Of course is a weird thing to say. Another rare appearance on the kind of funny games cast. And I feel like pretty quickly it's going to go off the rails from video games. I'm going to let you whatever you want to talk about. I'm going to let you get through the rigma roll. Okay. I got to talk about something. We do. We need to talk about FBC Fire Break, the latest from Remedy. That's what we're talking about today, everybody. Um, but we might also talk about other things cuz this is the kind of funny games. Each and every weekday we get together to talk about the biggest reviews, previews, and topics in video games live on YouTube, Twitch, and podcast services around the globe. If you love what we do, please support us with the kind of funny membership on Patreon, YouTube, Spotify, or Apple Podcast to get all of our shows ad free and a daily exclusive Greg Way. For a chance to be part of",
            "start": 53.04
        },
        {
            "text": "we do, please support us with the kind of funny membership on Patreon, YouTube, Spotify, or Apple Podcast to get all of our shows ad free and a daily exclusive Greg Way. For a chance to be part of this show though, please YouTube super chat in and we'll get to it. If you have any questions about uh these boys time with FBC Fire Break, please send them in. Or if you just have any questions about any of the beef/dynamics/ love going on between any of the men at this table, please uh feel free to write in and we'll get to that to the best of our ability. Little housekeeping for you. We're an 11 person business all about live talk shows. After Games Daily, you'll get a preview. Uh oh, sorry. I already we're doing that right now. Games Daily was an awesome episode of Greg and Roger talking about PlayStation probably raising the price of all their hardware in line with everyone else about batteries on consoles. We got to talk about that. It's very important. Batteries on consoles, everyone",
            "start": 93.44
        },
        {
            "text": "PlayStation probably raising the price of all their hardware in line with everyone else about batteries on consoles. We got to talk about that. It's very important. Batteries on consoles, everyone got to learn games daily. Check it out. The stream after this is going to be Mike and Nick playing a little bit more of that. Tarov. Oo. Yeah, we're deep. We're in. We're deep. We're in. Yes, Tim. We're in. I'm excited that you're in. We might finally kill someone in this game. Oh, yeah. We might. Okay. Maybe Roger will escape with us. And then later, we have not one but two trailer reactions. We're going to be doing Superman and uh Iron Hearts, the latest M Marvel Studio show. Will we also do Sputter Noir or No, we'll probably, you know what, that's a good call. We'll throw that into the Iron Hart one. Little Marvel trailer conversation. Uh both of those because uh we've been getting in trouble with the studios will not be live. Um we're going to pre-record them later and put them up. We",
            "start": 138.76
        },
        {
            "text": "Hart one. Little Marvel trailer conversation. Uh both of those because uh we've been getting in trouble with the studios will not be live. Um we're going to pre-record them later and put them up. We still have not seen the Superman trailer, so please do not spoil anything in the live chat. But um too much Peacemaker. We'll probably throw that in there, too. Just do it all DC Marvel. There's a lot of stuff lot of stuff to talk about. I I like that thought, Roger, cuz I have not seen the Peacemaker trailer yet. Yeah, I don't think I have either. Yeah. Um, thank you to our Patreon producers, Carl Jacobs of Makeabuster, and Delaney Twining. Today, we're brought to you by Shady Race, RF Frames, and Rocket Money, but we'll tell you all about that later. We got to talk about the topic of the shows. But before we do that, I need to bring something to y'all's attention. Okay. I am the one hijacking this. This is now a kind of funny podcast. Okay, do you want some lip balm? No, I I'm feeling",
            "start": 179.52
        },
        {
            "text": "But before we do that, I need to bring something to y'all's attention. Okay. I am the one hijacking this. This is now a kind of funny podcast. Okay, do you want some lip balm? No, I I'm feeling pretty good. I'm feeling pretty moist on the lips right now. Give it to me cuz I need to moist my lips for this topic. You give back to me. Last night I was on Reddit as I often am. And uh I follow the San Francisco subreddit which like most subreddits is just a place for people to [ __ ] about things they don't like about subject, right? Um but every once in a while there's a diamond in the rough that pops through and last night I read something that goes as follows. Uhoh. We buried a $10,000 treasure chest somewhere in San Francisco. Y 5 weeks ago, we buried 10K somewhere in SF. Why? We always figured treasure hunting would feature more heavily in life. Right alongside quicksand and tattered rope bridges. Godamn. Sadly, the science seems to be put out on quicksand. And thanks to modern",
            "start": 219.6
        },
        {
            "text": "figured treasure hunting would feature more heavily in life. Right alongside quicksand and tattered rope bridges. Godamn. Sadly, the science seems to be put out on quicksand. And thanks to modern building standards, rope bridges are stronger than ever. Y buried treasure chests seem equally rare. But those we realized we could do something about it. And so we did. We'll hang about today to field queries. Any questions on Reddit via email or elsewhere that we feel we should uh that should be addressed, we'll handle here and add to the site. Uh they put out Oh, they have a map like Goonies. A little Goonies map here. Okay. 18 bold letters preserved in a clearing site. A dark room's view of a brave surfer's reel. So they have all these little riddles for people to to figure out. This is so funny. And uh this is now like if you go to the next couple pictures like they legit did this. Oh no. There's legit $10,000 worth of different types of cash that they have hidden somewhere in San",
            "start": 262.4
        },
        {
            "text": "so funny. And uh this is now like if you go to the next couple pictures like they legit did this. Oh no. There's legit $10,000 worth of different types of cash that they have hidden somewhere in San Francisco and now all the news channels are reporting on this. And uh there's an excitement. I love that they did it five weeks ago cuz it's like the play of just like hey we're going to do this. We're just going to wait and then we're going to announce it. Like they were just like hey we know that this is wild and not a great use of our money but we had to do it. Well, it's like when you bury a body, you have to wait for the the growth to grow over it. That's exactly so people can't figure out where you buried it. Exactly. So, Mike, how's this make you feel? Uh, Tim, I'm excited. Let's get all the streaming equipment. Let's hit the road. Let's hit the road. You know San Francisco better than anyone, Tim. Yeah, but I don't I riddles. You know what I mean? We got Nick. Oh, we got Nick, the",
            "start": 303.6
        },
        {
            "text": "the streaming equipment. Let's hit the road. Let's hit the road. You know San Francisco better than anyone, Tim. Yeah, but I don't I riddles. You know what I mean? We got Nick. Oh, we got Nick, the king of riddles. I'm pretty good at riddles. I will say I will say this, like this could be our twister moment, okay? Cuz there's going to be other teams looking for this, right? Are we going to be the Carrie Elways's or are we going to be the Bill Paxton and the Helen Huntes? Or could we be the Glenn Pal? [ __ ] Daddy Butler in the chat says it was solved. That's that's incredible. [ __ ] I love that. They're probably lying. It's probably a false flag. Yeah, they're probably doing it just to just to throw people off the sense, but we're going to be doing the deeper hunt. Some [ __ ] probably just like hack someone's phone and geo geoloc for like 15 minutes by going, you know what I mean? [ __ ] dude. This is why we can't have nice things. Yeah, we played FBC Fire Break, an upcoming",
            "start": 342.64
        },
        {
            "text": "just like hack someone's phone and geo geoloc for like 15 minutes by going, you know what I mean? [ __ ] dude. This is why we can't have nice things. Yeah, we played FBC Fire Break, an upcoming first-person shooter video game developed and published by Remedy Entertainment. Set sometime after the events of Control. It follows a special unit of soldiers named Firereak. It'll be Remedy's first multiplayer title, and it's set to release on June 17th, 2025, just a little over a month away for PlayStation 5, Xbox Series, and Windows Game Pass and PS+. There we go. And that's cool. Okay. Yeah. Well, Alan Wake wasn't on Steam. Oh, good call. Good call. So, that's a big deal. Yeah. Published by Remedy. When I think about the people at this table, Mike I think is a dabbler. He likes to dabble in any type of game. Single player, multiplayer, doesn't freaking matter. He just likes having fun with his friends. Nick over there, I think of him more competitive multiplayer. That's pretty much it.",
            "start": 381.6
        },
        {
            "text": "any type of game. Single player, multiplayer, doesn't freaking matter. He just likes having fun with his friends. Nick over there, I think of him more competitive multiplayer. That's pretty much it. Roger. Yeah. I think of Remedy. Yeah. I think of Alan Wake. I think of Control. So, I want to start with you. M what did you think of your time with FBC Fire Break? I didn't love it as much as many people did in the press. Um I think it's for a multitude of reasons. Uh one I did the things I did like I'll start with there. I I like the way that this game looks. Uh I like being in uh the oldest house again and uh reexperiencing the world of control through a different lens. Right. Again, as we said uh earlier on in the synopsis of the game, you are playing as uh different people in the oldest house that are now basically taking out a bunch of hiss and which is essentially zombies uh in this world uh using crafted uh items that are you know guns that are super old like you are just picking",
            "start": 428.64
        },
        {
            "text": "house that are now basically taking out a bunch of hiss and which is essentially zombies uh in this world uh using crafted uh items that are you know guns that are super old like you are just picking up anything and trying to basically uh take out this this large uh group of zombies. Uh so in that sense it's fun and it's engaging and there is a lot of weird remedy charm there when it comes to the jobs and the weirdness of all of this. Uh and also the music is really great. I just didn't have much fun playing it and that says a lot because I was with these two jabronies laughing and having a great time just hanging out as people. But when it came to the game and we picked it up, there's just there wasn't that pick up and and play fun nature to it that I expected after watching a behind the the the scenes closed door um uh presentation that they did a few months ago. I saw that and they were really hyping up the pick up and play nature of it, right? And as soon as I picked up and play,",
            "start": 473.2
        },
        {
            "text": "the the scenes closed door um uh presentation that they did a few months ago. I saw that and they were really hyping up the pick up and play nature of it, right? And as soon as I picked up and play, I was like, I want to pick up and put this down. uh like it just it it did not have that addictive quality that I'm looking for when it comes to a Left 4 Dead, when it comes to a World War Z, when it comes to a Back for Blood. Uh where you want to pick up that that thing with your friends and just and just play through it the entire night. Uh as soon as I picked it up, I was like, man, the guns I understand the bit here is that these are old guns and these aren't uh the these aren't the most high-tech. You're not getting Uzi's. You're not getting anything like that. You're just getting an old uh double barrel shotgun. You're getting an old SMG, and you're getting a rifle. Um, so it doesn't feel like a Twitch shooter, but it also doesn't feel to fun to shoot these things, right? Like, and",
            "start": 519.44
        },
        {
            "text": "uh double barrel shotgun. You're getting an old SMG, and you're getting a rifle. Um, so it doesn't feel like a Twitch shooter, but it also doesn't feel to fun to shoot these things, right? Like, and that I think that's the core of this, like the loop, the gameplay loop, at least for me when it comes to these PvE games is I want to be able to pick up the pick up the weapons and find the difficulty in the amount of enemies that are coming at my way. I was finding the difficulty in just reloading the gun and trying to figure out how to use this gun in a in a way that is any way fun or engaging to for hundreds of enemies to be coming at me, right? It just I never found that flow and I think by the ending of it we found a little bit of something. I think we there was some there we started to find some of that excitement that they were talking about but it just never hit those highs. I would just rather play Left 4 Dead 2. I would rather play any of I would rather play Hell Divers. Um and",
            "start": 558.48
        },
        {
            "text": "find some of that excitement that they were talking about but it just never hit those highs. I would just rather play Left 4 Dead 2. I would rather play any of I would rather play Hell Divers. Um and yeah, it sucks because I am the remedy person. I am the person that this is geared towards. Um and it just it's just not for me. Mike. Yeah, it's uh interesting Roger says all that because I agree with him on the fun aspect. I did not have the most fun playing this, right? It did bring me back to the Left 4 Dead days, right? Four of your friends, three in this case, gathering together, completing missions with basic objectives, right? But it was fun to work together of Roger and Nick would have to go out and turn on generators while I hold down one area and fight off a bunch of monsters made out of uh Postit stamps, right? And so it was a good time with that. It brought me back to old school Left 4 Dead days, right? And I think there's an audience that wants that right now. Really riding",
            "start": 597.6
        },
        {
            "text": "out of uh Postit stamps, right? And so it was a good time with that. It brought me back to old school Left 4 Dead days, right? And I think there's an audience that wants that right now. Really riding off the high of Hell Divers. That PvE audience that is like, \"Hey, I want to break free from just PvP. I want to spend this time with my friends and have a little bit more of an easier fun experience.\" I think they have that here. Unfortunately for us, the jobs just weren't that engaging and all that fun, right? It is the most bare bones jobs that you can do of run to this point, stand next to this, hold down X, it's set up, go to the next spot, right? And so for me, I just couldn't find the fun. Uh difficulty wise, we uh ran into some when you level up certain things. We also were astonished at some of them. We did the first level, Tim, on the beginner difficulty. It took 2 and 1/2 minutes and the level was over. And it felt like we loaded in longer than we played. And that was a big",
            "start": 641.84
        },
        {
            "text": "at some of them. We did the first level, Tim, on the beginner difficulty. It took 2 and 1/2 minutes and the level was over. And it felt like we loaded in longer than we played. And that was a big difficulty problem. Yeah. And so it snowballs. It picks up and kind of opens up more areas as you do the job over and over again, which I appreciated. But I I did not enjoy this experience at the end of the day. I didn't see myself coming back for a day two or day three as I thought I would when I think of Left for Dead and others. Nick, what about you? I'm unfortunately with the guys as well on this. I think it started picking up toward the end when we started getting into those uh engagements with the bigger you see the bigger Post-it monster there that's in the trailer. Like when you get to that and the three of us really had to use our job skills to sort of overcome that. There was a level of strategy and coordination that had to happen. Uh but up until that point it just kind of felt",
            "start": 687.76
        },
        {
            "text": "that and the three of us really had to use our job skills to sort of overcome that. There was a level of strategy and coordination that had to happen. Uh but up until that point it just kind of felt like mindless. Go from point A, go to point B, kind of do this. Oh, there's something that's interrupting you. You got to go reset this thing. We need Mike for this. Um, to be fair though, I'm probably the one sitting at this table that likes this type of gameplay least. I don't like PvE. I don't really like these these grindy games that make you feel like you're just doing tasks in an artificial world. Um, somehow Hell Divers managed to do to have enough built-in mechanics and enough built-in chaos and in a bigger open world feeling that it made you feel like there was more dynamics or dynamicism in it. Um, but this really does feel like it's they're they're really holding like they're really accounting for the charm. They're really saying like, \"Hey, this is you. You like Control, you're",
            "start": 730.88
        },
        {
            "text": "in it. Um, but this really does feel like it's they're they're really holding like they're really accounting for the charm. They're really saying like, \"Hey, this is you. You like Control, you're going to like this. You like the Post-it notes. It's silly. It's wacky. It's fun.\" But at the end of the day, it's it's just it's something that I think I would pick up and play one more time maybe on stream when it launches with you guys. And I and I I would bet money that I'm not going to I'm not going to play this game again. Yeah, there's just not enough um differences when it came to the runs that we were doing. Right. Again, the the the there was three uh jobs at launch, two extra that are coming out by the end of the year uh in in post in postgame DLC that's free to everybody. Uh but the three that we played were very cookie cutter and we had 3 hours to play this game. So, we took our time where with replaying each of the jobs multiple times and they they rarely did change. The biggest",
            "start": 771.52
        },
        {
            "text": "that we played were very cookie cutter and we had 3 hours to play this game. So, we took our time where with replaying each of the jobs multiple times and they they rarely did change. The biggest changes that we did see were as Mike alluded, we started off the game and it was like a shock of like, oh no, is this what this game is? Like we got scared because you start off the game and without like normal difficulty, we go in there and it is just shoot a bunch of stamps, shoot a bunch of enemies, go back to the elevator, end of mission, and we were like, \"Oh no, is this the game?\" But that's like their version of a tutorial. They just didn't express that correctly. Uh so then as you keep on playing it, it gets further and further into the level and then finally we played it and there's a huge post-it monster. And uh that's what happened for the rest of the jobs as well. Uh, but replaying this Posted level multiple times, that charm of, \"Oh, it's a Posted monster kind of goes away really",
            "start": 812.4
        },
        {
            "text": "post-it monster. And uh that's what happened for the rest of the jobs as well. Uh, but replaying this Posted level multiple times, that charm of, \"Oh, it's a Posted monster kind of goes away really fast.\" Like within that three-hour chunk of us playing, it was it was already gone. Like I was not charmed by, you know, the weirdness of it, the wackiness of it. I wanted the world to change a little bit more, right? When I think about the oldest house, when I think about the way the control was built, the whole idea is that the world changes, right? Like you can go to one area and then it's different than it was before, right? That's not necessarily how it works, but like that's just the lore of it, right? So, the way that they kind of pitched it and they talked about it, I was expecting more of like a rogike situation here, and that's just not what that is. It it some things changed. There are some randomized elements uh we can talk about later. There was this random um rubber ducky that",
            "start": 848.48
        },
        {
            "text": "of like a rogike situation here, and that's just not what that is. It it some things changed. There are some randomized elements uh we can talk about later. There was this random um rubber ducky that was following me at one point that uh didn't pop up in certain runs uh that was uh I I don't even know what it was doing. I think it was I think it was throwing like um like fire on things also on myself. Uh so that's like a randomized element that pops in and pops out, which is neat and I like that uh because that's the type of stuff that I'm looking for. But the actual gameplay and like the level design itself did not change. So it became kind of mindless at a certain point until we started ramping up that difficulty when they start moving around some of the um uh the health and the uh ammo stuff. Yeah, I think Back for Blood was a game that we played a little bit, right? That was the the sort of successor to uh Left for Dead. And I think I vibed with that game cuz if if you felt like",
            "start": 885.2
        },
        {
            "text": "stuff. Yeah, I think Back for Blood was a game that we played a little bit, right? That was the the sort of successor to uh Left for Dead. And I think I vibed with that game cuz if if you felt like you were always moving forward and the levels were always changing and there was verticality and you were sort of getting weapon upgrades that were very very fast and I if I remember correctly like if you lost your weapon you like a damn it that sucks cuz you had to re rele I think there was a little bit more of a fun loop with Hell Divers as well where you immediately started upgrading and you saw your friends that had badass weapons. you're like, \"Oh, I get where this is going and I want to spend the time grinding up to this point so I cuz I want this cool like jetpack so I could just sit there and be Greg Miller or whatever.\" Yeah. But this did feel very closed off and it felt like you were going to play the same the same style of gameplay over and over and over again until the end. We",
            "start": 922.48
        },
        {
            "text": "and be Greg Miller or whatever.\" Yeah. But this did feel very closed off and it felt like you were going to play the same the same style of gameplay over and over and over again until the end. We did get to that one level where you had to we had to take the orbs and and put them in and then there was a little puzzling with like how you send them down the lines and stuff like that. So more of that I think would go a lot well. More puzzling elements, more more platform elements, things like that. Uh, but when it when when we got to the point where you had to shoot piles of Post-it notes over and over again, I was like, I don't this is this feels like this feels like I'm just doing work now. Yeah. I was down at a preview event last week in LA and a lot of the people that I was with had also gotten to to play this and I was talking to them about it and the the consensus seemed to be uh not glowing, but I a little more positive it sounds like from from you guys. But one thing that uh they",
            "start": 962.48
        },
        {
            "text": "gotten to to play this and I was talking to them about it and the the consensus seemed to be uh not glowing, but I a little more positive it sounds like from from you guys. But one thing that uh they all kind of agreed on was that this seems like the type of game that isn't going to be the biggest hit in the world, but is going to find its audience on Steam and we're going to see like a pretty like high the number just kind of continue to rise as like people kind of sit in. It's like this is their game for a bunch of like old boomers essentially that just want those glory days and it being on Game Pass, it being on PlayStation Plus, it kind of being having a greater chance at success for what it is. Yeah. Do you do you think Roger that that is uh in line with how you see this or are you like ah it doesn't have the stuff enough a little bit? I I I think they have the right business model the way that they've described this, the way they've talked about this, right? Again, it's all free",
            "start": 999.12
        },
        {
            "text": "ah it doesn't have the stuff enough a little bit? I I I think they have the right business model the way that they've described this, the way they've talked about this, right? Again, it's all free DLC. They don't want to have FOMO. They don't have daily challenges. They don't have any of the stuff that a lot of these uh uh free-to-play um uh online games that you constantly have to check in on. It feels like a second job. This does not have any of that, right? you can play for a month and then drop off and then come back when all the DLC is there and then boom, you're right there with your friends, right? So, I think they have it right there in terms of that audience. I just I question if like the general audience that maybe doesn't know Control that doesn't know any of this stuff picks up this game and plays it and says, \"Man, this is the thing for me.\" And doesn't look at Hell Divers and say, \"This has that funner that funner immediate loop that I just in my mind I just don't think",
            "start": 1036.56
        },
        {
            "text": "this game and plays it and says, \"Man, this is the thing for me.\" And doesn't look at Hell Divers and say, \"This has that funner that funner immediate loop that I just in my mind I just don't think it does.\" Again, I think it comes down base idea, right, of like the guns are broken and they're old, right? Like, so inherently, you don't have that fun gameplay of shooting a bunch of alien monsters and blowing their heads off. It feels like you are very slow and you are your character is not it does not reload ammo fast enough. So, there's this constant fighting against the mechanics, which of course you will be able to upgrade, but also the upgrade system, I think, is kind of whack. Uh the uh the it's basically uh a battle pass. So, in order to upgrade your single weapon, like for instance, I really like the SMG, and I was super excited. I was like, man, I can't wait to upgrade this weapon because it's going to [ __ ] rip. Oh, I need to go five pages into a battle pass. That sucks. Like",
            "start": 1072.32
        },
        {
            "text": "I really like the SMG, and I was super excited. I was like, man, I can't wait to upgrade this weapon because it's going to [ __ ] rip. Oh, I need to go five pages into a battle pass. That sucks. Like that. Like being able having to go from, okay, well, I want to upgrade this weapon. Okay, let me go to the upgrade menu. No, I have to get one upgrade per page of random [ __ ] I don't want in order to get the upgrade for the weapon. And I finally get the upgrade at the end of this uh PlayStation, and I feel like it didn't do anything. like that is the stuff that is going to make people turn off the game. Um, and I hope that stuff gets balanced out because when I upgrade this weapon, especially if I'm getting five battle pass uh layers deep, I want to be able to feel that gun rip a little bit better. Nick, how'd you feel about the upgrade system? I I felt the same way. Yeah. I mean, if you're going to put a battle pass system in there, every single thing on there needs to be not",
            "start": 1112.88
        },
        {
            "text": "bit better. Nick, how'd you feel about the upgrade system? I I felt the same way. Yeah. I mean, if you're going to put a battle pass system in there, every single thing on there needs to be not everything, but for the most part, you need to be adding value with that system. And to Roger's point where I just wanted to see what the guns felt like at level two, level three and to get there felt like it was going to be you always get to that precipice where you go, \"Oh, I see how much longer this is going to take me to get enjoyment out of it.\" And everyone has that moment where you got that's my threshold. And I would have if it wasn't if I wasn't playing this game for review uh or for what we're talking about right now, I uh I I would not have done it. I would have been like, \"No, I'm good. I see where this is going. There's no there's no possible way that the enjoyment's going to be is going to the juice isn't going to be worth the squeeze on that stuff. What about you, Mike? Yeah, I",
            "start": 1149.04
        },
        {
            "text": "I see where this is going. There's no there's no possible way that the enjoyment's going to be is going to the juice isn't going to be worth the squeeze on that stuff. What about you, Mike? Yeah, I didn't love the battle pass system. I mean, I see it. I I understand it. I think the general audience understands when they see it instantly what it's doing there. Um, but for me, I didn't didn't catch fire, especially once we did get the level two SMG and seeing what that reward was. But I I was more interested in the job system, right? I think that's something we should talk about is there's three classes. we'll call it that each person can pick into. You can run double up on classes, but each person has kind of a role that they can do, right? Somebody has the jump start kit that can restart a battery that might, you know, turn on the shower that will heal you or turn on the ammo box, right? There's also another guy that has the fix it wrench, right? And so Nick is out there trying to fix",
            "start": 1183.84
        },
        {
            "text": "battery that might, you know, turn on the shower that will heal you or turn on the ammo box, right? There's also another guy that has the fix it wrench, right? And so Nick is out there trying to fix different elements out in the world that could attract enemies, blow up. Then Roger had the health wetting people down. Yeah, he was wetting people down. I do like that mechanic, by the I like the mechanic that you are a fire team. You're basically firefighters and so water is your friend and if something explodes and and water starts coming from the ceiling, you just stand underneath it and it will heal you, which is pretty cool. Yeah. Yeah. But none of them felt I don't know. We all felt like we were needed, but we also weren't needed, right? I think there was moments where it's like I don't think Nick needed to be that car that class character, right? Like we can you can do everything without having to ensure all three of you the different classes, which is good and bad, right? The",
            "start": 1224.16
        },
        {
            "text": "think Nick needed to be that car that class character, right? Like we can you can do everything without having to ensure all three of you the different classes, which is good and bad, right? The positive is I had the jump start kit so I could quickly jump start a battery, but if we didn't have that, Roger could go up and do the quick time event with the RBLBs just quickly spamming it and it would turn it on the same way. So it never felt like it was needed where we all need to do this or at the same time it's like well we could just be whatever we want. It doesn't matter. And you don't you're not locked into it because you can switch between jobs in the middle of a mission. U I believe it's I don't know if you die you die you can come back and get a different kit which is which is nice. That's a nice quality of life thing right there. But um but I I don't know. It just it already felt a little stale from the get-go, right? Like I just wanted a little bit more depth there. Maybe it was",
            "start": 1261.2
        },
        {
            "text": "a nice quality of life thing right there. But um but I I don't know. It just it already felt a little stale from the get-go, right? Like I just wanted a little bit more depth there. Maybe it was just one more class. Maybe it was a little bit more choice because yeah, it comes down to it. It's like, okay, there's three, so you're the guy, you're the guy. Okay, I guess I'm this guy, right? Like there is no fun of like, okay, well there's five of them. Well, you do this and I do this and maybe I should do this guy. I don't know. Or you pick per level, right? You're familiar with the level. They're like, \"Okay, we need this level of chemistry between the three of us to to beat this easily or for the strategy of it.\" Yeah. And as Roger said, we did three jobs. I believe there's five jobs launching at at launch and then two post launch there. And so that's good. We got to see three, right? So the first one is the postits, right? So when you start, there is the, you know, when you think of",
            "start": 1300.8
        },
        {
            "text": "at at launch and then two post launch there. And so that's good. We got to see three, right? So the first one is the postits, right? So when you start, there is the, you know, when you think of control, you think of that office setting. That's what it looks like. And there's Post-it everywhere. And your job is to, hey, go shoot 2,000 Post-it notes. And so we shot 2,000 post-it notes and then it was like here's a boss section and then we retreated back to the elevator. We were done. And then the next time you load into that at the next difficulty it would unlock a second room. And so then we'd go into the next room and then the next room would have the giant post and not monster. And so by round three it was like oh we know where to go. None of the levels as Roger said ever changed. Right. There was no left right or crazy turns. It was just where's the ammo and the health box changed, but they expanded, but they were always the same. So, we knew exactly where to run. I mean, sure, Nick",
            "start": 1336.24
        },
        {
            "text": "There was no left right or crazy turns. It was just where's the ammo and the health box changed, but they expanded, but they were always the same. So, we knew exactly where to run. I mean, sure, Nick and Roger taking a quick shot at them. Tim, they got lost all the time. Not Mike the cgrapher. Well, we did learn one. This is the silent cgrapher. I hate it. I hate it. Silent. Uh, this is always north. Wherever I'm facing, wherever I'm facing is north. That's north. Uh, one thing that we did [ __ ] up on that would have made that whole experience better was that we realized by the ending of the of the play session that you can unlock respawn areas. So, we would basically what was happening was we would die and then one of us would respawn all the way in the beginning of the level and then we would get lost cuz there's a million [ __ ] hits and we're like, I don't know where I'm going. Uh, so yeah, that's one thing we learned. That was every time you move forward, there's a new respawn",
            "start": 1376.8
        },
        {
            "text": "we would get lost cuz there's a million [ __ ] hits and we're like, I don't know where I'm going. Uh, so yeah, that's one thing we learned. That was every time you move forward, there's a new respawn point you can open up. And so then the next one we did was like this cool out ofworld almost in space look. And that's where we were shooting these giant like beehives, these ugly little larva sacks that would drop these giant glowing green balls. And we had to fill up a little like mining cart with them. And so Nick and Roger would run out. I would protect the mining cart. They would come back and drop the balls in the mining carts. And then step one, we'd run back to the elevator, we'd dip out. Next run, we'd go to the next area and we'd do it all over again. Yeah. Every time it felt like you would load into the job and it would unlock the next area for you. And then the next time you did it, you'd unlock the next area and you'd see a little more, but nothing ever felt different about",
            "start": 1421.76
        },
        {
            "text": "you would load into the job and it would unlock the next area for you. And then the next time you did it, you'd unlock the next area and you'd see a little more, but nothing ever felt different about it. It just wasn't engaging. And then the third one, what did we do on the third one? Do you remember? I'm already forgetting. And the mine cart. No, the mine cart. That was the second one. Yeah, my card and posted notes. And then there's one more. Yeah, I'm liking on it. And that's the unfortunate part about it. It just doesn't stand out. Yeah, that that's the issue. The win right now for this is there's an audience that really wants PvE games with them. People and their friends can just load in and just have a fun night chilling and relaxing, right? No crazy challenge or make the challenges you want, right? The positive about this game is it's coming in at $40 for the base game, right? On top of that, it's on Game Pass and it's on PlayStation Plus. So, you and your friends don't have to",
            "start": 1463.92
        },
        {
            "text": "you want, right? The positive about this game is it's coming in at $40 for the base game, right? On top of that, it's on Game Pass and it's on PlayStation Plus. So, you and your friends don't have to debate, hey, should we spend this money or not? Just jump in. Uh, is this crossplay, Roger? I don't know. I'll look into it. Also, the third one is the furnace, as Michael Ruiz says in the chat. So, that was Yeah, that was when we had to jump start the furnace and like one of us would get burned alive. That was that was like the first first one we played, which was a little frustrating at first, but then once you figured it out, I think that's one where I kept getting like we were in the room, just kept getting lit on fire. Yeah. Yeah. So, it's just very basic cooperative experiences where it's like, hey, we're in room number one. There's two points we need to run to. We can either do this separately or we can move together and protect each other, right? And so, you'd go to one spot, Nick",
            "start": 1504.16
        },
        {
            "text": "like, hey, we're in room number one. There's two points we need to run to. We can either do this separately or we can move together and protect each other, right? And so, you'd go to one spot, Nick would do the whatever little quick event it would be, we'd run to the next spot, we'd complete it, you're done, you move on to the next room or you leave the leave the game. Crossplay. Crossplay. Crossplay is a thing, which is great for this type of game, obviously. Um, get your super chats in. We're going to take a quick break for the word from our sponsors, but when we get back, we're going to continue talking about the boys experience with FBC Fire Break. This episode is brought to you by Shady Race. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized sunglasses that won't break the bank. Shady Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people.",
            "start": 1540.52
        },
        {
            "text": "have you covered with premium polarized sunglasses that won't break the bank. Shady Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people. Their shades have durable frames and crystal clear optics, making them the perfect choice for all outdoor adventures. They have hundreds of options to choose from, so you're bound to find the perfect pair to match your style. Take it from Tim Gettys, who rocks his shady rays every day, going on Pokémon Go walks out and about SF looking dope. If you don't love your shades, exchange for a new pair or return worry-free within 30 days. There's no risk when you shop. Their team always has your back with personal and fast support. Exclusively for our listeners, Shady Race is giving out their best deal. Head to shadyra.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. That's shady.com promo code funny. This episode is",
            "start": 1581.84
        },
        {
            "text": "deal. Head to shadyra.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. That's shady.com promo code funny. This episode is brought to you by Aura Frames. Every day we're taking photos from big events to silly moments. But doesn't it sometimes feel like all of your favorite photos are just stuck on your camera roll? Wouldn't it be great to have an easy way to share and enjoy them with friends and family? That's where Aura comes in. Aura makes it effortless to upload unlimited photos and videos directly from your phone, so your favorite memories are always within view. Plus, you can personalize and preload an Aura frame for a unique and special gift. We love Aura Frames in this office. Roger has one at home he got for his fiance's birthday, and she absolutely loves it. It takes about 2 minutes to set up the frame using the Aura app. Add unlimited photos and videos and invite as many people as you want to an Aura",
            "start": 1625.44
        },
        {
            "text": "his fiance's birthday, and she absolutely loves it. It takes about 2 minutes to set up the frame using the Aura app. Add unlimited photos and videos and invite as many people as you want to an Aura frame. There are absolutely no hidden fees or subscriptions. And for a limited time, listeners can save on the perfect gift by going to aura.com to get $20 off plus free shipping on their bestselling Carver matte frame. That's auraframes.com. Promo code aura 20. Support the show by mentioning us at checkout. Terms and conditions apply. This episode's brought to you by Rocket Money. With prices going up on just about everything lately, being smart with your money isn't just a good idea. It's essential. But managing subscriptions, tracking spending, and cutting costs can feel overwhelming. Lucky for you, Rocket Money takes the guesswork out of it so you can easily make smart decisions. Rocket Money has helped multiple members of Kind of Funny learned they were still paying for things they",
            "start": 1669.2
        },
        {
            "text": "for you, Rocket Money takes the guesswork out of it so you can easily make smart decisions. Rocket Money has helped multiple members of Kind of Funny learned they were still paying for things they totally didn't even realize. Rocket Money is a personal finance app that helps find and cancel your unwanted subscriptions, monitors your spending, and helps lower your bills so you can grow your savings. Rocket Money's dashboard gives you a clear view of your expenses across all of your accounts, and then you get alerts if bills increase in price, there's unusual spending activity, or if you're close to going over budget. Rocket Money has over 5 million users and has saved a total of 500 million in canceled subscriptions, saving members up to $740 a year while using the app's premium features. Cancel your unwanted subscriptions and reach your financial goals faster with RocketMoney. Go to rocketmoney.com/kindfunn today. That's rocketmoney.comkindfunn rocketmoney.comkindofunny. Let me just",
            "start": 1711.2
        },
        {
            "text": "Cancel your unwanted subscriptions and reach your financial goals faster with RocketMoney. Go to rocketmoney.com/kindfunn today. That's rocketmoney.comkindfunn rocketmoney.comkindofunny. Let me just say, man, Nick, you [ __ ] freaked it, man. Bro, tell me freaked out. This is one of the times, everybody, I know if you're on the Patreon or the kind of funny membership, you have no ads. You should go watch the ad version because just to see Nick kill it. He just freaked that [ __ ] He freaked that [ __ ] bro. That was fire. It wasn't my goal to freak it, but I'm glad I reached freak it level. Yeah, you can't. The goal can never be to freak it. Oh, your goal can't be to be cool. You just got to be cool. It was beautiful during the stream when we were watching old episodes of KFA. And we saw uh it was the Nug episode and we saw you reading the ads or whatever and then people were like, \"Man, I miss when Nick used to do the ads and I was like, \"Let me tell you what little secret everybody.",
            "start": 1750.56
        },
        {
            "text": "it was the Nug episode and we saw you reading the ads or whatever and then people were like, \"Man, I miss when Nick used to do the ads and I was like, \"Let me tell you what little secret everybody. He's doing that ads this week.\" And everyone freaked out in the chat. They were like, \"Fuck yeah, Nick's back. Nick's back. Nick's back.\" So, we're excited, man. I'm proud of Ad Poppy is what they call him. Uh we have Yel Singh super chat in saying, \"Is the gameplay at least generally good or fun?\" Yeah, I mean it's serviceable, right? Like it's not like it it's not like an incompetent shooter. Like it definitely works. It's just it's just not fun. Like I'm not having fun at least. Um so yeah, it's not like a terrible like I would say, \"Oh, the shooting doesn't feel good.\" There's no like moment where, you know, I shoot a shotgun, it doesn't feel like a shotgun. It's just, you know, the the the base loop of it all and and how underpowered these level these guns are initially kind of make",
            "start": 1793.2
        },
        {
            "text": "where, you know, I shoot a shotgun, it doesn't feel like a shotgun. It's just, you know, the the the base loop of it all and and how underpowered these level these guns are initially kind of make you want to fight for it and to upgrade it. But from my experience, upgrading the weapon at least doesn't do too much. How about you, Mike? Yeah, I think when I really think of this game, it's like if you like Left 4 Dead, you're probably going to have a good time with this. You're going to play a couple of nights, you'll get lost in it. It's just it's missing something that takes that Left 4 Dead experience and brings it to 2025 and beyond, right? like there's a reason that game is so beloved, but at the same time like we are now here with these games and experiences and it should be a little bit more than just what this is. And I I I hope in the next two jobs or maybe beyond it finds something that it's lacking here. Anything to add, Nick or No, I just feel like if you're if you're me, if",
            "start": 1828.32
        },
        {
            "text": "more than just what this is. And I I I hope in the next two jobs or maybe beyond it finds something that it's lacking here. Anything to add, Nick or No, I just feel like if you're if you're me, if you're the most casual of gamers, this is not going to be experience that you're going to really want to engage with for longer than a couple hours. And especially if you if you if you're looking at this and you're hearing us talk and you're thinking 40 bucks, you're not going to buy this game. Yeah. It's also tough because they literally in the initial uh briefing that I had, they were talking about this is like something that not only people that have never played a Control or Alan Wake or Remedy game can pick up, but somebody that maybe has never really played video games that much. Like that's the that's like the level of casual that they're trying to pitch. And I just don't think that's what this is here. This is for This is for a lapsed, you know, gamer that maybe played Left 4 Dead",
            "start": 1871.6
        },
        {
            "text": "the that's like the level of casual that they're trying to pitch. And I just don't think that's what this is here. This is for This is for a lapsed, you know, gamer that maybe played Left 4 Dead back in the day and really misses that hanging out with the homies type feel and they haven't played Hell Divers 2 yet. Like that's harsh, but that's kind of what it feels like. Like I I don't know. Like I if you played any of those other games that came out in the last five, six years that have done it better, I don't think you're going to want to play this one. Roger as the the biggest remedy guy I know. Yeah. Are you satisfied at all with any lore implications or we didn't see much. Uh again also in the first uh initial briefing that was a big question that people asked was like is there going to be story? They said no there's no story. There's nothing here. There is some type of lore implications that we're not going to spoil and we didn't see any of that or at least I didn't notice any of",
            "start": 1911.12
        },
        {
            "text": "be story? They said no there's no story. There's nothing here. There is some type of lore implications that we're not going to spoil and we didn't see any of that or at least I didn't notice any of that. There was no codeex. There was no you know papers that you're picking up that you're reading anything off of. Um I'm sure there is something deep in there. I'm sure that if you you know it's remedy they're going to put some type of story content and I'm sure Dr. Darling is going to be stuck in some type of lab or something weird right but uh I didn't notice anything. So in terms of that yeah it just it just kind of feels like oh I'm in this world that doesn't have any much of the things that I love of the world which you know it's cool. It's cool to like walk around in it and see like oh this is the area from control but you know it's not really doing anything past that. Things you love in the world. Roger. I know you love Mike. I love you love sacks. Let me No, stop. Here. Here we",
            "start": 1951.28
        },
        {
            "text": "this is the area from control but you know it's not really doing anything past that. Things you love in the world. Roger. I know you love Mike. I love you love sacks. Let me No, stop. Here. Here we go. Okay, this is what everyone I'm gonna stop looking at I'm gonna stop looking at old videos of Back for Blood to refamiliarize myself with that. And we got to have a conversation about this, right? Yeah. Some [ __ ] went down yesterday, which we're not going to talk about. That was We're not allowed to talk about it. Turns out it's embargo. So, everyone don't tell Nintendo. It's making it worse. Just be cool. It's like when uh when Blessing was reviewing Tears of the Kingdom and Nick was like, \"Blessings off doing something really important.\" I was like, \"Thanks, Nick, but nobody ever guessed it.\" Yep. Nobody. So, some [ __ ] happened yesterday that put a Well, actually, we got to dial this back all the way. Dial it back. Shout out to Mike and Roger for having an amazing marathon stream",
            "start": 1984.72
        },
        {
            "text": "it.\" Yep. Nobody. So, some [ __ ] happened yesterday that put a Well, actually, we got to dial this back all the way. Dial it back. Shout out to Mike and Roger for having an amazing marathon stream for Death Stranding, a walk-athon uh for your health, for everyone's enjoyment value. You guys crushed it, right? We call it Tim. Call him Tim. We We got to talk. I'm so sad I didn't. I'm sorry. We also got to talk about Tim big time in us. Big time. Make that huge cuz we're walking on the shitty treadmill and then we realize, oh [ __ ] he has a [ __ ] pelon. Never once offered it. Never. Never once offered it. And that's when you realize the tear of Tim Getty's left. Here's the thing though. We I I we did talk about this a long time ago, but like logistically, there's no way that would work. Mike has a big car. He could have figured it out. I would have put it in. Dude, this thing is big. Big big Kevin's car. Oh man, I don't know. Kevin's got four cars. So, you put two of those cars",
            "start": 2034.88
        },
        {
            "text": "Mike has a big car. He could have figured it out. I would have put it in. Dude, this thing is big. Big big Kevin's car. Oh man, I don't know. Kevin's got four cars. So, you put two of those cars together. We totally We can put that thing in there. You also can't plug his uh his pelon in cuz it requires a much bigger It's like a washing machine. Crazy. I I heard you guys called everybody because of some like big like thing you guys did in the stream. Um Well, where was my call? Well, let's talk about that real quick. We called everyone. You called [ __ ] everybody but not me. We called everyone that was the guy who regularly checked up on you. The guy who called you to fix the couch shot because we're doing a bit. We wanted the bit of everybody we're calling to not answer, right? We knew Barrett was there. We knew Barrett was going to answer. So we're like, who was the people that were annoy the most? Tim. No. Greg. Yeah. Bless for sure. Blessing [ __ ] big time our asses, too, by the",
            "start": 2078.4
        },
        {
            "text": "was there. We knew Barrett was going to answer. So we're like, who was the people that were annoy the most? Tim. No. Greg. Yeah. Bless for sure. Blessing [ __ ] big time our asses, too, by the way. Did not respond to my text, but completely big time. Joey, she's in Beyonce. She's hanging out with Beyonce. She didn't respond, right? And then we finally called Andy cuz we knew he would be annoyed even if he was watching. Bear I knew you would love to to be on the on the Bear would have rode for us. Yeah, he would have rode for us. God forbid. Yeah. Yeah. He wouldn't know. But yeah, we had an amazing You guys come off literally help fix the stream. I literally see you guys before Friday. Mhm. And you're friends. Okay. After the weekend, you're brothers. Monday, we're brothers. Monday, you're brothers. Monday, we're back. [ __ ] back. It's like he never bought a Yus. That's how back. It's Mike picking up Roger whether Roger wants to get in the car or not. It's Mike with the with the",
            "start": 2118.8
        },
        {
            "text": "brothers. Monday, we're back. [ __ ] back. It's like he never bought a Yus. That's how back. It's Mike picking up Roger whether Roger wants to get in the car or not. It's Mike with the with the 4ERunner Uber just just showing up at the house and blocking his exit until Roger runs to Uber. I was unblocked from him. That was great. Unblocked. He unblocked him on the phone. It was a big deal. So, I'm looking forward to this, right? I'm looking forward to hanging out with Mike on Tuesday. Uh what is it? What? Yeah, Tuesday. uh uh to see what this new burgeoning relationship looks like and then Roger had to big time. I didn't big time him. There was a big time moment that happened. Yeah. And I'm thinking an executive decision made and the Venmo request still requested I canceled the Venmo request. He still sent it to me. Still sent it though. He still sent it to me. That is what it is. Okay. I'm thinking to myself, they can recover, right? This is just one rift in this brother. Brothers",
            "start": 2157.68
        },
        {
            "text": "He still sent it to me. Still sent it though. He still sent it to me. That is what it is. Okay. I'm thinking to myself, they can recover, right? This is just one rift in this brother. Brothers fight sometimes. It happens, right? I used to get in fist fights with my brother every once in a while. Mom used to get really pissed off and just throw [ __ ] at us. I'm like, Elena, you're not helping. You're just throwing [ __ ] into the chaos, right? Like when a wooden spoon hits me, I get more more mad, not less mad. Yeah. Everything's fine. We've we've we've figured it out by the end of the day. And it somehow works out that the last three people in the office are me, Mike, and Ryan. Incredible. The boys. Now the boys just together. Great day. Great meeting at We're high. We're talking about the se the sequel stream potentially just high a vibe. We did a postmorte. We did pros and cons. We did some pain points. We did some some some great points. All that stuff. Great. Just 10 out of 10.",
            "start": 2207.92
        },
        {
            "text": "the se the sequel stream potentially just high a vibe. We did a postmorte. We did pros and cons. We did some pain points. We did some some some great points. All that stuff. Great. Just 10 out of 10. Very professional. And I'm feeling great, right? I'm like, I'm going to go home, maybe do a little workout, maybe play a little game. This is going to be great, right? Surely the team, these guys I rely on, there's not going to be another like wedge thrown to widen the gap between them. And then we start walking out and I look down and right right by the exit there's a bunch of stuff. Now Tim, you know me. Whenever there's a bunch of stuff gets upight, I get up tight. Get upight. So of course I have to say something. Hey, what is this stuff? Does anyone know what this stuff is? And then you reminded me cuz that stuff was actually mine. I was going to bring it home. Um Greg got sent uh through Towerorn and Xbox a uh love sack. Um I think it's Yeah. from Loveack. Loveack love. Legitack",
            "start": 2247.76
        },
        {
            "text": "reminded me cuz that stuff was actually mine. I was going to bring it home. Um Greg got sent uh through Towerorn and Xbox a uh love sack. Um I think it's Yeah. from Loveack. Loveack love. Legitack super sack. I think it's called Superack. Yeah, Super Sack. Uh, it's this massive bean bag. And Greg got it sent. He's like, \"Hey, who wants it in the office?\" And then I looked at Greg and I looked around at the office. I said, \"If anyone doesn't want it, I would love to take it.\" Leanza, when I was in the office on um Monday, I need to pick up something. I looked at it and I told Leza and she was like, \"Oh, that sounds awesome. I would love that.\" I said, \"Yeah, I would love to take it.\" Craig says, \"It's all yours, buddy. You take it home then.\" I'm like, \"Awesome.\" I go, \"Great.\" Well, real quick, uh, Mr. I'm getting glare. I can't see that. Hit 420 says, \"Aren't those like $3,000?\" Yes. Very expensive. These are very expensive sacks. Yeah. This is like $1,400. Yeah. Big sack. It's a",
            "start": 2287.68
        },
        {
            "text": "quick, uh, Mr. I'm getting glare. I can't see that. Hit 420 says, \"Aren't those like $3,000?\" Yes. Very expensive. These are very expensive sacks. Yeah. This is like $1,400. Yeah. Big sack. It's a very expensive sack. It's It wasn't I don't know if it was that big big sack, but it was It is. It's It's huge. It's huge. It's super sack. Not as big as the super duper sack, but this is a super sack. And we're walking it out and Rajie goes, \"Love sack.\" And I'm just thinking, \"Great, get it out of the office.\" Right? because I can't I can envision that thing sitting over in the corner collecting dust and and and Mike or Kevin sleeping on it at one point and it just being disgusting and having a smell factor to it. So, I'm just trying to get this thing out of the office. But, I'm noticing there's two other boxes that come with this. One's an ottoman and one is a box that has a cover to this love sack. All the Xbox brand you can imagine, Tim. And Mike goes, \"Wait, Mike goes, wait, this is a",
            "start": 2325.92
        },
        {
            "text": "two other boxes that come with this. One's an ottoman and one is a box that has a cover to this love sack. All the Xbox brand you can imagine, Tim. And Mike goes, \"Wait, Mike goes, wait, this is a an Xbox branded love sack.\" And Roger goes, he waits the perfect beat because he realizes he's been God. Yeah. He realizes that this is strike two, right? That that he should have given this to Mike as especially since that that day's past trans transgression would dictate the pmena of you have to then give him you have to give him something in return because you didn't get him the thing that you get. My good side. That's right. I got you a shirt. And so Tim see just to set it up for you on my side of things. Okay. Walk in the morning, notice this beautiful Xbox branded postage box. And I'm thinking, man, my name should be on that. Greg Miller's name's on that. Okay. You know, and that's the most thing. Doesn't say a word. Doesn't ask a question. Doesn't think about the fact that Greg gets",
            "start": 2363.36
        },
        {
            "text": "man, my name should be on that. Greg Miller's name's on that. Okay. You know, and that's the most thing. Doesn't say a word. Doesn't ask a question. Doesn't think about the fact that Greg gets sent things all the time that aren't for him necessarily. Put the put the team on my back. Right. Games daily with Gary. Write into a stream with my main man Nick. Put the team on my back. somehow. Well, Mike's got the team on his back with Barrett and Gary. Shout out to you. You have the team on your back. Okay, Roger out here. Who's taking this giant Xbox love stand when there's no one in the office? Get the water. Here's the thing that you need to understand, Mike. You walk in, you look at this thing, you don't say [ __ ] Yeah. That's all you have to do is say [ __ ] Well, because he's got to accept it first. We get your mind, Mike. Yeah. Yeah. Very aggressive knock on the door. Kooliggreg wasn't there to help. So, guess who has to [ __ ] stand up? Guess who has to do manual labor? This guy.",
            "start": 2415.28
        },
        {
            "text": "it first. We get your mind, Mike. Yeah. Yeah. Very aggressive knock on the door. Kooliggreg wasn't there to help. So, guess who has to [ __ ] stand up? Guess who has to do manual labor? This guy. I should have the [ __ ] love sack. All right. I have to open the door. I have to pull this thing in. Roger. It's heavy as hell. I don't know how you're going to get it to your house. So, well, that was strike strike three. So, I'm just setting up how I feel, right? Because now their emotions are going of like, okay, well, there's an Xbox thing here. I want that. You know what I mean? Like, shout out. So, you only want the Xbox. You don't want the love sent. What he said was, I quote, \"I'm the Xbox guy. I don't care that Tim canled XC. I'm the Xbox guy in this office. I should have the Xbox themed merch.\" And Roger immediately realizes he's made a mistake. And then what does he do to me, Tim? Oh, pick up the handle and carry it on. You know what happened? Roger goes like this. No. What",
            "start": 2460.56
        },
        {
            "text": "themed merch.\" And Roger immediately realizes he's made a mistake. And then what does he do to me, Tim? Oh, pick up the handle and carry it on. You know what happened? Roger goes like this. No. What happened was this? Roger goes Roger goes Roger goes, \"Okay, guys. I'm just going to take this stuff to my car.\" And I look and Roger starts doing the thing you do when you walk into a Target for one thing, but you actually need 10 things and you should have got the basket and you should have got your friends to help. He starts collecting this [ __ ] in his arms and this love sack is like a solid 70 or 80 lb of packed in love. And so I go, \"Mike, we got to be cool. Let's just just grab an end of this thing and help me carry this.\" It's got [ __ ] handles on it. That's how heavy this thing is. Mike picks this thing up and as he realizes the weight both literally and metaphorically of what's happening, he lets out a guttural. I love you so much, Roger. I love you. I love you so much. That's",
            "start": 2506.56
        },
        {
            "text": "Mike picks this thing up and as he realizes the weight both literally and metaphorically of what's happening, he lets out a guttural. I love you so much, Roger. I love you. I love you so much. That's how you know he's mad. And then we walk out to the car. He can't even fit it in the car. Can't get in his car. He can't even fit in the car, Tim. I left as these two were laughing and screaming at each other and I just drove out into the sunset cuz I knew this was going to be an ongoing joke for the rest of our lives. Roger stole Mike's love sack. I just want to I just want to clear up a few points. One, I did not expect them to carry this [ __ ] thing. I was going to do it myself. The How are you going to get that thing out of It's I was going to do multiple trips. Were you going to drag it? I was going to bring all my [ __ ] to the carack. I was going to do multiple [ __ ] trips because you know why I know how that I can move it? Cuz I brought it home yesterday. I carried it up my up my",
            "start": 2546.0
        },
        {
            "text": "I was going to bring all my [ __ ] to the carack. I was going to do multiple [ __ ] trips because you know why I know how that I can move it? Cuz I brought it home yesterday. I carried it up my up my stairs by myself. Brought it into the house, opened it up, looked at it, and I had multiple multiple situations that I learned as soon as I looked at it. One, this thing is [ __ ] massive. I have a small little apartment and we start measuring. Nothing's fitting. This is not going to fit. We're going to have to throw away this cat tree. This poor cat's going to have to live on the street. The cat tree has got a love sack now. Enjoy the cat. If we get a love sack, this [ __ ] cat's gone. Okay, so that's tough, right? Even if we do fit it. There's another thing that I learned and I realized Mike will never forgive me for the rest of his [ __ ] life. He will always be snow [ __ ] Mitch to me for the rest of his life if I don't give him if he doesn't if I don't if I don't give into his",
            "start": 2586.8
        },
        {
            "text": "Mike will never forgive me for the rest of his [ __ ] life. He will always be snow [ __ ] Mitch to me for the rest of his life if I don't give him if he doesn't if I don't if I don't give into his tantrum right now and bring this thing and you better give him that candy. Yeah. And then and then so I open it up. I don't even take it out of the [ __ ] thing. I open up. I look at it and I say if I take it out it's going to inflate and then I and then it's going to be a nightmare. So I just open it up and I just leave it and I call Mike immediately. I No. I gave the phone to Leansza because he I don't want to deal with this. No, I'm I don't want to [ __ ] deal with this because he put it on Leansza, too. So he was like, \"If Lanza likes it, if Lanza likes it, you keep it.\" And he gets all tight. He looks at me. He says, \"But if she doesn't, I'm there at your house at 5 minutes.\" So I give the phone to L. I'm like, \"You break the news to him.\" Okay. She She says, \"Mike, we thought about",
            "start": 2624.96
        },
        {
            "text": "He looks at me. He says, \"But if she doesn't, I'm there at your house at 5 minutes.\" So I give the phone to L. I'm like, \"You break the news to him.\" Okay. She She says, \"Mike, we thought about it.\" And she really hams it up. She's great. I love her so much. She hands it up and she's like, \"We don't want it.\" And then Mike just immediately goes, \"Oh, you sure? No. No. Keep it.\" Good. I'm good at that. You're good at such You're an [ __ ] Think about it. Think about it. Sleep on it. Double check. You know, I don't know. real. No, he's going to let he's going to leave people in their house. You need it. You need this. Come on. Cuz I know him. He's thinking about it and he's like, I can I can just [ __ ] just think about this for the rest of my life. I have journal entries for the next 10 years. Journal entries. Tim, there's going to be a whole chapter called the love sack. During the weekend, we ordered food for dinner and we had Denny's. And I looked at Roger and I said, \"If this",
            "start": 2661.2
        },
        {
            "text": "10 years. Journal entries. Tim, there's going to be a whole chapter called the love sack. During the weekend, we ordered food for dinner and we had Denny's. And I looked at Roger and I said, \"If this Denny's order doesn't have syrup on it, I'm throwing the biggest temper tantrum. on whipping pancakes at the wall. And Roger now gets on the Door Dash app and is live texting the guy like, \"Please God, bring the syrup.\" Yeah. Cuz he knew it was going to go. Yeah. And then I I hid the syrup as a joke and then he got scared. Um but whatever. So then I brought this [ __ ] love sack back downstairs by myself. Threw it in the yards and it's in my trunk right now waiting for you. So yeah, you're going to take it. I need the update. Yeah. Do you want this love set? Hell yeah. I can't wait. Oh yeah, I can't wait. No, because he looked at me. He said, \"Even if you keep the love sack, you give me the cover.\" I I'll wear the cover for as a as a blanket or a t-shirt. Oh, yeah. Yeah. I'll wear I'll",
            "start": 2700.48
        },
        {
            "text": "I can't wait. No, because he looked at me. He said, \"Even if you keep the love sack, you give me the cover.\" I I'll wear the cover for as a as a blanket or a t-shirt. Oh, yeah. Yeah. I'll wear I'll wear the the Xbox cover as a t-shirt uh to represent the shirt that you never got me. Now, you know, you realize, of course, that Mike has it's a win-win for Mike. Cuz now he gets the love sack, but he also gets to be salty for the rest of his life that you didn't immediately give him the love sack. He had to he had to accept the the the, you know, the sloppy seconds of the love sack. Once you didn't want it anymore and now Mike's giving this thing a home like it's a rehoused dog. It's in the journal. It's all in the journal. So Mike, you're going to get this in your house. Roger immediately realizes this is not for my house. Is it for your house? Oh, yeah. I can't wait. Well, no. Yeah. Yeah. It's for his house. Yeah, I can't wait. He's got empty He's got empty room. He wants an N64. Empty",
            "start": 2742.4
        },
        {
            "text": "this is not for my house. Is it for your house? Oh, yeah. I can't wait. Well, no. Yeah. Yeah. It's for his house. Yeah, I can't wait. He's got empty He's got empty room. He wants an N64. Empty room. An N64. Yeah. No, N64 table is what he wants. I want that N64. Nothing else on the market. Leans were lowballing that guy. We were going to break him. He was having Leansza message a guy on Facebook Marketplace that was selling an N64 table. And she would he would message her and be like, hey, I can only do 220. Tell him that. And then she would go, I can only do 220. And then she would screech out the response and send it to him. And then they would go back and forth like he's asking for 400. I say we're going to lowball this guy. Tell him 200. Guy goes, absolutely not. 350 lowest. I go, \"Let's get him again. Tell him we'll be there tonight.\" 225. Guy goes, \"Absolutely. Leanza your gobetween.\" Well, we were having fun. We were having fun. No, she is. And that's the funny thing is that",
            "start": 2783.6
        },
        {
            "text": "get him again. Tell him we'll be there tonight.\" 225. Guy goes, \"Absolutely. Leanza your gobetween.\" Well, we were having fun. We were having fun. No, she is. And that's the funny thing is that Leanza looked at Mike and said, \"I want this thing.\" I don't think there's he would either have to turn heel on Leonza, which he would never do cuz he loves her too much. And they share they share the the inner goblin where they love good where they love candy and the inner goblin. Yeah. Coach Mike. Jim Cats. Coach Mike ruined her life. I live with that. Broke her ankle. I live with her. He broke her ankle. Technically, which is crazy because you think if you if you broke someone's ankle, you should give them a free love sack. Yeah. Exactly. And you would also think that like if you broke someone's ankle like you you would just be, you know, give me a freebie with anybody. Just give me one. I live with that. Or just let me be mad at you for once. But no. Well, everybody, um, stay tuned here to",
            "start": 2830.48
        },
        {
            "text": "ankle like you you would just be, you know, give me a freebie with anybody. Just give me one. I live with that. Or just let me be mad at you for once. But no. Well, everybody, um, stay tuned here to kind of funny for the ongoing shenanigans and lore of Snowike Mike and Roger. their love. We're going to make it up. We're going to figure it out on the remix. We're going to figure it out. We're going to figure it out by the second stream. Oh man, how far will they walk? No, we'll have to wait and see. Uh, let us know in the comments below if you're still interested in checking out FBC Fire Break. And I know a lot of people are asking in the live chat, where is the Superman reaction? We are about to record it, but we can't do it live. It'll post as soon as we can get it up afterwards because uh the studios have been taking down our live trailer reactions. And we got to be careful because uh we got too many strikes going on. We don't want to get Mr. Bucketed, if you know what I mean.",
            "start": 2871.6
        },
        {
            "text": "uh the studios have been taking down our live trailer reactions. And we got to be careful because uh we got too many strikes going on. We don't want to get Mr. Bucketed, if you know what I mean. Exactly. Otherwise, uh we will be doing stuff live still. We have uh Mike and Nick playing Escape from Tarov. If you're on Twitch, stay where you are. If you're on YouTube, make the jump over to the other video. But until next time, love your sacks. Yeah. Or Roger Sack.",
            "start": 2911.6
        }
    ]
}