{
    "id": 14094,
    "video_id": "GHc3DUQl6uk",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Roger Pokorny"
    ],
    "title": "PS5 Price Hike Incoming?! - Kinda Funny Games Daily 05.14.25",
    "description": "Go to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on\ntheir best-selling Carver Mat frame.\n\nGo to http://rocketmoney.com/KINDAFUNNY to cancel your unwanted subscriptions and reach your financial goals faster with Rocket Money.\n\nWe’re here to talk about video game news!\n\nToday after, KFGD, you’ll get:\n - A preview from Nick, Mike, and Roger of We Played FBC: Firebreak on the Gamescast\n - The STREAM is Mike and Nick playing Tarkov/The Hunt Showdown\n - Screencast – not live – reactions to Superman trailer and Ironheart!\nIf you’re a Kinda Funny Member:\n - Today’s Gregway is 15 minutes about being tired and Ben’s introduction to the MCU.\n\nTime Stamps:\n00:00:00 - Start\n00:03:03 - The Pac-Man Donuts\n00:08:48 - Housekeeping\n            -  The Roper Report   -\n00:13:52 - Sony considers PS5 price hikes to cover Trump’s tariffs\n00:38:23 - Freakin’ It\n00:39:37 - Will Game Chat Hinder Switch 2 Performance?\n00:44:36 - Super Mario World APPEARS to be the title of the next Mario Movie\n00:46:49 - More Microsoft Layoffs\n00:49:40 - A Kingdom Hearts Game has been canceled!\n00:53:36 - Save your Switch 2 Battery!\n00:56:33 - Wee News! \n01:00:45 - SuperChats & You‘re Wrong\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1747246709,
    "duration": 4052,
    "transcript_chunks": [
        {
            "text": "Today in the nerdy news you need to know about, PlayStation's considering a PS5 price hike, that we know the apparent title of the next Mario movie, and the cancellation of a Kingdom Hearts game has come to ruin Tim's life even more than I did. We'll have all this and more because this is kind of funny games [Music] daily. What's up everybody? Welcome to Kind of Funny Games Daily for Wednesday, May 14th, 2025. I'm one of your hosts, Greg Miller, alongside the taste maker, Roger Piccorn. Hi, Greggy. How you doing? I'm good. How are you? I'm doing good. I feel like I'm a normal person again, finally. You know what I mean? after the 60 hours of freaking it all weekend with Mike playing Death Stranding. 54 hours in that game and I just started from the beginning of that stream to the end which is insane. Yeah, I would have put that number way lower for every time I tuned in. You chuckleheads were ordering on it counts. It counts towards the towards the play time. So, yeah. No. How close to",
            "start": 4.48
        },
        {
            "text": "is insane. Yeah, I would have put that number way lower for every time I tuned in. You chuckleheads were ordering on it counts. It counts towards the towards the play time. So, yeah. No. How close to finishing the game are you? 3 hours apparently. Three hours. So, we are going to be finishing up next week on a regular stream. Mike will not be walking. I will not be walking. We'll just finish it up. Uh, and then we'll be able to talk about on a Games Cast, which Oh, you do a little Games Cast for you. I just that's all I want to play. Like I booted it up last night. I booted up last night on my Steam Deck. I was like, I just want to just grind and make zip lines and all that stuff, but I'm right at the ending. So, there's nothing I can do. Like, all I can do is just go forward in the story. There's no fast travel. I can't do anything. So, I'm just locked and that's all I'm thinking about. Great. So, now are you Oh, that so that sounds like you already just answered my question there,",
            "start": 55.76
        },
        {
            "text": "There's no fast travel. I can't do anything. So, I'm just locked and that's all I'm thinking about. Great. So, now are you Oh, that so that sounds like you already just answered my question there, but are you at all worried about burnout for Death Stranding 2, or is it that you're so you want so much more of it? Yeah, exactly. That's where I'm at. Like I just want more of this. And from what I'm seeing from blessings preview and Dan and every and skill up talking about this game, it seems like it's more of the fun stuff from Death Stranding, which I enjoy. So I'm just excited to go into this new world and see specifically like how the [ __ ] this game wraps up because I don't know where where we're going at all. And the LLU lore is getting crazy. So I'm very excited for that. How are you doing, Greg? I'm good. Uh I don't feel myself. My Gregway is 15 minutes today of me talking about being tired cuz yesterday I took off my glasses when I did an afternoon Gregway and one of the",
            "start": 90.72
        },
        {
            "text": "you doing, Greg? I'm good. Uh I don't feel myself. My Gregway is 15 minutes today of me talking about being tired cuz yesterday I took off my glasses when I did an afternoon Gregway and one of the comments was you know he's tired if he took off his glasses. The epilog was that I fell asleep in the chair with Ben at 7:45 and since I'm solo parenting that meant no one was there to wake me up. So I woke up at 12:30 at night with the and like all the lights are off in the house cuz it was light when the Cole's just taking care of himself. Like oh god Ben in your arms on my chest. Yeah, he likes to sleep on my belly still. Oh my gosh. Um, but we are starting with story number zero. Crispy Cream celebrates Pac-Man's 45th anniversary with Look at that. Amazing. But they put Maze in their new doughnut collection. Uh, we of course had this announcement as part of Games Daily this week. This has already happened, but you know, Monday it came in too late for us to go to the Crispy Cream close to",
            "start": 123.36
        },
        {
            "text": "collection. Uh, we of course had this announcement as part of Games Daily this week. This has already happened, but you know, Monday it came in too late for us to go to the Crispy Cream close to us and get it. Tuesday was of course us going to the Nintendo store, rocking that. Hear all about it on tomorrow's Games Cast. So, today I had to stop and get the crispy cream uh Pac-Man donuts. As you can see, there's they come in the Pac-Man box if you have the ability to do it. And then I I just said, you know, you walk in, I said, \"Give me the random ass the assortment.\" Which here's what I'll tell you right away. I appreciate it. Includes just normal glaze. Okay. Because if you remember when we got the Ghostbusters one, yeah, people didn't like the Ghostbuster flavors. Just a lot of So, to have it in there and be like, \"All right, we're just going to straight up give you some glaze on top of that.\" I appreciate that. Uh, I will point out before we even get going and before the comments",
            "start": 165.92
        },
        {
            "text": "have it in there and be like, \"All right, we're just going to straight up give you some glaze on top of that.\" I appreciate that. Uh, I will point out before we even get going and before the comments really want to stir it up. All right, this is not sponsored. We're just fat. We just if someone's making a video game doughnut or a Ghostbusters donut or a Superman donut, we will stop and we will get it and we will probably talk about it on a show or whatever. So, this uh they have funny names, of course. Okay. Uh, what do they do? Do they have them on here? These I'm looking at their official press release, which you'd imagine would have to have it. They had funnier names. I thought they call this one than the Pac-Man party donut. Okay. No, this one is Pac-Man party donut. An original glazed doughnut piped with yellow buttercream uh flavored icing sprinkled with celebration sprinkles topped with a Pac-Man piece. Then the team ghost donut, an unglazed shell doughnut filled with chocolate",
            "start": 202.96
        },
        {
            "text": "doughnut piped with yellow buttercream uh flavored icing sprinkled with celebration sprinkles topped with a Pac-Man piece. Then the team ghost donut, an unglazed shell doughnut filled with chocolate flavored cream dipped in black icing decorated with Pac-Man maze and topped with ghost pieces. And the strawberry uh power berry Oh, these are part of it. Oh, [ __ ] Okay. An unglazed shell doughnut filled with strawberry flavored cream dipped in red icing. There we go. That's what I need. Oh, I appreciate you're trying to cut out my It's me. I'm what's screwing up Sky Cam, right? I'll close it. You don't have to worry about it. Then you don't have to see my text message. I just wanted to get really close to it. I like it. This is the quality that they deserve. I mean, they didn't, you know, they didn't pay for it. Yeah, they didn't pay for it. I brought a knife and a plate. Thank you. I figured we got to try the knife on the floor. We got to try them all. I got the DeJouro cutting board",
            "start": 239.28
        },
        {
            "text": "they didn't pay for it. Yeah, they didn't pay for it. I brought a knife and a plate. Thank you. I figured we got to try the knife on the floor. We got to try them all. I got the DeJouro cutting board as well there, too. Right. This is going to be perfect for Nick because now he's going to have a bunch of pieces of donuts. Cuz you say that, but you and him always argue about It's fine. It's fine. It's still strawberry donut. Everybody can see what's up over there. Welcome back to Kind of Munchies, everybody. Yeah, exactly. Yeah, I love this. I don't I don't like this one. This butthole's like blown out. It's got a prolapse butt there. You know what I mean? Stuff. Are you in on this, too? Should I cut them in thirds? Yeah. Yeah, let's do it. I like this. Uh, Roger. Yes. Welcome to Kind of Funny Game. Thank you so much. Uh, I do not I don't think I'm going to like any of these. What? I'm just going to be honest. I'm not a I'm not a crispy cream guy. I smell the sugar. The sugar. It hurts",
            "start": 274.4
        },
        {
            "text": "Game. Thank you so much. Uh, I do not I don't think I'm going to like any of these. What? I'm just going to be honest. I'm not a I'm not a crispy cream guy. I smell the sugar. The sugar. It hurts my teeth every single time I have crispy cream, but I eat a lot of crispy cream every time it's in the office. No, I'm not complaining. Are the guys who just stare at each other and go, \"You doing it? You going in for another one?\" Let me tell you about Dunkin Donuts, though. Like, imagine if they need to collab with Dunkin Donuts more. We need to get out of the Dunkin Donuts still doing that thing where they're not everywhere, though, you know? That's their problem. There's one like 10 minutes away. Well, for us. Yeah. Yeah. Yeah. Yeah. But I mean, the rest of the country. Come on. It can't just be here in our perfect world that we live in. Come on. All right. So, I should probably get the knife. Look at that straw. Oh, the strawberry one looks kind of good, though. Strawberry one's going to",
            "start": 308.56
        },
        {
            "text": "be here in our perfect world that we live in. Come on. All right. So, I should probably get the knife. Look at that straw. Oh, the strawberry one looks kind of good, though. Strawberry one's going to be my fave cuz I love a good fake strawberry. That's what it's all about. You know what I mean? All right. So, where do we want to start, boys? Uh, let's just Yeah, let's go with the Pac-Man. Pac-Man has been called. We're starting with a basic buttercream Pac-Man there, which is just apparently the party one. Yeah. I'm going to take off the fondant and that never makes me like it more. Yuck. Too sweet for you. It's just like the icing isn't doing anything for it. Like, you know what I mean? It takes away from it. It's buttercream cake ice cream on top of a cake doughnut. Like I think crispy cream, a straight normal glazed doughnut from Crispy Cream is already so sweet. Yeah, exactly. Why are we adding to it? Okay, I'm going to jump on a strawberry. Whoa. Whoa. Don't Don't you know don't",
            "start": 338.0
        },
        {
            "text": "cream, a straight normal glazed doughnut from Crispy Cream is already so sweet. Yeah, exactly. Why are we adding to it? Okay, I'm going to jump on a strawberry. Whoa. Whoa. Don't Don't you know don't take it out on the ghost with the most here. All right. All right, we're going on to the strawberry one, everybody. Killer. Yeah, I'm excited about this one. It's like a strawberry milkshake and a donut. Yeah. Yeah, I [ __ ] with that one. That's the best crispy cream dough I've ever had. I [ __ ] with that hard. That's really good. JH Shaw says, \"I haven't had a donut in like five years.\" What are you doing with your life? Are the abs worth it? I can't imagine they are. All right. God damn. A good one. That's really good. I like how um how loose the filling is. Yeah, I was going to say it feels like a smoothie. I've never had I've never had a jelly donut that it's like melted ice cream in a car. Okay. And we're finishing here with the black icing chocolate fil donut. Oh, my teeth hurt so",
            "start": 378.32
        },
        {
            "text": "like a smoothie. I've never had I've never had a jelly donut that it's like melted ice cream in a car. Okay. And we're finishing here with the black icing chocolate fil donut. Oh, my teeth hurt so much. Not bad. I like the chocolate inside. Yeah. Oh, yeah. That's all I can taste. Yeah. Yeah. I would say this is like strawberry top tier. This one is second. And then the Pac-Man butter, whatever the [ __ ] is way below that. Yeah. I'm exactly where you're at. I agree 100%. Yeah. Yeah. Look at us. Yeah. Like I think I wouldn't the strawberry is the only one I would order that I would go I would go and like Oh yeah. Oh, you going to crispy cream? Pick me up one of the strawberry Pac-Man donuts. You know what I mean? I just I just wish they did like just the the top layer of the icing, right? Like we don't need the entire thing to be iced. I feel like that would go a long way, but I know that goes against the ethos of crispy cream. All right. Well, that was great. Thank you very much.",
            "start": 425.12
        },
        {
            "text": "Like we don't need the entire thing to be iced. I feel like that would go a long way, but I know that goes against the ethos of crispy cream. All right. Well, that was great. Thank you very much. Thank you, Greg, for the donuts. Anytime. Don't worry about it. And thank you, Pac-Man, for making all these himself. We met him in that Pac-Man. Remember that? Dapped him up. They say don't meet your heroes. I say eat your heroes. Whoa. He gave me a lot of pills. I'll leave that one alone. Uh, you put that in Slack now. Those are up for grabs. All right. Oh, I meant you. You Barry, you're working hard in the show. It's clearly a very professional show we're doing. Should I tell people to come out during the show and get donuts? Yeah, sure. Cool. Um, everybody, we actually have a lot of gaming news to talk about. We shouldn't waste that much time on the Pac-Man donuts. Some serious [ __ ] in there, too. We'll get to it all because this is kind of funny games daily. Each and every weekday on a",
            "start": 478.0
        },
        {
            "text": "to talk about. We shouldn't waste that much time on the Pac-Man donuts. Some serious [ __ ] in there, too. We'll get to it all because this is kind of funny games daily. Each and every weekday on a variety of platforms, we run you through nerdy video game news you need know about live on twitch.tv/confunnygame, youtube.com/confunname, and podcast services around Thank you. the globe. I don't know if I like that sound. What? I did the around the globe thing. It's been doing that for a while. No, no, no, no. This is my new my new my new amazing Roost coffee cup there from the Nintendo store on it. Saucer. M. You're in a time loop. You'll hear about it on Games Cast tomorrow when I talk up. I'm going to do this for the rest of my life now. No. I give this two weeks. You're You're There's nothing more I love than a nice coffee cup and like like feeling like I'm at a diner. I just don't think the And I get to celebrate Animal Crossing. Huh? I don't think the saucers lasting. [ __ ] you. I",
            "start": 519.68
        },
        {
            "text": "more I love than a nice coffee cup and like like feeling like I'm at a diner. I just don't think the And I get to celebrate Animal Crossing. Huh? I don't think the saucers lasting. [ __ ] you. I always feel bad for Merit cuz Barrett always sets it up and then does that Barrett sigh cuz I come out with two cups and they give me another coaster. So, this solves a problem. Now I have a permanent coaster. Yeah. Boom. Defend. All right. Uh, you know, speaking of the coasters, I know we got a lot to get to, but like sometimes I like preemptively put out more coasters cuz I have noticed that. And then I'll see people like throw the extra coasters down here. Don't do that [ __ ] Don't do that [ __ ] I don't know who's doing it. You know who's doing it. Mike. Mike would be the only one doing it. I digress. Uh, if you're not watching us live, of course, you can catch us later on youtube.com/kindfunnygames and podcast services around the globe. If you're taking one of those free methods, please",
            "start": 556.64
        },
        {
            "text": "digress. Uh, if you're not watching us live, of course, you can catch us later on youtube.com/kindfunnygames and podcast services around the globe. If you're taking one of those free methods, please like, subscribe, share, leave a comment so everybody knows you're enjoying the show and we can find more listeners and viewers. However, if you want to go that extra mile, there's two ways. Number one, if you're watching live, super chat, you of course can go to youtube.com/kindfunname super chat with your thoughts and opinions on the today's news. Be part of the show as we go. Like so many people already have, I'm looking in here. The only one that's pertinent to the donut is Ninf, who's heading to Crispy Cream now. What the [ __ ] Crispy Cream. Why? Where's the sponsorship? Help us out on that one. You know what I mean? I appreciate that. Of course, this was an unbiased Crispy Cream review. Um, if you want to help out later, of course, you can pick up the kind of funny membership. Uh,",
            "start": 596.16
        },
        {
            "text": "that one. You know what I mean? I appreciate that. Of course, this was an unbiased Crispy Cream review. Um, if you want to help out later, of course, you can pick up the kind of funny membership. Uh, you go to youtube.com/kindfunname. Uh, patreon.com/kindfunn and Spotify. You can kick us $10, get all of our shows ad free. Uh, that of course is more than 80 shows a month. And you get your daily dose of me, Greg Miller, in a series I call Gregway, which is a 15 to 20 minute video and podcast throughout the day every day. You're gonna stick with just the word strawberry. Outstanding. Yeah, it's really good. Chocolate. Not bad. Yeah. Not like No, it's it's a fat doughnut with a cake frosting on it. That's a lot of sweetness, right? Nice. I love this White Lotus shirt. Oh, wow. Is here if you're an audio listener. Holy [ __ ] Well, it's one of those few It's a I don't think it's a well-kept secret, but we talk so much for a living that Tim's literal kryptonite are crispy cream donuts. I",
            "start": 636.32
        },
        {
            "text": "an audio listener. Holy [ __ ] Well, it's one of those few It's a I don't think it's a well-kept secret, but we talk so much for a living that Tim's literal kryptonite are crispy cream donuts. I didn't know this about him. He can't say no. He doesn't want to eat them, but he can't say no to them. So, he gets mad when people bring them in. And I understand. I feel it right now. So, these strawberry boys, I'll be rolling in it. You know what I mean? I digress. Uh, of course, remember some housekeeping here. We're an 11 person small business all about live talk shows. We're starting your broadcast day today with kind of funny games daily, but immediately after that, you're gonna get a preview from Nick, Mike, and Roger of FBC Fire Break. You guys got to play this. Now you get to come on the Games Cast talk about it. Yeah, I'm excited with Nick. Nick on the Game, right? Always always a little treat to have Nick out there doing whatever he does. It seemed like previews were positive, but",
            "start": 677.52
        },
        {
            "text": "Games Cast talk about it. Yeah, I'm excited with Nick. Nick on the Game, right? Always always a little treat to have Nick out there doing whatever he does. It seemed like previews were positive, but don't tell me what you think. I want to listen to yours later. Of course, after that, you're going to get the stream. It's going to be Mike and Nick playing the Hunt Showdown and maybe Tarov. You know how the stream boys roll. What are they feeling? Pretty sure it's Tarov. Okay, great. And then it will not be live. But yes, ladies and gentlemen, and NBS, we will be doing a live reaction to the Superman trailer. James Gun Superman trailer is out. It wasn't cold enough in the studio for me to put on my sweatshirt, but I got my sweatshirt all set to go. I'm ready to mark out be a huge dork, yell about stuff I've seen. Uh we're also going to do an Iron Hart uh live reaction as well. Iron Hart hoodie. Zero. Oh, no. Yeah, I have no head for this whatsoever. Uh these will not be live streamed",
            "start": 715.92
        },
        {
            "text": "about stuff I've seen. Uh we're also going to do an Iron Hart uh live reaction as well. Iron Hart hoodie. Zero. Oh, no. Yeah, I have no head for this whatsoever. Uh these will not be live streamed while they're recorded. That is how we got dinged before. Apparently these when you upload a video that you're commenting on, they're okay. But when you live stream it, they flip the [ __ ] out. They're just like, I I don't understand this content. I think you're stealing our content. So, uh, yeah, just to be safe and make sure that we can keep the shows rolling. Uh, we're not going to do that live because if we get struck again, then we can't upload or stream for a week. Then we'd be doing it all on my per my old college one. Oh, hell. YouTube.com/GJM7BF. What the [ __ ] on that channel right now? Maybe I shouldn't have sent you to it. Um, if you're a Gregway or I'm sorry, if you're a kind of funny member, today's Gregway is 15 minutes about me being tired and Ben's introduction to the MCU.",
            "start": 750.72
        },
        {
            "text": "Maybe I shouldn't have sent you to it. Um, if you're a Gregway or I'm sorry, if you're a kind of funny member, today's Gregway is 15 minutes about me being tired and Ben's introduction to the MCU. We got a fan, y'all. Uh, thank you to Patreon producers Carl Jacobs, Omega Buster, and Delaney Twining. Today, we're brought to you by Shady Rays, Aura Frames, and Rocket Money, but we'll tell you about that later. For now, let's begin the show with what is and forever will be the Roper Report. Time for some news. Seven items on the roper report. A big dozen. Number one, Sony considers PS5 price hikes to cover Trump's tariffs. This is Dominic Preston over at The Verge. Sony just announced its financial forecast for the next year, and it's expected to be impacted by tariffs to the tune of $680 million US. To compensate, the company says it's considering options, including moving manufacturing to the US and increasing prices for consumers. Speaking to investors during the company's earnings",
            "start": 795.84
        },
        {
            "text": "million US. To compensate, the company says it's considering options, including moving manufacturing to the US and increasing prices for consumers. Speaking to investors during the company's earnings call, Sony CFO Lynn Tao confirmed that the company is considering quote passing on and quote the price to tariff of tariffs to consumers in order to mitigate the impact on the bottom line. Tao didn't mention the PS5 by name, though, and it's possible that Sony could try to protect pricing on its console, though increases elsewhere in the electronics business. or through increases elsewhere in the electronics business. Sony has already increased the price of the PlayStation 5 this year, but only in the UK, Europe, Australia, and New Zealand. Roger. Hi. I mean, there's more story here, and I'll do it. But just as a quick aside, it's coming. Yeah. You don't go every other I mean, it's like last resort kind of [ __ ] of every flip switch to flip, but you're there. The week after the Xbox",
            "start": 843.44
        },
        {
            "text": "I'll do it. But just as a quick aside, it's coming. Yeah. You don't go every other I mean, it's like last resort kind of [ __ ] of every flip switch to flip, but you're there. The week after the Xbox thing, I was like, we're sure for sure getting it. Like, it's it's gonna The fact that it hasn't happened now, I'm surprised. Yeah. Uh the PS5 did get a call out from CEO uh he roi to Toki uh when discussing the possibility of moving manufacturing to the US to avoid the brunt of Donald Trump's tariffs. He admitted that the console quote can be produced locally and that it would be quote an efficient strategy that has been considered going forward. Over the 12 months ending March, Sony shipped 18.5 million PlayStation 5 consoles, down slightly from 20.8 8 million the year before, bringing its lifetimes shipments to 77.7 million shipped. Sony still manufactures the majority of PS5 hardware in China. And so its gaming business is especially at risk right now, even after the 90-day pause and",
            "start": 885.52
        },
        {
            "text": "lifetimes shipments to 77.7 million shipped. Sony still manufactures the majority of PS5 hardware in China. And so its gaming business is especially at risk right now, even after the 90-day pause and reduction in rates announced last week. The 30% tariff on imports into the US from China is substantially higher than the 10% rate levied for other countries, and games consoles were not included in the examples for select other electronics exemptions. I apologize for select other uh electronics. Microsoft has already raised the price of its Xbox console up by $100, though Nintendo has so far elected to keep Switch 2 pricing the same ahead of its launch next month. To which Joey Radstone super chats and says, \"Get a Switch 2 now before they're $600.\" Yeah. I mean, if you can't get a Switch to uh cra I mean, expected, right? Expected in terms of like sadly sadly expected. Um, but it is interesting the uh little note there of like, hey, it is possible potentially for us to develop stuff in",
            "start": 928.32
        },
        {
            "text": "uh cra I mean, expected, right? Expected in terms of like sadly sadly expected. Um, but it is interesting the uh little note there of like, hey, it is possible potentially for us to develop stuff in America. And is that just lip service? Is that just a financial lip service you say of like, yeah, we're investigating that and we're finding out, no, we're not going to do it. Sure. Yeah. Then they look at the uh you know realistically oh it's going to take like a decade to have like infrastructure uh built and for people to learn what they need to do to like work at these uh places and all this stuff. Oo that's a lot of investment there buddy. Yeah. Yeah for sure. Uh it's interesting that they even mentioned it which is that that surprised me cuz I I feel like a lot of these companies just don't even say that like it's not even a possibility but uh yeah it's to me it's it's going to happen eventually. is just the what is the level of it, right? Are we moving PS5 Pros all the way up to an",
            "start": 977.12
        },
        {
            "text": "even say that like it's not even a possibility but uh yeah it's to me it's it's going to happen eventually. is just the what is the level of it, right? Are we moving PS5 Pros all the way up to an insane even more of an insane number or are we just doing PS5 base? Are we raising all of our games like uh Xbox did? Like is this just is this going to be what is it going to look like? Right? And that's how you across the board. I think to your point uh of bringing Xbox, I thought, \"Okay, then other shoes going to drop no any time now.\" Even Nintendo, right, when they said, \"All right, you know, we're keeping the Switch 2 price the same for launch.\" When they went out with pre-orders, that to me speaks of, of course, just how crazy and shifting these sands are right now. But them very much saying without saying we're we're leaving the door open to raising this later on. I think if you're PlayStation, if you're Nintendo, there's both the well the other guys are doing it, so what's it matter?",
            "start": 1021.12
        },
        {
            "text": "without saying we're we're leaving the door open to raising this later on. I think if you're PlayStation, if you're Nintendo, there's both the well the other guys are doing it, so what's it matter? And then there is the both, well, we got to try to make money and make up for these deficits we're looking at. So, yeah, you do it. And I think it would be both. And I think it would be the same conversation we have all the time of is the PlayStation 5 Pro for you. Which brings in Terry Huffman, who's super chat before I think we were even live. I have a PS5 base. My TV runs it fully with HDR 4K. Is a PS5 Pro even worth it anymore since we know GTA 6 ran on a base on a base PS5? I think we double typo there, but yeah, Terry, only you can decide how much money uh you're or how much money a PlayStation 5 Pro is worth. As somebody who uses both a PlayStation 5 Pro and a PlayStation 5 often, I see the differences, but I still haven't seen differences where I'd be like, \"Ah, this would be the",
            "start": 1063.44
        },
        {
            "text": "5 Pro is worth. As somebody who uses both a PlayStation 5 Pro and a PlayStation 5 often, I see the differences, but I still haven't seen differences where I'd be like, \"Ah, this would be the one.\" I think Monster Hunter runs so much better on my PlayStation 5 Pro, but it doesn't run the garbage mode on PlayStation 5. I do think when you're talking about GTA 6, again, talking out of our asses, we haven't played it or touched it. I would imagine you're going to see it in load times, you're going to see it in fidelity, you're going to see it how far it out is there. Yeah. And how much does that matter to you? I'll tell you, as somebody who's been uh re-reviewing and replaying, I should say, for the re-review, Outer Worlds, everybody, remember, we're reviewing it the Friday before the week of SGF so that we can do it on Friday and then be SGF and then be on ready for the next week's Xbox presentation of Outer Worlds 2. Playing that on my Xbox Series X, loving it. Playing it on my RA ally",
            "start": 1106.08
        },
        {
            "text": "SGF so that we can do it on Friday and then be SGF and then be on ready for the next week's Xbox presentation of Outer Worlds 2. Playing that on my Xbox Series X, loving it. Playing it on my RA ally through remote play. Amazing. When I got on the plane with the Xbox Series S and the X screen and booted up and I was like, \"Oh, [ __ ] Right. We can't run this at 60.\" Oh my god, it was a rough 30 minutes before I was just back to it and now I'm back to my beautiful screen and my beautiful Xbox Series X. My god, it's gorgeous. Yeah. No, it's it's it's interesting because like we even talk about Death Stranding, right? Death Stranding 2, right? That they they did previews on the base PS5 and that game Oh, did that I missed I mean I knew that but I forgot. Yeah, that's what Blessing and he was like, dude, this game looks amazing. Right. So, I mean I think it's all up to your sensitive eyes, right? Like if you are if you see all the pixels, if you if you know that you're not getting the best",
            "start": 1145.76
        },
        {
            "text": "dude, this game looks amazing. Right. So, I mean I think it's all up to your sensitive eyes, right? Like if you are if you see all the pixels, if you if you know that you're not getting the best experience and you want the best experience, that's what PS5 Pro is for. But I I don't think for the base majority of gamers, you're not going to know that. Yeah. Yeah. But I think there is then an interesting conversation here, right, of uh Christopher Bernett, I just got my PlayStation 5 Pro to avoid any price hikes. Interesting. There is that conversation both for a PS5 and for any of the consoles we're talking about. Well, Xbox, I guess, but any of the consoles of like I don't need a second Switch, but I know Ben's going to want one eventually, and I'd like to have it at launch. And also, I'd like to have it at a cheaper price than if I had to go, you know, same thing if you didn't have a PlayStation 5 or you're sitting waiting for a Pro for GTA 6 by the time GTA 6 gets here next year. Who",
            "start": 1187.12
        },
        {
            "text": "to have it at a cheaper price than if I had to go, you know, same thing if you didn't have a PlayStation 5 or you're sitting waiting for a Pro for GTA 6 by the time GTA 6 gets here next year. Who the [ __ ] knows what the world economy is going to look like? Yeah, absolutely. I mean, it it gets me thinking specifically for the PS5 Pro because again, even though PS Death Stranding 2 runs really well on the base PS5, I still think about it. I'm like, \"Oh man, I want I want the best experience.\" So, uh, if that goes up to What's the PS5 Pro at right now? It's 7006. Is it really 69? I'm assuming it's pricey pro buy. How much that from direct? Yeah. $6.99. $6.99. So, that goes to 800. Oh, it's going to be more than 800. I feel like cuz what the series X went up 100? Yeah. Well, no. 150. No. No. I think somewhere around there. They they did a in my stupid I'm not good at math way a convoluted roll out where but I think it's how much on every skew they needed to try to do it. Yeah. Yeah. For",
            "start": 1225.84
        },
        {
            "text": "I think somewhere around there. They they did a in my stupid I'm not good at math way a convoluted roll out where but I think it's how much on every skew they needed to try to do it. Yeah. Yeah. For sure. Um yeah. No, you're going to see that influx of the people that know that are are trying to get in there a little bit early. But yeah, it's it's it's it's going to happen and it's uh it's it's super sad because I look back at the I was talking I I'm doing um woodworking right now and this one guy, he's identified me as the gaming guy. So he comes up to me and he has no no idea about video games. He has FIFA and he has an Xbox One. So he uh he walks up to me. He's like, \"What's going on with gaming? What's going on with this?\" And I'm like, \"Oh, the price jumped to this thing.\" And he's like, \"Oh my gosh, that's crazy cuz no one's buying Xboxes.\" I'm like, \"Yeah, that's kind of true, but like whatever.\" Um uh but yeah, no, it's it's interesting talking to someone like him who um is",
            "start": 1273.28
        },
        {
            "text": "like, \"Oh my gosh, that's crazy cuz no one's buying Xboxes.\" I'm like, \"Yeah, that's kind of true, but like whatever.\" Um uh but yeah, no, it's it's interesting talking to someone like him who um is now looking at the marketplace of a new console and he's just like, I don't I will not buy another one, right? Like there's no way for me to do it because and he looked at me and he said the same thing that is true. He's like, \"Wasn't this time around the last generation, consoles were cheaper?\" I'm like, \"Yeah, m much cheaper. Much cheaper. They were This was the time when you got the Slims and you were able to get in there and you were able to buy a console for half the prices of once launched for.\" So, uh we are in completely uncharted uh territory. And I I'm so interested to see if hopefully when the uh tariffs go away and we're able to get back to a normal economy when it comes to uh electronics eventually in the next seven years or whatever, next next administration, whatever it",
            "start": 1312.08
        },
        {
            "text": "when the uh tariffs go away and we're able to get back to a normal economy when it comes to uh electronics eventually in the next seven years or whatever, next next administration, whatever it looks like. Well, that'll be Trump's third term. Sure. Jesus [ __ ] Christ. Or or it'll be someone else and they'll be like, \"Actually, this is actually kind of nice, but it's good now because it's us.\" Listen, we wish we could undo it, but that's how they caused more chaos in the market. Well, that is Well, that is the question that I have, right? Like, is this a forever thing now? Will we never see a market now where the PS6 h goes to half price halfway through its generation? Is it always going to be if it launches at 600, is it always going to be 600? No, I think we will I think in some way, shape, or form the market will correct back to what it was before when I do think these tariffs go away. I do think this is a bad move. I do think this is anti-consumer and anti-worldwide economy. You",
            "start": 1348.0
        },
        {
            "text": "or form the market will correct back to what it was before when I do think these tariffs go away. I do think this is a bad move. I do think this is anti-consumer and anti-worldwide economy. You know what I mean? I don't think it's going to net out the way they the Republicans think it's going to net out for us. But we'll have to wait and see on all that. And if that's the case, when it would be there, I think you would see the next leader who steps in strip them away and try to get it back and da da da da da. And then I think then it is into this weird one of like well where is gaming? What is gaming? You know we've talked so much I know and I we beat this dead horse all the time of Matt Piscatella saying we're a mature market and you bringing in this great example of somebody who's a casual gamer like I want to go up. It's like well if you want to go up fine but if we are all going up and we're willing to pay that for the PlayStation 6, the next Xbox whatever. What does that look",
            "start": 1391.12
        },
        {
            "text": "casual gamer like I want to go up. It's like well if you want to go up fine but if we are all going up and we're willing to pay that for the PlayStation 6, the next Xbox whatever. What does that look like? Who are they catering to? Have the bottoms fallen out on all these corporation stock prices? So now that they've come back and they're not at the 2020 levels of how profitable you were, but you're you're here at 2025, but now you're here at 2027, right? And it's like, all right, cool. Now we're maintaining this midlevel. That's what shareholders expect. They don't need the glory days. They're happy with what they're making. Like there's so many moving parts to it. Yeah, it's tough because I I am of the mind that some of this will stick. I don't know what that is. I'm I'm sure it's game prices. Game prices. If we're going to 80, if Xbox is going to 80 temporarily, or they didn't say temporarily, but for now, uh, we're not going back to 70 unless they see all these games completely.",
            "start": 1428.24
        },
        {
            "text": "prices. Game prices. If we're going to 80, if Xbox is going to 80 temporarily, or they didn't say temporarily, but for now, uh, we're not going back to 70 unless they see all these games completely. Almost like Call of Duty, unless Call of Duty completely flops. There's I don't think we're going back to over here in the chat, right? They're talking about, you know, uh, Rookie 117 prices will not go down unless the sales plummet. That's exactly back to the stock price, right? where if they're not happy with this thing, then it would be [ __ ] have all the first parties make smaller games, shorter games, turn them faster, lean and mean, get everything down and let's go so that we could do this. Mafia Little Country. Yeah. Exactly. Right. And I think and again, we always, you know, since I've been talking about video games, talk about exploring the scale, right? Let's explore how much a game is worth. And a GTA, fine, you're $100, whatever. But yeah, something like Mafia the Old Country,",
            "start": 1467.6
        },
        {
            "text": "been talking about video games, talk about exploring the scale, right? Let's explore how much a game is worth. And a GTA, fine, you're $100, whatever. But yeah, something like Mafia the Old Country, we're going to do $50. This is going to this is a linear experience and we're telling the story. We're doing this thing. Exactly. Right. And so hopefully as more things come in that's great for us the established gamers but dude who doesn't want to buy another console what does that mean? Does that mean a PC eventually? Does that mean just a Steam Deck? Does it mean cloud gaming? You know again has Microsoft futurep proofed in an not even future proofed prepared for this moment in a very interesting way where okay cool 10 bucks put it on your phone with this backbone controller as a pro now yada yada yada. Yeah. I mean, I pitch the Steam Deck to more uh novice and uh uh casual gamers more than anything now. Uh where I look at them, I say, \"Hey, if you have a kid that is into the stuff or",
            "start": 1506.64
        },
        {
            "text": "yada yada. Yeah. I mean, I pitch the Steam Deck to more uh novice and uh uh casual gamers more than anything now. Uh where I look at them, I say, \"Hey, if you have a kid that is into the stuff or semi- into the stuff and you don't know what to get, maybe a Steam Deck is the right option. Games go on sale all the time. You know what you're getting. You could potentially uh you can fix this thing. You can upgrade it uh for another thing. You can play it on a PC. You can play games.\" Yeah. Games. Wink wink. Nudge nudge. What? Talking about the porn games? No, I'm talking about like perverts. No, like games. Oh, you're emulate. Oh, allegedly. Allegedly. Alleged the games. Alleged games. All that juice in the YouTube chat brings up an interesting point and says all this is going to kill off the casual audience. I would pivot and say does it matter and I know outrageous thing to say, but again, let's talk about Matt Piscatella being here and talking about what was it 43% of gamers only play",
            "start": 1543.76
        },
        {
            "text": "casual audience. I would pivot and say does it matter and I know outrageous thing to say, but again, let's talk about Matt Piscatella being here and talking about what was it 43% of gamers only play Fortnite and something else on their machine. Like they only turn it on and do that. So, it's like they're not contributing. Yeah, they bought consoles, sure. They're buying V-Bucks, sure. But like for what we're Expedition 33 is not going to be affected by those the Madden people and the Call of Duty people and the Fortnite people walking away. Yeah, but I mean they they're the bedrock of this whole industry. Like I mean I that's what that's my argument here, right? Like you see those numbers, you see the the games that are always at the top of the of the of the charts. It's always the casual games. My but and and I I think it's worth calling out before everybody says I'm stupid and an idiot, right? My argument here is it would be it would be a different looking market, but would it be a",
            "start": 1586.4
        },
        {
            "text": "games. My but and and I I think it's worth calling out before everybody says I'm stupid and an idiot, right? My argument here is it would be it would be a different looking market, but would it be a market that reflects more what we all want and what we love? Would it suddenly be people are exploring the scale with smaller, cooler games? Indies matter more. Da da da da da da da da. I'm not worried about video games going away. Nor am I really worried about PlayStation going away, right? Okay, revamp what that PlayStation means and what your expectations are and da da da da. Barrett, as someone who grew up good today, you know. Yeah, we do look good. Um, I think we both do. As someone who grew up with two very young uh parents who didn't have a lot of money uh in terms of what I had access to, I was always a generation behind. Sorry, getting choked up. Definitely not choking on food. Um like I got my first N64 in 2002, you know, and that's like that's like post GameCube coming out, I",
            "start": 1623.36
        },
        {
            "text": "to, I was always a generation behind. Sorry, getting choked up. Definitely not choking on food. Um like I got my first N64 in 2002, you know, and that's like that's like post GameCube coming out, I think. Right. And Duro in the chat says like casual audiences will probably just be a generation or two behind. And I think that's probably going to be the more likely case. It's not going to kill a casual audience because there's still always going to be an in interest in the c from the casual audience of interacting with this medium. Um but just what they have access to uh in terms of what's hot. Uh I think that's going to be a little bit uh died down. And again, we're in such an interesting place where okay, let's just say for hypothetical sakes, right? You're talking about the Xbox whatever the next Xbox 2030 I'm gonna call it the next Xbox right 720 finally finally cool cutting edge you're all there and then people are still doing Xbox Series S and they're doing the cloud gaming on",
            "start": 1664.72
        },
        {
            "text": "the next Xbox 2030 I'm gonna call it the next Xbox right 720 finally finally cool cutting edge you're all there and then people are still doing Xbox Series S and they're doing the cloud gaming on that through that and they're getting like that again is we're in even for PlayStation 5 right of like you assume PlayStation 6 will be able to play PlayStation 5 PlayStation 4 all the way back now the donuts too but you know what I mean of like we're in a market now where there are you're back to what people have always predicted with the mobile system of like there you can have the fanciest iPhone or you can have whatever iPhone. Eventually, it'll get phased out, but you are there and there are options and what does that new casual market look like? And even now, as much as I uh champion ExCloud and talk about cloud gaming and all that stuff, and also understand that that's above a lot of people's pay grades, is it anymore for the casual consumer, especially when it's going to be I miss",
            "start": 1711.6
        },
        {
            "text": "and talk about cloud gaming and all that stuff, and also understand that that's above a lot of people's pay grades, is it anymore for the casual consumer, especially when it's going to be I miss gaming and you just need one person to be like, well, for 10 bucks and that thing and the controllers you already have at home for your old Xbox, for your old PlayStation, you could do all this stuff and go if people are looking for deals and still want to get in. Yeah. And you got to think about it, right? Like talking about the generations of all of it all, right? Like there's so much cross generation games. Every single game that matters in terms of the big, you know, f top five games of the year are pretty much cross generation games. The only times takes it took about four years for a big exclusive casual game to come out that was exclusive to the nextG consoles and that was college football, right? Like and that was a big seller for those consoles specifically because that was the first",
            "start": 1748.48
        },
        {
            "text": "casual game to come out that was exclusive to the nextG consoles and that was college football, right? Like and that was a big seller for those consoles specifically because that was the first time people looked around and said, \"Oh, it doesn't work on my Xbox One. [ __ ] Okay, I need to get another one now.\" Um, so it does take a lot of time and yeah of of I understand to your point, right? The the hardcore is going to bolster the launch of any and that's not necessarily my point, just a question I'm asking. But I think you're right though. I think you're right in terms of like the hardcore always bolsters the launch of any new um console and the adoption rate starts from there and then it just goes up and up through the casuals eventually taking their time and waiting for the for the sales. But my issue is just if the sales don't happen, right? if we are if we get to the point where this console stays at the high price and then also more games are going to be crossplatform because",
            "start": 1789.04
        },
        {
            "text": "But my issue is just if the sales don't happen, right? if we are if we get to the point where this console stays at the high price and then also more games are going to be crossplatform because the adoption rate is going to be lower potentially for the next generation. Um yeah, it's interesting but also we're at the point now where PS5 is has the pretty much neck andneck with PS4 in terms of sales which is which is really incredible. So any some super chats in here to plow through. Jay plays casual. What do you think the increase will be? 50 to 150 across the board for a PS5 lineup. I think again I'm a big idiot and don't understand economics. I'd imagine it would mirror what Xbox has done where PlayStation 5 regular gets this percentage of an upgrade in this PlayStation 5 Pro gets this much if it is all based on chips and imports and this that and the other. I think there'd be some reason to do it there. Uh oh, Silk Gamer says, \"Do you think this extends the console generations?\"",
            "start": 1823.36
        },
        {
            "text": "much if it is all based on chips and imports and this that and the other. I think there'd be some reason to do it there. Uh oh, Silk Gamer says, \"Do you think this extends the console generations?\" Great question there. And here we go. Bear's got it pulled up. And this again where I just go crossey because there's so many goddamn things going all over the place, but you see it going for Xbox. Yeah. So, the S the two S models seem to have gone up by $80. It's wild. Uh the X models seem to have gone up by a full hundred. Um and then the two terabyte X went up to 130 bucks. This [ __ ] still blows my mind. Like I would have bet money that Xbox would have tried to figure out a way to keep the Series S specifically at a lower price. which again I think speaks to what this actually is. Like I don't I I think that's the thing. I look at all this and I look at PlayStation, even Nintendo's messaging on it. And I know I get [ __ ] on for saying this, but I do feel bad for them because I don't",
            "start": 1864.08
        },
        {
            "text": "don't I I think that's the thing. I look at all this and I look at PlayStation, even Nintendo's messaging on it. And I know I get [ __ ] on for saying this, but I do feel bad for them because I don't think these these aren't they don't want to do this. This isn't a oh, we can raise the prices and take advantage. They know they're going to lose consumers. They know they're locking people out of especially Xbox when when they're at a place right now where they are very much in third place and people are not buying these consoles. And maybe that was one they built to be, you know what I mean? But hold on. The Portland Kevin also everything's an Xbox now. So true. Yep. It's true. Uh, the Portland Cabin doubles down on the question I asked, but we didn't answer. Got away from uh, what do the higher priced consoles do to the timeline for the next generation? Does it force Microsoft and Sony to push out their future plans? Um, I don't I would say no. No, I would say no. My reasoning being is",
            "start": 1916.32
        },
        {
            "text": "priced consoles do to the timeline for the next generation? Does it force Microsoft and Sony to push out their future plans? Um, I don't I would say no. No, I would say no. My reasoning being is that I think we're all well aware that behind closed doors these machines are being worked on and planned and yada yada yada. And I think you'd be so far on both the Xbox and PlayStation 6 timelines that it's like, well, [ __ ] if we don't do if we throw all of this away, what we we don't know how much that next chip, whatever, is going to cost on top of that. Like, how you're taking a big gamble on again shifting sands and not knowing where this is. And then hopefully the belief that like eventually these tariffs go away. Maybe they go away during this Trump administration as he keeps punting at 30 days and changing his mind and doing this thing and having to touch the [ __ ] stove every [ __ ] 90 days. Like maybe that happens here. Like I think they I think for them they have to if I was",
            "start": 1951.68
        },
        {
            "text": "at 30 days and changing his mind and doing this thing and having to touch the [ __ ] stove every [ __ ] 90 days. Like maybe that happens here. Like I think they I think for them they have to if I was there I'd be like guys it's business as usual. Let's do it and we will cross these bridges when we get to them. Yeah. I kind of wish that they would hold off on this. I mean also just cuz the pandemic [ __ ] up everything in terms of games. Like I I I just want one or two more years. Let's just let's just kind of ride this one now. I think again we're back into room. I hear you and I understand that, but again, I think we're just into this new space where it just isn't like it was PS1 to PS2 to PS3 where it just really is like launch the PlayStation 6. And again, this is me speaking, not PlayStation speaking. And it only sells a fraction of the units, but it's there for the Tims and me or whatever to get the best experience. And it's going to, like you're you talked about already, these",
            "start": 1995.76
        },
        {
            "text": "speaking. And it only sells a fraction of the units, but it's there for the Tims and me or whatever to get the best experience. And it's going to, like you're you talked about already, these games are going to be crossplatform for or you know what I mean? Cross Yeah, crossplatform for the first few years, right? I'm sure there will be a PlayStation 6 game that is exclusive, etc., etc., But it's not like you're freezing out if you have this giant scope. I don't know. You're right. We shall wait and see. Just don't [ __ ] up the Xbox handheld. Can you guys do that for me? Come on. Come on. You know what I mean? $700. Uh, speaking of $700. Whoa. We could use $10 from you. That's a steal, isn't it? That's a steal. Uh, kind of funny. Of course, is an independent 11 person operation here in San Francisco making amazing video game and talk show content for you each and every day live. We start with games daily, do the games cast, and then do usually a slew of programs and maybe a stream in",
            "start": 2034.96
        },
        {
            "text": "Francisco making amazing video game and talk show content for you each and every day live. We start with games daily, do the games cast, and then do usually a slew of programs and maybe a stream in the afternoon. You can watch live on youtube.com/kindfunny games, twitch.tv/confunny games. Of course, get the podcast later on Apple, Spotify, and everywhere they're available. But if you really like us, pick up a $10 membership. It would get you all of our shows ad free. It would get you good karma for supporting us. and it will get you your daily dose of me, Greg Miller, in a series I call Greg Way each and every weekday for 15 to 20 minutes, which adds up to four hours of podcasts exclusive for you. However, right now, you're not using your benefits. So, here's a word from our sponsor. This episode is brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized sunglasses that won't",
            "start": 2075.36
        },
        {
            "text": "This episode is brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized sunglasses that won't break the bank. Shady Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people. Their shades have durable frames and crystal clear optics, making them the perfect choice for all outdoor adventures. They have hundreds of options to choose from, so you're bound to find the perfect pair to match your style. Take it from Tim Gettys, who rocks his shady rays every day, going on Pokémon Go walks out and about SF looking dope. If you don't love your shades, exchange for a new pair or return worry-f free within 30 days. There's no risk when you shop. Their team always has your back with personal and fast support. Exclusively for our listeners, Shadyra is giving out their best deal. Head to shadyra.com and use code funny for 35% off polarized",
            "start": 2113.52
        },
        {
            "text": "Their team always has your back with personal and fast support. Exclusively for our listeners, Shadyra is giving out their best deal. Head to shadyra.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. That's shady.com, promo code funny. This episode is brought to you by Auraframes. Every day we're taking photos from big events to silly moments. But doesn't it sometimes feel like all of your favorite photos are just stuck on your camera roll? Wouldn't it be great to have an easy way to share and enjoy them with friends and family? That's where Aura comes in. Aura makes it effortless to upload unlimited photos and videos directly from your phone so your favorite memories are always within view. Plus, you can personalize and preload an Aura frame for a unique and special gift. We love Aura Frames in this office. Roger has one at home he got for his fiance's birthday, and she absolutely loves it. It takes about two",
            "start": 2158.08
        },
        {
            "text": "and preload an Aura frame for a unique and special gift. We love Aura Frames in this office. Roger has one at home he got for his fiance's birthday, and she absolutely loves it. It takes about two minutes to set up the frame using the Aura app. Add unlimited photos and videos and invite as many people as you want to an Aura Frame. There are absolutely no hidden fees or subscriptions. And for a limited time, listeners can save on the perfect gift by going to aura.com to get $20 off plus free shipping on their bestselling Carver matte frame. That's a frames.com. Promo code aura 20. Support the show by mentioning us at checkout. Terms and conditions apply. This episode's brought to you by Rocket Money. With prices going up on just about everything lately, being smart with your money isn't just a good idea. It's essential. But managing subscriptions, tracking spending, and cutting costs can feel overwhelming. Lucky for you, Rocket Money takes the guesswork out of it so you can easily make",
            "start": 2201.04
        },
        {
            "text": "a good idea. It's essential. But managing subscriptions, tracking spending, and cutting costs can feel overwhelming. Lucky for you, Rocket Money takes the guesswork out of it so you can easily make smart decisions. Rocket Money has helped multiple members of Kind of Funny learn they were still paying for things they totally didn't even realize. Rocket Money is a personal finance app that helps find and cancel your unwanted subscriptions, monitors your spending, and helps lower your bills so you can grow your savings. Rocket Money's dashboard gives you a clear view of your expenses across all of your accounts, and then you get alerts if bills increase in price, there's unusual spending activity, or if you're close to going over budget. Rocket Money has over 5 million users and has saved a total of 500 million in canceled subscriptions, saving members up to $740 a year while using the app's premium features. Cancel your unwanted subscriptions and reach your financial goals faster with",
            "start": 2245.2
        },
        {
            "text": "total of 500 million in canceled subscriptions, saving members up to $740 a year while using the app's premium features. Cancel your unwanted subscriptions and reach your financial goals faster with RocketMoney. Go to rocketmoney.com/kindfunn today. That's rocketmoney.com/kindfunnmoney.comkindfunn. Roger. Hi. In the super chats, Resolute says, \"Nick freaked those ads.\" Ah, dude. He freaked those. I have seen a rise in the conversation of freaking since the Death Stranding stream. Could you please explain it to me? Uh, well, as you know, Greg, uh, Mike and I freaked it for 60 hours straight. Uh, we were going ham in this video game. Uh, we were ordering Red Robin. We did, by the way, order that pizza. Uh, it was horrible. We shouldn't have done it, but um, we [ __ ] up. Super chatter chat broke it down for me of like tough looks at it. This looks great. This is disgusting. It was tough. But, uh, Nick freaked those ads. He did a great job. And we just want to let them know and give him",
            "start": 2284.32
        },
        {
            "text": "broke it down for me of like tough looks at it. This looks great. This is disgusting. It was tough. But, uh, Nick freaked those ads. He did a great job. And we just want to let them know and give him the love and the support that he needs. Did you invent freaking or is this an adjective? Uh well, it's more of like from uh future. Uh future said, uh I I went into the penthouse and I freaked it. You know what I mean? So then I was just kind of going off that. So freaked. Is this something I should be saying or not? Because I feel like when I started saying dead ass, people like Greg, you can't say that. Well, I mean, you can't say it, but you can say it. I'm going to let you. I'm going to give you the pass. You can say freaked it and you can also say dead ass. That's awesome. That's dead ass. You can't say cap, though. That was the last you can't say people like when you when you did it when you did it like as a normal you trying to get that off normally. I was like no shot you can't",
            "start": 2331.36
        },
        {
            "text": "ass. You can't say cap, though. That was the last you can't say people like when you when you did it when you did it like as a normal you trying to get that off normally. I was like no shot you can't absolutely not. I appreciate that. Keep me honest. Uh number two will game chat hinder switch to performance? We go to wesleyinpool@ign.com. And if you notice I started writing Wesleyinpool's name in there as WP WP at IGN. I love that. He's the best. Uh, the tech experts at Digital Foundry have revealed the final tech specs for Nintendo Switch 2 and with it claimed that game chat feature has a significant impact on system resources to the point where developers are said to be concerned. During last month's Nintendo Direct, Nintendo revealed the Switch 2's game chat functionality triggered by a press of the C button on the new Joy-Con. Players can watch each other enjoying the game or different titles and with the help of a camera even see each other. It's made all the easier by a built-in",
            "start": 2361.52
        },
        {
            "text": "press of the C button on the new Joy-Con. Players can watch each other enjoying the game or different titles and with the help of a camera even see each other. It's made all the easier by a built-in microphone that is shown to be relatively reliable regardless of the player's gaming environment. The C buttons chat menu aims to be an all-in-one multiplayer feature that could result in Nintendo's most successful online push in decades. Digital Foundry said Nintendo provides developers with a game chat testing tool that simulates API latency and L3 cache misses that the realworld game chat incurs on the system. Okay, are we keeping up? We all in still. We're going in deeper, everybody. All right. L3 was the L3 button. Yeah, me too. I was like, \"Wow, that's a This means developers can run tests without needing to active active game chat sessions running.\" DF is now uh Digital Foundry is now left wonder I was like, \"What the [ __ ] is this?\" Digital Foundry is now left wondering whether",
            "start": 2409.12
        },
        {
            "text": "without needing to active active game chat sessions running.\" DF is now uh Digital Foundry is now left wonder I was like, \"What the [ __ ] is this?\" Digital Foundry is now left wondering whether game performance for the end user is impacted by having game chat on or off. Interesting. If game chat resources are within the system allocation, it shouldn't make any difference. However, given Nintendo provides game chat emulation tools, the suggestion is there is a hit of some description the developers need to test for. As Digital Foundry put it, quote, \"We'll be interested to see how Game Chat may or may not impact game performance as this does seem to be an area of developer concern.\" End quote. We won't know for sure until Switch 2 comes out on June 5th. Meanwhile, Digital Foundry revealed the Switch 2's final tech specs. Switch 2 memory system reservation is 3 GB with 9 GB available for games. For context, the Switch 2 has8 GB memory system reservation and 3.2 GB available for games.",
            "start": 2455.44
        },
        {
            "text": "the Switch 2's final tech specs. Switch 2 memory system reservation is 3 GB with 9 GB available for games. For context, the Switch 2 has8 GB memory system reservation and 3.2 GB available for games. That's a significant chunk of the Switch 2's resources that games do not get. As with all consoles, Switch 2 developers don't get access to the full GPU resources, which I'm sorry, with some reserved by the system. Yeah, this is not surprising to me. I mean, when you see the game chat and the way that it's working, they even the fact that they even showed it in the trailers. I mean, yeah, look how framey. Yeah, they drop it down to like 15 frames per second for all your friends, uh, which I assumed, it definitely is for, uh, them being able to, uh, make sure that everything runs well on the system, but this is clearly an intensive task that's happening on the Switch, too. So, uh, yeah, it doesn't surprise me that this has some type of memory, uh, situation here where, uh, we potentially",
            "start": 2497.68
        },
        {
            "text": "system, but this is clearly an intensive task that's happening on the Switch, too. So, uh, yeah, it doesn't surprise me that this has some type of memory, uh, situation here where, uh, we potentially can see games not running as well, uh, when you're sharing it to a bunch of people at the same time. Um, like Discord itself struggles with that. Exactly. And that's not that's usually on a PC where maybe you're not running the game itself, right? For sure. Um, will it actually matter? Like, will we get to the games? Will I play Mario Kart and uh, notice that my frames are way less than before? Uh, I kind of don't think so. I don't know. I I believe in Nintendo specifically for this of like I don't think that they would implement something that would destroy the way that a game runs. Um so yeah, I I I understand on paper that's what it looks like, but I I would be interested to see how it actually runs because I don't think it's going to affect anything noticeably. We'll have to wait and",
            "start": 2543.36
        },
        {
            "text": "I I I understand on paper that's what it looks like, but I I would be interested to see how it actually runs because I don't think it's going to affect anything noticeably. We'll have to wait and see. Uh I'm I'm down on game chat period. Damn. I you know, hater. He hates connecting. I hate connecting. I hate bridging gaps in worlds. Um no, I just think it's a I I get the idea of chasing it. I just hate when I see hardware people chase stuff they don't need to chase. You know what I mean? I talk I go back all the time to when the PlayStation 4 got revealed and two or three weeks before I got interviewed by like the New York Times or whatever and I kept saying I was like well this is how I would do it but they never do what I do and they did everything I would done. I was like oh my god they made a machine about games. They're like not getting caught up in the other [ __ ] And then you get to PlayStation 5 like we introduced game cards in a hint system. Like none of that [ __ ] is used.",
            "start": 2583.04
        },
        {
            "text": "made a machine about games. They're like not getting caught up in the other [ __ ] And then you get to PlayStation 5 like we introduced game cards in a hint system. Like none of that [ __ ] is used. It is not helpful. Why did you waste your time with it? Like cut the fat off of this. And so I can only speak from my own personal thing of I am never going to use this. And you I saw somebody in the Twitch chat say, you know, I it doesn't affect me. I'm glad they did it, you know, especially for kids. Like I will never be comfortable walking and seeing Ben using this in seven years talking to his friends from school. But I will say for me, you know, when I was a kid, this would have been the greatest thing in the world. For me, I was not living near any of my friends. So being able to connect with them and and put on right. Next story. Greg got his. Let's move on to some good Nintendo news. Maybe number three. Super Mario World appears to be the title of the next Mario movie. Uh this",
            "start": 2628.4
        },
        {
            "text": "with them and and put on right. Next story. Greg got his. Let's move on to some good Nintendo news. Maybe number three. Super Mario World appears to be the title of the next Mario movie. Uh this comes from Wario and NBC. Uh Wario I saw last night on Blue Sky break out this story and then have to update it because the upfronts are happening. So, they put out stories about the things and then they mentioned Super Mario World and then they've now quietly removed it from the press release. It originally read blockbuster hits including Wicked for good, Jurassic World and Five Nights at Freddy's 2 streaming exclusively on Peacock following their theatrical release. An exciting range of films from Universal Pictures, Focus Features, DreamWorks Animation, and Illumination were presented, including Megan 2.0, No, Nobody Too, Bad Guys 2, How to Train Your Dragon, Downtown, Downtown Abbey, The Grand Finale, The Black or Black Phone 2, Him, The Phoenician Scheme, Super Mario World, Shrek and",
            "start": 2666.0
        },
        {
            "text": "Megan 2.0, No, Nobody Too, Bad Guys 2, How to Train Your Dragon, Downtown, Downtown Abbey, The Grand Finale, The Black or Black Phone 2, Him, The Phoenician Scheme, Super Mario World, Shrek and Minions, these films. Uh, wait, Shrek and Minions. Shrek, Minions, what a crossover that would be. Yeah, that would have been sick. Uh, these films stream first exclusively on Peacock after their uh theatrical and PVOD windows, uh, making it a uniquely present blah blah blah. Get Peacock if you want these. And of course, if you want the old show, this is awesome. Um, but then of course news every like, \"Holy [ __ ] it's called Super Mario World.\" And they just quietly deleted this from the press release. Yeah, I wonder if that's Yeah, I'm There's a totally a world where a world where it is called Super Mario World, but there is a chance that it's not, right? They could just be referring to the Super Mario World or just the over because they call this thing called Super Mario, but they call",
            "start": 2711.28
        },
        {
            "text": "Super Mario World, but there is a chance that it's not, right? They could just be referring to the Super Mario World or just the over because they call this thing called Super Mario, but they call Shrek and then Minions. They just say Shrek and Minions. Yeah, it's not called Shrek or Minions. It's called Minions 3 and then Shrek 5. Maybe they're restarting both franchises. Or maybe it is Shrek and Minions. No, it's definitely not called Minions, guys. I know this. I know this for a fact. It's not Minions. I like I like Super Mario World. I love it. I love it. Cuz that means that we can get Galaxy one day. That'll be sick, dude. Come on, bro. You're freaking right now. You're freaking out. I don't like it. I take it back. I take it back. I like I like it. I think it's cool. I think it's a good name. I like again, even with Mario Kart World, I like hearkening back to this thing that's such a touchstone for so many of us. It's like, [ __ ] yeah, that would be sick. Yeah, I also don't",
            "start": 2754.56
        },
        {
            "text": "a good name. I like again, even with Mario Kart World, I like hearkening back to this thing that's such a touchstone for so many of us. It's like, [ __ ] yeah, that would be sick. Yeah, I also don't believe it. All right. Well, wait and see, everybody. I've never known Peacock to lie to me. Uh, number four. There have been more Microsoft layoffs. This is uh WP atign.com. It sounds good. It's a serious story. That sounds good, though. Yeah, wipig.com. Wesley Inpool, if you're watching, get a business card that just says WPIGN.com and hand that [ __ ] out. You know what I mean? It's fire. Uh, Microsoft has confirmed cuts accounting to 3% of its entire workforce. Uh CNBC reported that Microsoft had uh 228,000 employees as of June 2024 and is aiming to reduce management layers across all of its teams. Approximately 6,000 employees are affected. Imagine being that big. Yeah. We're cutting 3% of our thing. It's 6,000 people. Quote, \"We continue to implement organizational changes necessary",
            "start": 2794.0
        },
        {
            "text": "teams. Approximately 6,000 employees are affected. Imagine being that big. Yeah. We're cutting 3% of our thing. It's 6,000 people. Quote, \"We continue to implement organizational changes necessary to best position the company for a success in a dynamic marketplace.\" a Microsoft spokesperson said to CNBC. IGN has asked Microsoft if the cuts affect its video game business. In September 2024, Microsoft cut a further 650 staff from its gaming business after 1,900 staff were cut earlier that year. As part of those cuts, Microsoft closed Hi-Fi Rush developer Tango Gameworks and Redfall developer Arcane Austin. In total, Microsoft let go uh 2550 staff from its gaming business since acquiring Activision Blizzard for $69 billion in 2023. Speaking to IGN in June 2024, Xbox boss Phil Spencer said, quote, \"I have to run a sustainable business inside a company and grow, and that means sometimes I have to make hard decisions that frankly are not decisions I love, but decisions that somebody needs",
            "start": 2838.56
        },
        {
            "text": "quote, \"I have to run a sustainable business inside a company and grow, and that means sometimes I have to make hard decisions that frankly are not decisions I love, but decisions that somebody needs to go make.\" End quote. Uh I had not this I had pulled this last night. I should have double checked uh if there's an update from it. So, sing a song real quick about layoffs and I'm going to go check. I won't sing a song, but just the quote of I have to run a sustainable business inside the company and grow. But when that growth is constantly money growing and then trying to find sustainability within that are two conflicting ideas there, Phil. Um, and so, oh man, remember when they said they weren't going to lay people off when they bought a company for $69 billion? Horrible. This is horrible. No, there's still nothing on WP's article still says developing. It still has the same quote. So, they've gotten they have not gotten a statement apparently from Microsoft about that. As always,",
            "start": 2889.68
        },
        {
            "text": "No, there's still nothing on WP's article still says developing. It still has the same quote. So, they've gotten they have not gotten a statement apparently from Microsoft about that. As always, this sucks. Yeah, absolutely. You got anything else to say? No, I just um I heart goes out to everybody and I also specifically do not hope that uh any other uh development teams or studios close down because uh I did not realize that that was kind of the the last big gaming cut from from Microsoft because it feels like there's layoffs all the time, right? There are so many definitely are. Uh so then to read this and like [ __ ] that was the last time like we had a a huge one from at Microsoft and it resulted in H Highih Tango Gameworks and Arcane Austin closing down. So I hope that doesn't happen again or anything like it. Let's move on to I guess more sad news if you're like Tim. A Kingdom Hearts game has been cancelled. This is Ethan Gotch over Kotaku. Square Annex has finally given up on",
            "start": 2936.96
        },
        {
            "text": "again or anything like it. Let's move on to I guess more sad news if you're like Tim. A Kingdom Hearts game has been cancelled. This is Ethan Gotch over Kotaku. Square Annex has finally given up on its Pokémon Go style mobile spin-off of Kingdom Hearts. The Final Fantasy publisher announced on Wednesday that it was cancelling Kingdom Hearts Missing Link, which began development back in 2019 because it didn't think it could deliver on the live service experience in the long haul. The changes of heart, I'm sorry, the change of heart comes as Square commits to releasing fewer but better games. Missing Link was supposed to be a GPS-based RPG that integrated into the real world into the um integrated the real world into the series familiar action combat with storytelling, and it was originally supposed to launch in 2024. Quote, \"We wish to convey our heartfelt apologies to everyone who has been looking forward to the start of service.\" the publisher wrote in an update. Although we worked",
            "start": 2977.52
        },
        {
            "text": "supposed to launch in 2024. Quote, \"We wish to convey our heartfelt apologies to everyone who has been looking forward to the start of service.\" the publisher wrote in an update. Although we worked hard on developing and adjusting the game in hope that it would be enjoyed by lots of players, we determined that it would be difficult for us to offer a lot a service that players would find satisfactory over a long period of time, leading us to the decision to cancel development. End quote. Square Enix confirmed it is still allin on Kingdom Hearts 4, but noted in its latest earnings briefing that it plans to be choosier about what it greens like going forward. on the back of a $217 million drop in net sales last year despite the outsized success of Dragons Dragon Quest 3 uh HD 2D. The company revealed a three-year plan to quote reboot and awaken long-term growth. It includes various initiatives to improve productivity by utilizing AI. Oh wow. As well as releasing fewer games. quote,",
            "start": 3018.8
        },
        {
            "text": "revealed a three-year plan to quote reboot and awaken long-term growth. It includes various initiatives to improve productivity by utilizing AI. Oh wow. As well as releasing fewer games. quote, \"Under the new management structure, we reviewed all projects at our domestic studios, including HD and SD titles, and decided to discontinue development of some titles and invest additional funds in titles that require refinement, thereby steadily implementing a strategy of selecting and concentrating development resources,\" the company wrote in a presentation. It also wants to reestablish a mid to long-term pipeline to achieve a shift from quantity to quality. Wow. A lot of corporate speak, a lot of [ __ ] blah blah blah. Good on you for canceling this. Good on you for trying something. I'm glad they didn't force it out. They didn't do this whole thing. Everybody hates it. The team I mean, I can't say won't get laid off still, but like it seems like they're potentially transitioning them to",
            "start": 3063.76
        },
        {
            "text": "they didn't force it out. They didn't do this whole thing. Everybody hates it. The team I mean, I can't say won't get laid off still, but like it seems like they're potentially transitioning them to It seems like they're And again, I think they we talk all the time about publishers learning the wrong lessons. AI ain't the right lesson to learn here, but it is the right lesson to learn. All right, let's make fewer better games. Like, yes, of course. We always have the meme of Square Enix is releasing a random game that you you never could guess the title of and you don't know if it's real or not. So them doubling down on quantity quality over quantity is better than a GPS action RPG as the trailer said which made me laugh. Mr. Hawks 182 writes in with the super chat and says the worst part of the mobile Kingdom Hearts game being cancelled is that you know the thing contained around six to nine super important Kingdom Hearts 4 drops. You will be lost in Kingdom Hearts 4. Uh, ADM two",
            "start": 3106.88
        },
        {
            "text": "of the mobile Kingdom Hearts game being cancelled is that you know the thing contained around six to nine super important Kingdom Hearts 4 drops. You will be lost in Kingdom Hearts 4. Uh, ADM two times says RIP Kingdom Hearts Missing Link. So, people are out there. They're mourning it. They are saying Resolute RIP Kingdom Hearts Missing Link. Word was that it was pretty much finished too. Frown emoji. Wow. They just It wouldn't be good though, they said. Right. So, no. You know, don't worry about it. Take all of your information. Uh, this I don't know what any of this means. Uh, oh, Resolute has a different super chat. I'm curious if Disney Step ST coming out last year in Japan which looks extremely similar to Kingdom Hearts Missing Link led to the cancellation like not being able to use Disney properties for a similar game. I'm unfamiliar with Disney. Oh, this looks like straight up Pokémon Go. Like but but I'm also looking for out that trailer for a missing link. That doesn't look",
            "start": 3145.44
        },
        {
            "text": "Disney properties for a similar game. I'm unfamiliar with Disney. Oh, this looks like straight up Pokémon Go. Like but but I'm also looking for out that trailer for a missing link. That doesn't look as much Pokémon Go as I thought it was going to look. Um Disney Step looks like exactly like Pokémon Go. Okay, well there you go everybody. Get that in Japan if you want. trick your app store and do that, I guess. Uh, number six on the roper report. Save your Switch 2 battery, everybody. Oh, this is Tomas Fransy over at GameSpot. There's a video, too. Nintendo is recommending that Switch 2 owners turn on a quote stop charging around 90% end quote setting to prevent the systems battery from deteriorating as fast. The company shared the news and an in-depth video explaining where to find the new setting in a recent Nintendo Today post. Recently, Nintendo has been sharing system setting related videos on its daily news app, including one showcasing the use of mouse controls on a home screen.",
            "start": 3189.52
        },
        {
            "text": "setting in a recent Nintendo Today post. Recently, Nintendo has been sharing system setting related videos on its daily news app, including one showcasing the use of mouse controls on a home screen. The latest one highlights a stop charging around 90% feature for Switch 2 with Nintendo explaining that quote, \"Pausing the charge at around 90% reduces deterioration of the battery,\" end quote. A video showcasing how to turn on the feature was also included and has since been shared by industry insider uh Stealth 40k on X. If you plan on frequently playing your Switch 2 over the long term, this is definitely a feature you should be aware of. Keeping the systems battery healthy is important if you want to maximize your handhelds mode play time. Currently, Nintendo says uh the Switch 2's battery life lasts between two and six and a half hours, uh depending on what games are being played. Nintendo also said the system will take 3 hours to charge, although that may be a bit shorter if this",
            "start": 3230.48
        },
        {
            "text": "life lasts between two and six and a half hours, uh depending on what games are being played. Nintendo also said the system will take 3 hours to charge, although that may be a bit shorter if this new specific setting is turned on. What the [ __ ] are we doing? Turn that on by default. If you actually want to save these batteries, you got to just turn it on. Also, we need a we need better adaptive charging situations cuz my phone has one and it's [ __ ] great where it just automatically I plug it in at night and it knows that I'm plugging it in for the night time. So then it charges all the way up until I wake up in the morning. So then it doesn't overcharge my battery. We got to get better about this because repairability for these consoles [ __ ] suck. So then inevitably I have the Switch one and then it just [ __ ] the battery sucks over seven years because that's how batter or the battery expands like my case. Exactly. And then you can't [ __ ] repair it because these things are",
            "start": 3271.84
        },
        {
            "text": "one and then it just [ __ ] the battery sucks over seven years because that's how batter or the battery expands like my case. Exactly. And then you can't [ __ ] repair it because these things are unrepairable. Uh they're not like the Steam Deck. They're not like uh framework laptops. And then now they don't turn them on by default. And they're like, \"Oh, just go into the settings.\" Who? Only nerds are turning on those settings. And you should if you're listening to this. But yeah, I was going to say I thought we were done with all this. Just turn it on. I remember my Game Boy Advance SP that thing. I was like, \"Oh, don't char wear this [ __ ] down and then charge it. You're going to [ __ ] die.\" Same [ __ ] Like, oh my god. And I thought we were done with it now. Nah, bro. I don't even know. I mean, my my Switch is always just charging. Pull it out. It's fine. Yeah, it's fine. It's like How much am I losing? You lo over time. Yeah. A lot. It's not good. Who cares? I mean, grow up.",
            "start": 3306.32
        },
        {
            "text": "know. I mean, my my Switch is always just charging. Pull it out. It's fine. Yeah, it's fine. It's like How much am I losing? You lo over time. Yeah. A lot. It's not good. Who cares? I mean, grow up. You're going to buy by the time this thing would be dying, you'd be buying the OLED version of it, too. Who cares? You're all fine. Repility. Roger's never playing this switch that much. They have to worry about this. I might. This is the one. This is the one. D Company. Holy [ __ ] I'm sorry. Breaking news about the Kingdom Hearts dead game. Uh AK92 super chats and says, \"This is this is big for lore implications. The last Kingdom Heart mobile game had the main villain's whole backstory in it. That's incredible. Roger. The loss of any idea what's happening in Kingdom Hearts 4 is huge big news. But if I don't want that, I want smaller news. Where do I go? You are you to our last story, the Wii News Channel, where we cover all the small small noodles items you know about. [ __ ] It's like",
            "start": 3337.36
        },
        {
            "text": "But if I don't want that, I want smaller news. Where do I go? You are you to our last story, the Wii News Channel, where we cover all the small small noodles items you know about. [ __ ] It's like crispy cream. Have another bite. That'll get you going. That'll get you where you need to be. Uh, no. Just take the whole thing. Don't No, don't take a quarter of the last strawberry donut. No. Right. Don't do this to me. You cut the the the tip of a slice of pizza once. Yeah, but that wasn't cuz I was No, no, don't even try to justify it. Don't. Number seven, the Wii news. GameSpot reports, \"It's been a long time coming, but PlayStation 5 players can finally use Apple Pay natively when purchasing games.\" Now, rather than having to take any extra steps, customers can simply select Apple Pay during the checkout process in their PS5s. They will then be greeted by a QR code they can scan with their iPhone or iPad to complete the transaction. A webbing journey is launching early access. Did you",
            "start": 3380.24
        },
        {
            "text": "the checkout process in their PS5s. They will then be greeted by a QR code they can scan with their iPhone or iPad to complete the transaction. A webbing journey is launching early access. Did you just drop it all over your neck? I just bit my lip. A webbing journey is launching early access May 19th on PC via Steam. Uh 2K today announced the I'm sorry 2K today announced 2K today launched season 2 of PGA Tour 2K25. Uh you're going to get what? All new legendary course, the old course at St. Andrews Links as well as the Greenskeeper archetype spotlight, the new challenges game mode, an array of unlockable and earnable clubhouse pass content, and much more. PUBG Battlegrounds expands uh destructible terrain with update 35.2 today. Holy [ __ ] We have our first look at Nick Cage's Madden today and Christian Bale is uh Al Michaels, right? Let's see him. I don't even know who that guy was. There they are. Damn, this is fire. David, God bless Nick Cage. You know what I mean? So cool. He's",
            "start": 3418.88
        },
        {
            "text": "and Christian Bale is uh Al Michaels, right? Let's see him. I don't even know who that guy was. There they are. Damn, this is fire. David, God bless Nick Cage. You know what I mean? So cool. He's He's also doing the Spider Noir show. Yeah. Yeah. I saw a super chat earlier, maybe a regular chat saying if you're doing Iron Hart, we should do Spider-Man Noir. They have a teaser, too. I'll look into I'll look into that if I remember to tell Tim. Uh Noble over on Blue Sky talked about Ubisoft's fiscal year 2025. Uh the three bullet points they called out. AC Shadows is the second highest day one sales after Valhalla. New record on day one performance on PSN. A new subsidiary will focus on single player live service in mobile in China. Oh, mobile and China. China. Uh and then Prince of Persia Sands of Time remake launches before April 1st. Okay. 2026. Just like how hold your breath everybody came out last year. Yeah. Then your final one, WWE 2K25 new wave pack DLC featuring the Motor City",
            "start": 3464.96
        },
        {
            "text": "Sands of Time remake launches before April 1st. Okay. 2026. Just like how hold your breath everybody came out last year. Yeah. Then your final one, WWE 2K25 new wave pack DLC featuring the Motor City Machine Guns. Stephanie Vair and Julia are available today. Let's watch uh an old video of Chris Sabin from the Motor City Machine Guns chopping me. You going to You clap. You getting into this? You getting into my faction cards today? Uh I'll I'll boot up a little bit. What? I can take anything you can give. Go. Hold on. Black cheese mode. This is for you. What the heck? You said you were going to take two of them. Wait, wait, no. Not again. Somebody else. Shut up. What's your problem, man? That hurt my ear. You can already see it. You can already see it coming up there. Uh, but I've been chopped by Motor City Machine Guns, Hulk Hogan, Woods. There's somebody else I'm forgetting in that mix and I apologize, chat. Probably keep me honest. Sabin hardest shot I've ever taken. Like he like",
            "start": 3508.4
        },
        {
            "text": "by Motor City Machine Guns, Hulk Hogan, Woods. There's somebody else I'm forgetting in that mix and I apologize, chat. Probably keep me honest. Sabin hardest shot I've ever taken. Like he like it's clear like the other guys like were like taking it easy on and you know, whatever cuz whatever. Sabin [ __ ] wanted to hurt me and he did. You can see it at the very end there, but I do on my it was before iPhones cuz I'm that old on my digital camera roll on the PlayStation 3 where I store all my media footage. I have a photo of you can see every the imprint of his hand like every finger. Like that's how hard he hit me. And at the end you can already see it starting to welt up because he hit me that hard and I love it. That's what I wanted. He did it well. And that's why that hurt for like a few days. I mean it was a it the pain goes away pretty quick and then it's just this weird bruise that you'll touch like I don't think about it much. You know what I mean? Yeah. But yeah, that one that",
            "start": 3571.2
        },
        {
            "text": "days. I mean it was a it the pain goes away pretty quick and then it's just this weird bruise that you'll touch like I don't think about it much. You know what I mean? Yeah. But yeah, that one that one [ __ ] hurt. Damn. The first time I ever met uh Austin Creed as well and we both forgot about it. Yeah. Oh, I had to show him the video later years later. I digress everybody. Uh we ask everybody watching live to keep us honest by going to kind of funny.com/you wrong. Whoa. All right, I'll give it to you. You know, Blastergoblin gave me a free shirt and came out to the the Chicago show, right? Blaster Goblin writes in with a super missed news. On May 9th, 2025, Blaster Goblin SEC secured the speedrun world record in Tony Hawk Shred with a time of 1 hour 49 minutes and 25 seconds. Tony Hawk Shred. Is that the connect one? I have no [ __ ] idea which one that one was. Bos, where can I see, you know, I don't I don't know why no one wrote this up. Where was the IGN article? You know what I",
            "start": 3615.12
        },
        {
            "text": "Shred. Is that the connect one? I have no [ __ ] idea which one that one was. Bos, where can I see, you know, I don't I don't know why no one wrote this up. Where was the IGN article? You know what I mean? I know Rebecca Valentine's been busy. This one with the physical like uh uh the board. Yeah, the board. Oh, this is the one where we made fun of it for years on GameCube where Tony Hawk was like, it's full of technology. He was like, \"This board is full of technology.\" Like, what the [ __ ] are you talking about, Tony Hawk? That's so sick. Somebody writing, \"I need to see the the world's record of where how we know that is.\" Congratulations, Blaster Goblin. Exciting. Um, let's get into some super chats to round out your day and get you over to the games cast to hear all about FBC Firebrick. Uh Gerald of Rivia writes in and says, \"Roger, I promised myself if Caroline Pichek made a song for Death Stranding 2, I would play both games for you. Guess it's time to start.\" Yes, that's",
            "start": 3660.56
        },
        {
            "text": "Uh Gerald of Rivia writes in and says, \"Roger, I promised myself if Caroline Pichek made a song for Death Stranding 2, I would play both games for you. Guess it's time to start.\" Yes, that's exciting. Here we go. And I'm at speedrun.com. All of them laid out. No runs. No runs recorded. No one's ever done this before. So, I'll tell you what, I have a lot I You know, I'm looking over here. Z Blaster Goblin says his time was 1 hour and 49 minutes and 25 seconds. I regret to inform you. I did this as well and my time was 1 hour 39 minutes 25 seconds. I shaved a whole 10 seconds off there or minutes off and you can't prove me wrong cuz nobody can be proved now. Oh [ __ ] He actually there's actually a video. [ __ ] [ __ ] Oh [ __ ] no. He knows I'm lying now. Um we're still talking about some of the stuff we're you know over the price stuff now. Uh, Neon Pocket Dimension writes in, \"If I want Elden Ring night ring codes for our podcast to do content with, do I go through Bandai Namco PR or",
            "start": 3700.08
        },
        {
            "text": "the stuff we're you know over the price stuff now. Uh, Neon Pocket Dimension writes in, \"If I want Elden Ring night ring codes for our podcast to do content with, do I go through Bandai Namco PR or Fromoft? Uh, would love some advice on how to ask for game codes. Love you guys.\" Gage from NPD, that's Neon Pocket Dimension. Uh, great question, Gabe. I really, he's wearing a kind of a blaster wearing the kind of funny shirt. Uh, love that question. A lot of people don't ask that question and instead, you know, don't know how to do it or whatever. Uh, you want to go through the publisher. So, you'd want to go to Bandai Namco. Uh, when I was in your shoes on the outside and starting my blog and when I was doing freelance work and I was doing that, I would cold email uh PR all the time of I needed Capcom, I wanted to play Dead Rising. I would go to Capcom's website eventually go to the media center, find a name, find a PR at email address, email them, lay out my case. Hey, I'm working for",
            "start": 3751.56
        },
        {
            "text": "Capcom, I wanted to play Dead Rising. I would go to Capcom's website eventually go to the media center, find a name, find a PR at email address, email them, lay out my case. Hey, I'm working for the newspaper. I have a column. I have a weekly a weekly column, a daily blog. I wanted this. This is the idea. And usually that led to them and granted different time getting me to the right person. Today's world content creators, podcasts, it all matters. It all counts. And so you are like, will will Elden Ring get back to you? I can't say. But I do know that like you have a million other devs and publishers and people out there who are trying to get their games in front of as many people as possible. And once you start cracking that code and getting in there, it's easier and you start to understand the system of it. A lot of people use for those smaller indie games, things like terminals and all these different things where you can have a login, you can show up and request and show your",
            "start": 3793.44
        },
        {
            "text": "the system of it. A lot of people use for those smaller indie games, things like terminals and all these different things where you can have a login, you can show up and request and show your things and go that way. Show your work. It works. Yeah, absolutely. Yeah, when I was doing that, I did the exact same thing. And it worked out for you? Yeah, it did. Okay, good. Good. Good. I'm glad it worked out for you. Uh, hi Mike. Hi, Mike. Mike's here. He's forgiving you about the shirt. He's wearing the shirt. No, he's not wearing the shirt. Him and I have new beef, actually. It's about the bean bag. We got to talk about it. Oh, [ __ ] Are you trying to take the bean bag from Roger? He's mad about me. He's mad at me. I'm happy about that. He's mad at you too, Greg. Hey man, you weren't you weren't in the room. The room was like, \"Hey, what's up with this bean bag?\" I explained what the bean bag was. That's an Xbox bean bag. Why aren't you Shout out to Tower Born. They sent us a love a love",
            "start": 3834.48
        },
        {
            "text": "in the room. The room was like, \"Hey, what's up with this bean bag?\" I explained what the bean bag was. That's an Xbox bean bag. Why aren't you Shout out to Tower Born. They sent us a love a love sack, like a giant, you know, bean bag that's like a love seat and it came with an Xbox wrap for it because of course there Tower of Born is couch co-op. And so then it sat out there and I said, \"Who wants it?\" And Roger was like, \"I'll take it.\" And I was like, \"Great. Just get me a photo of it so I can put it up and properly thank them.\" Yeah. And then Mike got mad as I was leaving the office. So now I brought it home and then I looked at Leansza and I was like, he's going to [ __ ] about this all week. So I'm bringing it back down. Oh wow. So Mike is taking it out. He made me carry it out. He made me shove it in my face. That that after the shirt debacle yesterday for sure. Have you Have you blocked Roger yet, Mike? Unblocked him? Not yet. Not yet. He says over there. Uh, and then Z",
            "start": 3868.16
        },
        {
            "text": "He made me shove it in my face. That that after the shirt debacle yesterday for sure. Have you Have you blocked Roger yet, Mike? Unblocked him? Not yet. Not yet. He says over there. Uh, and then Z Kinetic is giving you all a reminder. He says, \"If you or they have if you have time during the Superman trailer reaction, there was also a Spider Noir teaser and an Iron Heart teaser. I don't know how you missed the second part.\" All right, and I'm not going to get too mad at you, but I'm getting angry as you can tell. We're going to do the Superman teaser. I said that and and literally I took a breath with my fat [ __ ] lungs. And then the next thing I said, \"We're also doing Iron Hart.\" And then he said, \"What's your hype level for Iron Hart?\" Now, I understand maybe you're a big Superman fan like me, so you heard Superman. Well, you like ate two strawberry [ __ ] donuts over here. Lost your [ __ ] mind. Okay, but anyways, yes, we are reacting to both Iron Hart and Superman. They need to",
            "start": 3903.68
        },
        {
            "text": "like me, so you heard Superman. Well, you like ate two strawberry [ __ ] donuts over here. Lost your [ __ ] mind. Okay, but anyways, yes, we are reacting to both Iron Hart and Superman. They need to be on demand videos on YouTube and screencast podcast feed because of course we don't want the lawyers getting us if we do a live stream. It's a whole thing. Uh Spider-Man Noir, I'll present it to Tim, but he's already had donuts, too. Who knows what he's in? I love how much you love uh Superman because I was thinking about it last night about uh the Nintendo store, how we're in line for the Nintendo store and you saw the Superman poster and then I asked you a question about the Nintendo store and then you said, \"Wait, are you talking about the Superman poster?\" I'm like, \"No, I'm not. We're outside the Nintendo store and you're such a kid that you get so excited and your whole world becomes The way you phrased it. All right, we'd already moved on from the Nintendo store. Congratulations.",
            "start": 3943.92
        },
        {
            "text": "the Nintendo store and you're such a kid that you get so excited and your whole world becomes The way you phrased it. All right, we'd already moved on from the Nintendo store. Congratulations. We're [ __ ] here. Who gives a [ __ ] Look at this poster. It's hot. It's [ __ ] cool.\" Everybody, this has been kind of funny games daily. Each and every weekday, we run you through the nerdy video game news you need to you know about live on twitch.tv/conindfunnyames, youtube.com/kindfunnames, and podcast services around the globe. If you love that, we'd love you to pick up a kind of funny membership. Remember, we're an 11 person small business that's all about live talk shows. Go to patreon.com/kindfunn, youtube.com/kindfunname, Apple or Spotify. Toss us 10 bucks and for one month you get all of our shows. That's more than 80 a month ad free. Plus, you get your daily dose of me, Greg Miller, in a series we call Greg Way. It's 15 to 20 minutes of podcasting solo, all by my lonesome, unless",
            "start": 3980.16
        },
        {
            "text": "of our shows. That's more than 80 a month ad free. Plus, you get your daily dose of me, Greg Miller, in a series we call Greg Way. It's 15 to 20 minutes of podcasting solo, all by my lonesome, unless somebody's here because I have to go somewhere. Uh, but guess what? That adds up to like what, four hours of exclusive podcast each and every month. However, I digress. It's time for the Games Cast. So, strap in. If you're watching or listening later, go check it out. And until next time, no, it's been our pleasure to serve you.",
            "start": 4020.0
        }
    ]
}