{
    "id": 14056,
    "video_id": "gMkQkmxbLwk",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Andy Cortez",
        "Blessing Adeoye Jr."
    ],
    "title": "ONE MONTH UNTIL SWITCH 2 - Kinda Funny Gamescast",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page - https://store.steampowered.com/app/1377700/Empyreal/ \nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nThis episode is sponsored by BetterHelp — go to http://betterhelp.com/kindafunny to get 10% off your first month.\n\nTime Stamps:\n00:00:00 - Start\n00:02:05 - Housekeeping\n00:05:35 - A Month from Switch 2 - What Do We Have Pre-Ordered?\n00:36:28 - Launch Games We’ll Play\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1746473155,
    "duration": 3717,
    "transcript_chunks": [
        {
            "text": "[Music] What's up and welcome back to the kind of funny games cast for Monday, May 5th, 2025. Of course, I'm Tim Gettys. I'm joined by blessing at YoYay Jr. Good day, Tim. Andy Cortez. Good day, Tim. And Greg Miller. Season three. You can say it. You can say you can say it for yourself. Well, what do you want to talk about, Tim? How you doing? I'm doing well. How are you? I'm excellent. This [ __ ] eating great on your face. You know what I mean? Like, what a Friday. What a Saturday. What a Sunday. What a Monday I'm having. I can smell the coffee on Greg's breath right now. How's it smell? Like winning blessing. It smells like victory. Yeah. How was your uh champion weekend, Greg? Oh my god. The amount of sex I had with this belt on him. Oh my god. Oh god. Everybody, I'm the champion. Kind of funny game. season. How you doing, Andy? Huh? I'm doing great, Greg. Thank you for asking. I want to say, you know, so many people were sad to say, see you say you were going to retire. I hope you",
            "start": 6.27
        },
        {
            "text": "of funny game. season. How you doing, Andy? Huh? I'm doing great, Greg. Thank you for asking. I want to say, you know, so many people were sad to say, see you say you were going to retire. I hope you don't. I hope you change your mind. I hope you come back for season 4, but whatever you whatever you want to do, whatever you It's We were there for you. We're there for you. I'll give you my stars to make the win look even more overwhelming. No, no, I don't need them. I don't need them. It doesn't It doesn't matter if you win by an inch or a mile is what they've always said in my favorite movie, Cars. All right. Just as long as you get the W. As long as you get the W. And at the end of the day, me and Tim just tied up like like we were all season just neck and neck, you know, right there. Dead heat. They called it a dead heat. So many people have been hitting me up being like, \"Dude, you you dropped the ball. Why did you pick Go Fish? You [ __ ] that up.\" I wouldn't have got the trophy",
            "start": 57.44
        },
        {
            "text": "heat. They called it a dead heat. So many people have been hitting me up being like, \"Dude, you you dropped the ball. Why did you pick Go Fish? You [ __ ] that up.\" I wouldn't have got the trophy one anyway. That was hard. You wouldn't have gotten it. And also, I did the math after the episode. I don't think you could have actually got caught up to Greg. I think even if you had gotten everything right and Greg got everything wrong, you would have been one starred. Yeah. The Assassin's Creed will be forever the thing that haunts me. Yeah. No, you dropped it there. That was embarrassing for both of us. Yeah, that's the that's the one. Everyone, go watch the finale of Kind of Funny Games Showdown for more context on how we got here. Unfortunately, we did. Uh, of course, this is the Kind of Funny Games cast for Monday, May 5th. We are officially one month away from the Nintendo Switch 2 launching. So, I wanted to do a little hype check-in, see where all of us are at. Uh, this is the Count",
            "start": 91.28
        },
        {
            "text": "Games cast for Monday, May 5th. We are officially one month away from the Nintendo Switch 2 launching. So, I wanted to do a little hype check-in, see where all of us are at. Uh, this is the Count of Funny Games cast. Each and every weekday, we get together to talk about the biggest reviews, previews, and topics in video games live on YouTube, Twitch, and podcast services around the globe. If you love what we do, please support us with the Kind Funny membership on Patreon, YouTube, Spotify, and Apple Podcast to get all of our shows ad free and a daily exclusive Gregway. Uh, for a chance to be part of this show though, please submit your thoughts and opinions as YouTube super chats as we go, just like CJ Splitsson just did, saying this is towards the Luna fan club. Uh, well, then there's a feed emoji which I don't know if CJ did that in kind of funny games daily as well. Yeah. So, he really wants to get it out there. I get it, but I also don't get it. You second foot. No, you get it.",
            "start": 126.56
        },
        {
            "text": "a feed emoji which I don't know if CJ did that in kind of funny games daily as well. Yeah. So, he really wants to get it out there. I get it, but I also don't get it. You second foot. No, you get it. You play the game. You beat the game. Look, there you get it. I did beat it. There are some of us out there that are are not like zooming in on the feet. There's some of us who just, you know, think she's an amazing amazingly strong. I'm not zooming in on your face. I'm not we're not doing the feet thing. Okay. And who did you play as in in Expedition most of the game? Like when you're just running around and stuff. When you're floating around. No, you're a floater. Who are you? Uh I'm Gustaf. Yeah, I like Yeah, I like his run. I'm CL baby. What about you? I know you. As soon as I got Luna out there, my barefoot princess. Go ahead and float. You guys are [ __ ] sickos. You know what? I'm not afraid to talk about some grippers. Let's go. Oh my god. I'm a champion if you didn't notice. A",
            "start": 165.04
        },
        {
            "text": "out there, my barefoot princess. Go ahead and float. You guys are [ __ ] sickos. You know what? I'm not afraid to talk about some grippers. Let's go. Oh my god. I'm a champion if you didn't notice. A little housekeeping for you. Remember, Greg is rocking PAX East Thursday, and you need to be part of it at 11:00 a.m. Eastern time if you're at PAX East itself. 8:00 a.m. Pacific time if you're back home here. Uh, Greg's the keynote speaker kicking off PAX East and we be doing a fireside chat with Final Fantasy uh 16 and Expedition 33's Ben Star at 2 p.m. Eastern and 11:00 a.m. Pacific. Greg's hosting the Mafia Old the Old Country panel with the devs. That should be very fun. It's going to be great. And then if you're in Boston, uh, you need to be there. But if you aren't, both will be streamed to our Twitch channel. So yeah, if you're at PAX East, make sure you go support Greg Miller and kind of funny at both the panels. Um, the champion. Uh, but if you aren't, please show up on Twitch.",
            "start": 208.4
        },
        {
            "text": "to our Twitch channel. So yeah, if you're at PAX East, make sure you go support Greg Miller and kind of funny at both the panels. Um, the champion. Uh, but if you aren't, please show up on Twitch. It's going to be great. We are streaming them on our channel. Very fun stuff. Uh, we're 11 Person Business, all about live talk shows today. After uh this, you're going to get a lot of stuff because we have The Last of Us Screencast episode 4. very very excited to talk about this one. After that, the stream is going to be an Nvidia sponsored stream, showing off all of that DLSS4 in Cyberpunk 2077, which Nick is now addicted to in 2025. I love that. Good for you, Nick. Good for you. And then closing out the day, we have another podcast. Old man is old. You know what I'm saying? No, it's a good game, though. It's a really good game. Thank you. Uh then we're doing because of some some scheduling stuff, I'm going to be out a bunch of days this week. So, Alien Covenant in review will also be",
            "start": 250.88
        },
        {
            "text": "game, though. It's a really good game. Thank you. Uh then we're doing because of some some scheduling stuff, I'm going to be out a bunch of days this week. So, Alien Covenant in review will also be happening live later today after the stream. If you're a kind of funny member, you can get today's Greg White. That's 15 minutes about how you failed him. God, our champion, right? Hey, you know what? Am I going to be a gracious leader? Of course. But do I have to call out some failures? Of course I do. And it turns out those happen to be the Trogs this time around. Thank you to our Patreon producers, Carl Jacobs of Makeup Buster, and Delany Twining. Today, we're brought to you by Imperial, Ouraf Frames, and Better Help. But we'll tell you all about that later. Let's get to it. The topic of the show. We're 30 days away from the Nintendo Switch 2 June 5th, 2025, releasing at $450 US. $500 US if you get the Mario Kart World bundle. I want to start this off by going around the table and asking",
            "start": 293.36
        },
        {
            "text": "show. We're 30 days away from the Nintendo Switch 2 June 5th, 2025, releasing at $450 US. $500 US if you get the Mario Kart World bundle. I want to start this off by going around the table and asking everyone, including Barrett, uh, what they have managed to pre-order, what they're kind of what what [ __ ] they have to deal with come June 5th. M are things getting delivered to you? Are you going to have to go somewhere? What's going on? Bless. Let's start with you. I unfortunately cannot disclose the details of how my Switch 2 pre-order went. It is for it. Jesus. Under it happened to go everything happened to go out go in Japan when this happened. While I was in Japan at Cojima Productions and so I'm not going to go into details. All I'm going to say is that I was unsuccessful in pre-ordering this thing. That said, um, you know, if Satan don't got me, if God don't got me, Raj got me. Raj got me. Raj got a second, too. And so, he's going to pass on one of those to me. I don't know the",
            "start": 339.08
        },
        {
            "text": "this thing. That said, um, you know, if Satan don't got me, if God don't got me, Raj got me. Raj got me. Raj got a second, too. And so, he's going to pass on one of those to me. I don't know the details of it, but I believe he got the $500 one with Mario Kart, Mario Kart World. Any accessories that you would be interested in pre-ordering from here on out, even if you haven't got them yet? Any other games at the top of your mind? Oh, I mean, games is a whole conversation cuz I want everything. I want it all. We have a whole list of launch games that I want to go game by game so we can talk about that. But so but I just want to know is do you have anything pre-ordered now? No. Okay. At this point. Gregory Miller. Hello. The season 2 champion. You don't have to be afraid to say it. I also don't need to every time. Oh, you know Tim's always talking to us. We got to promote content better, but he won't promote the content he didn't win on. That's [ __ ] up, Andy. Okay. Uh I have the uh",
            "start": 387.52
        },
        {
            "text": "don't need to every time. Oh, you know Tim's always talking to us. We got to promote content better, but he won't promote the content he didn't win on. That's [ __ ] up, Andy. Okay. Uh I have the uh $500 Mario Kart bundle pre-ordered. Uh it will be delivered here. Knock on wood. No, you know, nothing goes wrong. I haven't gotten any of the I I went with Target. I haven't gotten any cancellations. It looks like we're all set. So, that will be the move here. Um accessories, no. I, you know, could I be tempted into the GameCube controller? Yes, because I love the GameCube controller and I love my GameCube, but no, I'm not going to do it. I'm not going to do it. New Pro Controller, no. The old Pro Controllers work and I don't need a headphone jack on them. You know, I'm I'm going to be very much on the accessory lineup of like, let's just get the unit, get the system, and see if there's something we need to add change from there on out kind of thing. Games-wise, I'm I'm still going to be",
            "start": 426.4
        },
        {
            "text": "on the accessory lineup of like, let's just get the unit, get the system, and see if there's something we need to add change from there on out kind of thing. Games-wise, I'm I'm still going to be a digital boy. So, I'm not worried about pre-ordering those at all. I got Mario Kart, great. But yeah, Donkey Kong, obviously, when that comes around, I'll be all about. But, and otherwise, no, I we're going to go through launch lineup. I'll give you that rundown. But in terms of a pre-order, Justice System, just Mario Kart, tried to get a second one. Uh, you know, because I would love eventually we're going to need a second one in the house for Benny, for Jenny. We don't call her that. Uh, but it was that idea of like I I you know, when one of the other Wario 64 Blue Skies went by, I clicked on it and tried to do it and sat in the waiting room and it didn't happen. It was like, well, no big deal. I'll worry about it later. And Cortez, wait, real quick question for Greg. Hi. You don't want to",
            "start": 466.4
        },
        {
            "text": "and tried to do it and sat in the waiting room and it didn't happen. It was like, well, no big deal. I'll worry about it later. And Cortez, wait, real quick question for Greg. Hi. You don't want to live the back button life, backpedal life. No, you know me. I don't. I just don't. But you can, though. I could, but I don't. I want to be I want to be able to be dropped into any video game demo ever and not have to be like, \"Oh, I I there's no back buttons. I don't know how to play this one.\" So, I just stick with the basic. And again, I'm just not playing those kind of games. My rag every so often on my rag ally. I'll I'll graze those nipples and I'll be like, \"Ah, oh, I could do things with these, but I don't.\" You know what I mean? Just like my nips. Not like me. What would you do? I could do things with them, but I don't. I could pierce them. Tattoo them. Okay. Can you imagine Greg walking in one day with a t-shirt on, but you see like under you see the Oh man, that is one of the most",
            "start": 502.0
        },
        {
            "text": "do things with them, but I don't. I could pierce them. Tattoo them. Okay. Can you imagine Greg walking in one day with a t-shirt on, but you see like under you see the Oh man, that is one of the most horrible but most hilarious things. Now I might just do it for the joke, wouldn't I? Takes his shirt off. Those things just I don't even need to see the them with the shirt off though. I think it would. Um, I I was able to pre-order two uh, one from Target, one from Best Buy. Okay. And this was about an after Best Buy decided that they wanted to stay in business and we were like, you should turn the [ __ ] on or turn on the website and was able to pre-order from there and I got a Micro SD Express card that I meant to bring and it's like not a Mario themed one, but it is. It's It's red and it's got like yellow on it and stuff. It's like very much like how how big did you get and how much they send you back? That is something I do need to probably pre-order and buy. I got one terabyte. Um",
            "start": 539.2
        },
        {
            "text": "got like yellow on it and stuff. It's like very much like how how big did you get and how much they send you back? That is something I do need to probably pre-order and buy. I got one terabyte. Um man, was that 150? It was No, it was uh 70 or something. 70. Yeah. I thought these things were supposed to be really expensive. Which uh brand did you get? Lexar. Yeah. So I the Lexar 1 TB is like impossible to find right now. Like you were able to get in uh pretty early on on that one, which is smart cuz I pre-ordered it like two days ago. Really? or not pre-order, but like I just bought it on Amazon two days ago and it came in yesterday. Um, and the thing is whenever you buy stuff separately from the purchase, it doesn't feel like it counts as the purchase. So, I feel like I'm okay with it. Yeah. If I bought a uh Nintendo Pro Controller 2 or whatever tomorrow, if I pre-order that, I don't count that as part of the thing. It just kind of makes sense. It makes me feel better about the",
            "start": 594.24
        },
        {
            "text": "it. Yeah. If I bought a uh Nintendo Pro Controller 2 or whatever tomorrow, if I pre-order that, I don't count that as part of the thing. It just kind of makes sense. It makes me feel better about the Everyone is so worried that you bought the wrong one. Is it an Express? Isn't an Express? Andy bought the wrong one. Lol. Um, one TBTE Express for $70, says Jason. Yeah, whatever the Yeah, whatever the the right one is. Yeah, that's the sub. That is not an express. It says the full word express on like EX does not is not short for express. It says express in the headline though. Yeah, it does. Wait, interesting. Hold on. Dellexar Pro play. You scrolled on. I hope I'm wrong. This would be great. Hold on. Let me let me let me look. He's looking at his actual Amazon order, which is not the same one you just showed. This is not express. That's XC. XC. Scroll down. Yeah, you got XC. [ __ ] Damn. What? Scroll though. So, right there. Yeah. Get the Get the honey thing out of the way cuz you got",
            "start": 634.72
        },
        {
            "text": "one you just showed. This is not express. That's XC. XC. Scroll down. Yeah, you got XC. [ __ ] Damn. What? Scroll though. So, right there. Yeah. Get the Get the honey thing out of the way cuz you got Lexar SD card. That's the one I got. Oh, yeah. You're [ __ ] Yeah, cuz I was going to say the the one that works with the Switch 2, the 1 TB is like impossible to get right now. And even the 512 is like sold out in some places. Oh, Joey got flowers for No, these just arrived. Okay. Are they for me? They are. Well, oh, okay. Are they for me? Oh, I'm sorry. Let me put that Let me put that. That's a nice bouquet. Okay, turn that to the kind of funny game showdown season 3 champ. Congrats from the one who always believed in you. Who? Me. I bought them for myself and had them delivered. Yeah, I know what you're going to say. I know what you're going to say. Oh, that was a [ __ ] up spending company money. But I figured what I could do is then just give him to Gia so you can take him home to",
            "start": 687.04
        },
        {
            "text": "know what you're going to say. I know what you're going to say. Oh, that was a [ __ ] up spending company money. But I figured what I could do is then just give him to Gia so you can take him home to Gia. Andy, go ahead and read that card out loud for me. All right. And little little message on the side, too. To Gia. Sorry, I beat him so badly that his PP no work no more, man. It already affected so much content already. I said it was going to be worse. I said it was going to be worse. Why would they make a pro a product called XC and X? Like it just it's confusing. All right. You're going to make fun of PC gaming and this like this is confusing to be it does say Nintendo on the Amazon page, right? Expanded storage for Nintendo Switch gaming, smartphones, tablet. So I understand how you're confused. Yeah, but it doesn't say Switch too. It just says Nintendo Switch. Hey Andy, I just want to say I didn't order a SD card at all because I'm like I have one because a couple years ago or I",
            "start": 737.52
        },
        {
            "text": "confused. Yeah, but it doesn't say Switch too. It just says Nintendo Switch. Hey Andy, I just want to say I didn't order a SD card at all because I'm like I have one because a couple years ago or I guess a year ago when I bought my Steam Deck, I bought the 1 TBTE and I got lucky. Amazon [ __ ] up. They sent me two. Nice and I was like, \"Oh, oh, this is awesome.\" I'm now realizing, is this not the same? Express cards just started, I think, like coming in recently, right? This is chat, let me know. Horrible news for me. Yeah, I'm seeing like express cards are 256 256 gigs are 70 bucks, 50 bucks, 60 bucks. So, yeah, just a uh that's one of the things that I got and when I ordered the uh Lexar one cuz the other brand was hard to get. Um I could only get the 256 and that was like roughly 70. Now the 256 is also currently unavailable. Oh man. Also, when you type in a two pack though is two pack's not going to survive this. You just you ter you can't call it express. That's 80 bucks. You",
            "start": 790.72
        },
        {
            "text": "Now the 256 is also currently unavailable. Oh man. Also, when you type in a two pack though is two pack's not going to survive this. You just you ter you can't call it express. That's 80 bucks. You know what I mean? That's not that bad. You got to call it something different without the letter X. You can't use that. Well, I typed in SD card express and the first thing that popped up on Amazon was an XC as well. So, it's all [ __ ] Yeah, it's all messed up. I don't like this. Oh man, I am Did you already open open it? No, it's just back. You're all right. Yeah, I can just return that sucker. Well, I've been really good about returning stuff recently. Good. I used to just kind of like, eh, not going to use this. Got the wrong thing. I'll set it aside and never use it. Never look at it. What's the base memory of the Switch, too? 256. Oh, that'll hold a Donkey Kong or two. Oh, yeah. But them textures are getting bigger, though. Blessing. The DK textures. Like the textures are getting",
            "start": 842.72
        },
        {
            "text": "What's the base memory of the Switch, too? 256. Oh, that'll hold a Donkey Kong or two. Oh, yeah. But them textures are getting bigger, though. Blessing. The DK textures. Like the textures are getting higher resolution and they're all destructible. It's in 4K. Yeah. Wow. Okay. This thing I didn't make it up. What else did you get, Andy? Um, I did you do ProController? We already covered that. You have to have those back paddles. No, not yet. No, not yet. But now I'm like, will the freaking 8bit do controller work with this now? I don't know. I mean, it will, but I don't, you know, I don't like where we're at right now. I really want to do the physical thing just cuz. But I don't like the way the cartridge looks. I don't like like the way the box has that big ass red bar up top. Sucks. It looks really unappealing. Here's the thing. The more I see of the box, the more I'm like, \"Okay, it's not as bad as I thought.\" The wraparound image looks nice, but the amount of the games that on the",
            "start": 884.64
        },
        {
            "text": "really unappealing. Here's the thing. The more I see of the box, the more I'm like, \"Okay, it's not as bad as I thought.\" The wraparound image looks nice, but the amount of the games that on the bottom have the game card, like the big white thing, I'm like, this looks like absolute trash. But can I see even the first party games, like the top, like the red just takes up way too much space, man. And having a big bezel comparing Yeah, exactly. And comparing it to the Switch one boxes, I'm just like I can't fathom preferring the Switch 2 uh box art over the Switch one. And I People I I was bitching about this on Twitter. People like, \"Oh, Tim, you're being dramatic. It's not that bad.\" Like I'm like, \"I don't know, man. I I think it's pretty bad. No, this is ugly. Yeah, the I will say the Donkey Kong Bonanza cover art is one of the coolest box arts I've ever seen. Dude, it's one of the things we don't talk about enough is how Nintendo really locked in during the Switch generation when it",
            "start": 930.96
        },
        {
            "text": "Kong Bonanza cover art is one of the coolest box arts I've ever seen. Dude, it's one of the things we don't talk about enough is how Nintendo really locked in during the Switch generation when it came to the box box arts. Yeah, cuz even if you look at the Legend of Zelda Breath of the Wild box art, like that [ __ ] is hot. Just that tiny little red Switch thing in the top corner. I loved the uniformity of the the red spine and then the the white writing. That [ __ ] look was so freaking hot. Having said that, I do love the new potential uniformity of the the spine having the the wraparound art. Like they're keeping the names in the same place for everything. Like that's going to look cool. So, I do think on the side I'm happy with it, which at the end of the day, that's how I look at it most of the time, but man, the front's just a let down. You could really cut down on that by about 30%. I I compare it to like when you know you go to like the used section of GameStop and they have to",
            "start": 969.12
        },
        {
            "text": "of the time, but man, the front's just a let down. You could really cut down on that by about 30%. I I compare it to like when you know you go to like the used section of GameStop and they have to use like generic uh cases and then they print out a thing and it's not the right size. That's what this looks like. 100%. Yeah. And uh Danny Habiki says they don't want any confusions for a new system. I get it. That's clearly what they're doing here. But that's just it sucks for people like me that want the physical ones to collect. And Andy who's dabbling with it, he might get in there. I just I I love the I've always liked the size of the cartridges of the boxes, but that kind of stinks that it's kind of unattractive. Does Nintendo ever dodo steelbooks? No. Yes. Collector's like special things, but like that's not like the default to get. Yeah. Does that mean first party stuff? Yeah. Yeah. I have a tears of the kingdom steelbook cuz that that could be the solution. Let's put a steelbook",
            "start": 1003.28
        },
        {
            "text": "but like that's not like the default to get. Yeah. Does that mean first party stuff? Yeah. Yeah. I have a tears of the kingdom steelbook cuz that that could be the solution. Let's put a steelbook in in every collector's edition and make Tim Gettys get the collector's edition for every Don't do that. a Donkey Kong Bonanza Steelbook. Oh, man. Oh, that's going to go hard. That's what the streets need. That's what the streets need for. I did get that most recent 8-bit do controller cuz and I will be getting the Pro Controller um because uh you know in the future when our planet is dying, it'll be able to to power several planets. Like that thing has such a great battery life. But I always love the look and the feel of the old Pro Controller. the analog triggers definitely kind of [ __ ] up with some old games and I think that's why I had some issues playing Mario Sunshine where it's like you can't just barely push the trigger. It's either on or off. And um I do plan on getting one anyway",
            "start": 1049.84
        },
        {
            "text": "some old games and I think that's why I had some issues playing Mario Sunshine where it's like you can't just barely push the trigger. It's either on or off. And um I do plan on getting one anyway just cuz I've got to assume that that [ __ ] feels really good and really premium and I love back buttons. So, and I also don't know where 8bit do is with all of their they were having like a a China tariff thing happening recently, but I just don't understand where they're at with the controller and their naming schemes, and I feel like a new one will come out, but it'll it'll be a reissue. I have no idea what's going on with them right now. And I love their [ __ ] It's just been extra confusing. Yeah. Timothy, thank you. What have you pre-ordered? I had two Switches pre-ordered. Um, I was trying to get them. I'm always the guy that's refreshing and trying to get as many things as possible for the whole team and like make sure everyone's covered. And uh I managed to get two. I thought I was",
            "start": 1096.08
        },
        {
            "text": "to get them. I'm always the guy that's refreshing and trying to get as many things as possible for the whole team and like make sure everyone's covered. And uh I managed to get two. I thought I was going to be able to get more, but it was actually a pretty not fun pre-ordering experience. They never are fun. But this one I uh I really didn't enjoy uh how it all went down. But I managed to get one that is being delivered on launch day to the Best Buy near us at 10:00 a.m. and then one that's being delivered to the studio the following day on Friday um at some point during the day. So, whatever one I get first obviously is the one I'm going to keep. And then if I'm assuming somebody's is not going to get here. Yeah. And they will get the the second one if necessary. Uh but in addition to that, I got if not necessary, what are we going to do with it? I don't know. I one of my friends won't want it. I'll find somebody that wants it. I mean, if you I was going to say, yeah, maybe I might",
            "start": 1140.8
        },
        {
            "text": "I got if not necessary, what are we going to do with it? I don't know. I one of my friends won't want it. I'll find somebody that wants it. I mean, if you I was going to say, yeah, maybe I might take it then. Somebody close to me is going to to get it. I'm not scalping this or anything, but um I also got the the Pro Controller, and I'm surprised none of you got that. Like I feel like that to me is part of the whole experience of a new console is like like getting the whole pro like you getting the real handheld or real controller in your hands because I also I was too panicked to try to look for anything else cuz I was like the website is functioning right now in this moment and it may not in a little bit so I have to do this right now. And the second one I bought was from Best Buy, but that was where I was still streaming as that [ __ ] was happening and it was it just happened to be that, oh, it works right now. Let me just do it and see what happens, you know? Yeah. I don't Is it",
            "start": 1180.88
        },
        {
            "text": "that was where I was still streaming as that [ __ ] was happening and it was it just happened to be that, oh, it works right now. Let me just do it and see what happens, you know? Yeah. I don't Is it possible to just get one fairly easily now? That's what I'm trying to figure. Yeah. So, I also got a Pro Controller. And that was something like I kind of did going to bed. Like after I like got through the Switch to pre-order process, I just went to a different site cuz Best Buy was kind of being weird after that and I just went to bed, went on an app, and I was like, \"Oh, Pro Controller. Cool.\" Yeah. For me, not not getting it, it was it's just a personal preference of I love the Pro Controller already for the Switch. So the back paddles and the headphone jacks just don't do anything for me because I just don't and also there's the real Greg Millerness of this. I just don't play my Switch enough where it's like yeah I I I if I switch to I fall in love with and I'm playing non-stop and",
            "start": 1223.12
        },
        {
            "text": "because I just don't and also there's the real Greg Millerness of this. I just don't play my Switch enough where it's like yeah I I I if I switch to I fall in love with and I'm playing non-stop and doing all these different things and like I use your guys' and the controller the buttons feel better or something then sure. Yeah, I'd be open to it. But for right now I'm so happy with the Switch Pro controller. I'm just like and I have so many of them. I think I have all four of them still. I'm a controller sicko. I just like I have to always try to get whatever the newest thing is to feel which buttons feel better and which ones I would recommend. Plus is buying one right now. Yeah, I'm literally trying. Well, I'm trying to. Yeah. It says this item is no longer available for the delivery method you selected. So, I assume I had to maybe pick it up in the store. Got uh Yeah, Andy, I'm with you, too. Like I I love controllers and I love the the newoo and all that stuff, but having played",
            "start": 1262.48
        },
        {
            "text": "you selected. So, I assume I had to maybe pick it up in the store. Got uh Yeah, Andy, I'm with you, too. Like I I love controllers and I love the the newoo and all that stuff, but having played both the Switch 2 in Joy-Con mode and in uh with the Pro Controller, like the Joy-Cons were not the substantial increase I was hoping that they would be. Um playing a lot of Switch One, playing a lot of Steam Deck. I wanted it to feel a little more in between the two. And it's very much like, oh, this is just the Switch again. Right, Bless. Yeah, exactly. Right. Like it I know they it's technically a bigger size. It just feels like the same thing for me. Yeah, and I think a lot of that is because it is still the same thinness across the entire Switch. So, they don't feel more substantial and there they kind of just feel taller. The buttons don't feel noticeably bigger or anything. And the shoulder buttons still are very chintzy. Do we have any news on the Switch fix too? I for what they what",
            "start": 1298.88
        },
        {
            "text": "they kind of just feel taller. The buttons don't feel noticeably bigger or anything. And the shoulder buttons still are very chintzy. Do we have any news on the Switch fix too? I for what they what did that end up getting called? The remember the 3D printed one from Kind of funny best friend. They sponsored us. Fixture S2. The fixture. Yeah, cuz it used to be Okay. What? I need a fixture. I don't know. I need a fixture right now for that cuz that is such a amazing life-saving airplane device of snapping the Switch screen onto the Pro Controller. Yeah, I I don't know. I mean, the screen's so much bigger now that I feel like the weight distribution might be off for that cuz I I feel like already with the OLED it was getting kind of up there. Um that would be my one concern is I don't know if that it's going to feel the same cuz I love the it for the one but um yeah, no news on that as far as I know. Um, yeah. So, I got the the the Pro Controller. Also, the Pro Controller is so premium.",
            "start": 1335.52
        },
        {
            "text": "that it's going to feel the same cuz I love the it for the one but um yeah, no news on that as far as I know. Um, yeah. So, I got the the the Pro Controller. Also, the Pro Controller is so premium. Like the the satin finish of it, it feels it is the nicest feeling plastic on a controller I've ever felt. Right, Bless? Yeah. No, it's one it's one of those ones where the reason why I'm currently trying to order the Pro Controller was like you just had me thinking back to launch day Switch one of like feeling the Joy-Cons for the first time playing Breath of the Wild with a Pro Controller, right? and how much how much cooler I think the or how much more the experience is elevated by having this controller that felt upgraded that felt new. And for me playing the Pro Controller or playing with the Pro Controller at the Switch 2 event felt that way, right? It's the same thing, but it is sleeker. It feels more premium, right? Like I I I do like back paddles as well. So, it does feel like it's",
            "start": 1375.68
        },
        {
            "text": "Pro Controller at the Switch 2 event felt that way, right? It's the same thing, but it is sleeker. It feels more premium, right? Like I I I do like back paddles as well. So, it does feel like it's jumped into the future. And that's my other thing is like I've gotten to the point that uh I love back paddles if only just for like fidget stuff. Like I just love having someone to click back there like when I'm in between when I'm just running just clicking stuff and having them on the Pro Controller like and the type that I like too that aren't like projecting and protruding out into you. It's more just kind of like in there. Um yeah, I I'm very excited for the the Pro Controller, but Greg I I get it that like you already love the One. I love the One as well, so I don't think it's necessarily that substantial of an increase, but it definitely is a lot nicer. And when I feel yours, you know, I think you're going to get sold on it after you after you feel mine. Um, but yeah. Yeah, there we",
            "start": 1420.16
        },
        {
            "text": "that substantial of an increase, but it definitely is a lot nicer. And when I feel yours, you know, I think you're going to get sold on it after you after you feel mine. Um, but yeah. Yeah, there we go. Bless. Um, besides that, I got Mario Kart physical uh pre-ordered and um which is very expensive and I hate it, but I want it so I'm getting it. Is that like separate from the bundle? I didn't get the bundle. Oh, got the bundle's digital only. Mario Kart. Yeah, I guess I knew that. [ __ ] Damn, I didn't think about that. And I kind of want the physical box. So, yeah, I got the non Mario Kart digital bundle. I just bought the physical Mario Kart as well as the 450 Switch 2 and but is this one of I I've not kept up because it just doesn't matter to me. Is Mario Kart one of the ones that has the cartridge that just lets you download or is it an actual full-blown cartridge or do you not care? This is where I come into this of like I still don't fully understand this game card stuff. Does",
            "start": 1457.6
        },
        {
            "text": "the cartridge that just lets you download or is it an actual full-blown cartridge or do you not care? This is where I come into this of like I still don't fully understand this game card stuff. Does it work the way that you just said cuz that's what I would love but like I'm not sure if you can do it for yourself. Isn't it just more game sharing stuff? Like I don't I was saying that I know Nintendo is selling boxes that you open and have a thing in it and you still have to download the game. I was So far that's no Nintendo game. Yeah, the full game is on the cart. Thank you. Yeah, that's the choice to do that. Um and Cyber Punk's not doing it because they're using the bigger um more expensive gigabyte card or whatever. Pro controller has been ordered. Wow. Yeah, we did it everybody. Um, but a question I have for the chat, if somebody understands this, with the game card, key share, whatever the hell it's called thing, can I with my physical Mario Kart have a digital version of Mario",
            "start": 1501.6
        },
        {
            "text": "but a question I have for the chat, if somebody understands this, with the game card, key share, whatever the hell it's called thing, can I with my physical Mario Kart have a digital version of Mario Kart on my Switch and not have the physical game in my system? Absolutely not. I can't I I don't know, but absolutely not. The way they've been setting this up, chat, tell me if I'm wrong, but I can't imagine that's possible. Cuz that's that's what I mean. Yeah. No, even if there's like some online check-in or something like that, it's just like, God, they make it so hard for physical collectors, man. This [ __ ] sucks. Um, they they just don't want you going out being a blockbuster. All right. Passing them out. I get that. But I mean, but but the way they have it now of like being able to lend lend it out to your friends. Just let me lend it to myself. But if you lend it to your friends, you wouldn't be able to use it on your console. Yeah. Yeah. That's what I'm saying. Just let me lend",
            "start": 1541.36
        },
        {
            "text": "lend it out to your friends. Just let me lend it to myself. But if you lend it to your friends, you wouldn't be able to use it on your console. Yeah. Yeah. That's what I'm saying. Just let me lend it digitally to myself. Lend the physical version like Oh, I see. to myself. Just one. And now you're crazy. Just buy digital asking a lot. That's insane. I I didn't understand what you're saying cuz it sounds so out there. Dude, I'm so annoyed that I I'm looking at the Pro Pro Pro two controller on Best Buy. I go to I do I do the pre-order thing. I I just had so much joy doing it just now. It cost me like 95 bucks. Something that car really turned around my day. So I at the bottom it says other things you should purchase, right? and I see the 128 GB micro SD Express and I click on it and it shows me what the product is and then I go to the search bar and type in micro SD Express. The first thing I see are the not right ones. This is insane. This it's happening with Amazon 2 now, which like",
            "start": 1576.56
        },
        {
            "text": "me what the product is and then I go to the search bar and type in micro SD Express. The first thing I see are the not right ones. This is insane. This it's happening with Amazon 2 now, which like when I was searching and uh ordering this last week, these searches weren't as [ __ ] So, I don't know what's been happening. like maybe just because they're technically unavailable um in certain like places that they're not popping up at the top. It's very weird. They shouldn't worry about people getting confused with the box art. They should worry about this. This is a much larger issue. It affected me. My my the thing is I you know we don't need the card on day one. Like how many games you trying to download to your thing? You know this is nice to have. Yeah. I'm going to get this in like six months. Yeah. A lot of people I say that I am actually going to download a lot of stuff because I there's so many games I want to go back to. Really? Yeah. I Well, we'll get there, too. Yeah, we'll",
            "start": 1624.8
        },
        {
            "text": "months. Yeah. A lot of people I say that I am actually going to download a lot of stuff because I there's so many games I want to go back to. Really? Yeah. I Well, we'll get there, too. Yeah, we'll get Okay, stop it. Sorry. No, it's fine. No, I'm down. Let's I I'll just hold my boat for a little bit. Yeah, hold down you playing. People in the chat saying physical games have never worked like that. I don't know why he thinks it's different. I'm saying it should be different. I'm saying like they came up with a solution to let people borrow digital games. Like, hey, the use case for me is I have physical versions. I've had Smash Brothers and Mario Kart are the two examples. I own them physically, which means I don't have them on my Switch at all times unless I carry around the cartridge. Just give me a solution for that. Like, it's crazy. She's buying digital. That's crazy. It really is. It totally is. Gina doesn't want this [ __ ] in her house. She loves it. Mario Kart. No. No. The",
            "start": 1669.44
        },
        {
            "text": "Just give me a solution for that. Like, it's crazy. She's buying digital. That's crazy. It really is. It totally is. Gina doesn't want this [ __ ] in her house. She loves it. Mario Kart. No. No. The boxes. She loves the box. She's like, she loves buy [ __ ] on the wall. Um, yeah, that's that's all that I have. Um, aka Chad says, \"Tim, you're asking for the original Xbox One concept here.\" And you know, some people thought it was a good idea. You know what I mean? Um the the one thing I don't have that I I am planning to get, well, I guess now is a [ __ ] SD card. I thought I was good, but I'm not. Uh but the one thing that uh I'm planning to have for launch day, cuz no other games uh I'm planning on actually buying launch day. Donkey Kong will be the next physical game I buy. Um is the GameCube controller, which is not available yet. That becomes available from what I heard on launch day. Um, and you need a Nintendo account to get it. Now, here's the thing, Greg. You said you don't",
            "start": 1701.92
        },
        {
            "text": "GameCube controller, which is not available yet. That becomes available from what I heard on launch day. Um, and you need a Nintendo account to get it. Now, here's the thing, Greg. You said you don't want one. I'm going to need to use your Nintendo account because you're limited to one. And I need four of these [ __ ] You got it. Sure. No problem. These these controllers are going to be my I have them charged at all times. Whenever anyone's at my house, we are ready to freaking smash, baby. Oh, yeah. Oh, yeah. He doesn't have the belt, Barrett. Uh, yeah. I have the uh unless there's more that you've pre-ordered. I've I have the Switch 2 Mario Kart bundle cuz I think I've decided with N the Switch 2 like I'm just I'm going leaning into digital uh just cuz those uh cases are so ugly. Um bless you Tio. Thank you. Uh the Switch 2 Mario Kart World bundle. Um and then the SD card I ordered. It should be like on its way. Um and then the Pro Controller for the Switch 2. And then a carrying",
            "start": 1746.64
        },
        {
            "text": "you Tio. Thank you. Uh the Switch 2 Mario Kart World bundle. Um and then the SD card I ordered. It should be like on its way. Um and then the Pro Controller for the Switch 2. And then a carrying case just because, you know, I'd like to especially because I think I'm going somewhere like a month or so after the the launch. So, uh I like to have something that's guaranteed to have it. We're tossing that in. And yeah, sfbags.com. I'm getting that Nintendo Switch 2 uh case. The Plus is just [ __ ] swiping the card right now. The carrying case. I didn't think about a case. Oh my god. Slicker. Yeah, the City slicker. The one I've used since Vita. They're making a switch one. You can switch to one. How did you I mean I'm still getting the This is no longer available for delivery. What? Oh, I'm picking it up. Yeah. Pick up. Go with him. I'm going to the raisin. Yeah, let's all go together. Get some raisin canes on the way. Cuz Yeah. So, like I pre-ordered the switch through Best Buy and so",
            "start": 1791.92
        },
        {
            "text": "picking it up. Yeah. Pick up. Go with him. I'm going to the raisin. Yeah, let's all go together. Get some raisin canes on the way. Cuz Yeah. So, like I pre-ordered the switch through Best Buy and so I'm not seeing anywhere in my confirmation, Tim, that it's 10:00 a.m. in terms of like pickup. So, I don't know when what our situation is going to be for that Best Buy, but I think it was I saw it in the checkout, I'm pretty sure. Oh, really? Yeah. I just don't like I I mean the checkout at this point was a couple weeks ago for me. So like I all I have is my confirmation email and they it doesn't say anything and I know chat has been saying midnight but again I'm not seeing any confirmation one way or another uh at least on my end. So um I'm going to have to pick up either launch night or launch day. So even the SF Bags case is sold out. No that's I don't know if I could be bothered to pick up. I don't know if I It's down the street. We're going to make content out of it. It's going",
            "start": 1838.88
        },
        {
            "text": "launch day. So even the SF Bags case is sold out. No that's I don't know if I could be bothered to pick up. I don't know if I It's down the street. We're going to make content out of it. It's going during lunch. You drive a car. Traffic's going to be crazy on the Switch day. Oh, yeah. It's going to be like a Warriors Championship is happening, you know? Yeah. We are uh obviously going to be live streaming all day on the Switch 2 launch day. What that looks like, I'm not sure. Is it going to be us here as things get delivered here or is it going to be half of us live at Best Buy trying to pick things up? Uh stay tuned. It's going to be a lot of fun. Wait, is that the same day as SGF? It's the day before. Yeah, Thursday before. Friday is SGF. Oh, they change. Okay, gotcha. Yeah. Yeah, thank god. I'm just hoping that they do a the place near us does a midnight launch because then I don't have to worry about doing stuff in the middle of the day, you know. Yeah. Just take a lunch, man.",
            "start": 1875.76
        },
        {
            "text": "god. I'm just hoping that they do a the place near us does a midnight launch because then I don't have to worry about doing stuff in the middle of the day, you know. Yeah. Just take a lunch, man. We'll just take a fun lunch together. H Andy brought up a good point. Traffic, you know. Traffic to this place that's five [ __ ] minutes from us, you know. There's going to be a lot of cars on the road. The closest Best Buy is like probably the best Best Buy if you're trying to avoid like, you know, population. Nobody goes there. Yeah. I don't think I've seen anybody in the parking lot in ages. I thought they closed that one down. No, no. Still okay. The one near the Where? Where did we eat with Alis and James one time? Oh, they closed that. That's Hella. Andy, we're talking about the Best Buy that is like literally five blocks away. Yeah, there's a Best Buy that's right there. What? Yeah. You know where Gates is? No. Andy, what are you doing for lunch, my man? Everybody, we have to figure",
            "start": 1920.16
        },
        {
            "text": "that is like literally five blocks away. Yeah, there's a Best Buy that's right there. What? Yeah. You know where Gates is? No. Andy, what are you doing for lunch, my man? Everybody, we have to figure out our lines. While we do that, here's a quick word from our sponsors. This episode is brought to you by Imperial. We've told you all how important it is to developers to wishlist games that you're interested in. So, if this sounds cool to you, make sure you wishlist it. Imperial is a complex, featurerich action RPG where you'll be sent to a planet in a far-off corner of the galaxy to explore an imposing monolith. As an elite mercenary, you'll join the expedition tasked with unearthing the secrets of the monolith and face off against the deadly automatons within. In Imperial, you'll explore four vastly different quadrants of the monolith, accessible only by using mysterious artifacts known as cardoggrams. Each cardgram affects which enemies, boss fights, and loot will appear when you",
            "start": 1957.84
        },
        {
            "text": "four vastly different quadrants of the monolith, accessible only by using mysterious artifacts known as cardoggrams. Each cardgram affects which enemies, boss fights, and loot will appear when you enter the monolith, so no two excursions will be the same. Find even more cardoggrams to explore by looting defeated enemies or buy them from other players online at the trading post. Imperial features three weapon archetypes. The fast-paced acrobatic glaive, the defense focused mason shield, or the devastating cannon with a range of customizable skills and abilities that can make short work of the awaiting automatons. Your weapons and abilities can be changed before any excursion into a cardoggram. So, if a loadout isn't working for you, you can mix things up to create the perfect play style. Help the members of the expedition in deep branching quests and aid other players in asynchronous multiplayer. Get ready, mercenaries. The monolith awaits. Imperial is available May 8th on PC, Xbox",
            "start": 2001.76
        },
        {
            "text": "Help the members of the expedition in deep branching quests and aid other players in asynchronous multiplayer. Get ready, mercenaries. The monolith awaits. Imperial is available May 8th on PC, Xbox Series X and PS5. Wishlist now. It helps so much. Wishlist Imperial. This episode is brought to you by Auraframes. If you haven't called your mom in a while, here is your reminder to do it. But then you want to go above and beyond. Mother's Day is coming up and I have the perfect gift idea. Aura Frames are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preload it with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special, they'll use it every day. Greg, Kevin, and a ton of people here at Kind of Funny are obsessed with their Aura frames. It takes about 2 minutes to set up a frame using the Aura app. So the next time you need",
            "start": 2045.92
        },
        {
            "text": "use it every day. Greg, Kevin, and a ton of people here at Kind of Funny are obsessed with their Aura frames. It takes about 2 minutes to set up a frame using the Aura app. So the next time you need to call your mom, you could also send her a new pic of you from that trip that you're telling her all about. Aura has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting orura.com to get $35 off plus free shipping on their bestselling Carver for Matt Frame. That's a rare frames.com promo code kind of funny. Support the show by mentioning us at checkout. Terms and conditions apply. The show is sponsored by BetterHelp. It's super great that mental health awareness is growing, but there's still progress to be made. 26% of Americans who participated in a recent survey say they've avoided seeking mental health support due to fear of judgment. We can do better. No reason for fear. BetterHelp has over 10 years of experience matching people with",
            "start": 2092.96
        },
        {
            "text": "in a recent survey say they've avoided seeking mental health support due to fear of judgment. We can do better. No reason for fear. BetterHelp has over 10 years of experience matching people with the right therapist from the diverse network of more than 30,000 licensed therapists with a wide range of specialties. Some of my best friends use BetterHelp and love how helpful it can be for learning positive coping skills and how to set boundaries. It empowers you to be the best version of yourself. It isn't just for those who've experienced major trauma. If you're thinking of starting therapy, give BetterHelp a try. It's entirely online, designed to be convenient, flexible, and suited to your schedule. We're all better with help. Visit betterhelp.com/kindfunn to get 10% off your first month. That's betterhelp hp.com/kindfunn better betterhelp.com/kindfunn procontroller purchased done the second one not the first now he's looking at the right SD card maybe baby steps we'll get through here",
            "start": 2135.36
        },
        {
            "text": "betterhelp hp.com/kindfunn better betterhelp.com/kindfunn procontroller purchased done the second one not the first now he's looking at the right SD card maybe baby steps we'll get through here you you going in or you getting it delivered I'm I'm I mean now knowing that they just opened one really close by just opened one just I I just uh Google mapped it it's less than a mile away it's a 3minute drive. Wow. Like if we say any more about where it's at, we're going to dox ourselves. This is a walking city, you know. Oh man. Uh, real quick, you guys were talking about the uh the bags situation for the portable thing. I've been getting uh I been traveling a lot the last couple months, so I've been getting like really neurotic about my travel options for like what I'm bringing and stuff. And um specifically with the Steam Deck, I I don't like how bulky the case has been for it. So, I've been like on this quest to figure out like the ideal bagbags.com. My thing is I don't like I don't like",
            "start": 2181.2
        },
        {
            "text": "specifically with the Steam Deck, I I don't like how bulky the case has been for it. So, I've been like on this quest to figure out like the ideal bagbags.com. My thing is I don't like I don't like the concept of putting a bag in a bag. You know what I mean? I got my backpack that I like and I'm just like I want I want things as minimal and I need as much leg room as possible. So, I want to be able to like squish that [ __ ] down as much as possible. You get what I'm saying? Yeah. No, I got you. Yeah. Full ass bag. You have no leg room, right? You know what I'm talking about. It was when you started clapping cheeks that me and Andy were like, \"What are you talking about?\" Uh, so really quick, uh, Tim, uh, on June 5th, Best Buy's most stores in the US will open at 12:00 a.m. Eastern, 9:00 p.m. Pacific. Oh, for pre-order pickup. Take advantage of our store locator tool to find the closest location to you. I love that. So, um, we might be able to do Wednesday night. That would be",
            "start": 2233.76
        },
        {
            "text": "9:00 p.m. Pacific. Oh, for pre-order pickup. Take advantage of our store locator tool to find the closest location to you. I love that. So, um, we might be able to do Wednesday night. That would be awesome. Mosy on over. Yeah. I mean, I'm there for sure if possible. what I would love casewise, and this is something I feel the same thing. I feel the same thing about uh my Steam Deck as well. I have a similar thing with Tim where it's like it's it's like a larger bulky case and it's protecting it. That's awesome. But one thing that I purchased recently was a little it's almost like a clamshell case that just kind of is perfectly form fitted. So, I put some things in assets here. Uh this company, TomTalk, Tom TC. Um, they've been around for a long time doing just a lot of uh cases for a variety of project or products. I've been loving these. These this has been my go-to for my Steam Deck, but also I like to travel cuz I'm crazy with a Dual Sense Edge controller to play my Steam Deck with",
            "start": 2269.92
        },
        {
            "text": "of project or products. I've been loving these. These this has been my go-to for my Steam Deck, but also I like to travel cuz I'm crazy with a Dual Sense Edge controller to play my Steam Deck with and this thing is it is like as slim as you can possibly get and also it's indestructible. Not literally, but like you can put as much pressure and it's not going to hit the buttons at all. That's cool. And uh Oh, you charge through the hole. Oh, yeah. Yeah, dude. This thing is awesome. Um, so I'm definitely waiting to see what uh Switch comes out with for the or what they come out with for the Switch 2, but uh the other link I sent uh Barrett, like they do these for controllers as well. So, I have one for my my Dual Sense uh and I got one for the Pro Controller that'll also work with the the Pro Controller um too. And like it's just awesome. It's like literally like as slim and form fitting, but it does everything a case needs to do. So, highly recommend them. Stay tuned for the Switch 2",
            "start": 2321.6
        },
        {
            "text": "Pro Controller um too. And like it's just awesome. It's like literally like as slim and form fitting, but it does everything a case needs to do. So, highly recommend them. Stay tuned for the Switch 2 stuff. That's exactly what I need for all of my [ __ ] because again, I go to these previews. I take my controller in case they let me use it. But you just leave it kind of the way to live flopping around your bag. But or I put it into the case that it came with and that [ __ ] is bulky. That's a big ass like the Elite 2 controller box is really big. So is the like the Scuf one or whatever. And yeah, so that's I that's a solution I need for the majority of my things. Yeah. And then also, if you're getting real crazy, what I think I'm going to do for my Switch is not have a case for the Switch itself because you can just undock it in the tablet's so small. Put that into the laptop uh section of my backpack. But that's protected enough. And then just get uh and just don't even bring the",
            "start": 2360.64
        },
        {
            "text": "itself because you can just undock it in the tablet's so small. Put that into the laptop uh section of my backpack. But that's protected enough. And then just get uh and just don't even bring the Joy-Cons and just my Pro Controller. That's a great call. Now you're playing with Power Blast. Yeah, that's a smartass call. Yeah, crazy stuff. Yeah, get the Yeah, the JoyCons definitely more real estate than I need. I'm not going to be using them. Yeah, get them out of here. No back paddles on the JoyCons. Uh let's look at the launch games for the Nintendo Switch 2. It sound like there was going to be a transition. No. Yeah. Uh it's a surprising launch lineup. I haven't actually looked at it until last night and it's very high quality, but a lot of it is kind of the catching up, right? Like, hey, here's a bunch of the third party games that uh have come out over the last couple years that are now going to be on Nintendo console. There are some glaring emissions, I'll say. No Xbox games,",
            "start": 2401.84
        },
        {
            "text": "hey, here's a bunch of the third party games that uh have come out over the last couple years that are now going to be on Nintendo console. There are some glaring emissions, I'll say. No Xbox games, which when all said and done after the Nintendo Direct and where we're at now, I'm surprised that we're not seeing any launch games from Microsoft. Uh, with how readily available the the games seem to be now on on PlayStation and their efforts to even like Force are just coming out on on PlayStation 5 and uh Doom coming out, right? Like them not being on Nintendo now, surprising to me. I do expect at the showcase in June, we'll start seeing more of these announcements. But then even today, Gears of War announced not on the Switch 2. What's up with that? I feel like we are a year and a half to two years into us always assuming that the next big presentation will be some reveal that the Game Pass app is now on Switch. And it always just seemed like such a no-brainer with how much Microsoft",
            "start": 2447.28
        },
        {
            "text": "two years into us always assuming that the next big presentation will be some reveal that the Game Pass app is now on Switch. And it always just seemed like such a no-brainer with how much Microsoft wants to just be everywhere. I'm pretty shocked that there's really no, you know, are is there going to be an announcement? Will this ever happen now? Well, Game Pass probably not, but undercut sales too much. Yeah, I think with where they're at now, like with the new the Game Pass conversation, I think was what was relevant when we were talking TVs and the and Xbox wasn't like as third party now as it is in terms of software. Now that that's the case, I don't think we see Game Pass on Switch. But I do think that this gives a lot of credence to I forget who did it, but on Twitter there was the there's the three-phase program. Oh, yeah. Insider gaming. the dev kit. It's like, \"Okay, cool. Maybe Xbox didn't have a dev kit.\" That's weird as [ __ ] though. I mean, is it? Yeah. I don't think",
            "start": 2488.72
        },
        {
            "text": "there's the three-phase program. Oh, yeah. Insider gaming. the dev kit. It's like, \"Okay, cool. Maybe Xbox didn't have a dev kit.\" That's weird as [ __ ] though. I mean, is it? Yeah. I don't think it's that weird. I think Nintendo still is a weird company with the WNDs, and I bet they still view Xbox as competition to some respect. Like, how long is keep it to our trusted partners that we're getting third party systems out to? How long has Xbox been this version of Xbox as far as being third party and being open, right? Like I think if we're at the point we're at now where Fortza just came to PlayStation like maybe two years ago, then Nintendo probably would have been like, \"Oh yeah, take one, make all these games, right?\" But I think it's taken a while to get there. Um, so I wouldn't be surprised if Nintendo was a bit more, I guess, trepidacious about allowing Xbox aid a platform. Hi Rush, like where what? Oh yeah, that's just like such a no-brainer for a Switch platform. It's it's",
            "start": 2535.76
        },
        {
            "text": "surprised if Nintendo was a bit more, I guess, trepidacious about allowing Xbox aid a platform. Hi Rush, like where what? Oh yeah, that's just like such a no-brainer for a Switch platform. It's it's Do they own that anymore? Huh? Do they own that anymore? Oh yeah. Who own No, because they got bought by Embracer. No, like who owns the rights to the first game specifically? Is it still Xbox? I imagine so, right? The rights to their own game, the IP going forward, but yeah, I mean the studio shut down and then got reopened and reimagined as something else. But I got to assume they still have Craftton. That's what it is. Yeah, Craft. Yeah, Craft now owns a Hi-Fi Rush ID. Okay. still even more shocking that that's not I I still think that this summer at the Xbox showcase we're going to see a lot of Switch talk um from the games because Tony Hawk Activision Microsoft that's coming to Switch that was part of the direct so that's a little different because I'm sure that that was agreements",
            "start": 2573.44
        },
        {
            "text": "lot of Switch talk um from the games because Tony Hawk Activision Microsoft that's coming to Switch that was part of the direct so that's a little different because I'm sure that that was agreements and stuff made prior to all the stuff with Microsoft but uh anyways let's talk about what is here for the launch we have Mario Kart World uh then we have Breath of the Wild and Tears of the Kingdom the Nintendo Switch 2 editions and they're definitely pushing those as and positioning them as if they are key launch titles, which let's talk about that. Obviously, we're all getting Mario Kart World. Are any of y'all interested in Breath of the Wild Tears of the Kingdom? Thousand%. And I'm not proud of it, but absolutely. Yeah. Like I it's I am such a frame rate and visual snob that I can't wait to see these things that deserve so much better to finally have so much better. Unless you're going through, you know, illegal means or whatever. But that's a, you know, like the fact that we are",
            "start": 2618.96
        },
        {
            "text": "to see these things that deserve so much better to finally have so much better. Unless you're going through, you know, illegal means or whatever. But that's a, you know, like the fact that we are getting this official version is so sick. I can't believe how excited I am for this. It looks amazing. It runs super smooth. And yeah, it's like finally the some of the greatest games of all time are getting their due justice. And I that's the one I keep thinking about is Greg Miller. Hi, how are you? You the champion. You gave up on Tears of the Kingdom. Not cuz you didn't like it, just cuz 40 hours in. Yeah. Yeah. Just, you know, pulled something else. Yeah. I I I'm jealous of you. This could be your opportunity to play this the right way. And that's the hope. It would be the hope as we get there. The thing I find myself struggling with is that I'm more excited to play uh uh Legend of Zelda uh Winder. Nope. Nope. Nope. Nope. Don't say it or Link's Awakening. Oh, I never play I I started Ben",
            "start": 2664.8
        },
        {
            "text": "The thing I find myself struggling with is that I'm more excited to play uh uh Legend of Zelda uh Winder. Nope. Nope. Nope. Nope. Don't say it or Link's Awakening. Oh, I never play I I started Ben wanted I when Tier Echoes of Wisdom came out, I was like so excited for it. I started it with Ben and I was like, damn, I forgot how much I love this art style. I'm like I never same I didn't review it so I just lost it. I'm like before I get any more into this I need to go play that and I started that and I was having a great time with it but I was like holy [ __ ] the frame rate is atro the I'm having a stroke everybody remember I died as champion the frame rate is atrocious in this so and it was like that thing of like I'm going to stop because I have to imagine switch two games are going to be or switch two is going to run these better and then they made the announcement that it did. So like right now I'm jonesing for that game which makes me think that I'll get it and download it. Will",
            "start": 2706.72
        },
        {
            "text": "be or switch two is going to run these better and then they made the announcement that it did. So like right now I'm jonesing for that game which makes me think that I'll get it and download it. Will I give Tears of the Kingdom a chance here and go back to it and start from scratch and I'm just going to mainline the story this time? Not stick with me. Mainline the story. Not because I don't love the open world stuff. Just cuz it it was too distracting for me. That's what killed tears for me outside of not reviewing it as well and then having to do other reviews. It was that I did 40 hours, but all 40 hours were, \"Oh, there's a shrine. There's a shrine. Oh, that thing's over there. That and then it would be like, wait, what the [ __ ] am I doing again? Like, what's the main thing again? And I found a a a dragon teardrop. How many hours ago? I don't know what the [ __ ] happened. Like I want to go and I want to give it I need to get my feet underneath me about the story before I go get",
            "start": 2747.28
        },
        {
            "text": "I found a a a dragon teardrop. How many hours ago? I don't know what the [ __ ] happened. Like I want to go and I want to give it I need to get my feet underneath me about the story before I go get lost and everything else. Uh you mentioned Links Awakening. Barrett, can you bring up uh what I have here about the uh the free updates? Um, they announced all the free updates for select Nintendo Switch games that are going to be coming out uh for launch. And that includes ARMS, Captain Toad, Mario Odyssey, Mario 3D World, Clubhouse Games, Links Awakening, Echoes of Wisdom, Game Builder Garage, Mario Bros. U Deluxe, Pokemon Scarlet, and Violet, and Big Brain Academy. So, to stop right there, Pokemon is well for me, where I had done I was Violet, right? I was Violet, and I did everything except beat the gym masters, right? And I was ready for the DLC. And it was that thing where I played it like crazy and then came back and played like crazy and then I've been waiting for that next crazy",
            "start": 2782.4
        },
        {
            "text": "beat the gym masters, right? And I was ready for the DLC. And it was that thing where I played it like crazy and then came back and played like crazy and then I've been waiting for that next crazy thing to come around. And every time Ben watches a Pokemon cartoon, I'm like, I got to get back to that game. I got to get back to that game. And again, to come back and have them run better. I'd rather do that here. Yeah. Looking at this, I'm very excited. I I'm interested because we don't know what this means. Like they've went into detail about what it means for uh some of the titles that are getting them paid enhancements. We don't know. Is this frame rate, resolution, anything else? Is it consistent between all the games? Like we just don't know. So, I'm very excited to see week one what everyone's saying about like this ends up being this, this ends up being this cuz I don't think Nintendo's going to straight up say it at this point. Uh, but yeah, Pokemon Scarlet and Violet. I never",
            "start": 2824.16
        },
        {
            "text": "everyone's saying about like this ends up being this, this ends up being this cuz I don't think Nintendo's going to straight up say it at this point. Uh, but yeah, Pokemon Scarlet and Violet. I never finished the second DLC. So, I'm excited to play that cuz recently I booted up my Switch. I'm like, I can't do this anymore. I just can't [ __ ] do this. Um, but also, yeah, the Links Awakening and Echo of Wisdom running better. Like, that's going to be so nice. But it's just And Mario Odyssey, I just want to see like hopefully that gets 4K. It already ran like a dream, but like even better could be nice. The resolution I think will go a long way. Um, but we we're missing Animal Crossing. We're missing Smash Brothers. Like there's some games that aren't here. I'm very interested. Animal Crossing crazy that it's not there yet. Yeah, it's a good thing I think. Yeah. What do you think they're planning? I mean, I think they're leaving it open for an enhanced edition like with Kirby and Breath",
            "start": 2859.76
        },
        {
            "text": "crazy that it's not there yet. Yeah, it's a good thing I think. Yeah. What do you think they're planning? I mean, I think they're leaving it open for an enhanced edition like with Kirby and Breath of Wild and Tears and things like that. Mario Party, right? Be more substantial. So, you're talking added content to make it seem worthwhile. Don't give me hope. Don't give me hope. Hope's here. Why? Why else wouldn't it be here? I don't know. Wendy's. We'll see. Starve me till the next Animal Crossing till Switch 2 Animal Crossing. Starve you. Yeah. Uh, bless. What's your read on the launch games here? I mean, my thing when I look through this, right, when as we're talking about Breath of the Wild and Tears of the Kingdom, as much as I would love to go back and like revisit those with them looking better, I still look at the launch lineup and I'm like, I don't think I'll have time cuz I'm going to spend so much time with Mario Kart World, I'm going to play the [ __ ] out of Delta Rune,",
            "start": 2895.2
        },
        {
            "text": "looking better, I still look at the launch lineup and I'm like, I don't think I'll have time cuz I'm going to spend so much time with Mario Kart World, I'm going to play the [ __ ] out of Delta Rune, right? Because that's coming out. Explain that. So, Delta Rune, chapters 1, 2, 3, and four, our launch game for the Switch 2. Uh, what's new there? Chapters three and four. So, chapters 1 and two came out years ago, right? the way that uh Toby Fox has been putting these out has been a chapter at a time. Um and Barrett, you can you're you're up to this up on this too, right? Like do we know how many chapters total he's going for here? Um I I'm confused now too cuz I thought it was seven. Um because the way the story is uh framed in each of these chapters, it's one day uh throughout an entire week. Um but then I've been hearing other reports that there's only four chapters, but I don't I don't think that's the case. I think there's supposed to be a total of seven. Yeah, everybody in chat is",
            "start": 2937.84
        },
        {
            "text": "Um but then I've been hearing other reports that there's only four chapters, but I don't I don't think that's the case. I think there's supposed to be a total of seven. Yeah, everybody in chat is saying saying seven as well. So like this will get us over the halfway point. Thank god uh of Delta and each of these chapters are like four to five hours each. Best thing is each of these chapter like when you talk about Undertale the the original game Undertale was probably like a five to eight hour game and so like you're essentially getting sequels to Undertale here. Uh and chapter chapters one and two felt like full experiences and so like you're getting two more chapters which are going to be hopefully two more full experiences of what's going on um in this story. So for me and I'm and for Bear and for the Delta Rune audience like this is going to be a big deal. This is the big thing like outside of Mario Kart, this is the big thing that I will be playing launch. Exactly. Same for a",
            "start": 2977.12
        },
        {
            "text": "Bear and for the Delta Rune audience like this is going to be a big deal. This is the big thing like outside of Mario Kart, this is the big thing that I will be playing launch. Exactly. Same for a couple weeks probably. So yeah, I look at the rest of launch lineup and like you know there are things I kind of want to peek into. Like you mentioned Mario Mario Odyssey. That's one that I want to boot up and just run around for a good 10 minutes just like you know experience it hopefully in better uh um better resolution or just better uh visuals. Uh, but outside of that, right, like, you know, maybe I'll pick up Socalibur 2. Maybe I check out Welcome Tour because like some of the some of the things we saw in the previews looked kind of interesting as far as like what those mini gamess are, but that's not going to be like a big time waster for me. That's high on my list. What game? Yeah. Uh, Welcome Tour. The thing where you're inside. Yeah. I I want to just get that done. Y'all are going",
            "start": 3014.4
        },
        {
            "text": "that's not going to be like a big time waster for me. That's high on my list. What game? Yeah. Uh, Welcome Tour. The thing where you're inside. Yeah. I I want to just get that done. Y'all are going to play pay $10 for that. Yeah. Yeah. Sorry. Listen, I wasn't complaining like Gary would have. I should be I wasn't the one throwing a tantrum. Um, where's what about the the like dragon dragon drive? Is that not launch? No. When is that coming out? I don't think they put a date on it and I think it was 2025, but like I don't think we know much more than that. Is a month till Donkey Kong. Is that right? July is Donkey Kong. Yeah. And Kirby, I think was August. So maybe September for Dragon Drive. I thought for sure that was a launch title. Uh, yeah. Yeah, I the launch shot lineup really feels like heavy on the third party stuff like Split Fiction, Cyberpunk Ultimate Edition, Street Fighter 6, Kunagami, Path of Goddess, Civilization 7, Hogwarts Legacy, Default, Yakuza Zero, Fortnite, any of",
            "start": 3051.2
        },
        {
            "text": "heavy on the third party stuff like Split Fiction, Cyberpunk Ultimate Edition, Street Fighter 6, Kunagami, Path of Goddess, Civilization 7, Hogwarts Legacy, Default, Yakuza Zero, Fortnite, any of those games. You guys going to give a shot? No. Yeah, me. Not cuz I I play I either played them or there's not my game. Yeah. Yeah. Or Switch 2 is not necessarily where I I need to play it, right? Um Fast Fusion, I don't remember what that is. Is that part of That's the fast RMX game. Oh, you're right. Yeah. Yeah. Yeah. Uh, Hitman: World of Assassination Signature Edition. Oh, you know what? I might boot that up for a little bit. I don't expect it to be like that much new content, so I don't know how much I'm going to play it. Uh, cuz I think I just rather play on PS5, but I'll boot that up just to check it out. Uh, Nanaga's Ambition, Awakening Complete Edition, Survival Kids, Rune Factory, Guardians of Iuma, Surv I forgot Survival Kids is coming out of launch. I did, too. I might I might I",
            "start": 3097.92
        },
        {
            "text": "to check it out. Uh, Nanaga's Ambition, Awakening Complete Edition, Survival Kids, Rune Factory, Guardians of Iuma, Surv I forgot Survival Kids is coming out of launch. I did, too. I might I might I might boot that up. No, you won't. I'll just check it You're not booting that up. There's not a chance in hell you booting that up. Survival kids. Uh, Arcade Archives 2, Ridgeer, and then Puyo Pooyo Tetris 2s. So, that's the launch lineup. Andy, is there any of those that uh pique your interest besides the the obvious ones? No, not really. Cuz a lot of these are just I don't think I'm going to have time. I think I once blessing brought up the issue of time, I was like, \"Oh, fuck.\" Actually, that's a great point because this will be, you know, still a week or two after Night Rain comes out or whenever that like there's just so many other large titles around three weeks before Death Stranding 2. That's the thing is like when are we going to get Death Stranding 2? So like that's my that's",
            "start": 3140.48
        },
        {
            "text": "whenever that like there's just so many other large titles around three weeks before Death Stranding 2. That's the thing is like when are we going to get Death Stranding 2? So like that's my that's honestly the bigger thing here with which you know I don't think I'll actually get to Welcome Tour aside from playing like five minutes of it. Hopefully we get a code or if I decide to spend the $10. Um which is like death rating 2. There's um rematch is coming out later that month. There's like other things that I kind of want to check out like Dune Awakening and like other games in that realm. Uh FPC Firebreak is in June as well. Like June is just a big month for video games. It'd be one thing if I owned a lot of these games already. This isn't, you know, this isn't similar to getting the PS5 Pro and going, \"Oh [ __ ] let me boot up all those other games I already owned on PS5. This is let me buy these games that never existed.\" Like, I would not do that just to like I I can't justify",
            "start": 3186.0
        },
        {
            "text": "PS5 Pro and going, \"Oh [ __ ] let me boot up all those other games I already owned on PS5. This is let me buy these games that never existed.\" Like, I would not do that just to like I I can't justify spending that much on a game that I would just want to check out, you know? Yeah. That's why for me it's like most of them are the Nintendo games, right, that are getting some type of free things. So, I'm excited to pop around there. But, yeah, for me it's Mario Kart World, um the enhanced editions of Breath and Tears and then Welcome Tour. But, uh the Gamecube stuff is like what I'm next in line most excited for, specifically F-Zero GX. Like, I've never beat the single player in it cuz it was incredibly difficult and I've been waiting for somehow Nintendo to re-release it. I thought it was going to be an actual like remake or something, but I'll take this. I played a little bit of it at the event and it looks great widescreen. Everything I kind of wanted from it, uh, which is in direct",
            "start": 3222.2
        },
        {
            "text": "going to be an actual like remake or something, but I'll take this. I played a little bit of it at the event and it looks great widescreen. Everything I kind of wanted from it, uh, which is in direct opposition to Wind Waker, which is not in widescreen. That bothers me and I wish it was the, uh, Wii port, but I'm excited that the original is here as well. I just feel like this isn't how I want to replay Wind Waker. Uh, question for Greg. In terms of GameCube games, uh, obviously they'll get to eventually uh, Double Dash. Is that is that one you go back to and prioritize over Mario Kart World whenever it comes? Um, no. I mean, I'll stick with World. I imagine it'll be a better game. For me, you know, as somebody with limited Nintendo nostalgia, all the virtual console stuff is always, oh, I'm going to pop in here, check it out. No, that's cool. And then I bounce out. So, even like somebody who loves Luigi's Mansion, even somebody who loves Wind Waker, I don't expect to put real hours",
            "start": 3260.16
        },
        {
            "text": "I'm going to pop in here, check it out. No, that's cool. And then I bounce out. So, even like somebody who loves Luigi's Mansion, even somebody who loves Wind Waker, I don't expect to put real hours into either of those here. Okay. I'd be super st when they put in uh Mario Golf. What was it? Toad stool tour here, right? Yeah, it was to stool tour. Yeah, I'm definitely going to go do the exact same thing I'm talking about of try it out for a little bit and then bounce off. But yeah, my launch will be dominated by world. I imagine when I'm out of that, it'll be playing uh probably Zelda. Whether it's Tears or it is Links Awakening is to be decided. And then yeah, I'll be back to that back to that Mario Kart. Uh Bert on the chat says, \"I wonder if the Pokemon games are cool. Has anyone played those?\" Uh yeah, there's Pokemon Colosseum and XD Gale of Darkness. They're uh full-on RPGs on the Gamecube. Uh they're just not traditional gym leader type uh Pokemon things, but they're both",
            "start": 3305.84
        },
        {
            "text": "played those?\" Uh yeah, there's Pokemon Colosseum and XD Gale of Darkness. They're uh full-on RPGs on the Gamecube. Uh they're just not traditional gym leader type uh Pokemon things, but they're both really good. I don't think that they're the best by any means, but they're definitely fun and they're not that long either. So, when they come out, check them out cuz they're they're pretty cool. Uh your starters are Espeon and Umbreon. Both damn cool in Colosseum at least. Uh but yeah, Andy, what what's your launch weekend look like gameplaywise? Um, it's probably a lot of Mario Kart World. It is. I mean, it's it's got to be Metroid. Like, I I I want to play the [ __ ] out of that, you know? Or is Prime 4 not launch? No. No. We still don't have a date. No. Really? Yeah. No, no, no. [ __ ] me. That'll be their big That'll be their big fall game. This has been a revelatory games cast for Andy. He's been so dread the [ __ ] card. It's Best Buy. Now it's when Metroid's coming out. I didn't I",
            "start": 3344.32
        },
        {
            "text": "That'll be their big That'll be their big fall game. This has been a revelatory games cast for Andy. He's been so dread the [ __ ] card. It's Best Buy. Now it's when Metroid's coming out. I didn't I didn't realize anyone. I'm looking into my health insurance this whole time. I don't know what's going on. You seriously think we just talked for an hour and we had brought up Metroid Prime 4. Well, you know, I zoned out. He said it and I was like, \"Shit, am I out of am?\" I think it's going to be the big like November or October holiday game for having a rough one, everybody. Thanks, man. No problem. That's That's very quality. You were bringing up the GameCube stuff. Are you interested in Wind Waker? Sorry, I had chips in my mouth. Um, not for launch. I will go to it uh at one point, but yeah, my my prior priorities being Mario Kart World uh which is going to be a lot with it being kind of a openw world kind of forza burnout, what what have you. There's going to be a lot to dive into",
            "start": 3394.56
        },
        {
            "text": "yeah, my my prior priorities being Mario Kart World uh which is going to be a lot with it being kind of a openw world kind of forza burnout, what what have you. There's going to be a lot to dive into there. And then yeah, Delta Rune being a a big Undertale and Delta Rune chapters one and two fan like that's going to take a bit of time out of me. So, that'll be one that I get to probably not at launch, but probably a couple months down the line when things start to to cool down after like Bonanza and stuff like that. Yeah, I feel you on that. Uh, anything else you guys want to talk about in terms of your hype for Switch 2? Super excited for it. You know, I think one of the things that's underrated in terms of the hype for it, you mentioned launch weekend is the fact that Mario Kart World launches at the time where we're all going to be here. You know what I mean? where it's like we get a Thursday of like it's switch and then it's SGF which will start our day late but I imagine will",
            "start": 3446.96
        },
        {
            "text": "launches at the time where we're all going to be here. You know what I mean? where it's like we get a Thursday of like it's switch and then it's SGF which will start our day late but I imagine will mean we're playing on the TV out there while we wait and then it'll be the weekend right of going to SGF and covering games but then also coming back for Xbox and doing that and playing here. It's going to be a very fun time for content but also a great time for this kind of multiplayer game to launch where we can all sit around and play. Yeah, I'm beside myself. Like I like I literally was like sitting in my my room last night like looking at my setup. I'm like, \"Oh man, that thing's getting retired soon. That doc's going away. Hey, I don't need all I'll get a new one there. I was like like starting to fantasize about where everything's going. I'm ready, man. Like, I need this thing. I need the the controller. I need it. I need it all. I need Mario Kart. I'm so ready to toss out my goddamn",
            "start": 3490.08
        },
        {
            "text": "to fantasize about where everything's going. I'm ready, man. Like, I need this thing. I need the the controller. I need it. I need it all. I need Mario Kart. I'm so ready to toss out my goddamn Switch charger. It's been the ugliest looking thing ever. And it also doesn't charge any of my current [ __ ] like efficiently. All of my current devices whenever I'm just whenever Yeah. when I'm desperate for just like a USBC and I'll just kind of like look at it like I've tried it in. It's like doesn't charge well. Ally complains every time. I don't know, brother. I'll try. But I don't know. I'm so tired of it. I'm so tired. Get one of those Steam Deck bricks with the Switch 2. No, it's it's it's nicer or it's like It looks a lot nicer than the Switch One. It's at least detachable this time. Oh, nice. Okay. Yeah, you can see it on the I bring up the accessories link. If I just use like a regular USBC like cable that I got my phone, it's not going to charge my Steam Deck. And so I'm like",
            "start": 3525.44
        },
        {
            "text": "Oh, nice. Okay. Yeah, you can see it on the I bring up the accessories link. If I just use like a regular USBC like cable that I got my phone, it's not going to charge my Steam Deck. And so I'm like wondering if like the Switch 2 is gonna have one of the more powerful ones. You got to watch a YouTube video, man. There's the USBC, but I one of my least favorite things in life is how non-universal this [ __ ] thing is. Like come on. Standardize this [ __ ] in a way that makes sense. But yeah, this is the the new AC adapter. More like universal serial sus. Is it a bus? It's not universal. Bless. USBC is not universal. Did you say USS? I I like I just want them to work great and they just don't. But were you asking that question because of how whenever you buy a new phone nowadays, they don't come with charges anymore. Was that one of your is that your more so just a thing of like I have I have like many chargers and like half of them are for for phones and like you know less powerful",
            "start": 3566.72
        },
        {
            "text": "come with charges anymore. Was that one of your is that your more so just a thing of like I have I have like many chargers and like half of them are for for phones and like you know less powerful things and like the other half are for like my Steam Deck or my ROG Ally. But then my RAW like my Steam Deck charger I need to use with my Steam Deck cuz my Steam Deck my Steam Deck won't get charged by my phone charger. Yeah. My seam deck charger works great on my phone. I love it. Yeah. Oh, yeah. That is true. God, we live such different lives. Any chance I get, I'm just like, I'm just going to buy the nicest cables. Every cable I use is the same. I'm going to power everything. So, it's never just the brick. It's like the cable. Bring up the video. Let's watch it. Let us know in the comments below how hyped you are for the Switch 2 just a month out. I'm very [ __ ] excited and I hope you are, too. Stay tuned to Kind of Funny for all of our launch coverage. Uh, whatever the stream the day",
            "start": 3612.8
        },
        {
            "text": "below how hyped you are for the Switch 2 just a month out. I'm very [ __ ] excited and I hope you are, too. Stay tuned to Kind of Funny for all of our launch coverage. Uh, whatever the stream the day one looks like, I don't know, but we're going to be live and it's going to be fun. We're going to be playing Mario Kart. We're going to all be unboxing our Switches as they come in. It's going to be a blast. So, hang out along with us as you hopefully open yours as well. Uh, we have a whole bunch of fun content today as well. We have our Last of Us screencast coming up next. Then we have the Nvidia stream. Then we have in review for Alien Covenant. Did we like it? Did we love it? Did we hate it? You'll have to wait. You'll have to see. Great super chat before the show ends real quick. Uh this is from just one more who says, \"The chaos and confusion of this game's cast per perfectly summed up the switch to experience for me so far.\" Well done team. So much. There we go everyone. Welcome to",
            "start": 3653.6
        },
        {
            "text": "is from just one more who says, \"The chaos and confusion of this game's cast per perfectly summed up the switch to experience for me so far.\" Well done team. So much. There we go everyone. Welcome to the chaos. Until next time, I love you all. Goodbye. Is",
            "start": 3690.96
        }
    ]
}