{
    "id": 14090,
    "video_id": "HDHN6QwBctw",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Andy Cortez",
        "Blessing Adeoye Jr.",
        "Mike Howard",
        "Saige Ryan"
    ],
    "title": "We Went to the Nintendo Store! - Kinda Funny Gamescast",
    "description": "Go to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on\ntheir best-selling Carver Mat frame.\n\nGo to http://rocketmoney.com/KINDAFUNNY to cancel your unwanted subscriptions and reach your financial goals faster with Rocket Money.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1747338287,
    "duration": 3918,
    "transcript_chunks": [
        {
            "text": "[Music] What's up and welcome back to the kind of funny games cast for Wednesday, May 14th, Thursday, May 15th. You got God. You got God. It's Thursday. 25 everybody. We were recording this on a Tuesday, so you know, I assumed it was tomorrow, but no, Andy, it's the day. After that, I got God got. Well, what's up everyone? I hope you had a great Wednesday. I'm hope you're having a great Thursday today. Of course, I am Tim Gettys. I'm joined today by Blessing Addie Jr. Good day, Tim. Greg Miller. Hello. Andy Cortez. You don't understand how stupid Greg looked with this little carton of water. He looks so stupid walking around with this little thing. Look like he's drinking little milk from elementary school. No. Can we take a photo? Does the photo exist and then nobody knows who you're talking about? That's embargoed information. Embargoed information. Everybody making her return to the desk. It is Pixel Circus' very own Sage Ryan. Hello. Oh, Clouds. Oh my goodness. Thank you. Normally,",
            "start": 7.24
        },
        {
            "text": "about? That's embargoed information. Embargoed information. Everybody making her return to the desk. It is Pixel Circus' very own Sage Ryan. Hello. Oh, Clouds. Oh my goodness. Thank you. Normally, you're in a little box on the wall for all the andor coverage. Yeah, this is preferred. This is much nicer. Definitely. Well, too bad. We have a box right now. Uh, everyone, we got to go see the Nintendo store in San Francisco. the uh second United States Nintendo store after uh Nintendo New York opened 20 years ago, which is absolutely wild. Um so we're going to talk all about our experience there as uh we were some of the very first people ever to enter the store. The first is what they're telling us, you know, and I guess technically that has to be true. Yeah. People that don't work for Nintendo kind of and they were clear that like us kind of funny. We're the first people in line. Thanks to Roger. Yeah. Thanks to Roger. Who was the first person out of us that stepped foot in there?",
            "start": 59.2
        },
        {
            "text": "Nintendo kind of and they were clear that like us kind of funny. We're the first people in line. Thanks to Roger. Yeah. Thanks to Roger. Who was the first person out of us that stepped foot in there? Roger. Roger. Was it Roger? No, I think it was Greg. It was Greg. And the biggest news, they call me two bags. Two bags, Miller. Well, we'll get into those bags and everything that's inside of them throughout this show and talk about our experience overall of the Nintendo store in San Francisco. But remember, this is the kind of funny Games Cast each and every weekday. We get together to talk about the biggest reviews, previews, and topics in video games live on YouTube, Twitch, and podcast services around the globe. If you love what we do, please support us with the Kind Funny membership. It gets you all of our shows ad free and you get a daily exclusive Greg way. Uh that's Greg talking for 15 to 20 minutes about whatever he wants answering your questions. Whole bunch of cool stuff.",
            "start": 103.76
        },
        {
            "text": "It gets you all of our shows ad free and you get a daily exclusive Greg way. Uh that's Greg talking for 15 to 20 minutes about whatever he wants answering your questions. Whole bunch of cool stuff. Today's a special guest episode. Thursday. Yeah. Wow. Did you say who the guest is? I don't remember off top of my head. It's on the calendar. Roger. Check the calendar. I have two bags. I can't have a laptop as well. Two bags. No thoughts. Oh, somebody's taking over for you. Yeah. Oh, I was like, how could you not know who you're going to have with you? There's something I don't get. I I definitely thought you had a call in or something interview schedule everybody. You can get the kind of funny membership on Patreon, YouTube, Spotify or Apple podcast. Um and remember we are an 11 person business all about live talk shows. You already got an amazing episode I'm sure of the kind of funny games daily show that we do talking about news. And then after this loud laugh for Roger off mic but",
            "start": 140.08
        },
        {
            "text": "all about live talk shows. You already got an amazing episode I'm sure of the kind of funny games daily show that we do talking about news. And then after this loud laugh for Roger off mic but still loud enough to get Yeah. Yeah. Yeah. I don't have it here. You know what I mean? I'm going off the cuff. Daily was great. Mike hosted who with? We don't know. We don't know yet. We don't know. It's an ongoing thing. Uh, thank you to our Patreon producers Carl Jacobs, Omega Buster, and Delaney Twining. Today, we are brought to you by Shady Rays, RF Frames, and Rocket Money, but we'll tell you about that later. And I'm remembering right now, we're about to do a super cool Nvidia sponsored stream of Doom, the dark ages with Andy and Nick. Nick playing. Yes. Yes. Yes. Uh, but for now, let's start with the topic of the show. We were at the store, the Nintendo store in San Francisco, California. Very, very exciting times. Honestly, I moved it so you can see my cool shirt. I just hate amazing",
            "start": 181.76
        },
        {
            "text": "with the topic of the show. We were at the store, the Nintendo store in San Francisco, California. Very, very exciting times. Honestly, I moved it so you can see my cool shirt. I just hate amazing sweater on stage right now. Look how cool all these people are. Just one bag over here, Andy. I I Twitch streaming hasn't been going as well as he wanted. You have Amazon Prime. You have Twitch Prime. Uh, no. We're headed uh Me and Blessing are going on a trip right now. And uh I was like, I got to go get my car at my apartment. And so I just left everything. I left most of everything cuz I did bring some things. But you did buy things though. Oh, I did buy things. Okay. Of course. Of course. Um but yeah, here we are looking at all the bags. Look, two-sided bag here. We got uh these little Nintendo faves. Kind of making a little walk to the store. Where is the store? San Francisco. I want to start this off by asking, has anyone been to the New York store? Blessing. Yes, I've been there twice",
            "start": 218.24
        },
        {
            "text": "faves. Kind of making a little walk to the store. Where is the store? San Francisco. I want to start this off by asking, has anyone been to the New York store? Blessing. Yes, I've been there twice or maybe three times even. Sage. Tragically, no. Greg. No. Andy. Really? Even when we went. When was I with you? We did a world tour. Yeah. Greg wasn't with us, though. Damn. For real. Okay. Yeah. I think that was maybe the second time I went. Yeah. Loved it. It's always It's always like walking into a theme park for me. Like there's no rides anywhere, but it's just like you see cool statues and you get all giddy and cool photo ops. It's infectious. This is the New York one that I haven't been to, but in general, this is infectious. Yeah. I've been three times in my life. I went back in like 2009, I want to say. It's when I met Kanye West at a John C. You changed everything for No, man. I don't want to play. Don't put that on me. Butterfly. Don't put that on me. Butterfly effect. That's how",
            "start": 264.48
        },
        {
            "text": "I want to say. It's when I met Kanye West at a John C. You changed everything for No, man. I don't want to play. Don't put that on me. Butterfly. Don't put that on me. Butterfly effect. That's how it works. Uh, but we went there then and then we went there um again in for the the world tour. And there was one other time. Oh, it was when uh I previewed Smash Brothers Ultimate in uh 2018. It must have been. Uh I went there and it's always a a super fun time. Um so obviously very excited for one to open up in my hometown of San Francisco. So, I think that's very cool. Little unexpected, I would say. Weird. Yeah. Seattle's right there. I know. Tourists, especially after The Last of Us, people are really seeing what that thing's all about. Yeah. Yeah. It's fair enough. Yeah. I mean, I It's It's a bit weird because when people talk about San Francisco, it's often negative and it's often referring to the area that this store is in. So, it's just a little surprising to me that this is",
            "start": 308.72
        },
        {
            "text": "It's a bit weird because when people talk about San Francisco, it's often negative and it's often referring to the area that this store is in. So, it's just a little surprising to me that this is happening, but maybe this will be what turns it around. A little happiness. You miss you you came and joined me at the the Weston next door when I was getting a nice coffee. Before you got there, the old men who were sitting there weren't actually friends. They were just old men who started talking to each other and one of them was putting over SF big. It's like it's getting better year after year. We're really cleaning it up. It's a lot like Detroit. It's coming around. So there you go. A lot like Detroit. Wow. That's where we're at. Detroit. Well, Detroit used to be really bad and now it's a lot better. Now Detroit is actually awesome. This sounds like you guys don't really appreciate or deserve this. Uh I'm going to say bring it to LA. Yeah. Uh, okay. LA which identical strip mall should",
            "start": 349.2
        },
        {
            "text": "better. Now Detroit is actually awesome. This sounds like you guys don't really appreciate or deserve this. Uh I'm going to say bring it to LA. Yeah. Uh, okay. LA which identical strip mall should we put it in? Los Angeles was right there. Uh, and I'd say we could have it as a treat if you It doesn't sound You know, you guys already got You already got Mario World. You got Nintendo World. You know what I mean? I know. But it's not like this. No, it's not. It's not the same. Nintendo store is there. You've been there. Correct. I have. And it's wonderful. I love it. Obviously, uh, Universal in Hollywood is like very small. Um, really immersive, really wonderful. The stores, nothing like this. I'm not going to say they're bad, but it's much more like take your kids, they want a Mario shirt merch, not the things I have in this bag. Sage, I want to start with you then. You have not been to the New York store. You have been to the the little gift shop of Nintendo World. What was your",
            "start": 384.56
        },
        {
            "text": "merch, not the things I have in this bag. Sage, I want to start with you then. You have not been to the New York store. You have been to the the little gift shop of Nintendo World. What was your experience like for the first time in a Nintendo store? Uh, it was phenomenal. I I think it's really cool. Uh, I I definitely chose my things based on stuff that I feel like I wasn't going to see elsewhere, right? Because there's certain Nintendo IP where you're like, I can get this at every store, right? Um whereas Pikmin and even Animal Crossing. I feel like Animal Crossing was everywhere for a minute, but there's some Animal Crossing stuff in here that I'm like, I'm not getting that anywhere else. There's literally the stuff that's like actually you can't get anywhere else, but also just things that felt like I wouldn't see this elsewhere. Um they had a really cool selection. They had I mean genuinely everything. Uh there was a good amount of like slightly more niche. We're not going to say",
            "start": 421.84
        },
        {
            "text": "that felt like I wouldn't see this elsewhere. Um they had a really cool selection. They had I mean genuinely everything. Uh there was a good amount of like slightly more niche. We're not going to say in a niche Nintendo, but like slightly more niche or at least niche things from your favorite big games uh that I kept being so delighted to see. Yeah, we'll obviously go through all of our bags throughout the show of all the items we got, but just gut reactions. Greg Miller, hey, how are you, Tim? Uh, it was awesome. You know, I think, you know, the stuff people talk about with the New York store for so long of it being like a theme park. It's magical. It's whatever. That's here. You know what I mean? I was super excited to be there today and to walk in not knowing I I've seen photos, of course, iconically. The first time we ever saw Andrew Golarb was when he went to a meet and greet with Craig Harris at a Nintendo store. Oh, wow. way way way way back in the Aishan days. So, I've seen",
            "start": 456.08
        },
        {
            "text": "iconically. The first time we ever saw Andrew Golarb was when he went to a meet and greet with Craig Harris at a Nintendo store. Oh, wow. way way way way back in the Aishan days. So, I've seen photos of it, but I kind of forgot all about what it actually is. So, to walk in there, see the statueets, have it be brand new, have it be so much stuff I've never seen in terms of a Nintendo thing, and have that second floor uh filled with other awesome stuff. A bunch, you know, they said the, you know, the usual BS when you start, we want this to be immersive. We want this to be an experience. What are the two words? Immersive was the one. Surprise and delight. Surprise and delight. Talk about immersive. did say. He did say immersive. But yeah, he did come back around on surprise and delight a lot. And so there was goofy stuff like okay I was like how is it? And you go downstairs and you scan your mind Nintendo and you get a platinum point. You get a sticker. I was like that's cool. I like",
            "start": 493.04
        },
        {
            "text": "lot. And so there was goofy stuff like okay I was like how is it? And you go downstairs and you scan your mind Nintendo and you get a platinum point. You get a sticker. I was like that's cool. I like that idea. Let alone how cool all the stuff was and I'm excited to see it evolve and change as you go. But I even as somebody who's I'm a not a big Nintendo fan but a franchise fan like I I enjoy I have two bags. Two bags. Not a big Nintendo guy. Well I was raised a Sega kid and I am making sure my three-year-old does not know that hell. So he will be he will be a Nintendo kid. He will be happy with Donkey Kong. You will have a better life, son. Yeah. Andy, were you surprised? Were you delighted? I was surprised and delighted. I mean, I It's hard to fight the feeling while you're there. Like, man, like consumerism. It rocks. Like, you know, when it goes hard, it goes hard, you know? Um, but yeah, this is all just [ __ ] that you love as a kid and you can't imagine that. Like as a kid, I",
            "start": 531.6
        },
        {
            "text": "man, like consumerism. It rocks. Like, you know, when it goes hard, it goes hard, you know? Um, but yeah, this is all just [ __ ] that you love as a kid and you can't imagine that. Like as a kid, I just never expected to ever have things like this in America. I thought this was something I would have to go to Japan for. And so to visit in New York many years ago was amazing. And it was equally as cool this time. I just love the statues. I love all the the set dressing. U bunch of cool different items that I I I I think are so easy to buy because they're just little trinkets, little uh the things that I usually go for. keychains, pins, like I they have a [ __ ] ton of that. And um I needed to stop myself because I I looked at the amiibo wall and I'm not an amiibo dude, but I love figurines. And when you see them all together, dude. And like I was sitting there, I was standing next to Jake to Jake Decker and he was telling me about all the ones that he's missing from his catalog. And I",
            "start": 569.92
        },
        {
            "text": "And when you see them all together, dude. And like I was sitting there, I was standing next to Jake to Jake Decker and he was telling me about all the ones that he's missing from his catalog. And I was like, \"Dude, if I buy if I get one, it would turn into seven.\" Like, and that's not in the future. It's like right now. if I get one right now, which I was really eyeing the Ivy store. I was like, I'm going to have to get the Ocarina um link. I'm going to have to get the Tears of the Kingdom Zelda. And it it just would have like compounded and compounded. Um so I had to kind of stop myself a bit there, but I bought some cool stuff. Yeah, I enjoyed it. I I do feel like the bottom floor, like the bottom floor is embargoed to everybody. I was like, \"Oh, what are we about to see down there?\" And I was hoping for Switch, too. It was more awesome [ __ ] of course, but I I I don't know why I thought that there would be like we're we're building a Pokemon in the lab. We have a new down tubes.",
            "start": 620.72
        },
        {
            "text": "I was hoping for Switch, too. It was more awesome [ __ ] of course, but I I I don't know why I thought that there would be like we're we're building a Pokemon in the lab. We have a new down tubes. Yeah. Yeah. It was awesome. One thing that lit up when Andy was talking there because he started talking about like it's cool to have this and I never thought I'd see it outside of America. I do, jokes aside, have a sense of pride as, you know, San Francisco being my adoptive hometown at this point, right? 18 years here to see you you joked about it but we used to have the PlayStation store like downtown used to be a different spot there with the metry and all this stuff and when that left that sucked and to see so many businesses that have left SF because of prices because of co because of XY andZ over the years. It is really cool to see Nintendo double down and say hopefully that they see enough turning around on Union Square that they want to be back there because Union Square is that",
            "start": 661.44
        },
        {
            "text": "andZ over the years. It is really cool to see Nintendo double down and say hopefully that they see enough turning around on Union Square that they want to be back there because Union Square is that tourist hot spot. It is the cable car. It is the Christmas tree, you know, come December. It's I I'm as Macy's is leaving and it's leaving a huge hole down there. It's cool to see something like this pop back in. Yeah, absolutely. It was cool to see people outside that weren't part of like the press order just pumped to like photos of the inside. We walked up and Raj immediately was like, \"Oh yeah, that guy over there is is using his 3DS to live stream and he came over and asked me if I was famous and yada y\" and I was like, \"Oh, okay.\" What a weird thing for a creator to do. And then when we were inside and he was still outside, I was like, \"This guy just showed up. It was live streaming outside. Glad he was a part of this event. That's awesome. That's passion, baby. That's love. Bless. I",
            "start": 700.8
        },
        {
            "text": "inside and he was still outside, I was like, \"This guy just showed up. It was live streaming outside. Glad he was a part of this event. That's awesome. That's passion, baby. That's love. Bless. I can't imagine you looking at a wall of amiibo and getting suckered in. There's not a way in hell you would ever have to pick. Decide, am I going to change my life for the worst right now? Did you? I mean I mean should I get Do you want me to boast bust open the bag I have? Not yet. Not yet. But what were your first impressions of Nintendo store San Francisco? Oh, fantastic. Right. Like it's the it's the thing where you always get reminded of the Nintendo Magic and why we call it Magic where you I walk in there, they're giving the tour, they're talking to us about the store. They're telling us like, you know, the intricate design things of like, oh yeah, we wanted you to feel welcomed in. And so we have the statue that kind of points to the rest of the store or whatever. And you have your",
            "start": 739.12
        },
        {
            "text": "like, you know, the intricate design things of like, oh yeah, we wanted you to feel welcomed in. And so we have the statue that kind of points to the rest of the store or whatever. And you have your Mario section here, every Animal Crossing section here. And I'm looking and I'm like, it's [ __ ] awesome. I can see all the DK stuff over here. And then we go downstairs and I'm like, Tears of the Kingdom, Breath of the Wild, like we're cooking. Like I Pokemon Pokemon like it felt like getting lost in a place of my inner child's dreams. You know what I mean? Like there's something I think that is special about how they approach the Nintendo store cuz it isn't just random ass Nintendo merch. It is stuff that is uh a lot of exclusive stuff. One of the first things they mentioned during the tour is that if you see the uh red block Nintendo logo, that means that that item is exclusive to the store. And there's a lot of that. Um so that was really delightful to see. I was surprised and",
            "start": 780.08
        },
        {
            "text": "tour is that if you see the uh red block Nintendo logo, that means that that item is exclusive to the store. And there's a lot of that. Um so that was really delightful to see. I was surprised and delighted by that um to see how much exclusive stuff there is. But one of the other things they mentioned as well was the fact that the when they're approaching making the exclusive merch for the different franchises, they think about the audiences of those franchises, which is hilarious to me because Nintendo all their stuff is like you would think of like family games or kids games, right? All of it is rated E, maybe rated E10 plus for the most part. But there is like a methodology that I really appreciate when I go over to the Animal Crossing uh part of the store and I think about my friends that are into Animal Crossing and I'm like, they're being served here. It's cozy [ __ ] It's stationary. It's stuff where I'm like, \"All right, I'm putting two and two together here.\" I go to the like",
            "start": 814.0
        },
        {
            "text": "are into Animal Crossing and I'm like, they're being served here. It's cozy [ __ ] It's stationary. It's stuff where I'm like, \"All right, I'm putting two and two together here.\" I go to the like I went The funny thing was going to the Tears of the Kingdom side of it and it being like, \"Yeah, we got buttoned up shirts.\" And I'm like, I don't make the connection, but like I appreciate the thought that they're putting into this. And like I don't know, there's something so magical about how different Nintendo franchises so strongly speak uh to such wide audiences in a way where I'm, you know, walking around all these places. I'm not a Pikmin person, but I'm hanging out in the Pikmin area talking to one of the Nintendo employees. And I look and I see Kurt from GameSpot like walk over with a big piece of Pikmin merch. And I look over at him and he's like, \"Ah, dude, I love Pikmin.\" I'm like and I'm like this is what it's about. And so yeah, no I had such a good time in the store. I think",
            "start": 855.76
        },
        {
            "text": "big piece of Pikmin merch. And I look over at him and he's like, \"Ah, dude, I love Pikmin.\" I'm like and I'm like this is what it's about. And so yeah, no I had such a good time in the store. I think um a lot of the stuff that they're holding in here uh is super awesome. I even looked at quite a bit of the Animal Crossing stuff and I was like yo I'm not an Animal Crossing person but this stuff is really neat. And so I'm really happy for the people that are in the area that going to be able to check this stuff out that haven't been able to go to the Nintendo store in New York or in other countries. Yeah. Timothy, this is a dream come true. Oh, surprised and delighted. Are you kidding me? Yeah. No, I love it. you you kind of like took the words out of my mouth there, Greg, but like it being in San Francisco means so much to me. I love this. Like I me being the Nintendo guy, me being the San Francisco guy. You combine them. Like it does feel special. Like of course I had to get a shirt",
            "start": 893.76
        },
        {
            "text": "in San Francisco means so much to me. I love this. Like I me being the Nintendo guy, me being the San Francisco guy. You combine them. Like it does feel special. Like of course I had to get a shirt with the the the logo on it. Where is it? There we go. You see it? What's on camera here? But I just love that. I'm just like, \"God, that's so cool.\" And uh me and Andy had a moment in the store just being like, \"God, like being little kids. you can't even imagine being in the store with this much representation of like our franchises we love and like so many different things that you look at and even if you don't want to buy it, it's cool to just kind of experience. I feel like it's a fun store experience even if you're not going to uh actually purchase stuff. Um but yeah, I was really really really stoked about how different it was from the New York one. Like I think that uh from my experience with the New York one so far, I preferred that mainly because they have like a museum and I'm",
            "start": 928.32
        },
        {
            "text": "really stoked about how different it was from the New York one. Like I think that uh from my experience with the New York one so far, I preferred that mainly because they have like a museum and I'm sure that this is going to evolve and change, but uh I'm just such a sucker for like the history of Nintendo stuff. So like they actually have the Game Boy from the Gulf War that survived that like is like infamous from like all the stories like that's there and you kind of just see like the lineage of all the systems. But now that Nintendo has the museum uh in uh Kyoto, I think Osaka Osaka. Um like it's like all right, cool. Clearly they're kind of like diversifying their experiences with the theme parks and everything. So I get that this didn't need to have the exact same things as New York, but I really appreciated what had different. I did like the experience of it having the franchise to franchise kind of like almost Disneyland theme parkes. Here's the the Animal Crossing world. Here's",
            "start": 965.44
        },
        {
            "text": "I really appreciated what had different. I did like the experience of it having the franchise to franchise kind of like almost Disneyland theme parkes. Here's the the Animal Crossing world. Here's the Zelda world. And um that feels like kind of corny to say cuz it's just like well yeah you go to a store and they're going to have it broken up by section but there's a Nintendo magic to it that's like no this does feel a little bit more of an experience that I think the color palette of the products changed right like it feels like there is a particular vibe when you walk into a a different section of the Nintendo store. You nailed it, Tim. Saying the the Zelda world over here, the Pokemon world, the um the Metroid corner of the neighborhood that the shelf. The Metroid had a shelf. I bumped into I bumped into Tam and I was walking through my bag. I'm like, \"What' you guys?\" Oh, all the Metroid stuff. I got all the We got to show up. I really wanted this Metroid shirt, the one on the",
            "start": 1003.68
        },
        {
            "text": "into I bumped into Tam and I was walking through my bag. I'm like, \"What' you guys?\" Oh, all the Metroid stuff. I got all the We got to show up. I really wanted this Metroid shirt, the one on the left, which is just the logo and it was very shiny. Yeah, it had sort of that foil look to it. I was so close to getting it, but I couldn't pull it through. Yeah, you got to limit yourself. And I think that's the thing that that about this is like you're going to want to buy a lot of things, which that's cool. There's a lot of things that are interesting enough to want to buy. Um, but in addition to that, I think that it's a fun experience just to go there. Like, I think this is they achieved creating a destination event for Nintendo fans. Like, this is going to be something that if you are traveling to San Francisco, it's a mustsee. You should 100% go through. You're going to have a great time. You're probably gonna buy some things. And what I'm most excited for is the future of this. Like,",
            "start": 1050.88
        },
        {
            "text": "to San Francisco, it's a mustsee. You should 100% go through. You're going to have a great time. You're probably gonna buy some things. And what I'm most excited for is the future of this. Like, we'll get into more details later, but I really am surprised that this is opening a couple weeks before the Switch 2. And there's no side of Switch anywhere. Like, not even like a preview kiosk or or like in a wall like in a a plastic like glass case or something. None of that. So, 3 weeks from now, the place we were today is going to look completely different. And I would have been so annoyed installing all the Switch One stuff. Yeah, we're just going to get rid of this [ __ ] anyway. Yeah, it's just for these these content creators come through. That's it. Okay. But, uh, very excited for the future. Yeah. You guys want to get into what's in the bags? What's in the bags? I think we might need to do that after award promotion casters. This episode is brought to you by Shady Race. Get ready for",
            "start": 1087.2
        },
        {
            "text": "Yeah. You guys want to get into what's in the bags? What's in the bags? I think we might need to do that after award promotion casters. This episode is brought to you by Shady Race. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized sunglasses that won't break the bank. Shady Race is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people. Their shades have durable frames and crystal clear optics, making them the perfect choice for all outdoor adventures. They have hundreds of options to choose from, so you're bound to find the perfect pair to match your style. Take it from Tim Gettys, who rocks his shady rays every day going on Pokémon Go walks out and about SF looking dope. If you don't love your shades, exchange for a new pair or return worry-f free within 30 days. There's no risk when you shop. Their team always has your back with personal and fast",
            "start": 1126.8
        },
        {
            "text": "SF looking dope. If you don't love your shades, exchange for a new pair or return worry-f free within 30 days. There's no risk when you shop. Their team always has your back with personal and fast support. Exclusively for our listeners, Shady Race is giving out their best deal. Head to shady.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. That's shady.com, promo code funny. This episode is brought to you by Auraframes. Every day we're taking photos from big events to silly moments. But doesn't it sometimes feel like all of your favorite photos are just stuck on your camera roll? Wouldn't it be great to have an easy way to share and enjoy them with friends and family? That's where Aura comes in. Aura makes it effortless to upload unlimited photos and videos directly from your phone so your favorite memories are always within view. Plus, you can personalize and preload an Aura frame for a unique and special",
            "start": 1171.84
        },
        {
            "text": "to upload unlimited photos and videos directly from your phone so your favorite memories are always within view. Plus, you can personalize and preload an Aura frame for a unique and special gift. We love Aura Frames in this office. Roger has one at home he got for his fiance's birthday, and she absolutely loves it. It takes about 2 minutes to set up the frame using the Aura app. Add unlimited photos and videos and invite as many people as you want to an Auraf frame. There are absolutely no hidden fees or subscriptions. And for a limited time, listeners can save on the perfect gift by going to aframes.com to get $20 off plus free shipping on their best-selling Carver matte frame. That's a frames.com. Promo code aura 20. Support the show by mentioning us at checkout. Terms and conditions apply. This episode's brought to you by Rocket Money. With prices going up on just about everything lately, being smart with your money isn't just a good idea. It's essential. But managing",
            "start": 1214.48
        },
        {
            "text": "conditions apply. This episode's brought to you by Rocket Money. With prices going up on just about everything lately, being smart with your money isn't just a good idea. It's essential. But managing subscriptions, tracking spending, and cutting costs can feel overwhelming. Lucky for you, Rocket Money takes the guesswork out of it so you can easily make smart decisions. Rocket Money has helped multiple members of Kind of Funny learn they were still paying for things they totally didn't even realize. Rocket Money is a personal finance app that helps find and cancel your unwanted subscriptions, monitors your spending, and helps lower your bills so you can grow your savings. Rocket Money's dashboard gives you a clear view of your expenses across all of your accounts, and then you get alerts if bills increase in price, there's unusual spending activity, or if you're close to going over budget. Rocket Money has over 5 million users and has saved a total of 500 million in canceled",
            "start": 1261.04
        },
        {
            "text": "alerts if bills increase in price, there's unusual spending activity, or if you're close to going over budget. Rocket Money has over 5 million users and has saved a total of 500 million in canceled subscriptions, saving members up to $740 a year while using the app's premium features. Cancel your unwanted subscriptions and reach your financial goals faster with RocketMoney. Go to rocketmoney.com/kindfunn today. That's rocketmoney.com/kindfunn. rocketmoney.com/kindfunn. Sage. Yeah. I want to know what you put in the bag. What'd you get? Okay. I would like to start by telling you how confident I was so confident that I wasn't going to be shopping at this that I didn't bring a suitcase at all. I'm here. I'm in San Francisco for 24 hours just for this. Um and I brought like a bag cuz it's 24 hours. I literally got in late last night, went to sleep, got up came to the Nintendo store, and then I'm going home. It's a 45minute flight. Like you don't need much. Um I'm not a merch person in",
            "start": 1297.6
        },
        {
            "text": "24 hours. I literally got in late last night, went to sleep, got up came to the Nintendo store, and then I'm going home. It's a 45minute flight. Like you don't need much. Um I'm not a merch person in general. Uh, I have little bits here and there, but for both in my home and for what I wear, my number one thing is it has to be something I would wear if the like thing I like wasn't on it, right? Like I I'm very specific about that. Same with the stuff in my house. I don't do figures. Like I don't have any figurines up really. So, it's very specific except for in like my little streaming area, but in general, I don't. However, uh, all of that is to say that I bought so much. You got got I got so got and I'm I'm thrilled and I want you to know that I also would have gotten got more if I had brought a suitcase. There are things I put back. I put down especially in the Animal Crossing section. So, Animal Crossing really really got me because I I am I like cozy stuff. That was the thing is",
            "start": 1344.72
        },
        {
            "text": "brought a suitcase. There are things I put back. I put down especially in the Animal Crossing section. So, Animal Crossing really really got me because I I am I like cozy stuff. That was the thing is that's exactly what you said though is like it's things that we as the type of people that are Animal Crossing fans would like anyways. And you made it in Animal Crossing. How dare you? Um, okay. Do we start pulling stuff out? Are we doing it? Go for it. Christmas morning. All right. So, this is a weird one. These are magnets. They're like refrigerator magnets, but they're little whiteboards you write things on on your fridge. Um, and they're drawn in like the kind of very San Rio style of Animal Crossing. Like, I don't know if you guys remember when they did the San Rio Animal Crossing collab a while back with the cards. Uh, it's drawn in that style. They're very cute and very cool. And honestly, it was also pretty affordable. The whole Animal Crossing section was kind of reasonable. The",
            "start": 1383.68
        },
        {
            "text": "a while back with the cards. Uh, it's drawn in that style. They're very cute and very cool. And honestly, it was also pretty affordable. The whole Animal Crossing section was kind of reasonable. The Animal Crossing section was like, \"Is this a different store?\" Cuz this is all I could buy all this stuff. Like, this is this is an $18 thing and it's larger than my hand and that's surprising. Um, you know what I mean? Like you just expect those things to be like really expensive. Uh, I told him I was like, I can't believe I spent less than $200 at the Nintendo store for a bag of things. Um, so I also got this one because I wasn't going to. And then I read that it says every day is a new day on it. It's just a little Everyday present on the back. So if you're an audio listener, is it a tote bag? Little tote bag. Thank you. I was like the thing this thing. Uh, I I love it. They're all in this kind of same like very cozy style of the Animal Crossing section. They had, I feel like, three",
            "start": 1421.36
        },
        {
            "text": "bag? Little tote bag. Thank you. I was like the thing this thing. Uh, I I love it. They're all in this kind of same like very cozy style of the Animal Crossing section. They had, I feel like, three different sections within Animal Crossing. You had the very classic like visually Animal Crossing, the like leaf pattern essentially on it. Uh, you had the Dow section that was really, really cool. Uh, that had like cool jackets and stuff that was all the mail service and then you had like mostly very like Japanese Animal Crossing style stuff of it. Um, I was really impressed with the color palette of the Animal Crossing stuff. Like I feel like that was like the real first thing I noticed of like, oh, they're dialing into this in a cool way. Yeah, they had a lot of stuff that said on it. Dot Namorei, uh, the like Japanese Animal Crossing version of it. And it's just they're so cute. They were so good. They're all in that very pastel style. And there was so much home stuff that I couldn't",
            "start": 1458.4
        },
        {
            "text": "Namorei, uh, the like Japanese Animal Crossing version of it. And it's just they're so cute. They were so good. They're all in that very pastel style. And there was so much home stuff that I couldn't get. I actually put back. I was walking around with it for a good while. Uh, there were these glass or like ceramic measuring cups and there was a giant ceramic baking tray that I'm like, there's literally no possible way that I get this back to Los Angeles. Like I was like, okay, I could go and ship stuff. It's going to break. Like it's going to break for sure. And I'm like, do I do I cradle a ceramic baking dish on my way back to Los Angeles? And I really considered it cuz it's in this same style, but it's just means I have to come back. But even then, I come back and what do I do? Yeah. What do I do? They don't ship from the store yet. They do not ship from the store. I asked them. Uh it might be a thing coming because they weren't sure. They were like, \"We can't do that right now.",
            "start": 1498.72
        },
        {
            "text": "What do I do? They don't ship from the store yet. They do not ship from the store. I asked them. Uh it might be a thing coming because they weren't sure. They were like, \"We can't do that right now. They're they're not going to be doing it when it opens, but hopefully soon.\" Um the people working there were still learning how to use their headsets. So I don't I think it's I wouldn't I'm not betting on anything happening eventually. As much as I don't know what you're talking about, Miss Yeah. They like talked to another one of the managers and they were like it seemed like it was a thing that they want to be able to do but they can't do yet. And I don't know if it's because of systems like you said or if it's also like hey we're figuring out how to navigate these exclusives. Um obviously it's not going to be something you can get online but if you're in store and you're traveling here and you visited can you get them to ship it back to you? I think that would be a great a great thing.",
            "start": 1534.32
        },
        {
            "text": "not going to be something you can get online but if you're in store and you're traveling here and you visited can you get them to ship it back to you? I think that would be a great a great thing. That would be really nice. Um, are we just keep Am I going all the way through? Go through. Okay. I'm not done with Animal Crossing, unfortunately. Did you get the measuring cups? I didn't get the measure. Oh, damn. Those stayed behind. I was a coward. I was a coward. It was a huge box, mind you. Big ass. It was a big box. And I was like, \"Okay, I could wrap them in my clothing. I'm here for one day.\" I brought one other piece of clothing. It's one It's one tank top wrapper. Like, I have one pair of sweatpants that I got to wear on the plane back. It's not going to be helpful. Well, you could have bought the Animal Crossing pajamas and then worn this. I almost bought There was really really cute. Uh there's like the exclusive design that's on the bag of like all of the characters walking to",
            "start": 1567.12
        },
        {
            "text": "bought the Animal Crossing pajamas and then worn this. I almost bought There was really really cute. Uh there's like the exclusive design that's on the bag of like all of the characters walking to the store. Uh they did have really cute pajamas for that that I almost did. But again, where would I put it? Where am I? Where's it going to go? Andy wore 15 coats once. You could wear it. I'm going to have to wear everything that I buy. I'm going to be like clipping these things on to me for some reason and be like, \"No, that's not Don't worry about it. That's part of my outfit.\" Um these are just cute little Animal Crossing clips. Don't worry about that. It's fine. Um, I did spend a lot of time in the Pikmin section. Uh, Pikmin is one of those a I love Pikmin. I'm a huge Pikmin fan. Um, I think they're probably some of my favorite games ever made and some of the games that really made me love games. But also, it's a thing you don't see other places, right? Animal Crossing is elsewhere.",
            "start": 1607.36
        },
        {
            "text": "they're probably some of my favorite games ever made and some of the games that really made me love games. But also, it's a thing you don't see other places, right? Animal Crossing is elsewhere. Mario is elsewhere. Pikmin, I don't really know where else you're going to get Pikmin merch. And maybe maybe it's because there's not that many Pikmin fans out there, but uh I got two Pikmin blind boxes. I'll only get a blind box if it means that no matter what I get in here, it's awesome. And everything in here is good and they're just different little pigment and there's no wrong answer whatsoever of those. I wanted a hundred more of them and there's only seven that you can get. So, you can open I'll open one of them. Open the tape. My nails are fake. But I wanted to bring up I don't know if you you put them up on Instagram too, right? Roger, if we can get the photo of her nails. They are in Oh, so Roger was walking in the room then. They are curvy nails. They are fantastic. How long did it",
            "start": 1642.4
        },
        {
            "text": "you put them up on Instagram too, right? Roger, if we can get the photo of her nails. They are in Oh, so Roger was walking in the room then. They are curvy nails. They are fantastic. How long did it take to get them done and how long will they last? Um, I did them this morning in my hotel room. I made them. I glued these on to fake nails. Uh, and I will be ripping them off when I leave the studio. Oh, Raj coming with Raj coming with the Zoom. Can you do this thing? What is What did beauty gurus do? Um, like put your hand behind it so they can see it. Yeah. It's just a bunch of little Kirby charms. I bought them and glued them to nails and they're the most horrific feeling on the planet. Like this is a sensory nightmare. I had to have Joey open my soda for me. I'm sitting there like, \"Help. Can't do anything.\" Imagine her on the plane. She's like, \"Sir, can you put my baking dishes and my measuring cup? I have my nails.\" Uh, that's why I waited to put them on until I got here cuz I",
            "start": 1682.64
        },
        {
            "text": "Can't do anything.\" Imagine her on the plane. She's like, \"Sir, can you put my baking dishes and my measuring cup? I have my nails.\" Uh, that's why I waited to put them on until I got here cuz I knew I would not be able to navigate flying in an airplane. My god. Um, so I put them on in the hotel this morning. Blind box number one. Unboxing the big Looks like it's the sexy one laying on a leaf. It's the sexy pigman. We got the sexy pig. It's a little white guy. Wait, hold on. I want pretty fly for a little white guy. You have to know how excited I am because I also bought that guy. I bought him in like a fuzzy little keychain. She loves sexy white Pikmin. Oh, those are cool. Uh, so pretty stoked. It is It is like a like slightly egregiously sexy pose. I'm not going to be honest. Like what is that? It's um laying on the leaf. Ah, that's perfect. I love it. There was I was surprised by how hard they went with the Pikmin merch. The whole Pikmin section was like really big. Considering how",
            "start": 1720.16
        },
        {
            "text": "that? It's um laying on the leaf. Ah, that's perfect. I love it. There was I was surprised by how hard they went with the Pikmin merch. The whole Pikmin section was like really big. Considering how small the Metroid section is. I was shocked. There must be market data though of like there's a lot of people buying the I didn't think there would be. And there's a lot of like too cool for school guys being like I almost bought the metallic shirt but he's talking Roger run. I think that's kind of the thing right is like we know from consumer statistics that like on average about 70 to 80% of buying power in America is with women, right? So when they're looking at like, well, how big of sections do we put in these stories? There has to be a big factor of like women buy merch. Like women buy merch when they love something. It's a very different relationship with it where like women feel free to embrace be a fan of something like really be a fan of something that is kind of limited in a lot",
            "start": 1765.12
        },
        {
            "text": "when they love something. It's a very different relationship with it where like women feel free to embrace be a fan of something like really be a fan of something that is kind of limited in a lot of like masculine cultures except for like deep like nerd fandom. You have to like break through a thing to get there. And you're much more like surface level women feel like, \"Oh yeah, I can I can do that. I get to embrace that. Um, I gave Blessie one of my 2B figurines. He just gave it away. I know it gave it away. So, her point, I'm like, I'm not rocking this 2B figurine. I can't let the public know what this and then I gave it to Michael Hay. So, now it's on our dinner table. Ter, that was not the only thing. Um, oh god, why is there so much you know $200 again? I know. Uh, these are coasters, but they look like the little blocks. Picnic coaster. So cute. I really like when there's like a it's like a functional thing from the game. It's not just a thing you printed the character on, but",
            "start": 1806.0
        },
        {
            "text": "but they look like the little blocks. Picnic coaster. So cute. I really like when there's like a it's like a functional thing from the game. It's not just a thing you printed the character on, but something that feels immersive like, oh, I could touch this in that world. That's my favorite of like gaming merch at all. Um, so they have the little fives on them as well, so that you can like, you know, to grow your little Pikmin. Uh, this one is just an Isabelle little shopping bag, but it's so cute that you could take with you. Um, I did get something. Uh, Anthony will hopefully have it by the time that this video comes out. I brought Anthony back a Splatoon blind box. Um, I I was hearing his voice in my Take it out and fill it with bees. Give it to him. I was hearing his voice in my head there because I I helped him move last time of him being like, I can't have any more chachkis. I cannot have any more. I know how much he loves Splatoon, but god do I know that that man has too many",
            "start": 1854.88
        },
        {
            "text": "there because I I helped him move last time of him being like, I can't have any more chachkis. I cannot have any more. I know how much he loves Splatoon, but god do I know that that man has too many chachkis. Uh he's drown. He's up to the throat in chachki. So I got the smallest thing that I could where I feel like this is not disruptive. When you move again, you won't be like, \"Damn, put on a backpack.\" I won't be like, \"Man, I'm so upset that I have to move this.\" Uh he can't have any more figurines. I believe that's a legal mandate. So these are little Splatoon shoes and it was really cute. So the little blind box of shoes. Um and then I just have one other of the the penguin ones. I'm going to save this one cuz this one's a gift. So we're not going to open that one. But then we got those cool little commemorative coins. Yeah. So I want to talk about that a little bit. So what's cool one of my favorite things so far about this version of the store is that they did I think a really",
            "start": 1891.12
        },
        {
            "text": "cool little commemorative coins. Yeah. So I want to talk about that a little bit. So what's cool one of my favorite things so far about this version of the store is that they did I think a really good job of making it not just for like a destination event to to go to to see everything, but like having the amount of exclusives they had, but the amount of like collectible exclusives. So, like the little uh blind boxes, I think that's very smart cuz from what we've seen so far with Animal Crossing and um or sorry, Splatoon and uh Pikmin, I'm like those are there's an audience for that. It doesn't just seem like things for things sake. And it's like look at I'm like those are those are dope. But on top of that, and this is where it's like oh man, they're they're really getting us with the like spend $50 and uh you get this like collectible coin and it's randomized every day. It's going to be a different franchise or different character. They're saying I'm sure there's a limited amount of",
            "start": 1927.04
        },
        {
            "text": "spend $50 and uh you get this like collectible coin and it's randomized every day. It's going to be a different franchise or different character. They're saying I'm sure there's a limited amount of them, but um for us today it was depending on the register you went to and you didn't know what you were going to get. You got one of these uh coins. Which one did you get? I got two one on the way out. Did they give you one? Yeah, they gave me one on the way out. So when I was actually shopping, I got the Splatoon one. I got a squid girl. Um but they handed me an Animal Crossing one on the way out and I'm so happy about that. Girl, there we go. It has Isabelle and little pink villager. What'd you get? Bless start with you. In November 2014. Oh [ __ ] Nintendo launched the amiibo and for over a decade I resisted because I knew if I until there was a beautiful wall in front of you cuz I knew if I were to get one then it would cause this like you know this snowball effect of me just",
            "start": 1962.0
        },
        {
            "text": "over a decade I resisted because I knew if I until there was a beautiful wall in front of you cuz I knew if I were to get one then it would cause this like you know this snowball effect of me just collecting amiios and I knew that I couldn't get into that cuz it would be expensive. I don't have the space. I would become obsessed and it would become a problem. Wait, you have one amiibo? I would have to get multiple. Yeah, I got one. It's like getting like eating one lace ship. You know what I mean? So, like here they they showed off the amiibo wall and they talked about how they had everything, right? Like, oh, we got the rare ones, we got Sora, we got Cloud, we got all this stuff. And I looked at the amiibo wall and I was like, well, the amiibo era is like it's past, right? Like that was the Wii U era, that was Switch era. Like, we're getting into the Switch 2. Like, amiios aren't really a thing anymore. So, I can I'll allow myself to get one amibo amiibo. So, like I got uh the Mario",
            "start": 1999.48
        },
        {
            "text": "the Wii U era, that was Switch era. Like, we're getting into the Switch 2. Like, amiios aren't really a thing anymore. So, I can I'll allow myself to get one amibo amiibo. So, like I got uh the Mario one cuz of course old reliable. Um, Smash Bros. Mario. Smash Bros. And apparently that's very rare. Yeah. Is it really? Jake Decker was being like, \"Yeah, that one is very kind of not easy to come by.\" And I love it cuz Smash Bros. Mario is is a different Mario. You know what I mean? He's more badass. He has a little bit more. Yeah. Ex Yeah. He's rocking that. He's out for revenge, you know? Yeah. Um but then I was like, well, I got Mario and I started thinking about like, well, you know, it's not fair if I get Mario if I don't get Sonic. Yeah. Cuz Mario and Sonic are my two like favorite platformers. Yeah. And so, and I also figured there was something special about the fact that you have a Nintendo manufactured Sonic thing, right? It's a collector's item. It's a collector's item. Like,",
            "start": 2041.04
        },
        {
            "text": "Yeah. And so, and I also figured there was something special about the fact that you have a Nintendo manufactured Sonic thing, right? It's a collector's item. It's a collector's item. Like, it's really cool. It's really It's really dope. Boy, math. And in thinking about that, I was like, well, there's a third platformer. There's a third platformer that I love. Um, and that's Donkey Kong. And I didn't get Donkey Kong. I did get Diddy Kong, though. I got Diddy. Why? Uh, because he's a rare rare like original character. And so like for my love for rare, I was like, \"Well, I could get Donkey Kong, but I could also get Diddy.\" So I decided to get Diddy. Also, like we have to save him. The eraser of Diddy Kong. Okay. I don't know how much longer we have Diddy Kong for. They did have Diddy Kong stuff in the store. Mhm. But like, how long are we? We're taking it back. We have We have to We have to reclaim it. And so those are the three that I got. But then I started thinking more and I was",
            "start": 2080.88
        },
        {
            "text": "stuff in the store. Mhm. But like, how long are we? We're taking it back. We have We have to We have to reclaim it. And so those are the three that I got. But then I started thinking more and I was like, well, my favorite game of all time is is Breath of the Wild/Tears of the Kingdom. And so like be rude not to. I got three of my favorite platformers. So I was like, [ __ ] it. Let me get this [ __ ] I want some tears of the kingdom. I am so proud of you for this. And I think you're so freaking funny because I see bless on the top floor, which is not where the amiios are. So he has already thought about this. Grabbed a couple and he's not holding ones that are on this table. I'll tell you that right now. He was he was holding Sora and he was holding Sonic and he looked at me and he was just like Tim do should I do I need to do this? They said it's rare and I'm like they're trying to get us but maybe like it had that whole feel right. I was holding Sora cuz a Sora amiibo is like the",
            "start": 2123.12
        },
        {
            "text": "just like Tim do should I do I need to do this? They said it's rare and I'm like they're trying to get us but maybe like it had that whole feel right. I was holding Sora cuz a Sora amiibo is like the coolest thing ever. But also it didn't feel right for me cuz I was like well I played I love Kingdom Hearts 1 but I didn't play the other Kingdom Hearts games. I'm not like a diehard Kingdom Hearts fan by any means. Uh I think I was there for the rarity of it and I was like I got to put this back. And it was in putting it back that I was like, \"Ah, but I do love Mario and I do love Mario.\" It was incredible because yeah, I was getting my Game and Watch one and you were right next to me and you were picking it up. I saw that moment with the Sora and you put it back and I was like, \"Well, I guess he's not getting an amiibo.\" And now you have four. I plan to maybe get two. Um, but I did get a few other things. Uh, none of the other things I got for about amiibo. I did get I I got one of each",
            "start": 2165.2
        },
        {
            "text": "he's not getting an amiibo.\" And now you have four. I plan to maybe get two. Um, but I did get a few other things. Uh, none of the other things I got for about amiibo. I did get I I got one of each amiibo they had. No, I got uh the Animal Crossing some of the Animal Crossing stuff as well for friends that I have that love Animal Crossing. And so uh mainly stationary stuff. I got an Animal Crossing uh journal. It has Tom Nook all over it. Um I got some stickers for some stationary people in my life. And then also got uh one of those little pens that has like multiple colors that you can use. Um and then I also got the two coins, the two collectible coins. Um one of them is Zelda. And the other one What Zelda is it? I mean, it's like Ocarina Link. Sorry. Yeah, it's Link specifically, I should say. So, it's Link in the green tunic. Um, and then, yeah, the other one is one of the Squid Kids from Splatoon. And so, if anyone wants to trade, I'm not a Splatoon guy. What was your damage? What",
            "start": 2200.56
        },
        {
            "text": "say. So, it's Link in the green tunic. Um, and then, yeah, the other one is one of the Squid Kids from Splatoon. And so, if anyone wants to trade, I'm not a Splatoon guy. What was your damage? What was What are we looking at in terms of the bill here? Oh, you got a Zelda receipt. Nice. Yeah, Zelda receipt. Oh, that's the other thing, too. Yeah, the the receipts are what indicate what uh coin you get. Oh, $89 overall. Okay. Okay. Yeah. Yeah. Yeah. Splatoon Ghostbusters 2 came out. Yeah. What about you, Mr. Two Bags? I I I Here's what you all need to know. I'm going to say something I've never ever said, period. Let alone on content. All right. Terrifying. Today was a day I regretted being married to Jen. Cuz if I was single, I'll tell you right now, I wouldn't have any kind of dishwear. And I would have just bought all the Animal Crossing [ __ ] I would have come home with the the casserole dish, the little cheese dish, the thing. But I'm sitting there like looking I'm like I cannot I",
            "start": 2246.08
        },
        {
            "text": "I would have just bought all the Animal Crossing [ __ ] I would have come home with the the casserole dish, the little cheese dish, the thing. But I'm sitting there like looking I'm like I cannot I was going through to that Animal Crossing section where as soon as they were like, \"All right, that's the end of the tour. You can go shop now.\" I went straight up there. I was the only person there. There was one other p like worker there. And she saw me go aisle by aisle, pick things up, put it down, come back, pick it back up. Like I don't wear hoodies that much anymore, though. I I wear crew necks, but they only have this one crew neck, but it's a pajama. And then over there, they got a crew neck, but I pulled it off and and it was a crop top. I'm like, damn, these female Animal Crossings ruined my life. All right, give me the full goddamn sweatshirt. You know what I mean? Same thing. There was a few other things. I was Oh god. Again, shout out to all the women buying merch and letting",
            "start": 2292.0
        },
        {
            "text": "my life. All right, give me the full goddamn sweatshirt. You know what I mean? Same thing. There was a few other things. I was Oh god. Again, shout out to all the women buying merch and letting your freak flag fly. You know, I would like to as well. And I'm so in the market for a new wallet. And they had one. So many wallets, dude. They had so many wallet. So many. Yes. So many boy wallets for the boy games. And Animal Crossing only had a Tom Nook girl wallet. And I say it's a girl wallet cuz it has the snap in it. And it's clearly meant to go in a purse and it doesn't have a pocket for money. Like it's got credit cards and IDs. Give me give me a real Tom Nook wallet. God damn it. A trifold. Give me a billfold. I swear they had one, but I think it had like just like a villager face on it. It was kind of like a weird little like square wallet. It wasn't as good. I sure I looked around. All right. I I was looking at those Zelda wallets for a hot minute. Yeah. And I had I decided against",
            "start": 2325.6
        },
        {
            "text": "It was kind of like a weird little like square wallet. It wasn't as good. I sure I looked around. All right. I I was looking at those Zelda wallets for a hot minute. Yeah. And I had I decided against it. I was like, \"Yeah, they they had the Zelda wallet. They had the Mario wallets. They had lots of wallets.\" Oh, I missed the Mario wallet. Yeah. I kept feeling like everything was boy wallets. Yeah. Yeah. I was walking around being like, \"Oh, they're all the like thick trifold boy wallet.\" This is what I want, man. You know what I mean? I also had brought such a good wallet that I couldn't possibly I was walking around making everyone look at my Nintendo DS wallet. I did see you show that off to a lot of people. I really wouldn't stop letting people look at it. So, uh, I said, \"You know what? I'll make my own fate. I'll make my own.\" Oh, Jesus. Oh, no. [ __ ] Jesus. The noisy [ __ ] entrance. I'm I'm not mad at it. Bought me this t-shirt and I wanted a different t-shirt and now my day",
            "start": 2363.84
        },
        {
            "text": "I'll make my own fate. I'll make my own.\" Oh, Jesus. Oh, no. [ __ ] Jesus. The noisy [ __ ] entrance. I'm I'm not mad at it. Bought me this t-shirt and I wanted a different t-shirt and now my day is ruined. It looks good, man. It hurt. It hurt my feelings. What do you like about this t-shirt? Explain it. Explain it. Pick me shirt. It's what you wanted. So, for our audio listeners out there, I wrote Roger last week. I said, I wasn't invited to the Nintendo grand opening, so can you do me a favor? It would mean a lot to me. And he said, \"What, Mike?\" I said, \"There's a Pikmin t-shirt that's exclusive to Japan. They're bringing it to the store. I really want it in a large. I would like to work out and lose weight this summer. it would mean to me a lot to have this as my end goal, my celebration shirt. And he said, \"Mike, anything for you?\" Okay, we just worked so hard this weekend together. On Tuesday, I woke up and I said, \"Roger, I don't want to bother you, but don't forget about the",
            "start": 2398.0
        },
        {
            "text": "shirt. And he said, \"Mike, anything for you?\" Okay, we just worked so hard this weekend together. On Tuesday, I woke up and I said, \"Roger, I don't want to bother you, but don't forget about the t-shirt.\" And he wrote back, \"Yes, sir.\" Sage came into the office. Blessing came back. They're smiling with the Nintendo bags, and I could feel it, Tim. I was like, \"Oh, I might get the t-shirt.\" And Roger walked up to me and he said, \"Well, Mike, me and Andy made an executive decision and we thought this t-shirt's better than the one you wanted.\" And this t-shirt is a lime green key lime pie Pikmin t-shirt that I did not ask for and I'm not happy about it. But look, they're carrying away the pocket. They're carrying the pocket. It's adorable. That's how you adorable. What is the one you want? Look. Hey guys, you you want to see the one that he wanted? Yeah. Yeah. Stop looking at it. And everybody, let's just judge and see if Mike would have worn this one. There's no way this man would have",
            "start": 2444.88
        },
        {
            "text": "Hey guys, you you want to see the one that he wanted? Yeah. Yeah. Stop looking at it. And everybody, let's just judge and see if Mike would have worn this one. There's no way this man would have worn anything with a collar. I wore this color. There's no [ __ ] way. I cannot imagine. No, he would never wear it. No way. The laugh for me is the the gap between these two items. So, I just wanted to show you the t-shirt I received. I still love Roger, but you know. But what made Hey, uh what made you do that? Oh. Uh so what happened was is that uh he sent me that Jesus Christ. I love how hard you're pushing the gut out. I'm not saying I got to be more than Dr. Robotnik. Yeah. Uh your dad 15 beers in on Memorial Day. This was the only shirt that they like publicly said that they had at the store. So when we got there, I was like, \"Oh, he doesn't know like the like the other shirts that they had.\" So this one seems like something more that he would wear. And then I looked at Andy. I was",
            "start": 2491.36
        },
        {
            "text": "store. So when we got there, I was like, \"Oh, he doesn't know like the like the other shirts that they had.\" So this one seems like something more that he would wear. And then I looked at Andy. I was like, \"Hey, listen. This is the one he he said he wanted. We got to we can't.\" Right. So he doesn't know what he wants. I know what he wants. Exactly. Exactly. And at the time, uh, he didn't have like a a cell phone or you didn't have like a Yeah. It's a silence. Yeah. He's also He wasn't doing a show. You know what I mean? Possibly. Yeah. Yeah. We didn't have the technology to like tech. Well, no. I'm actually blocked on actually is blocked. Yeah. Yeah. He actually blocked me on his phone. Yeah. So, okay. Well, then you get what we get. In that case, sure. Otherwise, I'd be like, you should have texted me. I don't think there are good choices either way. But the long sleeve, I was like, I he will never wear that. Like, I lost it in my C. And he might wear it as a way to like spite us and",
            "start": 2545.12
        },
        {
            "text": "texted me. I don't think there are good choices either way. But the long sleeve, I was like, I he will never wear that. Like, I lost it in my C. And he might wear it as a way to like spite us and say like no I am going to wear it you know like in you know just like overall Mondays and wearing his Timberlands and like he does stuff to prove us wrong but like that shirt I just like it never looks like something that he would ever rock. Yesterday we went to go see a movie. A lot of us were there and we all came in at different times. Mike came very late and Mike just walks in the way he w the way he just walked on the stage here. Honestly, lot way more power and volume than there should be. It looks like a child walking into a kitchen cuz he's hungry. All my Yeah, exactly. And he walks dramatically and sits dead center in the front row. Okay. Oh. And um he was wearing what we now call his travel outfit, which is a fullon Nike tracksuit. And Gia literally, I love her to death. I can't",
            "start": 2586.24
        },
        {
            "text": "and sits dead center in the front row. Okay. Oh. And um he was wearing what we now call his travel outfit, which is a fullon Nike tracksuit. And Gia literally, I love her to death. I can't believe this was her actual reaction. She goes, \"What the [ __ ] Mike doing? why is he wearing that? And she was like pissed at it. And I'm like, dude, it's his travel outfit. He's not traveling. And I'm just like, it's Mike, man. It's just just let it go. Just let it go. But like Mike is just such a beautiful Yeah. Many months ago, we were at an airport and he saw a family just like dressed in clothes. He's like, see, look at that. They're they're they're dressed for travel. Like they're they're comfortable. They're getting And I was like, they're they're just wearing a jack. That guy's got a jacket on my I don't know what you're talking about. So like I don't know. He's just in a full head to toe red and black Chicago 90s Chicago Bulls tracksuit. Loud as hell. God bless him. God bless him. Great.",
            "start": 2633.04
        },
        {
            "text": "my I don't know what you're talking about. So like I don't know. He's just in a full head to toe red and black Chicago 90s Chicago Bulls tracksuit. Loud as hell. God bless him. God bless him. Great. I sat down next to him so loud. So yeah. Uh I spent a lot of money in the Animal Crossing section. That's where I spent my money. Uh I was very adamant that they needed a crew neck switch. They had the Nook Inc. uh hoodie and I thought about it for a while and I talked myself out of it. I was like it's they had uh the Roost hoodie as well and I was like h not vibing with that. What I was vibing with and as soon as we got the tour was this sweatshirt and I was like that's the one and I walked over there and sure as [ __ ] they're trying to sell us a pajama set and I said I'll decide what pajamas are. So, I bought the pajama set. You'll see me wear it on kind of funny quite often, but I got this just adorable. Oh, that's good. Just an adorable, right? It's a thinner material than your",
            "start": 2679.68
        },
        {
            "text": "pajamas are. So, I bought the pajama set. You'll see me wear it on kind of funny quite often, but I got this just adorable. Oh, that's good. Just an adorable, right? It's a thinner material than your traditional crew neck, but it's got the Animal Crossing. Everyday is a new day all over it. Like we're talking about that style. Thankful for every breath I take. POD and like right there, I knew something was wrong when I picked it up and I looked at the price tag and it said $40. And I was like, \"$40 for a sweatshirt and pajama pants?\" Oh no. That's when I was like, \"Oh, they got pajama pants in there, too.\" And I'll say Greg's about to pull a mic and he's going to wear the matching stuff. The pajama pants. The pajama pants will stay at home. Is there anything on the pajamas? No, that's what I was thinking, too. This is my first time because they were hungry. August got a little Animal Crossing. Every day is a new day. Okay. But plain pants. That's how you They're on my boat. I didn't",
            "start": 2721.28
        },
        {
            "text": "I was thinking, too. This is my first time because they were hungry. August got a little Animal Crossing. Every day is a new day. Okay. But plain pants. That's how you They're on my boat. I didn't even know that was an Animal Crossing slogan. I had no like It's not. Oh, okay. I was going to ask. I know. That's why I was so surprised when I saw it. I was like, \"What a cute thing to put with it.\" But it's not typically on like It's not on their new branding. Yeah. But it's cute. I like it. Then it was the I the I'm picking stuff up, I'm putting stuff down. You know what I mean? A lot of picking up, a lot of putting down, a lot of debating. Can I go I don't need the stuffed animal of Tom Nook. I don't need Timmy and Tommy. I'm picking them up. Ben is into stuffed animals. We've gone into a stuffy phase, but he's particular. And I'm like, I can't force Tom Nook on him. You know what I mean? I can't He's But what can you force on him? There's nothing to force on him. A [ __ ] [ __ ] God",
            "start": 2759.92
        },
        {
            "text": "stuffy phase, but he's particular. And I'm like, I can't force Tom Nook on him. You know what I mean? I can't He's But what can you force on him? There's nothing to force on him. A [ __ ] [ __ ] God damn it. [ __ ] What were you thinking with this shirt? I like it on. Did you see the other options? I like the crooked pocket holding it up. Yeah, that actually looks like the detail. The pocket actually crooked. This looks like when your kid makes something and you got to pretend to like it. That is accurate. That's what Mike's clothes. That's also play. Did you see what he wore yesterday? So, what else could I force on him? Uh, right. And what what does he like from Nintendo already? And yada yada. There was a lot of stuff there. And so just this week, I had noticed his uh his uh lunchbox came back and they had had a a water slide day outside or whatever and they had taken his underwear or shorts or whatever when they were wet and put them in the front pocket of his lunch box and then",
            "start": 2792.88
        },
        {
            "text": "came back and they had had a a water slide day outside or whatever and they had taken his underwear or shorts or whatever when they were wet and put them in the front pocket of his lunch box and then Jen left the lunch box in her car. And so when I pulled it out and then I went to clean it, it had molded inside. So I was like, that's this lunch box. That lunch box is trash. But they had an adorable Animal Crossing New Horizon lunch box. Oh, so I got this for Ben to take to school where hopefully he'll fall in love with his nookies here and his teachers who are cool teachers and play video games. I'm sure like, oh Ben, you like Animal Crossing. And he'll be like, I have no idea what the [ __ ] you're saying, but I appreciate that. He'll be like, I watched Captain America the other day. Um, and then I was like, well, what does he like? What do we know? What's he excited for? The Switch 2. The big man. This is what I was leading. You talking about the stuffed animal, but this guy, we got",
            "start": 2836.88
        },
        {
            "text": "and then I was like, well, what does he like? What do we know? What's he excited for? The Switch 2. The big man. This is what I was leading. You talking about the stuffed animal, but this guy, we got to teach him, right? We got a really nice Donkey Kong plushy here. Again, I think affordably priced at 20 bucks for the quality of him. How feel soft that is, dude. That brings me back. I think I also had a Don Kong plushy as a kid. That look exactly like that. Is this a redesign? No, man. No, his there's no dark. There's no black on there. Give me a Sharpie. We'll get that done. We'll have them ready to go. So, I picked that up for Ben. Uh, those two things. And then I I walked back to Animal Crossing for like the fourth time and it was like, what can I do here that I don't need another water bottle? I don't need any of this stuff. You bought the thing for the bit. As everyone knows, if you watch shows here, I enjoy beverages and I enjoy coffee. And I was like, well, of course, there's",
            "start": 2870.64
        },
        {
            "text": "bottle? I don't need any of this stuff. You bought the thing for the bit. As everyone knows, if you watch shows here, I enjoy beverages and I enjoy coffee. And I was like, well, of course, there's the Roost and there's Brewster. And so, I bought uh the Brewster cup and saucer. They have a very nice uh ceramic cup and saucer there. And so, my thought was, I will grab that. And then, as Barrett knows, cuz he always has to toss me a second coaster, I won't need a second coaster. I'll just bring my coffee out every morning on a little salt. So, yeah. See, that wasn't it wasn't like anything was Got to be real. This this little dude Brewster prominently featured at the Nintendo. I was really surprised how much Brewster there was cuz they also had like a little grinder like a little coffee grinder. See, and that's a nice little ceramic dish to begin with. I'm stepping it up around here. And you know, me and Nick are always talking about wanting like the diner coffee setup. Anyway, so you're",
            "start": 2906.8
        },
        {
            "text": "See, and that's a nice little ceramic dish to begin with. I'm stepping it up around here. And you know, me and Nick are always talking about wanting like the diner coffee setup. Anyway, so you're keeping that out here? I kind of live that, huh? You're keeping that out here for when you come to Are you I'm going to drink it. I mean, I'm going to keep it at work and then I'll make my coffee in the morning and then I'll walk out here with my little thing and I'll put it down and you'll see me on Games Daily with my nice little Brewster coffee having my little Rooster coffee. Thank you very much. Thank you for being supportive. Honestly, that clashes with the studio. How about you go buy another goddamn amiibo? How about that on that one? Get a booster amiibo. And so then, yeah, I got the Zelda uh little guy uh coin and then I got an Animal Crossing coin as well. And then my total on my Animal Crossing bill uh was 114. Okay, that's not bad. That's a fair amount of stuff. I am heartbroken",
            "start": 2951.96
        },
        {
            "text": "uh little guy uh coin and then I got an Animal Crossing coin as well. And then my total on my Animal Crossing bill uh was 114. Okay, that's not bad. That's a fair amount of stuff. I am heartbroken because one of the things I mentioned at the top was you can scan your my Nintendo there and get points and then get a sticker for your passport or whatever. They had all the stickers laid out and they had two Animal Crossing ones. Yeah. Yeah. And I was like, \"Oo, let me get the one with Tom Nook on it or whatever.\" And they said, \"Thank you.\" And then I put it in my pocket and I thought my wallet, but I can't find it. So, I think it came out of my pocket. Maybe when we went to the valet or something, I lost it. I think you got good stuff. I almost bought the lunch box and then I remembered I don't have anywhere to take a lunch box. I was like, I don't know what I would do. Serendipitous because of the moldy underwear or whatever it was. You know what I mean? Now I got to You have valet",
            "start": 2986.16
        },
        {
            "text": "I don't have anywhere to take a lunch box. I was like, I don't know what I would do. Serendipitous because of the moldy underwear or whatever it was. You know what I mean? Now I got to You have valet service for the Nintendo store? Yeah. If you read the emails, I was just like, damn, that's that feels fancy. Andy Cortez. So many of the like bento boxes, too. Chachkis are, you know, that's the perfect word. I, you know, Carboni and I, we're in sync with the little things that we like. And the like I I love keychains. I got um boss keychain from the Zelda side of stuff. I got a little journal cuz I love I want to be sketching and writing more stuff. And a lot of the journals that I have, I don't love because they uh like, bless their heart, Bethesda gave us one for Doom and it's it's like really it looks like the Necronomicon or like it just looks really like Yeah. So like this one is like a bit more chill, but it is the map of Hyrule on the outside. And um I wish they had cooler pens.",
            "start": 3026.8
        },
        {
            "text": "it looks like the Necronomicon or like it just looks really like Yeah. So like this one is like a bit more chill, but it is the map of Hyrule on the outside. And um I wish they had cooler pens. They had a a Zelda themed pen, but it wasn't Zelda. It was a weird thing where it was like I like the colors, but it wasn't Zelda themed enough. Yeah. I don't know. It was just kind of odd. So, um I didn't get a pen, but yeah, I just want to like write down notes for events and just kind of sketch down stuff here or whatever. Um I got I'm pulling it off everyone. We need to wash and shrink on the collar, but it'll be fun. Um and I got a uh several different um like pins and keychains Zelda themed. Um Sage brings up a point that I kind of agree with. I love when the merch you buy is like an inworld type deal. And one of the pins I got looks it's a heart piece. It just looks really really damn cool. Um but the other smaller things I got um a lot of them are kind of just left at home. I got a",
            "start": 3080.0
        },
        {
            "text": "type deal. And one of the pins I got looks it's a heart piece. It just looks really really damn cool. Um but the other smaller things I got um a lot of them are kind of just left at home. I got a little Bulbasaur plushy but the coins I got. Were you laughing at the drugs in his bag too? You can tell you're about to go on a drug. Got my Lex Pro. Right. Exactly. One's Animal Crossing and one's Zelda. Yeah. I got I got Link and I got um I got Animal Crossing. Bless. What's up? I may be willing to trade one an Animal Crossing for your Sure. Pass it down. Take one pass. Big trade. I don't want any. They also have the date on the back. Resell's going to go out the toilet on this one. They had a lot of cool Splatoon [ __ ] that I was really wanting to get, but man, the the amiibo were so I mean, they're so tempting. And I just again one would have much like blessing one would have turned into six because I wanted uh so many of the different ones that I rarely get to see out at Best Buys or",
            "start": 3127.88
        },
        {
            "text": "they're so tempting. And I just again one would have much like blessing one would have turned into six because I wanted uh so many of the different ones that I rarely get to see out at Best Buys or whatever whenever I am kind of shopping. If they had a Smash Brothers specific Donkey Kong amiibo, I would have had five. They had a DK. No, it was just Donkey Well, at the store they had they do make one though. Every Smash character has Don't do this. Don't have this kid on Amazon tonight. We saw how the magic obsession went. Don't you do they still make games with amiibo functionality? Yes. A [ __ ] Yeah, a lot of them. Like Nintendo games usually do. I mean, even the Street Fighter 6 is going to There's a They're putting out amiibo. The Ryu and um Ken amiios from Smash are going to get you stuff. And the uh they put out a card. You cannot tell me this. A deck of cards. Go on. Like uh it's real talk. It's a deck of like there's a card for each of the characters in Street Fighter 6. And",
            "start": 3180.08
        },
        {
            "text": "stuff. And the uh they put out a card. You cannot tell me this. A deck of cards. Go on. Like uh it's real talk. It's a deck of like there's a card for each of the characters in Street Fighter 6. And they're amiibo cards. The amiibo cards are nice. They're not as fun as the figures, but it's nice that you can get the thing without having to like, well, now what do I do with this figure? Yeah. I real talk bless when I was pre-ordering the Switch, too, cuz I got the Nintendo like official like, you've been invited. Like, buy this [ __ ] They had a list of all the things to buy. And I saw the Street Fighter 6 cards. I'm like, there is nothing I need less than this. I'm not playing Street Fighter 6, but I ended up not getting them. But I was close. We need more keychains. I I That's my biggest thing. When I went to the Pokemon store in Osaka, not enough like large size keychains. They were they would sell these little trinkets that are the tiniest little things that are like not even",
            "start": 3227.2
        },
        {
            "text": "thing. When I went to the Pokemon store in Osaka, not enough like large size keychains. They were they would sell these little trinkets that are the tiniest little things that are like not even visible, but it'd be like here's Pikachu and it looks like a Claire's earring or something like I I want They had earrings there, too. Like I Yeah, they did. Yeah, they had a bunch of earrings. Lucy James bought uh earrings that were um the Yeah, those little [ __ ] uh Coxes and but they kind of hide behind your earlobes. Super cute. So, there was a multiple Zelda sections cuz it's a big franchise. Um, and there was like a whole kind of like art section and then there was one that was a little bit more like, hey, here's like jewelry and stuff and a little more like premium stuff which I thought was really cool. Um, but there's a whole Corax hiding on your outfits and stuff. I'm like, that's so smart. Like that's a that's a great I think kind of bridge between like the pastel Animal Crossing",
            "start": 3263.28
        },
        {
            "text": "was really cool. Um, but there's a whole Corax hiding on your outfits and stuff. I'm like, that's so smart. Like that's a that's a great I think kind of bridge between like the pastel Animal Crossing stuff and the more adult thing, but it's kind of in the middle there. Yeah, there we go. Super cool stuff. Uh they also had the section uh with the little surprise like hey listen I was just like man I will never wear that shirt. It's such a plain design shirt but it's so funny that it says hey listen great like I love that it was just a black shirt literally just said hey listen glow in the dark too right he held it up and when during the tour he held it up and said I do want to shout out the Nintendo workers there cuz like you could tell that like I think some of them well they're all stoked. Some of them were nervous cuz they're like all right our first customer is like and we want to be very hospitable and like friendly and stuff. So, it was very cool to like, you know, have them come",
            "start": 3303.2
        },
        {
            "text": "Some of them were nervous cuz they're like all right our first customer is like and we want to be very hospitable and like friendly and stuff. So, it was very cool to like, you know, have them come up and be like I I was looking at the Zelda stuff and one of them came up and they were like like, \"Oh, I see you got your ears pierced. Like, you see the earrings and I'm like that's good customer service.\" They were great. Could you imagine like we get here at Blessed Wear Coral? Honestly, I considered it. I was like, \"Ah, it's too much for me.\" But they were good. They looked like actual jewelry and again not like the like, \"Oh, I got this at like a stand in the mall of like a big Cororac.\" They had some little puzzle things that are almost like brain training games or whatever where make the master sword. Yeah. Like try to unlock it from this thing, but you have to move the different little pieces of it. But I almost bought that just cuz it looked like a little statue for the Master",
            "start": 3340.88
        },
        {
            "text": "the master sword. Yeah. Like try to unlock it from this thing, but you have to move the different little pieces of it. But I almost bought that just cuz it looked like a little statue for the Master Sword. I was like, I don't really care about this game. It looks like here's the Triforce with the sword in it. It's a cool little statue to put up on your computer on your desk or whatever. A lot of cool little [ __ ] like that. the damage. Um, oh, so the funniest thing is I I think it was both Sage and Lucy that were like, \"Wow, this this is really affordable. Like, this is like shockingly not super expensive.\" Yeah. And so when I got up to the front desk, I was like, \"I hope I hit the $50 limit.\" And they were like, \"Oh, yeah, you're going to wait. You're going to pass by.\" It was like 80 bucks or something like that. But, um, I think especially because it was like I was buying a lot of little things and all that [ __ ] added up because all those little things were $8, $7, you know. Um,",
            "start": 3381.84
        },
        {
            "text": "or something like that. But, um, I think especially because it was like I was buying a lot of little things and all that [ __ ] added up because all those little things were $8, $7, you know. Um, yeah. So, I ended up uh I also got this really I mentioned it earlier, but super cute little Bulbasaur plushy. The tiny like not a big stuffed animal, but it's adorable. So cute. It was cute. It was good. Yeah. Timmy, what'd you get? I I did not go too hard. similar to Sage. I'm not a big merch guy and I'm very particular about I'm a big collector guy, but like I'm not a big like I I want to wear all the merch and the backpacks and all that stuff. Um, but there are certain things that I do do really appreciate. And like the like I was there type stuff I'm a big fan of. So like in here is a t-shirt of just this logo, the Nintendo San Francisco. I'm like that was the one thing when I saw it. I'm like I know I'm going to buy that. I'm Nintendo. I'm San Francisco. This is it's red. Not",
            "start": 3418.72
        },
        {
            "text": "a t-shirt of just this logo, the Nintendo San Francisco. I'm like that was the one thing when I saw it. I'm like I know I'm going to buy that. I'm Nintendo. I'm San Francisco. This is it's red. Not necessarily my thing, but I'm like I got some Jordans that match this. We'll make it work, right? Um the bread 11 spread for us. It's going to be fun. But um I was convinced this was going to be all that I was going to buy. Yeah. You walked in and pointed out immediately and I was like, \"This is it. This is going to be this is this is all for me.\" Um cuz like I've seen all this stuff before. And I got got not too hard, but harder than I'd expect to. One thing, this isn't for me. I don't even count this. But I did get this for Ben. Uh cuz I know he loves Hot Wheels, but also I'm on Bless's side here. We can't stand for this Diddy eraser. So, we have to make sure. I feel like we have to add the Kong. This is important. Always say the Kong. We need We need the Kong. We need the Kong. He's on a",
            "start": 3462.0
        },
        {
            "text": "We can't stand for this Diddy eraser. So, we have to make sure. I feel like we have to add the Kong. This is important. Always say the Kong. We need We need the Kong. We need the Kong. He's on a conquest. We're here for it. I just saw a live report earlier today about a freak about the freaks. The the what are they called? The the freak parties. Freakoffs. Freakoffs. Yeah, freakoffs. There we go. The freak offs. Earlier today, you saw that? Yeah. It's like a live there's live like there's no way there's new. You know what? Like it's happening right now. It's explicitly clear. There's a bad Diddy and there's a good Diddy Kong and like that is where all this is. Okay. Um, but the other thing that I got that uh was kind of hidden, but I'm really really stoked on this one cuz this is very Tim Getty [ __ ] It is a a beautiful blue. Maybe my favorite color blue ever type stuff. It's got some green in there. Yeah, I love that. Right. Uh, for Mario Kart, it just has the a little blue shell.",
            "start": 3500.32
        },
        {
            "text": "Getty [ __ ] It is a a beautiful blue. Maybe my favorite color blue ever type stuff. It's got some green in there. Yeah, I love that. Right. Uh, for Mario Kart, it just has the a little blue shell. Um, but pretty subtle on the the chest there, but it is that nice little embroidered situation going on. So, I'm like, \"Okay, you're going to see me wear this a whole bunch.\" If I If I saw that, I would have got that. Yeah, it's good. Um, and then the coins. What I get? So, I got a little squid kid. So, that's fun. Uh, and then leaving, I got Mario, which I'm really excited about. I feel I feel like the Mario is like, \"All right, cool. I got the coin from the Nintendo.\" So, that's very cool. But, yeah, you guys were showing this off earlier a little bit, but like I'm not a big sticker guy. Like, like this little like cheap little stuff, like I don't really care at all. But for the kids, I think this is so cool that like that this this place has like scan your Nintendo account, get the",
            "start": 3539.84
        },
        {
            "text": "Like, like this little like cheap little stuff, like I don't really care at all. But for the kids, I think this is so cool that like that this this place has like scan your Nintendo account, get the things, like play the games, get like that stuff's so cool. And there was so many like fun interactive events here, but then also like at Nintendo World or like all the different Nintendo things they've been doing like they care about this more than just oh buy the video games, right? Buy all the other [ __ ] too is what they're saying. But um speaking of buying the video games, I didn't buy anything there, but I do want to say I loved their setup for all their physical games and like the Switch. There was a really cool um customize and design your own Switch situation where you can choose your Switch OLED and then choose what color JoyCons and what color Joycon rails uh you want and which dock you get and and which dock you get and uh you can order it and then get it day of at the store",
            "start": 3580.24
        },
        {
            "text": "Switch OLED and then choose what color JoyCons and what color Joycon rails uh you want and which dock you get and and which dock you get and uh you can order it and then get it day of at the store which I think is like just a very fun cool thing 100%. Um, and then yeah, in addition to that, they had like an amazing assortment of the physical Switch library, which like is getting harder and harder by the day to find any place that has these games. And like a lot of the, again, going back to the collector for me, like ordering Nintendo physical games is always a roll of the dice cuz you order it from Amazon. What condition is this box going to come in? Is it going to be the American version or is it going to be the Italian version? Like it's just been been getting harder and harder with Best Buy like literally not selling these things. Like GameStop going to [ __ ] hell. Like having a place that I can go to get to be able to actually look at the box itself. I'm like, \"Thank God this",
            "start": 3616.72
        },
        {
            "text": "Best Buy like literally not selling these things. Like GameStop going to [ __ ] hell. Like having a place that I can go to get to be able to actually look at the box itself. I'm like, \"Thank God this exists somewhere.\" Um, but yeah, shout out to them for that. Roger, did you buy anything? Oh, dude, I don't want to talk about the price tag of that. I bought so much [ __ ] Uh, I didn't expect myself to like actually buy anything. I thought maybe actually for myself, I didn't expect anything. I my uh fiance is a big into Animal Crossing, so I expected that to happen. So, I got uh my first ever amiibo. Um I got Game and Watch. Uh very excited about that. Very happy about that. Has like all the different Game and Watch like stands or whatever versions of him. Uh I got a Sora amiibo for her. Uh I got all these little like Animal Crossing stickers. They had like a nice little box of um pastel stickers that were really nice. I also bought a um uh the dodo bird um uh bomber jacket. Oh, you got",
            "start": 3656.56
        },
        {
            "text": "I got all these little like Animal Crossing stickers. They had like a nice little box of um pastel stickers that were really nice. I also bought a um uh the dodo bird um uh bomber jacket. Oh, you got that? Yeah, I got that. I talked myself out of that. I was holding it. I looked at Blessing and he was looking at it and I was like, \"There has to be one person in the office that has it. There can't be two. There can't be two.\" So, I got that. Uh, and then of course I got uh the stuff for Mike, which I will be vemoing him for. I don't care. I don't care if he doesn't like it or not. But, yeah. So, my total honestly was like 200 bucks. So, it was a lot, but I got a lot of stuff. Uh, there's a lot of stuff I'm missing, little small stuff. So, yeah, it was a it was a good experience for sure. Yeah. Any final thoughts on the store, you guys? I hope that in the future they have more like centralized Nintendo stuff. Like you can tell from this like I love this sweater. I love something that's",
            "start": 3695.92
        },
        {
            "text": "Any final thoughts on the store, you guys? I hope that in the future they have more like centralized Nintendo stuff. Like you can tell from this like I love this sweater. I love something that's like about the console itself. I'd love to see them do something that is more like hey I want stuff with like game boyss on it. Like I want cool classic Nintendo stuff. It totally makes sense to do like your current IP and all of that. But I'm like I want to get stuff with like a Game Boy on it. I want to feel that like the classic visual of Nintendo, of old school Nintendo, is such a cool look that I hope that they do things that aren't just here's the games IP, but cool general Nintendo merch in the future. Yeah, the Famicom design, the Super Famicom design just on a t-shirt. Like that would be all day. I'm such a nerd for that [ __ ] Yeah. And like same with like the homeware stuff. I think there could be a lot of cool things that they could do with that. Super pumped to see what the Switch",
            "start": 3731.28
        },
        {
            "text": "day. I'm such a nerd for that [ __ ] Yeah. And like same with like the homeware stuff. I think there could be a lot of cool things that they could do with that. Super pumped to see what the Switch 2 stuff become. Yeah, 100%. That's the big stuff. Yeah. And for me, the big thing was they have a giant like video wall. Uh there's like demo stations as well. We didn't talk about those. Giant amiibo wall is very very cool and impressive. I think people are going to be stoked about that even if you just look at them all because like it's incredibly impressive what amiibo's become since November 2014 or whatever it is. Like the fact that the Smash Brothers Ultimate roster turned into this almost 100 character cross uh game event, right? And then there's an amiibo for every single one of them. Like it's just kind of daunting to look at. Um, but yeah, there's this giant screen that Roger has pulled up now, um, that you can play demos on. But I'm sure like in the New York store, they're",
            "start": 3773.44
        },
        {
            "text": "Like it's just kind of daunting to look at. Um, but yeah, there's this giant screen that Roger has pulled up now, um, that you can play demos on. But I'm sure like in the New York store, they're probably going to eventually do live Nintendo Direct um, showings here and like having a big crowd of people freaking out over stuff like that sounds so damn awesome. Well, it's the same thing, too, of like, you know, I mean, there's two things I'm excited for in the more far-flung future, right? like in the next few years. I really do think with Switch 2 and Mario Kart World and yada yada yada, like the way I'm making that an event for Ben, I think Ben is going to be a Nintendo kid. So, getting to take him here for the first time when he really understands the properties a bit more. I think it'll be exciting. But even in the more short term, right, I'm excited to see what they do for Switch 2. That was one of the first questions anybody asked the tour guide when they opened up and he was",
            "start": 3810.56
        },
        {
            "text": "be exciting. But even in the more short term, right, I'm excited to see what they do for Switch 2. That was one of the first questions anybody asked the tour guide when they opened up and he was like, \"We we will have press releases eventually about like are they doing a midnight launch? Are they doing something?\" And that's something I'd be like, \"Oh man, we should go to that.\" Like we talked about how much we've missed that in the pre-order here, right? It'd be cool if they're doing something with all the stuff. Like, hell yeah. I'd like to pop down there and see what's up. People in costume, you know, like Yeah. If they if they had like some of the characters from the Universal uh, you know, theme park, whatever. Yeah. I want to see the little Toad. Well, awesome stuff, everybody. Let us know in the comments below if there's anything you saw here that you're like, I need to go to San Francisco to get and just what your thoughts are overall on the Nintendo store. Uh like I said, we",
            "start": 3847.04
        },
        {
            "text": "us know in the comments below if there's anything you saw here that you're like, I need to go to San Francisco to get and just what your thoughts are overall on the Nintendo store. Uh like I said, we have a great day of content. Stay tuned for the Nvidia stream of Doom: The Dark Ages with Nick and Andy. Sage, where can people find you? You can find me everywhere on the internet at not Sage or Pixel Circus. There you go. Until next time, I love you all. Goodbye.",
            "start": 3883.68
        }
    ]
}