{
    "id": 14132,
    "video_id": "i-Aj4UEEWrY",
    "show_name": "Highlights",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Andy Cortez"
    ],
    "title": "Andy Played Lies of P: Overture!",
    "description": "From KFGD: https://www.youtube.com/watch?v=ZD9gyc7T-cQ Go to https://bit.ly/m/KindaFunnyXSubwaySurfers?r=qr to get special rewards and download it now!\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\nFOLLOW US ON EVERYWHERE!\n---------------------------------------------------  \nYouTube: Youtube.com/KindaFunnyGames\nTwitch: https://www.twitch.tv/kindafunnygames\nPatreon: https://www.patreon.com/kindafunny/\nTwitter: https://twitter.com/KindaFunnyVids\nInstagram: https://www.instagram.com/kindafunnyvids/\nTikTok:  https://www.tiktok.com/@kindafunnygames?lang=en",
    "published_at": 1747945843,
    "duration": 1149,
    "transcript_chunks": [
        {
            "text": "And it's another one of those, you know, it's like imagine if this had happened before Ben. Yeah. Because then I'd be obsessed with it, but then I had to stop because I gotta play video games. Magic of the boy. Now, speaking of playing video games with the boy, let me tell you about my boy Andy Cortez. That's right. We sent Andy Cortez down to play a video game and now Andy's here to talk about it. Andy, this is this is the moment. Andy, my boy. You know Andy Cortez, he's he's everybody's boy. He's doing his thing out there. He's living the life out there. Oh man, yelled for I don't know. He came in and said, \"I'm here.\" And then he but then he's not here. You know what I mean? Like he's probably in there. There he is. Andy Cortez. Everybodyy Andy Andy Andy Andy. Hello Andy Cortez. There he is. It's Andy Cortez is here to say hey. Andy Cortez is here to say hey. Andy Cortez is here to say boom boom boom boom. Andy Cortez, we sent you down to lovely LA, Los Angeles to play the one, the",
            "start": 0.08
        },
        {
            "text": "is. It's Andy Cortez is here to say hey. Andy Cortez is here to say hey. Andy Cortez is here to say boom boom boom boom. Andy Cortez, we sent you down to lovely LA, Los Angeles to play the one, the only Lies of P DLC. Tell me all about it. Oh, you got a you got a notebook. Took some notes. Did they give you this notebook? No, the Zelda. Yeah. Yeah. Little drawings and doodles in there. Yeah. Oh. Oh, yeah. Dude, some weapons, things like that. It's the uh it's the map of Hy Roll on the other side. Really, really sick. Really, really happy about it. See it up close last time. Um it was uh Yeah, we went to LA. Me and Blessing, we got to go to the Lies of P DLC event, Overture, and they said, \"Here's the thing about Overture. 30 bucks.\" And they just moved on to tell us more stuff. Okay. And everybody in the room was like, \"What about the date?\" What? What about When's the date? Still no date. Oh, still no date. Still no date. Summer 2025. You think this is an SGF thing? I think it may be",
            "start": 46.64
        },
        {
            "text": "in the room was like, \"What about the date?\" What? What about When's the date? Still no date. Oh, still no date. Still no date. Summer 2025. You think this is an SGF thing? I think it may be a I think it may be a freaking like just random drop. Oh, really? I mean, that's just that's just a prediction. Could be you. I'll give you a chair. You keep talking cuz there's always B-roll. There's always B-roll. I want you to sit and be comfortable. No, dude. I'm Trust me, Greg. Stay. You stay right there. You stay right there. Put your keyster in there. I like your little tea. Got your little tea right there. Um, okay. So, Liza beat DLC. It is a little bit of a Dark Souls 1 sort of thing where you you go back in time and you something happens. You go back in time and you you awaken and your little homie Geminy Jiminy Kimy Jemin is like but Katzu didn't exist back Katzu's already destroyed. How is it put back in? And it's it's really really and you're like what where are we right now? Um but I",
            "start": 95.84
        },
        {
            "text": "homie Geminy Jiminy Kimy Jemin is like but Katzu didn't exist back Katzu's already destroyed. How is it put back in? And it's it's really really and you're like what where are we right now? Um but I think the setting for this first level is super cool and fascinating and creative cuz you're going through the Crot Zoo and it's you're just going through a zoo with different exhibits. Oh, that's pretty sick. And like, you know, here's like the here's where the gorillas may be and here's where the rhinos are, whatever. And yeah, it was a big collab. Uh, but you're seeing them all mutated and everything and you're fighting a lot of cool enemies uh out there. It was a the preview event was sort of split into two sections. You would sit down and say, \"All right, play the video game, play the DLC from this first level. just go explore, play it like you would play Liza P. And then the other people on the other side of the room, you are doing you're playing three bosses. Um I think the coolest",
            "start": 139.92
        },
        {
            "text": "from this first level. just go explore, play it like you would play Liza P. And then the other people on the other side of the room, you are doing you're playing three bosses. Um I think the coolest thing that they are introducing is difficulty modes. The standard mode will be I believe like difficulty two. There will be an easier difficulty below it and then they will go even more extreme if you want more of a challenge of the world. Well, for the challenge runners honestly cuz like I think the game's plenty hard as it is. But for the challenge runners, I think there's been such an awesome uh the true sickos out there. There's been a really awesome economy with like a lot of great speedrunners who play through a lot of bosses. Uh this is one of the um first bosses that you will encounter in the zoo. And um uh let me tell you, D. Yeah, I got you know I I beat this boss, ran through, got to the end of the level, went into another boss room, and nothing happened. And it was actually the",
            "start": 194.24
        },
        {
            "text": "in the zoo. And um uh let me tell you, D. Yeah, I got you know I I beat this boss, ran through, got to the end of the level, went into another boss room, and nothing happened. And it was actually the same boss room of another boss that we fought earlier on the other side of the room of the like in group one. I started off in group one where it's like you you just do the boss rushes. You play up to three bosses with five difficulty levels. You start, you know, it starts off at three and then you can, you know, maybe you want to see all the bosses, drop it to difficulty two, maybe down to one or whatever. I I didn't do that cuz I just I I lost track of time. And then by the time you were lost in the sauce as I was beating. How long did you have with it? Uh 1 hour on each side. So it was like 1 hour with the boss rush, 1 hour with the this sort of section that you're watching right now in the video where you're just kind of walking through Katzu. That weapon kicks so much ass. The pin",
            "start": 236.24
        },
        {
            "text": "1 hour with the boss rush, 1 hour with the this sort of section that you're watching right now in the video where you're just kind of walking through Katzu. That weapon kicks so much ass. The pin wheel weapon. It charges by running. So it gets stronger as you kind of start to sprint. On the top left corner you see like a little Roman number three. Right. Now, if you run a bit more, it sort of like speeds up and becomes a number four and gets stronger. It It rocked. The weapon choices are great. I wish we had more time with the exploration section of it cuz I think the thing one of the things that really sets Liza P apart from a lot of other Souls likes uh is not only that it it's real good but it uh the weapon experimentation because so much of Liza P is well I love the handle on this weapon and I love the stats but the blade isn't really what I'm looking for. let me disassemble this other weapon, take that blade, put it on this, and you you kind of like have a a lot of player agency",
            "start": 283.2
        },
        {
            "text": "and I love the stats but the blade isn't really what I'm looking for. let me disassemble this other weapon, take that blade, put it on this, and you you kind of like have a a lot of player agency there sort of creating the the weapon that you want. That's cool. And I love that about it. We weren't get there just wasn't enough time to sort of like look into the systems there cuz there's a lot of new weapons, a lot of cool looking things. Uh the pinball weapon like I mentioned earlier, I I did end up using a weapon that it's called a Laureni bolt blade and it's like a little stabbing kind of a like a long range little poker uh thing. But as I was running uh with the weapon, the creator, the lead director of the game walked behind me and was like, \"When you're running, hold right trigger.\" And so I'm running and I hold right trigger and get the [ __ ] out of my business. Let me play the game. And suddenly it boosts like crazy. This [ __ ] weapon like shoots out like fire from behind and",
            "start": 331.0
        },
        {
            "text": "so I'm running and I hold right trigger and get the [ __ ] out of my business. Let me play the game. And suddenly it boosts like crazy. This [ __ ] weapon like shoots out like fire from behind and I'm sprinting through the level like crazy fast. It was awesome. It was really, really damn cool. Um, and by the time I got to the end of the zoo level, I walked into what I thought would be a new boss arena and there was already a bonfire there as if the boss had been completed and they had to walk up to they were like, \"Um, you're the only one who's gotten this far.\" Godamny Cortez, everybody. To Hussein in the corner sucking his thumb. can't even [ __ ] play. They're like, \"Yeah, here it is right here.\" Uh, Barry, they were like, \"There's actually no more demo here. Uh, you're done.\" Wow. So, I was like, \"Fucking gamer.\" You know what I mean? But the uh the other three bosses on the other side of the room that you end up getting to fight are super fascinating and really cool and",
            "start": 379.6
        },
        {
            "text": "Wow. So, I was like, \"Fucking gamer.\" You know what I mean? But the uh the other three bosses on the other side of the room that you end up getting to fight are super fascinating and really cool and challenging. One of the first bosses you fight uh her name is like Mariona and she had a puppet that a puppet flying thing. I don't know if you saw it in the B-roll, Barrett, where um she she has it like on a leash and it kind of flies around and attacks you. When the leash is red, the puppet's attacking you. So, you know, like, oh, the le she turned the leash red. It's bright red with like red electricity. I got to defend against the puppet. And then it turns blue. You know, like, oh, now the puppet's going to back away and she's going to attack me now. So, the difficulty really started ramping up. It was really, really tough on the first difficulty. This episode is sponsored by Subway Surfers. The goated endless runner that carried me through middle school, high school, college, and now",
            "start": 416.88
        },
        {
            "text": "up. It was really, really tough on the first difficulty. This episode is sponsored by Subway Surfers. The goated endless runner that carried me through middle school, high school, college, and now adulthood, is celebrating their 13th birthday, which also marks their 200th World Tour update. And they're going big because Subway Surfers decided to travel to not one, not two, but 21 different locations in their 200th World Tour special event. It's kind of funny as Resident Zoomer, I can seriously say that I adore Subway Surfers. It's one of my favorite comfort games. Grabbing items, completing challenges, and pulling out a hoverboard right as I'm about to hit a train feels just as good now as it did when I was sitting in the back of Mr. Coburn's Spanish class. Play through all 21 destinations to unlock amazing rewards such as characters, hoverboards, and in-game currency. Just tap the 200th World Tour button on the screen to start playing. And exclusively for best friends, head over to",
            "start": 459.12
        },
        {
            "text": "to unlock amazing rewards such as characters, hoverboards, and in-game currency. Just tap the 200th World Tour button on the screen to start playing. And exclusively for best friends, head over to kind offunny.com/subways or scan the QR code on screen to get a ton of special in-game rewards. The update ends on June 1st, so scan that QR code, download Subway Surfers, and start running if you don't want to miss out on all the rewards. I already did. This episode is brought to you by Factor. When life gets busy, food can sometimes feel like a chore. And the fast food trips can go from a weekly to daily occurrence very, very fast. So, buck those trends and make this season your best with nutritious 2-minute meals from Factor. Eating well has never been this easy. Just heat up and enjoy, giving you more time to do what you want. With 45 weekly menu options, you can pick gourmet meals that fit your goals. Truce from Calorie Smart, Protein Plus, Keto, and more. We at Kind of Funny Love",
            "start": 502.24
        },
        {
            "text": "giving you more time to do what you want. With 45 weekly menu options, you can pick gourmet meals that fit your goals. Truce from Calorie Smart, Protein Plus, Keto, and more. We at Kind of Funny Love Factor Meals. Blessed Greg love it for a quick lunch in between shows, and I adore it as a healthier alternative instead of the dreaded hump day too tired to cook drive-thru run helping me to get on track with my goals. Get started at factormeals.com/kindafoney5050 off and use code kind of funny50 off to get 50% off plus free shipping on your first box. That's code kind of funny50 off at factormeals.com/kindfunny5050 off for 50% off plus free shipping. factormeals.comkindfunny50 off. Also, um, you know, to everybody at Neoiz at round eight, um, no back paddles. I gota I actually almost like I predicted why we shouldn't give ourselves to these things that won't always be there for us. Thank you. I predicted PS stars. Thank you. I did get an apology uh from um one of the PR people. He will",
            "start": 547.6
        },
        {
            "text": "predicted why we shouldn't give ourselves to these things that won't always be there for us. Thank you. I predicted PS stars. Thank you. I did get an apology uh from um one of the PR people. He will remain remain nameless cuz I don't want to Danny put his business out there. It's close. Let's call him Danny. Yeah. He was like, \"Sorry, no back paddles for you.\" I was like, \"Dang, it's unfortunate.\" You know what I mean? But, you know, I had to, you know, real gamers overcome. Um, you know, the real gamers tell their bodies, not today, regardless of how injured they are. Um the there there's some awesome new weapon arts with the game where um on your left arm as Pinocchio, you have these abilities that are kind of like um you can either shoot a rocket or you could grapple enemies towards you or you could grapple towards enemies or if you choose another arm, it will put a bomb in the ground and set off like a little proximity mine or whatever. There's a lot of different gadgetry you have",
            "start": 604.56
        },
        {
            "text": "or you could grapple towards enemies or if you choose another arm, it will put a bomb in the ground and set off like a little proximity mine or whatever. There's a lot of different gadgetry you have on your left sort of Oh, here's a little rocket boo. It's so cool. Oh man. Um, and the one that I really really dug is the one that's equipped right now. It's called Icorus. And it shoots blades that just kind of like they shoot out of the arm and they just rotate in a singular spot and they do a buttload of damage to enemies and it sounds great and the feedback is fantastic. Um, yeah, the boss fights were really super cool, super engaging. I got to the end of the second one right as I ran out of time. I didn't get to see the third boss, but I was like, \"Bless, fight the third boss first because I didn't get to it.\" Uh, and I probably should have the smarter way to do it was like, \"No, all the smarter players are like, let's drop down to difficulty one or two just to see all of them.\" You",
            "start": 649.2
        },
        {
            "text": "I didn't get to it.\" Uh, and I probably should have the smarter way to do it was like, \"No, all the smarter players are like, let's drop down to difficulty one or two just to see all of them.\" You know what I mean? The two notes here that I have questions about. Sure. Kangaroo and weird elephants. Yeah. Oh, the kangaroos. Well, it made me laugh a lot thinking about blessings. Yeah. Death Stranding like Death Stranding preview about killing kangaroos because you go into the kangaroo section, you just have these dudes that are just punching your [ __ ] head. Yeah, it was crazy. And you Yeah, like here they are. Here they are. Like they they they get aggressive. They roll at you. They punch the [ __ ] out of you. But yeah, the parries feel fantastic. It just I'm so glad that I had just restarted a second playthrough for Lizipe to kind of get that rhythm going and I I felt a lot better because of it. But it's just it still shows why they are the gold standard for if you want to make a",
            "start": 694.32
        },
        {
            "text": "a second playthrough for Lizipe to kind of get that rhythm going and I I felt a lot better because of it. But it's just it still shows why they are the gold standard for if you want to make a from soft style game but still put your own flavor on it. They are still the best to have done it and I think they're still the best doing it. This DLC looks to be shaping up to be really really awesome and I have it on my fantasy critic. So nice. Hopefully 85 okay is what I'm hoping for. Uh this is I think uh a question that I would hope that is just going to be as good as it was in the base game, but it is super chat here before you go. Tyler Wallace says, \"Hey Andy, how is the combat in the lives of PDLC? Is it just more the same? Feels as good. What what feels just as good?\" A lot of that depends on the weapons that you're using, but they also introduced a brand new bow and arrow, which is pretty awesome. uh reminds me of getting this new bow and arrow class in Elden Ring Night Rein when the",
            "start": 735.2
        },
        {
            "text": "on the weapons that you're using, but they also introduced a brand new bow and arrow, which is pretty awesome. uh reminds me of getting this new bow and arrow class in Elden Ring Night Rein when the they showed out that trailer a couple weeks ago where bow and arrows rarely feel good in in from software games and then seeing this trailer first drop with uh the Liz of P um Overture DLC and seeing him use an arrow it's like was that just a cut scene or is that something we can equip and you can equip a little bow um different cool weapon arts where you know the if you charge up your full power, then it does a even stronger thing. It'll shoot three bows or or or three arrows at that moment. Um, really really fun. Still awesome. They have a a weapon called the pale knight weapon. Uh, Tim, very Final Fantasy. It's a bolt gun. Yeah, it's a gun blade. Yeah, the gun blade was so freaking cool. Had all everything that you would want when it comes to like slash slash boom shoot. like it.",
            "start": 780.8
        },
        {
            "text": "very Final Fantasy. It's a bolt gun. Yeah, it's a gun blade. Yeah, the gun blade was so freaking cool. Had all everything that you would want when it comes to like slash slash boom shoot. like it. Really, really great movement, awesome enemy types, awesome level design, still all of the trappings that you would hope to get from a from software like game where you travel for 28 minutes and suddenly you see a door and you open it, it's like, \"Oh [ __ ] that's the first bonfire right on the other side of the door. Great level design. Um, I'm super super pumped and it looks freaking great.\" Again, this is still Unreal Engine 4. I think it's like 4.6 six or something and it runs amazingly great and it feels efficient, but it looks still really really damn good. Without spoiling like what it actually is, does this at all have to do with the end of the first game? No. Okay, that's what we're assuming is going to be sequel territory. Okay, that's like the next thing. Let's hop into other kind",
            "start": 828.56
        },
        {
            "text": "is, does this at all have to do with the end of the first game? No. Okay, that's what we're assuming is going to be sequel territory. Okay, that's like the next thing. Let's hop into other kind of a open I I always [ __ ] this word up. Open s open domain free domain. What what's it called? Oh, where IP public domain. Yeah. Where the IP is just like anybody so much. I was like, I know what he's going for, but I can't say it. I can't think of it. That's We're assoping. We're assuming that the sequel whenever they get to it, we'll, you know, get to that. But, uh, we had a nice little Q&A with the directors, uh, at the end and, uh, the director was like, \"Wish I had more time to continue working on this.\" And that's why I assume that we have no date. Um, but I think a lot of these games have challenge with trying not to always up the stakes with just more difficulty because it seems like every next game that comes out is harder and sometimes developers think, well, harder is better. Like",
            "start": 875.6
        },
        {
            "text": "challenge with trying not to always up the stakes with just more difficulty because it seems like every next game that comes out is harder and sometimes developers think, well, harder is better. Like that's the only way we can innovate. But you can still get really, really creative with move sets. And I think that they're proven so with with what I experienced with the boss fights and with the uh oops and with the different weapon types. Um, freaking awesome. had a great time. Herman Lee was there. I was going to say Eric Eric Myers in the super chat says, \"Can you talk about why Herman Lee was there?\" Herman Lee was there to um play some like metal renditions of the Lives of Pee music as a little, you know, in between when se when group one is done with their section and we have group two coming in later. It was, you know, they had a little reception out there with food and things like that. But he played a a guitar rendition of some of the songs from Liza P. Um, also one of the",
            "start": 919.6
        },
        {
            "text": "two coming in later. It was, you know, they had a little reception out there with food and things like that. But he played a a guitar rendition of some of the songs from Liza P. Um, also one of the funnier moments, you know, and you got you got to love PR people trying to do the best and trying to like Danny try goddamn Danny trying to, you know, making these making these um little appointments feel larger than life and you get immersed into the world and they did a lot of cool stuff where we're in some sort of kind of like mansion and a couple of the different rooms are themed after different rooms that you would see in Liza P. There was for the uh for the balln knowers out there, the uh the Trinity room was recreated where you walk in and it's just like this little pedestal with a box and three chairs around it and a little safe in the corner and you're like, \"Oh, this I love [ __ ] like this.\" You know, kind of recreating different uh things in the room. Um, but then the funnier",
            "start": 962.88
        },
        {
            "text": "and three chairs around it and a little safe in the corner and you're like, \"Oh, this I love [ __ ] like this.\" You know, kind of recreating different uh things in the room. Um, but then the funnier part was when Herman Lee is uh doing his final song, he is introducing and bringing up a singer to come join him on stage. And it like nothing was more com you couldn't have comedically written it better of of him going so and so, I'm blanking on his name, was a 2013 fifth place contestant on American Idol. No. And it was just like something about the date and the Why did he say why did he say that? He was on American Idol. That's all I got to say. It was hilarious. It It was hilarious. Um but it was awesome seeing that. Um it it was a great event. Um and can't freaking wait whenever this date happens. I got to assume it's going to be shadow dropping at SGF or either shadow dropping or that's when the date will be and it'll be like hey in two weeks or whatever. But they're they are still",
            "start": 1010.72
        },
        {
            "text": "happens. I got to assume it's going to be shadow dropping at SGF or either shadow dropping or that's when the date will be and it'll be like hey in two weeks or whatever. But they're they are still really stuck on the summer 2025. But yeah, this looks to be like a lot of content, a lot of awesome content for um for 30 bucks and it's going to be 10 to 20 hoursish of content. Um, but really stoked for people out there who love Souls likes and love adventure action adventure games like this, but can't get into them because sometimes they are too hard. And Lizip can hit you real roughly with some crazy difficulty checks and to be able to drop the difficulty and have a bit of an easier way about it, I think, is massive for the approachability side of things. So, I hope people give this amazing Souls like um a try if you haven't cuz I I would put this above Demon Souls as like it's still better than you know part of some of what From Software has done themselves. Hell yeah. Fantastic. Thank",
            "start": 1060.96
        },
        {
            "text": "Souls like um a try if you haven't cuz I I would put this above Demon Souls as like it's still better than you know part of some of what From Software has done themselves. Hell yeah. Fantastic. Thank you, Andy. What a great preview. Round of applause and home for Andy. The boy. Can you drag your chair out too? Oh, yeah. Yeah. Thanks. Believe it or not, we haven't even started the show, everybody, because this is kind of funny. gave daily. There's literally like six feet. He could have gone more more than that, you know. Could have gone",
            "start": 1106.4
        }
    ]
}