{
    "id": 14001,
    "video_id": "J8Jp2sS-d5k",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Blessing Adeoye Jr."
    ],
    "title": "Big Trouble At Giant Bomb & Polygon  - Kinda Funny Games Daily 05.01.25 Part 2",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page - https://store.steampowered.com/app/13... \nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/c... \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/stor...\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1746128476,
    "duration": 2504,
    "transcript_chunks": [
        {
            "text": "[Music] What's up and welcome back to kind of funny games daily for May 1st, 2025. I'm your host Tim Gettys. I'm joined once again by blessing Addio Jr. Tim, how's it going? It's going okay. You know what I mean? Today started off bad. started uh Games Daily saying that everything's [ __ ] and I feel like I willed that into existence for kind of funny as well. Uh both of our main kind of brain computers at the studio are having completely different issues. Uh so Kevin and Barrett are trying their damnedest to get everything up and running so we can keep doing the shows. We got cut off in the middle of episode one of Games Daily after story uh covering story number one which was all of the Xbox and Microsoft price increases. um that video slash audio versions everywhere should be where you expect them to be. We're going to continue the show from here with a part two of games daily because there is a lot of stuff that we want to make sure that we get to. I don't want to get into too much",
            "start": 7.62
        },
        {
            "text": "them to be. We're going to continue the show from here with a part two of games daily because there is a lot of stuff that we want to make sure that we get to. I don't want to get into too much of the rigmarroll. You guys understand the housekeeping the blah blah blah. We're doing stuff thunderbolts and reviews going live. Patreon. Go to Patreon. Go to all the shout out Imperial or whoever's in Exactly. Get get the uh uh kind of funny membership to get the shows ad free. You know that. Shout out to our Patreon producers Carl Jacobs of Mega Busters Lady Twining. Today we're brought to you by Imperial and Aurafa Frames. But back to it. Story number two. Bless. This is a big one. This is a shitty one. I hate doing this, but we got to do it together. Polygon sold to Valnet and hit with massive layoffs. This comes from Ethan Gotch at Kotaku. The video game website Polygon has been sold to click farm powerhouse Valet and much of its mast head has been laid off. Kotaku has learned. The sale",
            "start": 60.16
        },
        {
            "text": "layoffs. This comes from Ethan Gotch at Kotaku. The video game website Polygon has been sold to click farm powerhouse Valet and much of its mast head has been laid off. Kotaku has learned. The sale was subsequently announced in a long in in a press release. Multiple staff members have posted online about losing their jobs or about colleagues now being out of work. Quote, \"I'm no longer with Polygon. If you're hiring, please consider the many talented writers and editors now on the market.\" Posted Polygon co-founder in EIC, Chris Plant. Every one of them deserves a spot on your staff. I won't be t talking more about the sale because I wasn't involved. Going to hang out with my kid, taking wins where I can. The sales confirmed in a press release which did not mention the layoffs. The price of the deal was not disclosed. Sources tell Kotaku that deputy editor Mattie Meyers and games editor Zo Hannah Zoe Hannah are among those that remain at Polygon. Fox Media did not immediately respond",
            "start": 101.04
        },
        {
            "text": "of the deal was not disclosed. Sources tell Kotaku that deputy editor Mattie Meyers and games editor Zo Hannah Zoe Hannah are among those that remain at Polygon. Fox Media did not immediately respond to a request for comment. I'll say more later, but I no longer have a job, shared senior reporter Nicole Carpenter. I'm looking for work, as are so many of my amazing colleagues. I have lots of ideas and things I'd like to write. I'm really in shock. I had a great time working at Polygon, posted senior writer Michael Mcuarter. Please let me know if you have any cool job openings. In a report earlier this year by the RAP, many former contributors accused Valet's current media holdings of being exploitative content mills. Quote, \"In journalism, there are really bad jobs. And then there's a place like Valnet.\" A former Collider contributor told the rap, \"It's one of the worst places I've ever worked and it's probably one of the worst journalism publications I've ever seen.\" Let's just start",
            "start": 144.88
        },
        {
            "text": "like Valnet.\" A former Collider contributor told the rap, \"It's one of the worst places I've ever worked and it's probably one of the worst journalism publications I've ever seen.\" Let's just start here. Bless thoughts on Polygon. I mean, this is heartbreaking, right? Like, we've heard bad things about Valnet. We've I mean, we've heard bad things about the state of games media for a very long time. This is, I think, the moment where it does officially feel over, you know, like I think we say that a lot of like, oh man, it's over. Oh man, it's so done. Uh, today feels like a day where it's so done. Of course, like the giant bomb thing is also going on as we speak where uh I mean, it's been ongoing for the last week of what the [ __ ] is happening over there at Giant Bomb. Of course, I was in in Tokyo hanging out with Dan Riker for a week and so I've been going back and forth with even him talking about like, yo, what is happening? And he's been filling me in. And of course, that's like",
            "start": 186.48
        },
        {
            "text": "in Tokyo hanging out with Dan Riker for a week and so I've been going back and forth with even him talking about like, yo, what is happening? And he's been filling me in. And of course, that's like that's their story to tell. So, I'm not going to say like anything that's not mine to say, right? But like you go online right now, you go on Blue Sky and Jeff Grub is even tweeting out uh about uh he tweeted just not that long ago. I think like half an hour ago. Uh well, that was a dream come true. Knew it wouldn't last though. out of the job uh out of a job at the moment, but I'll always be doing patreon.com/games. Um I think lumping these two together is a little bit necessary because yeah, I when I think of games media, the first website that comes to mind is IGN, but then like games content, games media, games podcast and all that stuff. Beyond an IGN, it was specifically Giant Bomb and GameSpot or not GameSpot, sorry. Well, it wasn't games, but like Giant Bomb and Polygon, I should",
            "start": 228.0
        },
        {
            "text": "games media, games podcast and all that stuff. Beyond an IGN, it was specifically Giant Bomb and GameSpot or not GameSpot, sorry. Well, it wasn't games, but like Giant Bomb and Polygon, I should say. Uh, Giant Bomb, of course, with the Giant Bomb cast with the Giant Beast cast with the excellent cast crew uh they had over there from Jeff Gersman to Dan Riker to Abby Russell to Austin Walker to Jeff Balar to Jano Choa to I Patrick Patrick Klepic, Ben Pac, like I can name the entirety of the podcast crew a giant bomb because I came up a gigantic giant bomb fan. Like as much as I listen to kind of funny, I listen to just as much Giant Bomb coming up. Polygon all say the same thing as far as how much I listen to to uh Polygon podcasts and how formative that that stuff was as far as their humor, as far as their creativity, as far as the quality of content that they would bring to the table. And the thing that breaks my heart is as I go through these names um on the Polygon side. You talk",
            "start": 272.4
        },
        {
            "text": "as far as their creativity, as far as the quality of content that they would bring to the table. And the thing that breaks my heart is as I go through these names um on the Polygon side. You talk about Chris Plant who was the EIC, the co-founder and EIC of Polygon. You talk about um uh Michael McWer, which is a name that I've read a million times on kind of funny games daily, right? Like as I go through these names, I'm like these are just a handful. Nicole Carpenter as well, right? Like these are just a handful of names. There are other people posting online talking about them being out of the job, right? I saw a post from Cali PGY uh just earlier as well talkingh talking about it. Like this is so [ __ ] heartbreaking. Um and there are a million a million things to say about this, right? Like we can talk about support independent media, support of course support these people wherever they go, whether they start their own thing, whether they want to go in uh uh uh on a solo venture,",
            "start": 315.68
        },
        {
            "text": "Like we can talk about support independent media, support of course support these people wherever they go, whether they start their own thing, whether they want to go in uh uh uh on a solo venture, you know, pair up with each other and do like a group ventures. But I think the even more heartbreaking thing beyond this is that there are the names that we know that we're like I I look at a Dan Riker and a Janatoa and like a Mike Manadyat and like those names that we know and go all right they they're hopefully they start something together and I have full belief in whatever they end up doing. That's not the case for everybody. The unfortunate thing is that to be as renowned as those names that I just said is such a blessing and a rare thing uh in this side of the industry. Most people don't have that luxury. And that is the truly heartbreaking thing about this is the fact that like once a lot of these sites are gone, that stuff is just gone, right? Like a lot of those folks aren't going",
            "start": 357.36
        },
        {
            "text": "have that luxury. And that is the truly heartbreaking thing about this is the fact that like once a lot of these sites are gone, that stuff is just gone, right? Like a lot of those folks aren't going to be able to continue making that content elsewhere necessarily, at least on the same level, with the same consistency, with the same uh uh luxury of having it be a job for them. You're going to get less v video games media content because of this. Uh and I I'm I'm blabbering, but like it [ __ ] breaks my heart. It [ __ ] breaks my heart. It heartbreaking, man. It's a great way to put it. And I I think you really nailed it for the how important Polygon and Giant Bomb are to the gaming media landscape for incredibly different reasons, but it's so sad to just one by one look at so many sites go down. And incredibly important voices be lost. And in terms of Polygon putting out such thought-provoking journalism and thoughtprovoking think pieces, handling games differently than anyone else",
            "start": 400.88
        },
        {
            "text": "go down. And incredibly important voices be lost. And in terms of Polygon putting out such thought-provoking journalism and thoughtprovoking think pieces, handling games differently than anyone else was doing. And then Giant Bomb, obviously the personality based stuff that um got so popular over the years, like they are the originators of that, like them and OneUp, right? Like thinking back in the day to the the OneUp uh podcast and all that, like they defined what video game personality podcast could be. And then, you know, here's kind of funny, right? We're so lucky being able to grow up in a a world where um a standard was kind of set in the early days of what even a premium uh video game media video based website could look like, right? Um and not even thinking about this is preon and all of that. So, it's like so much was learned there, but um we're talking about two stories that are completely different, right? But yes, uh at the same time, I think it all comes down to you have",
            "start": 443.6
        },
        {
            "text": "all of that. So, it's like so much was learned there, but um we're talking about two stories that are completely different, right? But yes, uh at the same time, I think it all comes down to you have to trust the team that is making the content or else it's not going to work. And these acquisitions for Polygon letting go of Polygon, like pretty the entire team essentially. Like I'm seeing a super chat here from Zeke speak saying, \"Y'all should get Tara Long on as a guest. She was laid off this morning. Legacy figure. I used to watch her in Scoville back in the day on Destructoid.\" That breaks my heart, man. Tara's one of the the first people I ever met in the industry. like when I would go to PAX in 2011, uh I remember hanging out with her so much and to see the journey that she's been on from Destructor and all the way up to uh running video I think it was at at Polygon and the amazing stuff that they would put out like this just really really sucks. And obviously the Giant Bomb side",
            "start": 492.96
        },
        {
            "text": "from Destructor and all the way up to uh running video I think it was at at Polygon and the amazing stuff that they would put out like this just really really sucks. And obviously the Giant Bomb side like them being so close to us and so many of those people whether it's the GameSpot side or Giant Bob side and however ways those interacted like we're talking about some of our closest friends in the industry. Yeah, like they were just straight up disrespected. Disrespected, you know, and I these are very different stories, but I think the thing they have in common is is uh terrible parent organizations. Like you look at uh uh Giant Bomb, right? And like one of the So they they had 888 episodes of the Giant Bomb cast and like keep in mind that's a weekly podcast. Think about the longevity there as far as 888 episodes. You've been going for that long as a company. Uh but in uh in one of their recent episodes like they made a whole bit about uh like brand safety and kind of like you know",
            "start": 535.92
        },
        {
            "text": "as far as 888 episodes. You've been going for that long as a company. Uh but in uh in one of their recent episodes like they made a whole bit about uh like brand safety and kind of like you know made fun of the fact that it's seemingly their parent or parent organization uh try to make a shift as far as trying to have more brands safe content make their content PG-13 in order to appease poly marketing ads all that stuff right and like that is such a misread on what Giant Bomb is like imagine thank god we're independent right but like imagine that like kind of funny like sells to some organization and kind of funny. No more live streams. No more live streams. Like we wouldn't be able to exist as a company. Like that's the totally totally antithesis of what this is. I mean, I I cannot stress this and make this any more clear than the fact that every decision we make is to be able to survive, like to be able to talk about games and to to have conversations and talk about the news or our",
            "start": 578.72
        },
        {
            "text": "this and make this any more clear than the fact that every decision we make is to be able to survive, like to be able to talk about games and to to have conversations and talk about the news or our opinions or just stupid fun stuff and fighting gorillas and [ __ ] Like, we make the decisions we make business-wise to be able to thrive. Thrive is even a big word, but like again, survive uh in this world. And it's like being kneecapped and told that, hey, like your live streaming efforts, which are clearly where this industry is currently and where the audience is, like to take that away from Giant Bomb, you're killing Giant Bomb. And the the people that work at Giant Bomb know that because they're trying their best to just make this stuff work. And it gets so scary to to look around and see stories like Game Informer last year go down. Yeah. Right. Or was that this year? I don't even know when it was. like it it might it could have been next week, it could have been last week. I think",
            "start": 628.4
        },
        {
            "text": "stories like Game Informer last year go down. Yeah. Right. Or was that this year? I don't even know when it was. like it it might it could have been next week, it could have been last week. I think it was like it was like it was fall last year. I think it was like August to September around that time. Yeah. And now now they're back, you know, but I I'm sure that that is incredibly difficult for them, you know. I know it's incredibly difficult for them. And uh it's it's going to continue to be and it's not going to be the same. And that's good because we don't need it to be all the same. Like it needs to be better than it was, but that's a lot of pressure for people that are already working way too hard, doing way too much. Um, and yeah, man, it just sound I I again, I feel like I'm blabbering now. Just we're just going in circles with this stuff, but like we're all the people in the chat right now. Thank you so much for being here and thank you for understanding this. Like things that",
            "start": 676.96
        },
        {
            "text": "now. Just we're just going in circles with this stuff, but like we're all the people in the chat right now. Thank you so much for being here and thank you for understanding this. Like things that you love are being taken away. That sucks. I last weekend I was at uh Barbara Duncleman's wedding. Uh one of the the the main faces of of Rooster Teeth, a company that doesn't exist anymore. And yeah, Bernie bought back the the rights to some of the elements of it, names and stuff like that, but the company that that allowed so many different groups in our sphere to thrive in so many different ways no longer exists. And I'm at this wedding looking around at so many of my friends that do are not able to do the things that they used to do and survive. Some of them are thriving. Some of them are doing great. But like you said earlier, not all of them. And that sucks. Things you love can't be taken away. Can't take them. They can't so easily. I hate like now of all [ __ ] time. Greg, do you have",
            "start": 714.48
        },
        {
            "text": "great. But like you said earlier, not all of them. And that sucks. Things you love can't be taken away. Can't take them. They can't so easily. I hate like now of all [ __ ] time. Greg, do you have anything to say about this? In some serious ways. I mean, yeah. What? This all sucks. This is, you know, awful. Uh, in some ways not expected. I think, you know, I didn't expect Polygon to be sold and be all [ __ ] up today, right? But it's like what happens these sites and personalities get put into the machine right of hey how can we try to make a book off a book you know there's a lot of great takes going Iron the Don Khan is out there right and one of his that I really appreciated the mic one of the ones I really appreciated from him was hey like we're on the eve of like the biggest console launch of all time games are more popular it seems like great time to [ __ ] all this up like why would you do? You know what I mean? People, how can you not make money off of this? Six is supposed to",
            "start": 757.6
        },
        {
            "text": "of all time games are more popular it seems like great time to [ __ ] all this up like why would you do? You know what I mean? People, how can you not make money off of this? Six is supposed to come out this year. The answer is it's incredibly tough as we know. It's kind of funny, but we figured it out on how for us to make it work and go, right? But that also means that like this is the company. This is the product. This is what we're doing. We're happy with that, right? We're not the venture capitalist coming in to buy this thing trying to turn it and like, well, let's get four times the profit. Let's get five times the profit. Let's hire let's hire seven more people to spin up this thing just to buy esports. Oh, that didn't work. [ __ ] Cancel that. and we have to lay people off from the regular publication. Like that's what it is, right? And then yeah, the stuff breaking right now uh you know with like uh Grubby over there. I just I was blue him right now. You want to host games",
            "start": 812.0
        },
        {
            "text": "the regular publication. Like that's what it is, right? And then yeah, the stuff breaking right now uh you know with like uh Grubby over there. I just I was blue him right now. You want to host games daily tomorrow? We'll see if he responds of like you know once again hey you got a a corporate overload overlord running a personalitydriven thing. What is that? That's going to butt heads with something eventually, right? They just want the churn. They just want the head review, the preview, the thing. Like, not necessarily you. Yeah, we got out. But bless you're still in it. Never forget it. Still in what? This man. Okay. Don't piss me off. All right. How does that mean? I don't know what you're doing. What do you think? Very simple. What it means very simple is again, I just talked about this yesterday on happy hour. Not as a competitor, but as the CEO, I did broker a deal with Andy to get his game Showdown Star. And he just That's all you have to honor that deal. I I don't have to",
            "start": 845.52
        },
        {
            "text": "this yesterday on happy hour. Not as a competitor, but as the CEO, I did broker a deal with Andy to get his game Showdown Star. And he just That's all you have to honor that deal. I I don't have to honor anything. Obviously I CEO you have I'm the commissioner of the show. I'm the host of the show. I'm the producer of the show. I run the show. I can do what I want. Deep sigh Timu. Deep sigh. Uh real quick I saw um in the chat Kabsi saying this is a minor thing but I really like the Imperial ads. That's a perfect sponsorship in my opinion. It's it's hard to there's always that balance of getting like too behind the scenes and just like too naval gazy is the word that we used to use so much uh back in the day talking about kind of funny talking about the inside baseball stuff of how things are made or whatever. It's just important to talk about that stuff. And again, Imperial is a perfect type of ad for us. And it's I wish we can get more things like that. I wish that we could support",
            "start": 889.28
        },
        {
            "text": "are made or whatever. It's just important to talk about that stuff. And again, Imperial is a perfect type of ad for us. And it's I wish we can get more things like that. I wish that we could support indie games, smaller games, getting uh pushing wish wish listing and all that stuff, but we're trying our best out here to survive and to be able to keep doing this. And it's hard for us. It's hard for everyone. And I appreciate all the support out there from each and every one of you. Um, but when we look at whatever this group of people, these people are going to do next, like try your best to support them in whatever way you can, but yeah, they're m like the the corporations out there are making it harder and harder to even have ways to support. The uh thing I'll say, right, is that I think this has a lot in common with the first story we talked about on the previous part one episode of Games Daily, uh, talking about how Microsoft's raising the prices, all that stuff. And I referenced",
            "start": 928.88
        },
        {
            "text": "this has a lot in common with the first story we talked about on the previous part one episode of Games Daily, uh, talking about how Microsoft's raising the prices, all that stuff. And I referenced the video from Alana Pierce, right? Like a lot of it coming down to how much the ecosystem is changing and how much like um people are in converse companies uh video games are in competition with uh the other ways people are spending their times namely things like social video or like the other types of content um that are rising to the top. Also I saw somebody left the call. Are we still going Barrett? Are we still here? I'm gonna talk and assume we're still here. Um, but I think, you know, when in the in the way that right now we're seeing the numbers possibly go down and become difficult and all the [ __ ] right? I still think that there is so much value still in the type of content that we see out of games media. I think there's so much uh uh value in written articles. There's so much",
            "start": 967.76
        },
        {
            "text": "all the [ __ ] right? I still think that there is so much value still in the type of content that we see out of games media. I think there's so much uh uh value in written articles. There's so much value in those opinion pieces. there's so much of value in hearing voices that aren't necessarily just streamers or YouTubers or um even podcasters, right? I think the type of content, the type of work that you get out of journalists that you get out of people that you know are really thoughtful in the way that they think about the industry and thoughtful in the in the ways that they need to be because there is a there's the journalist journalistic integrity there, right? Like there is the um like almost the responsibility there that is beyond I'm going to make a thing that is very entertaining. it is. I'm going to make a thing, express a thing that, you know, is valuable for like how we talk and think about video games, how we talk and think about this medium, right? Like there's so much",
            "start": 1009.44
        },
        {
            "text": "it is. I'm going to make a thing, express a thing that, you know, is valuable for like how we talk and think about video games, how we talk and think about this medium, right? Like there's so much value there and y'all like if y'all appreciate that [ __ ] like you need to go out and support it, right? And I don't know where that stuff goes from here. I think a lot of it ends up independent, but I think I not that I worry about the independency of it, but I think that stuff needs to be funded in some way that we're not going to see it come and go once all the independent sites like go away or whatever it is, right? Like there needs to be actual funding behind it. Yeah. And that's the that's that's the thing that I I want to see and the thing that I worry about. Unemployed Jeff Grubs is going to host tomorrow with you, too. Fantastic. Love that. Um Yeah. No, bless you're you're really nailing it there. Uh, I think that the there there has to be weight behind your words when it comes to",
            "start": 1059.92
        },
        {
            "text": "to host tomorrow with you, too. Fantastic. Love that. Um Yeah. No, bless you're you're really nailing it there. Uh, I think that the there there has to be weight behind your words when it comes to stuff. I feel like me and you and Raj had a great time in New York um and had a lot of great conversations and I feel like something we kept talking about is um how we talk about covering games and how we talk about our reviews specifically of like our individual thought process on our reviews and and how we much effort we put into our opinions and why that matters. And I think that those are things of like everyone has an opinion. Everyone's entitled to an opinion, but when you put your opinion out there the way that we do, there's a weight to it that we need to have responsibility for, you know, and these people have that. And and there's so many different weights on them. And I I want to shout out Giant Bomb in particular because there is a unique uh set of obstacles when you are a brand",
            "start": 1098.88
        },
        {
            "text": "and these people have that. And and there's so many different weights on them. And I I want to shout out Giant Bomb in particular because there is a unique uh set of obstacles when you are a brand that is based on personalities and then those personalities change and shift. And what this current slashlast iteration, whatever you want to say, of Giant Bomb did something so incredibly special and so incredibly different while also respecting the legacy that came before and they pulled it off and they weren't the first group to do it. Like there was many different waves of giant bomb and there might be more waves. We don't know. The Abby Russell, Ben Pack era giant bomb was like some of my favorite giant bomb. I was listening to Giant Beast cast every week and that was way different from like Jeff Girtzman, Ryan Davis and like the people that you know started it all and Patrick Klepic and all these people, right? Like there have been multiple generations of giant bomb in the way that you",
            "start": 1143.6
        },
        {
            "text": "Jeff Girtzman, Ryan Davis and like the people that you know started it all and Patrick Klepic and all these people, right? Like there have been multiple generations of giant bomb in the way that you look at kind of funny there's multiple generations of kind of funny and yeah I think what what Jan had going what what Grub had going what Manady had going what Dan had going there I think is very special and like I want to see that continue and I think there's a future there even if it's not called Giant Bomb even if they like start something new and they call it something else like I think that there's something there that could be special that is going to continue that legacy. Yeah. And uh Cloud Master says, \"Go to miss the giant bomb couches.\" Like again, so many people do similar content in this space. But really, not many people do what kind of funny he does, right? Giant bomb does that. And I think that that is it's going to be very sad that the Giant Bomb couch is not going to",
            "start": 1191.52
        },
        {
            "text": "in this space. But really, not many people do what kind of funny he does, right? Giant bomb does that. And I think that that is it's going to be very sad that the Giant Bomb couch is not going to exist. And again, the couch is different than it used to be. It means something different than it used to. But um there's a level of importance to uh the way that these groups talk about video games because again not many people have the access to do that, have the uh chemistry to do that. People can talk about games all they want, but there's something special about Giant Bomb. Uh and to your point, it's not the name, it is the people, and it is the the chemistry. So, we'll see where this all shakes off. But I I do want to say that um I'm a big fan of Colin and Samir who are uh two YouTubers that really really care about the internet media landscape and um internet companies as a business, right? And I'm really into that stuff personally as well. But they put up a video in the last couple",
            "start": 1228.64
        },
        {
            "text": "really really care about the internet media landscape and um internet companies as a business, right? And I'm really into that stuff personally as well. But they put up a video in the last couple days about Dude Perfect who are those huge um you know trickshot YouTubers. Like they are started as a small YouTube channel and now that they're a a corporation to themselves, right? Um but in this video they're talking about how Disney had a methodology where it all started with this drawing of what the company is and all of the different ways that they can make revenue and continue to to exist as a company. And we're talking about Disney, the one of the biggest companies in the world, and yes, what their IP can make movies and TV and Disneyland, etc., etc. Dude Perfect did the same thing in this video of trying to take their company and distill it down to what is it and how can they survive for the next 15 years and how can they grow and continue to make sure that that it's not just big",
            "start": 1275.84
        },
        {
            "text": "this video of trying to take their company and distill it down to what is it and how can they survive for the next 15 years and how can they grow and continue to make sure that that it's not just big now, but that it'll be able to survive forever. And um a quote that I wrote down from it because I just it resonated so hard with me is what they drew wasn't just a company, it was a belief system. And I think that's why kind of funny has been able to survive as long as we have. And it feels like I mean anything can happen, but it feels like we are we're okay. And it's because our belief system is in the strategy of the the content and in the people and in not doing more more. It's doing what is working. What what do we want to do and what do we want to continue doing to make that happen? And um I I believe that the team over at Giant Bomb believes in their plan and when their plan that they believe in is taken from them, there's nothing. So I'm hopeful for those uh the boys and girls",
            "start": 1323.76
        },
        {
            "text": "And um I I believe that the team over at Giant Bomb believes in their plan and when their plan that they believe in is taken from them, there's nothing. So I'm hopeful for those uh the boys and girls over there. And um I it's going to be real tough. But if anyone can pull this off, it's them. Polygon, I don't know a lot of those people as well. And I think that um it's going to be a lot harder for them because the traditional games media landscape is gone. Yeah. at this point. Gone. Yeah. Gone. Yeah. And the thing is like somebody who knows those names, right? Like I like I I think Chris Plant is is he's like I think he's on the besties. I know Andy listens to the besties more than me, but I'm pretty sure Chris Plant does the besties with like Griff Mackoy and them. Yeah. Thank you. Um and like I think I I could I could see Chris Plant doing a number of things, right? like and I know Nicole Carpenter and Michael Mcwarter like the the names that we see um that like might everybody",
            "start": 1369.04
        },
        {
            "text": "and like I think I I could I could see Chris Plant doing a number of things, right? like and I know Nicole Carpenter and Michael Mcwarter like the the names that we see um that like might everybody listening might not be familiar with but like they're talented people that I could see even in in this shrinking industry maybe find spots doing stuff at IGN maybe find spots elsewhere but again like even if you're that level yeah for how long like you know when does not IGN get to a point where it's like all right we're cutting all this off right for guides only h is right. Um, we're going to get to other stories and some super chats after a quick word from our sponsor. This episode is brought to you by Imperial. We have told you all how important it is to developers that you wishlist the games you're interested in. So, if this sounds cool to you, make sure you wishlist it. I can't tell you how much it helps. Imperial is a complex, featurerich action RPG where you'll be sent to a planet in",
            "start": 1413.44
        },
        {
            "text": "you're interested in. So, if this sounds cool to you, make sure you wishlist it. I can't tell you how much it helps. Imperial is a complex, featurerich action RPG where you'll be sent to a planet in a faroff corner of the galaxy to explore an enormous imposing monolith. As an elite mercenary, you'll join the expedition tasked with unearthing the secrets of the monolith and face off against the deadly automatons within. In Imperial, you'll explore four vastly different quadrants of the monolith, accessible only by using mysterious artifacts known as cardoggrams. Each cardoggram affects which enemies, boss fights, and loot will appear when you enter the monolith. So, no two excursions will be the same. Find even more cardiggrams to explore by looting defeated enemies or buy them from other players online at the trading post. You'll need to make sure you have the right gear to take on the harder cardoggrams. Build your mercenary, choose your gear, master your abilities, and take down",
            "start": 1460.08
        },
        {
            "text": "players online at the trading post. You'll need to make sure you have the right gear to take on the harder cardoggrams. Build your mercenary, choose your gear, master your abilities, and take down everything in your path in Imperial. Face off against enormous deadly bosses, and seek out secret paths to find bigger and better loot. Help the members of the expedition in deep branching quests and aid other players in asynchronous multiplayer. Get ready, mercenaries. The monolith awaits. Imperial is available May 8th on PC, Xbox Series X and S, and PlayStation 5. Wishlist now. It helps so much. Wishlist Imperial. This episode is brought to you by Aura Frames. If you haven't called your mom in a while, here is your reminder to do it. But if you want to go above and beyond beyond Mother's Day is coming up, and I have the perfect gift idea. Arafa frames are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you",
            "start": 1505.2
        },
        {
            "text": "is coming up, and I have the perfect gift idea. Arafa frames are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preloaded with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special, they'll use it every day. Me, Kevin, and a ton of people at Kind of Funny are obsessed with our Aura Frames. It takes about 2 minutes to set up the frame using the Aura app. Aura frames were named the best digital photo frame by Wire Cutter and featured in 495 gift guides last year. I counted. Aura has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting orura.com to get $35 off plus free shipping on the bestselling Carver matte frame. That's auraframes.com. Promo code kind of funny. Support the show by mentioning us at checkout. Terms and conditions apply. back with some super chats here. Uh",
            "start": 1548.64
        },
        {
            "text": "on the bestselling Carver matte frame. That's auraframes.com. Promo code kind of funny. Support the show by mentioning us at checkout. Terms and conditions apply. back with some super chats here. Uh Napoleon says, \"Sorry for the troubles. Hope the day gets better.\" Shout out to Kevin and Barrett. Thanks for the daily news and entertainment. Hey man, shout out to Kevin and Barrett. They are really doing the best. They're kicking ass. Um Missouri mate says, \"Long live Giant Bomb and all the dooders. We will carry on.\" Uh Jeff Bull Jr. says, \"Love you guys. Thanks for the coverage on all of this stuff.\" Uh and CJ splits on. Here's to no super chat price increase. I mean, they don't give us ideas, you know what I mean? Um, let's get to story number three here. Epic offers Olive Branch to Apple, offers to bring Fortnite back to iOS after a court ruling. This comes from Andy Robinson at C. Uh a Tim Sweeney tweets, uh a US judge has ordered Apple to remove its restrictions uh around",
            "start": 1594.24
        },
        {
            "text": "to Apple, offers to bring Fortnite back to iOS after a court ruling. This comes from Andy Robinson at C. Uh a Tim Sweeney tweets, uh a US judge has ordered Apple to remove its restrictions uh around alternative payment methods, prompting Epic Games to offer dropping its longtime litigation and bring Fortnite back to iOS uh devices. On Wednesday, Judge Ivon Gonzalez Rogers ordered Apple to stop forcing a 27% commission on purchases made for iOS games and apps through web links, which developers had been using to avoid its store payment charges. She also ordered Apple to stop prompting messages dissuading users from using WebLink purchases and ordered Apple to pay Epic Games attorney fees over the issue. More significantly, the judge stated that Apple had violated a 2021 injunction and that VP Alex Roman had outright lied under oath. The company could now face criminal contempt charges. Following the ruling, Fortnite maker Epic claimed victory. It said that if Apple agreed to applying",
            "start": 1642.32
        },
        {
            "text": "VP Alex Roman had outright lied under oath. The company could now face criminal contempt charges. Following the ruling, Fortnite maker Epic claimed victory. It said that if Apple agreed to applying the rule globally, it would drop all ongoing and future litigation, including its right to bring its own store to iOS and bring Fortnite back to the platform as soon. Yeah, that last part is what the what was in the Tim Sweeney tweet. He tweeted out uh we will return Fortnite to the US iOS app store next week. Epic puts forth a peace proposal. If Apple extends the court's friction uh free Apple tax-free framework worldwide, we'll return Fortnite to the App Store worldwide and drop current and feature litigation uh on this topic. Yeah, man. I mean, it's crazy to kind of look at this and be like, Epic One, like I remember we covered this years ago and it was a little like I'd say above our heads when it comes to uh the actual we can read the words and have an opinion, but like this is",
            "start": 1688.0
        },
        {
            "text": "like, Epic One, like I remember we covered this years ago and it was a little like I'd say above our heads when it comes to uh the actual we can read the words and have an opinion, but like this is definitely some real indepth legal [ __ ] business versus big business [ __ ] Yeah. And um I remember Tim Sweeny's original tweet. We were like, \"All right, this seems a little uh him invoking 1984 and all that.\" It was It seemed It seemed a bit much. Yeah. And I still stand by Tim Sweeney [ __ ] seems a bit much. Like he retweet he tweeted again the 1984 quote um 20 hours ago on Twitter uh like kind of in in victory of the stuff. Um, and like man, Tim Sweeney, like have you ever thought of thought of the scenario of like you have you imagine you're high school, right? And there's this kid who's kind of a bully, right? And he like [ __ ] whoops your ass for two years straight and then like on a random on a on a random day in February comes through and he's like, \"Hey, let's bury the",
            "start": 1734.48
        },
        {
            "text": "who's kind of a bully, right? And he like [ __ ] whoops your ass for two years straight and then like on a random on a on a random day in February comes through and he's like, \"Hey, let's bury the hatchet. All right, we're cool. We're cool now, right? We're cool.\" That's Tim Sweeney right now where Tim Sweeny's [ __ ] like for years have has been calling out Apple has been talking about how their policies are unfair and anti all this stuff and like and finally they the court ruled in their favor and Tim Sween's over here tweeting like all right cool like so we're cool right like Fortnite Fortnite's coming back to your store like let's be chill. Yeah. Yeah. I I I love where you're going with that and yes that is true. I do think though this is good like Apple like I feel like there has to be some levels of checks and balances here and at the end of the day like based on all these stories games being in more places is a good thing. Mobile gaming being successful and allowing more uh",
            "start": 1784.72
        },
        {
            "text": "to be some levels of checks and balances here and at the end of the day like based on all these stories games being in more places is a good thing. Mobile gaming being successful and allowing more uh contemporary mainstream gaming uh efforts is a good thing. Yeah. um and and more ways to make money for games is good for I mean I think that's the big thing is I I remember talking about this when um this all was first starting and it felt like a win for Epic would be probably a like the good outcome for this because that means a win for more of like the software developers and game developers who do want to make uh uh more money through the um like I guess ongoing uh transactions or microtransactions that you want to have outside the app. Like that was one of the big things is that Fortnite or Epic really wanted to have um uh like make that Fortnite money in ways where you didn't have to go directly through the the app store um and have to give that cut to Apple in order to make it. So",
            "start": 1823.28
        },
        {
            "text": "or Epic really wanted to have um uh like make that Fortnite money in ways where you didn't have to go directly through the the app store um and have to give that cut to Apple in order to make it. So like Epic getting this win hopefully means that like a lot of companies that are smaller than Epic as well are going to have the luxury of that. Um get the benefits. Yeah. Get those benefits. Yeah. Yeah. Oh man, what a day. I'm exhausted. I did. I'm also exhausted and there's so much to do. Yeah, I know. I know. There's so much left on the day on the calendar. Let's get to story number four here. Hollow Night Silk Song will be playable in September 2025. Let's go. At an Australian museum. God damn it. We're going to Australia. Bless down under. Uh Wesley Poolool reports at IGN. IGN revealed that Hollow Night Silk will be playable in an Australian museum in September. Team Cherry's long in development games, one of the most anticipated in the world and has to top Steam wish list charts for",
            "start": 1867.84
        },
        {
            "text": "Hollow Night Silk will be playable in an Australian museum in September. Team Cherry's long in development games, one of the most anticipated in the world and has to top Steam wish list charts for years. The studio, which is based in Adelaide, Australia, South Australia, has yet to say when Silk Song will be released beyond a vague 2025. I didn't know they were Australian. I didn't know that either. Learned something today. Yeah. Wow. Good for Australia. Uh we at least know it will be playable for those who can be at Australia's National Museum of Screen Culture, ACMI, from September 18th. Slip song will be playable at the Mel Melbourne uh museum as part of a video game exhibition called Game Worlds, which will also include displays that delve into the game's design and artistic direction. ACMI co-curators Bethan Bethan Johnson and Jenny Maxwell commented, quote, \"Since Hollite Silkong's initial announcement in 2019, it's been one of the most anticipated indie games on the planet, and",
            "start": 1915.76
        },
        {
            "text": "ACMI co-curators Bethan Bethan Johnson and Jenny Maxwell commented, quote, \"Since Hollite Silkong's initial announcement in 2019, it's been one of the most anticipated indie games on the planet, and we are thrilled to celebrate the design of this South Australianmade game as a centerpiece of Game Worlds in September.\" Talk to your brother a second. You know, it's a crazy You go talk to your brother. Oh, quote, \"From the hundreds of sprites that animate Hornet's different movements and attacks to the logic behind the game's most challenging boss fights, and of course, having the game playable in gallery, our Silk Song display uh delve deeply into the details of the game's artistic direction and design. We're so grateful to Team Cherry for trusting us with their work and so excited to share that work with you.\" I had a joke loaded up for Tim, but actually it it'll work for you as well, right? Cuz it's just me. It's just me and you here. Neither of us have played through Hollow Night,",
            "start": 1954.88
        },
        {
            "text": "that work with you.\" I had a joke loaded up for Tim, but actually it it'll work for you as well, right? Cuz it's just me. It's just me and you here. Neither of us have played through Hollow Night, right? No. Come on out. I got taste. You got taste. Between between me and you. Yeah. How sick of you are. How how sick of hearing about Hollow Night. Just come out or don't come out. It's like we hear about this every day. Constant indie gest song. Oh, there's a billion other Nintendo Direct. It's going to be there. Cat Bailey calling it 2 seconds before it happens on the Nintendo Switch 2 direct with us. Insane. It's like good for you guys. Good enough. Yeah. Oh my god. Could it possibly be this good? You like this [ __ ] video, right? Like we don't even talk about [ __ ] I don't know Death Stranding 2 this much. Like [ __ ] Ghost of Yot is coming out this year. I'll tell you what right now. All right. Any game you list anyone Fallout any the Uncharted last they wish they could get this",
            "start": 1998.72
        },
        {
            "text": "Stranding 2 this much. Like [ __ ] Ghost of Yot is coming out this year. I'll tell you what right now. All right. Any game you list anyone Fallout any the Uncharted last they wish they could get this kind of publicity. They wish they could be talking about like they're opening up an exhibit in Australia in the world and it's a [ __ ] news story. Yeah, I know. Roger Piccorn in the chat. Grow up. Bless. I'm sorry. Don't you want to go play Animal Well again? Get out of here. Yeah. Also, Roger played Hollow Night two weeks ago and all he wants to act like the biggest fan of Roger was playing got slapped in the head. All right. They knocked something loose in there. That's why he thinks it's so good. I do want to play Hollow Night as I'm playing. Do you think this? Yeah, I know, right? And I'm just We're all just joshing. It is still goofy that it's like again this has been just this long and here it is. It's going to be in the museum. That's what they're going to do for it. I I don't",
            "start": 2040.0
        },
        {
            "text": "I'm just We're all just joshing. It is still goofy that it's like again this has been just this long and here it is. It's going to be in the museum. That's what they're going to do for it. I I don't know if this is It has to come out before it's in the museum, right? Does it? Like I feel like this means that it's coming out before. I think it's just that they're going to have a demo in there. Maybe. Oh, I mean a de I mean that'd be more than what we've had for like for Holiday Silk Song at all. I'm kind of with you, Bless. I don't necessarily know that this is going to be that it'll come out before then, but I don't think this will be the first time it's playable, you know. Yeah. Yeah. I just think it's being confirmed it will be playable there. I don't know because like I mean Imagine can reveal a holiday so long song will be playable in Australian in an Australian museum in September 2025. Yeah, but like the fact that they say I because I was thinking like is this the full game up",
            "start": 2075.12
        },
        {
            "text": "reveal a holiday so long song will be playable in Australian in an Australian museum in September 2025. Yeah, but like the fact that they say I because I was thinking like is this the full game up in that museum? Yeah, maybe Lanky Dragoon says it was playable in 2019 at the last E3. So yeah, it's like was it really? Yeah, people played it. I didn't realize that. Yeah, we talked about this a long time ago. Yeah. Uh, I forget what, but on some games daily it was like I think it was someone from Polygon I think uh played it. Um, yeah. I mean, hey, look, we've said this now a couple times. I like that we're hearing that Holiday Night's still 2025. They're still standing by that. You know what I mean? And like I believe them. I believe them too. Yeah. Yeah. Oh, man. I don't know why I'm doing a big big sigh at the end of every news story. It just feels honestly there's just an energy. All the text I'm going wrong and like the people got our gates not even working. Like I couldn't even park",
            "start": 2118.8
        },
        {
            "text": "big big sigh at the end of every news story. It just feels honestly there's just an energy. All the text I'm going wrong and like the people got our gates not even working. Like I couldn't even park in our parking lot today. Like this is just insane. Yeah. That's the thing is my car is stuck in the parking lot and like it's stuck in the parking lot. Yeah. Oh my god. I don't know how I'm going to get lunch. Oh man. I'm sure the hunger that you have bless is big. Oh it is. I'm hungry. Yeah. So big. But if I wanted to know something small, where would I look? You can go to our last news story, the Wii News Channel, where we cover all the small news items you need to know about. Thank you for that, Barrett. A little we news from you from VGC. Astral chain director and near designer Takisa Toro Tora has finally confirmed his exit from Platinum Games following months of speculation. In the latest issue of Japanese magazine Famitsu, uh transcribed by Genki, Tora confirmed he has quit",
            "start": 2164.24
        },
        {
            "text": "Toro Tora has finally confirmed his exit from Platinum Games following months of speculation. In the latest issue of Japanese magazine Famitsu, uh transcribed by Genki, Tora confirmed he has quit Platinum and formed his own company, Eel Game Studio, adding that he couldn't share more information at this point. Christopher Dring at the game business. The parents killing it out there. Uh, according Sorry, Christopher Dring at the game business. Uh, which is important because Christopher Ding recently left BGC to do their thing. No, not BGC. Uh, GIC biz. Yes. Uh, to do the game business. According to the publisher, Expedition 33 seemingly wasn't harmed by Oblivion's release timing. Quote, \"Also, by the time we rolled around, we had momentum of our own, and we felt pretty confident that we could stand beside it. I think there were other aspects like the price point we were at and the inclusion of Game Pass. So, we knew we would have a lot of interest around the game. We were confident in",
            "start": 2202.8
        },
        {
            "text": "stand beside it. I think there were other aspects like the price point we were at and the inclusion of Game Pass. So, we knew we would have a lot of interest around the game. We were confident in that and as it went and it went as well as it possibly could have done in our eyes. And actually, Proximity to Oblivion didn't seem to harm us at all. In many ways, I think it just drew attention to quality RPGs that week and everybody was thinking and talking about the genre. I This is one of those you'll never know because things went the way they did. See, that's where I'm at. Yeah. I'm like, can you say that for sure, though? Yeah. Like, I don't think you can. I I I stand by uh Xbox should not have put Oblivion out that week. Yeah. Like that was a bad business call. Like sure it resulted Expedition still doing great, but they didn't need to do that. I feel like was an unforced error that ended up not being the worst thing ever for Expedition 33, but I still think it would have done better",
            "start": 2250.08
        },
        {
            "text": "still doing great, but they didn't need to do that. I feel like was an unforced error that ended up not being the worst thing ever for Expedition 33, but I still think it would have done better otherwise. Yeah. I mean I mean I think it I'm just happy we're in the place where everybody's happy about how their games did. Yep. You know what I mean? Like hey, as long as Expedition 33 is successful, who cares about Oblivion? Like maybe it would have sold another however many copies, but at least we're here. At least we're in the good timeline in regards to Expedition 33. Yeah. Not for everything else. Yeah. God, Expedition 33 is good. It's all I want. I need to go back to it. I'm in I'm in I'm in this [ __ ] up place. Yeah. Where blueprints has ramped up so much in the post game and I cannot pull myself from it. Good problems to have, man. I can't play any other game right now that's not Blueprints. Yeah. So good. God. Uh VGC says Microsoft says it was the top publisher on the PlayStation",
            "start": 2286.88
        },
        {
            "text": "myself from it. Good problems to have, man. I can't play any other game right now that's not Blueprints. Yeah. So good. God. Uh VGC says Microsoft says it was the top publisher on the PlayStation store for pre-orders and pre-installs in the first quarter of 2025. You'll love to see it. That is so so awesome. Uh VGC also says the first seven games in the Leisure Suit Larry series of adult themed comedy adventures are being delisted from Steam. It's [ __ ] up. It's [ __ ] up, man. Get it now, Bless. Get it now before they're gone, you know. Yeah, exactly. Just Justice for my guy Larry. Free Larry. Free Larry. everyone. Uh, Mario Kart 7 soundtrack has been added to Nintendo music. So, yeah, Mario Kart 7 not memorable to me. I don't I don't think I knew Mario Kart 7 came out until Mario Kart 8. That's [ __ ] up. Like, I didn't have a 3DS. Yeah, I I get it. I get it. Very funny to say. Yeah. Uh, Kurt Flowers super chats in saying, \"I know it's smaller potatoes, but also bummed that Code",
            "start": 2326.64
        },
        {
            "text": "8. That's [ __ ] up. Like, I didn't have a 3DS. Yeah, I I get it. I get it. Very funny to say. Yeah. Uh, Kurt Flowers super chats in saying, \"I know it's smaller potatoes, but also bummed that Code Masters is no longer developing rally racing games anymore. Must be from the layoffs yesterday. God, man, we are just in a sad sad state of affairs. Um, what else do we got here in this very weird episode of kind of funny games daily? Uh, we got Let's see if we got anything wrong. I don't imagine we did. No, we didn't. We did it. No, we're great. Some people talk about melatonin, but uh we'll have Oh, was there any advice in there? Like, well, just don't do it too much is it seems to be the advice. What'll happen if I do too much melatonin? I don't wake up. I just fall asleep. I mean, Batman, remember? I mean, maybe. Yeah, it's like that, Barrett. I don't know, man. [ __ ] Doesn't sound like a bad time. It doesn't sound like a bad to try some of that toning. The toning, baby. Well,",
            "start": 2372.64
        },
        {
            "text": "remember? I mean, maybe. Yeah, it's like that, Barrett. I don't know, man. [ __ ] Doesn't sound like a bad time. It doesn't sound like a bad to try some of that toning. The toning, baby. Well, everyone, this has been kind of funny Games Daily 2 for May 1st, 2025. After this, I'm not exactly sure what's going to happen. We're going to check in with the team, see what's going on. Um, what I do know for sure is that in review will post today. Will it be live? Will it not be live? I assume it will, but it might not. But it will post today. It's it's it's prepped to be live. So, but I think we're going to be good. Uh, will the Games cast happen? Probably. Probably, but no promises. Uh, will there be a gameplay stream? Probably not. Uh, but stay tuned. We're going to try our best. There will be content. If anything, just go watch some of her old stuff, you know. Yeah. He's got two KFGs also. Yeah. Yeah. Yeah. We just been doing some great stuff. So anyway, we need food. We need happiness.",
            "start": 2420.64
        },
        {
            "text": "content. If anything, just go watch some of her old stuff, you know. Yeah. He's got two KFGs also. Yeah. Yeah. Yeah. We just been doing some great stuff. So anyway, we need food. We need happiness. You know, get my car out the gate. We need some breaks. I'm sure some cigarette breaks are in in need from a couple people here. Anyways, we love you all. Don't put me on blast like that. The biggest smoker I know. Don't put me on blast. Oh man. Anyways, I love you all. Thank you for your patience. Goodbye. [Music]",
            "start": 2469.28
        }
    ]
}