{
    "id": 14120,
    "video_id": "KjWKumdvZRc",
    "show_name": "Gamescast",
    "hosts": [
        "Mike Howard",
        "Roger Pokorny"
    ],
    "title": "Death Stranding Review (2025) - Kinda Funny Gamescast",
    "description": "Go to https://bit.ly/m/KindaFunnyXSubwaySurfers?r=qr to get special rewards and download it now!\n\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\n00:00:00 - Start\n00:03:45 - Housekeeping\n00:05:53 - Our 2025 Death Stranding Review\n00:22:30 - Ads\n00:24:42 - The Story\n00:34:07 - SPOILERS\n00:52:12 - What We Want from the Sequel\n01:00:34 - Ranking the Food\n01:11:29 - SuperChats\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1747858187,
    "duration": 4743,
    "transcript_chunks": [
        {
            "text": "[Music] Yo, what the heck is going on everybody? Welcome in to your kind of funny games cast for May 21st, 2025. It's a lovely Wednesday, aka hump day. Hump day. And it's Mike and Roger to get you over the hump and looking forward to the second half of the week. That [ __ ] hurt. You know what I mean? Like what what what what's the level of Mike giving you a high five or a low five? I love giving a good crisp high five. It's my passion in life. You want to hurt me. I know you do. One of my top five passions giving a nice crisp high five. You see it through and you just Yeah, but do the low five. Do a low five, but do it how you did it to me. Bear gets it. You likes the pain. You got to get a nice crispy high five to start your day sometimes. And of course, that's what Mike and Roger are going to give you during today's kind of funny games cast because today we're talking about our Death Stranding experience. Yeah, it's 2025 and we're gearing up and getting ready for Death Stranding 2.",
            "start": 9.07
        },
        {
            "text": "to give you during today's kind of funny games cast because today we're talking about our Death Stranding experience. Yeah, it's 2025 and we're gearing up and getting ready for Death Stranding 2. Well, I mean, it's like people are like, \"You didn't play this in 2019, Roger?\" I I could have told you like with the rest of with everybody else. No, we're different, Roger. That's why we're bringing the hype in 2025. Exactly. I thought I was above Death Stranding when I saw Die Hard, man. And I saw Mama and I saw these dumb names. I'm like, \"Oh, why would I play that stinker?\" And I play it and I'm like, \"Oh my gosh, my whole life has changed before my eyes.\" I said, \"I'm too dumb to understand this game.\" And then we played it and I said, \"I love this game.\" Yeah, I'm the right amount of dumb. I'm in this right here. Like I'm a jabroni that will just walk. Okay. And like I did that. So Roger, we're going to talk. So no, no, no. Before we do that, how have you gotten away with playing all",
            "start": 58.32
        },
        {
            "text": "I'm in this right here. Like I'm a jabroni that will just walk. Okay. And like I did that. So Roger, we're going to talk. So no, no, no. Before we do that, how have you gotten away with playing all of the Metal Gear Solid games except for five? Uh, not playing all the metal bar played all those. And then also Death Stranding, which you did not play. And then and then you did actually play Metal Gear Solid 5. Yeah, that's the one he had to play decidedly without. Yeah, I was pretty [ __ ] up. Yeah, I was pretty [ __ ] up that thoughts on that one. Well, here's the deal on this one, Roger. A lot of people were like, \"Mike, you didn't want to play. Mike, why didn't you grab the controller?\" And I did. I really wanted to grab the controller, but I didn't want you to take away my shine because I know all the jabronies out there watching and listening know if I took a step off of that treadmill and let you walk, they would have said, \"Oh, well, Mike didn't actually walk step for step with",
            "start": 100.72
        },
        {
            "text": "I know all the jabronies out there watching and listening know if I took a step off of that treadmill and let you walk, they would have said, \"Oh, well, Mike didn't actually walk step for step with Sam Porter Bridges.\" I think there was a lot of people already saying that I ensured anytime I, you know, tuned into that stream, were you sitting down looking at a big TV ordering food, breathing heavily in the microphone? And so I ensured that through the entire thing. I mean, just so everybody knows out there who are watching, listening, you know, we got to day three. I guess it's day two, but day three, it was it was Sunday heading into Monday. Friday knew I was dying, right? Like my feet were tightening up. The soles of my feet were burning. My yams were looking good, though. They were strong and solid. And he's like, \"Mike, like, let me walk for you. I can see you're in pain. Like, please just take a seat. Let me do this.\" And I looked at you, Roger. I said absolutely not. I will walk",
            "start": 140.16
        },
        {
            "text": "and solid. And he's like, \"Mike, like, let me walk for you. I can see you're in pain. Like, please just take a seat. Let me do this.\" And I looked at you, Roger. I said absolutely not. I will walk the entire No, you did the you did the mic thing where you said no. Yeah, yeah, yeah. I'll tell you the time. Yeah, yeah, I'll tell you the time. Yeah, don't worry about it. Don't worry about it. Never. Never. So, did I get to play this? No. Did I want to play this? Yes. But did I do it for the content? Of course. And so, we're going to talk about the content and what we created during our Death Stranding marathon stream that just happened last weekend. Yeah. And we're going to talk about our Death Strand. We finished it last night. So, we're going to talk about all things Death Stranding and our excitement for Death Stranding, too. So, today's kind of funny games cast is all about Death Stranding and we want to share your experiences with us. So, make sure to super chat away if you're",
            "start": 184.16
        },
        {
            "text": "our excitement for Death Stranding, too. So, today's kind of funny games cast is all about Death Stranding and we want to share your experiences with us. So, make sure to super chat away if you're watching live on YouTube andor Twitch. Give us some of your favorite moments from Death Stranding one. Tell us some of the things that you're looking forward to in Death Stranding 2. We're going to talk about all that and everything in between because this is the Kind of Funny Games cast. Each and every weekday, we get together to talk about the biggest reviews, previews, and topics in the video game world live on YouTube, Twitch, and of course later on podcast services around the globe. If you love what we do, consider supporting us with the Kind of funny membership available on Patreon, YouTube, Spotify, or Apple Podcasts to get all of our shows adree, watch us record them live, and get your daily exclusive show, Greg Way. for a chance to be part of the show. Submit your thoughts and",
            "start": 222.96
        },
        {
            "text": "Spotify, or Apple Podcasts to get all of our shows adree, watch us record them live, and get your daily exclusive show, Greg Way. for a chance to be part of the show. Submit your thoughts and opinions as super chats as we go. Don't forget we're kind of funny. We're an 11 person small business all about live talk shows today during kind of funny games daily. Uh Greg and Tim talked about is Xbox up right now? Are they winning? Are they up right now? We'll talk about it. Of course, they talked about it. Go check it out after this. The stream will be Greg playing Outer Worlds for their re-review coming up very soon. Greg, Andy, and Stella, I believe, are all replaying the Outer Worlds to get ready for Obsidian's next big RPG of the year, which is crazy to say, a vowed into Outer Worlds, too. They're going to be talking about it on the re-review. So, this today's afternoon stream is Greg playing the game. You can get in your questions, getting your thoughts about the game with him live",
            "start": 259.2
        },
        {
            "text": "They're going to be talking about it on the re-review. So, this today's afternoon stream is Greg playing the game. You can get in your questions, getting your thoughts about the game with him live over on Twitch and on YouTube. Of course, if you're a kind of funny member, today's Gregway is Greg Miller talking about The Last of Us now that he's a dad. Oh, and you know what? We're going to talk about dads in this game, too. Lot of dads. And I wonder what Greg thinks about being a dad after playing Death Stranding because like you're my future. You're my bridge to the future, Roger. You're my son now. Oh, okay. Where does Mad Mickelson play into all this? We'll talk about that. Of course, thank you to our Patreon producers, Carl Jacobs, Omega Buster, and Delaney Twining. Thank you to our sponsors, Subway Surfers, and Factor. But I'll tell you all about them later. Let's jump into the show. Roger, let's talk about our Death Stranding experience. Pick me up. Thank you. I forgot about",
            "start": 305.84
        },
        {
            "text": "sponsors, Subway Surfers, and Factor. But I'll tell you all about them later. Let's jump into the show. Roger, let's talk about our Death Stranding experience. Pick me up. Thank you. I forgot about that. Uh, where do you want to start, Mikey? I mean, I guess we should just start with like the start of the marathon stream kind of like where that came from. People like Yeah. What the idea was, what did we actually do? Maybe people didn't watch it and they don't care. So, like what should what what should we tell them about? So, uh yeah. So, in the beginning of this year, uh for kind of funny day, we had a bunch of promises and kind of laid out the next year of kind of funny uh with a few uh big events, right? We talked about Game Showdown. We talked about uh top 100 games of all time and one of the things that we mentioned that we were going to do this year was a Death Stranding walk-athon marathon stream. A literal marathon stream where uh for every step that Sam Porter Bridges makes,",
            "start": 345.04
        },
        {
            "text": "of the things that we mentioned that we were going to do this year was a Death Stranding walk-athon marathon stream. A literal marathon stream where uh for every step that Sam Porter Bridges makes, Stone Bike Mike will also make that step in order of course going back to the bit if you don't know already that uh Mike is a hardened athlete. Uh he attempted or was had a thought or at least was going to run a marathon half marathon. Okay. The the half marathon shirt the half marathon uh got rained out so then everyone got the medal including myself who also didn't run it. Uh but Mike didn't do no training. Was not was not planning on going to that event but you know he he swears that he could have done it. Slept like a baby. I dreamt about it. You were running the marathon in your sleep every single night just tossing and turning. Uh so that was the idea behind this stream. And also of course uh I I had the honor of meeting Cojima and the Caroline Polich connection which uh is very",
            "start": 385.04
        },
        {
            "text": "every single night just tossing and turning. Uh so that was the idea behind this stream. And also of course uh I I had the honor of meeting Cojima and the Caroline Polich connection which uh is very exciting and like it's happening for the sequel. So I wanted to play Death Stranding 2 uh Death Stranding one. Uh I've never played uh a Cojima game full through other than Peace Walker. Wow. Which is a weird one uh and half of Metal Gear Solid 5. So I wanted to really put my time in and and actually play Death Stranding. And I wanted to do it in some type of marathon stream because I know if I start I'm probably going to stop halfway through and then never actually finish it. So I wanted that accountability. So, I wanted to sit down with you or I guess stand up with you and uh have you walk and I play. And I thought that was that was create something something special and something unique. And Mike, we freaked it. We absolutely did that for uh Friday uh starting at I believe 2:00 p.m. all",
            "start": 428.96
        },
        {
            "text": "I play. And I thought that was that was create something something special and something unique. And Mike, we freaked it. We absolutely did that for uh Friday uh starting at I believe 2:00 p.m. all the way until Sunday ending at 3:30 a.m. 3:30 a.m. Uh we completely went crazy and we were just in this room ordering a lot of food. We'll probably do a tier list of all the food that we ordered and ate during this entire eat. Be big. You got to eat. You got you got to carb load. People say you carb load before the marathon. We carb load during the marathon. We were taking, you know, you have the they have the water stations where like the kids hand you like the Gatorade or whatever. People were handing us [ __ ] Red Robins fries. It was incredible. We needed to be our biggest supporters. Uh so we just went crazy on this weekend and we we we played the entire g most of the game. I think we had people said chat said by the time we finished it they said, \"Oh, you only have three hours left.\"",
            "start": 465.36
        },
        {
            "text": "we just went crazy on this weekend and we we we played the entire g most of the game. I think we had people said chat said by the time we finished it they said, \"Oh, you only have three hours left.\" And then we proceeded to do a seven-hour stream to finish it off yesterday. Uh well, you know, how how much of the the intro was ordering more food? Yeah. Okay. Well, that's again, you have to carload, right? You got to car even though Mike wasn't walking during the last one. We got to car. We need to figure out what these corn dogs were all about. Yeah. Again, we will do a ranking by the ending of this. So, which is the best uh dinners that we had, but I was I was very excited about this cuz I wanted to play this game and it looked interesting. Um, and Mike, I don't know what your impressions of this game are or like what you came into it with, like what you played a little bit of Death Stranding on stream a while ago. It was a special one for me because I'm a person who tried Death",
            "start": 505.52
        },
        {
            "text": "of this game are or like what you came into it with, like what you played a little bit of Death Stranding on stream a while ago. It was a special one for me because I'm a person who tried Death Stranding and I put it down. Uh, when I first played it, it wasn't for me. Uh, I usually don't vibe with these kind of slower games. And so I I put it down and I watched Miles Luna, who I got the idea from to do the walk-athon marathon stream. And I when you said, \"Oh, I want to be prepared for Death Stranding 2.\" I thought, man, this is the perfect win-win scenario, right? Me and Roger both get to play the game together and we can do a walk-athon marathon stream. So, like, let's make great content out of this. And so, I pushed you hard of let's do this in one weekend. And you said, Mike, like, why don't we just try one little 10-hour stream, see if it's a hit or not, and we'll go from there. And I I pushed you of like, no, let's sit in the room and let's play it all the way through. I think",
            "start": 541.76
        },
        {
            "text": "don't we just try one little 10-hour stream, see if it's a hit or not, and we'll go from there. And I I pushed you of like, no, let's sit in the room and let's play it all the way through. I think the audience will vibe with it. We're a month and a half away from Death Stranding 2. There's no better time for people to get caught up to get you and I prepared and kind of build the excitement for it. And also, you know, that's kind of my role here is to try to find fun and engaging ways to create content on the live stream side of things that our audience can have fun with, the team can have fun with. And it just seemed like a perfect blend of you and I together all weekend long, minimal resources, right? Greg, Tim, uh we we only called Barrett about seven times, you know, so we only a couple of times. He called you for help, but then we didn't want to bother you. It was too late. It was for the celebratory thing, the nice thing. Uh, you know, didn't want to call me then. We did call",
            "start": 582.16
        },
        {
            "text": "of times. He called you for help, but then we didn't want to bother you. It was too late. It was for the celebratory thing, the nice thing. Uh, you know, didn't want to call me then. We did call blessing. He he he now has confirmed that he saw the the call coming in. Like he was there. He was actively looking at his his phone and then decided to say no. And so for me, it was exciting, right? This is exactly what I wanted to do as something on the content side of things for kind of funny. I thought it was going to be really fun and exciting. And then on the flip side, I get to experience Death Stranding, right? play in quotes there, but like really I get to experience Death Stranding with you, one of my best friends, and also prepare for Death Stranding, too. And so for me, it was like this is a win-win. Let's see where it goes. And it turned out to be an experience of a lifetime. Roger. This is something that I will laugh at, giggle in my mind, and remember forever of you and I",
            "start": 623.36
        },
        {
            "text": "this is a win-win. Let's see where it goes. And it turned out to be an experience of a lifetime. Roger. This is something that I will laugh at, giggle in my mind, and remember forever of you and I starting on Friday at 2:00 in the afternoon and just kind of experiencing it moment by moment where it was going to go. How much will I walk? How little will I walk? How long is a Kajjima cutscene in a walking simulator game? We learned they're pretty long. But then we also learned that Roger doesn't follow the simplest path. Okay, because here's the problem, Chad. Roger's talking a lot. He's chirping a lot about like, \"Oh, Mike, you didn't play the game.\" Blah, blah, blah, blah, blah. And it's like, if I played that game, I would be cutting paths that people have never seen before, Roger. I would be following the most efficient path from point A to point B. There you are, Roger, looking at your best friend, snow bike Mike, on a treadmill, dying, right? Please, Roger, give me a break. Can",
            "start": 663.44
        },
        {
            "text": "be following the most efficient path from point A to point B. There you are, Roger, looking at your best friend, snow bike Mike, on a treadmill, dying, right? Please, Roger, give me a break. Can you just get to point A to point B, and you are out here taking the most inefficient routes possible, scal it up the side of a mountain, find an invisible walls, get lost on detours where we just needed to go and deliver the package, but god damn did it make for some great content. You know, I I What's her name? Snowike Mike. I thought it was snow [ __ ] Mitch for a minute there. I didn't realize that you weren't a hardened athlete that you couldn't figure it out because I see the vision, right? I see the vision. I'm trying to find the area of the most uh uh friction but also the least friction. You know what I mean? Sometimes you got to go up the mountain to go that down the mountain. You're trying to go around the mountain. That's going to that's going to prolong your hurt. I just want to go",
            "start": 704.56
        },
        {
            "text": "know what I mean? Sometimes you got to go up the mountain to go that down the mountain. You're trying to go around the mountain. That's going to that's going to prolong your hurt. I just want to go up it and then down it. So, I figured it out. Uh and that's going into it really quick. We're talking about the game itself. I forget who said it in chat, but it was such a a clicking moment for me of why I was digging this game so much. And if I'm at the point now where of course we have the sequel, so I I shouldn't probably go back and replay some of it, but I really want to because uh the chatter said uh this game is uh going to uh picking up your groceries from the car and bringing it all into the house in one trip simulator. That's what that's what it is. And and that is something as I feel like that's like a like a like a dude thing like like you know what I mean? Like a dad a dad dude thing, right? Where it's like, \"Oh, I got this. Don't worry, honey.\" And it's like, \"I have free",
            "start": 751.6
        },
        {
            "text": "feel like that's like a like a like a dude thing like like you know what I mean? Like a dad a dad dude thing, right? Where it's like, \"Oh, I got this. Don't worry, honey.\" And it's like, \"I have free hands. I can help you.\" \"Oh, no. I got this.\" And you just just take everything in your hand. You're about to fall. You're about to break the eggs, but you do it anyways. And you're like, \"God, look how cool am I.\" That's what this game was for me. And it was such a great experience trying to basically do the things that I do in Skyrim, right? Where I'm just like I'm like breaking the [ __ ] geometry. I'm finding all the little rocks that I can go up that the developers didn't really design this for, but I'm gonna figure it out and I'm gonna go around it. Like I was breaking this game so much that I found [ __ ] invisible walls. I didn't realize that there were invisible walls in this game, but we found it. We climbed up a mountain and they were like, \"Yo, you can't go up this [ __ ]",
            "start": 788.96
        },
        {
            "text": "much that I found [ __ ] invisible walls. I didn't realize that there were invisible walls in this game, but we found it. We climbed up a mountain and they were like, \"Yo, you can't go up this [ __ ] mountain. You got to stop going up this mountain.\" Uh, and for me, that is the stuff that I really clicked with that I didn't realize or even think that I would even click with. I thought I would be a story person. I thought the story was going to be the thing that uh made me keep on going throughout this, you know, 50hour experience. But instead, it was actually the gameplay of it. And if I were to do it over again, I absolutely would because I now I see the vision. Now I get it everybody. I should have built roads. I get it. I should have built a few zip lines here and there. But uh once I actually figured out, oh, I should have been building zip lines and I actually did it for the first time. [ __ ] clicked everything into my mind. And this was this gameplay experience is something",
            "start": 822.88
        },
        {
            "text": "I actually figured out, oh, I should have been building zip lines and I actually did it for the first time. [ __ ] clicked everything into my mind. And this was this gameplay experience is something special. Yeah, I think that's the fun part about making it a live stream and content and kind of knowing that your your best friend is walking the entire time. like we can't sit around and kind of look out and map out what you want to do because this game is really fascinating, right? It is a true just open world and you choose how you want to go and attack it and then they give you tools that will help you elevate that throughout, right, of like, hey, let's make this a more efficient and easier where you can build a road, then you can ride your motorcycle on it or we can make these zip lines that will conquer all of the terrain and you'll just fly over it. And it's like when you're making content and it's supposed to be for the laughs and it's also like, hey, Mike is dying on this and we",
            "start": 858.8
        },
        {
            "text": "that will conquer all of the terrain and you'll just fly over it. And it's like when you're making content and it's supposed to be for the laughs and it's also like, hey, Mike is dying on this and we only have so many hours in the day. You're screaming at me as I'm trying to go up a mountain. We cannot just sit there and utilize the tools that are given to us. It you miss out on a lot and it's wild to think of like we did it. I think a lot of people get caught up in the first one at the beginning of the game and I found this the most fascinating. like they give you three paths and you kind of go oh okay like I see the vision but then after that they just like good luck figure it out you can go any way you want and then and then they build on that of like now you can build all these things I found that so fascinating and cool that it's just the ultimate sandbox of go whatever you want to do try to climb this Rogers got too many boxes on the back of his head and he's in a cave and he's",
            "start": 896.16
        },
        {
            "text": "I found that so fascinating and cool that it's just the ultimate sandbox of go whatever you want to do try to climb this Rogers got too many boxes on the back of his head and he's in a cave and he's swaying left and right now I'm hitting the ceilings of things and the boxes are falling down it was cool yeah it's gameplay Playwise, it was cool. Absolutely. The uh the word that I kept on going back to was meditative, right? Even though I'm on a stream and it is like flashing light, like bright lights in my face. Mike is walking. It smells like burnt rubber because we're burning this [ __ ] treadmill the entire time. Uh I did have that sense of like, oh, if I had this and a glass of wine, I could just do this all night. Like I can just really take my time. And it kind of resets it reset me as like a gamer a little bit. Cuz for me, I'm the person that if you it is a nightmare to watch me play a video game most of the time because my fiance, she doesn't play video games like that. So like",
            "start": 935.12
        },
        {
            "text": "like a gamer a little bit. Cuz for me, I'm the person that if you it is a nightmare to watch me play a video game most of the time because my fiance, she doesn't play video games like that. So like she watches a lot of the um gaming experiences as like a spectator, right? I'm the one in the control controlling scene. I'm the one playing the game. And as she watches me, she's like, \"You got to stop [ __ ] running around. You got to stop pressing the the L3. You got to stop looking swinging the camera around like you have like you're like you have no attention to anything.\" Like I'm always running and going from here, here to here, not really focusing on anything, trying to find, you know, getting lost. For this, it is, oh, you go from here to here. You're going across the country. All you have to do is just take your [ __ ] time. Just take your time. Build a rope. Like, there is nothing in between there. Of course, there are sometimes when, you know, an enemy pops up and a [ __ ] BT",
            "start": 976.64
        },
        {
            "text": "have to do is just take your [ __ ] time. Just take your time. Build a rope. Like, there is nothing in between there. Of course, there are sometimes when, you know, an enemy pops up and a [ __ ] BT attacks you and you're freaking out and it's annoying, but other than that, it is you just had to take your time. You got to just think about what you're doing here. And the journey in the game play is the journey, right? It is going from point A to point B. It is not just a uh I didn't for the first time in a video game in a very long time, I didn't think of going from point A to point B as a chore. I thought that is the game, right? That is the fun of the game and that is kind of the most subversive sub subver Jesus Christ subversive thing that I um didn't expect from a Kojima game. I didn't expect that the traversal was going to be uh such a key part of the fun of a game. What a a fun time, Roger. I had something on the top of my head, but I I forgotten it. But it's just it was so much",
            "start": 1014.56
        },
        {
            "text": "expect that the traversal was going to be uh such a key part of the fun of a game. What a a fun time, Roger. I had something on the top of my head, but I I forgotten it. But it's just it was so much fun to watch you work through things, watch you explore this world and kind of be a passenger alongside your decision-m. I think that's the fun part when we always talk about it's always a nightmare to watch someone play a video game because you're thinking of five different things they're not thinking of or you want to go some other way. So, it's always fun to see what people decide and what you decided to do. I'll I'll never forget our, you know, most of our tres took about 15 minutes. Some of the longer ones were like 24 to 30 might have been the longest one, but somehow Roger on a normal trek that's supposed to be like 13 minutes took 45 minutes. And that was just him exploring, wanting to conquer the terrain, wanting to have his own story. And I think that's a really cool part about",
            "start": 1053.92
        },
        {
            "text": "trek that's supposed to be like 13 minutes took 45 minutes. And that was just him exploring, wanting to conquer the terrain, wanting to have his own story. And I think that's a really cool part about this. And on top of that, right, you're in this world that is kind of experiencing this insane situation going on with the timefall and the start of Death Stranding, right? And it's like nobody's out there, right? The only people out there are porters similar to you that are moving packages and supplies to different areas. There's also the bad guys with Higs, but like it's wild of like there's nothing, not even wildlife in this world. And so it is a very empty world. And when that music swells up and you crest that first peak and see a vista or you go to some, you know, the big um where we burned your mother's uh corpse there, the big furnace or whatever incinerator. It's like, oh man, like these are cool. And the art style in this game is wicked do. Yeah, man. It's uh it's",
            "start": 1095.12
        },
        {
            "text": "um where we burned your mother's uh corpse there, the big furnace or whatever incinerator. It's like, oh man, like these are cool. And the art style in this game is wicked do. Yeah, man. It's uh it's hyperrealistic, but it doesn't uh it rarely, I should say, uh gets to the uncanny valley. Uh right, we have we have characters and people that I know, right? I've seen their faces in movies and television and their directors. We have Gilmore del Toro in this. We have Mads Mickelson. But I was very rarely creeped out by like, oh, that's Mads Mickelson, but he's in a video game and he's not real. But it's like they they have created this world that uh feels so effortless. And I think I stand by this. We were having that discussion during the stream where I was like, I think this might be like top five best looking video games ever made. And you were like, no way. And then we started talking through it and we're like, oh, maybe it is. Like I I at least totally think this is my top five.",
            "start": 1140.72
        },
        {
            "text": "top five best looking video games ever made. And you were like, no way. And then we started talking through it and we're like, oh, maybe it is. Like I I at least totally think this is my top five. probably top three honestly uh best looking uh highest fidelity video games ever made because the stuff that they were able to do especially when it came to the terrain of this world like the the moss on this these rocks like look photo realistic and I just can't I'm so excited to see what Death Stranding 2 is uh specifically when it comes to that and the visual fidelity of it cuz man it looks so good in 2019 uh 6 years later holy [ __ ] I'm I'm sure that they're doing some crazy stuff with the desk man that death man awesome is right I love the the crazy collabs that he had with Conan and the cosplayer. That was crazy. Uh him with the weird otter hat was so much fun. It It's wild that there was there's so much to this game and like you and I we learned a lot. We didn't do much of it, but",
            "start": 1181.92
        },
        {
            "text": "cosplayer. That was crazy. Uh him with the weird otter hat was so much fun. It It's wild that there was there's so much to this game and like you and I we learned a lot. We didn't do much of it, but like it's crazy that there's an otter hat that you can put on that helps Porter Bridges swim a little bit more. You got a crazy exo suit that you can put on. You can build these roads. And it's like, well, we didn't build any roads, but man, when we jumped on other people's roads, that was awesome. Thank you to everybody who built those. The online connection is cool, too, right? Of like you start and you don't really see that. Then out of nowhere, it's like, oh, well, here's somebody else's rope that they like took this path and they're going to help you out. Oh, later on in the game, 20 hours in, here's this guy's road that he built out and like really thought about. It's like that's really awesome, too. So, I loved like all of a sudden you started integrating like other people's",
            "start": 1223.04
        },
        {
            "text": "20 hours in, here's this guy's road that he built out and like really thought about. It's like that's really awesome, too. So, I loved like all of a sudden you started integrating like other people's buildings and we shared this world that was our world, but also like Yeah, we started connecting the knots. It work it works as a great uh tutorial uh right where you're walking around this world and like someone like me who was not building anything at first right seeing the amazing creations and the smart designs that people were building out right where someone I think I think I used someone else's zipline for the first time that was how I was introduced to the zipline even though they wrote it and they said you can use a zip zip line but I'm like how how far can a zipline go right you jump on someone else's zipline for the first time they very smartly I don't know how they built this out but they do it in a great way where you know if you don't have anything built in a certain area,",
            "start": 1261.2
        },
        {
            "text": "on someone else's zipline for the first time they very smartly I don't know how they built this out but they do it in a great way where you know if you don't have anything built in a certain area, they're going to put something there from someone's online experience and throw it there and show you, hey, listen, you could be using these things and you hop on the zipline for the first time and you're like, oh, this is how I could be doing this. I could be building out an entire world. Uh, so it it works as both a, you know, working into like the themes of the game as we'll talk about, right? Like connection and, you know, all these different people that are connecting and and throwing different uh uh zip lines and roads. So, it works in that sense, but it also works as tutorializing the entire experience, which is great. We didn't get to see Jeff Keley. No, we didn't. Disappointed on that one. Come on. We should saw Herman. Shaw Herman. That was pretty lit. Conan, of course, we saw",
            "start": 1300.32
        },
        {
            "text": "entire experience, which is great. We didn't get to see Jeff Keley. No, we didn't. Disappointed on that one. Come on. We should saw Herman. Shaw Herman. That was pretty lit. Conan, of course, we saw Conan. That's right. Then there's a bunch of big names that he brought in. A awesome cast. A small cast, but an awesome cast. Roger. And I want to talk about the cast right after a word from our sponsors. This episode is sponsored by Subway Servers. The goated endless runner that carried me through middle school, high school, college, and now adulthood is celebrating their 13th birthday, which also marks their 200th World Tour update. And they're going big because Subway servers decided to travel to not one, not two, but 21 different locations in their 200th World Tour special event. It's kind of funny. As Resident Zoomer, I can seriously say that I adore Subway Surfers. It's one of my favorite comfort games. Grabbing items, completing challenges, and pulling out a hoverboard right as I'm",
            "start": 1336.08
        },
        {
            "text": "of funny. As Resident Zoomer, I can seriously say that I adore Subway Surfers. It's one of my favorite comfort games. Grabbing items, completing challenges, and pulling out a hoverboard right as I'm about to hit a train feels just as good now as it did when I was sitting in the back of Mr. Coburn's Spanish class. Play through all 21 destinations to unlock amazing rewards such as characters, hoverboards, and in-game currency. Just tap the 200th World Tour button on the screen to start playing. And exclusively for best friends, head over to kind offunny.com/subway servers or scan the QR code on screen to get a ton of special in-game rewards. The update ends on June 1st, so scan that QR code, download Subway Surfers, and start running if you don't want to miss out on all the rewards. I already did. This episode is brought to you by Factor. When life gets busy, food can sometimes feel like a chore. And the fast food trips can go from a weekly to daily occurrence very, very fast. So, buck",
            "start": 1379.92
        },
        {
            "text": "did. This episode is brought to you by Factor. When life gets busy, food can sometimes feel like a chore. And the fast food trips can go from a weekly to daily occurrence very, very fast. So, buck those trends and make this season your best with nutritious 2-minute meals from Factor. Eating well has never been this easy. Just heat up and enjoy, giving you more time to do what you want. With 45 weekly menu options, you can pick gourmet meals that fit your goals. Truce from Calorie Smart, Protein Plus, Keto, and more. We at Kind of funny love factor meals. Blessed Greg love it for a quick lunch in between shows, and I adore it as a healthier alternative instead of the dreaded hump day too tired to cook drive-thru run helping me to get on track with my goals. Get started at factormeals.com/kindaffunny5050 off and use code kind of funny50 off to get 50% off plus free shipping on your first box. That's code kind of funny50 off at factormeals.com/kindfunn5050 off for 50% off plus free",
            "start": 1421.36
        },
        {
            "text": "off and use code kind of funny50 off to get 50% off plus free shipping on your first box. That's code kind of funny50 off at factormeals.com/kindfunn5050 off for 50% off plus free shipping. factormeals.com/kindofunn5050 off. All right, so we talked about our experience over the weekend. Me walking, you playing us eating a lot of food. So much food, late nights, a lot of laughter. Talk about Chad Kroger. Yeah, I'm sending an email, too. Might change my life. Mike's Mike's reaching out and making some connections of his own. We learned about it. Him and Lenny Kravitz. I'm going to throw the phone in the ocean. 30 days. 30 days on his compound in Peru. There's some moments here that got to be found inside of there. Or maybe if you just watch it, you'll enjoy and laugh because there there was some great times together. And the entire thing uh is going to go up uh this Saturday. It is uh actually processed. It's going up. So on YouTube, you can check it out. Uh Saturday, I'll probably",
            "start": 1469.32
        },
        {
            "text": "was some great times together. And the entire thing uh is going to go up uh this Saturday. It is uh actually processed. It's going up. So on YouTube, you can check it out. Uh Saturday, I'll probably throw it up at like 6 a.m. our time, but get it up super early for the East Coast people. Watched a lot of KFAF episodes. Shout out to Nick and Andy for the stream on the car. We had to get a written notice from them. Exactly. We had to get approval from those two to play some old episodes. And so yeah, it was a really special experience to share with you, Roger, our incredible audience of kind of funny best friends. So, I encourage everybody to check out the VOD that will go up this weekend. Watch the finale that also happened last night. But I think another cool part is we talked about the gameplay, Roger, but there's a wild story going on. And I think at first you kind of get hit with it and there's a lot to take in. By the middle there's a lot of questions and by the end you're riding",
            "start": 1520.48
        },
        {
            "text": "Roger, but there's a wild story going on. And I think at first you kind of get hit with it and there's a lot to take in. By the middle there's a lot of questions and by the end you're riding this roller coaster of like, holy cow, it's going down. Kajjima's back again. But it's also carried by a really cool cast of characters. Yeah. No, absolutely. Yeah, I that was that was surprising to me. Uh, right. As I mentioned earlier, I was I put my I put my nose up. I thought my nose at the idea of like, oh, these characters are named Fragile and Die Hard Man and Dead Man. I was like, what a what a strange idea. But by the ending of this, I'm like, these this is my crew, right? Like, this is this is absolutely my crew. And I [ __ ] with all of them in different ways. And now I'm at the place where, man, I we've watched the I'm sure we've seen the trailers for Death Straining, too, right? I'm sure you've seen at least one of them, right? I've seen one of them or two of them before, but like I",
            "start": 1559.2
        },
        {
            "text": "man, I we've watched the I'm sure we've seen the trailers for Death Straining, too, right? I'm sure you've seen at least one of them, right? I've seen one of them or two of them before, but like I that meant nothing to me. It's all white noise, right? Like now I know and I haven't rewatched those and I'm so excited for the sequel. Um because man, this is such a great crew of characters as you were alluding to. Yeah, it's interesting of Sam Porter Bridg's uh journey, right? Someone who has dooms uh doesn't like to be touched because of his dooms level allows like the BTS can touch him and he gets a rash. So now he's also a porter. He's out by himself, right? this a guy that's kind of isolated and doesn't have much connections going on. His mom calls and he's like, \"Mom, I don't want to do it right now. Mom, I won't do this. I'm busy on the road by myself.\" And it's like wild when you bring up your crew because at the end it's a team. This is a team effort and everybody's together and",
            "start": 1603.44
        },
        {
            "text": "it right now. Mom, I won't do this. I'm busy on the road by myself.\" And it's like wild when you bring up your crew because at the end it's a team. This is a team effort and everybody's together and they're here to help Sam overcome this giant obstacle and save the universe and the world. It's like, wow, that was like a really big journey to go on because at the beginning Sam was gruff. He wasn't speaking much. He wasn't wasn't shaking anybody's hands. He was just a man on a mission. And then it changed to like, oh, this is some beautiful stuff. He's got a team. Yeah. And I I think that goes back to like the which I understand. I think this is like even though I love this game so deeply, uh I think for a multitude of reasons, right? The connection that we had during the stream like that whole scenario of us playing it just m elevates the game so much on top of that. But I love the game for what it is. I will never begrudge anybody for uh the criticisms that they will have about the",
            "start": 1641.04
        },
        {
            "text": "whole scenario of us playing it just m elevates the game so much on top of that. But I love the game for what it is. I will never begrudge anybody for uh the criticisms that they will have about the writing or uh the way that Kojima builds out his stories because I get it, right? It is very on the nose in some places. It is very aloof in other places, right? He overexlains a lot of things and then he underexlains a lot of things that I'm sure he should have actually just explained in the first place earlier on. Like dead man. What's up with Dead Man? This Frankenstein that we just kind of gloss over. Oh, okay. He's built of stem cells and dead individuals. Don't worry about it. He doesn't connect, but it's about connection, right? He doesn't like connecting. He doesn't have any friends. Um, I get it. I totally understand the criticisms behind all that, but it worked for me. It wor it all worked for me of like it is so campy. It is so out there. The fact that this character is this",
            "start": 1681.36
        },
        {
            "text": "Um, I get it. I totally understand the criticisms behind all that, but it worked for me. It wor it all worked for me of like it is so campy. It is so out there. The fact that this character is this character is wearing a mask and die hard man and his whole thing is that he it's hard for him to die, right? Like, it is so it is so on the nose. But it works for me because um of just how uh simple the story is and uh also the world that they've built here, right? Where everybody is so afraid of connection at the very core of their existence, right? Cuz like connection could kill them, right? Like the idea of connecting, getting too close to somebody. That is what basically um broke a lot of these people and their origin stories, right? Was their connection and then the severing of the connections and then they all go mama, you know, with her baby, right? Like it's that is kind of the core of it. So then when you have like characters that have insane names, right, it is almost like this",
            "start": 1721.44
        },
        {
            "text": "and then they all go mama, you know, with her baby, right? Like it's that is kind of the core of it. So then when you have like characters that have insane names, right, it is almost like this layer of protection between, you know, the connection that they want to have deep down, but they also don't want to have because they want to protect themselves. So yeah, it works for me on that level, but I understand the criticisms of it all. For sure. Tell me some of your favorite characters cuz I know you love Hartman. Yeah, Hartman's my guy for sure. I mean, I I I could watch an entire movie about Hartman, right? When I think about like what the A24 movie is going to be, like I I think about some of these characters, I'm like, \"Oh, I want a prequel. I don't even want a sequel. I want a prequel.\" Uh, I don't want an adaptation of the game. I want them to explain or or go into some of these characters a little bit more. But yeah, Heartman, uh, for anyone that doesn't know, is a, uh, character",
            "start": 1762.48
        },
        {
            "text": "Uh, I don't want an adaptation of the game. I want them to explain or or go into some of these characters a little bit more. But yeah, Heartman, uh, for anyone that doesn't know, is a, uh, character whose, uh, family is killed in the initial Death Stranding, in the initial void out. Uh, and, uh, during that moment, he also dies or or at least his heart stops for a little bit. So, he sees his family going on the beach, which is like their version of purgatory. Uh, and then he wakes up. He he he's revived uh, from his uh, his his heart attack. and he spends the next uh you know years of his li life dying every 21 minutes he dies for 3 minutes and he goes on the beach and he tries to search for his family and he's like forever alone like he's he there's no connection to anybody else on this beach uh so I I thought one that was such a interesting and unique character idea right and like the way that they built out his room and everything around him like they sold me on the idea that a man",
            "start": 1796.4
        },
        {
            "text": "uh so I I thought one that was such a interesting and unique character idea right and like the way that they built out his room and everything around him like they sold me on the idea that a man could die every 21 minutes for three minutes and he's figured out his life like he's very efficient Uh and also uh just the the way that that how compelling that is, right? Like I think that's like that that kind of that that was one of the moments that like touched me in the fields uh where you know this guy is just trying to search for the only thing that has ever connected him to people right his family uh and he just is forever alone in that sense. How about Big Cliff? Big war hero. War hero. That's Mads Mickelson everybody. That's Mad Mickelson. He put on a performance. Yeah man. That dude delivered. Yeah, it's that's that was really cool because I love Mads Mickelson. I I don't know how how familiar you are with his work, but like I I love Hannibal. Uh he's incredible as Hannibal",
            "start": 1840.32
        },
        {
            "text": "dude delivered. Yeah, it's that's that was really cool because I love Mads Mickelson. I I don't know how how familiar you are with his work, but like I I love Hannibal. Uh he's incredible as Hannibal Lectctor in the show. So, it was it was great to see him and I also he was also the guy that I would see in all the trailers. I'm like, \"Okay, I know Mads Mickelson's in this, but like what is his deal?\" Right? And by by the ending of this, it was very aloof until the very ending when you when you get that reveal, which I won't spoil necessarily for anybody. We might get into spoilers in a little bit, but uh I thought that twist was really great and the his overacting is also perfect, right? like him him they they have the flashbacks of him talking to the BB and him being I'm going to take you to the moon BB I'm going to take you to the moon. It is so overthe-top uh but it works in context and it he brings it home for sure. Yeah. When that story evolves and you learn more and more. I love",
            "start": 1879.2
        },
        {
            "text": "to the moon BB I'm going to take you to the moon. It is so overthe-top uh but it works in context and it he brings it home for sure. Yeah. When that story evolves and you learn more and more. I love every moment of connecting to BB and getting a flashback, right? And at first we're like is this BB's memories? Whose memories are this? Because you are seeing it through the eyes of BB. You are in the the tube and you're going okay well I guess this is the baby. like what's going on and to see it more build out and die hardman and then the story with the president like oh man this is crazy I love it but I also think that that is a little bit of my criticism towards the ending of the game I think that's one of my criticisms of the game kind of like start to snowball a little bit right I still love this game I think I would say if I were to give it a score on the kind of funny scale I would say it's like a a nine out of 10 for sure like it's an amazing video game but that last kick of the",
            "start": 1915.52
        },
        {
            "text": "love this game I think I would say if I were to give it a score on the kind of funny scale I would say it's like a a nine out of 10 for sure like it's an amazing video game but that last kick of the game I don't know if it was the hot dog the hot dogs that we had the corn dogs I don't know if what was happening there. But it just he overexlained a lot of situations that I don't think we needed to overexlain because it was shown to us many times before and there was a lot of things that I was just like could have used a little more time on that one. Right? And that was the Mads Mickelson of it all. Right? Where we had it, we saw it. We saw it every single time we would we would connect to the baby. We would see a cut scene. So I got most of it, right? But we just kept on showing the same thing sort of. And like there was a moment where they explained I guess the BB of it all, right? They show it. I'm like, \"Oh, I got it. Cool.\" And then they like took a very long time to finally reveal",
            "start": 1954.96
        },
        {
            "text": "sort of. And like there was a moment where they explained I guess the BB of it all, right? They show it. I'm like, \"Oh, I got it. Cool.\" And then they like took a very long time to finally reveal like exactly and tell it to the audience. And I just feel like those things could be could have been um conjoined a little bit more um and truncated. Uh and then also of course with like the actual ending of the game where people were like man that last hour of this game is crazy. I'm like, I for sure I agree with you. But I get what he was going for of like, you know, you're running on the beach and there's like this constant like you have to it's it's a very you just have to keep on going through the motions cuz that's what you know uh Stan Porter Bridges is going through in the on the beach in the actual world. Uh but as a player, I was like, man, we we could have just made this a little bit shorter. Uh cuz I wanted to because you know, we're at the point now where I want the answers and",
            "start": 1991.52
        },
        {
            "text": "the actual world. Uh but as a player, I was like, man, we we could have just made this a little bit shorter. Uh cuz I wanted to because you know, we're at the point now where I want the answers and now we're just we're just stringing us along a little bit more. Well, here's what we're going to do. It's time to rip the band-aid off, Roger. I appreciate you being so good to our audience out there of holding back the spoilers, but of course, as Toby Blue writes in and says, \"Go full spoilers.\" In my opinion, it's a six-year-old game and most of us have watched through the stream together. So, yes, right now, we're going to pop the top on this, Roger. I don't want you to hold back anymore because I know you're doing so well at keeping it all hidden and kind of shadowed off, but like let's talk Take the jacket off, Roger. And let's talk about full spoilers. Let's get weird with this story, Roger. Because yeah, BB is, it turns out to be a couple of things. Your BB that you see in the memory",
            "start": 2026.08
        },
        {
            "text": "Take the jacket off, Roger. And let's talk about full spoilers. Let's get weird with this story, Roger. Because yeah, BB is, it turns out to be a couple of things. Your BB that you see in the memory suit is actually Sam Porter Bridges. It's him, but the BB on your thing is actually a different BB. It's a different BB. It's not him. And so you think it's a BB, but it's not your BB, but then it turns out to be your BB because it's your baby. Yeah. Right. And it's like it's crazy story, Raj. It's a crazy [ __ ] Uh but yeah, that's I think that was my just initial criticism of like, man, we're we're we're so close. We're so close to like expl we explained it. We explained it when we when you show uh uh my sister. Oh, [ __ ] Why am I forgetting her name? Amaly. Amaly. [ __ ] I was going to say alphabet, which is the which is the mama's twin sister, whatever, but it's not her actual name. Whatever. Uh Amaly. Uh when you're with Amaly, right? Um and she like shows like they show it. They",
            "start": 2064.8
        },
        {
            "text": "say alphabet, which is the which is the mama's twin sister, whatever, but it's not her actual name. Whatever. Uh Amaly. Uh when you're with Amaly, right? Um and she like shows like they show it. They show like the thing of like oh the baby and like gripping the baby. I'm like oh. And I put two together that moment, but then it takes like 20 to 30 minutes later to then be like fully do it again. I was like, man, I just wish that we can continue that. So, I already knew about that. Washi already told me cuz I a long time ago. This is an old game and like me and my buddy Washi were talking and Washi was like, \"Wow, this game's [ __ ] crazy, Mike.\" I was like, \"Washy, just tell me. Like, I don't know if I'm ever going to play this [ __ ] Just tell me.\" And so, I already knew about um Cliff being the father to and Porter Bridges. And there was a moment in our stream yesterday when we got to the finale where you connected the dots, but then you were like, \"Okay, cuz it took we didn't get",
            "start": 2109.04
        },
        {
            "text": "being the father to and Porter Bridges. And there was a moment in our stream yesterday when we got to the finale where you connected the dots, but then you were like, \"Okay, cuz it took we didn't get there, right? We got we got right to the doorway where it's like if you put it together, you would understand, oh [ __ ] is Sam Porter Bridges the baby here and he's his son, but then we kind of pull back and then we don't go full in until later on.\" And so I got to watch you live in person go, \"What? Oh my god, am I?\" And then like you had to stop because we just we went hard left and I totally get what you're talking about there because it did take some time to finally go back tell us the whole full-on story of oh yeah Sam Porter Bridges is that baby and oh man that baby died and then Amaly met him on the beach gave him the Lion King threw him back and said you're a repat now. He's a repat now. Yeah. It's it's interesting because I I understand I think I'm I'm I'm starting to understand",
            "start": 2147.04
        },
        {
            "text": "met him on the beach gave him the Lion King threw him back and said you're a repat now. He's a repat now. Yeah. It's it's interesting because I I understand I think I'm I'm I'm starting to understand the way that Cojima works and operates right. He is somebody that really respects and loves uh acting, right? He loves to see his favorite actors act and do their thing. And man, they they nailed it. They nailed it. They did a great job. Die Hard Man is what I was going to get at, right? So I he likes to stay with those moments and spend a lot of time with these actors and make sure that they have those moments. Um and then everything else kind of falls to the wayside a little bit, right? Like he explains it and it's there in the game. I'm sure I would have understood that uh the uh the timefall wasn't timefall by the ending of it, right? If I if I really like listened to it and connected the dots, right? But it just it didn't by the time we ended the game, I was like, \"Oh, wait, what?\"",
            "start": 2192.08
        },
        {
            "text": "wasn't timefall by the ending of it, right? If I if I really like listened to it and connected the dots, right? But it just it didn't by the time we ended the game, I was like, \"Oh, wait, what?\" And the chat's like, \"Oh, no, that's not Timefall. Don't worry about that.\" Well, I took that as like we stopped the Death Stranding, so the rain is now safe again. Yeah. But then it it just it got a little confusing where it's funny cuz it's like this game is very confusing uh throughout the entire time, but I felt like I was there. I felt like I was I got it and I understood it, but in the last hour of it kind of exploded everything, but then also built it back, but in a way that I wasn't I I never got to the place that I was before where I I felt like I was on it and I was getting it and I was I was on the same path as Cojima and then we get to the end I'm like, [ __ ] I do need that hourong video explaining it all, which is not a bad thing, right? I mean, a lot of a lot of games that I",
            "start": 2234.8
        },
        {
            "text": "I was on the same path as Cojima and then we get to the end I'm like, [ __ ] I do need that hourong video explaining it all, which is not a bad thing, right? I mean, a lot of a lot of games that I love do that exact thing. Yeah. Uh, but it just it felt like I I want this next experience. I know it won't happen to just be a little bit more tighter when it came to when it comes to the narrative. I know that's never going to happen. It's going to be crazy, Ro. It's going to be more. Where do we go? Cuz like fragile, right? Yeah. But what's the line? But I'm not that fragile. But she says it differently twice. He says, \"I'm fragile, but I'm not that fragile.\" It gets me every time. I love it every time. And that story was crazy with her and Troy Baker, who we'll get to in a minute, as Higs, who is the bad guy of all of this, wanting to push for the Death Stranding, the big apocalypse, the extinction level event. And it's like, man, Fragile has a story. And at the beginning, she's just",
            "start": 2270.16
        },
        {
            "text": "who is the bad guy of all of this, wanting to push for the Death Stranding, the big apocalypse, the extinction level event. And it's like, man, Fragile has a story. And at the beginning, she's just eating these space bugs. And you're like, \"All right.\" Like, what's up with Fragile? She's just teleporting all around. And then she gets the coolest story in the video game. I loved that part. Yeah. No, I I her whole thing. I was like, \"This is corny in the beginning, but then you get to that point. you get that. Yeah, he does a great job of making you care about characters that you will ne you would have never thought that you would have cared about uh just by giving them the most tragic backstory humanly possible. That and Mama uh just two extremely tragic backstories that uh you're going to uh then love those characters forever because of that. Man, that Mama's backstory was tough, too. Insane. Yeah, that was an insane one. And then she builds the she builds the weapon to cut BTS out",
            "start": 2308.56
        },
        {
            "text": "to uh then love those characters forever because of that. Man, that Mama's backstory was tough, too. Insane. Yeah, that was an insane one. And then she builds the she builds the weapon to cut BTS out from this world to send them and actually send them fully gone. And it's like, \"Oh, we gonna we're gonna cut the baby.\" That's crazy. That's a wild one. Yeah. It is funny that he he's like, \"Hey, we got to kill one Margari.\" But I love Margaret Quali. So, we got to have another Margari. We got we got twin sister. They're going to become the same. Sister, they're going to become the same. Don't you worry about it. Don't worry about it. Uh, but I also did like the way that that story um uh kind of came to a head at the ending, right? Because we have uh uh my mom, right? The two versions of my mom's sister, right? We have the one in in uh on the beach in the sky. We have Amaly and then we have uh Beatatric, right? Which was my real mom or Bridget? Bridget Bridget Bridges. Uh Bridget and then",
            "start": 2347.84
        },
        {
            "text": "sister, right? We have the one in in uh on the beach in the sky. We have Amaly and then we have uh Beatatric, right? Which was my real mom or Bridget? Bridget Bridget Bridges. Uh Bridget and then we have uh Amaly uh up in the sky, right? And then it's the same thing with uh Margari's characters, right? We have the one that's living, but then the other one's also in the BT realm technically, but then it's also like coming back and forth. It's like the ha and the ca. Um I enjoyed that stuff. I I felt like that that kind of came together for me because I first when we had the two versions of Margari, I was like, \"Okay, bro. I know you get I know you love Margari, but we could we could have Yeah, exactly. you kill her off or you don't kill her off, but I appreciated that. Yeah, that was good. Uh, you brought up Die Hardman. I want to kind of go through the list. I want to get to Higs for sure cuz I still have question marks. I question one of the weakesters. Yeah, let's talk about him",
            "start": 2388.48
        },
        {
            "text": "Uh, you brought up Die Hardman. I want to kind of go through the list. I want to get to Higs for sure cuz I still have question marks. I question one of the weakesters. Yeah, let's talk about him right now. He's a badass villain. Awesome look, right? Troy Baker giving a performance like really making you feel it. But then like he's so little used that it's like, \"Oh, I didn't get to learn much about him.\" And that's on purpose, right? Like I mean cuz he is in the sequel, right? Like they they they show him in the trailers, right? He looks badass. He looks a guitar, right? Like not to spoil anything, but you've seen him in the trailers. Well, I mean, we can spoil that. Well, yeah. I don't want to spoil for you. I don't know what you know. Whatever. Oh. Oh, you mean? Yeah. Don't worry. I've seen the trailers. And she also says like, \"I couldn't kill him.\" Yeah. Exactly. You're like, \"F what? You wanted to kill this guy.\" So, I'm sure for the next one, uh, he's going to be he's going to",
            "start": 2423.2
        },
        {
            "text": "seen the trailers. And she also says like, \"I couldn't kill him.\" Yeah. Exactly. You're like, \"F what? You wanted to kill this guy.\" So, I'm sure for the next one, uh, he's going to be he's going to be all all up in there. Uh, but in terms of the main story line, they really push him as like this is like the big bad. And of course, it's it's a swerve, right? It's a swerve cuz he's not actually the technical big bad. It is it is Amaly is is sort of the big bad. I would guess you would say she's the extinction level event. Um so I understand why but they build him as this this huge big deal and when you get there you're like oh I guess he's done now. Okay. And they even do like the Metal Gear Solid 4 thing, right? Where you're fighting him and you're punching him and it's like am I supposed to feel something right now? Cuz I'm not. And that's like that is the biggest gameplay thing that I have throughout this entire thing is that the boss fights are not very good. I don't think I've had",
            "start": 2460.72
        },
        {
            "text": "to feel something right now? Cuz I'm not. And that's like that is the biggest gameplay thing that I have throughout this entire thing is that the boss fights are not very good. I don't think I've had I had one really great boss fight that I think back on and say, \"Man, this is the one.\" Because they right before the I get into the the Troy Baker stuff and fighting. No, right after that, uh, they throw me into like a mini boss thing that just was just a bullet sponge and took forever and just stopped my progress fully and I just hate I hated it. And I was like looking at the chat and I was like, \"Am I doing something wrong?\" They said, \"No, this is pretty much what you're supposed to be doing. You're supposed to be just throwing grenades at them and and blowing them up.\" Took forever. And then we get to like the actual like the the the look of having, you know, Amaly stuck to a BT, this massive kaiju looking BT that is controlled by Higs is cool in premise, but it just results in me",
            "start": 2495.84
        },
        {
            "text": "then we get to like the actual like the the the look of having, you know, Amaly stuck to a BT, this massive kaiju looking BT that is controlled by Higs is cool in premise, but it just results in me shooting rocket launchers at them forever. And that was my biggest criticism of h of uh Metal Gear Slot 5. When I got halfway through that game, I stopped playing it because it was like, \"No, now you just got to shoot rocket launchers and blow up a bunch of zombies.\" I was like, \"That's not what I'm playing this game for.\" So, I think that's like the dissonance between um Cojima's like baseline design of like he's making this game this this this openw world uh delivery game and then oh now you got to have a big big boss fight. Yeah. Okay. How do I in integrate that? Well, you're just going to shoot a bunch of rockets at people. So, it's I want him to figure out some way to make that a little bit more cohesive. I don't know what that looks like. I don't know if it is non-traditional boss",
            "start": 2530.8
        },
        {
            "text": "shoot a bunch of rockets at people. So, it's I want him to figure out some way to make that a little bit more cohesive. I don't know what that looks like. I don't know if it is non-traditional boss fights. Uh but yeah, I I mean in my mind I'm like I I I I could have done this entire game without boss fights and been fine for the most part. Yeah, it was fun as a passenger to watch you, right, of like the first boss fight was exciting because you didn't know what was happening. You had that kind of like screaming, yelling of jumping from building to building to get out of the tar and then also fight back. And we were laughing, having fun, and there was a moment of like, oh, I'm figuring it out and I'm freaking out. And then by the end when you fought the giant whale, you're like, \"Oh, wow. This is really boring.\" Like this. I'm not even moving on this one. Like the first two boss fights, you were really actively moving, parkouring through this area while fighting. When you fought that",
            "start": 2569.6
        },
        {
            "text": "This is really boring.\" Like this. I'm not even moving on this one. Like the first two boss fights, you were really actively moving, parkouring through this area while fighting. When you fought that final whale, you stayed on the same roof the entire time. The the best boss fights, quote unquote, boss fights were the stuff of the cliff, right? Because that that is more Oh, those were sick. Those were more, I would like say, like cerebral like uh psychology based ones where you're inside of these uh massive uh uh war scenes, right? that you go through World War I, World War II, and then Vietnam. And then you're just b it's doing the same thing, right? Where you're running around, and then he has he has a bunch of guards that you're just picking up [ __ ] off the floor, you're shooting them, and then you just have to get the right cover situation, eat enough bugs, and then you're done. But it was fun to explore those areas. And I think maybe something like that, but with more",
            "start": 2605.76
        },
        {
            "text": "them, and then you just have to get the right cover situation, eat enough bugs, and then you're done. But it was fun to explore those areas. And I think maybe something like that, but with more exploration or even more cargo based things. Like if I had to deliver things to certain areas in order to get a gun, like that would be interesting, right? Like I I don't know. Like kind of connecting connecting the strands, right? connecting the dots between, hey, this game is all about balancing my weight and getting from point A to point B and then this boss fight is completely different when I'm picking up guns and shooting and it's called like it's Call of Duty is is is interesting and I think that that is a that is a big uh not issue but something that uh a design challenge for Cojima to potentially overcome. Well, it's interesting we talk about the boss fights, right? But then there's this openw world combat that I found really exciting to watch you. And what I'm excited for is like",
            "start": 2646.08
        },
        {
            "text": "potentially overcome. Well, it's interesting we talk about the boss fights, right? But then there's this openw world combat that I found really exciting to watch you. And what I'm excited for is like there's moments where we start going from, oh, you just deliver to, hey, there are other delivery guys out there that have now kind of gone rogue and want to steal your packages, right? I they're called the mules and you start to get a couple some weapons, right? You get the lasso gun and you can kind of do that. you get uh the rubber bullets, the rubber bullets and it's like there was fun moments of what I think we've seen with blessings preview and others previews and now heading into Death String 2 is like there's going to be a moment now where it's like oh you can completely avoid that and walk your path and get away. You can stealth through that and maybe slowly take them out or there's some combat here and you showed that combat in those kind of situations of like I'm just lassoing",
            "start": 2684.8
        },
        {
            "text": "walk your path and get away. You can stealth through that and maybe slowly take them out or there's some combat here and you showed that combat in those kind of situations of like I'm just lassoing guys. But it was fun and exciting to watch I'm sure. Yeah, it was way more involved than I thought it was going to be. I thought this was going to be, from what I heard, I I truly thought there was no way to non-lethally take out these people. I thought I had to just blow them up and then run away or something like that. Like I I thought it was completely a no-go. But no, you can you can really take these people down. And that's in the base game cuz uh we played the director's cut, we should say that specifically. Played on PC. Uh which so there are some added things. Uh but it doesn't seem like anything too formative. I think there's some like mini areas that we went to like that are indoors that are more stealth- based. Um, but uh the stuff that we were doing most of the time uh with like",
            "start": 2723.92
        },
        {
            "text": "anything too formative. I think there's some like mini areas that we went to like that are indoors that are more stealth- based. Um, but uh the stuff that we were doing most of the time uh with like the rubber bullets and stuff that was all, you know, added in the base game. So it was it was very surprising and it was fun. That was fun stuff. And that reminded me of like a Metal Gear Solid 5. So I'm excited for the next one to see how that expands and how how how stealth can I get with it? Yeah. And all some crazy mechs. Oh [ __ ] Is that what's happening next? I mean, I'm just seeing the trailers, right, of like seeing them on top of these giant bodies and stuff with like no heads. I'm so I I don't spaceship. Only thing I remember from the from the trailers are the kid stuff. Um, you know, Luis, as we'll talk about in a second, uh, just Luis walking around or being a little bit older and then, uh, the, uh, Troy Baker, Troy Baker running around with the electric guitar. That's all I",
            "start": 2759.68
        },
        {
            "text": "Luis, as we'll talk about in a second, uh, just Luis walking around or being a little bit older and then, uh, the, uh, Troy Baker, Troy Baker running around with the electric guitar. That's all I remember from the trailer. So, I'm excited to see more of it. I I think the exciting stuff is a lot of people are pointing out in the chat of like there's some cool Higs aka Troy Baker lore that you can go learn on some side stuff. A lot of people saying like when you do the marathon stream, you don't get to spend the time. And so the the fun part is like, Roger, do you think as the leadup to Death Stranding 2, will you spend a little more time going back to Death Stranding one? Right? Will you go and spend a night building roads, will maybe you go do some of the side content to expand the story? Because a lot of people are saying, \"Hey, maybe we missed out on that.\" Which is understandable when it's like Mike's dying. There's a timer on the stream. I'm Mike's y just like this or I'll kill",
            "start": 2797.28
        },
        {
            "text": "Because a lot of people are saying, \"Hey, maybe we missed out on that.\" Which is understandable when it's like Mike's dying. There's a timer on the stream. I'm Mike's y just like this or I'll kill you. So that's on me audience. You got to remember it's also a piece of content. Yeah. Yeah. It's a piece of content. And also like yeah, I will go back and play some of it, but also I think my criticism still stands, right? Like I understand you put more lore in the the side stuff, which I respect and I'm sure it's great, but also if you're if you're making a main villain of a game or like or a semi- main villain that I'm supposed to care about and doing the the big punching thing where it's like, oh, we're we're really putting everything into this fight, right? Like this is a huge deal that me and Higs have finally met and I don't really know [ __ ] about this guy and I don't really care about this guy. that stuff needs to be funneled into the main story uh pretty pretty well. Like I I you",
            "start": 2835.6
        },
        {
            "text": "and Higs have finally met and I don't really know [ __ ] about this guy and I don't really care about this guy. that stuff needs to be funneled into the main story uh pretty pretty well. Like I I you can't just leave that to the side stuff be like, \"Well, you didn't look at the side stuff.\" Like no, the main story needs to be the main story and it needs to you need to kind of account for that, right? He was a bad guy, though. He was a bad guy, though. He was dropping nukes, man. He had Fragile delivering nukes. He tried to get you to deliver a nuke. He had to whip that thing into the That was a cool moment. I enjoyed that when we failed that the first time like, \"What the hell am I supposed to do?\" That was cool. I really liked that. Yeah, that was fun. That was fun, man. Uh, and so yeah, I hope that you go back because I think the coolest part is we got to see the world share their creations with us. And I would have loved to see you spend more time cuz I think the coolest part is",
            "start": 2871.92
        },
        {
            "text": "I hope that you go back because I think the coolest part is we got to see the world share their creations with us. And I would have loved to see you spend more time cuz I think the coolest part is when we started building zip lines. And I love just like we talked about when you watch someone play a game, it's a nightmare cuz you're thinking of seven other things. You did good though. I will say I just want I don't want to cut you off but I'm saying you did great in terms of not backseat driving me. You did great and I do love the moment. I wish I had it. I want to I want to post it one day of just me just you just saying why don't you go around this. I said why don't you just shut the [ __ ] up. I was like Mike it's [ __ ] it's noon. I'm hungry. Shut the [ __ ] up. Let me cook it. It is so cool of like this game being a true sandbox and it being the walking sim where it the object is to get from point A to point B. Go however you want, right? And there's going to be people like me.",
            "start": 2905.52
        },
        {
            "text": "so cool of like this game being a true sandbox and it being the walking sim where it the object is to get from point A to point B. Go however you want, right? And there's going to be people like me. It's like well Roger, why don't you follow this canyon and then get to like the flat land where it's gonna be easy and take a slow walk around that. And you're like, \"No, no. I'm going up and over this goddamn mountain. I'm going to cut the time down by half. I'm going to make it.\" Another one. The vehicles. The vehicles. Okay, we got to talk about the vehicles for a second. You got to elevate the vehicles. Keep dude. Why is that thing banging off of every single rock? Roger. The end. I can't believe I can't believe I I love I love Cojima. You know what I mean? Like dapped him up, you know what I mean? Like it's a great guy. What the [ __ ] Like that that should that's a that is a that is an offense that should have delayed the video game. Like that is the fact that these [ __ ] this",
            "start": 2943.76
        },
        {
            "text": "what I mean? Like it's a great guy. What the [ __ ] Like that that should that's a that is a that is an offense that should have delayed the video game. Like that is the fact that these [ __ ] this [ __ ] I look at that. I just bang into the smallest rock humanly possible and it just hard stops me. Hard stops me. That is not how you [ __ ] design these things. No, it needs there needs to be some type of all-terrain vehicle. I know there's a truck that we didn't get. Oh, sorry about that one everybody. But either way, the [ __ ] uh motorcycle should not be hitting every single [ __ ] rock unless someone told me, which I couldn't I couldn't believe. They're like, \"Hey, you should do a wheelie.\" I was like, \"What?\" And I do a wheelie and you can just wheelie the entire time. And that avoids every single rock. Yeah, it was a That was a weird one of like do the wheelie and you were avoiding like 90% but you're also still banging into some. It's like just right there. Never felt good. Never",
            "start": 2988.32
        },
        {
            "text": "single rock. Yeah, it was a That was a weird one of like do the wheelie and you were avoiding like 90% but you're also still banging into some. It's like just right there. Never felt good. Never looked quite right uh with the motorcycle. And that was a disappointment of like the vehicles are clearly probably supposed to be used on the road, right? But when you go off-road with them, you're just having the time of your life. And it it felt so frustrating to watch you bang into things and be like, he's getting no momentum. Like just help him out. You know what I mean? Like we have struggling, just absolutely struggling in this game. Yeah. So that's a that's a huge area of of improvement for the next one. So I'm excited because it seems like that's that's the direction they're going forward. Um that that would be very exciting for me. also also made me laugh because we got a good one coming in um from one of the best friends out there. Did uh did you use the ramps and did you hit any",
            "start": 3027.12
        },
        {
            "text": "Um that that would be very exciting for me. also also made me laugh because we got a good one coming in um from one of the best friends out there. Did uh did you use the ramps and did you hit any stunt tricks from Jake C over there? I think we hit one and we're like we hit we hit three ramps total. One ramp was sick and it actually worked. The other two ramps sent us directly ver just dead vertical and then straight down. There was no ramp. I was like give him about 40 feet on that thing. Come on. Go come on go sliders. What a what a time on that one. Roger. And so, yeah, what are you what are you excited for for Death Stranding 2, Roger? Cuz I think of it like I mean, clearly we're putting all the boxes back on our back. Yeah, I I would assume. Yeah. Is he still delivering packages in this? And so, like, you got the weight game again. Yeah. Uh you're juggling things, vehicles, of course, creating roads and ropes and ladders. Like, what more do you want? What do you want to see",
            "start": 3066.24
        },
        {
            "text": "in this? And so, like, you got the weight game again. Yeah. Uh you're juggling things, vehicles, of course, creating roads and ropes and ladders. Like, what more do you want? What do you want to see refined? What do you want to see expanded on? Yeah, I mean, there's a lot I want to see expanded on in terms of the story. I'm very excited to see this universe get bigger and to see more and more characters into it, right? Just building upon the baseline that we've created here. We have um El Fanning El Fanning is in it. We have a ton of new actors and people that are are going to be added to the desking universe. So, I'm very excited about that. But like in in terms of honestly hype level, like just getting that out there, this year is a weird one for me because I look around and I see a lot of people saying, \"Man, this year is really great in terms of video games.\" And it is. It for sure is. There's a lot of great games coming out, but there hasn't been like last year was such a Roger",
            "start": 3108.48
        },
        {
            "text": "of people saying, \"Man, this year is really great in terms of video games.\" And it is. It for sure is. There's a lot of great games coming out, but there hasn't been like last year was such a Roger year in like a very real way from the [ __ ] jump. Like we had a Yakuza game that we had you had Infinite Wealth, which is incredible. We had uh Final Fantasy, we had uh even just in the beginning of the year, we had uh [ __ ] Yellow Taxi Goes Vroom, right? Like we had like three of like one of my top 12 games of the year, right? Right there in January. Uh January, February. And this year, I'm just I'm just not feeling it. Like there's not really many things that are really grabbing me, getting me super excited, getting me into that level. And this one is the first time this year where I'm looking forward to a game in the way that like I get like butterflies in my stomach. Like I'm thinking about like, oh my god, like what an experience. Like Death Straining 2 is that level of hype that I",
            "start": 3148.56
        },
        {
            "text": "forward to a game in the way that like I get like butterflies in my stomach. Like I'm thinking about like, oh my god, like what an experience. Like Death Straining 2 is that level of hype that I did came out of nowhere and I'm so deeply excited for. So yeah, I'm excited for just to see how crazy Kojima gets with it. Like are we going into time loops? Are we going to multiverse [ __ ] Like are we how weird I mean I saw the [ __ ] second trailer where it's like doing some Metal Gear solid [ __ ] Like what does that look like? like is that how far are we riding that line? Are we actually going to skirt up into potentially making some type of weird like multiverse [ __ ] Like I don't know what he's doing here, but uh I am interested and I'm also interested to see uh the gameplay improvements because yeah, it's I of course we have to be uh going across the the city. No, we're going somewhere else, which I don't whatever. We're going somewhere else. We're going to a different continent.",
            "start": 3182.8
        },
        {
            "text": "because yeah, it's I of course we have to be uh going across the the city. No, we're going somewhere else, which I don't whatever. We're going somewhere else. We're going to a different continent. We're going to a different area uh delivering stuff. Um and I'm excited to see one how they adapt that terrain. Uh, and then two, how they kind of create the baseline at the beginning of it, right? Are we starting with everything that we ended with Death Stranding? Like, do I get the zipline immediately? Because I that's what I want. I just want to start off with everything and I just want to add on, add on, add on. So, by the ending of this game, I feel like I'm [ __ ] invincible doing insane [ __ ] Like, that would be a really cool idea is to start off with just, hey, you have baseline, you can build zip lines, you have the PCC2, whatever it's called, you have the motorcycle, you have the car, you have everything. Okay, now we're going to get crazy with it. By the end of it, you're going",
            "start": 3218.96
        },
        {
            "text": "build zip lines, you have the PCC2, whatever it's called, you have the motorcycle, you have the car, you have everything. Okay, now we're going to get crazy with it. By the end of it, you're going to be [ __ ] Iron Man. That would be my perfect world where we just go into because I don't know if you've ever seen those videos where it's like what uh 2,000 hours in Death Stranding looks like. And these people are [ __ ] doing insane [ __ ] They're running, they're [ __ ] flying, they're doing insane stuff. Uh so if we can get there and like for the for the for the normal gamer by Midame, like where you're just doing wild [ __ ] and you can kind of focus on like midmaxing that level of stuff, that would be dope. All right, Roger. Well, of course the title of this is our review of Death Stranding in 2025. You have already given it a number, but let's do the fun little review synopsis from you right now. Roger. You played Death Stranding here in 2025 for your first ever time ahead of Death",
            "start": 3255.84
        },
        {
            "text": "in 2025. You have already given it a number, but let's do the fun little review synopsis from you right now. Roger. You played Death Stranding here in 2025 for your first ever time ahead of Death Stranding 2's release in June. What would you grade it? Yeah, I as I said earlier, I would give uh Death Stranding a 9. No, I will give Death Stranding a nine out of 10 on the kind of funny scale. I will say that that is a capital A amazing game. Capital amazing game. I don't I don't know what you're you're doing capitals and lowercase amazing. You're going with capital A amazing. Yeah, capital A amazing but not all caps amazing. I like that. I like that. I would say it's a nine out of 10. Uh I definitely see where this game can be improved on. And I see the world where Death Stranding 2 can be that 10 out of 10 for me. Um it definitely has that road to do it. All it just needs is the quality of life, right? That is all I want. I want more quality of life stuff and I want that story to go",
            "start": 3292.64
        },
        {
            "text": "that 10 out of 10 for me. Um it definitely has that road to do it. All it just needs is the quality of life, right? That is all I want. I want more quality of life stuff and I want that story to go absolutely [ __ ] bonkers and uh for him to kind of streamline the things that we're explaining and not just reexplain the same thing 10 times cuz that's what it felt like towards the ending. But other than that, I had an incredible experience with it. An incredible time hanging out with you, doing this amazing stream, hanging out with the audience supporting us for so long, breaking records at kind of funny here and uh really getting me to uh experience a game that I wouldn't have experienced otherwise. Right. And uh Death String 2 has the possibility I mean and we know for sure it has Caroline Polich in it and she's doing the title song of Death Straining on the beach. The song called On the Beach. So we have a contender contender teen 10 out of 10. I'm excited and I'm hoping for it. I'm",
            "start": 3339.84
        },
        {
            "text": "Polich in it and she's doing the title song of Death Straining on the beach. The song called On the Beach. So we have a contender contender teen 10 out of 10. I'm excited and I'm hoping for it. I'm hoping for it. I'm hoping for it. I think What about you? If you were to rate it, if you were to give it a score, I know you didn't play it. I'm an 8.59. I think it was a great to an amazing game. I think it I think it was another Kjima title that I love and I will think about forever. Just like when me and Barrett did Metal Gear Solid games, I was wowed by what this guy is capable of as someone who didn't play the Kajjima titles back as a kid. Yeah. Experiencing them now as an adult who is talking about it with his friends and experiencing them live and getting awesome tidbits from people who are super informed and like experts in it. It's like, oh wow, this guy has got something and his team is truly incredible. And so, like, I am kind of ride or die for Kajim. I really love all of his",
            "start": 3378.88
        },
        {
            "text": "are super informed and like experts in it. It's like, oh wow, this guy has got something and his team is truly incredible. And so, like, I am kind of ride or die for Kajim. I really love all of his work and his team's work. And playing through this with you, Roger, was an experience, right? I really I love the idea of this game. I can't wait for me to play it, right? I I'm excited to go hands on the sticks cuz I am someone who loves going on a hike. I like scurrying up the side of a mountain. I love creating my own path. And so, yeah, this game really speaks to me. And then on top of that, the weird wacky storytelling of Kjima always gets me excited because we get to do La Lule lore breakdowns and we just make up the inner parts of the story where people are like, \"Well, that's not true.\" And then we figure out what's true and what's fun. It's like awesome stuff that he leads us on this cool little trail. And I I loved our experience, Roger. I will definitely cherish it. I will",
            "start": 3424.16
        },
        {
            "text": "true.\" And then we figure out what's true and what's fun. It's like awesome stuff that he leads us on this cool little trail. And I I loved our experience, Roger. I will definitely cherish it. I will remember it. And uh I can't wait for two. I'm excited to do it hopefully all over again with you. I got new shoes. Oh [ __ ] you know, healthy. And so, like, I will be bouncing off of this treadmill with you right now on it. Uh, and I'm excited about this because we have potentially we might do it again uh for another marathon stream. We're still we're still talking about it, figuring it out, but also you and I get to react and kind of break down the Death Stranding 2 trailers, which I'm excited about. So, hopefully some future content. Yeah, exactly. And it seems like he's cooking up another trailer. I see him editing. I see I see I see images of him [ __ ] in too many. But like that's lit. Like let's do the one. You do the one big one. We don't need two. The second one was kind of",
            "start": 3467.6
        },
        {
            "text": "trailer. I see him editing. I see I see I see images of him [ __ ] in too many. But like that's lit. Like let's do the one. You do the one big one. We don't need two. The second one was kind of crazy. You know what I mean? What if the third one has the Caroline song? You know what I mean? We got to listen to it. We got to listen to that song one more time. How amazing is that to think about Caroline and getting this opportunity and like having your song as the title song. It's like, oh snap, that's like a James Bond song. I know I've said it a couple of times, Roger, but like that is the honor of like, oh snap, you're the James Bond song. That's lit. Yeah. I think about the Metal Gear Solid 5 title theme a lot. is very excited. I can't wait to hear the music cuz everybody we were going crazy for the music in the first one. The music hit at all times and every single time every track through it, Roger hit at the right moment and they were all like perfect. Everything was really good.",
            "start": 3507.52
        },
        {
            "text": "for the music in the first one. The music hit at all times and every single time every track through it, Roger hit at the right moment and they were all like perfect. Everything was really good. Y'all put me on to churches now. I don't know who that was. Now I'm now I'm into that. You know what I mean? And so, yeah, I'm excited to see what he's got up his sleeves cuz this game needs really good music for what it was, but I don't know what two is going to be. Yeah, it could be over the top action all the time. I have no idea. And then also, we have a movie coming out too that is actually happening. Like they're actively casting and and they have the director and like they're making this happen. This A24 Death Stranding movie directed by the same director as uh Quiet Place day one or part one or whatever the was called. And then uh uh also he directed the movie Pig with um Nicholas Cage, which I [ __ ] adore. So man, that's gonna actually happen. That's exciting. Honestly, if you asked",
            "start": 3550.72
        },
        {
            "text": "or whatever the was called. And then uh uh also he directed the movie Pig with um Nicholas Cage, which I [ __ ] adore. So man, that's gonna actually happen. That's exciting. Honestly, if you asked me way back when this first dropped, there's no way I thought this was going to get a sequel. Yeah. There's no way I thought we'd be making a movie as well. But uh it's exciting times because after Death Stranding 2, we look forward to OD and then Fizzant. Like we got a lineup here of games coming for this team. OD will come out. OD, he didn't he didn't say it. You know what I say? He didn't though. Let me talk about visit. For everybody watching live over on YouTube and on Twitch, we're not done. We're going to end this podcast and this episode of Gamescast with a fun one. I let Roger and I and all of you share the fun of our experience. But the experience wouldn't be the experience without the moments. And there was some moments of ordering food throughout this marathon stream. And I want",
            "start": 3591.28
        },
        {
            "text": "all of you share the fun of our experience. But the experience wouldn't be the experience without the moments. And there was some moments of ordering food throughout this marathon stream. And I want us to rank the food that we ordered. Roger. So, to end today's Games Cast episode, we're going to look back on 60 plus hours, a marathon stream that went from Saturday to Monday morning and also a Wednesday afternoon. We ate a lot of food. I had a lot of meat sticks. A lot of meat sticks. An insane amount of meat sticks. Ate a lot of nuts. Put a lot of nuts in my heart rate was through the roof. Yeah. Little talk about the heart rate. Yeah. Yeah. A little scary. A little scary. The best line was, \"Oh man, this was from Timu. It's not reading right. And then we put it on you and it was just perfect. It was just perfectly normal. It was a perfectly normal heart rate. And so, Roger, let's look back at what we ate. We had some snacks. Uh we definitely had a lot of Starbucks, but we also had",
            "start": 3633.52
        },
        {
            "text": "It was just perfectly normal. It was a perfectly normal heart rate. And so, Roger, let's look back at what we ate. We had some snacks. Uh we definitely had a lot of Starbucks, but we also had some fun moments of ordering meals together. Yeah. What did we order? What where should we So, I'm just going to go for like for the dinners, right? That's easy, right? Including the one from yesterday, right? So, we had uh night one, we ordered chilies. Uh that was our first freaking nasty idea. Uh, thank you to the audience for talking us through that one and getting us the triple dipple. Uh, then we got Denny's for the second night. That was tough. That was really That was unfortunate. Great French toast. Was it? No, that's not great to go back a little bit because if you watch that clip, if you watch that clip, Mike was not happy about that French toast. Uh, then we had Red Robin to round that out. That was also tough. That was a tough one. And then uh yesterday we bought a bunch of corn dogs",
            "start": 3679.6
        },
        {
            "text": "that clip, Mike was not happy about that French toast. Uh, then we had Red Robin to round that out. That was also tough. That was a tough one. And then uh yesterday we bought a bunch of corn dogs from Yeah, we had Korean corn dogs for the first ever time. That was tough. So, let's work through them. We started with chilies. We got excited by chilies. A little little little duo date to chili. Yeah, that was beautiful. We got caught up in the appies. We got caught up in the triple dipple. Yeah, we got what was it? The Oh, no. But you got the sliders. You I got two orders of sliders. Stupid [ __ ] both of them came just butt naked. No, no ketchup, no mustard, no LTO's, no lettuce. No, the issue was that the they that they were mostly like any slider, mostly bread. And you got so mad about it. You're like, I don't want to eat this. Well, it's like you got to put a little something on it. You can't just give me a king's Hawaiian roll and a slice of bad meat in the middle. I think you",
            "start": 3721.84
        },
        {
            "text": "it. You're like, I don't want to eat this. Well, it's like you got to put a little something on it. You can't just give me a king's Hawaiian roll and a slice of bad meat in the middle. I think you specifically said you didn't want [ __ ] on it and then I told them not to put [ __ ] on it. And then you got mad. That's why I was butt naked then I should have got some ketchup on that. I got those. And what else did I get on that? Uh, you got the chicken. Oh, you got mozzarella sticks. You get chicken. You know, you got chicken. You got chicken. Um the hot Nashville chicken tenders or what? Oh, and they were good. Those are smacking. Sticky. Those were smacking, bro. Those are smacking. I should have gone with the quesadillas. Yeah, you should. Or And then we got the egg rolls for me. And you Those are way too spicy for you. I said, \"Those are too spicy.\" You said, \"Mike, this is just black pepper on this. It's too spicy. It hurts.\" The whitest man in the world. Uh and then I got the",
            "start": 3763.84
        },
        {
            "text": "you Those are way too spicy for you. I said, \"Those are too spicy.\" You said, \"Mike, this is just black pepper on this. It's too spicy. It hurts.\" The whitest man in the world. Uh and then I got the chicken um tenders as well. And I think I got mozzarella sticks or something like that. But yeah, that was good. So chilis S tier. That's number one. S tier number one. I mean, well, I I mean, if we're I don't know about S tiers or whatever, but let's just do number one. The best rank number. All right. Chili's number one right now. Chili is number one. Take right now. Okay, let's [ __ ] go. Well, we got to talk about the other ones. Oh, then those [ __ ] chips are those chips are unreal. You know where the chips are going to drive Chili. Absolutely. Uh then we had Denny's. O. So, there's there's four options. So, we made a bad call here. We gave the opportunity to the live audience watching during the marathon stream to vote on what we should have for dinner. And you gave them four",
            "start": 3798.72
        },
        {
            "text": "there's four options. So, we made a bad call here. We gave the opportunity to the live audience watching during the marathon stream to vote on what we should have for dinner. And you gave them four options and they, excuse my language, [ __ ] me. Okay. They [ __ ] us. Yeah. Look at them. They [ __ ] you like that. I mean, these are the moments, Roger. You got to watch this waste any other fun. Um, this is my only break. Yeah. Uh-huh. That's right there. This is This is my only break. That was That was your only break. This is my only right there like two hours. Conveniently, all the KF lay on the couch is cut out of here. This is my only break, Chad. And so, um, Denny's Denny's think about breakfast 24/7. Um, you know, also that's when you ordered an extra. No, that was Red Robin. We'll save that later. Yeah. So, I went with my classic French toast, sausage links, bacon. Okay. And I told Roger, I said, \"If this French toast doesn't have syrup, you best believe I'm throwing a temper",
            "start": 3834.24
        },
        {
            "text": "save that later. Yeah. So, I went with my classic French toast, sausage links, bacon. Okay. And I told Roger, I said, \"If this French toast doesn't have syrup, you best believe I'm throwing a temper tantrum and I'm going to hit you with this toast. So, okay, Roger, message this poor Door Dash driver. Please God, make sure this she's going to kill us. Yeah. And there was there was which was great. Yeah. Um and yeah, so I it was bad. I got the slam witch or whatever the [ __ ] Uh the grand slam witch. Yeah. Yeah, that was a bad call. You got the grand slam witch? Yeah, the grand slam witch that had like it was like bacon, it had uh ham, it had eggs, it had cheese, and it was like on a sourdough with like cinnamon on it. It was fine. It was like a totally like a five out of 10, four out of 10. It was whatever it This was It sucked. This is the Denny's is three. Denny's is three right now. Well, I mean, we're going to move. Well, Denny's is two right now technically and then we move we",
            "start": 3881.92
        },
        {
            "text": "10. It was whatever it This was It sucked. This is the Denny's is three. Denny's is three right now. Well, I mean, we're going to move. Well, Denny's is two right now technically and then we move we move them. Okay. It's definitely four, but yes. Denny's going down to the bottom. All right. So, then Red Robin. We had Next. I I blacked out. I don't even remember. Oh, we got a big ass burger. We got big ass burgers. We got extra fries. And they were the most uh greasy thing that we've ever had in our lives. That burger was tough. It it was an issue cuz I know cuz I'm a as a former bigger person, uh I still have it in me, right? Like I still all I want to do is eat whatever is in front of me and I destroyed that burger and you didn't even finish that burger. So that's how I know that we have an issue here is that when Mike doesn't even finish a burger and I destroy a burger, that's not good. We got a problem. We got a problem. And it wasn't it wasn't like a good destroying. It was not",
            "start": 3928.72
        },
        {
            "text": "an issue here is that when Mike doesn't even finish a burger and I destroy a burger, that's not good. We got a problem. We got a problem. And it wasn't it wasn't like a good destroying. It was not like I was like into it. It was a bad burger. I had a peach milkshake. It was also and a root beer float. Peach milkshake. Peach rings milkshake. Yeah, it was awful. Oh, I thought it was just a peach milkshake and peach rings. Well, it was a peach it was a peach milkshake that they put the the cute candy gummy peach rings in. Awful. Yo. Oh, did you know the story about this uh Barrett? No. Uh so, uh we did a thing where on the stream uh he said he wanted two milkshakes. He wanted a he wanted a Dr. Pepper root beer float and he wanted a uh the peach ring milkshake. And I said, \"Hey, Mike, you can only get one. I'm ordering. You can't get two.\" And then he said, \"I'll rock paper scissors for for it right now. And if I win, I get to order two.\" And I said, \"Okay.\" And I [ __ ] beat his ass. I",
            "start": 3968.4
        },
        {
            "text": "only get one. I'm ordering. You can't get two.\" And then he said, \"I'll rock paper scissors for for it right now. And if I win, I get to order two.\" And I said, \"Okay.\" And I [ __ ] beat his ass. I beat his ass in a way that I already told him exactly how I was going to beat him. It's funny because 20 minutes before we talked about rock, paper, scissors technique. Yeah. Exactly. I was telling him that what I do is I go I always go uh uh what? I go paper. I go paper. I go paper. And then if it's a tie, people freak out and then they go rock because they want to be strong and then I stay paper. I always win. And that's exactly what happened. So I beat his ass, right? And then as I go to the bathroom after I order everything, he talks. I come back and I see on the chat all a bunch of ones and chat be cool. Chat be cool. And then I and then I go back in the clips and I find him be like, \"Chad, I just spent $20 and I ordered the same milkshake that year. I ordered the second milkshake.\" So",
            "start": 4010.48
        },
        {
            "text": "chat be cool. Chat be cool. And then I and then I go back in the clips and I find him be like, \"Chad, I just spent $20 and I ordered the same milkshake that year. I ordered the second milkshake.\" So So the same Door Dash person picked up probably the easiest lick of their lives. Oh, just double it up. Just double it up, bro. Cuz you just you just spent $20 on one milkshake. That sucked. Also, I I heard you were warned about the Red Robin pizza and you ordered it anyway. Yeah. So, that's also another great point. Yeah, we ordered Yeah. which uh Jeff Grub was uh defending uh cuz it's Ohio. Yeah. It's Donado's uh which I am also I can also speak to as uh someone who was born in Ohio. No, absolutely the [ __ ] I could have told you. It was the weirdest pizza in the world cuz it smelled really good. You take a bite out of it, you taste the pepperoni, you're like, \"Oh, this is good pepperoni.\" And then you start tasting the sauce and the cheese and you're like, \"Why is there no flavor here?",
            "start": 4046.32
        },
        {
            "text": "good. You take a bite out of it, you taste the pepperoni, you're like, \"Oh, this is good pepperoni.\" And then you start tasting the sauce and the cheese and you're like, \"Why is there no flavor here? Why is there zero flavor we So that was bad. So that Denny's I would say Red Robin is better than Denny's because I would have I ate the entire burger and I like the fries and the pizza was like not It was awful, but it was also had pepperoni that was pretty good. So I'll give it a pass there. You know what I mean? Come on. Uh so I'm going to say that Red Robin is above Denny's, below Chili's. Yes. And then of course yesterday we had corn dogs. This was a bad decision. This was a really many corn dogs. I haven't had many in my life. And you didn't really know what it was. The idea of elevating the corn dog in such a way where all of a sudden there is uh French fries, mashed up French fries surrounding the outside of this corn dog. We've taken the corn dog and just dipped it in a bunch of",
            "start": 4090.56
        },
        {
            "text": "the corn dog in such a way where all of a sudden there is uh French fries, mashed up French fries surrounding the outside of this corn dog. We've taken the corn dog and just dipped it in a bunch of Cheeto flakes flakes. Then for some reason we decided to make a a half and half where it's we cut the dog in half and then on the top half of the corn dog it's just cheese because we wanted to do fried cheese sticks but who wants just a cheese stick so let's do half and half and it's like no it should be the dog surrounded by cheese that's a true half and half and they said no it's half cheese half dog and that that was a bad idea. Yeah. And the mozzarella wasn't good. And then when you have when you have these things, right, they're not mozzarella sticks, right? So they don't have the same textural like contrast. Like they're not as like crisp as you would want them to. And then the cheese just sucks. So then it's like, oh, this is like a bad mozzarella stick. And it was $8. Just take the",
            "start": 4132.8
        },
        {
            "text": "like contrast. Like they're not as like crisp as you would want them to. And then the cheese just sucks. So then it's like, oh, this is like a bad mozzarella stick. And it was $8. Just take the M stick. Take take the dog. Wrap the M stick around it. Corn dog. Yes. That's all I want. Shadow trickster. Mike has awful taste. Takes, bro. But then says it's a M stick and a dog. And I'm describing to you what it should look like. No, it's not. Question of course, more importantly, what the [ __ ] is this green one? Yeah, this is the Taki one. The Taki one. It looks like just it's covered in like moss. Yeah, it didn't taste good either, actually. No, it was the better one. No, Takis was Oh, really? I like Takis more than Cheetos. I think Cheetos wasn't hot. But they had we also got Cheetos. Hot Cheetos fried Korean um chicken. And that was pretty good. It was like It was like It was like General So chicken, but like super [ __ ] fake spicy. So, I liked it, but I also hated it because I was",
            "start": 4179.36
        },
        {
            "text": "Cheetos fried Korean um chicken. And that was pretty good. It was like It was like It was like General So chicken, but like super [ __ ] fake spicy. So, I liked it, but I also hated it because I was like, \"Oh, I'm gonna die if I keep on eating this.\" That was too spicy. I didn't like that at all. So, uh I I actually would put this lower than Denny's. No way. Yeah. I'd put this lower than Denny's. That's how I feel in my heart of hearts. But I'll put it above Denny's for you, but like Denny's at least gave me a cold French toast that I could eat. I'll give it to you actually. Yeah. So, okay. Our list goes like this. Chili's at number one. Red Robin at number two. uh including the pizzas from Donados, which he also called Dante's. Uh Denny's uh at number three and then Corn Dogs at number four. Uh so that was uh that was Oh, Grub Killer says, \"To be honest, you didn't finish any of that order. We put a [ __ ] dent, bro. Me and Mike were [ __ ] throating dogs. We were in there. We ate.\"",
            "start": 4222.88
        },
        {
            "text": "Uh so that was uh that was Oh, Grub Killer says, \"To be honest, you didn't finish any of that order. We put a [ __ ] dent, bro. Me and Mike were [ __ ] throating dogs. We were in there. We ate.\" Oh, that first dog. Remember that first? Oh, you destroy that. We We were We were the Gizzy Gladiator. Bite for bite. We were passing it back. We're going bite for bite. We were sharing the wiener. Oh, dude. We were sharing that wiener. We loved it. Let's jump in and let's finish today's games cast with some super chats coming from you, the incredible best friend audience out there on YouTube and on Twitch. Uh MJ or M Junior Monkey writes in and says, \"Y'all got to watch the Death Stranding 2 trailer now since you've experienced the first game.\" We also have uh another YouTube membership from Mr. Monkey uh saying watch that Death Stranding 2 trailer. Uh we will we'll make that a separate piece of content sometime uh between now and Death Stranding 2. Me and Roger will sit down and kind of go",
            "start": 4268.72
        },
        {
            "text": "Monkey uh saying watch that Death Stranding 2 trailer. Uh we will we'll make that a separate piece of content sometime uh between now and Death Stranding 2. Me and Roger will sit down and kind of go frame by frame. We should probably do it sooner than later before I forget everything because you know Dead. Oh yeah, and of course we do have a super chat coming in from uh Ricardo Gonzalez who says, \"Mike, what about those themes of Dead Wife?\" Oh dude, lot of themes in this game. Okay, a lot of themes in this game. Uh and now that we can spoil it, themes. Okay. Uh, thank you CJ Split Sign. We were trying to do the zoom and he's like on I thought he was going to go like CJ split side. Right. Mike, is that shirt a large or an XL? I'm happy to report that this shirt is an XL. Okay. It's got more of the boxier fit, so I think it hides the gut pretty well. Yeah, it's pretty good. Okay. But uh I I I'm not double XXL yet. But the question will be tomorrow when I wear the other t-shirts that",
            "start": 4311.68
        },
        {
            "text": "more of the boxier fit, so I think it hides the gut pretty well. Yeah, it's pretty good. Okay. But uh I I I'm not double XXL yet. But the question will be tomorrow when I wear the other t-shirts that are not boxy. Will it be a double XL on those? Cuz this is the new boxy look. All the kids like the boxy look, right? I don't like the boxy look that much. But also, I'm just looking for a comfortable t-shirt. That's You don't like the boxy look. Suck it in my gut because my gut's so big. I How do I get so big? It's when somebody We We learned yesterday that he has a double gut. He has a double bump above his big belly right here. Feel that? And also my belly is cold. You feel that right there? No. Right there. You see? Like, isn't that crazy? It's like, if I take my t-shirt off, there's something protruding out of here. It's like the alien coming out of somebody's belly. You know what I mean? It's like, oh [ __ ] is something going to pop out of stomach Mike's belly. Be careful. You know",
            "start": 4355.28
        },
        {
            "text": "protruding out of here. It's like the alien coming out of somebody's belly. You know what I mean? It's like, oh [ __ ] is something going to pop out of stomach Mike's belly. Be careful. You know what I mean? That and then it's very cold. The top of his the top the tip of your belly. Yes. Yes. Yes. Very cold. Brighten it. Jace the drone says, \"Congratulations. Watch out. It's a tuma. It could be a tuma.\" Cal writes in aka kebab says, \"Mike, what are your thoughts after yesterday now that you finally completed the epic journey of Luigi's Mansion 3?\" Ah, great game. Great game. Go play. I love that game so much. Thank you, Cal. Uh, and then finally, Cam Cameron Abbott, aka Reverend Cam Abbott, writes in says, \"Roger never did the deliveries to find out he was your client on multiple occasions.\" Really great reveal towards the end. Now, show me them yams, Mike. So, Roger, you got some fun side content to do if you wanted to continue followed up with that saying that was about Higs. You'll",
            "start": 4402.08
        },
        {
            "text": "Really great reveal towards the end. Now, show me them yams, Mike. So, Roger, you got some fun side content to do if you wanted to continue followed up with that saying that was about Higs. You'll see Higs kind of being your client. Surprised that there's no like new game plus. I would have loved the New Game Plus. I hope that's in the sequel. Oh, yeah. That should have been New Game Plus. Like jump a lot of people are saying it could be a hernia. I don't know what a hernia is. I'll look that up. You're just fingering it. Like you got a feeling. You know, go to a doctor. No, he's just fingering it. He's just having a good time. I'm freaking it. He's freaking right now. Do you think there's something sorry just to get get away from this conversation um with new game plus do you think because of the nature of the like strand [ __ ] like do you think that like gets in the way of but I just I just want the zip lines from the beginning right I want to be able to just start making [ __ ] I",
            "start": 4447.84
        },
        {
            "text": "of the nature of the like strand [ __ ] like do you think that like gets in the way of but I just I just want the zip lines from the beginning right I want to be able to just start making [ __ ] I want to be put back into my world after everything well you can you can continue the game and I just want to run and build and then do some side quest which is what I will do but I wish there was like a full new game plus because I would like to kind of do everything in order and kind of go like that Uh, Cupcake Bliss writes in right before I was going to end the show and says, \"How do you guys feel about the scenes between Sam Bridges and Cliff at the end of the game and uh, Die Hardman and Cliff versus Cliff?\" Oh, I love that stuff. Yeah, I thought all of it was very good. Yeah, the Die Hard Man stuff. Uh, especially when you think back to because they did they do the they have the emotional moment and then they kind of like go back to it and like explain really why that's so emotional",
            "start": 4485.52
        },
        {
            "text": "Man stuff. Uh, especially when you think back to because they did they do the they have the emotional moment and then they kind of like go back to it and like explain really why that's so emotional later on um, like right afterwards. So I I I at first I was confused like this he's acting really well like this die hard man the the the actor I forget his name but he's incredible u but I was like okay well why is he so emotional right now and then they fully do the reveal of like here's exactly why like let me show you that moment again I like throughout uh as dead man pulls you aside and heart man go like hey we don't know where this guy stands he could be evil and like he's everybody's always watching cuz you're connected and so it's like let's let's keep an eye on this and then we find out the backtory of like Oh, no. This guy's just ride or die and like he's lost a lot of people that he cares about, but also like he he's going through some things. Yeah. No, and I I think that's kind",
            "start": 4524.16
        },
        {
            "text": "the backtory of like Oh, no. This guy's just ride or die and like he's lost a lot of people that he cares about, but also like he he's going through some things. Yeah. No, and I I think that's kind of like the the core of the game, which I I think is interesting is like there of course Higs is a bad guy, but he also I'm sure he has a lot of [ __ ] trauma and everything we're going to get into the next game, right? Like there like Amaly is not necessarily a bad person or like the bad guy of this game, right? She is a sort of a redeemable character cuz that's kind of what her whole mission is, right? She's trying to hold off. She's trying to hold off and she you know she that is that is literally her purpose on on this planet is to blow it up, right? So it's kind of like bucking Destiny. So yeah, I was I was happy that there wasn't like oh Die Hard Man is the secret villain of the game, right? Like that that was kind of like elevating everything else. Yeah, I liked I like Die Hard Men",
            "start": 4565.44
        },
        {
            "text": "yeah, I was I was happy that there wasn't like oh Die Hard Man is the secret villain of the game, right? Like that that was kind of like elevating everything else. Yeah, I liked I like Die Hard Men and Cliff. I thought that was really cool. And then I loved I mean the the crazy Cojima stuff, the over the top action movie stuff of like you got five minutes, I did my best to like help you. Nobody's listening. Like you got to get out of here with this baby. And uh yeah, all of that scene was super dope. Uh I liked Sam Porter Bridges with Cliff. Uh I love that reveal of Roger getting it, but then also yeah, we have to go sideways for about 15 minutes before we go back to the full reveal. But like I mean all the scenes with Mads is wild, right? Like every time he connects and he's the BB is so much fun. I love that. Uh Cupcake Bliss writes in again one more time and says, \"Do you think we'll get more Higs in story in Death Stranding 2?\" I'm excited to break down those trailers and look",
            "start": 4603.12
        },
        {
            "text": "so much fun. I love that. Uh Cupcake Bliss writes in again one more time and says, \"Do you think we'll get more Higs in story in Death Stranding 2?\" I'm excited to break down those trailers and look that deep into that. Also, shout out to Red Hudson right there. Let's finish it off. Read and Roger to finish off. Mike, Mike and Roger are goats. These streams were an absolute blast. Thank you both. Bring back the hashtag yamcam for DS2. Uh we have some uh exciting ideas to elevate it and uh really elevate the yam cam and also elevate you ordering food. Uh because we're going to try to eat healthy for the next one, but also if Chile sponsors us, we won't. Yeah, we know what we don't give a [ __ ] Either way, you guys are going to freak it. We're going to freak it, bro. And that's what that's all about, bro. Come on. Kind of funny. Best friends. Thank you for joining us on today's Games Cast where we look back on our Death Stranding experience here in 2025. Roger gave it a score, but most",
            "start": 4642.0
        },
        {
            "text": "all about, bro. Come on. Kind of funny. Best friends. Thank you for joining us on today's Games Cast where we look back on our Death Stranding experience here in 2025. Roger gave it a score, but most importantly, we got to relive the fun moments with all of you and talk about a game that is just wild and exciting. And we'll get a sequel next month. So hopefully we'll all be talking about it in June with all of you because this has been kind of funny games. Each and every weekday, we run you through the fun, nerdy news you need to know about into awesome game discussions, reviews, topics, opinion pieces, and more here on Kind of Funny. And after this, we have a stream going on. Greg is going to jump into The Outer Worlds for the big re-review coming up soon with Greg, Stella, and Andy. So, jump into that. Tell Greg what you think about the game, what you should be talking about for the re-review. And thank you for your time and your day. Have a wonderful one. Goodbye, everyone. [Music]",
            "start": 4680.72
        },
        {
            "text": "jump into that. Tell Greg what you think about the game, what you should be talking about for the re-review. And thank you for your time and your day. Have a wonderful one. Goodbye, everyone. [Music]",
            "start": 4723.04
        }
    ]
}