{
    "id": 14115,
    "video_id": "KOpmGBJCK3w",
    "show_name": "Gameplay",
    "hosts": [
        "Nick Scarpino",
        "Andy Cortez",
        "Barrett Courtney",
        "Mike Howard"
    ],
    "title": "Nick Scarpino FINALLY Faces the ELITE FOUR - Pokemon Nicklocke 2.0 Finale",
    "description": "Go to https://bit.ly/m/KindaFunnyXSubwaySurfers?r=qr to get special rewards and download it now!\n\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1747962292,
    "duration": 9532,
    "transcript_chunks": [
        {
            "text": "time. Welcome back to the Pokemon stream. I'm Nick. That's Mike. Andy just walked out of the That's Andy. And Barrett is on the ones and twos. All the drawing shit's over here. It is. Bring it back in. Bring it back in. Well, Roger's drawing. Just bring your stuff in. Yeah. Yeah. Yeah. Bring your stuff. Uh We're on the screen right now, folks. We played this game for 85 hours and 23 minutes. We have eight badges, 74 Pokemon currently on our Pokédex. I love this. And this is the final stream. This is what we're calling our final reckoning. Mike, how are you feeling today? I'm feeling confident, gym leader. Uh I got a good feeling about being your navigator here and taking you to the point and it's going to come up to uh it's going to come down to you. And if you got it still in you, I got it still in me, ladies and gentlemen. Yeah. And I'm telling you, I swear as as as God's honest witness, we are going to beat this game today or we are going to come back for another play session.",
            "start": 12.12
        },
        {
            "text": "got it still in me, ladies and gentlemen. Yeah. And I'm telling you, I swear as as as God's honest witness, we are going to beat this game today or we are going to come back for another play session. [Laughter] Who [ __ ] knows what's going to happen. Last time we were like Bear were like, \"We're going to beat this game today.\" And then I spent 5 hours searching for one of those stupid legendary dogs. Oh yeah, we Is it a dog? Is it a cat? Two hours stream on Nick trying to catch one Pokemon. Oh my god. Now, let's take a look. Let's take a look. Let me introduce Barry because you haven't been on these in a while. Let me introduce you to to my crew. Dudacovothth. Love it. Kito, the cousin, dude. That was the last battle. Not Nick. We don't really need him. This milk, we don't really need this. And then sheriff. Sheriff. My Lapras. No. What is he? No. What is he? Uh, Lugia. It's my Lugia. My Lapras. I'm excited. Mike, how am I looking for this team? Do I need to juice these guys up or do",
            "start": 54.64
        },
        {
            "text": "And then sheriff. Sheriff. My Lapras. No. What is he? No. What is he? Uh, Lugia. It's my Lugia. My Lapras. I'm excited. Mike, how am I looking for this team? Do I need to juice these guys up or do we just walk right in? Uh, oh Jesus Christ. God damn it. You know, you had all day. You had all day to look this up. Confident with where we're at. You had all [ __ ] day. They are 41 to 46 range. Of course, we're going to get XP as we battle. Yeah, we put 47s and 45s on everybody. I'm feeling really confident for the first four jabronies. Let's take on Well, we have to go like There's a fifth guy. There's a fifth guy. Okay. You know, there's a fifth guy that I'm not quite sure about, but we have rare candies in our pocket at any moment, you know. Well, we're going to go at it. Where the hell do I go to the gym now? It's time to find Victory Road, Nick. We need to head to Victory Road. A cave with a ledges form a maze. Okay. A cave with Oh, no. A maze. Yeah, we got to find Victory Road. Let",
            "start": 98.0
        },
        {
            "text": "I go to the gym now? It's time to find Victory Road, Nick. We need to head to Victory Road. A cave with a ledges form a maze. Okay. A cave with Oh, no. A maze. Yeah, we got to find Victory Road. Let me find it. Let me find it for you, Nick. You think I would have had this one dialed in, but I forgot about it after the three weeks we haven't played. I need my [ __ ] sheet in front of me. Yeah. What sheet? Your your Pokemon stuff. Pokemon. Well, when Andy comes in, we'll tell Andy Roger. I need my sheet. Look, look in front of you and see if you got a sheet anywhere in front of you that's got a bunch of types on it. I need my type chart. He's at his computer. Nick's Andy's got it. I thought he was drawing. There we go. Thank you, Eddie. Thank you, Eddie. All right, he's got his sheets. I got my sheets. I got my sheets. I got my milk mommy. We're ready to go. We're going to take on these people right now. Early request already before we talk about Route 26. Let's hear the mall music one",
            "start": 151.36
        },
        {
            "text": "my sheets. I got my sheets. I got my milk mommy. We're ready to go. We're going to take on these people right now. Early request already before we talk about Route 26. Let's hear the mall music one last time. You know, ladies and gentlemen, we'll go to the mall one more time. I don't think we need anything at the mall. We'll just go into the mall. We got to go to the mall. Every single time we go here, we go back to the mall. [Music] Ready? Buy some lemonade. Let me go buy a lemonade just No, we're getting sidetracked. We're getting sidetracked. Maybe some soda pop too. You got a great sing. Okay. Uh, I need you to find route 26, please. Route 26. We might have to Did you go back home yet? Maybe fly home and talk to mom and uh Mr. Professor Addio. Okay. Uh because Yeah. But we need to go we need to find route 26 on your map. Oh my god. Yeah, dude. We're [ __ ] We're going to go back home one more time. We're going to go down back to uh talk to mom and do mom. I mean Ramirez RJM says,",
            "start": 200.96
        },
        {
            "text": "we need to find route 26 on your map. Oh my god. Yeah, dude. We're [ __ ] We're going to go back home one more time. We're going to go down back to uh talk to mom and do mom. I mean Ramirez RJM says, \"Do we need any TMs to power up Kugia or Entai?\" That's a question for you, Ramirez RJ. Google it. I don't know what I need to do. I've got TMs on all of them. I think we're pretty powered up. I need to talk to you, lady. Hello, welcome home. You're doing fine. I see. I kept your room tidy and clean. Or is this about your money? Lady, I don't see. You could have been giving mom the whole time. Yeah, we got a lot of money. Give her some money. I've got so much money. Andy hacked the planet, honey. Hack the planet. Hacked the world. I'm going to my room, Mom. Let's get some rest. Let's talk to the professor. Let's call this a day. Talk to the professor. Where the [ __ ] is the map in this bag? It's not I'm sorry to do this. Nick, can you move? Your mic is just kind of starting to point",
            "start": 261.2
        },
        {
            "text": "to the professor. Let's call this a day. Talk to the professor. Where the [ __ ] is the map in this bag? It's not I'm sorry to do this. Nick, can you move? Your mic is just kind of starting to point down. It's a little bit low. This way this side here. Just losing you a little bit. There he is. The art man himself. Art man coming. All right. How's that sound better? Oh, that's perfect. Beautiful. Beautiful bitter. Hello gamers. Today's your last chance on this thing to try to win a custom one of one. I'm just going to warm up. Murder this. Maybe it's the last chance. I don't know. I'm saying it is, but maybe it's not. Discharge this murder. There's this war. Squirtle. T uh [ __ ] turquo. Don't Don't tell us. Don't tell us. Don't Nobody look at chat. Nobody look at chat. Yeah. The terterod. Give me the first letter bear. Tit that. Yeah, we already had that. Terriual. No. Teragonal. Toata. To the second letter. You got it. Oh, damn. Giving me the knowables already. All right, Nick. Uh,",
            "start": 306.76
        },
        {
            "text": "Give me the first letter bear. Tit that. Yeah, we already had that. Terriual. No. Teragonal. Toata. To the second letter. You got it. Oh, damn. Giving me the knowables already. All right, Nick. Uh, third letter. R. [ __ ] Route 26. There you go. Should I go talk to first? The guy first? Did I? Yeah. Did you Are you at home? I think this is where he's at, right? Isn't he in the poker center? I know. Am I crazy? Poker mart. Yeah. Give 10. I got to go talk to him one more time. Just to say bye. [Music] Jesus. Is he a new bark town? Professor ID. You're fine. Don't worry about it. I'll just talk to you. No, he's in New Bark Town. Yeah, I'm sorry. Went to the B. Oh, where did you go? Oh, I went over to the other town thinking he was there, but he's not. He's in New Bark Town. He's right here. He's by He lives by my mom and they have a relationship, but Weren't you just at your mom's house? Yeah, I went to my mom's house, but she didn't give me [ __ ] And then you flew away. Yeah, I'm dumb.",
            "start": 371.8
        },
        {
            "text": "by He lives by my mom and they have a relationship, but Weren't you just at your mom's house? Yeah, I went to my mom's house, but she didn't give me [ __ ] And then you flew away. Yeah, I'm dumb. Okay. All right. Where did your brain take you? Oh, I for whatever reason thought Eddie, Professor Eddie was in the next town. Oh, okay. Grove City has brought you so much trouble. I guess the kimono girl said something about me. I haven't done anything to do with this. You made up your mind yourself and went through with your decision. Having achieved such a thing. You should be able to take on the pokey now. You should head for the Indigo Plateau. Do you know how to get there? Follow Route 27 to reach Route 26. Once you're there, go straight north. Got it. Thank you. I've nailed it. I see it. Your crush, Mike. Should we call about our Togea pie? Let's just get a check in. Let's get a little discount double check. I drew I drew a Togepi on the poster today. Maybe now. Yeah, maybe. Do you",
            "start": 436.88
        },
        {
            "text": "Your crush, Mike. Should we call about our Togea pie? Let's just get a check in. Let's get a little discount double check. I drew I drew a Togepi on the poster today. Maybe now. Yeah, maybe. Do you like my Suicide Squad that I drew? Love you drew the Suicide Squad. I got I made sure we put some callbacks on the poster. We also will have our our big six on the poster as well. So, kind of a big deal. I wish this Togepie was valuable. I would pull him out right now and put him in my squad. He's 45. I mean, he he might 55. So, yeah, he he might be a freak. He's actually the highest level that you were encountered. Yeah. Should we just throw everyone? When do we get him out, Mike? When we beat the game. Yeah, when we beat the game. All right. When we beat the game. All right. I got a map in front of me. We're going to go east, my friend. We're going to go surf some water to start this thing off. Chris Anka, can we beat this game in 90 minutes? That's going to be the fun question. [Music]",
            "start": 478.56
        },
        {
            "text": "of me. We're going to go east, my friend. We're going to go surf some water to start this thing off. Chris Anka, can we beat this game in 90 minutes? That's going to be the fun question. [Music] 90 minute. Well, it's 3:30 already. No, no, no. You're there. You're there. This part. No, no, no. You're there. You got to ride the water. Oh, I got to ride the water. Oh, okay. Oh, I see. That's where the camera. Yeah. Yeah. The water. Okay. Do I need to look at my guide to see what does [ __ ] Lapers have? We got to look at all the We got to make Let's make sure everybody's got it. Let's see. He's got a summary of moves. Psychic, flying water, flying. Okay, he's got hydrop pump, which is sick. And he's got flying boosts, which is sick. Guess we're good. Do we need another water move on [Music] him? Uh, Chloe doesn't want water guy. He's a fly. Okay, we're Chris wants to know what's going on with the ball. Don't [ __ ] do that. All right, there you go. So, from here, we navigate. I'm going",
            "start": 523.76
        },
        {
            "text": "him? Uh, Chloe doesn't want water guy. He's a fly. Okay, we're Chris wants to know what's going on with the ball. Don't [ __ ] do that. All right, there you go. So, from here, we navigate. I'm going to surf my right. There are He's so cool. He's so sick. See what's in this water waiting for [Music] us. Everything that was on this is in that [Music] room. Easy. Got it. Hand bit. Give some XP to the sheriff. Oh, here they going to navigate that here. What's this guy? Oh, he's stepping [Music] up. Oh, you just did. You taking your first step into Cano. What? Check your poker gear map and see what you tell me. We're going to Kanto today, Mike. I've been to Kanto. We've told you, you know, me in the chat, all of us have told you about a thousand times. We ruined the surprise. It's true. It's okay. I was trying to act like excited. We ruined the surprise. Like Tim goes, \"I feel so excited. You haven't seen this stupid trailer yet.\" Okay. So, oh wow. Going to Andy, we're in Kanto now. Whoa.",
            "start": 580.6
        },
        {
            "text": "I was trying to act like excited. We ruined the surprise. Like Tim goes, \"I feel so excited. You haven't seen this stupid trailer yet.\" Okay. So, oh wow. Going to Andy, we're in Kanto now. Whoa. Back home. Do I need to go get that that other bear dog? This is crazy. This is nuts. So, there's water below you there. The link between Kanto and Johto. Think you got to go in that cave? Yeah. Yeah. Can I get below the water? I don't have the thing though. Welcome to the falls. You got to climb up the falls. Oh, do I have the waterfall climbing move? Can I surf? I do I have surf Oh, yeah. Don't I have to have the move that lets me climb up the waterfalls, though? There's an island behind the waterfall. How cool is that? That's level design. How cool is that? Look at this. Oh, a slowpoke. I don't have one of these yet, Mike. Oh [ __ ] that cute [Music] guy. Catch that idiot. Oh, you're catching a slowpoke off the rip. Nice. Come on. Oh [ __ ] I love that, Nick. Okay, let's get it done. Get it",
            "start": 658.32
        },
        {
            "text": "have one of these yet, Mike. Oh [ __ ] that cute [Music] guy. Catch that idiot. Oh, you're catching a slowpoke off the rip. Nice. Come on. Oh [ __ ] I love that, Nick. Okay, let's get it done. Get it done. Let's get a random number generator going. Let's pick a name, dude. Let's get a name going. Leica has it. Waterfall does more than serve. Remember, Nick for Kito does. Anyways, I don't know what. You got the number right now, man. Got 178 there. Let's go to number 178 on our big raffle board. 178 is Reverend Uh, and the name they put is Reverend PSL. Oh, something. Thank you. I don't know if I can fit that. What's the like the the short version of Reverend? Like when you reverend? I bet you just put Reverend. No, it's a E instead of an A. Reand. That's how That's how they spell it at least. Reverend. A little P L P L. A little PL. I think Reverend's fine. Reverend's sick. I think Reverend Reverend PSL doesn't fit. You got another little charact. Yeah, we're going P. We're going",
            "start": 714.0
        },
        {
            "text": "least. Reverend. A little P L P L. A little PL. I think Reverend's fine. Reverend's sick. I think Reverend Reverend PSL doesn't fit. You got another little charact. Yeah, we're going P. We're going Reverend. Another carrot deliverance, Slappy. All right. Well, we're in the falls here, Nick. You got to go up those falls. Hit hit like uh use your action item when you go to the the waterfall. Oh, yeah. That's right. What the [ __ ] Oh, [ __ ] Oh, no. Oh, no. What's the last thing you want to call me? The world end. I don't stream right now. I got to kill this thing so hard. This will show if Nick has learned anything over the 80 hours. This is our moment. Uh-oh. This is scary. All right, we're going to be fine. We're going to be fine. They can't touch me. Idiot. It's still one that you don't feel fully confident. Yeah, I really I still don't know if it's normal or or ground. Uh, do I have waterfall? Use waterfall to get past them. Make your way east. We don't have water. The exit. Oh, he",
            "start": 799.76
        },
        {
            "text": "feel fully confident. Yeah, I really I still don't know if it's normal or or ground. Uh, do I have waterfall? Use waterfall to get past them. Make your way east. We don't have water. The exit. Oh, he does [Music] have. Thank you. Thank you. Thank you. Okay. Thank you. [Music] Oh, look at me go. Wow. There we go. Look at that 3D object. Look at that. That buoy [ __ ] max repelling it real [Music] quick. You have every item in the game. That's a good point. I don't really Hello, lady. Uhoh, she stabbed her to me. Oh, Megan wants to say what up. [ __ ] Megan. All right, here's our first test of the day. Let's see if we got it. Oh, well. Oh, yeah. Look at this little beauty. What are you doing? He's a grass type. So, we want to bring on our fire. I probably can just light him up, though. Huh? I mean, yeah. You're so far ahead of him. Like he's 32. You're But I also forget. Oh yeah, a little bit. [Music] There you go. See the Bazaar. Uh, no. Now we'll start seeing the other regions. That's",
            "start": 857.92
        },
        {
            "text": "I mean, yeah. You're so far ahead of him. Like he's 32. You're But I also forget. Oh yeah, a little bit. [Music] There you go. See the Bazaar. Uh, no. Now we'll start seeing the other regions. That's cool. Now that we've moved over, we'll start to see those original 151 Ivysaurus. So we want to bring out We want to switch over. Oh, let's bring out what's his name for the first time. The Well, we always saw original. We We always saw OG151. I think we'll see a little bit somebody charming. Now we're going to see some of the more of the iconic more regularly, right? What are you drawing right now, Andy? Oh, for alligator. Look at him. [Music] Sexy. I got [Music] Damn. You c I When did you get an intake? Lester. Damn. Yeah. And I caught him. I caught him natty, too. Call him Natty. He caught him daddy. Big deal. Took us two and a half hours. Jesus Christ. That thing's [Music] big. Ow. Yeah, it took a took a couple hours longer than we thought it was going to take. We had to find it",
            "start": 958.16
        },
        {
            "text": "him daddy. Big deal. Took us two and a half hours. Jesus Christ. That thing's [Music] big. Ow. Yeah, it took a took a couple hours longer than we thought it was going to take. We had to find it first. This is no big deal, but we got him. Yeah, we had to play first try, too. Yeah. Who's in this house going? There's an old lady in this house. Hello, old lady. Talk to me. Give me something cool. Pokemon, are you Pokemon loyal enough to win over here? Let me see. Yeah, I know. I juiced them the [ __ ] up artificially. There's a gift for your journey. Obtain TM37. That's cool. What's that do? Sandstorm. Do we need it? No. [Music] Who has this? No, man. Now you got to go through the waterfall again. I got to the waterfall again. Yeah, you got to stay on that high side. I guess the high side. I got you. [Applause] I'm just mumbling to myself right now. Sorry. He's quiet. The gate always does this. drives Kevin nuts. Just sort of slowly mumbling. But yes, I'll move it to the other side real",
            "start": 1029.8
        },
        {
            "text": "got you. [Applause] I'm just mumbling to myself right now. Sorry. He's quiet. The gate always does this. drives Kevin nuts. Just sort of slowly mumbling. But yes, I'll move it to the other side real quick. I can also bring the gate down just No, you're fine. I'll just put it on the [Music] inside. Check. Check. [Applause] Check. I got to go. Where does he want me to go, Mike? Go back the way you came. To the right. To the right. Yeah. Yeah. Okay. I need to go see that poke trainer Megan and step to the left of her. Walked by her. Oh, I went the wrong way. Okay. Yeah. You went down to the old lady's house and then jumped over. I got to go this way. Yeah. Boom. Now you go that way. [Music] I'm so excited for this. Touch me. Get in here, dude. Get in my Get in my This is Blake. Blake. Ace trainer. Blake wants to say what up to me. Blake. Like dog on the ace. Looks like Andy. I give you a little megaton. Yeah. Little megaton. Steal or electric? Electric. Electric. Electric. Right. Thank",
            "start": 1118.4
        },
        {
            "text": "Blake wants to say what up to me. Blake. Like dog on the ace. Looks like Andy. I give you a little megaton. Yeah. Little megaton. Steal or electric? Electric. Electric. Electric. Right. Thank you, Barrett, for being It may be both. Yeah, maybe. Face off. Face off. [Music] Dead. Oh, god. I mean, I got He was electric steel. He was weak to fire. Quagire. What the hell is a quagire? Oh, that's the water, I think. Is that the Wait, I don't know. Is it the [ __ ] duck? Quagsire is a weird blue duck looking Pokemon. Oh, yeah. He comes from a whooper. Siren. He's a water and ground type. He comes from a whooper. He's part of the whooper family. water type. He's ground all up against. [Music] He's an evolved bro. Whoa. Yeah, that was Blooper. Oh, that's [Applause] crazy. Put I want to see the uh action. Put them in. I think the catch is with all these is you're still 15 levels above. none of them really matter. [Music] Max is an absolute unit. Look at him, dude. He Damn, this guy that just",
            "start": 1196.0
        },
        {
            "text": "action. Put them in. I think the catch is with all these is you're still 15 levels above. none of them really matter. [Music] Max is an absolute unit. Look at him, dude. He Damn, this guy that just looks like a three-year-old's drawing. I can't confirm Quacksire has had many Pokemon cards about him. What does that mean? Pokemon. He is water. He's water fighting and grass on the Pokemon cards. Different different styles. Oh, pretty cool on that one. He made different heights. You can see many Pokemon cards about him. I thought there was like there's a lot of reports on this guy. A lot of reports. A lot of bad news. Uh I believe it's grass. Yeah, execute this grass. Maybe a little bit of it might have psychic moves, but I think [Music] it go psychic. Yeah. Oh, sure. Asleep. What the [ __ ] [Music] [Music] Let me just land a punch on this guy. [Music] Ramire's art says, \"Damn, any strong ground type would decimate this team.\" Don't think about it too much. Yeah, not [Music] really.",
            "start": 1285.4
        },
        {
            "text": "[Music] [Music] Let me just land a punch on this guy. [Music] Ramire's art says, \"Damn, any strong ground type would decimate this team.\" Don't think about it too much. Yeah, not [Music] really. Maybe. Andy, I'm seeing the vision right now. Have good water. Oh, thank you. Yeah, you're right. Didn't miss you. Good point. That's a real good point. Just don't think about You know, I mean, that's what happens. Just cross your fingers. That's what happens when you lose people along the road to Victor Road. You lose bodies. You lose. Exactly. Like, we lost a lot of people here. That's so true. [Music] Correus Robocop. The best of the best. Splooge. Splooge. [Music] Losing that easy was tough. Yeah. Sorry. You're my best friend though. [Music] Excuse me. Are you going to talk to me? Yeah, that is Brian. Looks like Andy still there. Look at him. Ace trainer Brian. That's Andy in his band era. Mhm. like with your uh I had bangs, bro. Oh, you had the bangs. You didn't do a little Why do I have",
            "start": 1363.59
        },
        {
            "text": "Brian. Looks like Andy still there. Look at him. Ace trainer Brian. That's Andy in his band era. Mhm. like with your uh I had bangs, bro. Oh, you had the bangs. You didn't do a little Why do I have like in my head like you younger you with like a little bit of a fauxhawk? No, I never had a fauxhawk. I had spiky hair in like the middle school blink days and then just straight up long emo [Music] bangs. M something like what are you worrying about learning? Nothing. Just learning. So are these levels? This is the level in the other game, right? Like are we just in Kanto now? Is this all the same level design? Uh no. I think we are heading We're in the Kanto region, but I don't think this part is in Pokemon Fire R. Now, Victory Road may resemble the Victory Road that we've been on before, but I don't think this little route that we're currently on. Uh to Tojo Falls is in Fire Red [Music] now. This music kind of reminds me of Final Fantasy 7. Yeah, like after you do some useless side",
            "start": 1465.32
        },
        {
            "text": "but I don't think this little route that we're currently on. Uh to Tojo Falls is in Fire Red [Music] now. This music kind of reminds me of Final Fantasy 7. Yeah, like after you do some useless side quest activity. [Music] Did you officially put down that one Final Fantasy you started? Destiny, that old one six. Um, yeah, cuz too many. I was only playing it really cuz I didn't have a whole lot to play at the time. But other [ __ ] This is psychic UI. Psychic UI. safe. You have nothing to do with this. So, well, that's his name. Um, star means water. Okay. So, psychic. Eli, what kind of psychic type you got? Oh, nothing. Just just put people I'm I'm just a psychic, but I like doing Pokemon training too. Like water. Big fan of the water types. Has a bug move, right? Got a bug [Music] move. Who's got the bug [Music] move? Who out here? There's a bug tank. [Music] Think [Music] so. Can I use these colors to get a color I want? Probably not. [Music] Yeah. What's up with this? E giraffe ref",
            "start": 1529.28
        },
        {
            "text": "got the bug [Music] move? Who out here? There's a bug tank. [Music] Think [Music] so. Can I use these colors to get a color I want? Probably not. [Music] Yeah. What's up with this? E giraffe ref those things, man. You got to cut out that thing. What's up with his butt? Yeah. Yeah, this butt is another person. Is it? Yeah. It's crazy. It takes over. Oh [ __ ] It's like that uh that crazy zoo game I made you play. Zucosis. Zucos. Why do I remember that? I wasn't here for that. I like that game. Zucos Zucos love Mike's list. That was last year. It might have been on the list. Schedule one will be. That's a great [ __ ] game. All right. It's a long game, huh? A lot a lot of going on in this game. You thought you were just going to scroll up and beat. Oh, I just thought like at this point like you beat the last badge. Let me go to the freaking Elite 4. It was going to be [ __ ] 90 more minutes before you could get up there. They give you their bang for the buck. Wow. My favorite. Look at",
            "start": 1635.32
        },
        {
            "text": "you beat the last badge. Let me go to the freaking Elite 4. It was going to be [ __ ] 90 more minutes before you could get up there. They give you their bang for the buck. Wow. My favorite. Look at that little boy. Should we go fire for fire touch? [Music] So cute. I want one. I want one. But he's no freaking He's no cute. No. Koolito. Chrisa says, \"It's almost like we warned you repeatedly how long this would take.\" God, it's so long. Well, no. Mike asked at the beginning said, \"Can we beat it in 90 minutes?\" And Chris didn't answer. I think Chris wrote, \"Hell no.\" Chad said, \"No.\" [Music] Randy again. Well, you know, is that normal? What's normal? You need arena. Arena. So dyslexic. Just don't know it. Uh none is a real word. Remember it's a small version and knitted queen which who knows what that is. We don't know what need uh dark a lot. That's right. The netta queen is a lot of things is right. Oh surf. Oh cuz remember queen is ground [Music] poisonia. That's a mic",
            "start": 1728.88
        },
        {
            "text": "which who knows what that is. We don't know what need uh dark a lot. That's right. The netta queen is a lot of things is right. Oh surf. Oh cuz remember queen is ground [Music] poisonia. That's a mic pronunciation. the doorway to to Narnia to Narandia. Yeah. Yeah. And once I say it, that's your name, too. Once I get locked in the chamber, you're in. Yeah. For life. You will take no consideration. Yeah. Don't even tell me. I don't care. What was that one guy's name? [ __ ] No. Don't come to me. I love that guy. [Music] I'm going to bite his ass and see what happens. Snoochies Coochis or Snoochi's Coochis was. Yes. Shies. Thank you for subscribing. Shonies, man. That's crazy. Shy subscribed over here. And Snoochi Scoochi subscribed to Mike. Everybody in the chat just like, \"No, that's what Mike calls him. That's a different That's the same person. Scoochi scoochis. Shies.\" I was like, \"Wow, what a weird coincidence.\" These names are so similar. [Music] [ __ ] sleepy gooes. Look at you,",
            "start": 1802.4
        },
        {
            "text": "Mike calls him. That's a different That's the same person. Scoochi scoochis. Shies.\" I was like, \"Wow, what a weird coincidence.\" These names are so similar. [Music] [ __ ] sleepy gooes. Look at you, Nick. You're [ __ ] You're moving, bro. I'm hustling. If not, we're getting up to that looking for. That was Ace Train Arena. Yeah. Put you on a different page next. Why are we even fighting with them? Like, do they Welcome to Route 26. Um, I can't get past them without Yeah, people they they still want to make sure you got game. Is this like the like border patrol? Stealth past them, you know. Can I stealth past them? Yeah, you can. Those are some that you can't, but you as an item you can slow your heartbeat. That'd be awesome. 26, Mike. Yeah, you're there. We're going to have one, two, three, four, five. I tried. Five, six, seven more fights. His little butt bear does for you right there. Little tail. Little Lulu butt. Lulu butt. Oh, never mind. Photographer Cameron only shows up on",
            "start": 1873.76
        },
        {
            "text": "four, five. I tried. Five, six, seven more fights. His little butt bear does for you right there. Little tail. Little Lulu butt. Lulu butt. Oh, never mind. Photographer Cameron only shows up on Tuesdays and Fridays. [ __ ] That's [ __ ] great. That's the date. Change the computer. That's wild. And they reupdate it whenever we play. Yeah. Whenever we play video games, [Music] how was uh how was Games Cast today or Games Cast? You guys were on it for about 4 hours. Was it fun? No. No. Don't. I can say the same about you and talking about Mission Impossible for about 7 hours. Movie is 3 hours long. We have to talk about every beat in it. You know, they talk about every flashback that they had to show me. They had to talk about it. The first 45 minutes. Let me just show you this flashback. I've seen it. You know, you know that the the computer broke and games daily ended like at 11:30 or 10:30. 11:36 or something. It was like nearly noon. Like games daily took nearly 2 hours. But that's",
            "start": 1935.72
        },
        {
            "text": "seen it. You know, you know that the the computer broke and games daily ended like at 11:30 or 10:30. 11:36 or something. It was like nearly noon. Like games daily took nearly 2 hours. But that's no fault of anybody's. It's this computer. Yes. Doing a random crash and us trying to figure [ __ ] out. They'd be crashing a lot. All I know is I look over. Yeah, it's 3:30 in the afternoon. They're still talking about the switch, too. Yeah, they know it's coming out, Nick. Why is it coming out? 3:30 was 20 minutes ago. They know it's coming out. It's 4:45 in the afternoon. Tim finally gets off. You know, it's that thing where he walks on his toes. He's walking on his toes all over the place. Oh my god. He walks on his toes. He kind of has a little spring to his Whenever Tammy has a good uh whenever he has a good I know what you're doing games cast and he's happy. He like does a little look at that. Yeah. Yeah. Yeah. Yeah. Little spring on his step. He likes it. It's And then whenever he",
            "start": 1992.48
        },
        {
            "text": "he has a good I know what you're doing games cast and he's happy. He like does a little look at that. Yeah. Yeah. Yeah. Yeah. Little spring on his step. He likes it. It's And then whenever he does a podcast with me, his shoulders are shrugged. Oh yeah. And he walks off and he's just like took a lot out of him. Sitting in Haley Atwell's like uh body the entire time. Oh, it's the opposite of Mike uh with a tight butt. What do you tight butt, shoulders back up with the scene? Hello. I think he [Music] missed him still here. I thought he left. It's no fun when they hear you talking [ __ ] I don't think either of you guys were here, but today I have to say I'll have to tell the story. Today I walk in, it's me and Roger in the office, and I look over. I just happen to be looking in this room right at the time that Kevin somehow tripped over his the the headphone cables, the cables to your headphones that you're wearing right now, which apparently are very long. These [ __ ] ridiculously",
            "start": 2044.88
        },
        {
            "text": "right at the time that Kevin somehow tripped over his the the headphone cables, the cables to your headphones that you're wearing right now, which apparently are very long. These [ __ ] ridiculously long head. Hold on. Hold on. You got to show people. Let me He had to have You got to show people. So, this is like the beginning of the cable here. Hold on. And then we're just going to keep going. Ridiculous. You never know when you need to roof. Like Andy is 6'4 and this is somehow taller than Andy. Crazy. You never know when you got to go smash some ice into your glass cup. So, I walked in today and it's just me and Roger. And I look over at Kevin as I I swear to God, these headphone cables are so long that he started the trip right here and it ended at the door and he barreled into the door. I thought he was trying to get the door open and like couldn't and like threw his shoulder into it and it was it was so striking. I was like, \"Fuck, what the fuck?\" I was like, \"What happened,",
            "start": 2107.44
        },
        {
            "text": "door. I thought he was trying to get the door open and like couldn't and like threw his shoulder into it and it was it was so striking. I was like, \"Fuck, what the fuck?\" I was like, \"What happened, Kevin?\" And he goes, \"Tripped over my headphone cable and then just walked out like that's a normal thing to say. It was the best. Me and Roger I've never been more bonded to Roger my in my entire life. Here comes Roger. Yes, Roger. Tell us about my favorite part about it was that it was the perfect person to come in at that moment. Right. Everything was breaking. Kevin's all up tight. He's running back and forth, you know, throwing his body around when he really does not need to be doing that. And he's coming out. And then as he trips, I see Nick open the door and just make eye contact with him as happens. It was incredible. It was so unfortunate for him. Like with a [Laughter] blasto freak out, dude got what is it, Mike? I don't know. Oh man. Or grass or [ __ ] whatever. Oh my god. You",
            "start": 2161.68
        },
        {
            "text": "him as happens. It was incredible. It was so unfortunate for him. Like with a [Laughter] blasto freak out, dude got what is it, Mike? I don't know. Oh man. Or grass or [ __ ] whatever. Oh my god. You don't even [ __ ] know. It's a water. This is my bar that happens. Everyone laughs at me. It's a water type and then it gets into water. No, he's water. He is water. Oh [ __ ] that thing's big. That's Squirtle. That's what Squirtle was the third evolution. I've never seen before, so I can't confirm. [Laughter] I don't know the [Music] truth. That thing's big, dude. Big sucker. So, I didn't mean like grass type in as in he was a grass type. I meant like maybe bring out a grass type. Oh, I don't have any grass types. Gotcha. Gotcha. I that's my big that's the big uh cuz I was getting a lot of my armor here. Yeah. My instinct is to bring out electric because electric zaps water [ __ ] up the water. But also if you pour water on something that's electric it [ __ ] up the Yeah, I know. We",
            "start": 2203.84
        },
        {
            "text": "of my armor here. Yeah. My instinct is to bring out electric because electric zaps water [ __ ] up the water. But also if you pour water on something that's electric it [ __ ] up the Yeah, I know. We we've gone through this. Mike has the of course bathtub toaster in the toaster in the bathtub example where we're not quite sure if the toaster hits the water hurts the water. If the water hurts the the water doesn't like it. Yeah. Right. But yeah. See I thought it would shake up Yeah. Shake up the fish. You feel like they would be effective on each other, you know? You think so? That's true. Well, technically the toaster is done forever. It's like, how is it not water persists? You know what I mean? Now, how is it? But then, but then you use a rice type on it. I don't What the [ __ ] is that thing? That's a victory bell. That's a grass type. Grass. At least it's got some poison. We have to kill it with fire. A plant. It's gone now. I don't think I've ever seen a blasto. That's cool. Am I",
            "start": 2263.76
        },
        {
            "text": "thing? That's a victory bell. That's a grass type. Grass. At least it's got some poison. We have to kill it with fire. A plant. It's gone now. I don't think I've ever seen a blasto. That's cool. Am I saying that correctly? Blastoise. The French version. Like a turquoise. Blast. The [Music] turquoise king. Uh crab water, I believe. But double check. Yeah. Yeah, you're right. Great, too. Oh, yeah. There's a new Starfield update. He has to play it. Has to play it. Why are you giggling? There's a Starfield joke. He's the only person in the world that's still getting What's the joke? Starfield. Yeah. That's not working. Out of his uh outer world places yesterday. a good one to get through that. Um I think he beat it. I forced Mike to go home. Yeah. [Music] And he changed my entire life yesterday. Flareon. Flareon. Flareon is a fire Pokemon. The fire Eevee. He knew that. Maybe we could have known if we didn't kill that one. Eevee. What was that Eevee saying? Ralph. Was Ralph the Eevee?",
            "start": 2305.08
        },
        {
            "text": "Flareon. Flareon. Flareon is a fire Pokemon. The fire Eevee. He knew that. Maybe we could have known if we didn't kill that one. Eevee. What was that Eevee saying? Ralph. Was Ralph the Eevee? Yeah. Gotcha. Gotcha. He's so pretty. Beautiful little boy. Looks a little scary. Yeah, that was good. [Music] Awesome. Big XP. Lot of XP out here. Huge XP. Who was that? Uh, no. Oh, nice. Okay, I see you. I I snuck by one of them. Did you really? Hell yeah. Oh, in the grass. Vernon. Yeah, Vernon. So, that was Joyce. That's my Oh, you're you're tearing it up, bro. Keep it up. No, that wasn't Joyce. That was Gavin. Cuz this should be Jake. Jake. This guy's got nothing better to do. Sit out here way by this hill. I mean, they're all Jake. They're all trading to become, you know, to go up the victory road. Oh, I hate it. Fair poison. The bug. Is it looks like a crab? Is it not water? No, no, no, no, no. It's like bug poison grass type window. Okay. Okay. Which means fire is just going to be just",
            "start": 2386.56
        },
        {
            "text": "road. Oh, I hate it. Fair poison. The bug. Is it looks like a crab? Is it not water? No, no, no, no, no. It's like bug poison grass type window. Okay. Okay. Which means fire is just going to be just fine. Boom. Oh, thank you, Sha. So, what does fire spin do more damage? Someone look up. Fire spin versus flamethrower. I'm too scared to use me, though. I'm terrified of this. Holy [ __ ] That's water, right? That's water and [Music] psychic. Fire spin is bad. Don't use it. Fireman's bad. Don't use it. Okay. Fire six. Thank you. [Music] Chocolate monkey just gifted out a tier one sub. Oh, thank you, Chocolate Monkey. Chocolate rain. He plays on day's uh 46th birthday. 46. Yeah, he still looks like a 26-y old. What did he do after Chocolate Rain? Where did it where did his career go? Did he ever make a CD or an album or anything? The Pion's electric, right? Water. Water. [Music] [ __ ] Vapor. Vapor. Water. Got it. Oh, that's that [Music] is cute. But it's my least favorite. Probably my",
            "start": 2463.36
        },
        {
            "text": "ever make a CD or an album or anything? The Pion's electric, right? Water. Water. [Music] [ __ ] Vapor. Vapor. Water. Got it. Oh, that's that [Music] is cute. But it's my least favorite. Probably my least favorite of all. I feel it. I get what Nick's saying though. Like it doesn't adapt well. It's like when it's like remember that fish movie that what's his name did where the lady falls in front of the Yeah. And you were like it's not sexy enough. I had a [ __ ] fish. It's got a little sexier than that. It's got to have a more of a dump. Back up the dump truck. Andy, what are you doing? Back that truck up. Beep. That's what he's doing. [Music] Thought she wouldn't notice me. I just try to sneak by. Dude, I get nightmares at night. But I was like 3:00 in the morning and I just I was trying to mellow out on Grey's Anatomy. Yeah. Right. And it was cool. There was like this nice couple that came in. They were like they were like trying to bang in a car. Oh, okay. And what happened? Uh",
            "start": 2541.76
        },
        {
            "text": "to mellow out on Grey's Anatomy. Yeah. Right. And it was cool. There was like this nice couple that came in. They were like they were like trying to bang in a car. Oh, okay. And what happened? Uh they got in a car accident, right? Oh, wow. because that's how they have to get [ __ ] great show to like chill out to to go to the ER to see the people. Yeah. You got to do something bad. That's right. Uh and so they get in a car accident and they're like, \"Oh.\" And and then no one knows their relationship. And so the whole time they're waxing on about how um they're probably in love and they were just doing the Nookie and they're having fun and being adventurous, but like this is what they get or whatever. And uh then it turns out, wow, they wished ill on these people. No, no, no. They were like, no, no. They were like, they were just trying, they were like, hey guys, they're probably like, don't judge them. They were probably just trying to be excited and adventurous. Whatever, right? And",
            "start": 2613.76
        },
        {
            "text": "no, no. They were like, they were just trying, they were like, hey guys, they're probably like, don't judge them. They were probably just trying to be excited and adventurous. Whatever, right? And then the guy's like, \"Hey, he wakes up.\" They said, \"Oh my god, I just have to see her. Like, I don't want to get hurt.\" This is like 2:00 in the morning. I'm freaking out that [ __ ] go against the Elite 4. I'm going to have to play this game for the rest of my life. It was a legitimate concern I have. And by the way, to the person that posted on Reddit that Nick Vick is an anxious person to begin with, no, I'm not. Yeah, he's not. He's I'm the chillst and the hellst person you'll ever meet. Barrett hasn't talked to me in 6 months. That's how cool I am. Yeah, I'm cool. Barrett, we just nod at each other. Right. And to be fair, I feel like that's my interaction with almost every head. Bear would sub me if I didn't force force him to talk to me all the time. Subra. I wouldn't even do the sub",
            "start": 2657.04
        },
        {
            "text": "other. Right. And to be fair, I feel like that's my interaction with almost every head. Bear would sub me if I didn't force force him to talk to me all the time. Subra. I wouldn't even do the sub like I I just do the jovial flip off. Flaffy laughing Eddie. Flaffy. Also, your bulito is burned. Flaffy, always your little favorite uh sheep. It's the electric sheep. It's the first round of the electric sheep. So, the previous dudacov, right? Yep. Baby dudacov. Baby dudacov. I'm going to put in the previous. I don't have anyone good against [Applause] [Music] electric. So, anyway, long story short, I'm watching this 2 o'clock in the morning. And I'm thinking, \"Oh my god, I'm going to be in that room forever while I'm terrified or whatever.\" And the guy's like, \"Let me just bring me over to see her.\" And then the girl wakes up. She goes, \"Hey, is is he where is he? Is he dead?\" And they're like, \"No, no, don't worry. He's alive.\" She goes, \"No, tell me he's dead.\" Cuz he was like an",
            "start": 2687.76
        },
        {
            "text": "to see her.\" And then the girl wakes up. She goes, \"Hey, is is he where is he? Is he dead?\" And they're like, \"No, no, don't worry. He's alive.\" She goes, \"No, tell me he's dead.\" Cuz he was like an assaultter. He like kidnapped her. Oh my god. So now I'm in it. Now I'm like, \"Now I have to figure that now.\" I'm like stressed out. I'm stressed out. How do you expect him to move on? A fire happens. A little girl gets lost. She gets kidnapped by the guy, too. He's trying a different episode, dude. Before my my kind of my thought process here is being backed up by chat. Sheriff is weak to electric cuz he's flying. You were right. You were right. Yeah, you were right. Good save. You were right. Now, continue on with your story before we get lost and then we lose sheriff. So, like were they like really banning him in the car? No one that's good against electric water. I guess I could just put dude. Uh use coos. Cuz yeah, I feel like cous is going to be and also your levels above. I think",
            "start": 2742.88
        },
        {
            "text": "really banning him in the car? No one that's good against electric water. I guess I could just put dude. Uh use coos. Cuz yeah, I feel like cous is going to be and also your levels above. I think the cow is good against that. I don't know what the [ __ ] the cow is. Exactly. That the cow is just generic. So like I think the cow would be fine. Oh yeah. [Music] What happens if a bird flies into a telephone pole? Does it damage the bird or the telephone pole? Exactly, dude. We don't [ __ ] know. Oh [ __ ] So now you're into this episode of uh Gray's No, I haven't finished it yet, but the guy Well, spoilers, the guy ends up exploding. What? What? It's Grey's Anatomy. Spoilers. So he goes, they get locked in because there's they call they call it orange alert, which is that some there's like a kill apparently like a sexual assaulter loose in the [ __ ] everything locks down, but Edwards is locked in with this guy and this little girl that's lost. They're all locked in. And he's like, \"You",
            "start": 2779.92
        },
        {
            "text": "kill apparently like a sexual assaulter loose in the [ __ ] everything locks down, but Edwards is locked in with this guy and this little girl that's lost. They're all locked in. And he's like, \"You better get me out of here. I'm going [ __ ] stab you with a st a scalpel. He's kind of [ __ ] up anyway, but he's still strong enough to overcome him and the little girl cuz the little girl is like 10, right?\" And she goes, \"The only thing that'll get us out of here is a fire.\" So the guy goes, \"Okay, well, go get me some [ __ ] to start a fire with.\" So it starts a fire and then Edwards realizes this guy's going to kill him. Like she's going to take the girl cuz if he's running out of a burning building with a little girl, no one's going to stop him, right? So Edwards goes, \"Okay.\" And she takes one of those, you know, those water bottles that have the long thing that you stick in the mouth of a takes the hamster bottle as the guy's lighting a fire to do the thing. She takes the hamster",
            "start": 2829.68
        },
        {
            "text": "one of those, you know, those water bottles that have the long thing that you stick in the mouth of a takes the hamster bottle as the guy's lighting a fire to do the thing. She takes the hamster bottle full of alcohol and squirts it on him. He gets lit up. Of course, we're in the OS, Andy. What do we have in OS? Of course, oxygen tanks. Edward sees him go toward the oxygen tank and she runs to grab him and explodes. But she's fine. But the little girl took one to the leg. Oh man. That's where we're at right now. You got to stop watching the show. Yeah, I can't. It's season 13. I have to see how it ends. Jesus Christ. It doesn't. I do love What the [ __ ] is this? You know how many episodes andor wrote me. What the [ __ ] are you guys doing? [Music] I All my guys are paralyzed. I got to I'm putting dude. I have no idea what he's doing. It does really feel like every time I run these Pokemon streams that like some But we just have fun. We I enjoy the Grey's Anatomy stuff. No, you don't.",
            "start": 2857.44
        },
        {
            "text": "putting dude. I have no idea what he's doing. It does really feel like every time I run these Pokemon streams that like some But we just have fun. We I enjoy the Grey's Anatomy stuff. No, you don't. You just said you got to stop watching the show. You can't tell me you enjoy of your health. You can't tell me you enjoy something and then and then throw [ __ ] at me 5 seconds later. Good call. Cuz I would have gone along with Mike like, \"No, you're right. He's lying. I do enjoy it.\" You don't. says Grace Anatomy is It reminds me of when I had a girlfriend. I'd look over and be like, \"What are you doing? I'm watching Grey's Anatomy.\" I go, \"I'm not going to watch that.\" You know what I mean? Just watch. I never watched either. My wife watched all of them. I never watched any of them. There's just something really fun about watching that much bad TV. And seeing the eras of like what was LR's calling me. Lyra's calling me. It just seems like that's all [Music] bug catching contest. As if",
            "start": 2898.72
        },
        {
            "text": "just something really fun about watching that much bad TV. And seeing the eras of like what was LR's calling me. Lyra's calling me. It just seems like that's all [Music] bug catching contest. As if we're not doing something live. on. We're on the road. We are trying to get the victory on burning. Bug catching contest does sound enticing though. We've been there. We want Kevin. If Kevin was here, he' be like, \"Go get a fighter. Get a fighter. Ship. Go a fighter.\" Roger's laughing. You got Roger dying over there. They got Roger. Jesus. They got Roger. Today's one of those days where we just have the door open and everybody's part of the having a fun time. We're having a fun time. earlier. [ __ ] Nick going, \"Oh [ __ ] Tim's still here.\" I was talking [ __ ] about [Music] him. I swear to God. When you start your day watching Kevin barrel roll into a door, nothing better. And he was so stressed out the [ __ ] table. He was so stressed out he didn't even have time to tell me to shut like",
            "start": 2942.32
        },
        {
            "text": "When you start your day watching Kevin barrel roll into a door, nothing better. And he was so stressed out the [ __ ] table. He was so stressed out he didn't even have time to tell me to shut like shut [ __ ] [ __ ] off and go talk about this. Don't laugh at me. He just had to keep running back and forth to figure out what the hell was going on with the machines. My favorite is whenever he realizes I did this in front of the worst person possible. But who is worse than me in the office to do something in front of? Only you. No, because like you don't think you or Mike? Maybe me. Yeah, I think for sure you cuz you know what? I'm going to be obvious about it. You're going to wait. I feel like all three of you are tied for different reasons, you know. Oh, Mike would be the worst. cuz you know Mike would never bring it up in front of you, but he just totally stabbed you in the [ __ ] back. All right, we're in. [Music] Y'all didn't answer Nick's question about or uh Chris's question about",
            "start": 3000.68
        },
        {
            "text": "Mike would never bring it up in front of you, but he just totally stabbed you in the [ __ ] back. All right, we're in. [Music] Y'all didn't answer Nick's question about or uh Chris's question about what y'all were doing. You get the evolutionary stones from the buck. Well, we made it. That's pretty awesome. Like, so in your face, you know what I mean? We've arrived. Take that, Chris. I don't know why I'm turning on you. You're very Damn, dude. They let me run in the mic. I have eight, bro. You flash. That's so cool. I got eight badges from from [ __ ] Jojo, man. I'm here. The security came. Let's look up. Oh, no. He won't let you go that way. Mount Silver. What the [ __ ] is Mount Silver, dude? Cuz you're not ready for this way, dude. Mount Gold. Oh. Oh, wow. Oh [ __ ] No, we're not ready to go to Kanto yet. Amongst all the other technical difficulties, apparently Kevin had also started streaming to the Pokemon YouTube stream. Yeah, that was pretty sick. Live like six hours. People",
            "start": 3044.56
        },
        {
            "text": "to go to Kanto yet. Amongst all the other technical difficulties, apparently Kevin had also started streaming to the Pokemon YouTube stream. Yeah, that was pretty sick. Live like six hours. People blame that on me. [Laughter] What is that thing? Oh, dude. That's What is that? That's a sick Pokemon right there. We caught the the tiny little teddy bear a long time ago in the forest. Oh my god. Do I kill it or try to catch it? I mean, you can do either or. I'm going to I'm assuming that's just the normal type, right? The bear. Yeah. Ground type. Maybe I think he might be a normal type. Maybe. I think Mike will judge you if you try to catch it. You just don't try to move on. That's a good point. Move. Yeah, he's a normal type. [ __ ] calm [Music] it. [ __ ] catch him. [Music] What the [ __ ] This thing's eating me alive. [Music] [Music] No. Wow. I have so much that I was paralyzed. He's a bear. He's got a lot of strength. Yeah. Just because you're paralyzed doesn't mean you can't move at",
            "start": 3096.4
        },
        {
            "text": "This thing's eating me alive. [Music] [Music] No. Wow. I have so much that I was paralyzed. He's a bear. He's got a lot of strength. Yeah. Just because you're paralyzed doesn't mean you can't move at all. Shake it off. Yeah. It's like h like what? I'm going to save the Tom Cruz [ __ ] for later when people get the chance to watch the movie. Just say it, man. No. Yeah, they all watch Save it. Save it. They all watch the interview we did live. They all watch stupid. I watched it. I had a great time. Kill this [ __ ] bear cuz destroying kill this bear, bro. [ __ ] kill that bear and don't die, please. Me alive. Going to throw ultra balls at it until it gets in my bag. Oh. [ __ ] you. Oh. Oh. Oh no. Let's not make a mistake here. [Music] We got to just strike hard. Strike fast. We got you. You know what? No more catching Pokemon. No worries. We just kill. Okay. That's what we're here. That's a good point. We're here to kill. We're killers. That would have really shaken us up if we lost",
            "start": 3161.36
        },
        {
            "text": "You know what? No more catching Pokemon. No worries. We just kill. Okay. That's what we're here. That's a good point. We're here to kill. We're killers. That would have really shaken us up if we lost somebody right there. It would have really sucked affected all of us deeply on that one. [Music] Deadline reports Marvel Stu Marvel Studios is pushing back the release of its next two Avenger films directed by the Russo brothers. Avengers Doomsday has been moved to May 5th uh from May 5th to December 18th, 2026. Meanwhile, Avengers Secret Wars is moving from May 5th to December 17th, 2027. No more summer blockbusters. Welcome the holiday hoown. I knew you were going to go with Hoown there. Did you know once I said holiday? I heard I was like I don't know where I'm going anymore. It's going to be a holiday. You caught it. I did. The number is 157. Barrett, I've scrolled down to 157. Send nuggies with PewDiePie or Geodude BB holiday heaters chat. What are we talking about, dude? Cutie pie.",
            "start": 3246.08
        },
        {
            "text": "be a holiday. You caught it. I did. The number is 157. Barrett, I've scrolled down to 157. Send nuggies with PewDiePie or Geodude BB holiday heaters chat. What are we talking about, dude? Cutie pie. Either cutie pie. I love cutie pie. Yeah. Q T and then a pie. [Music] Um, and the Cortez reactions to May 5th to December 18th, 2026. Um, you know, I'm glad you asked, Mike. Yeah. Cuz you, you know, this means a lot to you. Yeah. Yeah. Um um it it's really going to [ __ ] up our interview. Yeah, but here's the cool part. Cuz we going be You might be at home and they'll be called you like Eddie, you got to watch this movie. You're like can't give up at night. How is it going to be? Sorry guys, I'm at home. I'll do it. Really going to throw things off. I don't like it. I'm just really going to ruin the tour. All right, let's turn around this thing. Uh, do we like December movies though over a May kick off the summer movie? I liked the change for Star Wars when when Star Wars was doing like",
            "start": 3303.6
        },
        {
            "text": "ruin the tour. All right, let's turn around this thing. Uh, do we like December movies though over a May kick off the summer movie? I liked the change for Star Wars when when Star Wars was doing like first doing the stuff under Disney and they were doing like the yearly uh kind of Christmas time uh releases. That was a fun way. Is it the wrong way? I'm with you, Baron. I love a good May movie. Especially cuz like right there that first week of May's right next to my birthday song. It's called a birthday present. But like I actually enjoy a good December movie. This I think Christmas time is when everybody goes out and they're with families. Like we didn't know we had one as well. Yeah, I love that around that time. I don't mind it. Are we looking forward to the first Avengers movie of two which is Doomsday. It all depends on how Fantastic 4 is. Yeah, that sets the tone. Fantastic 4 rocks. I'll be even more stoked. Okay. Okay. Cuz to me, the second one sounds like the one I want.",
            "start": 3384.16
        },
        {
            "text": "two which is Doomsday. It all depends on how Fantastic 4 is. Yeah, that sets the tone. Fantastic 4 rocks. I'll be even more stoked. Okay. Okay. Cuz to me, the second one sounds like the one I want. Secret Wars. Mhm. Uh I don't know how deep they'll follow that from the comics that I read. I assume it's going to be m probably much different. Well, it's the endgame sort of thing, right? Like it's Infinity War Endgame. They're still two pieces of the pie, right? Oh, they're two They're two pieces of the pie. No, no. Andy Andy meant when he said they're two pieces of pie. Yeah, they're two. Yeah, they're two separate pies. Yeah. Okay. Oh, you think it's a part one, part two situation? Oh, that's 100%. Oh, I thought it was going to be a little bit different. Yeah. No, cuz Secret Wars to me was the comics that I let you, Nick, where the scroll infiltrated and become all of the Marvel heroes and they got to start picking who's who and [ __ ] Oh, that's Secret Invasion. Secret Invasion. Yeah,",
            "start": 3431.6
        },
        {
            "text": "the comics that I let you, Nick, where the scroll infiltrated and become all of the Marvel heroes and they got to start picking who's who and [ __ ] Oh, that's Secret Invasion. Secret Invasion. Yeah, Secret Invasion. That was already adapted terribly. That was a great show. Shut the Is that the one where she had the arm, right? Yeah, dude. That was lit. All right, Chris. Kind of messy, Chris. Cuz it's kind of messy, but it looks I'm proud of it. No, he wants something to be proud of. What the [ __ ] are you talking about? I just like I don't like I I got to I started getting real fast and loose with it. No, that looks beautiful. The strokes. Thank you. Hope you like this. I don't know when you'll get it. Uh this is the puzzle, Mike. Here we go. The maze, Mike. Oh [ __ ] Yeah. Bigger news that Andy, you see, it's confirmed. Alice Garland making the Elden Ring movie. Elden Ring. Confirmed. Confirmed. Variety. Holy [ __ ] Roger, come on over here and help Nick get you tell them. You're",
            "start": 3481.6
        },
        {
            "text": "that Andy, you see, it's confirmed. Alice Garland making the Elden Ring movie. Elden Ring. Confirmed. Confirmed. Variety. Holy [ __ ] Roger, come on over here and help Nick get you tell them. You're [ __ ] useless. You were useless. You couldn't be less enthusiastic about hanging out with me. How to get to this goddamn puzzle. Couldn't be less enthusiastic. I was like, \"How do I get to this puzzle, Nick? I'll figure it out.\" All week, all week I've been thinking about uh someone left Doritos next to the printer. And was it you, Andy? I was like, \"No, I just told y'all I hadn't eaten all morning.\" Roger looked at me. This is Roger asking you or someone. There's a Nick on the podcast. Oh god. Cuz before the podcast, Roger looked at me and he was like, \"Hey, are these yours?\" Cuz I, you know, I'm a basic [ __ ] I I make a PB&J for my lunch and then usually bring a small bag of chips. Like I'm a middle schooler. Um, and so naturally Roger looked at me like, \"Hey, these are your chase.\" I",
            "start": 3527.52
        },
        {
            "text": "I'm a basic [ __ ] I I make a PB&J for my lunch and then usually bring a small bag of chips. Like I'm a middle schooler. Um, and so naturally Roger looked at me like, \"Hey, these are your chase.\" I was like, \"No.\" And then we called Mike and Mike was sitting in the back of the room and he walked up all tight and we were like, \"It's Mike. Look at the way he's walking. We know they're his.\" And and then uh he goes, \"What type were they?\" Nacho cheese. Nacho cheese. Nacho cheese. So funny. Mike, I watch Roger eat those chips. Damn. All right, let's see. Let's see where Nick is. So funny. Are you on the second floor? I don't know, man. I'm kicking a [ __ ] rock. Yeah, I don't think I'm supposed to be kicking it this way. Have you gone this way before? No. Is this where you came from? No, this is new to you. Okay. Yeah, you go down there. There's C. You got a B over here. What the [ __ ] is a Destiny thought? I like this area. He likes this area. I like this area that I'm seeing right now.",
            "start": 3578.24
        },
        {
            "text": "is new to you. Okay. Yeah, you go down there. There's C. You got a B over here. What the [ __ ] is a Destiny thought? I like this area. He likes this area. I like this area that I'm seeing right now. I like it. I like what I'm seeing. Like what we're working with. All right. Uh and so yeah, jump over that. Got to go up this thing. Hold up. Okay. I'm on like level Now I'm on victory road. Like level three. Yeah. Now you're on level three. There's no way for me to get past level three. Okay. Hold up. Hold up. Where does that hole take us? It takes me back down to where I just was. Well, take jump in that hole. Let's see where it takes us. It takes me here. All right. So that takes you over to C. So a BC combo. You're telling me when you go up to D and E. That's not helping you either. We need a J. Oh, I see it now. All right. Go back to that B ladder that you No, no, go back. Go back. Rewind time. Yeah. Go that way. Now go up and then to the left. Okay. Go left. Up and left. Don't worry",
            "start": 3625.76
        },
        {
            "text": "a J. Oh, I see it now. All right. Go back to that B ladder that you No, no, go back. Go back. Rewind time. Yeah. Go that way. Now go up and then to the left. Okay. Go left. Up and left. Don't worry about that Pokéball. Keep going down the stairs. Two sets. Then take a left. Skip this first ladder. Oh, here we Oh, but I can't get That's what that was. Okay, so I need to get over to there. Okay, so go down that ladder. Go down the ladder. I just Let me see where it takes you. Oh, okay. So, that takes you to floor one. Okay. All right. Go back. Yeah, people are saying you had it right before. Okay, let me go back. Give me a permanent repel. I never want to talk to another Pokemon ever. I don't want to see any more Pokemon in this [ __ ] Pokemon game. Ignasio Roas's yelling, \"Please stop. I'm trying to figure out where the [ __ ] I am in the cave.\" You can't just like, you can't take your friends into a deep dark cave and look at him and say, \"Okay, where are we now?\" They got to know",
            "start": 3677.48
        },
        {
            "text": "I'm trying to figure out where the [ __ ] I am in the cave.\" You can't just like, you can't take your friends into a deep dark cave and look at him and say, \"Okay, where are we now?\" They got to know where we're at. Also, y'all are watching on a bearings. Let me get my bearings here. Let me get his bearings. All right. So, I'm coming back this way. Now, jump through the hole. All right. And now I got to go back here. I don't know where. I don't see it though. See, now Ignasio says you just don't have to fall. Oh, you don't have to fall. Okay, let's see. Let's prove him. Let's prove him right. Oh, wrong. All right. So, I had to not fall. Okay. No, we're proving him right. So, don't fall. I missed I must have missed the step here. Where? See if I can get How can I not fall? Do I have to use cut? No, don't fall. How do I There's nowhere else to go. No, go back down. But he said don't fall. Fall back down. They're talking about in the other room. Yeah. The b the boulder that you're We go",
            "start": 3733.36
        },
        {
            "text": "cut? No, don't fall. How do I There's nowhere else to go. No, go back down. But he said don't fall. Fall back down. They're talking about in the other room. Yeah. The b the boulder that you're We go up to de has Yeah, it's the only way [Music] around. Move boulder. Go up then don't fall. So, there's something up here that you just didn't see. I must have I must have missed something. Okay, he missed something. Chat, give him a second. Sorry, chat. Sorry, agnostic. Let him take a look. Okay. Well, no, he has to fall. How do I get around this [ __ ] spot? Yeah. How do you want him to get around this goal? I was walking the top of it. Yeah. Oh my. They got They got to make that clear. They got to make that clear. Yeah, they got to make that clear. Yeah. Yeah. Yeah. Don't even try. Be on my side. Don't even try on that. You have the right side. That is not on you for Yeah. That's not on him. No. No. Don't even try with that. I'm going to ult ball. Thank you guys for having my back on",
            "start": 3782.28
        },
        {
            "text": "my side. Don't even try on that. You have the right side. That is not on you for Yeah. That's not on him. No. No. Don't even try with that. I'm going to ult ball. Thank you guys for having my back on that. Yeah, we were of course what what did you see it? It was crazy. That was wild. Do I Which one? All right. There's a G and an F. Okay. Well, G and F. G and F in the Oh, you can go with G. Which one? That top hole. Yeah, it was the kind of walkable gap, Nick, that like in all these games when you look at them, you're like, come on. You're a little guy. You can walk past that bush. How is that bush blocking? What are you doing? Yeah, you're a trained soldier. Mantle up the [ __ ] hill. Yeah, this is uh this is an H ladder. So, let's take that H ladder. Okay, Barrett, I don't know what the letters mean either, but you keep saying them like we're seeing them in game. And it's like, ah, we got a G and an F. Go in the [ __ ] are you talking about? Go down to the right. Up. Yeah. Right. Up.",
            "start": 3833.12
        },
        {
            "text": "mean either, but you keep saying them like we're seeing them in game. And it's like, ah, we got a G and an F. Go in the [ __ ] are you talking about? Go down to the right. Up. Yeah. Right. Up. Right. Yeah. Boom. We made it. Remember that one Pokemon name? Oh, Tim's here. Damn. Remember that one Pokemon name for that one user? We're like, \"Mike, you're saying the wrong [Music] name right here now.\" Oh, Tim's coming at me. Oh [ __ ] I heard you talking [ __ ] about his walk. He's going to have all ground Pokemon. That would be amazing. Just [ __ ] I've adapted to your play style, Sneezle. What the hell is that thing? No [ __ ] What the hell is a sneeze on mic? Uh, it's some sort of weird weasel cat. I bet you it's a normal type. Normal or ground? Like I don't see any typing. I don't know why he's Why are we typing? Why are we questioning it with the water? [ __ ] It's dark and ice. Wow. I was really off on that one. It's a weird weasel cap. Probably normal. You know what? Queen normal.",
            "start": 3886.4
        },
        {
            "text": "he's Why are we typing? Why are we questioning it with the water? [ __ ] It's dark and ice. Wow. I was really off on that one. It's a weird weasel cap. Probably normal. You know what? Queen normal. Got to be normal. Probably [ __ ] normal. This is the opposite of it. Oh man. Okay. Uh feral feralator. For alligator. Oh, that's the one I just drew. What is that? Water. Water type. I mean, it may be water and something else, but it comes from the Wait. Oh, look it up. I was thinking Oh, for alligator. That's a water type. It's an alligator. Yeah. I was thinking about the turtle that you were drawing. Oh. He's about to meet my level 48 dudacov. The American Ninja slapped on. [ __ ] me. I don't have my discharge. This dude definitely like they reached the character uh limit with him. Yeah, they started deleting nose and stuff. Yeah, he's all over the place. Oh, never realized that. Uh, I was just checking in on [ __ ] and our day tomorrow. It is a day tomorrow. Are you ready? Uh, let's",
            "start": 3942.72
        },
        {
            "text": "they started deleting nose and stuff. Yeah, he's all over the place. Oh, never realized that. Uh, I was just checking in on [ __ ] and our day tomorrow. It is a day tomorrow. Are you ready? Uh, let's see. Yes, we are ready. We got a special meeting at 11. Flying poison. Goldbat. Yeah, correct. Yeah, I would keep dudac. Yeah, I'm going to keep dude, but I want to What is it? What do I have to use to restore everything? I want my PP and status effect. Oh, uh, ether. Is it a max ether? Elixir. But if you want to do health as well, I think it's like a full heal, right? I don't I don't know if everything though. One of these does it [Music] right. Fault restore or something like that. [Music] Nothing in the game heals health and PP at the same time. Okay, well [Music] for I really need to get Oh, for does health and status. Okay, I did nothing. Look at that, Nick. I know. I got I want how to restore his uh the PP. Let's see what he got. They like Yogi Bearp. He's got a haunter ghost. I'll",
            "start": 4006.0
        },
        {
            "text": "Oh, for does health and status. Okay, I did nothing. Look at that, Nick. I know. I got I want how to restore his uh the PP. Let's see what he got. They like Yogi Bearp. He's got a haunter ghost. I'll just keep looking at it. Big. Hell yeah. Haunter. Ow. out of here. Yeah, he's fine. Kadabra, that's a place type, right? Oh no, that's a psychic [Music] Alakazam [Music] Pokemon. Oh [ __ ] I'm just reading up on the rules of the Pokemon League and it says once you enter the Pokemon League, you cannot just walk out unless you've been defeated. Yeah, I know. So, we have to defeat everything. We have to do all of them. It was last time. It's We got a whole situation on our hands. The whole [ __ ] situation. We'll see you in stream number two. This Well, if he fails, it's over. This is it. This is the end of it. Oh, you know what? He has a backup six. Actually, I do. Now, if I fail, it's over. Six. If I fail, it's over. It's not a pretty six. A pretty six. Uh uh. Use your No. Okay. Yeah, that",
            "start": 4084.04
        },
        {
            "text": "the end of it. Oh, you know what? He has a backup six. Actually, I do. Now, if I fail, it's over. Six. If I fail, it's over. It's not a pretty six. A pretty six. Uh uh. Use your No. Okay. Yeah, that was a bad idea. It uh use cous. Yeah, the cous will melt that. The backup six are like he said what? Like he thinks we are an option. He's calling us. We have to fight. I'm comfortable in in in AAA double A. I'm comfortable in the boxes. I'm comfortable in minor leagues. I cannot be called up for a game right now. You want me to pinch hit for uh against show Otani? I'm goddamn I'm I'm [ __ ] Chase Daniel who's been a career backup in the league. Look at Look at Nasio Rojas in the chat says you promised us the Elite 4. Come commit to fighting Elite 4. You promised us Elite 4. You promised me you'd watch Real Genius. Yeah. You can't even bother to spend $221 American to rent a [ __ ] 1986 classic starring Valcom RP. Yeah. Never went to the sirly winch. You know what? You and I, we're at odds",
            "start": 4171.92
        },
        {
            "text": "watch Real Genius. Yeah. You can't even bother to spend $221 American to rent a [ __ ] 1986 classic starring Valcom RP. Yeah. Never went to the sirly winch. You know what? You and I, we're at odds together, my friend. Thank you for coming to my show, though. That actually puts you back in my favor. Wow. Back. Congrats. Yeah. Damn, dude. I just kept all this [ __ ] Did I keep all his Pokemon? No, I don't think that's how that works. Kicked his ass, though. I'm proud of you. Okay, I think I crushed it. Do you think his walk? No, his walk away was walk was slumped. Yeah, it was more slumped. He had a little spring step that because Tim never quits. He never never quits. No, he never quits. He never surrenders. Galaxy Quest. Never give up. Never surrender. You never give up. Timote. Never give up. Never. We got to make Mike watch that movie. Have you never seen it, Mike? Which movie? Galaxy Quest. Oh yeah, I love Galaxy Quest. Oh yeah, that's a good one. Never give up. Never surrender.",
            "start": 4234.88
        },
        {
            "text": "up. Never. We got to make Mike watch that movie. Have you never seen it, Mike? Which movie? Galaxy Quest. Oh yeah, I love Galaxy Quest. Oh yeah, that's a good one. Never give up. Never surrender. That's a great movie. They want you to turn on the animations. We'll turn on the animations at the elite. Yeah, get the We got to get there. Chris challenged us and said we're not good at this. And we said I know. [Music] What did you slack Roger? [ __ ] Roger. What did you slack Roger? Roger. Why is he yelling at you from across the office? Won't have any effect. What? What are you trying to do? I'm trying to do ether or elixir for PP. Elixir. No. Oh, no. Ether for PP. Yeah. Oh, maybe I just restored PP. Roger is currently yelling at Mike saying just send it to Greg. Don't send it to me. It's the same amount of work. What are you talking about? It was uh requesting a game code. And I I I said, \"Can you request these codes for us, Roger?\" And then he came back at me. Yeah. Why wouldn't you",
            "start": 4287.68
        },
        {
            "text": "the same amount of work. What are you talking about? It was uh requesting a game code. And I I I said, \"Can you request these codes for us, Roger?\" And then he came back at me. Yeah. Why wouldn't you not just slack Greg? Well, we me and him were in a conversation. That's why. [Music] Ignasio said, \"I just replayed this game and Togepi was my MVP.\" Well, he's nothing to us. Been relegated to the bench. Yeah, he's been benched. All right, Mike. We're out of the hills. Hills have eyes. Indigo Plateau. Welcome to the Indigo Plateau. This is where we will have one final conversation before Nick beats this video game. The final Elite Four here. Since there is no back seis once Nick starts this, do we need to rare candy them up a little bit higher? I would like to. I mean, you've already had a cakewalk so far. Have I? And I just don't want you to have the ultimate cakewalk. Yeah. You're like perfectly leveled for the first three fights here. Yeah. But then the final guy, it's like, \"Oh",
            "start": 4355.76
        },
        {
            "text": "a cakewalk so far. Have I? And I just don't want you to have the ultimate cakewalk. Yeah. You're like perfectly leveled for the first three fights here. Yeah. But then the final guy, it's like, \"Oh [ __ ] where did he come from with these numbers?\" That's how it goes. Your call, man. You Everybody is 41 to 45. Sure, there's a 47 and a 46 mixed in the lot, right? But then all of a sudden, the final guy is 46 to 50. You're going to level up during these fights. Yeah, you're going to be fine. Can I Can we shove rare candy in Pokemon's mouths while we're fighting? Yeah, in between. I think in between. Maybe maybe after the Elite 4. I don't know if you get a moment. I assume you get a moment. I mean, do you want to just rare candy everyone up to 50 and just roll this [ __ ] thing and then we go get pizza after this? No. I am fine with that. He's talking to me. You can do You can do it. I believe in you. Is there a place for him to heal up before we walk into this? Yeah. So, when you walk",
            "start": 4418.88
        },
        {
            "text": "go get pizza after this? No. I am fine with that. He's talking to me. You can do You can do it. I believe in you. Is there a place for him to heal up before we walk into this? Yeah. So, when you walk in there, there's going to be a Poke Mart and a Poké Center. Gotcha. But once we start the fights, there's no back seats. So, here's where we're at. Feel the hill on my people. Do you see how he's talking to me? You can do it. I believe in you. All right, let's do this, bro. Yeah, the gyms were still tough. I just say we take it on. I mean, Mike, you got Last chance. I'm going to the bathroom. Here it is. It's 4:30. Let's run an ad and let's finish Pokemon right here. If you fail, you fail. If you win, you're the champion. Oh [ __ ] that's definitely going to be Chris to yell at us. Chris, he's Chris. All right, before we cut the ad. Yeah. Yeah. Chris Anger, you're live on twitch.tv/countgames with the crew. Uh, you are our pokey guidance. You're our pokey master. What should we do? No",
            "start": 4467.84
        },
        {
            "text": "he's Chris. All right, before we cut the ad. Yeah. Yeah. Chris Anger, you're live on twitch.tv/countgames with the crew. Uh, you are our pokey guidance. You're our pokey master. What should we do? No more [ __ ] candies. [ __ ] you guys. You guys have been [ __ ] this game too much. It ruins the heart of the [ __ ] Nick. Go the [ __ ] man the [ __ ] up. If you all die, you [ __ ] die and you're failures. You [ __ ] can't. You lost to a [ __ ] child's game. Yeah, but we're not that was like a range of emotion, but we're not failures. Like I don't think that So like he was like the coach at first, but then he became my band director where he's really mean for no reason. But we're not going to fail. We're going to prove him wrong. You're going to [ __ ] fail. We're going to run it out for our sponsors and then we're going to come right back and we're going to finish this game right here live right in front of all of you. Here we go. This episode is sponsored by Subway Servers. The goated",
            "start": 4518.08
        },
        {
            "text": "sponsors and then we're going to come right back and we're going to finish this game right here live right in front of all of you. Here we go. This episode is sponsored by Subway Servers. The goated endless runner that carried me through middle school, high school, college, and now adulthood is celebrating their 13th birthday, which also marks their 200th World Tour update. And they're going big because Subway Servers decided to travel to not one, not two, but 21 different locations in their 200th World Tour special event. As kind of funny as Resident Zoomer, I can seriously say that I adore Subway Surfers. It's one of my favorite comfort games. Grabbing items, completing challenges, and pulling out a hoverboard right as I'm about to hit a train feels just as good now as it did when I was sitting in the back of Mr. Coburn's Spanish class. Play through all 21 destinations to unlock amazing rewards such as characters, hoverboards, and in-game currency. Just tap the 200th World Tour",
            "start": 4556.32
        },
        {
            "text": "was sitting in the back of Mr. Coburn's Spanish class. Play through all 21 destinations to unlock amazing rewards such as characters, hoverboards, and in-game currency. Just tap the 200th World Tour button on the screen to start playing. And exclusively for best friends, head over to kind offunny.com/subway servers or scan the QR code on screen to get a ton of special in-game rewards. The update ends on June 1st, so scan that QR code, download Subway Surfers, and start running if you don't want to miss out on all the rewards. I already did. This episode is brought to you by Factor. When life gets busy, food can sometimes feel like a chore. And the fast food trips can go from a weekly to daily occurrence very, very fast. So, buck those trends and make this season your best with nutritious 2-minute meals from Factor. Eating well has never been this easy. Just heat up and enjoy, giving you more time to do what you want. With 45 weekly menu options, you can pick gourmet meals that fit",
            "start": 4598.16
        },
        {
            "text": "2-minute meals from Factor. Eating well has never been this easy. Just heat up and enjoy, giving you more time to do what you want. With 45 weekly menu options, you can pick gourmet meals that fit your goals. Truce from Calorie Smart, Protein Plus, Keto, and more. We at Kind of funny love factor meals. Blessed Greg love it for a quick lunch in between shows, and I adore it as a healthier alternative instead of the dreaded hump day too tired to cook drive-thru run helping me to get on track with my goals. Get started at factormeals.com/kindaffunny5050 off and use code kind offunny50 off to get 50% off plus free shipping on your first box. That's code kind of funny50 off at factormeals.com/kindafoney5050 off for 50% off plus free shipping. factormeals.com/kindofunn50 off. All right, Pokemon trainers, let's set the stage, ladies and gentlemen, and NBS all around the globe. Pokemon trainers near and far, here's the finale of Nick Nuzlock 2.0, the first half. Now, did we roid up in the",
            "start": 4642.56
        },
        {
            "text": "trainers, let's set the stage, ladies and gentlemen, and NBS all around the globe. Pokemon trainers near and far, here's the finale of Nick Nuzlock 2.0, the first half. Now, did we roid up in the middle of this uh adbreak? This is what we've trained for. Nick Scarpino has taken uh a group of six, broken them down, rebuilt them, and is now at the doorstep to greatness. It's time to knock and it's time to finish the fight. Good luck, Nick. We're here with you if you need us. The Elite Four starts now. This could be one of those like he could be the greatest coach of all time if he takes this squad. Yeah, exactly. All right. Wait, who do I want to put as my first here? I feel like maybe Judikov because he's highest. What do you think? I like to lead with my strongest. Okay, let's flee with dude. I don't know how much you want me to give away. I've already given you all the levels, so but I can tell you who's up. Holy [ __ ] This is I'm assuming a psychic. Uh Will is going to be messing",
            "start": 4695.4
        },
        {
            "text": "dude. I don't know how much you want me to give away. I've already given you all the levels, so but I can tell you who's up. Holy [ __ ] This is I'm assuming a psychic. Uh Will is going to be messing around with ghost and dark [Music] moves. No, he's going to be messing around with psychic flying ice. You take him down with ghost and dark moves. Okay, psychic flying ice. Is bite a dark move? Dark bite. Dark bite, dude. Dark bite. Here we go. Fight one. Look at the coolest. And you did a great job with that art. Thank you. Here it is. Welcome. Fight number one. Will psychic type Pokemon. What's that thing? Zadu. Zadu. What is it? That bird. The flying psychic bird. It's [ __ ] chill, dude. That's another unit right there. Damn. I don't think Mike understands when I ask him what is it. I'm not asking a rhetorical question. I'm asking the navigator which side what where should I point my [ __ ] ship. Mike's like, man, it's a vibe. Vibes. There was that. You come help. There was that",
            "start": 4752.56
        },
        {
            "text": "I'm not asking a rhetorical question. I'm asking the navigator which side what where should I point my [ __ ] ship. Mike's like, man, it's a vibe. Vibes. There was that. You come help. There was that incredible moment of like I'm not asking you what I want to hear you talk. Well, well, I think it's a I I think it's like a a space kind of thing. It's like Okay, but what type is it? Uh, Sneezel. What's Sneezel? Uh, it's like a weasel cat. Look at Jinx for me, please. Oh my god, bro. Jinx is I believe psychic. Okay, we're just going to I think they're all this guy. Yeah, Jinx. Oh, yeah. It was It was Porygon. It was built in a lab, I think. But the sciences what talking about? What are you talking about? Uh Jinx. Um Jinx is ice and psychic. I have them all down here now. Oh, now you do. Yeah. This is the first time they've ever shown the Pokemon with who they are, which is nice. Like I got to Google all of them. Oh [ __ ] Damn. Damn. They can use that. They can do that. I I would use um",
            "start": 4823.28
        },
        {
            "text": "This is the first time they've ever shown the Pokemon with who they are, which is nice. Like I got to Google all of them. Oh [ __ ] Damn. Damn. They can use that. They can do that. I I would use um Kuzz because Kuz is going to take her out like pretty much in one hit. All right. Well, I have to switch though. I'm more worried about She's paralyzed. I mean, she is psychic, right? I can try the signal demon and see if Yeah, she's weak against fire, rock, bug, ghost, dark, steel. That was a horrible sound. My [ __ ] nightmares. Okay, that's fine. This is Exer is a grass type, right? So, let's switch Pokemon. Exeutor grass psychic. It's K's time. We don't have C's control. Let's coast through this. Yep. Torch him. That's ugly. People keep com complimenting you on the shading of uh this drawing. Oh, thank you. I kind of hate it. It's very good. It's like too contrasty. I [ __ ] it. Sometimes it's fun to do a little bit too contrasty though, you know. It's all right. That's supposed to be",
            "start": 4880.08
        },
        {
            "text": "Oh, thank you. I kind of hate it. It's very good. It's like too contrasty. I [ __ ] it. Sometimes it's fun to do a little bit too contrasty though, you know. It's all right. That's supposed to be the animation. I suppose slow bro. Is that water? He's the dude. Uh yeah, he's got the big He's also psychic, I believe. Water psychic. What? He's not water. I thought Yeah, he's water psychic. Water. Yeah, he's water. Oh, okay. Yeah. Yeah. Got the big old [ __ ] He's got like a Pokemon on his butt. Yeah. Something bit him on the butt. Oh, I don't like it in there. Wasn't it a uh No, I forget. I forget what the lore is. What bit is tail chat? It looks like some sort of shelled animal. Oh, it's dead now. Sheldar or some shelter. Oh, Shelder bit him. Oh, [ __ ] Exatu said Shelbar flying psych. It's a vibe. Prepare for a vibe. Cool looking bird. Man, I don't know. He likes like I feel like he likes Coachella. Yeah. What is it? It's looks like a bird, but it's like a dude wearing a bird suit.",
            "start": 4961.12
        },
        {
            "text": "a vibe. Prepare for a vibe. Cool looking bird. Man, I don't know. He likes like I feel like he likes Coachella. Yeah. What is it? It's looks like a bird, but it's like a dude wearing a bird suit. Yeah. See, you never know in this game. [Music] All right. I believe, ladies and gentlemen, that is Elite Four number one in easy five. Here we go. Here we go. Didn't even blink. Dude is almost wrong. I fell asleep. I like how they give I make them give me money afterwards. Yeah. So, I could I could Okay, King Walker, thank you for the stop and heal people here. Yeah. And you can feed them rare candy, so we're good. We're fine. And you give me like if there's a problem just really did I give a little candy cuz I thought it would just steam roll. Like you beat once, you go to the next one. I didn't think we were breaking. No, I think there's a break. Ah, that's [ __ ] up. And challenge them. You know what I mean? Challenge people. We'll step up to the next Qite. Thank you so much for the five",
            "start": 5030.48
        },
        {
            "text": "think we were breaking. No, I think there's a break. Ah, that's [ __ ] up. And challenge them. You know what I mean? Challenge people. We'll step up to the next Qite. Thank you so much for the five gifted. Turn on battle animations. People want to see your cool battle animations. Yep. Yep. Yep. [Music] Juice these guys up, [Music] [Music] dude. Yeah, that one. I'm going to go ahead and save just in case we have a power outage. Yeah, exactly. Nice sunny day. Somebody unplugs the thing. So, what happens if I try to leave now? It just won't let me. I guess not. We're committed to this. Yeah. All right, let's step up. Mike, number two. All right, this guy's grass, I know. This guy looks he's psychic. This guy is Koga. A poison type Pokemon user. Okay. Well, I have nothing good against poison. Ensure a quick victory with fire and psychic type moves. You know who to lead with. Lead with the [Music] coozie. They lock the doors. Nothing shady about that. Yeah. No [ __ ] Okay, I've been",
            "start": 5095.68
        },
        {
            "text": "Ensure a quick victory with fire and psychic type moves. You know who to lead with. Lead with the [Music] coozie. They lock the doors. Nothing shady about that. Yeah. No [ __ ] Okay, I've been looking forward to this all week. Yeah, let's [ __ ] finish this. Koga Koga. What the [ __ ] is that? Bye. Love you. Bye. Be faster. Be faster. Oh my god. It went red for a second. I was like, \"What the [ __ ] happening? I forgot we forgot.\" Yeah, that's what it looks like. What a weird looking Pokemon from the backside, though. Why is this dog naked? He's shaped. Yeah. Well, he had to have a surgery like poor pillow. [ __ ] He had ACL surgery. Yeah, they got to fix his ACL. Pretty sad. And then And then his other blew out, too. What the hell's a fortress? That's a bug steel. You're going to burn it. Damn. It is a steel. [Music] Oh, he put up a little shield. Little shield. Nothing. Oh, the fortress protected [Music] itself. So much for your shield. Steel. You know what? Jet fuel can still be. I",
            "start": 5176.72
        },
        {
            "text": "Damn. It is a steel. [Music] Oh, he put up a little shield. Little shield. Nothing. Oh, the fortress protected [Music] itself. So much for your shield. Steel. You know what? Jet fuel can still be. I was trying to make that joke earlier and I I dropped it. This is where Greg comes in. Yeah, Greg loves that joke. He goes deep on that one. He really does. Let's get the [ __ ] I don't know who the [ __ ] is, but I'm just going to keep this guy in. Uh, muk aka comp. It's just straight up poison. It says ground and psychic. You might be able to big time him. I'm going to big time him. Oh, he's pretty he's pretty powerful. He's got a big though. Big old hand. Yeah. See, they're getting up to my level now. This game is totally unbalanced. You're fighting level 32s when you get in here. This is bad. It's mesmerizing you. What is he grounding? What? Uh, he is poison straight up. He's just poison buck. Anyone that's psychic, he's weak against ground and psychic. I don't have either of those.",
            "start": 5252.24
        },
        {
            "text": "bad. It's mesmerizing you. What is he grounding? What? Uh, he is poison straight up. He's just poison buck. Anyone that's psychic, he's weak against ground and psychic. I don't have either of those. Yeah, that's why you just got to big time his ass with somebody strong. The dude would be great, but no, the dude's uh not good against ground. Oh, he's just poison. He's just poison. Ground and ground and psychic. Chris is yelling, \"Guys, you have something in there.\" So, somebody somebody on your group has that has a has a psychic. Oh, you're right. The sheriff. I think it's the sheriff. Yeah, I think the sheriff has a psychic move. I think you can inspect also to see what they Well, it's too late now. He's got the bubble gut. You've been poisoned badly. [Music] Okay. We got [Music] Whoa. What the [ __ ] Stop doing that. That's an insane insane [ __ ] That's a crazy thing to do to someone. Oh, he's almost dead. He's going to minimize. [Music] I got bubble. It's great. Full restore. It's",
            "start": 5308.08
        },
        {
            "text": "the [ __ ] Stop doing that. That's an insane insane [ __ ] That's a crazy thing to do to someone. Oh, he's almost dead. He's going to minimize. [Music] I got bubble. It's great. Full restore. It's fine. Hit him with that [ __ ] psychic. Yeah, dude. Shake this guy's world up. Fuji, just you're [ __ ] with this creature's like brain chemistry. Yeah, I know it. I got to [Music] heal. Do I hit him one more time? You think? I got to heal. Do you have a full restore? So, or uh Yeah, not just health, but poison. Yeah, the super health. Full restore. Does it do status effects too? [Music] Yep. [ __ ] [ __ ] yourself. This dude is resilient. Yeah, he really is. Yeah, he's really old. I want this guy on my team. Sheriff's tack misses. Gunk shot. Not the gunk, bro. You don't want the gunk. Oh, that's really not good. Mike, I need you like I need you with a false sense of confidence right now. That's what I need from you. Oh. Uhoh. Get out of the [ __ ] game. Yes. Does that say 800 full restores?",
            "start": 5385.44
        },
        {
            "text": "really not good. Mike, I need you like I need you with a false sense of confidence right now. That's what I need from you. Oh. Uhoh. Get out of the [ __ ] game. Yes. Does that say 800 full restores? Yeah. Unless we we went hunting for a lot of stuff. We really grinded off hard is right. We really grinded off street. We found a duffel bag with a bunch of money in a restroom. One of us and or all of us really just wanted this game to be over today. Oh man. Crobat. So that's that's just poison, right? But it's also flying. Uh Crowbat is poison flying. Yes. Some would call that cheating, Masio. But they would have to watch Real Genius first before they could leverage that kind of a criticism against a man, a businessman of my distinguishment, a Pokemon master like you. [Music] Oh yeah. Pretty cool looking bat though with the X-wing. It looks like an X-wing. Yeah. Yeah, that thing's sick. It's paralyzed now. Good luck trying to hit me again. Yeah. Goodbye. Oh [ __ ] This says something",
            "start": 5492.16
        },
        {
            "text": "cool looking bat though with the X-wing. It looks like an X-wing. Yeah. Yeah, that thing's sick. It's paralyzed now. Good luck trying to hit me again. Yeah. Goodbye. Oh [ __ ] This says something about you though. If you have bat Pokemon, you know what I mean? Like you we got to watch you. Yeah. You're not trustworthy. Yeah. If you got a bunch of bats as your Pokemon, I got to watch. [ __ ] he poisoned me, dude. [ __ ] He poisoned me. No, I'm not poisoned. You're good. Shook that off. Why can't I hit this [ __ ] guy? He faster. He might be faster, but he's shaking you. Can I not hit [Music] him? There we go. Oh, damn. First time. That's my first time. Uh, first time seeing Crobat. Grobat with the X. Yeah, the X-wing. Looks way cooler than Goldbat. Throw him up. Yes, he does. Right. That was a good evolution on that one. Make that a little bit cooler. Venomoth. Venomoth. Bug poison. Bug poison. Bug poison. Okay, so bugger. Well, we get a flying fire. Flying psychic rock. Let's go fire.",
            "start": 5566.76
        },
        {
            "text": "a good evolution on that one. Make that a little bit cooler. Venomoth. Venomoth. Bug poison. Bug poison. Bug poison. Okay, so bugger. Well, we get a flying fire. Flying psychic rock. Let's go fire. He's got [Music] I don't like the top of Cous. I don't like anything about Cous being real. He's just got like a He's the naked ass is such a vibe. Don't talk [ __ ] about It's weird cuz he does have a naked ass. Yeah, like when you look at the Pokemon the drawing and all that stuff. Why is he naked here? Which Pokemon movie is the Kooza in chat? Is that the second one? I think he's in the second one, right? [Music] That's beautiful right there. It's the second one. Yeah, with the unknown. That's how we like to see it. Yeah. I don't know why he's that color. Melissa, it's kind of odd. I don't know. Gym leader Phil, you tell me what's on his back. Why is he like that? Is he wearing a jacket? I look at everything else and he's a day jacket. He's got a full brown coat all wrapped around him.",
            "start": 5627.84
        },
        {
            "text": "know. Gym leader Phil, you tell me what's on his back. Why is he like that? Is he wearing a jacket? I look at everything else and he's a day jacket. He's got a full brown coat all wrapped around him. Like, did I [ __ ] up a sprite that what why does he look like he's a shaven cat? You tell me. Oh, look. Look. You see from this angle? From the side angle, you can see it. Mike, look at look at him. Oh, it's just his tail. No, it's his back flaps. He's like, don't say flaps. Never say back flap, dude. You got back flaps, bro. I'm telling you. I don't like back flap. Interesting. What is that? It's like cool little fluffs of accented uh fur, you know. Well, those are that's his uh that's the tail thing. But what are the weird things jolting out of him? He's got many wings. It's [ __ ] smoke. Are you guys blind? Says Chrisa. Oh no. Can you tell me does that look like smoke? Tell Chris that look like smoke? Not smoke. That's jagged edge of a That's steel jagged edge. Something grown out of",
            "start": 5691.2
        },
        {
            "text": "Are you guys blind? Says Chrisa. Oh no. Can you tell me does that look like smoke? Tell Chris that look like smoke? Not smoke. That's jagged edge of a That's steel jagged edge. Something grown out of him. Some sort of freak. He's got a great mustache though. Great stash. It's part of his like skull. Like it's very awesome. be great. Stash grabby Patty says back flaps was my name in high school. Nice thing. Never mind. Yeah, you know what we were going to say. Stripper [Music] boy. [Music] Should I order food? Like, how late are we going to be here? Cuz I mean, I've tried to beat this [ __ ] thing today. He only has what, three? Three fights left and he's dominating all of them. We'll be done in the next 15 minutes maximum. If I can, unless we get popped out, but if I You're not getting popped out. If I beat all of them, but my team finds dies at the final one, do I have to go back and fight all of them again? No, we're going to end the stream right then and there. It'll be a",
            "start": 5740.56
        },
        {
            "text": "popped out. If I beat all of them, but my team finds dies at the final one, do I have to go back and fight all of them again? No, we're going to end the stream right then and there. It'll be a cliffhanger. Nick Nick failed and we're just going to call it a wrap. Oh, you defeated that guy. Oh, yeah. I took All right, we're going on to number three. Three of five. Three fights left. Who's next? Who should I put up front? Like, tell me tell me this. Tell me the truth. You want to know? Yeah. Bruno is a fighting type Pokemon user. You should have flying and psychic in front. Okay, I know. I have Baller Premiere in a bit. [Music] Oh, these themed rooms are cool looking. I like how Agnosio is saying the last guy will murder you. Don't worry. I'm feeling pretty good about The Last Guy. I think you're going to be fine. Has Agnosio watched that movie you keep telling him to watch yet? Oh, yeah. Yeah. Has he gone to the Sirly Wench? He has not. I don't think he is. Did he attend Arizona",
            "start": 5812.48
        },
        {
            "text": "think you're going to be fine. Has Agnosio watched that movie you keep telling him to watch yet? Oh, yeah. Yeah. Has he gone to the Sirly Wench? He has not. I don't think he is. Did he attend Arizona baseball, softball, football games? No. This guy's definitely a fighter. And Andy, feel free to just go over there and start streaming. We're here all night. What the hell is that thing? We'll coach you. We'll comment on your gameplay. You want to know about the little fly, right? Yeah. Fly moves. Yeah, use flying. He's He's fighting. So, let's use flying or psychic, whatever you prefer. I like this. Yeah, [Music] I like this little dude. Oh, that's crazy. He's like a spinning. He's like a Beyblade. I didn't really know that they called him top cuz he's on on his head. I didn't know that. Top. Yeah. So, he's number three out of the group of the hit mods. Is he before or Oh, you think he's like an evolution? Yeah. Or is he just separate? No, I think he's in part of the Hitmon family. Yeah,",
            "start": 5865.04
        },
        {
            "text": "Yeah. So, he's number three out of the group of the hit mods. Is he before or Oh, you think he's like an evolution? Yeah. Or is he just separate? No, I think he's in part of the Hitmon family. Yeah, Hitmon family. And how many more have they added? I don't know. You think he go with all the fighting styles? Yeah. I don't think he evolves into either of the other Hitmons cuz like I don't It's not like um Hitmon Chen or Hitmon Lee evolves into each other, right? Correct. Yeah. How about four just separate? So he's just like a cousin. Yeah, he's a Brazilian fight. He's the capoera. Onyx, would you like to know? Yeah. Onyx is a rock and ground type. He's weak to grass, water, ice, fighting, and ground and steel. Uses everything. Let's go with those. [Music] Sly Ratchet. If Nick fails, do we just move on to the next game? Like Ash in the anime. He just keeps on losing. Next adventure. The next adventure. He finally becomes a champion after 20 years. Yeah. Why did they whitewash Onyx?",
            "start": 5920.48
        },
        {
            "text": "we just move on to the next game? Like Ash in the anime. He just keeps on losing. Next adventure. The next adventure. He finally becomes a champion after 20 years. Yeah. Why did they whitewash Onyx? What's happening here? Yeah, that's weird. Isn't his name Onyx? Isn't that by definition? Yeah, he's a bit more silvery though than like the gray that he usually is. Isn't the Onyx stone black? He's usually Yeah, it is. But he's usually like super dark or gray to dark gray. Hitmonchan. Okay, so fighting flying flying or psychic, they are one and the same. Wonder if I can take a hit from this guy. [Music] That moves way too much. I don't like it. Which one? Extra sensory. Yeah. What it does to them? Yeah. Really? Puts them through the ring. Like they they're not going to be the same ever again. [Music] Yeah. Ninetails got inched from anti bench for anti. Yes, that's what happened in Ninetail. Oh, yeah. It was Do you get a water? We couldn't pick. We couldn't get the water one. So was",
            "start": 5997.52
        },
        {
            "text": "again. [Music] Yeah. Ninetails got inched from anti bench for anti. Yes, that's what happened in Ninetail. Oh, yeah. It was Do you get a water? We couldn't pick. We couldn't get the water one. So was electric or fire two options. He already loved Dudikov, so it's like, well, Net Tales has got to go, though. Yeah, it makes sense. That's how we had to do it. [ __ ] I don't love that. Get out. Get out. Nice job. Got hating how cous looks. Yeah, that was a weird turn on the cous. Yeah, I didn't love that. The sheep was so cute. You take the sheep. Marip Marip. Well, you talking about Dunikov? Yeah, Dudikov. And then it turned into the bright yellow dinosaur looking thing. But what about coups? Yeah, we're talking about Oh, the coups. We don't like the look of ante. Yeah. I think he just doesn't like his sprite. That's a weird ass, right? Yeah. Weird ass. I mean, he's coups is the example of like looking at him from behind, it's like, \"Oh, you're like a four out of 10.\" And they turn on,",
            "start": 6072.96
        },
        {
            "text": "like his sprite. That's a weird ass, right? Yeah. Weird ass. I mean, he's coups is the example of like looking at him from behind, it's like, \"Oh, you're like a four out of 10.\" And they turn on, you're like, \"Oh [ __ ] this thing's rocking.\" I had no idea. You got me. Yeah. This is the champ right here, dude. This is the champ. It's a big moment for us. That thing is huge. Yeah. Extra sensory feels like it's it's too invasive. Yeah, dude. Yeah. Yeah. It looks at your Google searches before it [ __ ] you up. Mhm. It It shows you like your most [ __ ] traumatic experiences. [Music] This guy's rock sliding hard. That's going to hurt you. You're going to be okay. You're going to be okay. A lot of requests for arrow blast also. Arrow blast. Okay. Yeah. I thought you might go flying on this one. Probably. But you really went with the psychic, which is fine. I mean, you're kicking ass anyways. I'll give an arrow blast for this guy. Brock sliding. You probably be smart to do that. Holy",
            "start": 6147.6
        },
        {
            "text": "one. Probably. But you really went with the psychic, which is fine. I mean, you're kicking ass anyways. I'll give an arrow blast for this guy. Brock sliding. You probably be smart to do that. Holy [ __ ] Oh my god, that was a crit. Go ahead and get a full restore. Sometimes you just got to ride the lightning. Jesus Christ. Got to got to bring our attentions back to full here. That'll wake you up. That's tough. Now the question was like, did Sheriff not do a move right there? The rock slide shake him up so hard he's not doing a move. No, I'm [ __ ] restoring. He keeps getting a crit on me. It's fine. Now I can get I can get hidden on it now. But so that one you want to use arrow blast. Yeah, arrow blast. Well, that's the coolest thing ever. Seen these things at all. It definitely got the blood pumping though. Yeah, you looking back. You're back. Two left. You got that crit. Two left. Hit lead. I'm just going to stay in and heal. Oh, damn. I thought we cleared this up. No. Yeah. Get on",
            "start": 6200.56
        },
        {
            "text": "pumping though. Yeah, you looking back. You're back. Two left. You got that crit. Two left. Hit lead. I'm just going to stay in and heal. Oh, damn. I thought we cleared this up. No. Yeah. Get on left. God, he's so cool. This is stupid cuz he'll just hit me once. Should I just hit him? What do you think? Probably best to heal, right? Yeah, but he might. He's going to just knock me down to there. That's true. We might run out of full restor. Don't even say that. They have 800 left. Oh, he spelled good. He [ __ ] up. He [ __ ] up. There we go. [Music] Terobos is [ __ ] Take him in. Okay. Okay. I would hate to have a hitmon Lee is like a Pokemon that it's ugly. Your your [ __ ] sister asks you to babysit. Oh [ __ ] And she's like, \"Can you watch my Hmon?\" It's like And it goes up like this creature. No. It wants to always wants to go up into your arms. They're like, \"Get the [ __ ] away from me. You're a weird creepy little thing.\" Stands in my doorway looking at me. Just constantly",
            "start": 6259.44
        },
        {
            "text": "creature. No. It wants to always wants to go up into your arms. They're like, \"Get the [ __ ] away from me. You're a weird creepy little thing.\" Stands in my doorway looking at me. Just constantly kicking kicking the air around there. Just kicking the air out there. All right, fight number four. Karen. Oh no. The ultimate [Music] battle. Kicks the [Music] sink. What the hell did I just use there too? Use a lot of uh arrow blasts. We can all agree when this journey is over. Use Lugia for all that stuff. I think I did it right. Yeah, tell us. This journey is over. We can all agree that nobody in the history of gaming should ever want to nuzlock gold and silver. 100%. It's bad for pacing. really bad for [ __ ] it's either the most it's the biggest nightmare in moments and then followed by just non-stop grinding where you're not going to be able to face trainers to to actually level up. It's a bad time. Yeah, you would hit a weird roadblock because like the highest level you'll fight in",
            "start": 6323.52
        },
        {
            "text": "non-stop grinding where you're not going to be able to face trainers to to actually level up. It's a bad time. Yeah, you would hit a weird roadblock because like the highest level you'll fight in the first half is 50, right? And like we got stuck at like fighting level 28s and 32 and we had no tra trainers to fight and so yeah, that's just a a nightmare on that one. All right. Who am I putting up first? Uh, you'd like to know more about Karen. Karen is a dark type Pokemon user. Attack her. Attack her weakness with psychic fighting and ice type moves. Like it's bug, right? Oh, psychic fighting ice. Yes. I mean, uh, basically use Lugia, I guess. Yeah. And any dark ones will be weak to Yeah, pretty much. You want to use Lugia have ice? No. Yeah, we want to use So, psychic. So, we want to put Kito up front. We want psychic bug, fighting, water, ice, electric, depending. I'm telling you kind of the smattering of her my weaknesses here, people. [Music] I mean, I would put up your bug type",
            "start": 6389.28
        },
        {
            "text": "Kito up front. We want psychic bug, fighting, water, ice, electric, depending. I'm telling you kind of the smattering of her my weaknesses here, people. [Music] I mean, I would put up your bug type first because you're going to fight Umbreon and then you're going to have to kind of move around with it from there cuz there's a Gengar that needs a dark against him or psychic. Uh, chat's saying uh maybe not psychic. Are you sure that doesn't say fairy? No, Gengar is weak against psychic. All right. Uh he's he's weak against psychic ghost and dark moves. Hound doom is weak against water fighting ground and rock. Merro electric ice rockgar is ghost and poison chat. I'm looking at a book. Okay, this book has everything inside. [Music] Vic Rattler says use vibe type poison. Okay, so we're looking at All right, so ain't nobody dying here. Bug first up, right? Uh yeah, bug against the Umbreon cuz you don't have fighting. Do I need a rare candy? Should I crack a rare candy off? He's only 42.",
            "start": 6438.0
        },
        {
            "text": "at All right, so ain't nobody dying here. Bug first up, right? Uh yeah, bug against the Umbreon cuz you don't have fighting. Do I need a rare candy? Should I crack a rare candy off? He's only 42. [ __ ] it. He's weak. Fine. Oh, it's pretty. Yeah, look at this. Should we go? Hey, when we're done, can I come back? Yeah. Can I come back for a drink? That's really nice. Karen, this is a nice spot. This is where we show up right [Music] now. I didn't say dark. I never said Gengar was dark. She's a dark type Pokemon trainer, chat. That's what the book says. Umbreon is so cool. All right. This thing's psychic, right? Or dark. It's dark, right? Umbreon is dark. We against bug. I put the wrong person out. It's all right. Oh, and psychic. You can use psychic. Oh, no. It was fighting in bug. Yep. But that's all right. Okay. Who's got my bug move? I think it's called Duda. I thought Dudacov has the bug move. All right. [Music] Freaked her mind. Freaked that [ __ ] dude. Freaked. [Music] Whoa.",
            "start": 6516.36
        },
        {
            "text": "But that's all right. Okay. Who's got my bug move? I think it's called Duda. I thought Dudacov has the bug move. All right. [Music] Freaked her mind. Freaked that [ __ ] dude. Freaked. [Music] Whoa. Didn't know signal beam look like that. Pixels out of her. Blow hole. That was insane. It looked like uh like the Gambit threw a bunch of cards up. Yeah. Whoa. It's trippy. [Music] Oh [ __ ] This is not going to be good. That's rough. I want to get a hold of it. You'll be fine. Shake that off. In fact, we're shaking. She's paralyzed. Payback is bad. Am I also paralyzed? Oh yeah. Synchronized. Paralyzed. Wait, what? Oh [ __ ] Double paralyzed. I'm just going to try. Roll the dice with another signal beam. I love it. Wow, that [ __ ] up. Slapped us right in the face. That [Music] sucks. You're already confused and paralyzed. How much more can happen to you? It's crazy to think. How many status effect moves do you think you can put on a Pokemon? And it's I think it's just one, right? Yeah,",
            "start": 6576.56
        },
        {
            "text": "already confused and paralyzed. How much more can happen to you? It's crazy to think. How many status effect moves do you think you can put on a Pokemon? And it's I think it's just one, right? Yeah, cuz I tried to do I tried to do a burn and a paralyze at the same time and it said it's already paralyzing me. Okay, it takes one off. And it's Oh, he's fast. Blast just blasting. Andy, will you please guide him for a second? You have to go to Kiki. Yep. That's the page. Andy's in charge. He's got it. I don't know what I'm doing. Just tell me what kind of Pokemon. It's really not that hard. Just go a vibe. We're going for vibes. It's just a vibe, man. I think it's like some sort of thing. It was like surgically altered. It look like Ethan Hunt from a grew up in a lab. He's sending out a Gengar ghost. That's ghost. Poison. So, and who I have that has bite? I want to say I have Kito has bite. You could uh also psychic um I believe is something that No, it's only weak to ghost and bite and",
            "start": 6660.44
        },
        {
            "text": "ghost. That's ghost. Poison. So, and who I have that has bite? I want to say I have Kito has bite. You could uh also psychic um I believe is something that No, it's only weak to ghost and bite and dark. It's weak to Yeah, it's weak to psychic, ghost, and dark. It is weak to psychic. Yes. Are we sure about those? Yeah, it says effective move types. People are also saying cool to I like you Sheriff. Look at this big hunker. Bless you. Oh my god. Good time. Well, this was the right hole. God lick. Don't use [ __ ] lick on me, dude. Lick. I used the full restore. Well, you're about to get [ __ ] damn. Did the last one crit? Oh [ __ ] Psychic speaks to ghost. But he's not psychic. He has a psychic move, right? Correct. He's ghost poison. No, but what's Lugia? Lugia's flying psychic, right? Yeah. I don't know. I don't know. [Music] All right. He's bringing out a Merro. What is that? Uh, Merro is dark flying. Dark flying. Weak to electric ice rocket. Dude, feel like I can wrap myself up in",
            "start": 6718.16
        },
        {
            "text": "I don't know. I don't know. [Music] All right. He's bringing out a Merro. What is that? Uh, Merro is dark flying. Dark flying. Weak to electric ice rocket. Dude, feel like I can wrap myself up in this. Uh, you definitely can. All this headphone cords. You probably get you could probably still trip Kevin up with that even though he's home. [Music] So cool, too. He's got a little hat, dick. I love it. [Music] My god. I'm like, what's with these guys? What? Getting taken out by to like one hit point. It's freaking me, Deacon. Freaking my Roger Deacons. What the hell's Hondoom? Hound. Hound doom. I got you. You got it. Must be mobile. Uh, hound doom is dark and fire. Dark and fire. Okay. What is dark weak to? Well, dark is weak to bug. And that's okay. I can put Ko in cuz he's got bug hands. No. Who's got my bug [ __ ] move? Uh, weak against water, fighting ground and [Music] rock. Yeah, there you [Music] go. That thing's ugly. That's [ __ ] crazy looking. Come on, waterfall. Oh, use",
            "start": 6802.28
        },
        {
            "text": "No. Who's got my bug [ __ ] move? Uh, weak against water, fighting ground and [Music] rock. Yeah, there you [Music] go. That thing's ugly. That's [ __ ] crazy looking. Come on, waterfall. Oh, use something called a nasty plot. E, I don't like that. Everyone put up in stinky DDS. Do a cross one with a buck move. God, are those it bones on the outside? Really gross. I'd like to think it is. And it's really hard for him to flex his feet because there's bones wrapped around it. So, we can't really like get Yeah, you can't get good stretchies. Can't get the good stretchies. File Bloom. Grass poison. It's grass. You can fire, ice, flying, psychic. [Music] Last one, Mike. One's for you. Boflume. Another pretty cool Pokemon here. Ugly. You don't like its big hat? I hate it. This one comes from Gloom. Of course, Gloom kind of takes the drool off its face and becomes something of it goes to Gloom to Gloom. Whatever. Look at this. It ends happy, you know. Yeah. The hell's the sun's for? Oh,",
            "start": 6886.36
        },
        {
            "text": "Gloom. Of course, Gloom kind of takes the drool off its face and becomes something of it goes to Gloom to Gloom. Whatever. Look at this. It ends happy, you know. Yeah. The hell's the sun's for? Oh, paralyze me. Oh [ __ ] I like how she just came with her cool lots. [Music] Yeah, that's correct. Silent angle for story, dude. Who would have thought Chris Senka's [ __ ] notebook saved the day? Thanks, Chris, for your your special edition collector's guide. Well, he needs it back, so don't lose it or draw. Don't [ __ ] lose it. He's paralyzing [Music] me. Try to hit it again. Just Just go for it. Just send it. Beautiful. The gamash. Oh. Oh, yeah. The gage. Platinum it uh this morning, Andy. Yeah. Had to do another full playthrough. Got got through it though in like 18 hours. Very easy when you're damn full level 99 entire party. Okay, Karen gone. That was Karen number four of five. Bye Karen. Here it is. The finale. If there was going to be an actual fight, this is going to be a fight.",
            "start": 6983.12
        },
        {
            "text": "you're damn full level 99 entire party. Okay, Karen gone. That was Karen number four of five. Bye Karen. Here it is. The finale. If there was going to be an actual fight, this is going to be a fight. This one you're going to have to be good about this one, Nick. This is it. Welcome to the champion battle. Lance, a dragon type Pokemon user. God, Lance is so cool. If all else fails, pummel him hard with ice type moves. That's what it says. All right, I'll put my ice out front. Um, electric first. Electric first. Electric first. Electric. Electric actually has a pretty good chance about of half of these Pokemon. Then after that, we're going to need uh ice for the other half. Who's got my ice move? Uh, Kito. Does Kalito need a little something something in between games? How how high is Kito? 45 is not great. Don't Don't go like that, you know. Should we run another ad and juice up? We might want to run another ad. It's just out of curiosity. Just No. Listen to Chris. No, listen to Chris.",
            "start": 7060.0
        },
        {
            "text": "45 is not great. Don't Don't go like that, you know. Should we run another ad and juice up? We might want to run another ad. It's just out of curiosity. Just No. Listen to Chris. No, listen to Chris. Listen to Chris. I don't listen to Chris. Obviously, if I live my life, if I live my life after Chris told me, I'd be so much happier. Victor and Ignasio, you haven't been here for the past 48 hours. We've already spoiled all of this game. You you've lost it team. You you boys are real late to the party. I apologize to that one. Yeah, you haven't been here. So yeah, welcome to what's going to happen here. [Music] We've been doing that since Jim Ford. What's that? Spoiling [ __ ] for me. Yeah, when I know what's going on. Crazy for the milk tank. So don't worry about it. All right, let's [ __ ] get after this guy. I mean, here's the catch, Nick. 494950 is what Koulito has to conquer. That's going to be tough. But if he does, it's going to be a beautiful He's not He can't do 494950. I don't",
            "start": 7119.84
        },
        {
            "text": "get after this guy. I mean, here's the catch, Nick. 494950 is what Koulito has to conquer. That's going to be tough. But if he does, it's going to be a beautiful He's not He can't do 494950. I don't think he can. I mean, I I Nick, I'm not a Pokemon master. I only know one thing. We have to try. You know what I mean? Let's try it. Now, Dudikov has to conquer a 46, a 48, and a 48. That's easy. Yeah. Dudov's got What about What is got to go up front? Here's Dudikov. Here's the thing. It's like what if what if Oh, Andy, you got your thing got cancelled. Yeah. No premiere tonight. Like just think I could be there. Yeah. Call him up. Eric. Eric had to cancel. Oh, who typed that in? Melissa with the Y. Oh, no. I just knew. [ __ ] Eric. God damn it. No, you could replace Eric, right? guy. Call him up. You should have seen You're up, aren't you? Should have seen him sniping him last night. It's crazy. You say the word, Melissa with a Y. I'll be there for you and I will be like fully locked in",
            "start": 7174.08
        },
        {
            "text": "up. You should have seen You're up, aren't you? Should have seen him sniping him last night. It's crazy. You say the word, Melissa with a Y. I'll be there for you and I will be like fully locked in type [ __ ] All right, here's the deal. Uh, Nick, I mean, I want to send it. So, it's like Dudikov handles business. Yeah, he stands on business. Koulito gives us his best. If he dies, we have five other Pokemon to try to just all out blitz their ass. Okay. 494950 for Koulito. Yeah. No, no, that Yeah. I mean, that's who Koulito was. No way. Kito's taking those guys down. He's got it. He's fine. We'll send it. All right. I mean, save right here so we can run it back if we need to. Wait, we don't do that. We don't do that. Okay. Yeah. Do we need to run an ad and maybe take have K little pep talk? I don't think Get him up to 50 k bend over. G. Put him in the blue tent. You know what I mean? Put him in the blue tent. There's only one way to find out if you're Pokemon master right now. You",
            "start": 7230.24
        },
        {
            "text": "talk? I don't think Get him up to 50 k bend over. G. Put him in the blue tent. You know what I mean? Put him in the blue tent. There's only one way to find out if you're Pokemon master right now. You either beat him or you don't. You fail at the end. What happens? All right. Why not? Let's have a little fun. Let's have some fun. Chris Hen says, \"Don't don't uh don't give him juice. I have to pee again.\" All right. He's got to pee again. Chad's got We're going to do this. Then we're stepping in. He's got to pee again. Stepping in. Call my wife. I love her. Yep. Uh-huh. Do it, Chad. As he walks away, should we juice him? Like, let us know if he needs to be punished. He deserves to be punished. I think he's good. I have confidence in him. He's going to be fine. I'm not trying to juice him. You just asked if you We already juiced all these people to 45. [Music] The only one that gets the juice is the egg in daycare, says Mr. Sean Peach. Yeah, [ __ ] yeah, dude. He gets all the juice when",
            "start": 7284.16
        },
        {
            "text": "just asked if you We already juiced all these people to 45. [Music] The only one that gets the juice is the egg in daycare, says Mr. Sean Peach. Yeah, [ __ ] yeah, dude. He gets all the juice when he comes out. Let's take Let's bring Let's bring out uh Togepi. Have Togepi in this final six. take on this uh Togep could battle with these guys. I think Togepi is technically six levels in the highest level here, which is great. God acceptable juicing daycare. What level is he? 56. Jesus. It's a big moment, y'all. Here it is. Big one. 2025. It started here. It ends here. This is it. One. The finale of the Nick Nuzlocke 2.0 journey starts right now against Lance. The champion battle begins now. Good. Dante the clerk says, \"Is everyone having fun?\" No. This is too stressful. I don't like it. You're gonna be okay. This [ __ ] throne room. Jesus. How does this kid get the money for this? These are kids. No, not kid. You're You're not the only four. I'm a kid. Do you get sponsorships, you",
            "start": 7340.56
        },
        {
            "text": "You're gonna be okay. This [ __ ] throne room. Jesus. How does this kid get the money for this? These are kids. No, not kid. You're You're not the only four. I'm a kid. Do you get sponsorships, you think? Let's [ __ ] dominate this. The dragon master. [ __ ] you, Lance. [ __ ] He's so cool. [ __ ] you, Lance. Oh, he's got six. He puts his Gyarados out for Oh, yeah. He's the champion. All right. So far, not bad. Yeah, you're okay. He cut my He cut my He cut me though. He cut my attack. Still going to be okay. Over your face. Discharge. [ __ ] [Music] Okay, one down. [Music] Easy peasy. Dragonite. What do we want for that, Mike? Well, Dragonites are going to be the three. He's got three of them, Nick. And they're all up to Koulito to try to battle cuz he's got the ice move. So, the positive move would be the switch. If Koulito goes down early though, we're pretty [ __ ] But like, if Koulito comes out here, it's full send. Full send it. [Music] Julito is not an ice type. Just letting you",
            "start": 7436.48
        },
        {
            "text": "move would be the switch. If Koulito goes down early though, we're pretty [ __ ] But like, if Koulito comes out here, it's full send. Full send it. [Music] Julito is not an ice type. Just letting you know has an ice move. He's got a nice move. And unfortunately, this thing is a level 50. You don't have rock or dragon, so we have to go with what we got. Oh, he sent down his highest level Pokemon number two. Yes. Pretty [ __ ] up of him. That's a panic move. Yeah, that's a pretty [ __ ] up one tapped his first Pokemon. Oh, all right. I'd like some apologies all around from the room. Like they just dominated that guy. We'll see. We'll see. You're the one who was like, \"Oh, baby, we need to [ __ ] juice him.\" He's using outrage. I want some [ __ ] apologies. Jesus Christ. Oh [ __ ] Uh-oh. This is not good, man. No. We're in for a fight. We're in for a real fight here. What apologies are you asking for? Yeah. What were you saying, Mike? What were you saying? All right. Well, I know you're",
            "start": 7505.84
        },
        {
            "text": "is not good, man. No. We're in for a fight. We're in for a real fight here. What apologies are you asking for? Yeah. What were you saying, Mike? What were you saying? All right. Well, I know you're smart. Yeah, I probably sheriff. The crit was rough off the Yeah, you probably go with sheriff. The big dog. Yeah, just put the big dog big dog. You let you let the big dog battle. All he needs to do is hit him once with the big body. Yeah, this guy's going to heal and we're going to we're going to have to be [ __ ] beating the [ __ ] out of each other. One one big body on him. You think arrow blast? He's a dragon though type, right? Yeah, he's a dragon type. So like this is my highest. is flying. Um, yeah, there's probably I mean either that or flying. Like if you fly, remember you'll he'll miss that second move on you or that first move. Let's do it. You take to the skies on his ass. Boom. He's confused. [ __ ] idiot. He's fatigued [Music] out. [ __ ] You're good. He's He might hurt",
            "start": 7560.88
        },
        {
            "text": "miss that second move on you or that first move. Let's do it. You take to the skies on his ass. Boom. He's confused. [ __ ] idiot. He's fatigued [Music] out. [ __ ] You're good. He's He might hurt himself right now. Yeah, you need a safeguard. What do you think? I mean, I just fly again. Yeah, let's get out. Get up and get out. This is going to be tough. Oh, wow. Full restore is crazy, man. That's rough. You can't be doing that as level 50. Like, got to be alive there. All right. We in it. We in it now. [Music] Okay. Okay. Okay. We're still in it. Not bad. Yeah, we're still in this, man. He pulled off that crit. Move one. Really? [ __ ] RIP. All right. What do we think? Just keep flying on him. Uh, Jeroblast. All right. And remember, he's only going to He only has so many 400 stores, you know. We have 800. Is that 800? [ __ ] Damn. Oh, that's crazy. That's crazy behavior. Don't die. Don't die. Don't die. Don't die. Don't die. Yes. Do I knock him out or do I restore? Yeah. Body him.",
            "start": 7610.56
        },
        {
            "text": "know. We have 800. Is that 800? [ __ ] Damn. Oh, that's crazy. That's crazy behavior. Don't die. Don't die. Don't die. Don't die. Don't die. Yes. Do I knock him out or do I restore? Yeah. Body him. Just body him. Oh, you have to think about like his next move after this Pokemon. Like where is he going to know? Hold on. Hold on. My god. I think so. Like, let's talk this through really quick. I think you body him and finish him, you can restore on the next one. If you leave yourself open to this, we're just in the cycle again. He's not going to get a crit on me. The crit's not going to kill me. How many time we've been in this cycle before? Yeah, but he he he's not going to restore again. Oh, hey. Okay, I doubt it. Hold on. Hold on. I got to heal. We got to play it safe. There's just no There's no way. Maybe he gets a little goju berry juice, but he might hit me with something. He's confused. He might have hurt himself with the confusion. Yeah, look at that. See you, idiot. Blessed. We",
            "start": 7685.36
        },
        {
            "text": "no way. Maybe he gets a little goju berry juice, but he might hit me with something. He's confused. He might have hurt himself with the confusion. Yeah, look at that. See you, idiot. Blessed. We got blessed. We got blessed there. Good. Did we get blessed? [ __ ] yeah, we got blessed. All right, four more. What's an aerodactyl? It's another dragon. Aerodactyl. We want uh we want Dudikov out. Wait, didn't Dudikov just die? Oh, no. It's Kito. Yeah, Kito died. [ __ ] man. best of us. Shiny Gyarados as well. It's tough. That's a tough one. Someone mentioned earlier that they like that we really moved past his death very quickly. Well, we're still in it. Yeah. Oh [ __ ] I don't like this. All right, we'll get We'll more We'll grieve our dead. [ __ ] flinched. Oh, that's tough. He's not faster than that giant [ __ ] pterodactyl. Not good. Oh. Oh. Oh. We're good. We're good. We're good. Shake it off, big dog. How's he not getting [ __ ] paralyzed either? It happens after. Yeah, but he hits me",
            "start": 7743.08
        },
        {
            "text": "that giant [ __ ] pterodactyl. Not good. Oh. Oh. Oh. We're good. We're good. We're good. Shake it off, big dog. How's he not getting [ __ ] paralyzed either? It happens after. Yeah, but he hits me sometimes and gets paralyzed. I don't know if that's a guarantee though. Every time. Right. All right, we're in this. Now, if we grip on here for a second, we're good. He is rock type and that's really not good against No, he chat's behind. Um, come on, baby. Come on. Chat makes a good point. Uh, what is it? Uh, ranged attacks, Nick. Yeah, they don't get paralyzed because their body got Yeah, that's right. They go body to body. All right. Well, we have to protect Dudikov no matter what for the next fight depending on who gets pulled out. So, be prepared. Sheriff wants to learn punishment. The [ __ ] is punishment? They'll learn about it. Let's learn about it. Let's learn about it. It's a dark dark move. Do we want this chat? Click on it. Get the info. No power. No power. Power increases the",
            "start": 7800.24
        },
        {
            "text": "is punishment? They'll learn about it. Let's learn about it. Let's learn about it. It's a dark dark move. Do we want this chat? Click on it. Get the info. No power. No power. Power increases the more the foe is powered up. That's not us. Not Not for this type of game. We're in the final fight. We don't need to show right now. Dragonite. Like I said, we have to protect Dudikov for the actual reason why he's here. So, you got to bring out somebody else. Just put Lugia back in. Yeah. Anyone that Anyone else? Who did we Who did we just beat him with? The sheriff. Yeah, with the shoe right got to be skinto skin to transmit the [Music] paralysis. Not bad. He's going to paralyze me though. Oh, and it looks so cute doing it. I'm going to paralyze you. Yeah. What is he doing to paralyze him? Squishing your spine. Yeah. What do you think that is? Just a squeeze. Stop using flying moves against flying. I don't have anything else. What's the tactis? What about hydrop pump against this [ __ ]",
            "start": 7874.16
        },
        {
            "text": "your spine. Yeah. What do you think that is? Just a squeeze. Stop using flying moves against flying. I don't have anything else. What's the tactis? What about hydrop pump against this [ __ ] Well, he's weak to ice ground or ice rock and dragon. We don't have any of that. Aeroblast. The Aeroblast is doing a good Yeah. Don't Don't listen to them. You play your [Music] game. Cracking me. Cracking me. So close. It's so close. He's just going to keep paralyzing me. I don't care. That's fine. Oh, Chris wrote, \"You have rock.\" I do have rock. Oh, yeah. Who's rock? Not Nick. Not Nick Rock. Pseudo. This is why he's been on the team the whole time. We don't use what? This is why Pseudowo's been on the team. He's the Alex Caruso of the team. Hey, see. Oh [ __ ] You guys got to know that. Like I'm okay with not knowing that cuz I've missed the last several streams. You guys got to be better. It's like one of three times I've ever [Music] Yeah, but he's so low and stupid looking. Yeah, it's like",
            "start": 7954.4
        },
        {
            "text": "with not knowing that cuz I've missed the last several streams. You guys got to be better. It's like one of three times I've ever [Music] Yeah, but he's so low and stupid looking. Yeah, it's like you really want that to got be on the front page of the newspaper tomorrow. I mean I He's going to be there either way, you know? He'll be on whether he's putting up points or not. Like he's still getting a championship ring. Yeah. He's going to be like Taskmaster. Yeah. to get killed off. You do get stab I Oh [ __ ] Oh. Oh, that's Oh, y Oh, yeah. That was a big That was a big hit. Put some fear in you. No [ __ ] He hasn't hit you yet. He's just using thunderwave on me, playing with his [ __ ] food. Think about him for a second. Oh, that was tough. Well, yeah. He's Does he have lightning moves? Why am I using a flying guy? Cuz you chose Well, Lugia was our second highest. That's why. I'm going to try extraordinary. Extra [Music] sentry. Switch to not Nick. All right, we can try. Wait a",
            "start": 8026.4
        },
        {
            "text": "Why am I using a flying guy? Cuz you chose Well, Lugia was our second highest. That's why. I'm going to try extraordinary. Extra [Music] sentry. Switch to not Nick. All right, we can try. Wait a minute. Why not run them up? [ __ ] it. Yeah, [ __ ] run them up. [ __ ] it. Get in there. Yeah, get the people. Get a three-pointer. People are going to [ __ ] talk. He's about to get tapped at least once. He's going to get tapped. Pseudo was Yeah. Okay. He's paralyzed now. Great. Isn't that wonderful? It's fine. It's going to be okay. Yeah, it'll be fine. Shake it off. Pudow. The goat is here. I found the GM. I'm like, we're like, this guy's not going to ever get put on the Wedies box. We need So, I need to use rock. Rock move. Rock slide. Yeah. Or rock smash. Well, that's fight. We want rock slide. Oh, no. Okay. Go to a tree. Strikes it. Good. We're good. Damn, it paralyzed the [ __ ] [ __ ] Nice. It still went off though. See you. Oh, [ __ ] me. I thought that was it. I caught my shot.",
            "start": 8085.6
        },
        {
            "text": "slide. Oh, no. Okay. Go to a tree. Strikes it. Good. We're good. Damn, it paralyzed the [ __ ] [ __ ] Nice. It still went off though. See you. Oh, [ __ ] me. I thought that was it. I caught my shot. That's Tyresese Hallebertton. [ __ ] thunder again. [ __ ] I just need to hit him just once. Oh, [Music] good thing we got full restores. We're set. Yeah, he just needs to miss a move. I need him to miss one move or and not get a crit. Oh, that's true. Ramir's our jam. He should be running out of thunders. That's pretty true. His PP will Oh, dragon rush. I got to hit him. Yeah, you got to do it right now. You got to do it. [ __ ] Oh my miss. It missed. Wow, dude. Wow. That was crazy. Wow. Holy [ __ ] Everybody gets one. Wild. Everybody gets one. Let's go. Holy [ __ ] No, I'm not faster. He just missed that move. He's going to bring out another another [ __ ] Dragonite, dude. I mean, this is your best Pokemon against the Dragonite. That's Wow, man. Widow gets battling. She's a goat. Another",
            "start": 8150.08
        },
        {
            "text": "missed that move. He's going to bring out another another [ __ ] Dragonite, dude. I mean, this is your best Pokemon against the Dragonite. That's Wow, man. Widow gets battling. She's a goat. Another 49 Dragonite. [ __ ] Christ. We never wanted him on the team. We never asked for him. He's here. The superstar we never wanted. Okay. Oh, he uses Blizzard. What the [ __ ] What? I need to take him down a couple. I don't think this guy's I don't think he's making it out. I don't know if the tree's making it out of this one. Nope. The Dragonite has a deep bag. That's a deep bag. Why don't we have a Dragonite? We would do an ice move. Why don't we have a Dragonite? I don't think we've seen one in this playthrough yet. What do we What do we What do we got to put in? What do we do here? I mean, now I mean I would assume we go back to Sheriff and we just keep trying to body him like we were doing, but the chat will yell about that. But like, you know who else is here? No. Bomb meas purpose",
            "start": 8243.6
        },
        {
            "text": "now I mean I would assume we go back to Sheriff and we just keep trying to body him like we were doing, but the chat will yell about that. But like, you know who else is here? No. Bomb meas purpose digit. The problem is this. I need to I need to be smart about who I'm switching now cuz I'm just I'm going to take a hit every time I switch. Well, like here's the positive. The milk mom is dying. If I put anyone in, they're dead. I got to put in someone bigger than This is the final Dragonite. I think it's a milk mommy situation. Milk mommy situation. It could be. Milk mommy doesn't have anything. It's going to get one tapped. What? Milk mommy is one that you know what? What's the problem? It's a waste of a move. I don't want to [ __ ] be here all night. It's not weak to anybody, you know? It's normal. Weak to fighting. Need you guys to tell you, chat. Look what I put in. I have discharge and I have Let's see. Man, you cannot be busting out ice moves after a bunch of like insane. It's",
            "start": 8296.88
        },
        {
            "text": "It's normal. Weak to fighting. Need you guys to tell you, chat. Look what I put in. I have discharge and I have Let's see. Man, you cannot be busting out ice moves after a bunch of like insane. It's [ __ ] up. Uh, I got to put in the dude. Who's the Who are we keeping the dude for? The dude is for Charizard. Yeah, you need There's a Charizard that's next and that's where the dude will thrive. Everybody else is for Dragonite. We've talked about this. These three are for Dragonite and to hopefully get you through if there's a really a big issue. But like these three are here for Dragonite. Someone said pull and full revive Ko. I can't revive revive Kito. Such as the state of our No reviving. No. Here's the thing. Here's the thing. Okay, this is not trolling. Yeah, milk mommy. Yeah. Could be used as something to just absorb PP moves to get them to waste moves. He's got 14 of them though of thunder. Yeah. If he's anything like Duda, he's got at least minimum 14 of thunder wave or a",
            "start": 8344.4
        },
        {
            "text": "be used as something to just absorb PP moves to get them to waste moves. He's got 14 of them though of thunder. Yeah. If he's anything like Duda, he's got at least minimum 14 of thunder wave or a minimum of thunder. Yeah. All right. Cuz like it like you're never going to use milk mommy later on. That's true. Look at this beautiful milk mommy. Here we go. What do I use here? Um headbutt the milk. No, I don't even know what milk mommy has. I've never used milk mommy once. Well, it's wing against rock. Roll out is a rock move. Yeah, but roll out. Okay. That was terrible. But it's going to keep going. Yeah, it gets remember it builds. That's fair. Got to let the beep build. [Music] Oh, okay. See, look. She's dead. She's a tank. She's strong. See, look. And this move keeps on going. It gets stronger. It's going to build. It'll build. It'll build. No. Look at avoided. She's the goat. Oh, can't move. [ __ ] She's fine. She's fine. She's fine. It's insane. She's just matrix dodging all these",
            "start": 8401.52
        },
        {
            "text": "It's going to build. It'll build. It'll build. No. Look at avoided. She's the goat. Oh, can't move. [ __ ] She's fine. She's fine. She's fine. It's insane. She's just matrix dodging all these blue. What do I use roll out again? Yeah. Yeah. Hell yeah. Keep rolling. Rolling. Rolling. Rolling. [Music] Oh, so it's only good that one. Yeah, it'll damage resets if you miss, by the way. Okay, it has to build back up. Like if she stops her moves, it's dead. She's dead now. She got the other one. She's going to be fine. Okay, got it. No, if this doesn't allow her to move. Yeah, that sucks. Yeah, that's might have to body slam. Body slam might be good. Yeah, we might have to switch up the move. She's a tank. She can handle some hits. Going to handle a little push. Here we go. [Music] Oh. Oh [ __ ] I got to take it down. Sometimes you just forget. It's got this blizzard little rock. Oh. Oh [ __ ] She's frozen. She got frosted by [ __ ] dude. I've never Okay, but here's the thing. Nope. Mommy",
            "start": 8468.0
        },
        {
            "text": "I got to take it down. Sometimes you just forget. It's got this blizzard little rock. Oh. Oh [ __ ] She's frozen. She got frosted by [ __ ] dude. I've never Okay, but here's the thing. Nope. Mommy doesn't care. Blizzard seems like one of those where you only got five, I think. So, and he's done it [ __ ] three times or four times. And guess what? We're We're only protecting Lugia at this point. That's our goal. Golden goose and well due to we just need to get Dragonite down to the point where they can't score. I mean we wait until we pull out the coups. We haven't even get the coups yet. [Music] We're in a cycle on this one right now. That's okay. I mean honestly that's okay because he'll run out of move. He's going to run out of move. If he if he keeps just having me for 10 for half, I'm totally fine with that. This is just a stall and he might miss one. Yeah, we [Music] could. I want him to run out of the blizzard move and the [ __ ] that other stupid move and then I can put Judicop",
            "start": 8542.8
        },
        {
            "text": "totally fine with that. This is just a stall and he might miss one. Yeah, we [Music] could. I want him to run out of the blizzard move and the [ __ ] that other stupid move and then I can put Judicop in to finish him out. [Music] Every time it hits me, I my heart skips a [ __ ] because I think it's gonna get a crit. There cannot be that many freaking games. Dragon rushes. How many? Blizzard. What? Blizzard. Dragon rushes. How many? Dragon rush is 10. I mean, you got to you got to respect that Milk Mommy can just sit here and just take this. Milk mommy is just it's that [Music] I mean, I feel like the dragon rush can't get more than that. You know what I mean? Well, the dragon rush is already at minimum as it happened seven times. We've sat in the pocket long enough. There's no way. Someone said it's not going to run out of dragon rush. That's it has to. It run. You have to run out eventually. [Music] Well, he don't miss. That's fine. Okay, that person was wrong. Okay, never mind.",
            "start": 8586.88
        },
        {
            "text": "said it's not going to run out of dragon rush. That's it has to. It run. You have to run out eventually. [Music] Well, he don't miss. That's fine. Okay, that person was wrong. Okay, never mind. Everyone runs out of moves eventually. Even in the Elite 4, last time I fought, they ran, we did this and they ran out of a move and they were just basically dodging and buffing. Gotcha. Okay. But still a lot of dragon moves. A lot of dragon rushes though. Andy, call your league. This is going to be all night. And you keep getting taken down at 61 also. Yeah, right. He can't do more than whatever that math is right there. 80 something damage. So like we're good. Yeah, but I have to restore cuz another one will definitely Well, yeah, that's the unfortunate part. I would be interested of like There it is. Roll out. Now we're [ __ ] I think we're body slamming. Yeah. [ __ ] yeah. I love that. Wow. A thunder move. I think this motherfucker's got a bad dude. Yeah. It's been using thunder wave the",
            "start": 8653.52
        },
        {
            "text": "it is. Roll out. Now we're [ __ ] I think we're body slamming. Yeah. [ __ ] yeah. I love that. Wow. A thunder move. I think this motherfucker's got a bad dude. Yeah. It's been using thunder wave the whole time. Oh, I've been I've been so caught up on the blizzard poop. I forgot that we went back to thunder, too. [Music] Let's see what he's got. Dragon rush. I missed. Yep, we're back, dude. Getting tired. [Music] Oh, wow. That's crazy disrespectful. Well, you got first move, so you can attack right now. Um, should I try? I mean, I could try. I might be able to knock it, but I might be able to do it with the attack. Sure, why not? Yeah, hit him. Hit him. Hit him. What? Well, he hits you once. It's only 80. You'll just reheal. Yeah. Yeah. Let's try. [ __ ] my [ __ ] This was a mistake. This was a huge mistake. Oh my god. Oh my god. Yeah, but he can't have that many moves left. That's tough. How do you go from one to health? He had one health. Lance is like, \"Look, you've used 70. Let me",
            "start": 8701.44
        },
        {
            "text": "was a huge mistake. Oh my god. Oh my god. Yeah, but he can't have that many moves left. That's tough. How do you go from one to health? He had one health. Lance is like, \"Look, you've used 70. Let me use one. I got to use one. Let me use one.\" I mean, here we are, bro. We're back. We're so in. We're fine. It's an insane battle, by the way. Like, this is one for the ages. This is wild. They think it's all coming back to Pokemon. I'm actually glad we just we we threw that body slam out, though. Taking them down a little bit is nice. Can't have that many [ __ ] thunder waves left. It's only 14 of them. I only have 14. How do you have that many? [Music] Thank god we bought all those uh restores. Yeah. Yeah, we've Oh. Oh, you should have tried to attack that. We uh an uncle left him in our in his will for us. That's true. Shout out. Oh, hyperbeam. Oh no. Oh [ __ ] Not good. Why does he have hyperbeam? Four moves. Yeah, this guy has seven moves. This guy's got a lot of moves, man. Oh,",
            "start": 8774.64
        },
        {
            "text": "in his will for us. That's true. Shout out. Oh, hyperbeam. Oh no. Oh [ __ ] Not good. Why does he have hyperbeam? Four moves. Yeah, this guy has seven moves. This guy's got a lot of moves, man. Oh, that's a How are you busting out Hyperbeam? This is like an Elden Ring fight where the seventh attempt they have like seven new moves you never seen. How many? Someone check hyperbeam. I think it's got four. I think he's got 10 of those, too. We're going to be all [ __ ] We're just going through it right now. I think he's Okay, now we hit him. Now we hit him. Now we hit him with what? Roll out. Uh, no. No. Body slam. Maybe. What about Zen headbutt? Roll out. Well, hold up. Hold up. Rolled out builds. Rolled out builds. But the issue is if you get paralyzed, it stops and it's only minimal damage. I think body slam. It Yeah, I think body slam. You use it though. It missed last time. Didn't work. I like body slam. I like roll. All right. Yeah, do it. All [Music] right. This one. [ __ ] Christ.",
            "start": 8836.0
        },
        {
            "text": "I think body slam. It Yeah, I think body slam. You use it though. It missed last time. Didn't work. I like body slam. I like roll. All right. Yeah, do it. All [Music] right. This one. [ __ ] Christ. I can't. I just got to just play my game here. Yeah. You got to body slam through this. Oh, no. Never mind. Shoot. He's pissing on you. It looks like that's crazy. Oh, I got the roll out. Now, I'm not mad at that. Okay. Well, here's an interesting moment. Oh my Oh, no. Here's an interesting moment. Oh, no. Yes. Who said roll out? Roll out. That's redemption. That's redemption, Andy. That's redemption right there. Oh my god. Crazy. All right, you got one more. That's crazy. Well, before we fight the final Pokemon, it's only right to do our final giveaway, which is the big poster. We have to give away the big poster to one lucky best friend. Of course, throughout this incredible journey, we asked you to give subs, support the stream, support the company, and we of course would have fun",
            "start": 8884.32
        },
        {
            "text": "give away the big poster to one lucky best friend. Of course, throughout this incredible journey, we asked you to give subs, support the stream, support the company, and we of course would have fun giveaways like Andy Cortez oneofone drawings that six best friends won throughout this journey that we'll send out to those. And of course, we've all drawn on it. Chris, Anka drew on it. Carl Jacobs drew. Barrett, Andy, Nick, Roger, myself, Kevin. We've all put special Pokémons on there. There's special nods to our journey as well. You'll see the Suicide Squad. You'll see the one and only Radicates. Oh, I made sure Radicate was on there. And the final six will all be on the poster. So, let's make sure we give away that poster right here. We had 382 entries during this Pokemon journey. Let's pick a winner right now. So, we can send that to you. The winner is going to be Barrett 99. [Music] Oh, uh, Habiscy Bomb Diggity. Habiscy Bomb Diggity. Congratulations, Habisky Bomb Diggity. I will be",
            "start": 8953.92
        },
        {
            "text": "a winner right now. So, we can send that to you. The winner is going to be Barrett 99. [Music] Oh, uh, Habiscy Bomb Diggity. Habiscy Bomb Diggity. Congratulations, Habisky Bomb Diggity. I will be messaging you on Twitch with a whisper for your mailing address. And to all of our winners out there, they probably haven't watched in a month. Uh to all of our winners out there, be checking your mailboxes here soon and checking Twitch whispers for your tracking information. I'll send off. But it's time to send this journey off. Nick, you have one Pokemon in your way and it's a Charizard. I thought there was two left. Uh it's just the Charizard. It's just the Charizard, bro. Bro. Yeah. Yeah. All right. So, I got to switch, right? Yes. Uh yeah, this is where Dudikov comes in. And the C. The dude. We've been saving saving him for this moment. The dude or Lugia Charizard. Okay. The dude. Finish that with milk. Mommy. Dude, people want me. People want me to finish it off with milk. What a call.",
            "start": 9005.04
        },
        {
            "text": "We've been saving saving him for this moment. The dude or Lugia Charizard. Okay. The dude. Finish that with milk. Mommy. Dude, people want me. People want me to finish it off with milk. What a call. Honestly, I think if Charizard didn't hit first, I might keep mommy in the game. I think Dude, look. Yeah. See, the sheriff has hydro pump though. We don't want to use the water move on Charizard. That's fair cuz he's flying in water. Do we not want to use What would you like to know about? Milk mommy was able to tank a [ __ ] blizzard and a and a hyperbeam from a Dragonite. Yeah, Milk Bomb is here for the memes. If you're going for it, Milk Mom's here for the memes. So, who should I put in? Hydropump works. I legitimately think you keep in Milk Mommy and heal through and just Okay. Keep it keep it a milk mommy until she dies. No, the MVP. No, because I I I I don't want to waste the turn. Then I'll have to swap and then I'll get hit. See what I'm saying? Then I'll be playing chest like All",
            "start": 9057.36
        },
        {
            "text": "it a milk mommy until she dies. No, the MVP. No, because I I I I don't want to waste the turn. Then I'll have to swap and then I'll get hit. See what I'm saying? Then I'll be playing chest like All right. So the dude. We're putting in the dude. I'm making the call. I like it. [Music] Jesus Christ, that's intimidating. And you see that across the map, you're like, \"Fuck, man. I should have trained harder.\" So, just I mean, normal discharge. Is that what I'm looking with here, everyone? We just decided electricity. Charizard is weak to electric, water, and rockets. You go popping. Yeah, it was a pop. It was a little pop. Okay. Can you call me [Music] That's real good. That's not [Music] bad. I never give up no matter what. You must be the same. [Music] Fire. Here we go. This might be it. Wow. Play it safe, everyone. Should have kept Should have kept in milk. Wow. Should have kept in. That's a good victory lap for Well, she's at least alive to see it. Yeah, I want her at least alive. All",
            "start": 9112.32
        },
        {
            "text": "Play it safe, everyone. Should have kept Should have kept in milk. Wow. Should have kept in. That's a good victory lap for Well, she's at least alive to see it. Yeah, I want her at least alive. All right, pass through this so we can save on the other side. Wow. Oh, wow. Thank God. You're a champion, Nick. Dude, I'm going to give a shout out. Two runs. Three people in this room. Okay, three people in this room. Not Nick. We're holding it [ __ ] down. We didn't think you talked a lot of [ __ ] about Let's be honest, Slappy. Not Nicknick's not making it to our final season. We're not using Not Nick's final six. Not Nick. And that's person I'd like to thank. Number one. Yeah. Okay. Number two, I'd like to thank Kevin Coella for inspiring us, for challenging us, for always saying telling us to do the other thing that we should be doing and take Milk Mommy out of the squad. Every time he says, \"Don't do that,\" I go, \"I want to do it. I want to keep it. I want to keep it here. And then",
            "start": 9201.68
        },
        {
            "text": "us to do the other thing that we should be doing and take Milk Mommy out of the squad. Every time he says, \"Don't do that,\" I go, \"I want to do it. I want to keep it. I want to keep it here. And then number three, I want to thank Andy Cortez for not being wrong that time. Oh, wow. Cuz you were wrong a couple times before and we lost him, soldier. Can we change it from quick attack Cortez to now roll out Cortez? Roll out coail. You know what I mean? Like, let's set the narrative straight. Andy called right. Andy called game. And we almost didn't even put milk bomb in. And I think I was like, come on. Think about this. It'll take PPS. Oh, Professor Quell's here. Ah, he's it's been a while. He looked more impressive. That was tough. That was a good fight. It was a good fight. It was a surprisingly really good fight. Let's interview the brand new champion. This guy's pissed. Lance getting a bit too noisy. Get the [ __ ] out of here, Lance. This man, come with me. Oh wow. Oh. Oh [ __ ]",
            "start": 9248.0
        },
        {
            "text": "really good fight. Let's interview the brand new champion. This guy's pissed. Lance getting a bit too noisy. Get the [ __ ] out of here, Lance. This man, come with me. Oh wow. Oh. Oh [ __ ] He's going to beat you up. I don't like this. Uh oh. The moment save. Just save it. I don't love this. I'm undercover. This goes all the way. Today we witnessed the new champ of a new was not passion for the trust trainer who succeeds through professors and determination. The new league champion who is all the makings of greatness. Look at that rate tracing. Aceman, allow me to register you and your partner as champions. Get me in there. Have you heard the news? Refill my guy. There's a toga pee at a baby at a babysitting station. This thing is a world ender. It's a level 7,040. I will see you again, father. I'm Hall of Fame. You have to stop this thing. I thought Lance was going to throw you into the [ __ ] I thought he was going to shoot me in the back of the head. I think he's going to throw you",
            "start": 9296.16
        },
        {
            "text": "I'm Hall of Fame. You have to stop this thing. I thought Lance was going to throw you into the [ __ ] I thought he was going to shoot me in the back of the head. I think he's going to throw you into that thing where the Pokemon healer. He's going to toast the thing on you, Sheriff. That was crazy. That was amazing. Rest in peace, Kito. Rest in peace. RIP Kito. The red gyros. But guess what? I got a blue one for you back at home. Yeah. Fair. Got a blue one for you. My boy the cous. I want to go get that. How when do I get the other dog? I don't know. Maybe in the second half of the journey. I don't know. The mommy. Look at her. Our MVP. Mommy helped us. Oh my god. The [ __ ] mommy, dude. Gone but never forgotten. Now Nick [ __ ] loser. Don't call him a fight. He can't [ __ ] moment. squad. Can we get a screenshot? Get a screenshot of this. Everyone, somebody screenshot this and drop in the chat, please. Screenshot that. Nick is like in the way of is getting Mike Wazowski right now. 87",
            "start": 9346.88
        },
        {
            "text": "Can we get a screenshot? Get a screenshot of this. Everyone, somebody screenshot this and drop in the chat, please. Screenshot that. Nick is like in the way of is getting Mike Wazowski right now. 87 hours. I think we let it run a little bit sometimes. So, like, let's not take that number for real. We also fast forward to the computer. Maybe that accounts it. Did we get a screen grab enough? Did anyone get a screen grab? Yeah, we'll get it off. We can always run it back, too. We can run it back. It's on YouTube. We're available. Maybe you don't have the power. All [Music] right. That's great. That's great. That's great. That's great. That's a beautiful run right there. That's supposed to be blessing right there, by the way. That's all good. I don't know why Elm is the spice back there. Of course, congratulations to Nick, the whole team here. Kind of funny. Thank you to Andy for going so hard on all the cool animations and artwork in there. To Barrett running our final stream and Kevin",
            "start": 9400.36
        },
        {
            "text": "course, congratulations to Nick, the whole team here. Kind of funny. Thank you to Andy for going so hard on all the cool animations and artwork in there. To Barrett running our final stream and Kevin getting us through to the very end. And to all of you Pokémon trainers around the globe for having fun with us, smiling, laughing, and enjoying. Uh this has been the Nick Nuzlocke 2.0. We have finished it. We have conquered it. Nick, you're another Pokemon master. And uh I think there's still more journey for you to go, but we'll save that for we'll save that for the latter half of the year, ladies and gentlemen. Thank you guys for all of your support. And thank you guys for hanging in here with me and throughout the week. Yeah. A little longer than we thought it was going to, but uh it was fun. And uh hey, enjoy your Memorial Day weekend. Oh, by the way, if you want one of these bad boys, I think we're going to probably pull them off the site by Friday because we're done with this now.",
            "start": 9453.6
        },
        {
            "text": "fun. And uh hey, enjoy your Memorial Day weekend. Oh, by the way, if you want one of these bad boys, I think we're going to probably pull them off the site by Friday because we're done with this now. So, and make sure if you guys want an anorag blue, uh grab it by the end of by grab it by Friday night. I think we're gonna probably end this by like five o'clock Friday. See you guys then. Love you. Goodbye for Pokemon trainers. We'll see you on our next adventure.",
            "start": 9496.56
        }
    ]
}