{
    "id": 14047,
    "video_id": "LEnUK0LHzFU",
    "show_name": "Gamescast",
    "hosts": [
        "Andy Cortez",
        "Barrett Courtney",
        "Kat Bailey",
        "Michael Higham"
    ],
    "title": "Clair Obscur: Expedition 33 Spoilercast - Kinda Funny Gamescast",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page - https://store.steampowered.com/app/1377700/Empyreal/ \nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nThis episode is sponsored by BetterHelp — go to http://betterhelp.com/kindafunny to get 10% off your first month.\n\nWe’re here to talk about video game news!\n\n00:00:00 - Start\n00:06:20 - Housekeeping\n00:12:46 - CLAIR OBSCUR SPOILERCAST\n00:13:10 - The End - what did you choose?\n00:42:46 - Superchats!\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1746648242,
    "duration": 4623,
    "transcript_chunks": [
        {
            "text": "[Music] Tomorrow comes everybody. Welcome to the kind of funny games cast for Wednesday, May 7th, 2025. I am one of your hosts, Barrett Courtourtney. And here joined with me, we've got the Hispanic heartthrob, Texas Street Latino Heat, clicking heads and ripping them to shreds. the globe. Trotting, headshotting, rooting, tooting, three-point shooting nitro rifle from twitch.tv/ Andycortez. We can use this whenever they pick up just something in the world. I love that. This will be useful. And next up, we have industry legend, industry icon, Axe of the Blood God's very own Cat Bailey. And God. Oh, I did it. I said it wrong. Hello. I'm God. On God. And lastly, we have the boy who has won the award three times running of best person to close out bars with. It is the one, the only Michael Haim. Good stuff. That's not a good That's not a good uh How's everybody doing today? My brother Joshua. I'm doing great. I'm doing great. I'm replaying it right now. We're playing this little old little",
            "start": 1.36
        },
        {
            "text": "Good stuff. That's not a good That's not a good uh How's everybody doing today? My brother Joshua. I'm doing great. I'm doing great. I'm replaying it right now. We're playing this little old little video game. You're freshened up. I got that. Uh I was just telling the the squad right here that I beat sprung last night for the first time because I didn't get to do it uh my first playthrough cuz I was like, \"All right, I'm getting kind of close to the edge. I got to beat the video game, right?\" Uh beat him last night. Got that the pictos called Cheater, which lets you go two times in a row and whoever you put it on also gives you 1,200 health. And you know, as if Lun could not be killed with a nuclear bomb before, she is a worldender now. Like she is straight up like Dr. Manhattan. Just like nobody has anything on me. I don't feel like I'm a part of this human race, you know? I am so much more powerful than everybody. Cat, how you been? The last time I think we saw you was for the",
            "start": 67.6
        },
        {
            "text": "like nobody has anything on me. I don't feel like I'm a part of this human race, you know? I am so much more powerful than everybody. Cat, how you been? The last time I think we saw you was for the Switch to like fullon direct. Wow. It feels like a lifetime ago. I know. Did Did you Were you able to secure a Switch 2 pre-order? No. Oh, not yet. Okay. All right. I think I need to go to GameStop and actually try and get one cuz they might have supplies hiding, but I've got I'm going to get one. It's going to happen. I believe in you. Yeah. Michael, how you been? It's been a minute, bro. I'm so cooked. Yo, um, April was a was a wild month for me. I uh I did a lot of work. Uh, if y'all peep the IGN first for The Outer Worlds 2, I headed that up all month. Uh, in addition to reviewing South of Midnight and Clare Obscure Expedition 33 on top of all my other duties and some other stuff, April this month, I'm I'm going to try to chill. Yeah, but be a sleepy boy. Lean into it. I'm I'm I'm be E",
            "start": 113.6
        },
        {
            "text": "Midnight and Clare Obscure Expedition 33 on top of all my other duties and some other stuff, April this month, I'm I'm going to try to chill. Yeah, but be a sleepy boy. Lean into it. I'm I'm I'm be E boy for a couple weeks and then SGF's going to hit and we going to turn up. Hell yeah. Well, everybody remember this is the Kind of Funny Games cast. Each and every weekday we get together to talk about the biggest previews, reviews, and spoilercasts uh in video games live on YouTube, Twitch, and podcast services around the globe. If you love what we do, support us with the kind of funny membership on Patreon, YouTube, Spotify, or Apple Podcast to get all of our shows ad free. Watch us record them live and get a daily exclusive show. For a chance to be part of the show, submit your thoughts and opinions as YouTube super chats as we go. Send in your biggest Clare Obscure Expedition 33 questions for us to answer on the show today because yes, this is the Games Cast spoiling full spoilers on",
            "start": 160.96
        },
        {
            "text": "opinions as YouTube super chats as we go. Send in your biggest Clare Obscure Expedition 33 questions for us to answer on the show today because yes, this is the Games Cast spoiling full spoilers on Clare Obscure Expedition 33. All of us are very passionate to talk about it, excited to talk about it. Andy Cortez is on a second playthrough of a turnbased RPG, which hell has frozen over. I feel like that's insane to me. It's I mean, dude, if anything, you know, the game is so popular, right? The game word of mouth has gotten to people that would have never tried this game and I am so pumped up about it because now I'm like dude now from here on out developers are taking notice and being like what if we made turn-based games good you know like we can do that too we can also do that this is not the panel to make a [ __ ] we can also put parries in our games I'm so excited that yeah I'm so interested to talk to you because this There are so many people who don't normally play this type of",
            "start": 204.72
        },
        {
            "text": "the panel to make a [ __ ] we can also put parries in our games I'm so excited that yeah I'm so interested to talk to you because this There are so many people who don't normally play this type of game who are really into it. So, I just want to pick your brain and be like, what is this making you feel? Is it the action aspects that are really grabbing you? The story? Oh, yeah. Well, so narratively, right off the rip, this game just kind of grabs you in that first sort of section, right, when we see the the first gamage happen. And immediately I was like, I haven't felt this way about a narrative in a in a long time. And when I think of how I played a decent amount of uh freaking Metaphor refantio and that's usually way more than I would put into a turn-based game that is not Pokemon. And the reason I didn't stick around with Metaphor was legitimately because I was like damn I don't this is going to be a 70 hour 50 hour quest. I don't have time like that right now for this title.",
            "start": 253.68
        },
        {
            "text": "And the reason I didn't stick around with Metaphor was legitimately because I was like damn I don't this is going to be a 70 hour 50 hour quest. I don't have time like that right now for this title. Right. Um, and but you know, even though I'm not generally a turn-based person, I still enjoyed it a lot, right? Like I I always talk I talk more I talk more [ __ ] about turn-based games that I really, you know, it's just playing into it. But, uh, for definitely it is the action, it's the visuals, it's the characters, it's the parries that reward you. If you choose to dodge, it's easier, but the parry is a much higher risk reward. And then once you start kind of, you know, equipping all the different pictos and luminas and now I'm getting health back for everything, it just feels so rewarding. Everything feels substantial. That and it being 30 hours, I think, is another plus for you. Thousand% thousand%. Me, too. Honestly, though, it does feel great when you pull off a a proper counter or",
            "start": 303.8
        },
        {
            "text": "Everything feels substantial. That and it being 30 hours, I think, is another plus for you. Thousand% thousand%. Me, too. Honestly, though, it does feel great when you pull off a a proper counter or when you have like 10 different attacks coming at you and you manage to parry every single one of them and get the counter attack off. Crazy. Hugely great feels. Yeah, I we're we're vibrating in our seats ready to talk about this game. But before we do that, let me get to some housekeeping. Remember, Greg is rocking PAX East Thursday. That is tomorrow, and you need to be a part of it at 11:00 a.m. Eastern, 8 a.m. Pacific. Greg's the keynote speaker, kicking off PAX East, and we'll be doing a Fireside Chat with Final Fantasy and Expedition 33 very own Ben Star. That's crazy. Good for PAX East getting Ben Star. Greg is there, too, I guess. at 200 pm Eastern, 11:00 a.m. Pacific. Greg's also hosting the Mafia, the Old Country panel with the devs. If you're in Boston, you need to be there, but",
            "start": 347.84
        },
        {
            "text": "Ben Star. Greg is there, too, I guess. at 200 pm Eastern, 11:00 a.m. Pacific. Greg's also hosting the Mafia, the Old Country panel with the devs. If you're in Boston, you need to be there, but if you aren't, both will be streamed to our Twitch channel. So, yes, tomorrow at 8:00 a.m. uh Pacific, we'll be streaming exclusively on our Twitch the uh keynote. And then uh we'll be back at 10 a.m. on both Twitch and YouTube for Games Daily. And then at 11, we'll be off of YouTube streaming the Mafia panel uh exclusively on Twitch. And then at 12, uh, we'll be back on, uh, Twitch and YouTube for a Games cast, uh, which I think we can confirm Blessing talked about on Games Daily, his, uh, uh, whole week of playing Death Stranding, too. So, definitely tune in for that. It's going to be a busy day tomorrow. Also, you are about to witness history. Snow Bike Mike, the most athletic man in his own mind, is embarking on his most daring quest yet, going step forep with Sam Porter Bridges in a literal",
            "start": 393.44
        },
        {
            "text": "Also, you are about to witness history. Snow Bike Mike, the most athletic man in his own mind, is embarking on his most daring quest yet, going step forep with Sam Porter Bridges in a literal marathon stream on a treadmill. Come join Roger and Mike this Friday as they attempt to do a full playthrough of Death Stranding 1 through the weekend, but they can only do it with your support. Will Mike and Roger break this treadmill and have to drive to Andy's home at 1:00 a.m. tomorrow borrow his. As someone who, you know, it's also his home, I would prefer that not to happen. Either way, find out Friday on twitch.tv. TV/kindfunny games. Uh, remember we're an 11 person business all about live talk shows today. Today you already got Games Daily about what what did y'all talk about today, Andy? I ran that show and I'm I'm blanking. Let's see. Uh, new PlayStation LFG Studios. Uh, a frog type game. The Xbox handheld. Xbox handheld. Yeah. Frog type games. Frog type games. Uh, this is the Games",
            "start": 439.84
        },
        {
            "text": "I ran that show and I'm I'm blanking. Let's see. Uh, new PlayStation LFG Studios. Uh, a frog type game. The Xbox handheld. Xbox handheld. Yeah. Frog type games. Frog type games. Uh, this is the Games Cast and after it uh is the Pokemon Nick 2.0 0 finale where Nick Scarpino will battle the Elite 4 and finally finish Pokemon Heart Gold/soul nudge nudge wink wink. We have like two more three more streams maybe. You don't think he can do the Elite 4 all today? I don't know, bro. You're a doubter. I think he does it for Mike's birthday. I think he truly locks in. I hope so. Yeah, Mike deserves this. He really does. Uh if you're a kind of funny member, today's Gregway is a Mike takeover. Uh, thank you to our Patreon producers Carl Jacobs, Omega Buster, and Delaney Twining. Today we're brought to you by Imperial, Orafaf Frames, and Better Help, but we'll tell you about that later. Before we get to topic of the show, uh, this is going to be the Clare Obscure Expedition 33. Uh, spoiler cast,",
            "start": 481.76
        },
        {
            "text": "to you by Imperial, Orafaf Frames, and Better Help, but we'll tell you about that later. Before we get to topic of the show, uh, this is going to be the Clare Obscure Expedition 33. Uh, spoiler cast, spoiler gloves will be coming off. Uh, but just as a quick reminder, uh, Andy and I were on the review for Expedition 33. Uh, I believe on that review, we both gave it a 9 out of 10. We were very high on the game. Uh, Michael Hayam, you reviewed Expedition 33 for IGN. What uh score uh did you give it and uh give us a little pitch on your review. I also gave it a nine out of 10 and I wrote a lot about it. You know what I'm saying? Cuz that's what you do with a review. Damn, I'm so cooked. Um, no, I think it was it was a really fun exploration of I I think one of the big things uh I did in my review was picking apart a lot of the inspirations that I saw through and kind of breaking down why they're not just pulling like look look we're we're like this game too. We're like this game. We're",
            "start": 531.36
        },
        {
            "text": "review was picking apart a lot of the inspirations that I saw through and kind of breaking down why they're not just pulling like look look we're we're like this game too. We're like this game. We're like this game. Like no, they really took ownership of their influences and I just got done doing an interview with them too and they were like saying the same things like we didn't want to just make a game like what we wanted to do. We wanted to put our own spin on it. we really wanted to make it our own. And in my review, like this is before I talked to them, I was like, \"Hey, I I I guess that came through because that's exactly how I felt. Like, yeah, the UI looks like Persona and all the camera cuts and stylish.\" And then like there are bits and pieces of Final Fantasy 10 and like I talked to them beforehand and they're like, \"Yeah, those are the two games we like mainly drew inspiration from, but it's so much more than that.\" and breaking down why it is not just an amalgamation of",
            "start": 576.32
        },
        {
            "text": "to them beforehand and they're like, \"Yeah, those are the two games we like mainly drew inspiration from, but it's so much more than that.\" and breaking down why it is not just an amalgamation of its influences kind of like drove uh my review in addition to talking about you know where the story hit where it didn't necessarily hit and how [ __ ] crazy this combat system is dog oh my god and how fresh this game is we uh cat uh how did you feel about the game and on the kind of funny scale what would you give it through a one out of 10 wow uh so initially I went went in and feeling a little bit skeptical thinking it can't be that good, right? And especially in act one, it did grab me right at the beginning. That opening sequence is really beautiful, heart-rending. I haven't had that many feelings since Spider-Man disappeared. So many dustings. But I But then I was kind of going, these dungeons are fine. I'm working my way into it. And then I think at act one, the end of act one, it",
            "start": 615.68
        },
        {
            "text": "feelings since Spider-Man disappeared. So many dustings. But I But then I was kind of going, these dungeons are fine. I'm working my way into it. And then I think at act one, the end of act one, it really grabbed me when the fight with the lamp lighter. Uh it was very soulsy actually with the the lamps lighting up and then the fight itself. It's a two-part fight and I think I soloed it with Seal when uh at the very end like she came in in the reserves and my heart was pounding at the end and I was like I'm in and then of course we have the first big twist in that moment which is a very Game of Thrones surprise. The protagonist is dead because we can't afford Charlie Cox for that amount of time. I had the same thought. Yeah. Yeah. you're not all saw that and that's where they had to cut off the budget. You're playing as Ryan in the rest of the game. And then from act two onward, I was very hooked and it kept getting better and better. The battle system kept adding new layers. The story",
            "start": 664.32
        },
        {
            "text": "the budget. You're playing as Ryan in the rest of the game. And then from act two onward, I was very hooked and it kept getting better and better. The battle system kept adding new layers. The story kept going in new and interesting directions. And by the end, I was I was floored. I would give this definitely probably if I were reviewing it for IGN a 9 out of 10. Maybe 9.5 decimals will know. Yeah, we can do we can do that here. There's no way this is higher than eight. And then by the end I was like, nah, this is definitely I I had a similar trajectory. That I think it's my game of the year right now. I'm like my goatee right now. For me, it's like I'm still rocking for blueprints, but the more I think about this game, I'm like, I haven't played Blueprints yet. So, of the games I've played, this is the one for me. All right, let's finally get to it. Topic of the showts dots dots dots dots dots. It's the Claire obscure expedition 33 spoiler cast. Spoiler gloves are fully off. So if",
            "start": 710.48
        },
        {
            "text": "this is the one for me. All right, let's finally get to it. Topic of the showts dots dots dots dots dots. It's the Claire obscure expedition 33 spoiler cast. Spoiler gloves are fully off. So if you're hanging out in the YouTube or Twitch chat, you don't want to be spoiled, especially if people are sending in uh their super chats asking spoiler-filled questions. Maybe get out of here for now and uh go and beat the game on your own. Um, where I want to start is actually at the end because something that my immediate reaction to the first thing I want to ask people when talking about Clare obscure expedition 33 is which ending did you choose? We get to the end uh after we've kind of it's been revealed that this world we're in exists in a painting and it was all created by the real life version of uh Verso and this is like a childhood painting of his and you're kind of given this question of do you side with Verso uh this kind of uh painting version of Verso and destroy the painting let",
            "start": 757.44
        },
        {
            "text": "of uh Verso and this is like a childhood painting of his and you're kind of given this question of do you side with Verso uh this kind of uh painting version of Verso and destroy the painting let him finally rest and make sure Mel uh in real life can actually like not just fully engross roast herself in art and run away from reality or do you choose Mel's side and fight against Verso and make him dance like a monkey for the rest of time and you get to live a very hollow uh you know happy life. Seems like you're really leading the journey right here. I've seen both endings. So you have an ending that you like, right? That's what it sounds like. Yes. Yes. Yes. Uh Kat, I want to start with you. Which ending did you did you choose? I picked my L's ending, actually. Wow. All right. I wanted to be contrarian, okay, as I tend to be because I felt that the world can be what you make of it. And she had built this life for herself and I don't know, it didn't feel right to take it away. I knew",
            "start": 806.4
        },
        {
            "text": "be contrarian, okay, as I tend to be because I felt that the world can be what you make of it. And she had built this life for herself and I don't know, it didn't feel right to take it away. I knew where the game was kind of leading me to. I think both games, both ending, I saw both endings. I think I do appreciate that about the game, like where you can do one ending and then you can go back to a save and like immediately check out the other. I think they're both bittersweet in their own way and I appreciate that about this game cuz I like fiction where there's no right answers honestly. But really like thematically this game is about grief and found family and being able to move past that grief and taking a step forward into the world. So I think this game is kind of pushing you toward the verso ending. But I like my and I like all my pals from inside the canvas. So, I didn't want to say goodbye. Yeah. Yeah. Sometimes you got to say goodbye, though. Uh, hi. What about yourself? Uh,",
            "start": 857.6
        },
        {
            "text": "the verso ending. But I like my and I like all my pals from inside the canvas. So, I didn't want to say goodbye. Yeah. Yeah. Sometimes you got to say goodbye, though. Uh, hi. What about yourself? Uh, I saw both. I picked my ending first because I'm going to keep it real with you. I kind of it was a little hard to parse what I was choosing at the moment because because the the the way it ramps up towards the very end is that Myel's motivations and what she actually wants is it's like evolving in real time as the scenes are playing out. And so, it it feels like she's changing her mind. And Verso, too. It's like they're both learning something new and making snap decisions in the moment from what they learn from real red. And like the I feel like the ending kind of happens because Verso Verso makes a snap decision to go into the like core of the painting. Yeah. Yeah. Cuz like no matter what ending you choose, you see them like, \"Oh [ __ ] I learned something new. What am I going to do in",
            "start": 906.32
        },
        {
            "text": "makes a snap decision to go into the like core of the painting. Yeah. Yeah. Cuz like no matter what ending you choose, you see them like, \"Oh [ __ ] I learned something new. What am I going to do in this in this moment?\" And so I went with Miles first to see what it was. And I think from an artistic perspective, that ending is [ __ ] wild. And it I would say it's the more like I it doesn't feel right, but it's the more interesting ending to myself. Yeah, it is. It's chilling because it it plays it's it's almost like a plays into like horror. Yeah. In a very offkey. Oh, yeah. And literally, too, like the way Black Mirror type [ __ ] Yeah. And I think when I say like from an artistic perspective, this is like so much uh so much better is because throughout the game, the subtleties and facial expressions uh are so key to like it's as a storytelling device. Uh without that, a lot of its biggest story moments wouldn't hit as hard. More like more so than any moment in this ending when you",
            "start": 950.4
        },
        {
            "text": "expressions uh are so key to like it's as a storytelling device. Uh without that, a lot of its biggest story moments wouldn't hit as hard. More like more so than any moment in this ending when you see old Verso walk up to the to the piano and just be like, man, [ __ ] this [ __ ] But just like you said, he just has to he has to dance for her in this this fake world and you just see it on his face like damn this is this is heartbreaking. Yeah. And to like see Gustav back as well and there's like no to anything. Yeah. You see CL with her husband and it's like this this ain't right. It feels like I mean the alternative ending to Persona 5 Royal. That's what it feels like. Yeah. Like the kind of like oh you get to choose to be with your friends but you know you throw away like all of your morals and stuff. And you see on my face, she knows she knows like this [ __ ] ain't real. You know she's not content. She knows she's not 100% happy. She knows what she's doing. On the flip side, Versos",
            "start": 994.8
        },
        {
            "text": "and stuff. And you see on my face, she knows she knows like this [ __ ] ain't real. You know she's not content. She knows she's not 100% happy. She knows what she's doing. On the flip side, Versos is the very like straightforward ending where it's like, hey, you be it's cuz you be in that damn painting all the time and it's like you strip that away and you need to move on with your life. Mhm. So, I think that is it's not the most exciting ending. It's not the most interesting ending, but it is kind of it it feels like the right ending and and even that feels loaded. But I would say like the to me it's fascinating of like which one is like the right ending, which one's the quote unquote uh canon, what have you. Like I think there's so many interpretations and to me like even though I like Verso's ending more and I think there's a bit more of a like stronger message of what it what it does to people to just be lost in art, which is weirdly similar to what metaphors. I I call this the",
            "start": 1040.32
        },
        {
            "text": "Verso's ending more and I think there's a bit more of a like stronger message of what it what it does to people to just be lost in art, which is weirdly similar to what metaphors. I I call this the anti- metaphor because like at the end, this is not a metaphor spoiler, but the whole thesis of metaphor is like fiction can empower you in your real life. Whereas Clare obscure is like, hey, if you get lost in fiction, you will lose everything else in your real life if you don't get the [ __ ] out of if you just if that's like you need to live your real life as well in addition to that. So it's like similar messaging but a very different conclusion. But the myel ending like ends with, you know, Verso starting to play the piano and then it goes into the menu music and I'm like, \"Oh, that's that's devious.\" Yeah, it's it's a it it hurts. But uh but yeah, I the last thing I'll say on the ending is that I like this is how I felt about Phantom Liberty as well is that there's two mutually",
            "start": 1085.28
        },
        {
            "text": "that's devious.\" Yeah, it's it's a it it hurts. But uh but yeah, I the last thing I'll say on the ending is that I like this is how I felt about Phantom Liberty as well is that there's two mutually exclusive endings that that paint a full picture. Like you wouldn't fully understand the story in the game if you did not see both endings. Yeah. And then you get that [ __ ] ugly piano hit with the jump scare. Terrifying. Vers's like, I'mma [ __ ] up the only one in this world. I [ __ ] this [ __ ] up. T, what about yourself? I chose my I chose my ending. I um I never saw Myel as wanting this life for her out of like an an evily selfish thing to do. And also, this kid's been painting forever. Keep painting. What do you you know what what's it to you? Yeah. Well, you'll be fine. You'll be fine, Verso. Um, but yeah, to to me it would be a lot different if maybe this reality that Myel had lived through was only, I don't know, a week's worth of simulation where they thought they had been",
            "start": 1129.6
        },
        {
            "text": "fine, Verso. Um, but yeah, to to me it would be a lot different if maybe this reality that Myel had lived through was only, I don't know, a week's worth of simulation where they thought they had been existing existing their whole lives. But like I I think that would be one thing, but because they had lived lifetimes and seen uh seen relatives pass away, like this is just because it's a a a fake artificial world still like lives have been lived here. This isn't just something that was a computer simulation that was created 20 minutes ago, right? And in their minds, they have lived these whole lives, but they really have. And it's like, no, these are the these are people with who have made relationships. And also, Myel doesn't want to be Is without a voice in reality. I see I totally see both sides. I understand that. I think Versos is the the canon ending. I think that's the the the true ending or whatever. But I also I love when my movies or media end on a kind of freaky, sour note",
            "start": 1179.12
        },
        {
            "text": "both sides. I understand that. I think Versos is the the canon ending. I think that's the the the true ending or whatever. But I also I love when my movies or media end on a kind of freaky, sour note and like kind of vague. You You're an Inception, man. We we get it. And this ends and this ends with that really kind of freaky end like, \"Oh, that was so sick.\" And I'm just impressed by the storytelling um and by these developers. So that that's the the ending that I chose. And then um I um let Ben Star know that and he said, \"Damn, you didn't get to hear me sing.\" Oh, you didn't get to I didn't hear the the end credit song, which is him singing. I got pipes. This is for all you Star Trek fans. the end. Myel's story is very Captain Pike the original Star Star Trek right here cuz in the original Star Trek the there's this guy named Captain Pike who goes through a horrible accident. He's terribly maimed and he has a chance to go into a world where he's h healthy and whole and yes it's a",
            "start": 1231.36
        },
        {
            "text": "Star Trek the there's this guy named Captain Pike who goes through a horrible accident. He's terribly maimed and he has a chance to go into a world where he's h healthy and whole and yes it's a fantasy but at the same time he's not in horrible pain. Yeah. All the time. And who are we to say to a person that's like, \"I want to not be miserable every single day.\" Greenwood's character and go and be in the real world. Go touch grass. Well, but the real world is horrible actually. Yeah. And like Yeah. That that's what makes that's what makes that decision hard, right? And that's what makes seeing both endings hard is because it's like Yeah. There's there's there is no right way to go. I will say picking versus ending though, they do not make that easy. Yeah. like they really uh so I get to the ending of the game um and then it's like which one do you choose and I had to walk away for roughly 10 to 15 minutes to think about uh it in my life uh and then I came back and it was like cuz I it",
            "start": 1285.52
        },
        {
            "text": "ending of the game um and then it's like which one do you choose and I had to walk away for roughly 10 to 15 minutes to think about uh it in my life uh and then I came back and it was like cuz I it is one that really challenges you and I I talked a lot of [ __ ] about uh my ending but I it did really challenge me in the kind of again this game reminding me a lot about metaphor and I would say metaphor does talk a little bit about like Yes, fiction can inspire you to do things in your real life, but also what's it worth to just get lost in the fiction, which like uh I won't get too deep into why uh and give y'all a metaphor stray uh in the middle of this, but um I was thinking a lot about that, but I was also thinking about how much has gone through, how much she has lived through in this world, right? Uh but I did choose Verso's ending and from the jump I the dialogue is the same throughout the fight. It's just depending on who you're playing as and like they really make you feel like",
            "start": 1326.24
        },
        {
            "text": "right? Uh but I did choose Verso's ending and from the jump I the dialogue is the same throughout the fight. It's just depending on who you're playing as and like they really make you feel like the villain playing as Verso fighting Myel and it's like oh this this hurts especially after after you finish the fight where you have to say goodbye to Esa and Manoko they get [ __ ] Thanos snapped it's like it's heartbreaking and real quick this is just a side question we we can circle back to this in a main way is there a way to romance Lun or is it only CL yeah romance I did I [ __ ] I [ __ ] up Yeah, cuz Lun is literally like the greatest character of all time. Okay. I I I I just didn't though. You have to finish her social link. Yeah. Well, and so you have to do her and you have to do her stuff before you do CL's stuff, I imagine. Or just not do CL stuff at all. I'm not 100% sure. Okay. Okay. I did but I I did all of the the character quests, but I also chose to decline CL and and her",
            "start": 1374.88
        },
        {
            "text": "stuff before you do CL's stuff, I imagine. Or just not do CL stuff at all. I'm not 100% sure. Okay. Okay. I did but I I did all of the the character quests, but I also chose to decline CL and and her advancements because I also felt like man if we snap your husband back in. I think it's about God that should you have to shut down you have to shut CL down twice I think. Okay. The second time I was given the option with CL, it felt like all options were just like, I guess we're just going to [ __ ] Like I didn't the text didn't feel like I was actually shutting her down all the way. So yeah, any messages I was like, you nasty boy. Yeah, to bring it back to the ending here where like yeah, Cel, at least for my playthrough, um, walks through and you kind of hug or nod or whatever and Luna is the one kind of in the portal staring at you like pissed and like I don't know if that just gets reversed like depending on who you romance. I think it's the same. Um, but it it felt very fitting for",
            "start": 1426.0
        },
        {
            "text": "the one kind of in the portal staring at you like pissed and like I don't know if that just gets reversed like depending on who you romance. I think it's the same. Um, but it it felt very fitting for Lun to like just be so [ __ ] angry at you. Well, she's always been the more I mean, you know, the whole CL's, you know, wearing masks, faking how you feel, not ever showing your true emotions. And Luna's always been the more pragmatic. I'm going to, you know, when Miles dealing with a super traumatizing moment, and Lun just keeps on like, \"Yo, give me more info.\" And everybody's like, \"Chill the [ __ ] out, Luna. Like, what are you doing?\" You know, like there I I loved cuz I did end up watching that ending and man, she stares daggers at you. And it's awesome. Look, I think if I I'm I'm very easily swayed on character emotion. And I think I would have and I'm glad they didn't do this, but I think if they gave me a moment with faceless verso drawing and if he looked up and was like, \"Help",
            "start": 1476.0
        },
        {
            "text": "easily swayed on character emotion. And I think I would have and I'm glad they didn't do this, but I think if they gave me a moment with faceless verso drawing and if he looked up and was like, \"Help me.\" or some [ __ ] then I probably would draw my hands tired. I have bruises on my knees. I wish I like I think if they gave me anything like that and I'm glad they didn't because it made the decision that much tougher then I probably would have leaned towards Verso's ending. But I I'm glad they kind of kept it as like open as they did and showed you the the positives and negatives for both outcomes. Yeah. I I think for me like just the Verso thing, especially him being this painting version and having to know everything he knows and then also seeing the kid constantly like drawing and thinking about like how long he's been there like the core of this painting. It's like, yeah, like y'all are using like your your dead brother's uh thing for entertainment and what or not entertainment,",
            "start": 1522.56
        },
        {
            "text": "about like how long he's been there like the core of this painting. It's like, yeah, like y'all are using like your your dead brother's uh thing for entertainment and what or not entertainment, but like escapism. And if you're just going to use it forever and ever and ever, like just like let this dude rest, you know, and it was I think that's what kind of pulled me towards it. It's not actually Verso. Verso's dead, right? Yeah. Yeah. Yes. But still it's like a a part of him and with these you know the painting version of P Verso being you know this again dancing monkey is like kind of always what I I I go to is like just let this part of his soul rest and I think that's really what drew me over to him and not just the like uh you know maybe using art as escapism for the rest of your life is maybe a little bit unhealthy type of thing but um and and just because you do have to let go doesn't mean like you know uh those friends and those lives that uh you encounter don't uh kind of",
            "start": 1570.64
        },
        {
            "text": "life is maybe a little bit unhealthy type of thing but um and and just because you do have to let go doesn't mean like you know uh those friends and those lives that uh you encounter don't uh kind of carry with you, right? I I do really love the verso ending where you know they're the family kind of comes together still a little bit broken but finally like taking a moment to actually properly mourn Verso uh who had died in the real world and then you get the shot of May looking at all of her friends that she made and then they like they dissolve and gum and it's like [ __ ] they weren't real. They were her imaginary friends. No, they were real. They just she'll she'll always carry them. She's holding she's holding the SKA plushy. Oh, that got me like oh damn. Like he was just making his toys in this painting and just to be his buddies. And it's so it's I love the contrast of like tragic sexy man Benar playing Verso. Uh and then being like the gruff manly dude who's going to [ __ ] do",
            "start": 1617.52
        },
        {
            "text": "in this painting and just to be his buddies. And it's so it's I love the contrast of like tragic sexy man Benar playing Verso. Uh and then being like the gruff manly dude who's going to [ __ ] do a million damage if you speck him out right in one hit. and just being like this like one of the like toughest characters and the you know the way he looks and then you know contrasting that with like oh but like this the the manifestation of his soft side is is is that it's it's Manokco and it's Esier and it's that that childlike wonder didn't like still came through in that and he named after his dogs that's what yeah and he embraces that as a name the dog it's so funny good um to kind of work backwards from here And uh this is kind of the second big question I have mainly because um talking to some friends at the show about them getting to kind of the end of act two, us realizing what this world truly is, all of this stuff. Uh when we learn that we're in a painting and Mel is a part of",
            "start": 1662.8
        },
        {
            "text": "to some friends at the show about them getting to kind of the end of act two, us realizing what this world truly is, all of this stuff. Uh when we learn that we're in a painting and Mel is a part of this family outside of the painting that have these painter powers or whatever and they're at war with writers and all this stuff. um once we get this big reveal and we also get the reveal that the paintress inside the painting has actually been trying to save the painting and warning all y'all like did that initially work for y'all initially getting to it cuz I think for me the the cut scene where it's Verso reading the letter from uh the painted version of Lisia and she's talking about like you know the mom has actually been painting to give life the dad has been painting to uh uh for death or whatever That was all like really shocking and then to see everybody be goes like whoa. That felt like the we just got an inception ending right here and then it's like oh no there's more. It was",
            "start": 1711.84
        },
        {
            "text": "or whatever That was all like really shocking and then to see everybody be goes like whoa. That felt like the we just got an inception ending right here and then it's like oh no there's more. It was like whoa. Uh and then to kind of get that full scale. It took a little bit for me to get fully sold on it. Um and so I'm wondering where y'all kind of were at. I'm right there with you. It reminded me a lot of the as much as I enjoyed A Thousand Times Resist, I thought it ended about 12 times. And I'mma beat your ass right now, bro. And then you get more and then you're like, \"Ah, but it's good, so I don't give a shit.\" Right. Yeah. There you go. But but when you're in our line of work and you're in review season, it's like, \"Ah, [ __ ] man. I really I like I thought it was going to be an early night and it's not. I'm going to keep on like playing through the end of uh to this video game.\" And so initially I am kind of met with, ooh, is this getting larger than it needs to be? Is this",
            "start": 1762.16
        },
        {
            "text": "early night and it's not. I'm going to keep on like playing through the end of uh to this video game.\" And so initially I am kind of met with, ooh, is this getting larger than it needs to be? Is this getting too conceptually out there with the writers and the painters war? Like I don't [ __ ] care about whatever's happening out there. And then, you know, a couple of lines of dialogue in I'm like, that's actually kind of cool. Like I want to learn more about it. And it didn't take much for me to be into it. It it was only more of a time thing where I'm like, damn, it's already 9:00 and I was hoping to like shower and get to bed early. I enjoyed it. Yeah. Yeah. I I mean, I liked the I liked the twist. It made a lot of sense to me. I When I got to act three, I had heard some people say, \"Ah, we're a little mixed on act three. We don't know how we feel about it. Some people love it. Some people aren't so sure.\" In some ways, I felt like I was playing a different game when I got to act",
            "start": 1810.64
        },
        {
            "text": "we're a little mixed on act three. We don't know how we feel about it. Some people love it. Some people aren't so sure.\" In some ways, I felt like I was playing a different game when I got to act three because thematically it becomes very, very different. The first two the first two acts are it's an impossible mission. and you're following in the footsteps of those who have come before who are paving the way for you there. You're trying to save the world. Do you how do you exist in this world that is dying? I don't know. And that's all very compelling in this day and age, at least to me. Well, I mean, literally in the first few minutes, they go, \"Well, I decide not to be a mom because I can't bear to bring a child into this horrible world.\" And I'm like, \"Well, that hits really hard for me in various ways.\" And then to act three, it's like, \"Actually, it's about grief.\" Yeah. family. It's about saying goodbye. It's about family. And I thought, \"Oh, okay. So, this is a totally It all",
            "start": 1855.2
        },
        {
            "text": "me in various ways.\" And then to act three, it's like, \"Actually, it's about grief.\" Yeah. family. It's about saying goodbye. It's about family. And I thought, \"Oh, okay. So, this is a totally It all connects to it comes together. It's fine.\" But it did feel like almost a different story when I got to act three. And you're essentially writing off an already impressive like story and with world building that was already awesome to where it's like, \"God, I'm so interested in whatever the hell is happening here.\" Yeah. the meeting all these random NPCs talking about living in this fracture and just how [ __ ] up it is and you can't grow old and you when you want to have a kid you it's like well I'm not going to be around for them to grow up but I want to have a kid to where I'm not old enough but you know it's like all of that inner strife was so fascinating and then it does kind of feel like ah damn but it was it was all a dream and I really loved that world and I kind of wanted that",
            "start": 1893.36
        },
        {
            "text": "but you know it's like all of that inner strife was so fascinating and then it does kind of feel like ah damn but it was it was all a dream and I really loved that world and I kind of wanted that fiction to continue And it it just kept on getting more interesting though. I think often I'm not the biggest fan of the well actually none of this is real. Like I like the stakes to be a lot more grounded. But at the same time when you get to act three and you learn everything, it all starts to make a lot of sense that they were inside a painting. All of the really abstract elements of it, the bosses, the environments, the haziness, it all goes, \"Oh, right. Of course it's a painting.\" And I was a little a little critical on the art in the first act. I was saying,\"Well, these environments are a little like an Unreal Engine 5 tech demo.\" And then when you when uh all is revealed to you, you regret your words and deeds, and that's me. I'm like, \"Oh, no.\" Actually, it's extremely coherent.",
            "start": 1940.08
        },
        {
            "text": "a little like an Unreal Engine 5 tech demo.\" And then when you when uh all is revealed to you, you regret your words and deeds, and that's me. I'm like, \"Oh, no.\" Actually, it's extremely coherent. Initially, you think it's like, \"Oh, this is a bunch of floating stuff to like make this place look like something, right?\" It's like, \"Oh, no. A child just made this.\" And they're like, \"Ah, this looks cool.\" You put floating stuff. That's art direction. Yeah, I think uh I'm I'm kind of with both of y'all on that. That's exactly how I felt when the twist happened is that it took me a little while to come around on it and when cuz I was in the preview and in the leadup to it, I was like sold on the premise. It reminded me of Xenolade Chronicles 3, which is like one of my favorite games of all time at this point. And that theme of knowing when your time is coming and doing something about that. That's why Xenolade Chronicles 3 hit with me so hard when I had to come to terms with that after",
            "start": 1984.96
        },
        {
            "text": "time at this point. And that theme of knowing when your time is coming and doing something about that. That's why Xenolade Chronicles 3 hit with me so hard when I had to come to terms with that after heart surgery and being told that I'm not going to live. I'm I have a shorter lifespan than every everyone else around me. Um, all things equal. When Expedition 33's story was started to like unfold, I'm like, \"Holy [ __ ] they they made a story that is going to like absolutely hit me.\" And it still does in many ways, but then when you hit act three, it's like, \"Oh, it's about something else.\" And there's there's enough connect like it took me a while to like piece this together. I talked to Eric Eric Van Allen about this too when he finished it is that there is enough connective tissue to make those two halves make sense. But I do wish that I wonder if there is a version dreaming up things that don't exist. But I wonder if there is a version of both halves of those stories that were like",
            "start": 2023.68
        },
        {
            "text": "those two halves make sense. But I do wish that I wonder if there is a version dreaming up things that don't exist. But I wonder if there is a version of both halves of those stories that were like fully about those things cuz like the stuff about the about the family about my family or paint Miles painted. She's fake. Uh about the Renoir's family or whoever the [ __ ] uh Versa's family like that stuff is compelling and it's it's done really well but it happens very fast, right? Uh, so I like that's why like throughout act three, I'm like, \"Oh shit.\" I feel like I need to really speedrun or not speedrun, I need to like really come to grips with what is happening in front of me. I need to like sit down with every line of dialogue and be like, \"What does this all mean?\" Um, and I I am kind of 50/50 on like, oh, it was all a dream type scenario. But it like in the context of when you find out like oh this is a fake world in which my is coping within because of the tragedy that happened",
            "start": 2061.36
        },
        {
            "text": "of 50/50 on like, oh, it was all a dream type scenario. But it like in the context of when you find out like oh this is a fake world in which my is coping within because of the tragedy that happened to the family. Then it all all came together. So like it comes together. It does. But I'm still mixed on the transition. Yeah. Kind of wish I had all 100% of that and 100% of the other thing as well. Exactly. Yeah. It's crazy that how great the world building and concepts are that like they base it's almost like any other developer would have been like damn that concept's really good. Let's say that for another game and they kind of just put them all in here which I think is like a pretty astonishing feat. I think I want to say in fairness that they really laid the groundwork for saying it is about family from a very basically from the moment that you meet Renoir and everything. Sure. But I when I think about how all of this ultimately came together, I think it could have been a very",
            "start": 2106.24
        },
        {
            "text": "is about family from a very basically from the moment that you meet Renoir and everything. Sure. But I when I think about how all of this ultimately came together, I think it could have been a very different game and maybe a lesser game if it had been like, \"Oh, you killed the paintress, but actually she was defending everybody and now you have to go save the world for real, for real real.\" And that could have been a great story on its own and very moving and all of that, but I think swerving hard and then really becoming introspective and thinking about grief and family and everything, I think it's a I think it elevates it. Yeah. Actually, I think it takes it in to another level. Yeah. And that was when I I thought act two was like, I'm hooked, I'm sold, I'm in. Act three, I was like, this game is special. Yeah. Yeah. Uh for me it really started to click for uh when you start to act three is pretty much like you get a good story chunk and then it's like all right here's your last",
            "start": 2154.08
        },
        {
            "text": "this game is special. Yeah. Yeah. Uh for me it really started to click for uh when you start to act three is pretty much like you get a good story chunk and then it's like all right here's your last chance to like go do uh side quest stuff before you do your final runup to uh the final boss. And it really clicked for me of like exploring around taking it in that this is Versa's world as a child and putting together that like the angry turtle man uh who is like SKA's uh roommate is angry and is angry because he misses Verso's sister who used to come in and play in this world. And when you first hear of this like woman's name, you don't you don't know the context of it. And then coming back to visit him uh because of SDA's side quest, you're like, \"Oh, that hit me like a ton of bricks.\" and then, you know, doing the other action uh thing that leads into Mael doing a 1v one boss fight with herself, which is like some of the coolest like uh side option stuff in the in the game. That",
            "start": 2201.04
        },
        {
            "text": "and then, you know, doing the other action uh thing that leads into Mael doing a 1v one boss fight with herself, which is like some of the coolest like uh side option stuff in the in the game. That really started to click with uh click with me and I think I think I forget who says this. I think it might be versel or maybe somebody else, but at one point they say the whole world carries the burden of your family's grief. And that was kind of the moment it re the two different themes clicked together for me. That even though a lot of this game is about grief, it also kind of comes in tandem with what they do and how that affects the people who do now have to live in the society that are dealing with all of these struggles. That's that's where it really all uh came together for me. I see a lot of people comparing this game to Final Fantasy 10's ending, and I have to say that it's like Final Fantasy 10's ending but good. I never Damn, I'm talking. I never liked Tus catching strays. I",
            "start": 2246.64
        },
        {
            "text": "a lot of people comparing this game to Final Fantasy 10's ending, and I have to say that it's like Final Fantasy 10's ending but good. I never Damn, I'm talking. I never liked Tus catching strays. I never liked Titus's ending. It's Titus. I never liked uh I never liked the Xanarchin bit cuz it it Yes, I know they established it and everything, but I felt like if you had made it about Yuna and just kept it to that, it could have been a really really special story. And in this, I felt that it made a lot more sense. They did a really good job of establishing it within the bounds of the world. the idea of painting on a canvas that they're all living inside a painting and everything. It it works well in this kind of abstract kind of sense. So yeah, if it it's much more coherent work, I think. Sorry, Final Fantasy 10 fans. And with that dunk on Final Fantasy 10, we'll be right back to talk more about Clare Obscure Expedition 33 right after a word from our sponsors. This episode is brought",
            "start": 2294.0
        },
        {
            "text": "Sorry, Final Fantasy 10 fans. And with that dunk on Final Fantasy 10, we'll be right back to talk more about Clare Obscure Expedition 33 right after a word from our sponsors. This episode is brought to you by Imperial. We've told you all how important it is to developers to wishlist games that you're interested in. So, if this sounds cool to you, make sure you wishlist it. Imperial is a complex, featurerich action RPG where you'll be sent to a planet in a far-off corner of the galaxy to explore an imposing monolith. As an elite mercenary, you'll join the expedition tasked with unearthing the secrets of the monolith and face off against the deadly automatons within. In Imperial, you'll explore four vastly different quadrants of the monolith. Accessible only by using mysterious artifacts known as cardoggrams. Each cardoggram affects which enemies. Boss fights and loot will appear when you enter the monolith, so no two excursions will be the same. Find even more cardoggrams to explore by",
            "start": 2339.12
        },
        {
            "text": "as cardoggrams. Each cardoggram affects which enemies. Boss fights and loot will appear when you enter the monolith, so no two excursions will be the same. Find even more cardoggrams to explore by looting defeated enemies or buy them from other players online at the trading post. Imperial features three weapon archetypes: the fast-paced acrobatic glaive, the defense focused mason shield, or the devastating cannon with a range of customizable skills and abilities that can make short work of the awaiting automatons. Your weapons and abilities can be changed before any excursion into a cardoggram. So, if a loadout isn't working for you, you can mix things up to create the perfect play style. Help the members of the expedition in deep branching quests and aid other players in asynchronous multiplayer. Get ready, mercenaries. The monolith awaits. Imperial is available May 8th on PC, Xbox Series X and PS5. Wishlist now. It helps so much. Wishlist Imperial. This episode is brought to you by",
            "start": 2382.72
        },
        {
            "text": "Get ready, mercenaries. The monolith awaits. Imperial is available May 8th on PC, Xbox Series X and PS5. Wishlist now. It helps so much. Wishlist Imperial. This episode is brought to you by Auraframes. If you haven't called your mom in a while, here is your reminder to do it. But then you want to go above and beyond. Mother's Day is coming up and I have the perfect gift idea. Aura Frames are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preload it with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special they'll use it every day. Greg, Kevin, and a ton of people here at Kind of Funny are obsessed with their Aura frames. It takes about 2 minutes to set up a frame using the Aura app. So, the next time you need to call your mom, you can also send her a new pick of you from that trip you're telling her all about. Aura has",
            "start": 2426.0
        },
        {
            "text": "takes about 2 minutes to set up a frame using the Aura app. So, the next time you need to call your mom, you can also send her a new pick of you from that trip you're telling her all about. Aura has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting oruraframes.com to get $35 off plus free shipping on their bestselling Carver Matte frame. That's a frames.com. on promo code kind of funny. Support the show by mentioning us at checkout. Terms and conditions apply. The show is sponsored by BetterHelp. It's super great that mental health awareness is growing, but there's still progress to be made. 26% of Americans who participated in a recent survey say they've avoided seeking mental health support due to fear of judgment. We can do better. No reason for fear. BetterHelp has over 10 years of experience matching people with the right therapist from the diverse network of more than 30,000 licensed therapists with a wide range of specialties.",
            "start": 2473.04
        },
        {
            "text": "reason for fear. BetterHelp has over 10 years of experience matching people with the right therapist from the diverse network of more than 30,000 licensed therapists with a wide range of specialties. Some of my best friends use BetterHelp and love how helpful it can be for learning positive coping skills and how to set boundaries. It empowers you to be the best version of yourself. It isn't just for those who've experienced major trauma. If you're thinking of starting therapy, give BetterHelp a try. It's entirely online, designed to be convenient, flexible, and suited to your schedule. We're all better with help. Visit betterhelp.com/kindfunny to get 10% off your first month. That's betterhelp hp.com/kindfunny. better betterhelp.com/kindfunn. Welcome back everybody. We're going to kick it to some super chats just because y'all have been coming through asking questions uh for us to answer and ponder over. First, we're going to go to Zest Wispa, who uh says, \"The devs have discussed",
            "start": 2515.36
        },
        {
            "text": "it to some super chats just because y'all have been coming through asking questions uh for us to answer and ponder over. First, we're going to go to Zest Wispa, who uh says, \"The devs have discussed potential DLC in the future. What would you like to see from the DLC? New areas and bosses, previous expeditions, more Manokco?\" I think previous expeditions could be like a really cool way to kind of go into some different types of story, different themes, but still keep it in this world. It's a very complete work, and it's sort of hard to jam in extra DLC. I suppose you could have a new area that you could explore, say during act two or something like that, but I think the side stories with previous expeditions where you get to meet new characters and have different abilities could be just a lot of fun as standalone content. Yeah. What was up with those one little levels that would have that one fixed camera angle and you would just walk in super far away from the camera? You you just",
            "start": 2565.6
        },
        {
            "text": "a lot of fun as standalone content. Yeah. What was up with those one little levels that would have that one fixed camera angle and you would just walk in super far away from the camera? You you just get an item. Yeah, that to me was like my game was broken. I was like, \"Wow, the camera the camera here is not working.\" To me, I was like, \"Walk way far back and I'm just like lost back there.\" It It was an homage to like the Yeah. '90s era RPGs where you just like kind of walk onto a screen, you like kind of vibe out, pick up an item, and then leave. It's so infrequent that I thought it was broken. I was like, \"I've only experienced this twice. Like, there's no way this It was just like, \"Hey, look how cool this [ __ ] looks.\" Yeah. Like here here's an entire vibe that we couldn't work into like a full-on environment, but we still wanted to use it, you know? Um yeah, going on the DLC thing, I if anything, I wouldn't really want something that substantial regarding like previous",
            "start": 2609.28
        },
        {
            "text": "into like a full-on environment, but we still wanted to use it, you know? Um yeah, going on the DLC thing, I if anything, I wouldn't really want something that substantial regarding like previous expeditions in the DLC cuz I don't know if I I don't know their budget or their time or whatever, but I would want like a full ass game for that. I would want a a full other game because straight up, dude, like I don't know how many of these voice members I've collected at this point, but I'm looking I'm listening to them all and the last one that I just listened to on stream last night was one that I hadn't heard during my first full playthrough. And I'm like, dude, some games can't get one good voice actor. This [ __ ] game has a shitload of voice memos from some of the best voice delivery acting you'll ever hear in your life. And they're not even main characters. They're just like a random boy. Like, god, it's so impressive, dude. Yeah. Yeah. Um, I kind of agree with if you're going to",
            "start": 2651.84
        },
        {
            "text": "you'll ever hear in your life. And they're not even main characters. They're just like a random boy. Like, god, it's so impressive, dude. Yeah. Yeah. Um, I kind of agree with if you're going to explore a previous expedition, it might be like a standalone expansion or like the size of a Phantom Liberty Miles Morales. Yeah. Yeah. Uh, because there there's and like the fact that Verso has been involved with previous expeditions is that there's connective tissue there. Um, I mean considering how big um Clare Obscure is as a base game like uh I wouldn't mind if they they if they did that and like the if you the more you dig into those logs you realize how rich this world is to explore those things. Um I would love to see that. Um but I would I don't know if like opening up an extra area for like like extra bosses would necessarily move the needle for me or get me excited because there is so much side content already in the game. Like you can spend an additional 30 hours on side content",
            "start": 2701.52
        },
        {
            "text": "like like extra bosses would necessarily move the needle for me or get me excited because there is so much side content already in the game. Like you can spend an additional 30 hours on side content alone. And I've spent a lot of time on that side content. You learn so much more about the story in some of those super bosses and you learn to break the [ __ ] game in some crazy ways. Some of some of the things Jesse Fatelli has posted like how is your brain working? Yeah. Yeah. So I feel like that desire is fulfilled already in the side content. So um yeah I I the only thing I could think of is like here's an what about an endless tower? Somebody was saying this in the chat. I really like this idea actually because the battle theme is the battle music. Sorry, the battle system is so good that I could just spend a long time grinding through battle after battle after battle. I mean, did you did you do the endless? Did you do Did you do the endless tower? The endless tower. No, quote",
            "start": 2744.16
        },
        {
            "text": "that I could just spend a long time grinding through battle after battle after battle. I mean, did you did you do the endless? Did you do Did you do the endless tower? The endless tower. No, quote unquote. Oh [ __ ] Yeah. There there there is an endless tower, but it gets so hard that you think it's endless. I think there's like ah I forget. I think Okay, then I'm going to go do that. Yeah, there you go. You already have your There's a lot of Wow. you got I keep hearing about this boss named Simon and how it's like that's the one Andy that's really going to like [ __ ] you up and [ __ ] everybody up and then I thought of like man Simon Mannis and Liza P was also a pain in the ass. Like I don't know what it is about this Simon guy but I I got to go find him out. Um yeah in a similar vein drop uh Dropkick Tando asked do you think the war with the writers hints at possible uh at franchise possibilities? Oh [ __ ] I think so. that. See, that's where the story like I was so not interested",
            "start": 2788.0
        },
        {
            "text": "uh Dropkick Tando asked do you think the war with the writers hints at possible uh at franchise possibilities? Oh [ __ ] I think so. that. See, that's where the story like I was so not interested in that stuff. Like I I I get where it comes into it being about uh grief and all this stuff. I would have preferred if it was like Verso stuff was kind of kept within like the confines of just like this family. Them teasing this whole like ah we're at war with writers. We're writers. I hate them. Like all right, it becomes the Matrix with the flying robots and that's where I left. I I get that, but I'm also such a sucker for proper nouns versus proper nouns. Like in Destiny, the [ __ ] the floaters against the [ __ ] wieners or whatever. Like, I don't know. But like, dude, like the writers versus the painters is such a cool sounding thing. I have to have that. That sounds so nerdy and awesome. I would be sold on it if they gave it a full exploration is what I'll say. I think they could do a",
            "start": 2827.92
        },
        {
            "text": "the painters is such a cool sounding thing. I have to have that. That sounds so nerdy and awesome. I would be sold on it if they gave it a full exploration is what I'll say. I think they could do a great job. At the same time, I'm I'm good. I don't really need a sequel cuz it's a very complete story. I feel like it came to an end. I I don't know where you could go with this particular world. I guess we could do writers versus painters, but I'd rather see them do something new with their next I think they could keep it in the world, but it's just not uh the I forget their family name. Uh or like it's just not about them. It's just like a different There have been so many other paintings, right? Yeah. Like there are a lot of other paintings. Are they the only painter family? Do we start in a world that's like uh you know from the writers or something? I don't know, man. There's there's a lot that you could do. Give me that Bob Ross DLC. Boss, that [ __ ] would be crazy. When you all uh",
            "start": 2875.92
        },
        {
            "text": "a world that's like uh you know from the writers or something? I don't know, man. There's there's a lot that you could do. Give me that Bob Ross DLC. Boss, that [ __ ] would be crazy. When you all uh when when Gustav bites bites the dust, right? You can say, we rest in peace, Gustaf. Yeah. When he died, I just use the you know, were you Oh, true. Were you expecting to uh to take over as myel? Cuz I was and I was kind of disappointed I wasn't. And then I wonder what the decisions were there to not have that be the case cuz I feel I I could see a lot of different explanations for why you would and why you wouldn't of well if you can't be Verso that takes away the relationship like level ups or whatever. Um because at at a certain point you'd have to be an unknown entity kind of talking to your your squadmates or whatever. Um catching strays out here. I'm like, \"God, I don't want to relive this moment.\" When that happened, I was like, \"That's [ __ ] that's Sephro saving Mario trailer.\"",
            "start": 2916.8
        },
        {
            "text": "your your squadmates or whatever. Um catching strays out here. I'm like, \"God, I don't want to relive this moment.\" When that happened, I was like, \"That's [ __ ] that's Sephro saving Mario trailer.\" Um, but like for me in that moment, I was like it it would it felt like it would have been so fitting to take over as myel. Mhm. But I could totally see the storytelling reasons for why you wouldn't because things would need to be a bit more obscure. So, what you're saying is, did we need Verso? Was is Verso an essential character? No, I totally see the need. I I just for me it was like I don't want to take over as vers. I wanted to take over as my feeling now. Similar to when you get the reveal of what the world is and like in the first couple hours you're like why seems and then like once you get like halfway through or like yeah halfway through act two that's where I became more like okay I get why we're verso right now. Once you kind of learn that like oh Renoir is his dad and like",
            "start": 2969.52
        },
        {
            "text": "you get like halfway through or like yeah halfway through act two that's where I became more like okay I get why we're verso right now. Once you kind of learn that like oh Renoir is his dad and like there's a bit more of a connective tissue here. cuz in my like gut instinct as well, I was like, why aren't we playing as the other person who's been set up in the last 10 hours as like the other protagonist? I think that's interesting cuz I saw the story through Myel's eyes. I mean, she's in most of the cutscenes. I was running around the world in as her. So, I don't know if I would say that I was Verso. I only felt that way when you're at the home base going to go interview everybody. When you're talking to people, you are Verso. Yeah. And and because of that, it I I kind of wish I could have appreciated more of the the distrust of this Verso character because he he is introduced in such a an odd way where I'm like, \"Wait, but you were just hanging with that dude and now you're saying",
            "start": 3011.6
        },
        {
            "text": "appreciated more of the the distrust of this Verso character because he he is introduced in such a an odd way where I'm like, \"Wait, but you were just hanging with that dude and now you're saying you're with me. Like, I can't really trust you.\" And like I kind of I wonder if the whole sole purpose of like was like, \"No, you're going to play as him at the home base because we want you to trust him more as opposed to him still being this mysterious figure that's just kind of lurking around the base.\" I say lurking interesting if he had been a mysterious figure lurking around the base. Yeah, I I I think so. Um but then, you know, that doesn't let you I can't, you know, romance Lun. And what's the point of the game if I can't do that? Yeah. Uh I just think it happens too fast. They don't give you a moment to like really sit with Gustav's like passing. Yeah. Or his death. And they're just kind of like, \"All right, here's here's the new Gustav.\" And and then you don't get to like have a",
            "start": 3054.72
        },
        {
            "text": "you a moment to like really sit with Gustav's like passing. Yeah. Or his death. And they're just kind of like, \"All right, here's here's the new Gustav.\" And and then you don't get to like have a moment of Gustav's death until like a couple hours in where they find out. You do the dungeon and you do that, but Versal's already in the mix. So, it's like, ah, I guess I didn't really I didn't really feel I didn't have the feeling of like, oh, there's something missing in this party right now. So, ah, it's just like a little nitpick in terms of I get like the game's like brevity like, \"Hey, we need to move. We need to put these things uh as soon as possible. Get to the point. But that is one moment in which like okay, Gassav's gone. Enter Verso. Cool. Your party is still complete. Move on. It it'll give it a little bit more time. Um I like that Lun is essentially the game devs in these moments where Lun is like, \"No, we got to move on. We can't bury him. We got to continue with the",
            "start": 3097.04
        },
        {
            "text": "on. It it'll give it a little bit more time. Um I like that Lun is essentially the game devs in these moments where Lun is like, \"No, we got to move on. We can't bury him. We got to continue with the mission. That's what we do.\" You know? Uh Meofellow asks, \"What's everyone's favorite boss and why is it one of the Axens or the duelist? My god, those bosses were next level in this game. Oh, the duelist was so Elden Ring. I It's straight basically Shadow of the Earth tree. There's a boss down to the starting the flame, the swords on fire, and I'm like, \"Wow, this game went full from software. I'm here for it.\" No, I I like the lamp lighter boss. That was the one that really grabbed me right from the start, I think. Uh the Renoir fight at the Louv was a lot of fun. Actually, the final Renoir fight was one of my favorites. I I finished it in one go. Damn. Damn. You're a real gamer. I find Well, here. Okay, my dark secret. I didn't figure out that the pictos boosted your stats until well",
            "start": 3133.52
        },
        {
            "text": "fight was one of my favorites. I I finished it in one go. Damn. Damn. You're a real gamer. I find Well, here. Okay, my dark secret. I didn't figure out that the pictos boosted your stats until well after I had beaten the axons. I was like, \"God, why is this so hard? Why am I getting killed so easily?\" And then somebody mentioned it offhand. It's like, \"Oh yeah, I was using the pictos to boost my stats.\" I'm like, \"What?\" Yeah. And then you see like, \"Oh, I could get two 2,000 health off of this picto.\" Uhhuh. Yeah, I was using low-level pictos because I was like, well, this is a really good ability. I want to have this on my character. No, it's the stats. Stats. It's all stats. Uh my favorite boss fight, I still think about it, is um what's the the dancing boss or whatever. Oh, yeah. That whole dungeon like that got me. Um, like I the dungeon because of how it uses music because it has this song and you as you progress in the dungeon, different layers of that song play in and out. Y",
            "start": 3178.96
        },
        {
            "text": "whole dungeon like that got me. Um, like I the dungeon because of how it uses music because it has this song and you as you progress in the dungeon, different layers of that song play in and out. Y and you have an instrumental version, you have an ac capella version, you have like a scaledback version with a few instruments and then you get to like the final phase of that dungeon and it's the full song with everything. And I was like, yo, these [ __ ] cooked. And it is like one of the most beautiful songs. Like I sat there like staring at the boss for 20 minutes just listening to the dungeon theme. Like damn, this [ __ ] is beautiful. Um and then you fight the boss and it's uh like a big boss battle version arrangement of that song and that that is such an RPG thing to do. Yeah. And at that moment I was like, \"Oh, they understood the assignment from every single end.\" They executed it like perfectly and like they they did it their own way. And like that fight was super cool because",
            "start": 3222.2
        },
        {
            "text": "that moment I was like, \"Oh, they understood the assignment from every single end.\" They executed it like perfectly and like they they did it their own way. And like that fight was super cool because of, you know, when when Siren calls in the other dancers and you have to lay in all these attacks. There's like a jump dodge and there's like a multi-hit dodge all in one go and you have this music playing and the environment is like [ __ ] flying at you. The mask keeper boss, don't get me wrong, was is was incredible. One of my favorite boss themes in that. It's very mournful. That was Yeah, that was yours. Um, anybody beat the mask keeper without defeating the mask? No, I did the first time. Yeah, crazy. Which one did you stay at keep alive? Um Oh, no. Wait, wait, wait. No, so sorry. Cuz Yeah. Yeah. So, check this out. Joy heals it so fast. The one you should kill out of my first time playing I um I didn't go to the optional paths. I was like, I'll save that for the stream next time I",
            "start": 3267.2
        },
        {
            "text": "Yeah. So, check this out. Joy heals it so fast. The one you should kill out of my first time playing I um I didn't go to the optional paths. I was like, I'll save that for the stream next time I do this. Little did I know what the whole point of the boss was, right? But like the whole point of this boss fight is you can main path and go straight for the boss or you can go these al alternate paths and essentially weaken the boss and make their moves uh you know less shitty for you. And I didn't know that. I thought it was just kind of like extra [ __ ] to get maybe more picto. So I saved that for stream and I was like whoa this is really [ __ ] cool. And then for the siren fight when big homeboy spindle man spindle man. Yeah. And you know, it's like, hey, this this enemy is not hostile. Attack it. I thought I would have been rewarded for not attacking it. So I was like, I'm not going to attack it. I'm not going to fight it. It seems like it's one of those like, you know, hey, this",
            "start": 3307.6
        },
        {
            "text": "Attack it. I thought I would have been rewarded for not attacking it. So I was like, I'm not going to attack it. I'm not going to fight it. It seems like it's one of those like, you know, hey, this might help us take down the boss, but it's saying, hey, it's not hostile. Do you want to attack it? I said, no, cuz I bet you he's going to pop through for me at the end of the fight and like he's going to be, I'm tired of working for you, CR, or some [ __ ] And like, no. It turns out it became a lot easier if you fight him and kill him in that moment. So, I was able to do both of these on my most recent playthrough. Uh, but my favorite fight would be Siren as well, only mainly because of the visuals and the music. Um, I don't think it was my favorite mechanically. It was still fun as hell, like a lot of the fights are, but I wish that a lot of the fights echoed a lot of the creativity that the lamp lighter had with the lamp lighter having the Simon says kind of thing, shooting the lamps. I",
            "start": 3358.8
        },
        {
            "text": "a lot of the fights are, but I wish that a lot of the fights echoed a lot of the creativity that the lamp lighter had with the lamp lighter having the Simon says kind of thing, shooting the lamps. I thought we'd get a lot more gim gimmicky things like that throughout the game. And we start to see it a bit more in like I think like the endgame optional stuff for sure. Yeah. Like I I was really hoping to get more of that sort of goofy [ __ ] of this weird memorization game of hitting the lamps in the right order. Oh [ __ ] That's kind of that's really cool. I am excited to see what they do with the rest of this. And now the rest of the game still kicks a huge amount of ass. But I thought there would be more creative moments like that of um I guess we do get some spots of like oh you shoot those little floating things here and there. Um I just thought we'd get more of that creativity. But yeah, Siren I thought was like the one where I just would always do the I would always do the E3",
            "start": 3398.24
        },
        {
            "text": "those little floating things here and there. Um I just thought we'd get more of that creativity. But yeah, Siren I thought was like the one where I just would always do the I would always do the E3 walk for the chat and just be like look at this. Welcome to the world of Claire Obscura Expedition 33. This is art direction to the max. I cannot say enough about how fun the boss fights are in this game because so many RPGs, turn-based RPGs, you get in, you fight a boss, and yeah, there's some interesting aspects of it. Oh, is this one more status effecty? Is this one more uh hitting really hard? Should I be buffing? What kind of build do I need? This one, every boss felt totally different in their own way. And most of the time I would lose my first fight cuz I wouldn't know how to parry any of their attacks, what's going on. It would take me a few times to get into the rhythm. And once you get into the rhythm by the end, you feel so good when you finally take it out. And I think that's",
            "start": 3440.16
        },
        {
            "text": "of their attacks, what's going on. It would take me a few times to get into the rhythm. And once you get into the rhythm by the end, you feel so good when you finally take it out. And I think that's kind of the secret sauce of Expedition 33 is just how satisfying it is to get over the hump with each of these bosses. And it doesn't feel impossible. Mhm. It feels very doable, but it is a really significant challenge if you're not extremely overleveled, which some people are. They like boss started introducing them he has attacks like an elven ring. It's like, \"Oh, you're going to swing at me in the next two minutes.\" Hate it. Uh mine mine was male versus Alysia that like for me like emotionally that hit for me. And then it was fun to fight against somebody who you've been utilizing their attacks the entire time and now you're on the other end of it where it's like now I got to figure out how my male fights on the other end and how to parry all of these attacks that I've been using the",
            "start": 3488.72
        },
        {
            "text": "the entire time and now you're on the other end of it where it's like now I got to figure out how my male fights on the other end and how to parry all of these attacks that I've been using the entire game. For me that was really cool. And then to let that action go. Does that action show up still if you don't do that before the end of the game? Uh I don't No, it it does cuz I did that dungeon after the fact. Okay. And but yeah, that that's I'm I'm surprised that that was a piece of side content. I know. It feels like a piece of male story. I do like that it's like, hey, if you discover this, you are rewarded with something so crucial. Yeah, cuz like it's not super crucial to the where the the where the main story goes, but just like the kind of the kind of closure you get from it and like this exchange that Alysia and Myel have is just kind of like it's in a way it is it's heartbreaking, but it's also heartwarming. It's like an acknowledgement of both of their sides and like here's a",
            "start": 3534.24
        },
        {
            "text": "this exchange that Alysia and Myel have is just kind of like it's in a way it is it's heartbreaking, but it's also heartwarming. It's like an acknowledgement of both of their sides and like here's a parting gift. Um Mad Rock says he does show up at the end of uh Endgame Renoir fight. Yeah, but if you don't do that side maybe. Whoa. If you don't do that fight beforehand, does he still show up? Oh, that's Yeah, that's uh that's what I'm interested in. And then Sean McCalpine reminds me of my other favorite fight. Uh the fight for Manoko side story was very tough for me but felt so good to beat it. That's the village leader of the uh gestals. And that lady is insane. But so dude, Goldra was one of those that I I remember beating the, you know, kind of maybe I hadn't gotten the full unlocked full power type [ __ ] yet, whatever that Pictose is where you can go past the the 10 damage camp or whatever. But I remember going back to her and being like, I'm sure I'll be good now. And I was",
            "start": 3577.68
        },
        {
            "text": "full power type [ __ ] yet, whatever that Pictose is where you can go past the the 10 damage camp or whatever. But I remember going back to her and being like, I'm sure I'll be good now. And I was like, I'm still not. What the [ __ ] is up with this boss? I don't understand it. And I do love that. I love how influenced they are by Seiro where there are so many bosses just like in Seiro that you get the you immediately get the notion that all right, you are one that I have to do counterattack damage to because once I break you, then you're taking massive damage. or you know if I just do a normal attack on you, I'm gonna see maybe a half of a pixel go down. I'm like, god damn, dude. You must be the strongest human, strongest creature in this whole universe. But then once you start breaking them down more, then you hit that break where bam, you knock them down, they get stunned, and then you do one normal hit and it's suddenly 12,000. It's like, oh [ __ ] that's what I needed to do this.",
            "start": 3628.6
        },
        {
            "text": "down more, then you hit that break where bam, you knock them down, they get stunned, and then you do one normal hit and it's suddenly 12,000. It's like, oh [ __ ] that's what I needed to do this. Like I just I love how many cues they took from Seiro boss fights. M uh really quick just to go back to some super super chats. Ry Guy 2141 says uh I just want to know is this not just a game of the year for the panel but also a uh game of all time OG Final Fantasy 7 Ocarina of Time Elden Ring etc. For me it deserves to be in that convo with industry changing games. Uh we have a thing on Ax the blood god called the pantheons and our rule is after five years. Yeah, I think it's too early. Call me after five years. But I do think that this can be in like the Disco Allesium tier of an indie RPG that just shocks you. And by the way, Indie Disco Allesium was our pick for the best RPG of the last 10 years. Oh wow. Like higher than Balders's Gate 3, actually. So I I do think it's really special and",
            "start": 3676.72
        },
        {
            "text": "just shocks you. And by the way, Indie Disco Allesium was our pick for the best RPG of the last 10 years. Oh wow. Like higher than Balders's Gate 3, actually. So I I do think it's really special and I do think we'll still be talking about it. Oh, yeah. Sandfall Interactive is officially on the map now. And like I said, if it's not my game of the year, it's going to be very very very high on that list. Sure. Yeah, for sure. Um um Chocolate Chocolate Fox 9 say uh is a member for 12 months and says, \"I want to thank Barrett for getting me into Persona games cuz this game is just beautiful.\" Uh the art style, the story, the music, Luna. I mean, floating around is Luna. It's just an incredible game. Um Glow Sticky uh says, \"How do a bunch of Ubisoft devs afford Wages actors Andy Circus uh and Charlie Cox and orchestral soundtrack to make this game? Loved it by the way. Worth every cent.\" That is still crazy to me. They got they were able to raise money before all the money dried up, I",
            "start": 3721.6
        },
        {
            "text": "and Charlie Cox and orchestral soundtrack to make this game? Loved it by the way. Worth every cent.\" That is still crazy to me. They got they were able to raise money before all the money dried up, I guess, and then they spent it wisely. Good for them. Yeah. Um, Ryu 2141 says, \"Also, please talk about the fade to black and then startup of Manoko's music when he's intro uh introduced before the battle.\" Oh man, that's that was a moment where I'm like, these these dudes are just like uh the the composer uh Laurian Tesar was just like, I'm gonna do whatever the [ __ ] I want and it's going to work one way or the other. I mean, dare I say like that song has like low-key Persona vibes, but it is also like this dude is just just in the studio making music. He has like emotional themes. He has big boss battle themes. There's electronica in here. There's, you know, French classical music. There's opera style vocals. And then boom, we got jazz in here, too. It just it all works, too. I don't",
            "start": 3768.24
        },
        {
            "text": "big boss battle themes. There's electronica in here. There's, you know, French classical music. There's opera style vocals. And then boom, we got jazz in here, too. It just it all works, too. I don't know. This that dude's a genius. Is the bow wow wow wow reference to it being a dog? It being named after their dog. Oh, maybe. I never thought about that. Think about that. Sorry, you just saying Bow Wow took me to Final Fantasy 7. Well, I thought the same thing as soon as I experienced this and I see like bow wow wow wow. But then but then whenever he'll catch he'll get an item, he says ow wow. So I'm like is he saying bow wow wow or wow? I don't know. He has dogish manners. He's so good. The conversation between him uh and Verso and Verso convincing him to like join him. He's like I will never join you. He's like there will be a lot of fighting though. Oh yeah, you're right. That's true. He's like the cutting between them, the the pacing of it all, their performances together, it just",
            "start": 3814.68
        },
        {
            "text": "join you. He's like there will be a lot of fighting though. Oh yeah, you're right. That's true. He's like the cutting between them, the the pacing of it all, their performances together, it just such game 10 out of 10 humor. Um CJ Splitz on says it's scary that they all have to keep male happy or she can just get up and leave and Renoir burns the painting. It's like Beerus in uh Dragon Ball Z Super. Uh Cameron Abbott says uh what up Cameron says, \"I've been of two minds and hearts of the twist about the world. While I think it lands the plane well, do you think the twist tears uh tears agency away from the now fake characters? That's been my hang-up.\" I don't think so. I mean, the characters are as real as you want them to be, I suppose. They're, yes, they're imagination, but they all have agency, right? They're they're still doing things in this world. They're I guess you could say that they were saying that Verso is a marionette. So, maybe you could say that they were a marionette",
            "start": 3860.64
        },
        {
            "text": "agency, right? They're they're still doing things in this world. They're I guess you could say that they were saying that Verso is a marionette. So, maybe you could say that they were a marionette in their own way. But this is a living, breathing world where these they're real. They're real. And that's why it's like Verso painted Verso feeling real. It's like, man, just let this man sleep. Let him let him go to rest. Yeah. I guess like again the the the reason why it didn't bother me, the reason why I sided with myel was again this wasn't just a simulated world where these characters were created 2 minutes ago and feel like they've lived forever. It's like no man they like give a [ __ ] if it's a simulation when you've lived 33 years and they still want to fight like even after like they tell Lun and Cel like what the [ __ ] is up with this world and they're like yeah [ __ ] that like we still want to fight for our existence and all that stuff. So if we found out that I was just in a",
            "start": 3909.04
        },
        {
            "text": "tell Lun and Cel like what the [ __ ] is up with this world and they're like yeah [ __ ] that like we still want to fight for our existence and all that stuff. So if we found out that I was just in a painters world right now, I'd be like, \"Well, I've lived for 37 years. I'm not going to just suddenly do different [ __ ] now.\" Like, I still got to make money and try to like live and survive, you know? Like where you get really existential and say, \"Well, maybe we are all figments of the imagination of the universe. Are we all real? What is consciousness?\" That's how I fall asleep every night. Uh Jessica Hankle says, \"I love this game. Didn't know about it until I saw the one and only Andy Cortez playing and raving about it over on Twitch. How hilarious would it be if Jeff got Robert Patson to present an award? I mean, I think it'd be even more funny if they got Robert Patson to play Gustav in the adaptation. If he dress up dresses up in the blue suit, that'd be crazy. Yeah. Saying",
            "start": 3948.8
        },
        {
            "text": "to present an award? I mean, I think it'd be even more funny if they got Robert Patson to play Gustav in the adaptation. If he dress up dresses up in the blue suit, that'd be crazy. Yeah. Saying this, I want like I I need somebody who's really good with cosplay. I want to commission an Expedition 33. I want to be Versa for Halloween. So, if you like I don't care how much it costs to make me a suit. No expense will be spared. Okay. Well, unless it's like too expensive, but like you know what I mean? I want I want the whole get up. I want to, you know, um look down. Friend of the show, uh Yousef also pointed out to me um that it's not just Robert Patson looking like Gustav, it's Pierce Brozen looking like Renoir. And when he said that to me, like in my mind's eye, I was like, I don't quite see it. But there are a couple moments like just on my phone. He sent a couple pictures where I was like, \"Sure, okay, okay, I could see it.\" I definitely had some references of that last night. I had",
            "start": 3987.92
        },
        {
            "text": "it. But there are a couple moments like just on my phone. He sent a couple pictures where I was like, \"Sure, okay, okay, I could see it.\" I definitely had some references of that last night. I had never seen it until people sort of brought it up. But the Robert, like we were worried for a while, y'all, that Tim Gettys just had face blindness cuz Tim was like, \"Who are they saying looks like Robert Patterson?\" I was like, \"Gustav in the game.\" He's like, \"Really? I don't I was like he's the only person to not notice that.\" I was like, \"Tim, that's that's [ __ ] crazy, Tim.\" And then that one actor um in [ __ ] Limitless or whatever the pill where you take the pill. The one who looked like Tom Hardy. Yeah. It's like the the American Tom Hardy that like is always like Tom Hardy diet, you know, when you can't afford actual Tom Hardy. We we were watching a movie with him and I was like, \"Oh yeah, it's the guy with that everybody says look like Tom Hardy.\" And Tim was like, \"Man, I don't",
            "start": 4038.0
        },
        {
            "text": "when you can't afford actual Tom Hardy. We we were watching a movie with him and I was like, \"Oh yeah, it's the guy with that everybody says look like Tom Hardy.\" And Tim was like, \"Man, I don't see that.\" And I was like, \"Tim, like I think you have an issue.\" Right. And then he texted me out of nowhere, out of the blue on the week and he's like, \"Damn, he does look like Robert Pence.\" I was like, \"Oh, thank God. He's okay.\" It takes him a minute. I feel like that was him trying to like save face or something. Maybe, pun intended. Uh, Yangfam uh uh trying to close out the show here says, \"Do we think major studios move forward uh adopt copy uh expedition 33 style of turn-based combat moving forward in terms of action uh pairing, all that stuff? I would call it Mario RPG uh style combat, but yeah, who would do that?\" I mean, EA certainly wouldn't. And I think a lot of people have been pointing in pointing fingers at Final Fantasy. Uh, I think there's a little bit Square Enix might take",
            "start": 4079.6
        },
        {
            "text": "yeah, who would do that?\" I mean, EA certainly wouldn't. And I think a lot of people have been pointing in pointing fingers at Final Fantasy. Uh, I think there's a little bit Square Enix might take be taking notes. Actually, I'm writing an article right now. It's like this is the game that Square Enix wanted to make for more than 10 years. And of trying to combine action and turn RPG elements. Well, exactly right. Strike the balance. And I would be surprised actually if studios were trying to copy this. In fact, I think one of the developers said that this game could not have been made at a major studio. This was a passionate project to the core. And I think if you see it being picked up anywhere, I think it would probably be a more indie projects because they're still command-based systems are having a little bit of a renaissance, but it's still, I think, a really tough sell when you're saying, \"Hey, we want to hit with mainstream audiences and we're making a command-based strategy",
            "start": 4119.2
        },
        {
            "text": "are having a little bit of a renaissance, but it's still, I think, a really tough sell when you're saying, \"Hey, we want to hit with mainstream audiences and we're making a command-based strategy system.\" It's like, whoa, whoa, whoa, whoa. Hold on there. And then yeah, the politics of it all get involved in terms of trying to pitch that to higher ups and all that. And the thing too is not that I'm giving it an excuse, but when you if a company like Square goes in that direction, there's um there's a certain scale that they ex expect. Yeah. You know, like 2 million to them is like that's a failure. Yeah. To them that is and to others it's a massive massive success. And I think that that's that I think honestly when you come down to it so far so yeah so far who knows to say at the end of the year but I mean I think that's also indicative of how broken AAA game development is where that kind of success is not success to some um and like not to talk about Veilgar but that is part of the",
            "start": 4165.52
        },
        {
            "text": "year but I mean I think that's also indicative of how broken AAA game development is where that kind of success is not success to some um and like not to talk about Veilgar but that is part of the conversation where um when sales like don't scale for what EA expects. So it's all about expectations uh for that sort of thing. Would I love to see it influence other games that are made in the future? Absolutely. in some regards. [Music] Um I would love to see I mean like Square puts out turn-based games and they again their success is scaled differently. Octopath Traveler 2 is one of my favorite games in the past. It's in my top 20 of all time, right? Um and that is because largely because of its turn-based combat system. Um, but of course like Octopath is not held to the same regard as a mainline Final Fantasy. So, um, I would love to see like Final Fantasy 17 do something like Claire Obscur. Who wants a Final Fantasy to sell 30 million copies? Yeah, at least 10. But they would like it",
            "start": 4212.64
        },
        {
            "text": "Final Fantasy. So, um, I would love to see like Final Fantasy 17 do something like Claire Obscur. Who wants a Final Fantasy to sell 30 million copies? Yeah, at least 10. But they would like it to be 30. Yeah, but what is going to sell that much regardless of genre? Really, unless you're a GTA or Elder Scrolls. Yeah, not everyone can be that level of success. Certainly not in this world. Yeah. Uh, we're going to do a quick hit of super chats and get out of here. Uh, Tim C says, \"I absolutely hate Verso's ending. The painted people have sentience. They dream and feel and it removes agency from Mel.\" Uh, Yangfam says, \"Also, shout out to one of my favorite characters in the game, the gestals. So lovable, dumb, silly goofballs. I love the gestals so much.\" The only up challenge that they that they uh are dancing at the top of at one point, it was just like [ __ ] perfect. I gave the only up challenge one try and I was like, you can do it. I've got to move on, Chad, cuz I will be here",
            "start": 4265.76
        },
        {
            "text": "that they uh are dancing at the top of at one point, it was just like [ __ ] perfect. I gave the only up challenge one try and I was like, you can do it. I've got to move on, Chad, cuz I will be here until [ __ ] 1:00 in the morning. Time to do this. I can't do this right now. Only up. Uh I also love that in the middle of like, you know, this culture of gestals who are all about fighting and all of this stuff in any way, shape, or form that like in the middle of it, there's a couple like fighting and they're just like it's like a petty like grievance. And like even in that aspect, they're just they're so goofy. And shout out to the boy um is it just No. No. No. and bring him back to life and all that stuff. Like that being a part of Manoko's uh uh side quest. It's like ah I love that little boy. Named after the other puppy. Um Andy, you're going to have to help me out with this one. Shal. Sh. Yeah. Shalai, I believe. Shalai. Uh haven't beaten it, but the 40 surprise reminds me of Star",
            "start": 4308.08
        },
        {
            "text": "boy. Named after the other puppy. Um Andy, you're going to have to help me out with this one. Shal. Sh. Yeah. Shalai, I believe. Shalai. Uh haven't beaten it, but the 40 surprise reminds me of Star Ocean till the end of the game. Should really check out that game. Oh wow. Yeah, I suppose so. Star Ocean. Star. Maybe one day. Uh Mr. Firehawks 182 says, \"Simon destroyed me, so I spent 15 hours in act three just grinding levels, going through each dungeon, unlocking specific Luminas, and got powerful enough to three hit him while taking zero damage. Game of the year.\" Hell yeah. Uh Chromosonable Chromazonable says, \"For me, I keep reliving the music kick in uh for the music kickin for Renoir's boss uh before the paintress. What a soundtrack.\" Yeah, that fight is goddamn that's a good one. Uh, and then to close out the show, uh, EJ JRPG says, \"The whole final dungeon was so hype. The music, the summoning of past expeditioners to fight alongside you, Renoir just being a father and having",
            "start": 4348.96
        },
        {
            "text": "and then to close out the show, uh, EJ JRPG says, \"The whole final dungeon was so hype. The music, the summoning of past expeditioners to fight alongside you, Renoir just being a father and having understandable actions, chef's kiss, that and the uh, monolith dungeon as well, where it's it's a reprise of the entire game world uh, was so [ __ ] cool to me.\" It could have felt really cheap being like, \"Oh, great. They're reusing assets, so fighting all these enemies again.\" But it felt right. It felt right. It it was a good thematic fit cuz I noticed I was like, \"Oh, they're redoing all the dungeons again.\" I'm fine with it cuz I just want to keep playing the game and fighting tough enemies. But then now when I think about like, \"Oh, it's it's a painted world and it's like all these drafts of different paintings, unfinished things.\" It's like, \"Oh, okay.\" Like in the monolith, you see that stuff again, it's like, \"Oh, yeah, this makes sense.\" Except when you're in the gestal village",
            "start": 4397.28
        },
        {
            "text": "of different paintings, unfinished things.\" It's like, \"Oh, okay.\" Like in the monolith, you see that stuff again, it's like, \"Oh, yeah, this makes sense.\" Except when you're in the gestal village version of it, the red foresty area or whatever, and there's that one painted cage that you can't get the third one unless unless you have an ability to unlock it. Yeah, I didn't know you needed an ability. Oh, really? I just was going around in circles over and over again. I was like, I don't know what the I never found it. And but I kept on walking near that one little lit up piece of bark and I would hear it. I'm like, it's right the [ __ ] here. And then I looked it up and uh on I think it was like an IGN guy and it was like, you need to um you need to unlock something with SKA that allows you to break those things. I was like, I didn't know that was a thing in the game. Yeah, that's crazy. What I need is I need Atraus to be like, \"We can't get that yet, Dad.\" Or something like that. You",
            "start": 4437.84
        },
        {
            "text": "to break those things. I was like, I didn't know that was a thing in the game. Yeah, that's crazy. What I need is I need Atraus to be like, \"We can't get that yet, Dad.\" Or something like that. You know, I like this game does not hold your hand at all. In some ways, it's frustrating when you get lost in a level, but overall like down with way points. Yeah. They said, \"Y'all figure this [ __ ] out.\" Oh, that's what it was. You need to get You need to find four lost gesturals. Yeah. Around the world. Okay. Thank you. I just assumed that they were just going to keep giving me stupid hairstyles. Me, too. I was I was totally up for it, too. Like, it kept being their uh little like I love the French bob. Hello. It was the uh the gestual paint. It was the gesture hair brush. Uh where they just have like the brush hair and it's [ __ ] One of my one of my homies um had those setting for um custom outfits will show up in cut scenes and finished act one with Gustav. He didn't he didn't have the",
            "start": 4480.56
        },
        {
            "text": "like the brush hair and it's [ __ ] One of my one of my homies um had those setting for um custom outfits will show up in cut scenes and finished act one with Gustav. He didn't he didn't have the beret and the glasses, but he did have the stripe shirt on. Yeah. Uh everybody, any uh last uh last thing you need to get out there before we close out the show today? Uh I love you Lun. Call me through the painting. Renaissance continues. Honestly, yeah, what a time to be alive. We're about to get Sea of Stars DLC. Oh, let's go. Text me as well. I with that everybody, thank you so much for joining us for our Clare Obscure Expedition 33 spoiler cast. Uh, if you're watching live, right after this is the Pokemon Nick 2.0 finale. question mark question mark. And then after that, we'll be back uh for the rest of the week with more live talk show content. Um each and every weekday we get together right here on the Kind of Funny Games cast uh to talk about the biggest reviews, previews, and spoiler",
            "start": 4517.12
        },
        {
            "text": "the rest of the week with more live talk show content. Um each and every weekday we get together right here on the Kind of Funny Games cast uh to talk about the biggest reviews, previews, and spoiler casts in video games live on YouTube, Twitch, and podcast services around the globe. Reminder, if you love what we do, please support us with the kind of funny membership that lets us do uh very passionate episodes like these where we get to, you know, take a moment to be like, \"All right, let's not talk about the big hottest new release this week. Let's go back and uh, you know, do a spoiler cast for a thing that we are very passionate about.\" Um, catch up on today's KFGD on YouTube or podcast services and know that until next time, it's been our pleasure to serve you. [Music]",
            "start": 4569.52
        }
    ]
}