{
    "id": 14084,
    "video_id": "LQ828Snhms8",
    "show_name": "Gameplay",
    "hosts": [
        "Nick Scarpino",
        "Andy Cortez"
    ],
    "title": "We Continue DOOM: The Dark Ages Powered by GeForce RTX 5090 and !NVIDIA DLSS4 #rtxon #geforcepartner",
    "description": "Go to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on\ntheir best-selling Carver Mat frame.\n\nGo to http://rocketmoney.com/KINDAFUNNY to cancel your unwanted subscriptions and reach your financial goals faster with Rocket Money.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1747480315,
    "duration": 7050,
    "transcript_chunks": [
        {
            "text": "[Music] two. Welcome in gamers. It's time for another journey into the visual triangle. Performance, frame rate, visuals, how pretty does it look? Resolution, how sharp does it look? With the Nvidia GeForce RTX 5090, with Nvidia DLSS 4, it's all possible. You get all worlds combined. You don't got to sacrifice one of them. If you want your game to run in 4K, you don't got to put your game on low settings. If you want your game to be getting 900 frames per second, you don't got to freaking, you know, run your game in 480p. You don't got to sacrifice. With Nvidia DLSS4, everything is possible. And today, we're showing off Nvidia DLSS4 with more Doom: The Dark Ages. We're returning to our playthrough from yesterday. Nick is pumped. The game rocks. There was so many cool moments. The game looks amazing. And um Nick, go ahead and uh you got the menu up right now. Yesterday we were able to run everything flawlessly in ultraviolence mode. Yes, we were, Andy. And it's very, very excited to be",
            "start": 0.53
        },
        {
            "text": "amazing. And um Nick, go ahead and uh you got the menu up right now. Yesterday we were able to run everything flawlessly in ultraviolence mode. Yes, we were, Andy. And it's very, very excited to be back in the Doom world. Where are we at right now? Do we Okay. Yeah, we're good to go. We got quality. We have frame generation on a two because we only have a 2K monitor. Uh so we don't want to waste those frames cuz we can't utilize them. Well, we're only Yeah, the monitor gets 165 hertz, which was the frame rate, you know, jacks you up to like 200 frames per second anyway. when we had four times on when you go to DLSS frame generation, DLSS deep learning super sampling uses AI to not only recreate the image of your game to make it run better. It's really hard to make games run really smoothly at 4K with running with the most insane visual uh settings possible. So DLSS will drop down the resolution of the game down to 900p or 1080p or 1200p and then uses AI to recreate that image to make",
            "start": 64.88
        },
        {
            "text": "at 4K with running with the most insane visual uh settings possible. So DLSS will drop down the resolution of the game down to 900p or 1080p or 1200p and then uses AI to recreate that image to make it look just as sharp as the native 4K. And then with DLSS frame generation uses Nvidia's AI, their deep learning super sampling to put frames in between frames where there weren't uh frames to begin with. So instead of getting 90 frames per second, now we're looking at 150, 160, 170 frames per second. And the game is just so gorgeous. It's running incredibly well. So scroll scroll down, Nick. Uh we're in the settings menu right now for Doom: The Dark Ages. And check it out. We're running at freaking Ultra Nightmare with uh the highest texture pool size. What a ridiculous name for a setting, by the way. Uh unbelievable. Of course, other games, low, medium, high, ultra. This has Nightmare. Now it has Ultra Nightmare. Nightmare and Ultra Nightmare. Never would I have thought I would have be",
            "start": 119.36
        },
        {
            "text": "the way. Uh unbelievable. Of course, other games, low, medium, high, ultra. This has Nightmare. Now it has Ultra Nightmare. Nightmare and Ultra Nightmare. Never would I have thought I would have be able to choose Ultra Nightmare. I'm not an ultra nightmare kind of guy, Andy. This is me stepping up to a new level. Yeah. I don't I don't prefer those anyway, you know. But you get Ultra Nightmare and then suddenly we're still with frame generation, we're still getting 200 frames per second, 190 frames per second. It's ridiculous. It's It's Blackmagic. Um, and I I don't understand how it's happening, but it works and it looks great. It's definitely voodoo. But let me tell you, let me sorry. Let me check it. Okay, good. My mouse is where I need it to be. Well, you have to be in the game to check that out. My mouse is where I need to be. Look, it goes from one side to the other. No, you have to. My mouse is where it needs to be. Kevin, yesterday I'm trying to get Nick and and Mike on a gold",
            "start": 175.2
        },
        {
            "text": "that out. My mouse is where I need to be. Look, it goes from one side to the other. No, you have to. My mouse is where it needs to be. Kevin, yesterday I'm trying to get Nick and and Mike on a gold standard of what sensitivity is. Cuz I told him, you know, a lot you ever, you know, you've been in here with Mike when he's like, I want to be on controller now. I didn't like the way keyboard, mouse felt. And it's like, well, Mike, you're trying to play basketball with different sized basketballs every time because your DPI is always different. Things are never the same. Wait, but I got Nick to do the 360 test and look at that. And now he felt so comfortable. Here's why it keeps happening though. I think it's wrong. Cuz I keep having to move my my keyboard just a little bit over to make it happen. Well, I mean, it doesn't have to be a perfect I need you to make bring a ruler in and tell me where my 360 box is or else this science is is is not real. As long as your, you know, your",
            "start": 212.16
        },
        {
            "text": "it happen. Well, I mean, it doesn't have to be a perfect I need you to make bring a ruler in and tell me where my 360 box is or else this science is is is not real. As long as your, you know, your character has a, you know, does a 360ish, that's what we're looking for right now. We're playing Dune the Dark Ages. Thank you everybody for hopping in and hanging out with us. Nvidia, thank you for sponsoring us. But I thought Mike said he likes the how the developers have said it. That's it's just there's nothing more frustrating, you know? Nothing at all. You know, I I I I I keep telling Chad, you know, Chad's like, \"Oh, man, he's he's content gold.\" You know, he's, you know, I God, he's the he's the best. It's like, you know, it's it's the best when you don't know him personally. Yeah. But it's even better when you do, but you have to push through. No, I I disagree. I disagree. I disagree. I think when you know him personally and the the the the content is being made at your behest, that",
            "start": 248.32
        },
        {
            "text": "even better when you do, but you have to push through. No, I I disagree. I disagree. I disagree. I think when you know him personally and the the the the content is being made at your behest, that is uh where you don't want to be. Andy making some strong points. Yeah. Yeah. So now it's like let's get them on the same sensitivity. Nick was shredding yesterday. He feels super confident now. 800 DPI is the gold standard. Delete all the other DPI settings in your m in your, you know, settings cuz I know what happens. Uh Kevin, this little DPI button on the mouse. I know that's getting clicked accidentally and suddenly it's set to 40,000 and your mouse is moving crazy fast and you think that that's the only option you have. No. Delete them all. 800 DPI. You got to go in there, change the setting. Make that a copy or paste button. Yes, exactly. Exactly. Oh, looks like there's a little secret over there, Nick. What's happening over there? Thank you to S Rob for 44 months off support.",
            "start": 294.48
        },
        {
            "text": "setting. Make that a copy or paste button. Yes, exactly. Exactly. Oh, looks like there's a little secret over there, Nick. What's happening over there? Thank you to S Rob for 44 months off support. Appreciate you, S Rob. I don't know if I can make that jump, big dog. Yes, you can, brother. Come on. You're the Doomslayer, dog. Way to go. Inverted Soul says, \"Hunch Showdown was really fun to watch outside. You and Mike went crazy.\" We had some good runs. We had Mad Mike popping off. Yes, popped off. Um, incredible lighting in Doom the Dark Ages. ID IDTE 8 which is the engine that is running uh this game is just so freaking efficient and smooth and a lot of times you know Nvidia will have to make up for maybe some of the inefficiencies in in in different games engines. In this case they are working in perfect tandem. We're getting 200 frames per second right now running at 1440p with on ultra nightmare. It's ridiculous. And now the metal begins. You sure you just shouldn't play games on",
            "start": 338.56
        },
        {
            "text": "working in perfect tandem. We're getting 200 frames per second right now running at 1440p with on ultra nightmare. It's ridiculous. And now the metal begins. You sure you just shouldn't play games on default settings? Oh god. Mike says this is how the devs wanted it. That's how they designed it. I used 1200 with my mouse, then turned down the in-game sensitivity. And Sean, that's great. because you kind of know what you're doing. For me, it's just like I'm just trying to give them a baseline. 800 DPI and then make sure your character does a 360. You don't think from one there, huh? You don't think Sean's a little crazy? Like, why set it to 1200? Well, cuz cuz he knows what he's doing. cuz you could do 1,200 then you can make your sensitivity crazy slow in the game and it matches up you know cuz the craziest uh you know FPS gamers Kevin will use uh like in Valerant or Overwatch right I have 800 DPI and I set my sensitivity to like six right the craziest esports people will put their uh",
            "start": 386.64
        },
        {
            "text": "cuz the craziest uh you know FPS gamers Kevin will use uh like in Valerant or Overwatch right I have 800 DPI and I set my sensitivity to like six right the craziest esports people will put their uh in-game sensitivity to like 0.1 to where like they have to move their arm crazy amounts to like even move the character an inch, you know? It's wild. Nick currently has the upgrade where if he throws a shield inside the dude, it shoots out it repels bullets. Look at that. Oh my god, that's so freaking cool. Nick is shredding in this game, man. Nick is playing on the third the highest the the hard difficulty cuz it's easy, medium, hard, and then super. He's not playing on hurt me pling. He's playing on the one above that and he's freaking shredding. The music is just shredding as well. The parries are on point and more importantly, the visuals are on point. God, it just feels so damn once you just hit a flow state. Yeah, you just kind of get it. You just kind of zone out for a second. God, I",
            "start": 449.04
        },
        {
            "text": "are on point and more importantly, the visuals are on point. God, it just feels so damn once you just hit a flow state. Yeah, you just kind of get it. You just kind of zone out for a second. God, I saw you go into another dimension there. Where was I? How long was I gone for? Call my mom. Thank you, Apocalypse Cow, for 9 months of support. Is here for the dark ages. Clear the gates. Thank you, Apocalypse Cow. Crit. I got a crit hit. You got a crit hit. Got to get some of these ads. Remember, you have your you have your three melees. That dude's real strong. This dude's strong. Oh yeah, these perfect pairs. Light up that armor. Break it. Keep shooting it. Light it up. Oh, yeah. It's break. There we go. Oh. Oh [ __ ] There more dudes spawning. Oh yeah. Oh man. Nice. Oh, going for the triple punch. Nick, you got him. Smoke him if you got him. Boom. Boom. Boom. Did not do it. He's a healthy boy. This guy is Yeah, he's got some Oo, good block. Careful. Oh, that's so scary. Is this guy just",
            "start": 514.96
        },
        {
            "text": "punch. Nick, you got him. Smoke him if you got him. Boom. Boom. Boom. Did not do it. He's a healthy boy. This guy is Yeah, he's got some Oo, good block. Careful. Oh, that's so scary. Is this guy just a mega? Yeah, he's he's one of the big dude. There we go. Come on, chew up that heart. Your soul is mine. That's huge. That's so massive. Memory increase. Look at that. Call the cleanup crew. Call the janitor. Man, you popped the hell up. It's time. It's time. Is Hermy Plenty normal? Yes. Yeah. I use 200 DPI and it takes three full length mouse pads to do a 360 for I'd like to use like one DPI and be able to go from one side of the room to the other to make a 360. possible. I mean, that's how the Valorant pros play, man. It's crazy. The Counter Strike pros have like the slowest sensitivity. You need it. I have like the middle ground cuz, you know, I'm not I'm not like them. They're not built like that. Damn, you're just shredding. You're just built better, dude. I want to go in there.",
            "start": 608.12
        },
        {
            "text": "You need it. I have like the middle ground cuz, you know, I'm not I'm not like them. They're not built like that. Damn, you're just shredding. You're just built better, dude. I want to go in there. Maybe it's to your left. Maybe the secrets to your left. Too late. Never mind. Too late. I get back in. Oh, you can make that jump. There it is. No. You want to go down there? Yeah. Hell yeah. Oh, shoot. He's popping off at me. Oh, there's people in here. Some free money. Oh, ghost in the darkness. Sorry about Kilmer. I don't have mouse mouse real estate, so my DPI is 1,600. How much mouse real estate you need? Yeah. What do you How much what do you need for mouse real estate, dude? I mean, I really I mean, I'm only ever saying like a foot wide coming. It's like a mouse pad. You still have one extra life sigil. You're doing great. Or you can use mass acceleration. That's That's for freaks outlandish. Nobody does that. That's like having That's like having freaking emotion smoothing on your",
            "start": 667.76
        },
        {
            "text": "extra life sigil. You're doing great. Or you can use mass acceleration. That's That's for freaks outlandish. Nobody does that. That's like having That's like having freaking emotion smoothing on your TV. Is that where like if you move fast it moves even faster? Yes. That's crazy. That's for freaks. That's crazy. It's cool though. But again, it's like motion smoothing, you know? Yeah. But really, it's like using technology that like someday we'll we'll understand. It's against God, you know. It's the next step. Oh, God. I don't know if I ever had a a foot wide mouse pad in my entire life. I mean, that seems pretty standard, right? Like I mean, not if you're like if you started gaming in the '90s when mouse pad technology just wasn't there yet. And maybe when they were more vertical. Yeah. When everything was just like kind of small. Back when I was a kid, that's all we had. You know, you just have 3in head. Like real men don't need mouse pads. You just raw dog it on the table. Oh,",
            "start": 737.44
        },
        {
            "text": "When everything was just like kind of small. Back when I was a kid, that's all we had. You know, you just have 3in head. Like real men don't need mouse pads. You just raw dog it on the table. Oh, remember when lasers got upgraded? Um, no. Oh, yeah. Like lasers on mouse. Oh, I thought you meant just in general. You know, I didn't follow that specific. You talked so much about laser. I can't scared. Those are the lasers we thought you were talking about. Like those type of lasers. way. No, but like there was a big thing and I think if I'm not It might not be the MX series, but there was some like where they could be on glass and stuff like that. They were like it's a new type of laser. Oh man, that was a big day at Best Buy when that tech It was like a red dot, right? You'd pick up your thing and be like red dot and and then one day they were like, you know what? It was huge for us. Yeah, we we've gotten past it and it's like whoa. Yes. I used to sling those mice, man. That was crazy.",
            "start": 796.64
        },
        {
            "text": "and be like red dot and and then one day they were like, you know what? It was huge for us. Yeah, we we've gotten past it and it's like whoa. Yes. I used to sling those mice, man. That was crazy. You got to heat it up more. There it is. Once you see it blink, you know, the guy just chewed me out. Thank you once again, Apocalypse Cow, for your 9 months of support. SRO, 44 months. We are streaming this courtesy of Nvidia sponsored stream, showing off their latest tech. Uh-oh. Oh. Oh. Oh my god, the blind parry. He's popping off. He's heating up. Get out of here. You're playing great, man. You're You have that defensive first mindset. You got to have that instinct, man. Always be defam. Great job. I got some upgrades coming my way, my friend. They call me upgrade. They do call them upgrade. They say, \"Hey, upgrade.\" Since when? Yeah. You got some upgrades coming? They're just now. Oh, yeah. Did you hear Did you hear what the guy said? He kind of growled. Upgrade. Upgrade. Is that",
            "start": 843.68
        },
        {
            "text": "They say, \"Hey, upgrade.\" Since when? Yeah. You got some upgrades coming? They're just now. Oh, yeah. Did you hear Did you hear what the guy said? He kind of growled. Upgrade. Upgrade. Is that Sylvester? That's just the look. Upgrade. Yeah, they got him for this. He's cheap now after Tulsa King got cancelled. Oh [ __ ] He got popped in the mouth right there. Here it is. Bam. So awesome. He's just so weighty, but he moves so fast. Oh, he's like Bo Jackson. I'm pretty sure Bo Jackson is the Doom. You think he did the You think he did all the uh stunts for this? Yeah, I think so. All the motion capture. All right. I think he's just under the mask. Oh, you think it's just him? I think it's Bo Jackson is the Doomslayer. He's just an immortal dude. I'm going to go. Bye, Kevin. Lav 30 for 30 by Bo Jackson was amazing. You don't know Bo, dude. That was amazing. You don't know Bo. Arguably one of the best. What level are we on? I don't know. Level five. Four or five? Yeah, something like that.",
            "start": 913.12
        },
        {
            "text": "Jackson was amazing. You don't know Bo, dude. That was amazing. You don't know Bo. Arguably one of the best. What level are we on? I don't know. Level five. Four or five? Yeah, something like that. Oh [ __ ] Throw that shield, man. Get all these little stupid losers out of the way. Remember, now that you have that upgrade where the it's a wider radius of All right, I forgot. That was good. That was nice and cautious. Down here. What if I told you that the Doomslayer was one of the best athletes, multisport athletes we had ever seen in the world. That not only could he run the football, he could hit home runs. Oh, and kill demons. Secret weapon acquired. Little weapon skin. Little skinny for your uh little plasma pistol. Boom. The one thing I will say when they go back and they do the highlights and the 30 for 30 for the for the Dooms Slayer, they're going to be like, he had one big deficiency that he could never really figure out, which was is how fast he could switch weapons. Yeah,",
            "start": 964.4
        },
        {
            "text": "and the 30 for 30 for the for the Dooms Slayer, they're going to be like, he had one big deficiency that he could never really figure out, which was is how fast he could switch weapons. Yeah, he's very slow. You can't be great at everything. No, I know. But like you're going to have some weak spots. Try, you know, like. Boom. Boom. Oh, you see a little secret little wall to the right. Oh, to your left, Peter. Yeah. Boom. Oh, I think you already killed the guy here, actually. Yeah, I think I think this just gets me back down to where I was before cuz I kind of made that jump. Look at the map that not only could he see the open field, but he could see the opening to hell. 30. This is 30 for 30. ESPN's 30 for 30. Hell on hell on wheels or Yeah, we'll figure it out. No, not what I wanted. Still pops off though. That was good. Yeah, I just like the, you know, you start getting a feel for your guns. It's hard to get out of your comfort level now. Johnny Boss, happy Friday, boys. Happy",
            "start": 1038.72
        },
        {
            "text": "Still pops off though. That was good. Yeah, I just like the, you know, you start getting a feel for your guns. It's hard to get out of your comfort level now. Johnny Boss, happy Friday, boys. Happy Friday to you, Johnny Boss. $2 super chat. Thanks for supporting us. You're kind of funny. What the hell? What the hell, man? Oh, this guy's got a turret on me. No, he's just behind the shield. Oh, another shield, dude. You got to switch guns. This This is meant for a lot of people. Sucks. the upgrade to it. Way cooler though. You You'll get it later on. I don't think you ever killed that dude. Nope. I'm going to run right past them and get some of these approaching the bridge to the dragon's aviary. Oh, a little secret. Codeex. Do you think it's the same codeex from Man of Steel? Uh, I doubt it cuz in every video game. Okay. Yeah. You word gets used often in games. Oh, it's just a general Yeah, it's a pretty general like in world lore thing. Yeah. Where did this dude? I got so much",
            "start": 1104.44
        },
        {
            "text": "doubt it cuz in every video game. Okay. Yeah. You word gets used often in games. Oh, it's just a general Yeah, it's a pretty general like in world lore thing. Yeah. Where did this dude? I got so much upgrades coming my way. Where is this guy? He was way the hell, but who cares a [ __ ] Just move on. All right. Well, I mean, he's now he's going to tell everyone that I'm, you know, a wuss. Oh, the deuce. I mean, he has nobody else to tell you. Just you killed them all. Yeah, but when he's going to get on Reddit like thinks the doom slayer is a wuss right past me. I think he's overrated. Actually is overrated. It's over. Oh. Oh [ __ ] Oh, he's got spider legs. Oh god. Crab legs. Damn music. Champion. Champions have gold armor which take reduced damage from your weapons. Parry hell surge attacks uh will build up stun once the sun beer is full attack. the vanguard exposed flesh to deal heavy damage. Careful because that green acid on the ground will wreck you and the parries will always",
            "start": 1163.36
        },
        {
            "text": "uh will build up stun once the sun beer is full attack. the vanguard exposed flesh to deal heavy damage. Careful because that green acid on the ground will wreck you and the parries will always lead to the green acid and you will get destroyed. Ooh, could use just a little bit of health now. Why is his health not giving me health? It is. I disagree. I mean, you saw it. Agreed. Disagree. There we go. Let's rock, baby. [ __ ] What the hell? Where'd my shield go? Um I Well, you would block so much damage that it was like not usable for a while. Oh, I didn't know that I had it like that cuz if you just block the red stuff like it has a stamina bar. It has a health bar that needs a while to replenish. Shoot the cooter. Shoot the cooter. Shooter cooter. There it is. I'm doing this kind of damage to this guy. Crushing it. Crushing it. Bust out that AR, dog. [ __ ] Hold on. Oh yeah. Oh yeah. Uh oh, I died. You just die so unceremoniously. Well, when you have life sigils. Yeah. Like Yeah.",
            "start": 1220.72
        },
        {
            "text": "to this guy. Crushing it. Crushing it. Bust out that AR, dog. [ __ ] Hold on. Oh yeah. Oh yeah. Uh oh, I died. You just die so unceremoniously. Well, when you have life sigils. Yeah. Like Yeah. Cter. Oh yeah. Oh yeah. Oh yeah. That's good stuff. Now keep watching out for the acid piles. Do not step in them. Even if there's a parry there, don't go. Nope. Go where I want to go. Oh, it disappeared luckily. chat. Nick's good at video games. Nick is good at video games. Yeah, he first tried this sucker on hard difficulty. Give me a little kiss. Beautiful. Incredible. Pey pop off. 63 months of support. What a pey popoff. I feel like this might be one of those days where I wish we had those weird knockoff candies that people bring into the office sometimes. You know, where someone's like, I came back from from Denmark and here's a candy. You know what? Damn. I should have brought you kind of weird. I should have brought you the little gift package from uh the Liza Pave because they because",
            "start": 1311.92
        },
        {
            "text": "back from from Denmark and here's a candy. You know what? Damn. I should have brought you kind of weird. I should have brought you the little gift package from uh the Liza Pave because they because they're Korea based studio. They brought a bunch of like Korean uh snacks. I don't like that I got 90% on this. Dan, I mean, look, that is that's true goober. That's why we call him upgrade. That is why we call That is why they call me upgrade. Watch. Will you listen closely as I run past people? They go, \"That's my boy. Upgrade. Upgrade. Upgrade.\" Oh. Oh. Okay. So, I did that one. Yeah. You did those little challenges. Got my little doll. You can also like skip all this, too. I like to see it. It is rewarding to It is a paddle. This is the first time, you know, like this is the first time I've really cleared a level. Yeah. So, I feel very good about it. Let's skip it, though. You're right. By knockoff, Nick means international. Yeah, that is true. Well, you know how it's like no matter",
            "start": 1405.28
        },
        {
            "text": "really cleared a level. Yeah. So, I feel very good about it. Let's skip it, though. You're right. By knockoff, Nick means international. Yeah, that is true. Well, you know how it's like no matter what you eat, they're always chalky. You get it, you're like, \"Oh, another peanut butter chalky thing.\" I guess that's all they chalky. I don't know. Oh, they always have these little like little nuggets that look like gold bars, but you put them in your mouth and they suck all the moisture out of your mouth. Straight up peanut butter. No, I don't think I've ever had one of those. Why this? Remember how good Nick was on the golf course? This is that again, dude. We need to go golfing again. I'd love to. Mainly cuz I need to I I need to really reclaim my pride cuz I was very I that's the worst I've ever played in my life. And now I know how to play again. And I regret to inform you I'm insane. Look how good the quality is of this. The lighting on his body, the shadows underneath it. Like God,",
            "start": 1453.52
        },
        {
            "text": "ever played in my life. And now I know how to play again. And I regret to inform you I'm insane. Look how good the quality is of this. The lighting on his body, the shadows underneath it. Like God, that looks so freaking great. Incredible visuals. Look at those things, dude. Those look like the dragons at the Naz Ghoul ride. Yeah. Are these my guys? No. No. Be nice to each other. Be nice to your brother, the Doomslayer. Is father in the chat? Is what is father in the chat right now? No. Okay. No, I don't see father in the chat. Okay. Just trying it out. Oh, shoot. I'm going to I'm going to ride this thing. Yes, dog. You're going to let me ride the dragon. The proverbial dragon. And also it's 220 which means it's time for me to eat an apple. Oh did you bring two? No. Okay. Why would I know? Did you bring an extra for me? I just didn't know. I didn't think to bring two apples. No. Now you know next time. See here. Let's do controller miscellaneous. Oh, is dragon needing to be up uh",
            "start": 1503.04
        },
        {
            "text": "know? Did you bring an extra for me? I just didn't know. I didn't think to bring two apples. No. Now you know next time. See here. Let's do controller miscellaneous. Oh, is dragon needing to be up uh inverted? Yeah, it needs to be inverted for me. But there you go. What kind of apple do we have today? Any a jazz apple? Oo, because I'll tell you what, I don't know how many preservatives they're pumping these jazz apples with, Nick. Mhm. I bought this apple like two weeks ago and it is perfectly crisp. Probably not great for my insides, but probably not. It has not gotten soft or moldy or gooey or it's amazing. Oh, that still didn't work. What am I missing here? What am I missing? Invert look. That's for controller on uh miscellaneous. Where is the dragon look? Dragon vertical look. Invert. Yes. Why is that not working? Invert. Drag. Yeah. Hit. Yes. Right there. Yeah. Yeah. Yeah, I did. Why is it not working? Is it Wait. Do you have to apply it or something? I don't know. Maybe. But",
            "start": 1577.04
        },
        {
            "text": "Yes. Why is that not working? Invert. Drag. Yeah. Hit. Yes. Right there. Yeah. Yeah. Yeah, I did. Why is it not working? Is it Wait. Do you have to apply it or something? I don't know. Maybe. But it's I go back to it. It's there. Oh, you were in controller. You weren't in mouse. Ah, there you go. Thank you. Sorry. My bad. My bad. My bad. My bad. My bad. There you go. See? Just double checking. Oh, that's good. There he goes. Yes. There we go. Got to move my sleeve so I can fly my dragon. Great. The light looks pouring through here. Nvidia ray tracing showing this off as DLSS 4 deep learning super sampling DLSS4 giving you the best of all situations. Whether you want the best frame rate, visual quality, or resolution. We're playing in 1440p right now with we're getting 270 frames with frame generation and it's insanely smooth. These moments are insane. Oh, that's that. Yeah, I I imagine Q was going to be there. Yeah, like they didn't need to have a level where you just ride a dragon,",
            "start": 1638.48
        },
        {
            "text": "generation and it's insanely smooth. These moments are insane. Oh, that's that. Yeah, I I imagine Q was going to be there. Yeah, like they didn't need to have a level where you just ride a dragon, but it's fun. What I love is how I think the game is so perfectly paced because they know, all right, the player really, really, really wants to be the Doomslayer, but if you're the Doomslayer for 110% of the time, that may kind of get monotonous with what you're doing. So, let's break it up. Let's have you do something different. But it's still fun. So you use your Yeah. When you right click, you will kind of hover around and you got to use a space bar to dodge the green charges. And when you do, your gun gets stronger cuz that's how science works. Yep. And then now Oh, it's set to control. I set that to mouse 5. That's fine. As long as it prompts me, I'm going to barf flames into this guy's mouth. The doom slayer. Oh, Peter. Does it matter? Got it. I'll figure it out. So, these will show",
            "start": 1695.12
        },
        {
            "text": "set that to mouse 5. That's fine. As long as it prompts me, I'm going to barf flames into this guy's mouth. The doom slayer. Oh, Peter. Does it matter? Got it. I'll figure it out. So, these will show you the spaces where you have to dodge. Some of them are vertical, some of them are horizontal. Ah, no. I'm just really not timing that right. Yeah, it's You got to go up there. I got to go up. Yeah. See, you see the empty spot is up. Thought it was the left. Oh, I see. They change it up to make it challenging. But the green ones are the only ones that charge up your gun. Well, that one didn't even give me one. Oh, I had to go up. That was up. Yeah, there it is. There we go. That's crazy. Your charger's still up. Bam. There it is. This is a fun mechanic. It's a cool little like uh Yeah, like little directional parries or directional dodges. Well, they had a very similar thing for when you were in the Mecca. Yeah, which was cool. But except these are telling you, all right, this one's up",
            "start": 1754.68
        },
        {
            "text": "little directional parries or directional dodges. Well, they had a very similar thing for when you were in the Mecca. Yeah, which was cool. But except these are telling you, all right, this one's up now. All right, left, you know, but I like the dodge equals kind of a amplifier for your weaponry. And then you'll see a b So you'll see a bunch of these dudes in the world. Yeah. And if you shoot them, they drop gold bars for you. I don't think I'm actually hitting this guy. You are? Yeah. Yeah. Give them all to me. Bogey down. Did I get him? Yeah. Oh, yeah. I got to go back and get him. What monitor do you use? Uh, we use a NZXT monitor. It's a 27 in Oh, no. The the Gold comes to you. Yeah. Yeah, I know. We're using a 27 in 1440p monitor uh with 165 hertz. They're nice. Very good monitors. Now, what do I use at home, chat? Let me tell you, the best pers I've ever made in my life. And wave goodbye to the Hi. That's what I thought at first, but then he kind of flies back and kind of just",
            "start": 1818.72
        },
        {
            "text": "Now, what do I use at home, chat? Let me tell you, the best pers I've ever made in my life. And wave goodbye to the Hi. That's what I thought at first, but then he kind of flies back and kind of just hovers around. Oh, that's sick. He's like my guy. He's like a cool cat. He doesn't want to be touched, but he wants to be around you. Mhm. What do I use at home, chat? 4K Alienware OLED 240 Hz. Yeah, you have to. Holy [ __ ] it's incredible. How big is it? 32 inch. Of course. Beautiful. No real point having a 4K unless it's 32, right? Uh-huh. Just want to look around a little bit, see what's up. I'm going to use the dragon. I love the rhythm of this whole section that's about to come up cuz you're doing like these shooting things that you just did, those little dodges and stuff and then you land, get off the dragon, go kill [ __ ] get back in the dragon, do the more shooty [ __ ] land. It's It's a really cool back and forth. Look how fast this dude is. So awesome. Assault engaged. These",
            "start": 1880.28
        },
        {
            "text": "land, get off the dragon, go kill [ __ ] get back in the dragon, do the more shooty [ __ ] land. It's It's a really cool back and forth. Look how fast this dude is. So awesome. Assault engaged. These cut scenes are crazy. They're in game. It's ridiculous. They're not even like cinematics pre-rendered. Oh, it's Cloud City. This is cool. So, go to the ship on the right. Yeah, right there. And they'll all have the things that you got to like Yeah, there you go. There's the gunner down there. Oh, look at that. I got to land in this thing and kill it. Well, you have to like do the charge dodge thing for three different things cuz the eye of Mordor the eye of Saron will try to shoot at you as well. There we go. And then the back gunner. Oh, I see him. I got hit. But I got his ass. And these are faster shoot shots. There we go. There we go. Perfect. See you later. Peop 63 months of support using Prime. Did you know that if you have Amazon Prime, you have Twitch Prime? That was nice. Yeah, we",
            "start": 1926.24
        },
        {
            "text": "faster shoot shots. There we go. There we go. Perfect. See you later. Peop 63 months of support using Prime. Did you know that if you have Amazon Prime, you have Twitch Prime? That was nice. Yeah, we did it. See, I just need to focus. It says, \"Let's go Knicks. Big game for the Knicks tonight.\" Oh, I heard about that. Three three series. Or is it 3-2, chat? What is it? It's 3-2 against the Celtics. 3-3 series for the Nuggets and the Oklahoma City Thunder. That's an awesome series. Give me your gold, dude. This is just a wild game mechanics just built into your Doom game. And these are just like, you know, optional. You don't got to do this. Oh, I want it. Yeah, he wants it though. And you shoot faster when you Yeah. do the the shift. Come on, man. Give me your gold. Am I hitting this guy? I'm not even hitting him. You are. Here you are. Okay. So, question says, \"I live in NYC. Shit's popping off already.\" That's awesome. Yeah. There we go. Come on. He's close. He's close. He's close.",
            "start": 2004.08
        },
        {
            "text": "I'm not even hitting him. You are. Here you are. Okay. So, question says, \"I live in NYC. Shit's popping off already.\" That's awesome. Yeah. There we go. Come on. He's close. He's close. He's close. Give me what you got to offer. Yeah. Yes. Gold. All right. I'm gonna actually follow that path because there was a heal down here somewhere. Nope. It's gone. There's a lot of heels everywhere. There's one up there. You see the rings all over the place? Yeah. Now you can land in there. Oh, it's my ship now. This is my ship. Damn, you just really got in the belly of the beast, huh? Great parry. Come on, man. I'm That's good stuff. Come on, man. You know he's doing great, chat. Come on, man. This is hard difficulty for our boy Nick Scarpino. Going back up here. Make sure I'm going the right way. The right way. Yes. All right. You're doing great. There should be a shrine down here as well. Down there. Cool. Got to check for secrets. I had to keep them safe. God, I'm so proud of him right now,",
            "start": 2087.48
        },
        {
            "text": "The right way. Yes. All right. You're doing great. There should be a shrine down here as well. Down there. Cool. Got to check for secrets. I had to keep them safe. God, I'm so proud of him right now, Jack, cuz I'm seeing the whole wrist like whipping to get the Oh, it's I'm so proud of him right now. I've never been more happy. Throw that shield. Oh, there we go. Ah, I get that good parry. Careful. There's a dude on your right with his shields. Is there? Yeah. Keep shooting. Not break it. There we go. A close [ __ ] It was close. Oh man, it's going to be all the way back there. No, I think it's pretty close. Yeah, I hope it's right where I land. Yeah, I think it's right where you landed. Yeah. Yeah. Let's do it. You You have to appreciate one of the few wrists in the lab that isn't injured yet. It's true. I have a virgin wrist. Oh, I didn't want to do that. I'm honestly scared, Creed, that when I try to go hoop, how much my left wrist will hinder me. But I got to hoop first. You got",
            "start": 2166.72
        },
        {
            "text": "yet. It's true. I have a virgin wrist. Oh, I didn't want to do that. I'm honestly scared, Creed, that when I try to go hoop, how much my left wrist will hinder me. But I got to hoop first. You got to hoop. Well, you're not going to know until you hoop, you know. Well, it's just like it it just Yeah. Like I don't like that. I don't like that. I mean the look the follow through is follow through is flawless. Follow through is just like gooseenecking. It's more of like just errant movements that I'm not aware I'm doing that I do all the time and then I'll be very aware of them like oh [ __ ] that hurts actually. Go see a doctor. Dude, I spent one of my lunch breaks last week for about 3 hours. That's an exaggeration, but I spent so much time calling at least like 12 different doctor's offices. One lady at one point was like, \"No, we're not taking new appointments cuz uh she's retiring. She's not taking new patients cuz she's retiring.\" Great job, Nick. Uh a shrine back there, by the way.",
            "start": 2266.72
        },
        {
            "text": "One lady at one point was like, \"No, we're not taking new appointments cuz uh she's retiring. She's not taking new patients cuz she's retiring.\" Great job, Nick. Uh a shrine back there, by the way. Yeah. Yeah, I know. I'm just kind of getting away from it for a hot sec. Oh, we'll go back in a second. This has the dark knight blink blink blink blink blink blink. And then at one point they were trying to refer me to the Amazon health thing which is like all tella health stuff but it's like I want to go see somebody, you know. Yeah. It's what a nightmare all of this is. It's a [ __ ] nightmare. All right, let's see what we got here. I need my mom to just schedule somebody. Mom, help me. My mom's birthday, by the way, yesterday. Oh, nice. Have you belated Mrs. Cortez? Okay, let's see what this Andy, you got to step back. Come on, brother. Come on. got the craziest release of all time. A lot of people think uh Texas Euroep if you actually want to watch us play hoops, we have a video up on",
            "start": 2354.88
        },
        {
            "text": "Andy, you got to step back. Come on, brother. Come on. got the craziest release of all time. A lot of people think uh Texas Euroep if you actually want to watch us play hoops, we have a video up on the kind of funny channel where we played 4v4 basketball if you just look up kind of funny basketball. It's a hilarious video, but it wasn't until that video where a lot of people told me that I have an ugly shooting form. Huh. I was like, \"Oh, I guess it is. I guess it isn't the most attractive shooting form.\" Oh, I mean, it doesn't do the most attractive as long as it gets the job done. I kind of agree with them, but you know. Okay. What should I do here, buddy? All right. So, you got money. I got a lot of money. Uh, I would go shield probably again, maybe melee. Like, what does this shield upgrade do? Shield recover faster from taking damage and also recover faster after breaking. So, you like blocking normal [ __ ] a lot. That's not bad. Now you have 100 coins left and you can only Oh,",
            "start": 2400.16
        },
        {
            "text": "do? Shield recover faster from taking damage and also recover faster after breaking. So, you like blocking normal [ __ ] a lot. That's not bad. Now you have 100 coins left and you can only Oh, so this costs killing multiple FOD enemies with shield throw will empower your next shield charge allowing it to deal increased damage to the primary target. I don't know if you should use the red the ruby the size of a tangerine on that. Yeah, maybe I have Can I use that somewhere else? Uh yeah, eventually the the weapons will do that, but you can upgrade to the next one. Oh, you don't have enough money? I think you go combat shotgun. Okay. But you don't have enough money for it right now, so just save it. Maybe check out what the melee upgrades are. I always kind of forget. It's the one at the bottom. Oh, I already Yeah, that one finisher. Increase the damage of the final hit in your power gauntlet combo. Yeah, let's do it. Do it. Or uh Okay. What's up? Well, we did it. Oh, did we? Yeah, you",
            "start": 2446.08
        },
        {
            "text": "Oh, I already Yeah, that one finisher. Increase the damage of the final hit in your power gauntlet combo. Yeah, let's do it. Do it. Or uh Okay. What's up? Well, we did it. Oh, did we? Yeah, you did. Oh, you did. Okay. Do I have one more 50 upgrade? No. And what else am I going to use a ruby for? The weapons like the higher the higher tier level ups will have other we'll use rubies. Oh, [Music] Andy. Okay, that's a good bit. It just it just felt like um it felt like getting an appointment for an in-person one was not easy. Look, Creed, I don't got that Shawn Marian form, okay? Don't you dare invoke that name when you're talking about my form. Don't you dare. I got to look at my little pinned things. Hold on. How do I look at my campaigns? Um, go hit hit tab. Oh, tab. Yeah. Uh, right there. Yeah. Cat and mouse. Chase and destroy three Hellfighter ships. Yeah, I got to get another one of those. Dismount the dragon at two secret landing zones. Okay, we'll do that. Dispatch all the",
            "start": 2493.04
        },
        {
            "text": "there. Yeah. Cat and mouse. Chase and destroy three Hellfighter ships. Yeah, I got to get another one of those. Dismount the dragon at two secret landing zones. Okay, we'll do that. Dispatch all the cultists. We got to get that, too. Andy, the coffee is hit. I need to go to the restroom real quick. I'll be right back. You want to talk to the chat for a sec? We can run out. Let's run out real quick. Chat, we'll be right back. Be right back after a word from our sponsors. Go take go take a stretch, get some water. People will see you. This episode is brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized sunglasses that won't break the bank. Shady Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people. Their shades have durable frames and crystal clear optics, making them the perfect choice for all outdoor adventures. They",
            "start": 2568.76
        },
        {
            "text": "offering a world-class product rated five stars by over 300,000 people. Their shades have durable frames and crystal clear optics, making them the perfect choice for all outdoor adventures. They have hundreds of options to choose from, so you're bound to find the perfect pair to match your style. Take it from Tim Gettys, who rocks his shady rays every day, going on Pokémon Go Walks out and about SF looking dope. If you don't love your shades, exchange for a new pair or return worry-free within 30 days. There's no risk when you shop. Their team always has your back with personal and fast support. Exclusively for our listeners, Shady Race is giving out their best deal. Head to shadyra.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. That's shady.com promo code funny. This episode is brought to you by Auraf Frames. Every day we're taking photos from big events to silly moments. But doesn't it sometimes feel like",
            "start": 2609.12
        },
        {
            "text": "300,000 people. That's shady.com promo code funny. This episode is brought to you by Auraf Frames. Every day we're taking photos from big events to silly moments. But doesn't it sometimes feel like all of your favorite photos are just stuck on your camera roll? Wouldn't it be great to have an easy way to share and enjoy them with friends and family? That's where Aura comes in. Aura makes it effortless to upload unlimited photos and videos directly from your phone, so your favorite memories are always within view. Plus, you can personalize and preload an Aura frame for a unique and special gift. We love Aura Frames in this office. Roger has one at home he got for his fiance's birthday, and she absolutely loves it. It takes about 2 minutes to set up the frame using the Aura app. Add unlimited photos and videos, and invite as many people as you want to an Aura frame. There are absolutely no hidden fees or subscriptions. And for a limited time, listeners can save on the perfect gift by",
            "start": 2652.72
        },
        {
            "text": "photos and videos, and invite as many people as you want to an Aura frame. There are absolutely no hidden fees or subscriptions. And for a limited time, listeners can save on the perfect gift by going to aura.com to get $20 off, plus free shipping on their best-selling Carver matte frame. That's a frames.com, promo code aura 20. Support the show by mentioning us at checkout. Terms and conditions apply. This episode's brought to you by Rocket Money. With prices going up on just about everything lately, being smart with your money isn't just a good idea. It's essential. But managing subscriptions, tracking spending, and cutting costs can feel overwhelming. Lucky for you, Rocket Money takes the guesswork out of it so you can easily make smart decisions. Rocket Money has helped multiple members of Kind of Funny learn they were still paying for things they totally didn't even realize. Rocket Money is a personal finance app that helps find and cancel your unwanted subscriptions, monitors",
            "start": 2694.8
        },
        {
            "text": "of Kind of Funny learn they were still paying for things they totally didn't even realize. Rocket Money is a personal finance app that helps find and cancel your unwanted subscriptions, monitors your spending, and helps lower your bills so you can grow your savings. Rocket Money's dashboard gives you a clear view of your expenses across all of your accounts, and then you get alerts if bills increase in price, there's unusual spending activity, or if you're close to going over budget. Rocket Money has over 5 million users and has saved a total of 500 million in canceled subscriptions, saving members up to $740 a year while using the app's premium features. Cancel your unwanted subscriptions and reach your financial goals faster with RocketMoney. Go to rocketmoney.com/kindfunny today. That's rocketmoney.comkindfunny. rocketmoney.comkindofunn. And we're back. And we're back. And we're back. And we're back. Time to take on the doom. And we're back out there in hell. This dude looks like",
            "start": 2737.28
        },
        {
            "text": "rocketmoney.comkindfunny. rocketmoney.comkindofunn. And we're back. And we're back. And we're back. And we're back. Time to take on the doom. And we're back out there in hell. This dude looks like Batman. We We could probably find the better wording to fit that in the verse. I thought it was good. Actually, I think time will tell when they look back at the lyrics and be like, \"Actually, this dude looks like he made the right choice.\" Well, I think we could word it quick. I think, you know, give me another one. He looks like Batman or something. You know what I mean? Give me another one. And we're back. And we're back. This dude's a bat. Oh, wow. See, I had you I had you all wrong. So, you want to get locked in a room with Greg? What you should do is lock yourself in a room with me and we make the album. I mean, I don't see why both can't happen. It's true. You know, because you'd quit because you would not allow that to happen. God, I'm just watching this dude whip around the mouse",
            "start": 2781.08
        },
        {
            "text": "make the album. I mean, I don't see why both can't happen. It's true. You know, because you'd quit because you would not allow that to happen. God, I'm just watching this dude whip around the mouse like crazy, Chad. It's so great. I just feel my I can feel my wrist tightening. I just want you to know that part. I love it. Part of the reason why you're probably having that problem. No, my left hand is the one that [ __ ] up. I'm just letting you know if you're right, my non-dominant hand, it's because for one, just to move the mouse one centimeter on the screen, I'm getting such a forearm workout right now. It's great. It's great, man. I don't know about that. Oh. Oh [ __ ] Oh, this is one of them hard ones, Nick. He's got the icon above his head. I don't know what that means. I don't care. It's one of the ones that takes forever to kill cuz they give you a big upgrade. Nick doesn't give a damn though. This dude kind of looks like he's in the Mutant Football League. He definitely does.",
            "start": 2830.72
        },
        {
            "text": "It's one of the ones that takes forever to kill cuz they give you a big upgrade. Nick doesn't give a damn though. This dude kind of looks like he's in the Mutant Football League. He definitely does. That is Holy [ __ ] Holy [ __ ] Oh, there goes the armor. Ah, I died. Damn it. Let's go back to one more time. Let's rock, baby. Put the music a little bit louder, John. Thank you. Thank you. Thank you. Thank you. Ty, thank you for subscribing for 4 months with Prime. Appreciate you using your Prime on us. We are sponsored today by Nvidia, showing off the latest and greatest tech. Nick is playing Doom: The Dark Ages with our Nvidia RTX 5090 using DLSS4. DLSS4 gives us incredible visuals running at a super high frame rate because of frame generation. And we are also playing at 1440p again with full rate tracing. It's insane. Remember your third melee hit is Oh, yeah. stronger now. Well, maybe it's got him first. Oh, there we go. There he is. Okay. Look at all those spikes in his body. Holy",
            "start": 2884.72
        },
        {
            "text": "full rate tracing. It's insane. Remember your third melee hit is Oh, yeah. stronger now. Well, maybe it's got him first. Oh, there we go. There he is. Okay. Look at all those spikes in his body. Holy [ __ ] That was incredible. Nice. What did he give me? More health. Um I think he pushed up your maximum shield. No, your maximum like armor. I think it's over there. And we're back. I'm on my dragon. His name is Ted. Ted is my dragon. Ted. Ted. Ted is my dragon. Ted. Ted. Ted. Ted went to Stanford. Ted. Ted. He didn't want to be a dragon. Ted. Ted. But his dad made him a dragon. His dad told him he had to. His dad. He was like, \"No, I want to be a dentist. I want to be a dentist. I like teeth.\" Man, I think we're several steps away from, you know, what made the first song so good. A little too much improv there, you know. Okay. Oh wow. I'm going to blow this guy's face off. That was like me uh when I ate a [ __ ] ton of flaming hot fries and then got really drunk on a bunch of different",
            "start": 2991.48
        },
        {
            "text": "much improv there, you know. Okay. Oh wow. I'm going to blow this guy's face off. That was like me uh when I ate a [ __ ] ton of flaming hot fries and then got really drunk on a bunch of different alcohols and then vomited. It was just fire coming out of my throat. It was crazy. Jesus. It was a bad time. A bad time. I mixed like a bunch of different beers. This is awful. I love the look in Nick's eyes. That's a man who ripped us, dude. 100%. Way to go. Breaking that shield. Nice. Great. Done. Time for Mordor. Ooh, these are fast. Careful. There we go. My ship now. I land on it. I'm a god. Oh, and it's and now you start to land on it. Oh, I got to get that other gold thing. It's only if I forget to get one more ship. I got to do my daily challenges. My fitness pal. [Music] Luckily, this dude not as strong as the other one. Get out of town. Oh jeez. Yeah, that shield upgrade is nice. Now, you look at something like this and you go, it's great environmental design, but like somebody",
            "start": 3081.12
        },
        {
            "text": "dude not as strong as the other one. Get out of town. Oh jeez. Yeah, that shield upgrade is nice. Now, you look at something like this and you go, it's great environmental design, but like somebody really just thought, hey, let's design the back of this to look pretty, too. You know how Apple designed the inside of their phones to look good even though no one saw them? Oh, right. Right. You have to appreciate the people that made this Doom World. You mean like the game designers or I mean like in world like someone thought about it. Just because we're killing everyone doesn't mean our ships can't be pretty. Yeah. Yeah. Like I don't understand it. Let's fight another one of these guys. Let's rock that. Oh god. Oh. Oh. Now, this isn't one of them boss guys, but he's still tough. He is one that you don't want to run away with. You want to stand and fight. Stand your ground. Oh, that was bad. Oh, nice. Holy [ __ ] Give me everything you own. I'm your daddy. I'm your father. I'm your",
            "start": 3164.24
        },
        {
            "text": "one that you don't want to run away with. You want to stand and fight. Stand your ground. Oh, that was bad. Oh, nice. Holy [ __ ] Give me everything you own. I'm your daddy. I'm your father. I'm your crusade. or back Chrisa. Ted is my dragon and he wants to be a dragon, but he really wants to be a dentist or poor imperial orthodontist, whichever one makes more money and has a better 401k K. He was plaza is has an easier commute to where my son goes to school. Oh man, you just Man, he's crushing them right now. Get him, Ted. Chrisa says it's crazy cuz he doesn't even know I'm here. I can't do the chat. He asked for you earlier. His father here. His father here. Oh, father. Oh, what's that thing, Andy? Yeah. Andy, what's that thing? Oh, Andy, open up. See what's inside. That's the crit spot. We call that the critterus. Oh, I made the wrong thing. Ah. Oh. Ouchie. Ouchie. Inside of it now. I can't figure out this freaking riff chat. When like the music kicks in. Oh, there it is. Anyone",
            "start": 3237.84
        },
        {
            "text": "We call that the critterus. Oh, I made the wrong thing. Ah. Oh. Ouchie. Ouchie. Inside of it now. I can't figure out this freaking riff chat. When like the music kicks in. Oh, there it is. Anyone play this on console? I started there, but maybe PC is where it's at. Oh, Baba is me, dude. PC is like, if you have a decent enough PC, you got to run. The awesome thing is that the game Doom is very like the the IT techch engine is very efficient. So, obviously it looks amazing because we have an RTX 5090 and it's a incredibly insane GPU, but it can run on older machines and still look really darn good. I would play on PC cuz keyboard mouse. His name is Ted. Dead. I didn't even notice that you weren't pairing there, but you were still shooting the eyeball and Yeah, I really didn't do that right. That was cool though. Yeah, it was wrong though cuz I didn't lock on. I was like, why isn't this lock not working? Then I just do what I do with everything else in life. Just brute force it until it",
            "start": 3329.28
        },
        {
            "text": "That was cool though. Yeah, it was wrong though cuz I didn't lock on. I was like, why isn't this lock not working? Then I just do what I do with everything else in life. Just brute force it until it does what I need it to do. Remember when Kev was like, you guys remember when they upgraded lasers? I I'm telling you, I need I need Evan Yan to just break out the four different moments of him just just brain farting, saying sentences that don't quite work. That is so fun. that shield. His name is Look at that invisible dude. You think you're invisible down there on the bottom right? You're not. I can see your silhouette. Are there drops here? If there are probably Yeah, Eddie Pup, cuz drops are usually on by default. So, welcome into some sick ass gameplay there. Yeah, there definitely are drops because I was able to get drops on mine as well watching. What are you saying? What are drops? Um the they'll give away free They'll give away um little like I think a Doom skin. You get like a",
            "start": 3426.96
        },
        {
            "text": "drops because I was able to get drops on mine as well watching. What are you saying? What are drops? Um the they'll give away free They'll give away um little like I think a Doom skin. You get like a different character skin. You should look into that. Change it. Make your dude look different. Make your guy look like uh Whiz Khalifa or like Bugs Bunny. Yeah. They got Whiz. Bunch of different IP. They got Wiz in this game. Yeah. Yeah. You can break it. Break his shield. Nice. It's a first person game. You didn't see your dude. How about in the cut scenes? Otter cog. Ever thought of that? You also get a weapon skin, I believe. Give me a new gun. Give me a new gun. I like to use this. Ted would like to use this. I'll show you, Ted. Oh, this is my This is one of my favorites. This is it. This is the upgrade to the little plasma plasma gun. Yeah. So, you hit F to switch it between this and the other one. But this one, this is it. Has a little bit slower shot, but it's just it's shreds,",
            "start": 3499.2
        },
        {
            "text": "is the upgrade to the little plasma plasma gun. Yeah. So, you hit F to switch it between this and the other one. But this one, this is it. Has a little bit slower shot, but it's just it's shreds, man. Yeah, but they can be slower when you're missing. And it looks cooler, dude. Oh, drops aren't working today for some reason. Oh, that's stupid. I think this is it. This is where we go. Yeah, you can go all the way through there. I'm just checking for Just checking for secrets. Looking around and seeing what's what. What up, Ryan? Daddy. Yeah, it's it's awesome, Ryan. Got a great pace to it. Not only just the movement of it all, but in terms of levels not outstanding or welcome. Oh [ __ ] he was just caught in there with that dude. E, the crotch. Ew. Get your crotch away from me, dude. But I think you start off in a good spot. I'm going to imagine this is a uh Oh yeah. Just What was that? Well, I thought it was going to be a big boom and I'm going to die again. You got to just like right",
            "start": 3575.36
        },
        {
            "text": "think you start off in a good spot. I'm going to imagine this is a uh Oh yeah. Just What was that? Well, I thought it was going to be a big boom and I'm going to die again. You got to just like right click, you know. I do the I do the shield charges when there's a big ass group. Oh, freaking nasty. Oh, that was crazy. I didn't know my shield could do that. Now, but remember, you could also like shoot those plasma shields with this gun and they shoot. Oh, shoot the plasma shields. I was like, \"Oh, yeah. Yeah, I got you.\" And it stuns everybody else around him, too. [Laughter] I bet there's a way to turn that off, Quinn P. If you have uh if I bet you there's there's going to be mods that lets you um adjust [Music] that. Oh, that was nasty. I just got to get into it. Yeah, dog. Just do a right click. Look at zone on somebody and shield bash them, man. I am God. God. Oh, Chad. I rolled credits on blueprints last night and I think I'm just going to watch secrets from here on out cuz I",
            "start": 3636.96
        },
        {
            "text": "right click. Look at zone on somebody and shield bash them, man. I am God. God. Oh, Chad. I rolled credits on blueprints last night and I think I'm just going to watch secrets from here on out cuz I don't want my whole life to become that game. Is it that good? Well, it's just like it's one of those things where when when if you hit the credits, you beat the game, but you don't you didn't really beat the game. You're like probably 40% of the way down. There's so much to do and so many unlocks and secrets. How long it take you? I don't know. Like 55 runs or something. Oh, is it like a Dead Cells game? Uh, it's a it's a rogue light, but it's not like a combat game. It's just a crazy puzzler. I don't know yet. Nitrogen, it's up there. It's up there. I'm going into the belly of the beast right now. Evan says, \"Didn't think uh Nick could play this so well. This gives me hope as I'm about to enter my 40s. Oh wow. Thank you for that backhanded compliment. Oh wow. Oh wow. Thank you for that.",
            "start": 3717.68
        },
        {
            "text": "now. Evan says, \"Didn't think uh Nick could play this so well. This gives me hope as I'm about to enter my 40s. Oh wow. Thank you for that backhanded compliment. Oh wow. Oh wow. Thank you for that. Wow. Thanks for that. Thanks. Thanks for saying that. Hey, thanks for your time today. Oh, thank you, Miss Lady. I don't know how to break. Oh, I guess you hit that and then you break. Nice. Hell yeah, brother. The eye of Sauron. Oh, there's one more to shoot at the back, I believe. And at the back of the boots. Oh, the ship that you Yeah. Yeah, I know. I'm just getting back there. Or maybe it's the gunners on the other side. No. Where the hell? I guess not. Oh, maybe I Oh, now you can land. Oh, you have to land over there. That's right. You don't land in the ship. Bit of a different thing. It's fine. It's all good. Real Zelda. Thanks for two years of support using your prime on me. Appreciate you re real zealot using a problem on kind of funny games. Did you know that if you have another",
            "start": 3797.12
        },
        {
            "text": "fine. It's all good. Real Zelda. Thanks for two years of support using your prime on me. Appreciate you re real zealot using a problem on kind of funny games. Did you know that if you have another one? By the way, Evan's probably going to break his hip cuz he's 40. I'll wait for the music to slow down after you beat the chapter. You're getting close. Those guys running at me, too. Enforcers are high priority targets that maintain a group of empowered demons. These empowered demons are faster, have more health, and can be quickly reinforced. Killing the enforcer will stop. Okay, so this guy's like giving them a buff. Where is the enforcer? Uh, it's the it's the blue. It's the that dude. Yeah, the dude with the thing above its head. The the dude with the the left the the guy riding the Oh, it's that guy. Okay. Yeah, he's got the thing above his the floating flag. Oh, you bury the dude behind you. Yeah, I feel him coming. No look. I felt his ass coming. There shield. Yeah. I got to",
            "start": 3880.52
        },
        {
            "text": "Oh, it's that guy. Okay. Yeah, he's got the thing above his the floating flag. Oh, you bury the dude behind you. Yeah, I feel him coming. No look. I felt his ass coming. There shield. Yeah. I got to figure out when my shield is like upgraded like Oh yeah. When my shield is like buffed, you know? It's hard to know when that is. Oh yeah. Now I got to kill this horse. Ah, going for the triple melee. Oh yeah. See you. See you. Oh, the super shotty. Oh, the double barrel. Look at that thing. You think you could hold that thing with one hand? Absolutely not, dude. Yeah, I cut either. It just be like, dude, the double dudes. Are you a Twitch primer set? No. of [ __ ] Amazon Prime gives you a free freaking honor. Make sure you set a [Music] reminder. Make sure you show subscription love. This just got real. This just got real. Shotty's nasty, huh, folks? We're real now. I didn't think it was going to be that big that easy. [Music] Damn. Sure would be cool if you could get that. It would be",
            "start": 3938.08
        },
        {
            "text": "got real. This just got real. Shotty's nasty, huh, folks? We're real now. I didn't think it was going to be that big that easy. [Music] Damn. Sure would be cool if you could get that. It would be sick. Now, Nick, what did Superman say in the most recent trailer? War and hope. No. [Applause] What's the tagline for the movie? Don't look up. Look up. Look up. Oh, nice. I don't think at any point in the trailer he ever said look up. I just want But he said like eyes up here big. It's kind of Yeah, he's like eyes up here. But then he he falls down. No, he flew up. Say the rebellion. Save the trees. Did you Are you watching Andor? No, I haven't watched anything. I've been gaming, okay? I've been [ __ ] gaming too much. And every time I want to sit down, it's like just way too late. Sorry I couldn't uh join you for Hunt Showdown the other night by the way when you guys were playing it. We played last night. Yeah. Sorry I couldn't join you for that. Um I didn't see my invite come through",
            "start": 4035.08
        },
        {
            "text": "couldn't uh join you for Hunt Showdown the other night by the way when you guys were playing it. We played last night. Yeah. Sorry I couldn't join you for that. Um I didn't see my invite come through until it was too late. Actually, I don't think I saw my invite come through for that. Um did you get an invite or which was I did you guys? I don't know if you guys sent me one or not. Was there Well, let me tell you how the night went, Nick. I bet it was fun and frustrating. Let me tell you that. I bet it was annoying and frustrating. Well, I was going to play Doom and like always 17 people pop in the chat. Mike wants you to play Hunt Showdown. Mike wants you play. Mike wants it. Mike's doing that. Mike wants you to play. [ __ ] Guys, go to Andy's chat and let him know right now that I needed to play Hunt Showdown and call Chris Anka father. The guy can't breathe without me getting 17 messages about what he's doing. So, you went so naturally you capitulated because after a while he just",
            "start": 4129.2
        },
        {
            "text": "to play Hunt Showdown and call Chris Anka father. The guy can't breathe without me getting 17 messages about what he's doing. So, you went so naturally you capitulated because after a while he just beat you. Well, I was like, well hunt sounds fun. like I'm down for that. So, I downloaded it. Took forever. Um, so, you know, maybe look elsewhere for why an invite didn't pop through to you. Now, did he also start off the stream by saying, \"We're going to pop off. You know, we shed the dead weight.\" That was something that was said. Oh, did okay. But like, yeah, he didn't play with me that day, so he couldn't have been talking to me, right? No, I think he just meant like, you know, you know. Uhhuh. Whatever whoever the third may have been. What did he mean? Like, Roger, the the dead weight has been shed. That's all he said. I don't know really know who he was talking about. Yeah, I don't know who he was talking about. Huh? That's what he said. Yeah. Maybe we can call him too. Yeah. Yeah.",
            "start": 4169.68
        },
        {
            "text": "been shed. That's all he said. I don't know really know who he was talking about. Yeah, I don't know who he was talking about. Huh? That's what he said. Yeah. Maybe we can call him too. Yeah. Yeah. Get back on Ted. Try to, you know, figure it out and do a little investigation. Oh. Oh, you actually Oh, so you actually pursued this? I think we can. I think we can look into it. I wasn't sure he was talking about either. Okay. That was pretty messed up. That's crazy to call someone dead weight. Or maybe he was just referring to like that ugly shirt you guys got him. Which, by the way, check out today's Gregway chat. Yeah. Uh, you're going to want to see it if it is what I think it is. It's great. I uh move to position. Well, I just wanted to not only clear my name, but I also wanted to maybe do some photoshops to see how Mike may have looked with and with, you know, with that shirt with different shirts on, you know. And did I use the the did the image I use to put the shirts on him, was",
            "start": 4226.48
        },
        {
            "text": "do some photoshops to see how Mike may have looked with and with, you know, with that shirt with different shirts on, you know. And did I use the the did the image I use to put the shirts on him, was it the image you sent me one day on Slack where it was just Mike in his full tracksuit of him walking out of the restroom when he just like Triple X. You just sent me a random photo of him. What should I do for Andy? What do we um Okay, so you have the Oh, yeah. We need that speed loader. Yeah, that's a that's a great one to have. That's 250. I'm going to wait for it though. I'm going to wait for it. Very expensive. I want to wait for it cuz that's nasty. I will say I got that though. And then I ended up switching back to the other shotgun because of the Oh, should I get that? Uh you can I can get that now, I think. No, you have you have one more upgrade to go. Uh so burns applied by the combat shotgun called demons to explode on. I think that's the one that I got. So, demons would like",
            "start": 4277.16
        },
        {
            "text": "get that now, I think. No, you have you have one more upgrade to go. Uh so burns applied by the combat shotgun called demons to explode on. I think that's the one that I got. So, demons would like blow up and hurt other people. Oh, okay. Uh, this one. So, it you could switch between either one of these skills, but like the whole thing is you're buying one, right? Ooh. Ooh. Ooh. Also, the laser one. Here's a good one for the laser one. The second laser. This thing. Uh, it it rock stuns enemies a lot and then it'll do like chain lightning, which sick. We kind of want that. Yeah, I think it's a real good one. Let's get that. You'll start shooting enemies and as they're about to prep their attack, they'll just kind of like get stun and rocks. I have two rubies or tie. Um, keep them. Okay, let's have some fun, ladies and gentlemen. As my friend the Ninja Turtles once said, Kowabanga Beautiful. I love that you can do it even in the air. [Music] Na, [Music] Nick, I'm going to need you to do",
            "start": 4333.52
        },
        {
            "text": "have some fun, ladies and gentlemen. As my friend the Ninja Turtles once said, Kowabanga Beautiful. I love that you can do it even in the air. [Music] Na, [Music] Nick, I'm going to need you to do something for me right now. Yeah, buddy. What's up? This is asking a lot of you. Yeah. Hit the escape button and go to restart map from checkpoint. What? Just restart from checkpoint. What? You're just going to restart this battle? Okay. Oh man, made a lot of headway there. The music's got to be bugged cuz it was just doing like the normal kind of music. Okay, and maybe And now let's go about hop in and see if things pop off. Remember do a jump and like a right click shield bash. Did get that upgrade. Yeah, all the purchases happen. Yeah. Oh, nope. No. What the hell? I remember this being like a rocking moment. Maybe it wasn't. I don't [Music] know. Brandon Bance became a kind of funny member on YouTube. Thank you, Brandon. I Oh, what the hell is that thing? There we go. There we go. Yeah,",
            "start": 4389.36
        },
        {
            "text": "a rocking moment. Maybe it wasn't. I don't [Music] know. Brandon Bance became a kind of funny member on YouTube. Thank you, Brandon. I Oh, what the hell is that thing? There we go. There we go. Yeah, the big boss had to come out. Chris, did you ever play play Metal Heller? I know you saw me played a decent amount, but Metal Hellinger is so good. Careful with the poison on the ground. [Music] Ah, I poisoned. Throw your shield. So much poison. I got to get through it. Oh, father. This guy out in the open. Do some damage. Oh, shoot. those explosive barrels near it, man. Oh, yeah. That hurt him. That hurt him real good. [ __ ] Shot it from that range. Oh, the parries. Shoot the lace cuz those are the things that need to go next. Oh, I thought you were dead. I thought I was a dead. I was goner. I need a better gun though. Hold on. Let me go to this the power gun. Yeah. Check out the stun. Let's see how the stun works. See if it works [Applause] now. Oh yeah. Oh, throw your shield at the",
            "start": 4483.52
        },
        {
            "text": "I need a better gun though. Hold on. Let me go to this the power gun. Yeah. Check out the stun. Let's see how the stun works. See if it works [Applause] now. Oh yeah. Oh, throw your shield at the legs. Oh, nice. Yeah, you can see him getting stunned. Yeah, [Music] gamer. Come on. Nick's on it, chat. Get in my bag. Nick is on it. Do the Ross with me. Let's pick out some clothes. Let's pick out clothes in the Ross with me. And after maybe we can hit up the Cracker Barrel. Donald Cracker Barrel. That Cracker Barrel always sounds so bougie. I'm going to be nervous going into it. So you have to hold my hand. Wait, what? Cracker Barrel bougie? What are you talking about? Isn't Cracker Barrel like kind of cool? The [ __ ] No, I don't know what a Cracker Barrel is. You've never heard of Cracker Barrel? I've heard of it. I just always thought it was like something cool I can Oh, no, man. It's like a place for like old white people. They love Cracker Barrel. Oh, I Andy, it's your cosplay. Oh,",
            "start": 4596.4
        },
        {
            "text": "Barrel? I've heard of it. I just always thought it was like something cool I can Oh, no, man. It's like a place for like old white people. They love Cracker Barrel. Oh, I Andy, it's your cosplay. Oh, yeah. The sweaty leather just stinky. You're never getting the smell out of That's what that Seinfeld episode with the BMW. That's like the door that Darth Maul puts in. You know, the that purple gate. It's like the gate that Qui-Gon and Obi-Wan are trying to get through. It is. And it's it's just another one of those reminders that guys in the Star Wars universe there is no ADA compliance because there's no way that those as a service gate would ever be allowed to happen. Mhm. Like what are we doing? What's it doing? Why is there a pathway? That's one of those things we were like, \"Oh, there have been layoffs here.\" Yeah. Like whoever's job this was. Yeah. Didn't do this. Yeah. Tim hasn't been around for a while because of the tariffs. Ignite the charges. Ignite. So amazing. Look at that",
            "start": 4667.84
        },
        {
            "text": "have been layoffs here.\" Yeah. Like whoever's job this was. Yeah. Didn't do this. Yeah. Tim hasn't been around for a while because of the tariffs. Ignite the charges. Ignite. So amazing. Look at that guy. It's pretty. This theme is awesome. I love this dramatic [Music] theme. That was sick. Oh, he's got his own little shield. I can't wait to boss battle that guy. Mhm. That guy's cool, too. That's my dude. Now, zap me out of this trance, dude. Is that going to zap me out of the trance? No, but now they have the heart of the dragon. The heart of Argent. [Music] This would make the craziest movie. It really would. Viking knight hell slayers. So cool. Chapter complete. 48%. Not bad. Passing grade. Well, there's a lot of places to fly there. That place had a lot of flying areas that are really kind of tough to find. Okay. One out of two. Now, if I go back, do I have to do the whole level all over again, or can I just jump back in, find those? Um, you probably have to redo it, right? Yeah,",
            "start": 4714.88
        },
        {
            "text": "kind of tough to find. Okay. One out of two. Now, if I go back, do I have to do the whole level all over again, or can I just jump back in, find those? Um, you probably have to redo it, right? Yeah, you would have to redo it. Bummer. It's weird that it doesn't just load me into the next thing. Why is that? What am I hitting wrong? Um, there's another option there. I I kept on making that mistake, too. We should be ready to leave as soon as the cruisers are done. It doesn't look comfortable. Very good. Get to your ship. How much upper body do you think this dude does on a weekly basis? For the command station, everyone is evacuating. So, you are holding on to it until we get to the location. A new vault is being built. Then let the Slayer guard it. Slayer. If what they say is true, then this is a part of our heritage, not the makers. Veilen, are you seeing anything? Are the makers the red leather guy? No, they're the the big guys with no arms. Yeah. Okay. Maybe he didn't survive. M A K",
            "start": 4797.44
        },
        {
            "text": "is a part of our heritage, not the makers. Veilen, are you seeing anything? Are the makers the red leather guy? No, they're the the big guys with no arms. Yeah. Okay. Maybe he didn't survive. M A K Y R. I saw that's how it's the coolest way to spell British. It's the British way of spelling it. Yeah. You know how they spell toilet with like two extra T's and like an E for no reason. Demonic threat level. I always put weird [ __ ] in their candy. What's up with those cheesits? They still around somewhere? Yeah, I brought them in cuz I didn't order the right ones. These are the makers. Should we launch the Slayer now? Put those back in your Put this back. I don't like that. The Sentinels will be overrun. Then what about us? Shout out to Nvidia for all their amazing tech, sponsoring the stream, and making this look so damn good. Just a fun day all around. Looks so incredible. [Music] Oh, I'm I'm free now, guys. I have a voice now. Yes. I'm going to kill this maker. I'm going to get",
            "start": 4860.16
        },
        {
            "text": "stream, and making this look so damn good. Just a fun day all around. Looks so incredible. [Music] Oh, I'm I'm free now, guys. I have a voice now. Yes. I'm going to kill this maker. I'm going to get myself some maker ass. Little Chris. Chris is leaving because this is where he left off in the Bye, father. I can tell every time. I'm one more away from him never talking. Yeah. Oh, yeah. For sure. That's it. That's where I want to go. I want to go up to the line. Oh, I'm pushing through. Don't you fire that up on me, maker. You can't stop the Slayer. I'm the Slayer. Oh, look at that. Just get the [ __ ] off. Just punch harder. You just parried that zap. Get that thing out of there. Rip it out of your chest, dude. Yes. Yes. The power's freaking outs. Us. Those look like Star Trek controls. Yeah, the UI. Yep. [Music] It would appear that the Slayer no longer wishes to be detained here. Shield power down to 35%. Should we terminate his life functions and destroy the con maker's prized",
            "start": 4921.04
        },
        {
            "text": "Yeah, the UI. Yep. [Music] It would appear that the Slayer no longer wishes to be detained here. Shield power down to 35%. Should we terminate his life functions and destroy the con maker's prized possession? 34. So long as he has that tether on him. 33. We can still have a hand in. We definitely have the sound effects too quiet here. Yeah, I know. But it doesn't matter. Beautiful. Look at how amazing these ships are, dude. Sick, Andy. Damn, that's nasty. Come on. You going to tell me you don't dress Mike up or Kevin up like that ship and you ride into Comic-Con on him? Shave my head. Yeah, you got to shave your head. A large horde is headed toward your position. We are launching the Slayer now. Please send forces immediately to ensure our safety. Thank you, Bishop Creed. Damn, what a shot. That's so sick. That's awesome. This cave kind of looks like uh fruit roll-ups. Oh, okay. Yeah. Yeah. Take a look next time. You'll see it. The gods. Engaging deflector shield. It's a massive",
            "start": 5006.08
        },
        {
            "text": "a shot. That's so sick. That's awesome. This cave kind of looks like uh fruit roll-ups. Oh, okay. Yeah. Yeah. Take a look next time. You'll see it. The gods. Engaging deflector shield. It's a massive force. Three legions worth. Remember the shields in Phantom? Wait, how did I get back down there? Did I fall? Did they jettison me? Mhm. Oh, cool. I missed that. I was too busy talking. Let's rock. I thought it was going to be a real big moment, but it wasn't. I'm just here now kicking it with my homies. Yeah, I just I felt like there was always going to be another title card. Yeah, the donut slayer. Okay, these guys just having it hanging out. Don't the tanks look like from they're from Phantom Menace? They really they I mean literally are the tanks from Phantom Menace. Remember when you play that Jedi game where we play that on the stream and you hated it? That's was not fun. Yeah. [Music] That's cool. Look how good this looks. Where does it want me to go? Um, want me to go that way?",
            "start": 5084.24
        },
        {
            "text": "that Jedi game where we play that on the stream and you hated it? That's was not fun. Yeah. [Music] That's cool. Look how good this looks. Where does it want me to go? Um, want me to go that way? Oh, over there. Yeah, that makes sense. Toward the giant ship that's everyone's walking like you can like go to the left and and No, go. I'm just looking at it. Okay. Look at its butt. It's pretty. Here's the observation I made. Nick, stand next to these people. Yeah. Let him out. Why are they so tall? Right. What the [ __ ] What the hell? Am I like Wolverine? Is this like if you pull this guy out, is he like this? You might be 53, 56. That's wild. I don't like that. Cuz I always of course get that mix up like, \"Oh, Master Chief is 8 foot 10 or something crazy like that, you know, cuz he was genetically bred and yeah, engineered and all.\" Not bred, but yeah, those shields, the blue thing. Got it. Okay. Oh, they're sentinels, not humans. So they're big like you. Oh [ __ ] That's Well, they're",
            "start": 5161.44
        },
        {
            "text": "bred and yeah, engineered and all.\" Not bred, but yeah, those shields, the blue thing. Got it. Okay. Oh, they're sentinels, not humans. So they're big like you. Oh [ __ ] That's Well, they're still taller than me. Yeah, I don't like that. So everyone knows like that's they're not big like me. They're like a solid foot taller than me. Look at how tall this guy is. Look at his ey line versus my ey line. He's looking above me like he's arrogant. I need I need to just like stop moving in one of these moments just to like soak in that bit. Look at this weird dude not knowing how to run. Is this the moment? Is this the moment you want me to stop? Is this it? I like that one guy kind of like can't get through here. Hey man, move. No problem. States, you got that little free Twitch skin. Hell yeah. Uh the there's a couple of moments coming up where the rooms are super smoky and foggy and the light is coming down from up top and the big dudes the the big fat dudes that kind of walk they look",
            "start": 5230.08
        },
        {
            "text": "Uh the there's a couple of moments coming up where the rooms are super smoky and foggy and the light is coming down from up top and the big dudes the the big fat dudes that kind of walk they look insane with the lighting on them. It's beautiful. Roger skipping for traversal to the mo cap. Weaponry deployed. Do you think a Doom movie is possible that they'll oneote main character? 100%. And that's what I I wish the Yes, this is my favorite melee. Morning Star. Yes. I wish the tone of the game leaned more into the kind of goofy I I think the tone of the game is like too serious. And what I want more is, you know, okay, there's a horde of demons coming after you. Uh there's a horde of demons on the way. Massive ships. There's no way you uh nothing could kill it. And I want the Doom guy to be like they haven't met me, you know? I just want like some shitty just some shitty like Dominic Toretto. Some 80s vibe. Let's take these guys out. Yeah. I want a little pinch in Duke Noob because the",
            "start": 5270.32
        },
        {
            "text": "like they haven't met me, you know? I just want like some shitty just some shitty like Dominic Toretto. Some 80s vibe. Let's take these guys out. Yeah. I want a little pinch in Duke Noob because the the 2016 had a bit of that. 2016 had some moments where it's like how the hell can we get out of the situation? And he just grabs a gun. And he's like, and you're like, \"Oh, that's how lot of acid.\" Oh, shoot those red barrels on near that big dude on the top right. Bam. Oh my god, he looked insane. He looked like Clayface. He did. Yeah. This thing is nasty. The the shock. No, the just the Oh, the flooring. The flail. Disgusting. [Music] Shock really is nice, too. Really does a nice job. Oh my god. He's on our side. Oh, bang out. Bang out. The hell's that thing? Ooh, nasty. Defensive turrets took some damage. We need time to repair them before we can clear. There are four more hell gates. I love parrying. Those are so much fun. So much fun. The big dudes. It's nice, too, because it really",
            "start": 5335.92
        },
        {
            "text": "some damage. We need time to repair them before we can clear. There are four more hell gates. I love parrying. Those are so much fun. So much fun. The big dudes. It's nice, too, because it really does Oh, I got a life sigil. It's nice because it it at first we you know, Andy, we owe this game a little apology. Why? If I'm being real, how so? Well, we said that, you know, that color shouldn't be green necessarily as a parry, but when you realize that it's very life-saving, that maybe green is the right color. Oh, sure. You're right. Maybe it gives you health in a way. It kind of does. It inadvertently does. Yeah. By not taking health. But I when I go home, I'm going to make it blue or purple just to have cool colors. Oh, those come a lot faster than you think they do. Yeah. Really just learned something there about myself. Which Pokemon would the Doomslayer be? He'd be a Machop or a Machoke. Yeah, for sure. Like they have the same proportions. What do we want to do here? Oh, can we",
            "start": 5473.84
        },
        {
            "text": "learned something there about myself. Which Pokemon would the Doomslayer be? He'd be a Machop or a Machoke. Yeah, for sure. Like they have the same proportions. What do we want to do here? Oh, can we upgrade this thing? Yes, you can. That do. Okay, so the flail deals significant damage to armor and Yeah, we want that for sure. Reduce the recovery time of the flail charge so you can hit them hard. Look at that. Reduce it by 5 seconds. That's crazy. That rocks. Andy says it rocks. It rocks. I mained the flail for the most part. What is the third? Don't Don't ruin it for me. Uh well, spoilers. Yeah, don't ruin it for me. There's another one. It's another melee weapon, but that's all. I just know it's a priz. I see the bracket over there. I'm really dying here, huh? Some health, [Laughter] dude. Oh, nope. I hate that. Another Spider-Man. I have no health. [Applause] This dude wandering looking for his squad. See if I can reload the health real quick. Sorry, chat. Bear with me. Oh,",
            "start": 5535.52
        },
        {
            "text": "dude. Oh, nope. I hate that. Another Spider-Man. I have no health. [Applause] This dude wandering looking for his squad. See if I can reload the health real quick. Sorry, chat. Bear with me. Oh, Blastoise is pretty good. Jeans on the V. I discovered why I prefer Bulbasaur as my favorite Gen One Pokemon chat. It it finally I disco I always knew he was but I never knew why. And now it's like cuz he's not a bipeedal little child cuz he looks like he's like a little dog. He's four-legged runs around and Charmander and squirrel just kind of walk around like humans and I prefer bipedal or I prefer quadriped quadripedal. That thing is nasty. Oh, they're all here. Oh, yeah. They're they're trapping you in. Oh, they're all here. Nice. Oh, that one almost got you. Oh, man. I'm just going to keep that guy in my sights. Look at that. You crushed it. There's a Ruby behind you. Bam. Just got to kill that Attack of the Clones thing. Oh, hello. I love when they do that. When they like, \"Here's a",
            "start": 5595.48
        },
        {
            "text": "that guy in my sights. Look at that. You crushed it. There's a Ruby behind you. Bam. Just got to kill that Attack of the Clones thing. Oh, hello. I love when they do that. When they like, \"Here's a treasure. You think you're going to get it? Bam. Trap.\" Smart. Close all the walls around you. That's cool. Do you feel in charge? This is a fun level of design cuz it's kind of like Yeah, this is kind of a little openish area. Yeah. They let you adventure. They let you go get a bunch of optional things that, you know, you could easily skip. Or if you want more rewards and more challenges and money and treasures, then you can go explore a whole bunch of it. Definitely do. Oh [ __ ] the invisible dudes. [ __ ] God damn it. These stupid projectiles. Get my stupid phone out of the way. You could also jump over those, too. do like these. They usually shoot them like at your kind of foot height, so I usually kind of hop over them. Nice. Smartop. Oh yeah. Nope. Well, sometimes they shoot when you",
            "start": 5708.88
        },
        {
            "text": "jump over those, too. do like these. They usually shoot them like at your kind of foot height, so I usually kind of hop over them. Nice. Smartop. Oh yeah. Nope. Well, sometimes they shoot when you were like in midair at one point or elevation wise. What do the rubies do? The rubies are used to upgrade weapons and melee stuff further. Usually the first step or two of the Look at that chain lighting. That's so cool. Usually the first upgrade is all money based and then it kind of gets tougher and it becomes rubies and then it becomes the wraith wraith. No, Wraith coin sounds like a cryptocurrency. Yeah, definitely a cryptocurrency. Uh gem. Wraith gem [ __ ] Did you see how there's some random company that nobody knows? They didn't exist until like two years ago that uh invested like I don't know how many hundreds of or millions of dollars into Trumpcoin. Everybody's like who is this? It's definitely Trump. Like this. How is any of this allowed? Like just it's insane. Oh [ __ ] I don't",
            "start": 5774.56
        },
        {
            "text": "know how many hundreds of or millions of dollars into Trumpcoin. Everybody's like who is this? It's definitely Trump. Like this. How is any of this allowed? Like just it's insane. Oh [ __ ] I don't know why I want this immortal blue. These are tough. So, there's a big big boss at the end of all of this area, but you can't fight him until you take out all of the other smaller big bosses. Okay, the mini bosses, if you will. So, the big boss back there, he's got a bunch of shields surrounding him, meaning like you can't attack me yet. Shoot them red barrels near that, dude. Oh, not while you're there. Yeah. Oo yeah. Oh yeah. Was that a mistake? No, you're doing good. Keep shooting his ass. I think I Yeah, I couldn't move backward. I was like, I think I'm Oh, you're against fans. Yeah. Um, just go for it. One thing I will say, there's a setting you can turn on if you want that I turned on that shows you the the direction of where you're getting shot from. Yeah. And so it kind of helps",
            "start": 5857.68
        },
        {
            "text": "just go for it. One thing I will say, there's a setting you can turn on if you want that I turned on that shows you the the direction of where you're getting shot from. Yeah. And so it kind of helps instead of just getting randomly hit by some dude without knowing that they were even behind you, you know? Yeah. Cool little area. Nice. Oh, they all they got shocked by it. That's cool. Sick. Let me in. That looks like a trap. Just clear a couple of those out. I think it is a trap, but it's one of those easily easy ones with the fire. We just blow them all up. Oh, those dudes are tough. Nice. There's a portal to get inside. Oh, do I not have to do that other big boss level? No, you This is just to kind of get out of this zone and you'll see one of these things. You have to go shut down multiples of these. Oh, I see. Oh, little puzzle time. I love these puzzles cuz they're not hard. They're just they're like it's just enough of a challenge to where it's fun. Mhm. very God of War like",
            "start": 5936.72
        },
        {
            "text": "of these. Oh, I see. Oh, little puzzle time. I love these puzzles cuz they're not hard. They're just they're like it's just enough of a challenge to where it's fun. Mhm. very God of War like these puzzles. Ah, I will enjoy. Thank you once again to Nvidia for sponsoring this stream. We are showing off the Nvidia RTX 5090 with DLSS4. DLSS4 is uh you can get DLSS4 even back to the 30 card series. Um DLSS4 is giving us got on my 3090 at home. Insane frame rates with ultra nightmare visuals. We are running this game at the highest settings possible. Ultra nightmare. We have two time frame generation on and we're getting 270 frames per second in this game. It's so smooth. It looks insane. Wildly sharp. And again, the visuals in the lighting in in this game are just gorgeous. So, shout out to Nvidia for sponsoring the stream. I love showing off their cool tech. I love sharing my passions with you all. And, you know, anytime I can just, you know, let that bit rate soak, I'll let it. You got",
            "start": 6053.28
        },
        {
            "text": "for sponsoring the stream. I love showing off their cool tech. I love sharing my passions with you all. And, you know, anytime I can just, you know, let that bit rate soak, I'll let it. You got to let it soak, dude. Let the bit rate soak. Let it get soaky. Let it get bitty. [Music] Okay, so the last one's here. The visual triangle. Yeah, thank you for using that Dorito. I love that. That is the triangle. That is the triangle. That's the one. This is fun. Perfect. Crushed it. Use you. Abuse you. Oh, dude. This weapon's cool. Every weapon's so viable. It's insane. Oh my god, that's awesome. It And it comes right back to you. It's just It's crazy. You fully charge it. It's wild. That's crazy. That's fun. Pretty cool. I basically like always have it charged. Seek out additional. How do you charge it? Just hold it down. Yeah, hold down left click. It's so nasty. Nice, dude. Destroy gore portals. The gortals, dude. Don't call it that. That's what they're called. Don't call it that. I think",
            "start": 6154.8
        },
        {
            "text": "it? Just hold it down. Yeah, hold down left click. It's so nasty. Nice, dude. Destroy gore portals. The gortals, dude. Don't call it that. That's what they're called. Don't call it that. I think I missed some um I think I miss some gold in there. Maybe not. No. Do I just launch myself? Oh yeah. This is going to give me the ickies. So, this is I think back to that one fight. It is. Might want to switch back to the weapons you're more comfortable with. Maybe. Maybe. Any health though. We can just use this. I have no upgrades though. Yeah, you can't afford anything. Don't worry about it. I think there's a secret to your left. Yeah. Oh no. I'm getting killed. Oh no. Careful with the acid. Yeah. No. No. Charge that left click. Oh, wait. Oh [ __ ] Shoot. [Applause] Nice. Oh [ __ ] Careful with that acid. Oh. Oh my god. Insane. That was nasty. That was crazy. Damn. He stood and fought Chad. Got to stand and deliver. Guys, that's the stand and fight mantra in Doom: The Dark Ages. You can do",
            "start": 6238.08
        },
        {
            "text": "that acid. Oh. Oh my god. Insane. That was nasty. That was crazy. Damn. He stood and fought Chad. Got to stand and deliver. Guys, that's the stand and fight mantra in Doom: The Dark Ages. You can do what you want. You play out this game how you want to play it, but I'm not a scaredy-cat. I stand and deliver. I did so much better when I was just like, I'm not supposed to run away and shoot from far away. Yeah, you you bait out the parries. You parry and pop off. Oh, yeah. Yeah, little secret. It's nice little health. The lighting looks so good up there. Not quite. You have the right idea. Keep going through. Yeah, there we go. I don't know if that guy got up right. Oh, I don't think he did. Sick. Orel Sanchez says, \"Hey, Nick. I'm passing by San Francisco on Memorial weekend. Do you have any shows planned between Friday and Monday?\" Oh, shoot. Hold on one sec. He's killing me here. Um, I don't know. I'd have to look. I will try to update my uh the link on my Instagram. I don't think I",
            "start": 6393.24
        },
        {
            "text": "shows planned between Friday and Monday?\" Oh, shoot. Hold on one sec. He's killing me here. Um, I don't know. I'd have to look. I will try to update my uh the link on my Instagram. I don't think I do. I think I might be out of town for Memorial Day. How old is the Doomslayer? Ageless, timeless. Evan Nerf says, \"If you hold down R on the shield throw, you can slow down time for a head shot.\" We set the shield throw to another button. I forget what we set it to. E or Oh, you can does like a a little time slow down. Sick. Have enough money to buy some [ __ ] Oh, let's buy something. Then we want to do a melee upgrade. Uh, so demons hit by the flail are scorched and drop armor. Pretty neat. Oh, that's pretty cool. Um, let's go back. And we have a lot of rubies right now. You do. You could get that. You can get that upgrade right there with the ruby. Yeah, but you said wait for the gun upgrades. No, because like we have more than one now. Like we, you know. It's true. So, I would do that",
            "start": 6467.68
        },
        {
            "text": "that. You can get that upgrade right there with the ruby. Yeah, but you said wait for the gun upgrades. No, because like we have more than one now. Like we, you know. It's true. So, I would do that because the final one is a good one to have. Can I get that, too? Uh, I think so. Yeah, I can. Oh, it costs two though. Careful. What is it? So, it keeps them stunned for much longer. Oh, that's cool. Should I? I hate to waste it. Maybe not for Maybe not yet. Not yet. Not yet. Let's check out what the what the weapons are. So, um, we have 150. Some of these upgrades are 200 bucks. Well, we had one that was 150 that we wanted to do. What was it? Was it the shotgun? It's this one, right? Oh, 120. Yeah, but I'm not using that so much. Dang it. You You figure it out. I got to go to the bathroom real quick before we run this. Well, the the the triple shot shotty is really nice is what I would say. Get it. [Music] Ban. All right. Sick. Let's do the triple shot shotty, shall we? Chat. Nick's got",
            "start": 6535.92
        },
        {
            "text": "quick before we run this. Well, the the the triple shot shotty is really nice is what I would say. Get it. [Music] Ban. All right. Sick. Let's do the triple shot shotty, shall we? Chat. Nick's got to go beepy. Let's uh let's get him. Let's get him on the path there. Demons affected by burn drop more armor pickups. That's really nice. Let's activate that. Oh, we can get this already. I I thought this was going to cost more money, but it costs a ruby the size of a tangerine. Oh, that's huge. That's huge. Okay, perfect. Amazing, man. So, I I'm not watching the game play directly, chat. I'm not looking at Nick's screen. I'm looking at an OBS feed, which and the game still looks really, really nice, but it doesn't look like this. It's like this is this is next level type [ __ ] Oh, he's inverted. God damn it. [ __ ] God damn it. Just switch it real quick, chat. So that there's nothing happening. So something is happening. Here we go. Oh, what's his [ __ ] What's his uh it's E. I have mine",
            "start": 6591.44
        },
        {
            "text": "God damn it. [ __ ] God damn it. Just switch it real quick, chat. So that there's nothing happening. So something is happening. Here we go. Oh, what's his [ __ ] What's his uh it's E. I have mine set to mouse five, I believe. [Music] I don't I don't want to like kill this boss without him though. Oh [ __ ] [Applause] Damn. Uh, no, I didn't want to take you all the way there. I just wanted to play while nothing was happening, but I did have to switch the aiming. So, I I'll switch it back here in a second. I mean, I'll just I'll just die. But Oh, so check it out. Pause right there. I thought I know where I'm at. I thought we would um this one nice thing is uh I thought we could only upgrade the shotgun once and I thought we'd have to wait to get the triple shot. Well, you got it already. Oh, wa. Yeah, because the the next upgrade cost one ruby. Oh, so you just got it. So, we have the triple shot shotty and we still have a ruby left. Yeah, you still have a ruby left. I think I already",
            "start": 6656.68
        },
        {
            "text": "Oh, wa. Yeah, because the the next upgrade cost one ruby. Oh, so you just got it. So, we have the triple shot shotty and we still have a ruby left. Yeah, you still have a ruby left. I think I already switched it back. Yeah, thanks, buddy. Well, let's take that bad boy out for a second. Yeah. Okay. Oh, it does have ammo. Okay. Sick. Oh, nice. Jesus, that shotgun goes fast though, huh? You still haven't killed all the mini bosses. You can't kill that guy yet. Kidding me. Okay, there should be one more that pops up pretty soon cuz I I killed the big dude for you. There should be one more around here. Maybe the dude up there. Yeah, I see him. was. Yeah, he's on that little tower up there. That was a mistake. That was a tactical from there. Nice. Now the shield is disabled. We can go after the big guy. What the hell? And they keep on spawning other dudes. It's crazy. It's [Music] nuts. O uh in the chat says the shotgun's a three pump just like me. Nice. Damn it. I'm just good everywhere.",
            "start": 6745.44
        },
        {
            "text": "big guy. What the hell? And they keep on spawning other dudes. It's crazy. It's [Music] nuts. O uh in the chat says the shotgun's a three pump just like me. Nice. Damn it. I'm just good everywhere. [Applause] Damn. Oh, break that shield. Throw it. Yeah. Yeah. [ __ ] it. God damn it. Tons of plum. What does that mean? Stay stunned. Oh, there we go. There it is. There it is. and chat. That's beautiful. That's it. It's a great place to round out our day. That's a great place to end the day. Thank you to everybody who got to hang out with us in the chat. Appreciate all of the supporters, people subscribing with Prime, people doing uh Twitch or YouTube memberships and everybody just uh hanging out watching this after the fact on YouTube bot. Oh, you could take out this little squad and break that cannon over there cuz that's also kind of a mini a mini job to do. Um this is a lot of fun. Thank you Nvidia for sponsoring this stream, allowing us to show off the power of DLSS on our incredible",
            "start": 6840.96
        },
        {
            "text": "cannon over there cuz that's also kind of a mini a mini job to do. Um this is a lot of fun. Thank you Nvidia for sponsoring this stream, allowing us to show off the power of DLSS on our incredible RTX 5090. Once again, we're playing with frame generation on. DLSS is also giving us uh the ability to play the game at 1440p cuz it's using AI to recreate the image to get it looking just as sharp and just as awesome as the native 1440p. We're getting 200 frames per second. We're getting uh again, we're playing on ultra nightmare visual mode, which is just buck wild. That's pretty nuts. The game looks awesome. It runs fantastic. It's kind of a match made in heaven. Nvidia and IDTech is just fantastic. So, thank you everybody for supporting the stream, supporting us here. We hope you all have a lovely weekend. Thank you once again, Nvidia for sponsoring this. Take care of yourself. Take care of each other. And we will see you back on Monday. Goodbye, gamers. [Music]",
            "start": 6971.36
        }
    ]
}