{
    "id": 14116,
    "video_id": "nvh1n90pmjU",
    "show_name": "In Review",
    "hosts": [
        "Tim Gettys",
        "Nick Scarpino",
        "Andy Cortez"
    ],
    "title": "Mission: Impossible - The Final Reckoning In Review - Every Mission Impossible Recapped and Ranked",
    "description": "Go to https://bit.ly/m/KindaFunnyXSubwaySurfers?r=qr to get special rewards and download it now!\n\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1747952396,
    "duration": 6091,
    "transcript_chunks": [
        {
            "text": "[Music] [Music] I love seeing an intro for the first time in a while. It's been two years since we saw that last and man, what a fun one that was. Shout out to Cameron Kennedy, of course, and Carter Herrell on the music. I'm your host, Tim Gettys. I'm joined today by Andy Cortez. Dead Reckoning was two years ago. Yeah, it was two years ago. It came out on July 12th, 2023. This one was supposed to come out June 28th, 2024, but then the strikes and the this and the that's happened. So, here we are now. Joining us as well is the producer/seducer Nick Scarpino. Hello, Tim. Cameron Kennedy says, \"That was the first thing kind of funny ever paid me to make.\" That's wild. Yeah. Mission Impossible review. I don't know when we started that cuz that was a fun one. If I remember correctly, we didn't even do it leading into a movie. We just did it. Yeah. Because like we we did it just at that point, Fallout had already come out and we're just like I've never seen them so we just have to get in",
            "start": 0.5
        },
        {
            "text": "even do it leading into a movie. We just did it. Yeah. Because like we we did it just at that point, Fallout had already come out and we're just like I've never seen them so we just have to get in there, you know? Uh and here we are now much more educated, well-versed in the Mission Impossible. We're almost at the end of the Mission Impossible franchise, depending on which article you believe. Yeah. I mean, you read the final reckoning is upon us, you know. We'll see. We'll see. Is it the last one? I don't We'll get into all of that and more today because this is kind of funnies in review where each and every week we rank, review, and recap different movie franchises. Uh right now we are doing Mission Impossible. Next week we are returning to the Karate Kid, a little uh programming update for you. Karate Kid Legends comes out next week. Um so the interview will be Legends. As a little bonus, we're also going to be uh if you want watching uh The Karate Kid 2010 with Jaden Smith. Not",
            "start": 55.52
        },
        {
            "text": "for you. Karate Kid Legends comes out next week. Um so the interview will be Legends. As a little bonus, we're also going to be uh if you want watching uh The Karate Kid 2010 with Jaden Smith. Not required reading. not required reading. It's optional. We're just going to for context for this movie cuz I haven't seen it. I don't think that y'all have seen it. But uh we're going to be watching that and uh lightly discussing it. I think I have I didn't see that movie in theaters. I'm sure you did, Jack. I sure as hell did, my friend. You bought the one popcorn bucket. It's just Jackie Chan's face. Um so we're we're watching it, but uh it's optional for y'all. We're not going to do the full plot recap or anything of that one. That's more just for context going into Legends for us. um mainly because there's a ton of movies coming out and uh we're about to get into Superman in review and Fantastic 4 in review uh cuz those movies are upon us as well. So, a lot of stuff coming, but next week",
            "start": 99.04
        },
        {
            "text": "there's a ton of movies coming out and uh we're about to get into Superman in review and Fantastic 4 in review uh cuz those movies are upon us as well. So, a lot of stuff coming, but next week Karate Kid Legends/ uh Karate Kid 2010. Um but now we're talking about Mission Impossible. If you love what we do, please get the kind of funny membership. You can get it on YouTube, Patreon, Spotify, or Apple Podcast. Get you the shows ad free. You get a daily exclusive Greg Way. Great stuff for everybody, including our Patreon producers, Carl Jacobs, Omega Buster, James Hastings. Uh, today we're brought to you by Subway Surfers, and Factor. Uh, getting into it now. It's Mission Impossible: The Final Reckoning. Uh, had a run time of 170 minutes. Mhm. It's a long ass movie. 250. Just shy of three hours for this one. 70 of those minutes were them telling you how incredibly important Ethan Hunt is to the universe and how you take Ethan Hunt out of the universe every literally. Um and the run time",
            "start": 142.4
        },
        {
            "text": "for this one. 70 of those minutes were them telling you how incredibly important Ethan Hunt is to the universe and how you take Ethan Hunt out of the universe every literally. Um and the run time of the last one 2 hours and 43 minutes. So between Dead Reckoning part one and the final reckoning almost 6 hours of Ethan Hunt running. Wild so much running. Um directed once again by Christopher McQuary. Uh the music this time not done by Lauren Valve. He was supposed to to come back um after doing the last couple the the amazing Mission Impossible movies and their scores and knocking it out of the goddamn park. Did not come back this time. It was uh Max Arouge and Alfie Godfrey. And I got to be honest with you, I was a little let down by the score in this one. Sure, it's the familiar themes, but I feel like when we have some uh inspired takes on the themes like we see in Fallout, get what we got here kind of just felt derivative in a way that I was like, my blood's not pumping the way I",
            "start": 188.88
        },
        {
            "text": "but I feel like when we have some uh inspired takes on the themes like we see in Fallout, get what we got here kind of just felt derivative in a way that I was like, my blood's not pumping the way I need it to be right now. You need to hit me over the head with the theme, you know? You need to hit me over the head with those moments of we're saving the world right now. Yeah. And it wasn't the worst thing. It wasn't even bad. It was good. It just wasn't like top tier scoring, you know? I will say watching it I didn't know that there were any changes with the composer and there's that one you're mentioning derive derivative theme that sounds very similar to the fallout one and it's just like and I thought it was like the same thing. Yeah. And I smiles all across my face like like I was so pumped in those moments. I don't disagree though that maybe they didn't go the extra mile and kind of innovating with something brand new, but I still think it kicked ass. Uh, this one has an",
            "start": 235.84
        },
        {
            "text": "was so pumped in those moments. I don't disagree though that maybe they didn't go the extra mile and kind of innovating with something brand new, but I still think it kicked ass. Uh, this one has an outrageous budget of close to $400 million due to a lot of re-shoots and having to push production back. And also, Tom Cruz infamously deeply cares about the cast and crews of his movies. So, even when they're not filming during strikes, is paying them full wages. Um, so that explains a lot of the the money there. Um and the budget of the last one was 290 million. So yeah, these are very very very expensive expensive movies. Um before we get into the entire plot and all that, I want to give our thoughts on this because the movie is just coming out today. We will start with a spoilerfree section. Um so Nick, keep that in mind. Spoilerree. We're not spoiling this movie. Spoiler section. Spoilerree. Um and we'll give our thoughts and then when we get into the plot, obviously we're going to",
            "start": 282.88
        },
        {
            "text": "Um so Nick, keep that in mind. Spoilerree. We're not spoiling this movie. Spoiler section. Spoilerree. Um and we'll give our thoughts and then when we get into the plot, obviously we're going to spoil the hell out of this entire movie. So keep that in mind. We'll make it very clear. Andy Cortez, I want to start with you. What did you think of Mission Impossible: The Final Reckoning? After not loving Dead Reckoning and feeling like, dang, that was a bit of a letown. Kind of a let down just after many, many, many awesome movies in a row. I This movie started off kind of worrisome. And like in the first 5 minutes or so to 10 minutes to 30 minutes to 40, I'm just like, oh, I don't I'm not I want to love this right now. I'm I want this to be a a a big comeback for after having a movie that didn't quite hit for me with Dead Reckoning. And I thought it started off not great with some comedic choices that didn't work for me and some attempts at comedy that I just it it I wanted to love but I",
            "start": 328.76
        },
        {
            "text": "quite hit for me with Dead Reckoning. And I thought it started off not great with some comedic choices that didn't work for me and some attempts at comedy that I just it it I wanted to love but I just like gh they're not making the right choices here. And then um despite I think some really awful storytelling and some terrible villains and you know things of that nature, I don't think this movie is like very good as a as a movie. I think this movie gets so incredible and amazing as a spectacle and the second the back half of it or maybe like the last two hours of it or whatever are some of the best [ __ ] you'll ever witness in a theater and you have you will regret not seeing it in a theater heart pumping smiles across my face audibly going [ __ ] oh [ __ ] like like godamn it is like Hollywood why it exists it's why Tom Cruz is like it's him on full display of like we are going to go as hard as we can with these set pieces. It's awesome. There was like seven or eight on the edge of",
            "start": 384.0
        },
        {
            "text": "why it exists it's why Tom Cruz is like it's him on full display of like we are going to go as hard as we can with these set pieces. It's awesome. There was like seven or eight on the edge of your seat moments back to back. I [ __ ] love this movie despite not thinking it's super good as a whole film. You know what I mean? I talked about it when I was ranking the movies recently. I was debating. Look, I think Mission Impossible 3 is a better complete film front to back. Villain, acting, story, cohesiveness, also really great drama and action and, you know, tension. And it stayed consistent all the way through. And this movie is kind of just like a wet fart in the beginning. And it's like, oh no, we're going to end the franchise on this note. And then it just skyrockets to insane heights. And I love this movie for that. Nick Tim, this was a new one for me. I've been watching films on this planet for a very, very long time. And I would have bet dollars to donuts that Tom Cruz of all",
            "start": 443.12
        },
        {
            "text": "And I love this movie for that. Nick Tim, this was a new one for me. I've been watching films on this planet for a very, very long time. And I would have bet dollars to donuts that Tom Cruz of all people would be the one to give me a new experience. And he sure as hell did because for the first 45 minutes of this film, I [ __ ] hated it. I was like, I hate this movie. This is everything I hated about Dead Reckoning just crammed into even more pretentiousness, more self-absorbedness, more tell me don't show me all the things I hated about the first movie. This was here and I would have bet you money that I would walk out of that movie being like I hated it. And then something happens halfway through in this film and we'll get to when we get to the plot and I start thinking to myself, oh right, this is the Mission Impossible team. This is Tom. This is the cruise missile. This is the cruise control, man. Like, I forgot these guys are legitimately fans of Mission Impossible who are making",
            "start": 500.16
        },
        {
            "text": "this is the Mission Impossible team. This is Tom. This is the cruise missile. This is the cruise control, man. Like, I forgot these guys are legitimately fans of Mission Impossible who are making these movies. Yeah. Halfway through this film, it starts to build and then by the time we get to, and we'll get to it, there's moments in this that Andy is 100% correct, are the best things you'll ever see in a Mission Impossible movie. So, I am I'm just absolutely delighted that by the end by the time this movie ended, I was like, that might have been one of the greatest Mission Impossible movies that I've ever seen. Like, if you shaved off the first hour of it, it might be the greatest Mission Impossible movie ever. It's crazy. And it's a bummer because I think they spent a lot of the first movie or the first like act of this film trying to catch you up on what happened with the the the prior film and then also build a sense of importance for the stuff that, let's be honest, you don't need.",
            "start": 547.2
        },
        {
            "text": "or the first like act of this film trying to catch you up on what happened with the the the prior film and then also build a sense of importance for the stuff that, let's be honest, you don't need. Who cares what the McGuffin is? Who cares what what the the missile is going to hit? What it doesn't matter. It's all about building that tension in the action sequences and having the fun dynamic between people. And I'm happy to say that by the end of the movie, I walked out with a smile on my face. I'm right there with Andy. There were moments where I there's a moment in this film where I audibly went [ __ ] awesome in the movie. And I know that because I scared the [ __ ] out of the guy next to me like whoa, what's going on? I was like, that was incredible. and moments where I was popping for for things that are happening that you never expected to see again and you're like that's here everything about this movie from about 45 on absolutely see this in the films just get I hate to be the",
            "start": 590.72
        },
        {
            "text": "for things that are happening that you never expected to see again and you're like that's here everything about this movie from about 45 on absolutely see this in the films just get I hate to be the guy that's like just get through the first season just get through the first 45 minutes of this film and then boom we're off to the races what did you think Tim I'm aligned with the two of you pretty much to a tea uh the first hour of this movie is torturous in the sense of being a Mission Impossible fan and being a fan of franchise movies. I love this stuff. I think more than anyone in this office, I love and appreciate going back to the dumb little things they referenced once in a movie and bringing it back. And I just love how dumb and over the top that [ __ ] can get when you're at the eighth movie in a franchise, right? Like I appreciate that type of stuff. It's when they show you that uh uh [ __ ] Han when the crash happened and it was actually Jason, you're like, \"Oh my god, oh",
            "start": 629.28
        },
        {
            "text": "eighth movie in a franchise, right? Like I appreciate that type of stuff. It's when they show you that uh uh [ __ ] Han when the crash happened and it was actually Jason, you're like, \"Oh my god, oh that's hilarious. I love it.\" Yeah. And uh for me, this the first hour of this movie is that just in all the wrong ways. And uh it's really upsetting because they they did what Karate Kid and Cobra Kai does of like literally showing you every single thing that's ever happened and how it all connects, but it lacked the tone or vibe of Cobra Kai, which is silly and over the top and it's cheesy, hilar campy. Um and they they play this as if it's serious and it's not campy and it really really really misses the mark. and the plot that they're rehashing, what they're telling us to set up for this, it's all just like, oh man, we are I I was bored bored bored in a Mission Impossible. That's not good at all. I was higher on Dead Reckoning overall um votes wise. I I rewatched uh what we thought of",
            "start": 671.04
        },
        {
            "text": "it's all just like, oh man, we are I I was bored bored bored in a Mission Impossible. That's not good at all. I was higher on Dead Reckoning overall um votes wise. I I rewatched uh what we thought of at the last one and we actually aligned on it of where we place it. But um something about Dead Reckoning is my heart rate spiked and I had my Apple Watch nine separate times in that movie. Um, I think front to back there's just a lot more action and exciting things going on and the comedic relief and the Haley Atwell dynamics with Tom Cruz. Like there was a lot in Dead Reckoning that this movie just simply doesn't have that I I missed and I wish it did have. But what you guys are saying, there are two separate set pieces that last a very long time in this movie that are better than anything we've seen in any franchise. Like it is top tier stuff. And in addition to just the action, spectacle setpiece stuff, like I think that the twothirds of the end of this movie are the clearest",
            "start": 715.04
        },
        {
            "text": "we've seen in any franchise. Like it is top tier stuff. And in addition to just the action, spectacle setpiece stuff, like I think that the twothirds of the end of this movie are the clearest narrative that a Mission Impossible has ever had. It's simple to follow what's happening and why. And it's not because of what they set up in the first hour. That stuff is overly complicates. It's so convoluted. But I think that the uh the the the second two/3s are very very strong, have a very important message. the way that the movie kind of wraps up and like the the kind of themes and just like the how directly headon they tackle some of the subject matter. I'm like good for you Mission Impossible. This isn't just Tom Cruz trying to kill himself in action scenes. Like you're trying to say something here and I think that they accomplished that. Um but I think that overall with the with this movie Andy said it's like this movie is not good but parts of it are just so amazing. I am just very very",
            "start": 760.16
        },
        {
            "text": "here and I think that they accomplished that. Um but I think that overall with the with this movie Andy said it's like this movie is not good but parts of it are just so amazing. I am just very very let down by the the choices they made to connect literally everything because the franchise didn't need it. And I do think that the beyond just saying, \"Oh, the first hour is not great.\" Like, I think that there's actually real problems with this movie in comparison to some of the other entries in the franchise of there was never I felt tension. I felt stakes. The stakes have never been higher in any movie ever. And I think they actually earned them. But in terms of emotional stakes and character stakes, I can't believe how much I didn't care. I in some of these movies when someone's in danger and they might die, I'm like, \"Please don't do this to them.\" And sometimes they do die and I'm like, \"Oh my god, that hit.\" Like, oh, this movie things happen. People may or may not die. And I just",
            "start": 801.76
        },
        {
            "text": "and they might die, I'm like, \"Please don't do this to them.\" And sometimes they do die and I'm like, \"Oh my god, that hit.\" Like, oh, this movie things happen. People may or may not die. And I just simply don't care because of the way they present it not being good. And the team that we have, I don't know, man. Not my favorite iteration of this team. And there's just something about like the way they're all interacting. Like we've seen this before and we've seen it better. Wrapping all that up though, you got to see this movie in theaters. And I I still loved my time watching this. So yeah, this is definitely one of those movies where we're for everyone that's sticking around for the review, we are going to sound very negative on it for the first maybe 20 minutes of the plot recap. And I want you guys to understand this like and I don't want to see this in the comments. We all enjoyed the [ __ ] out of this movie towards the end. You should 100% see this movie. You should see it in",
            "start": 844.16
        },
        {
            "text": "I want you guys to understand this like and I don't want to see this in the comments. We all enjoyed the [ __ ] out of this movie towards the end. You should 100% see this movie. You should see it in the biggest screen humanly possible and get a massive bucket of popcorn. Just arrive 40 to 45 minutes late. That's my recommendation. There we go. So, that's our spoiler-free. Uh we're about to take a quick word from our sponsor and when we're back, we're going full spoilers, baby. Doing the plot of Mission Impossible: Final Reckoning. This episode is sponsored by Subway Servers. The goated endless runner that carried me through middle school, high school, college, and now adulthood is celebrating their 13th birthday, which also marks their 200th World Tour update. And they're going big because Subway servers decided to travel to not one, not two, but 21 different locations in their 200th World Tour special event. It's kind of funny. As Resident Zoomer, I can seriously say that I adore",
            "start": 886.24
        },
        {
            "text": "Subway servers decided to travel to not one, not two, but 21 different locations in their 200th World Tour special event. It's kind of funny. As Resident Zoomer, I can seriously say that I adore Subway Surfers. It's one of my favorite comfort games. Grabbing items, completing challenges, and pulling out a hoverboard right as I'm about to hit a train feels just as good now as it did when I was sitting in the back of Mr. Coburn's Spanish class. Play through all 21 destinations to unlock amazing rewards such as characters, hoverboards, and in-game currency. Just tap the 200th World Tour button on the screen to start playing. And exclusively for best friends, head over to kind offunny.com/subway servers or scan the QR code on screen to get a ton of special in-game rewards. The update ends on June 1st, so scan that QR code, download Subway Surfers, and start running if you don't want to miss out on all the rewards. I already did. This episode is brought to you by Factor. When life gets",
            "start": 927.92
        },
        {
            "text": "on June 1st, so scan that QR code, download Subway Surfers, and start running if you don't want to miss out on all the rewards. I already did. This episode is brought to you by Factor. When life gets busy, food can sometimes feel like a chore. And the fast food trips can go from a weekly to daily occurrence very, very fast. So, buck those trends and make this season your best with nutritious 2-minute meals from Factor. Eating well has never been this easy. Just heat up and enjoy, giving you more time to do what you want. With 45 weekly menu options, you can pick gourmet meals that fit your goals. Truths from Calorie Smart, Protein Plus, Keto, and more. We at Kind of Funny Love Factor Meals. Bless and Greg love it for a quick lunch in between shows, and I adore it as a healthier alternative instead of the dreaded hump day too tired to cook drive-thru run helping me to get on track with my goals. Get started at factormeals.com/kindaffunny5050 off and use code kind offunny50 off to get",
            "start": 971.36
        },
        {
            "text": "instead of the dreaded hump day too tired to cook drive-thru run helping me to get on track with my goals. Get started at factormeals.com/kindaffunny5050 off and use code kind offunny50 off to get 50% off plus free shipping on your first box. That's code kind of funny50 off at factormeals.com/kindfunny5050 off for 50% off plus free shipping. factormeals.com/kindofunn5050 off. And we're back. Hit it. Oh, hold on. Hold on. Hold on. I may mess it up. Hold on. I I forgot what the timing was. It's a final reckoning. I tried to try to mess with the theme. Last time we got claimed, so I was like, what if Oh, good call. Very good call. And that theme is, you know, that that synth is very very recognizable. Yeah. Don't need AI. I don't need the entity looking at me, you know. No, absolutely not. God, the [ __ ] entity. Before we begin this plot recap, I just want to tell you guys I called it. Hold on to that. Okay, we're about an hour into this movie. You called it. Okay, I called it. I'm",
            "start": 1016.08
        },
        {
            "text": "God, the [ __ ] entity. Before we begin this plot recap, I just want to tell you guys I called it. Hold on to that. Okay, we're about an hour into this movie. You called it. Okay, I called it. I'm interested. I called it. All right. I think we all called it, but I called it first. Ladies and gentlemen, welcome to 1985. The entity has taken everything over. So now we have to just watch everything on VHS tapes. How did they get the VHS tape to him? Courier, perhaps. Maybe UPS is still running. I don't know. The the world is just being destroyed by misinformation. And that's basically the theme of this movie is that we all need to trust each other and talk to each other and AI is ruining everything and all and everyone hates each other online because the entity is making us all hate each other. Spoilers, Russian bots uh can overthrow elections, all that jazz. But this is uh uh this is uh uh the president of the United States talking to Ethan Humph. And uh she's like, \"Listen, Ethan, we",
            "start": 1074.0
        },
        {
            "text": "Spoilers, Russian bots uh can overthrow elections, all that jazz. But this is uh uh this is uh uh the president of the United States talking to Ethan Humph. And uh she's like, \"Listen, Ethan, we [ __ ] need you, man. And not only do we need you, I tell you what, everything is bad. And every decision you've ever made has led you to this point. And you are the only person that can save us. And you are basically Jesus Christ. You are the only person on this planet that can save this planet because everything is bad. Everything is terrible. We don't trust each other. John Cena is bad now. Tim, did you hear about this? It's the worst news that anyone's ever said. And if you didn't know that Ethan Hunt was Jesus H [ __ ] Christ coming back from the dead and he's the only one that can save us cuz this is our [ __ ] Easter. You know it now. And if you don't, for the next 45 [ __ ] minutes, Nick Offerman is going to tell you how bad the situation is. While what's what is the act? Angela",
            "start": 1117.84
        },
        {
            "text": "us cuz this is our [ __ ] Easter. You know it now. And if you don't, for the next 45 [ __ ] minutes, Nick Offerman is going to tell you how bad the situation is. While what's what is the act? Angela Basset. Yes. While Angela Basset is like, \"It's really bad. The AI entity is bad. We live in the entity's reality now, everyone. And the only thing we know is that we need Ethan Hood. We don't know anything. Oh, okay. There you go. And then we get this this whole part is very very weirdly convoluted. We go to Luther who's making this virus thing that for this other stuff. And then Luther's sick. I don't remember him dying in the last movie, but apparently he's been dying. Did you know that? It's been two years. You don't really remember that? I believe he was. Uh they need to find Gabriel because they need to pair the McGuffin from the Sebastapool with this virus and then Gabriel and G's Gabriel. We got to break him out of uh uh out of uh we have to break Palm Clemente out of jail because",
            "start": 1160.24
        },
        {
            "text": "they need to pair the McGuffin from the Sebastapool with this virus and then Gabriel and G's Gabriel. We got to break him out of uh uh out of uh we have to break Palm Clemente out of jail because she'll know where where Gabriel is. And then Shay Wigs. Wait, hold up. Was the entity just did maybe John Cena going bad? Was only the entity showing that. Do we know? Do we know if John Cena is good or bad? Information. We don't know. We know we got a hair we got hair plugs and hair plugs always look fake. Yeah, by the way, she got blown. So, we got to we got to break out Palm Clementif. And this is just another sequence that we don't need necessarily. It's the first fight sequence, but they were like, \"Listen, this movie is so bogged down with exposition of telling you how incredibly important all this stuff is and how scared you should be for our main characters that we have to have an action sequence break this up.\" So, we have this lame ass action sequence in jail where they break out",
            "start": 1205.52
        },
        {
            "text": "all this stuff is and how scared you should be for our main characters that we have to have an action sequence break this up.\" So, we have this lame ass action sequence in jail where they break out Palm Clemente and they somehow recruit Shay Wiggham's right-hand guy who is now part of the team. [ __ ] it. He's just part of the team. Very weird, right? Yeah. And then they go like this. Well, she's like, I know where he's going to be. He's going to be at this cool embassy party. This movie should have [ __ ] started right here at this embassy party. The whole thing should have been them invading the embassy party to get Gabriel. Who cares if Palm Clemente? Just She's on the team now. Let's just go. Let's [ __ ] go. Awesome. Uh I I vastly preferred her in the last movie than than this one just given what she got to do. But um yeah, I'm with you. Just like let's move it along. Or we start the movie with them going into the prison. Nothing more fun than Ethan watching a VHS tape that",
            "start": 1244.64
        },
        {
            "text": "just given what she got to do. But um yeah, I'm with you. Just like let's move it along. Or we start the movie with them going into the prison. Nothing more fun than Ethan watching a VHS tape that recaps the last movie for 45 [ __ ] minutes. Uh, of course they got to go to this thing to get Gabriel. I see the AI. Every time we went into the AI world, it was like, I don't know about this visual representation, y'all. I'm going to make a big call right now. I'm make a big call, everybody. It should have been Tony Dalton instead of Sai Morales as no the bad guy. No, bad call. He just was not good. I don't know if it's maybe it was the writing, Tim. Yeah, it's the writing. It's there's a ch chance that it's the writing, but like at no point he's just such a forgettable whatever bad guy because obviously the entity is the one that's looming, the the big looming threat. But he's the type of bad guy that you think is the real bad guy, then they get killed off kind of early on and you're",
            "start": 1281.28
        },
        {
            "text": "obviously the entity is the one that's looming, the the big looming threat. But he's the type of bad guy that you think is the real bad guy, then they get killed off kind of early on and you're like, \"Oh [ __ ] this is actually the real bad.\" He's just such That was him last movie and he's back again. I know. He's just so forgettable, man. Like nothing about this performance makes me think like, \"Oh, that was a cool villain moment.\" You know? It could have been anybody else. This is how bad the writing is for his character, right? He was like, \"Wherever I go, Ethan Hunt's going to follow.\" And I was like, \"You do realize that the longer you stay in this biplane, the the better the view you will have of the [ __ ] nuclear like missiles flying, right?\" Like, what's your endgame here, dude? Like, you're going to die. It's dumb. Anyway, we're not there yet. We have 74 more minutes before we get to anything fun in this movie. We're at this weird party sequence and then Shay Wigum's there",
            "start": 1333.68
        },
        {
            "text": "Like, you're going to die. It's dumb. Anyway, we're not there yet. We have 74 more minutes before we get to anything fun in this movie. We're at this weird party sequence and then Shay Wigum's there and and then they're like, \"Whoa, do you have your badge, your gun?\" No, you don't cuz guess what? Haley Atwell, Magic Hands is there, right? And this is going to sound like a knock against Haley Atwell. It's not. It's knock against this character. Every single time she does anything in this movie. I wish it was Rebecca Ferguson. I wish it was her character. I wish it was their relationship, which we have developed over five [ __ ] or three movies. And I I just I don't it's confounding to me why they decided just to randomly switch in Rebecca Ferguson out of this or not. Did she not I forget. Did she not want to do this anymore? She died last month. Well, she died, but No, I know that, but like why? She mentioned in always die. She mentioned in They don't always die. They never die. They",
            "start": 1367.92
        },
        {
            "text": "Did she not want to do this anymore? She died last month. Well, she died, but No, I know that, but like why? She mentioned in always die. She mentioned in They don't always die. They never die. They never die. She mentioned in an interview recently that she was like, I it was just dies. It was just time for my character. And also the the the delineation of needing to be a good guy and a bad guy is like so clear now. And I am just I'm kind of a but like what a great I'm a wild card, you know? Like you never quite know if I'm good or bad. And there's she was like there's just no more room for me in this movie. Yeah. But what a good that's so bad crazy bad [ __ ] crazy to me because what a great character to have in this movie when you're about to hand over the power of the world to someone and Ethan's the only person they trust with it. What how what a great character to have by your side like we should keep this. Yeah. I mean I'm with you. I wish I wish that her character and Rebecca",
            "start": 1406.64
        },
        {
            "text": "and Ethan's the only person they trust with it. What how what a great character to have by your side like we should keep this. Yeah. I mean I'm with you. I wish I wish that her character and Rebecca movie, but I like Haley Atwell a lot and I I think I I think that she rocked in Dead Reckoning and I think that they should have gave her more fun action scenes in this one. That's my biggest criticism of her here. I wanted both of them though. Well, either way, Gabriel's men come up and they're like, \"No, no, no.\" And they kidnap him and they tie him up and he's like, \"Hey, this is going to suck. They're going to torture us.\" But they're like, he's like, \"Ethan, listen. What I need you to do is I need you to go find the Sebastian pool, get the McGuffin, and bring it to me so that I can control the entity because we have the source code for the entity. I'm skipping around here. There's a bunch of other The Sebast is the uh the submarine that that sunk in the first one. Not to be confused",
            "start": 1446.0
        },
        {
            "text": "the entity because we have the source code for the entity. I'm skipping around here. There's a bunch of other The Sebast is the uh the submarine that that sunk in the first one. Not to be confused with Hunt for October, which Chris uh Chris Anka watched and really really liked and text me personally. Nice. Yeah. So, it's cool. He can confirm he has my phone number. Uh so, this is this is the overarching thing, right? Nukes are about to fly. Uh the entity has taken over all of the nuclear arsenals for all of the main superpowers it when it's finally got the United States which is the last hold out because apparently we have better encryption than everyone else. Uh actually I think China and UK have yet to go down but eventually going to go down. Spoilers everything goes down. Uh it's going to launch the nukes. The only way they can control it is with the source code uh that they can get on the Sebastapool and then Ving Gra has to put the little virus on it which will then uh uh control",
            "start": 1478.72
        },
        {
            "text": "to launch the nukes. The only way they can control it is with the source code uh that they can get on the Sebastapool and then Ving Gra has to put the little virus on it which will then uh uh control it. And then we'll get to what they have to do after that because the the number of steps needed to uh fight the entity are a [ __ ] buck wild and we're not quite there yet. Right. So Gabriel's like, Ethan, you're the only one that can go down and get this thing from the spastable. You got to figure out where the coordinates are. By the way, they did the coordinates of the spastable which can only be play taken from one place which is in the Arctic. We'll get to that. I called it. Um he called it. He's pointing. So uh so Gabriel is like, \"Okay, torture him before.\" He's like, \"Well, I'm not going to torture you, Ethan, because you can take it cuz you're a man, just like Tim.\" Mhm. But I'll torture Haley Atwell because we care so much about this character that got introduced to us in the",
            "start": 1514.24
        },
        {
            "text": "going to torture you, Ethan, because you can take it cuz you're a man, just like Tim.\" Mhm. But I'll torture Haley Atwell because we care so much about this character that got introduced to us in the last movie who really didn't do much. It's not Rebecca Ferguson, who we're going to torture, who I love, who like we have like earned the trust of because she was like a double agent. We freed her from that. We had moments of great like was it love? Was it like kinship? Was it like bonding of a teammate? Like you and I when we go through war, maybe we make out a little bit and Kevin doesn't know about it or whatever. I don't know. Man, she had the eye patch and a sniper. [ __ ] so sick. And then Hillyw's like, I've never loved anybody more. Magic's cool, dude. Hillywolf is cool. Rebecca Ferguson was in two movies. All right, that's the last thing. That's the last thing I'm gonna say about Hill until we get to the weird 10 scene. We got to We got to talk about some we got to talk about. So",
            "start": 1551.76
        },
        {
            "text": "was in two movies. All right, that's the last thing. That's the last thing I'm gonna say about Hill until we get to the weird 10 scene. We got to We got to talk about some we got to talk about. So odd. Anyway, so they're about to get tortured and Tom's like, \"You know what though? But if I die right now, like uh nothing. You can't get [ __ ] cuz again, I'm the only person that can do any of this stuff. No one else is trained to go deep into the water. No one can find this stuff for me. Me.\" So he goes, \"Oh, check this out.\" And he's got a fake tooth, Tim. And the tooth's got cyanide. And he goes, he's like, \"Mission impossible. Red light, green light, right?\" And the guy's like, \"Oh [ __ ] it's cyanide.\" I start [ __ ] bite on that [ __ ] Don't you better not like when a little dog has something in his mouth. You [ __ ] better not bite that. Uh, so he bites down on it. He starts hing the mouth and they're like, \"Oh [ __ ] free him.\" And they un they undo his cuffs. Guess what though?",
            "start": 1585.04
        },
        {
            "text": "in his mouth. You [ __ ] better not bite that. Uh, so he bites down on it. He starts hing the mouth and they're like, \"Oh [ __ ] free him.\" And they un they undo his cuffs. Guess what though? It was just foam. It was a foam tooth. And he starts [ __ ] people up. And Gabriel stands next to his guy and they watch the first guy get his ass kicked. And then Gabriel's like, \"Get in there, man.\" Yeah. And then that guy gets his ass kicked. And then Gabriel goes, \"I think it's time for me to leave because wherever I go, Tom Cruz follows.\" And he goes like this. And like wipes the glass as he leaves. And it was [ __ ] weird. It was weird. And then they go like this. Hey guys, I know that we've talked a lot in this movie, Andy. I know that we've beaten you over the head with exposition, but we ran out of money to actually choreograph this. Let's do a joke where Haley Atwell just kind of Oh. Oh. like watches me kill this guy and then he kills him and then Tom Cruz has back and forth with Hel",
            "start": 1622.96
        },
        {
            "text": "out of money to actually choreograph this. Let's do a joke where Haley Atwell just kind of Oh. Oh. like watches me kill this guy and then he kills him and then Tom Cruz has back and forth with Hel that I just feel personally the humor here does not work at all. I don't think these two have any chemistry in this scene. I don't think they have a ton of chemistry in this movie at all. Last thing I'll say about that's it. I hated I hated this. This was a This was uh for Chad who's not going to watch this movie, you know. Uh obvious Tom Cruz gets freed. He's beating everybody's ass, but the camera stays on Haley Adwell for at least like 15 seconds while you see her reacting to the sound effects of punches and and [ __ ] like that. And it's played for comedy. It's just not funny. And then it cuts to what actually happened to these dudes and they're all [ __ ] up and bloody. And Tom Crew is like, \"What?\" He's like, \"I wasn't going to let anything happen to you.\" And he walks off camera and",
            "start": 1658.08
        },
        {
            "text": "to what actually happened to these dudes and they're all [ __ ] up and bloody. And Tom Crew is like, \"What?\" He's like, \"I wasn't going to let anything happen to you.\" And he walks off camera and he comes back. He's like, \"We got to go.\" And it just and none of it was good. I hated this so much. And Through all this, I'm like, \"Fuck, this movie is not going to be good.\" You know what the scene reminded me of? Mainly just cuz he was in a situation where he was like tied up. The scene with Re Ferguson, the scene where he beat the [ __ ] out of each guy, beat the [ __ ] out of the other guy. God. Yeah, it was cool as [ __ ] but it wasn't that. The only thing I can think at this point, and I don't know if this is true or not, but I know that Paramount Plus really like exists and really wants long movies, and I know that they're just like, \"Just put everything in this movie cuz eventually it's going to go to streaming platforms. So, we're going to need to keep people on here.\" That's the",
            "start": 1701.76
        },
        {
            "text": "long movies, and I know that they're just like, \"Just put everything in this movie cuz eventually it's going to go to streaming platforms. So, we're going to need to keep people on here.\" That's the only reason why I could think why half this shit's in this movie. McCra did a the director did an interview recently and he was saying he wanted this movie significantly shorter and he was like, I it just wasn't working. That's just not true. That's Chris. Look, I know that he has directed many movies. MQ big dog, let's talk. MQ [ __ ] I'll tell I could have told there's five scenes in this movie. We'll get to that. You could easily cut out. Why did he have to land on an aircraft carrier to get to a submarine? Why? You got to call him Mchugh. That's what Tom calls him. Got it. I digress. We're not there yet because Luther has to die because Ving Rams is like, \"Please stop casting me in these [ __ ] movies. I'm done.\" And it just didn't. And it's stupid and it doesn't hit because he's got",
            "start": 1739.76
        },
        {
            "text": "not there yet because Luther has to die because Ving Rams is like, \"Please stop casting me in these [ __ ] movies. I'm done.\" And it just didn't. And it's stupid and it doesn't hit because he's got to do the I have to save London. Why? You're Mission Impossible, man. Figure it out. I like that, Tom. Figure it out. To me, I like that you're calling him I like that you're calling him Mission Impossible. But this is the this is the problem with the first 45 minutes of this movie is it's not fun. It's bogged down and you don't care about it. And it's like there's such a thin line for these movies of cheesy fun where you're kind of in on it and it doesn't really matter what and then this just this loving the smell of our own fart moment with all of this [ __ ] where we're just so pretentiously like trying to send off this character in a fawn farewell and they just did Luther [ __ ] bad in this Luther who is the original IT guy. He's the original tech guy data guy. Do you remember when",
            "start": 1776.48
        },
        {
            "text": "like trying to send off this character in a fawn farewell and they just did Luther [ __ ] bad in this Luther who is the original IT guy. He's the original tech guy data guy. Do you remember when Fallout starts off with the Wolf Blitzer fake out? like, \"Holy [ __ ] that's one of the best openings ever.\" And the We're about 30 40 minutes in, right? I was like, \"I hate this.\" Yeah. Hate it. Hate it. Well, also I should I should mention that not only are we jumping around, we're also doing jumping around flashbacks and showing him talking to and it's very confusing as to what's going on here cuz it's boring. Uh anyway, he blows up. Luther's gone. Sorry. Bon voyage. Fawn farewell. You can join Rebecca Ferguson on Dune 4 or whatever the hell she's working on now. Uh, he was in Silo and Dune. Yeah. Yeah. And then, uh, from from this point on, we're like, [ __ ] we have to chase after Gabriel. We have to get him. And it's a labyrinth of cages that we're in, and nobody can find Gabriel. And",
            "start": 1818.56
        },
        {
            "text": "Yeah. Yeah. And then, uh, from from this point on, we're like, [ __ ] we have to chase after Gabriel. We have to get him. And it's a labyrinth of cages that we're in, and nobody can find Gabriel. And every, oh, is he there? I know he going around the corner. What's going on? We're all locked in. Oh, what's that fun box? Well, the entity has a virtual reality box. And the only way the entity can interact with you, Tim, is by bds&Ming you into this box and like tying you down and opening up your eyeballs. and you got to get in there and it just shows you I don't know if it's reality or not. Maybe this thing's got a 6090 in it cuz this [ __ ] looked all incredible but it's weird and it's like weird weird this is jumping the like we've joked for decades at this point about at some point Vin Diesel's going to go to space and it's like all right cool then the movies [ __ ] did it in whatever way they did and whatever. This is like such a dumbass like fantastical thing that like just is does",
            "start": 1859.6
        },
        {
            "text": "going to go to space and it's like all right cool then the movies [ __ ] did it in whatever way they did and whatever. This is like such a dumbass like fantastical thing that like just is does not fit this franchise. What I hated the most is all of this is done without, you know, drug inducing or anything like that. But Ethan escapes this nightmare scenario where lights and colors are beamed into his eyes and he's being shown what the possibilities in the future of the world ending. He falls out of it and he's like, \"Ah, I escaped.\" He's like, \"Are you real? Are you?\" I was like, \"Come on.\" Yeah. Yeah. You had you had extreal glasses on your face. You know what I mean? Like I don't know. I just found it so I I would have assumed maybe that reaction would be apt had he been drugged and he was not sure of but it's like he just you had VR lights pointed at your eyes showing you video of like here's what I'm going to do on the entity and then him falling on going are you real is this real",
            "start": 1905.44
        },
        {
            "text": "not sure of but it's like he just you had VR lights pointed at your eyes showing you video of like here's what I'm going to do on the entity and then him falling on going are you real is this real so stupid it remind and I'm not even [ __ ] joking when I say this it reminds me of the boat sequence from Willy Wonka in the chocolate factory where he's like there's no earthly way of knowing which direction we are going. And it's like, what the [ __ ] is happening? Is it raining or is it snowing? Anyway, he's like, \"Hey, Tom, I need you to go get the Sebastapool hard drive. Uh, oh, no. What I need you to do is I need you to let me into this vault because what I'm going to do is I'm going to explode the entire world, but I need a place to hide. I have to hide my code somewhere, and it has to be in this vault. So, you have to go do this for me.\" So, now Gabriel wants him to get the thing. And Gabriel's by the way got the he has the mind virus that's going to like allow him to control the",
            "start": 1949.44
        },
        {
            "text": "be in this vault. So, you have to go do this for me.\" So, now Gabriel wants him to get the thing. And Gabriel's by the way got the he has the mind virus that's going to like allow him to control the entity. The United States government wants the mind virus as well. They want him to do this all all the stuff we want to do whatever. Uh so there's 15 different directions Tom Cruz the mind virus is what Luther get what yeah Luther gave it just crazy later when they revealed that Luther was like hey take the mind virus it's not safe here. And [ __ ] Tom Cruz was like no no no you hold on to it. Yeah. No you're invalid and you have one nurse who's not trained watching you. And boy, she got killed real hard. Oh yeah. Anyway, Gabriel's got it, but it's around his neck and it's very big. You think it would be cumbersome underneath that suit? I don't I digress. Tom Cruz is like, \"Well, I I don't know what to do now, guys. I guess I got to go do this.\" And they're like, \"No, you can't.\" And he",
            "start": 1994.16
        },
        {
            "text": "it would be cumbersome underneath that suit? I don't I digress. Tom Cruz is like, \"Well, I I don't know what to do now, guys. I guess I got to go do this.\" And they're like, \"No, you can't.\" And he goes, \"You guys got to go find the coordinates to the Sebast. We're going to need that hard drive no matter what.\" And there's only one play. Like, you have to figure out where those coordinates were. You have to Where did it [ __ ] uh where did this thing blow up? Where did it crash? You guys have to figure it out. FFIO. Figure [ __ ] figure it out, right? Uh, meanwhile, Tom Cruz is like, \"Well, they're coming after me, so I have to go talk to the president.\" So, he turns himself in and they take him to to to NORAD or wherever this bunker is that's all analog, which by the way, all of this [ __ ] looks awesome. Like them walking through and everything being analog and the old school maps where they're like they're doing the fleet and pushing all the boats, little figurines. Very, very,",
            "start": 2034.88
        },
        {
            "text": "[ __ ] looks awesome. Like them walking through and everything being analog and the old school maps where they're like they're doing the fleet and pushing all the boats, little figurines. Very, very, very Cold War. Obviously, we're in a new Cold War here in this, but it's very, very Cold War technology with the time and the tech like the little papers. And we're see we're seeing the the map that's like lighting up red when the UK silos go down and all that [ __ ] [ __ ] awesome. Nick Offerman in this movie. I love Nick Offerman. I really really do. He cannot Well, with the exception of Last of Us, he cannot be in a movie like this. It takes me out of it every single time. It was It was a bit bizarre. I'm not as down on it as you are, but I I feel like I was questioning why he was the actor that they chose for this the entire movie until the end. Like until fine, but you could have any actor do that. Yeah. But there's something about I'm like, \"All right.\" Yeah. Like you want to root",
            "start": 2064.96
        },
        {
            "text": "that they chose for this the entire movie until the end. Like until fine, but you could have any actor do that. Yeah. But there's something about I'm like, \"All right.\" Yeah. Like you want to root for Nick Offerman. And I feel like by the end I was. And the whole time I was questioning I was like, \"I'm not rooting for him. Why am I not rooting for him?\" Yeah. Cuz it's weird. They pulled it off. But it was a little weird. So we have a very awkward scene here that could have been cool as [ __ ] where everyone all of these people who we saw in the in the other movie, the secretary of state generals, all these people that that run the United States government along with Angela Bassad who's the president are sits down and Kitrich comes in. And Kitrich I [ __ ] love. I will always love Kitri. And they're like, \"What? What's going on?\" and we need to find this hard drive. We need to be able to control the entity because if we can control the entity, we can control the world. We can stop all",
            "start": 2103.44
        },
        {
            "text": "they're like, \"What? What's going on?\" and we need to find this hard drive. We need to be able to control the entity because if we can control the entity, we can control the world. We can stop all this from happening and there's only one man that can and like well there's only one person that can do this. And they go through the litany of all the [ __ ] that Tom Cruz has done in the last seven movies. And it's kind of [ __ ] awesome. They're like, \"Wait a minute. He's the guy.\" He's like, \"Well, starting with it. He's the guy that stole the knock list uh from from Langley.\" And the one that one lady's like, \"What the [ __ ] a knock list?\" And I'm like, \"You're the head of the NSA.\" Yeah. Um, so by the way, and I love that we see the scene, right? And we just happen to see, you know, Dunlow, but whatever. He's not He's clearly not going to come back, right? Um, I don't think we have the rabbit's foot yet. I think that's a reveal later, right? Or did they already talk about that? We can",
            "start": 2137.04
        },
        {
            "text": "but whatever. He's not He's clearly not going to come back, right? Um, I don't think we have the rabbit's foot yet. I think that's a reveal later, right? Or did they already talk about that? We can talk about that anyway. They just showed a lot of the like they talk about the rabbit's foot. Yeah. Uh, by the way, just I'll probably skip over it later, but it's important to note the rabbit's foot was the thing that allowed the entity to take flight, basically. So Ethan Hunt actually set all this in motion back in Mission Impossible 3 because he stole the rabbit foot and you remember the joke with that was we don't even know what it is because it's just the mcguffin. That was an inside joke for anyone who's watched these movies is that they really understood. They were like it doesn't [ __ ] matter what he's stealing. It's a it's a rabbit foot. It's the thing everyone needs. The rabbit foot it ended up being the entity like the first version of it, right? Sure. It doesn't matter because",
            "start": 2169.6
        },
        {
            "text": "matter what he's stealing. It's a it's a rabbit foot. It's the thing everyone needs. The rabbit foot it ended up being the entity like the first version of it, right? Sure. It doesn't matter because it's a stupid retcon that they never should have done. It's tying a great movie into this beginning of this that it's just unnecessary. But either way, it's a it's Cobra Kai but without the tone of Cobra Kai. Yes. Um and without the cleverness of how to tie it in. You can't just randomly go back and be like whatever. Doesn't matter. Anyway, I digress. They're like, \"Ethan Hunt's the man. He's got to be able to do this.\" And they're like, \"Wait, did he didn't he gas you guys?\" And he's like, \"Yeah, he [ __ ] did, right?\" He comes in and he's like, \"Look, I got to steal this thing, but you guys can't have it. And I got to I got to do this my way.\" And they're like, \"Absolutely not. Take this man to prison.\" But before doing that, the president of the United States takes out an old piece of",
            "start": 2207.2
        },
        {
            "text": "can't have it. And I got to I got to do this my way.\" And they're like, \"Absolutely not. Take this man to prison.\" But before doing that, the president of the United States takes out an old piece of parchment from the the time of Leonardo da Vinci and writes a little letter on it and then has wax and a stamp because apparently that's the only way she can do Smash Brothers. Yeah. Apparently that's the only way we could do presidential seal cuz we don't have I guess docu sign. Yeah. in this universe and its outic I need to do this my way and here's my plan. I need to get on the George WH S. Bush aircraft carrier and that's going to take me to the sea. And then once my team gives me the coordinates, I need I need to take a Chinook or an Osprey, sorry, out to the middle and they're going to drop me off and then I need to get the submarine and the submarine's going to take me to the Sebastapool, right? And I great comedic moment through all of this though of you need all of these things to",
            "start": 2247.2
        },
        {
            "text": "me off and then I need to get the submarine and the submarine's going to take me to the Sebastapool, right? And I great comedic moment through all of this though of you need all of these things to go correctly in order for this to work and him being like like I I this is where the goofiness and the the humorous tone really works whenever they're like we know it's ridiculous and it's insane cuz I you've watched all these movies before. So the president of course knows the uh the captain or admiral I imagine of the the the George W. Bush uh aircraft carrier, which is like the best aircraft carrier on the plan. It's like a $6 billion. It's so [ __ ] cool. Now, she gives him a note and he gives notes to the security guard gives notes to Tom Cruz, puts one on the helicopter, gives this give this to the captain of the ship. Why does he have to go to the aircraft carrier? Why would he not just go directly to the submarine? Why was that note not for the submarine captain? And I'll explain to",
            "start": 2294.0
        },
        {
            "text": "to the captain of the ship. Why does he have to go to the aircraft carrier? Why would he not just go directly to the submarine? Why was that note not for the submarine captain? And I'll explain to you why it wasn't, Tim. Two reasons in my opinion. This is me pulling it out. One, eventually they're going to make another Top Gun Maverick. And they just want Tom Cruz on an aircraft carrier. Got it. Okay. I honestly think that is Tom Cruz aircraft carrier makes you think Top Gun Maverick makes you think greatest movie of all time, right? Yeah. Two. Apparently someone's friends with Hannah Wington cuz she's in this movie for no reason. She's the She's the blonde lady from Ted Lasso. Who's bringing her up? Oh. Oh, okay. Game of Thrones. Yeah. No. Yeah. Right. The shame. Shame. Shame. Shame. She was the shame lady Game of Thrones. [ __ ] up. You're right. Oh my god. Well, she was the more she was a good American accent. She was more notably uh Ted Lasso's boss and Ted Lasso. She owned the",
            "start": 2339.52
        },
        {
            "text": "was the shame lady Game of Thrones. [ __ ] up. You're right. Oh my god. Well, she was the more she was a good American accent. She was more notably uh Ted Lasso's boss and Ted Lasso. She owned the team. Oh wow. She was great in that film. And then she did a holiday special that was so so. Um it was okay. I don't understand. This is one of those scenes where I'm like, you could have cut five minutes out of this movie right here. We did not need to go here. She hands her the note and the woman goes, \"Cool. I I'll send you on to Osprey over to thing.\" Never comes back. never does anything important, never has to hit the button, never does it. It just is. Wait, doesn't she almost fight the Russians and she like to Well, I mean, it's it's it's a moment of tension where they stop a giant war. You know what's more intense? The [ __ ] hunt for October chasing the submarine. Let's get there. Holy [ __ ] And I'll tell you why they also put this the submarine character in first to interrupt the",
            "start": 2388.08
        },
        {
            "text": "know what's more intense? The [ __ ] hunt for October chasing the submarine. Let's get there. Holy [ __ ] And I'll tell you why they also put this the submarine character in first to interrupt the scene. And I'll tell you why. Cuz the next scene with him and the Osprey is literally taken from the Hunt for October. There's a moment where Jack Ryan has to get on the USS Dallas and they're circling and he goes, \"I don't know where the Dallas is, sir, and I can't get you on on there. We have to go back. We are at the point of no return of fuel.\" Granted, the Russian army is not out there, but he's like, \"I have to get on the Dallas.\" He goes, \"I'm sorry, I don't know what to tell you.\" So, Jack just goes, \"Screw it.\" and cuts the cord and goes into the drink, as they call it. I have to Google Osprey. What's an Osprey? Uh, the Osprey, I think, and Kevin, correct me if I'm wrong, is the one where it takes off like this and then goes and can go this way and it looks like an old school plane,",
            "start": 2423.92
        },
        {
            "text": "Osprey. What's an Osprey? Uh, the Osprey, I think, and Kevin, correct me if I'm wrong, is the one where it takes off like this and then goes and can go this way and it looks like an old school plane, but it's not. Oh, okay. Okay. The jets do this on the wings. Oh, yeah. Yeah. Okay. Not to be confused with the Chinook, which is the the helicopter that he originally takes off in, I think, which is the double blade helicopter. Him jumping into this water was [ __ ] sick. [ __ ] sick. Right. So, this point on, and granted, we're kind of in go time. This is also side steps away, but we're in go time. So, they figured out also I should I should I should take a step back because I want to I want to actually tell you guys the point. Yeah, that's an Osprey. It's [ __ ] sick. So, those are cool. Um, they used to have a couple parked off in the bay on a on a on a ship you go see. I forget which. Maybe it's a Midway or something. I can't remember the [ __ ] house. Um, this is the moment where the",
            "start": 2458.8
        },
        {
            "text": "they used to have a couple parked off in the bay on a on a on a ship you go see. I forget which. Maybe it's a Midway or something. I can't remember the [ __ ] house. Um, this is the moment where the movie starts to turn. Not this particular moment, cuz this scene is cool as [ __ ] Cuz mind you, we've set the stakes that we're on the the demarcation line between us and the Russians and the Russians are also looking for the Sebast. And so anything could be a sign of aggression of war and all that jazz and it's cool. And to Kevin's point, yes, we're trying to heighten the tension, but I just mean like it's this movie is 2 hours 51 minutes, bro. Hiden the tension by just showing another [ __ ] captain out there. We don't need to have a scene with these two people. Cut, cut, cut, cut, cut. They figure out the where this thing is, where it may may have gone down. And there's one remote outpost in the middle of the Arctic where they have to go and see if this guy's got the coordinates. And",
            "start": 2495.36
        },
        {
            "text": "figure out the where this thing is, where it may may have gone down. And there's one remote outpost in the middle of the Arctic where they have to go and see if this guy's got the coordinates. And the second they mentioned that now if you guys remember at the beginning of this podcast I said I [ __ ] called it at the beginning. You have a time code anywhere for when I when I called it? Yeah. You're talking about the beginning of the podcast or No, for when you whenever you had called this I the first the dead reckoning part one they mentioned that the there was a remote there was a remote Arctic somewhere and I said I believe and I could be misremembering this Evan or whatever. Pull it. Pull the clip. Watch the entire thing and pull the clip and put it insert it right here. But I I remember saying if they go to a remote Arctic outpost and they don't [ __ ] bring the guy back from the first mission Impossible, that is a huge missed opportunity. And as they were that you got Haley",
            "start": 2531.4
        },
        {
            "text": "saying if they go to a remote Arctic outpost and they don't [ __ ] bring the guy back from the first mission Impossible, that is a huge missed opportunity. And as they were that you got Haley Atwell, you got Simon Peg, you got the other guy whose name I don't remember cuz he randomly is just on the team now. As they're pulling up to this, I turned to the guy next to me who a random stranger. as a random stranger because I may or may not have showed up to the theater. And I literally said, \"I bet they're bringing the guy back from the first movie.\" Yeah. And the guy next to me was like, \"What?\" He's like, \"What are you talking about?\" And I was like, I I'm like I literally thought to myself, they if they didn't bring back Dunlow like that's a missed opportunity. It'd be It might And again, you're walking in you're like, \"It could be really cheesy. It might not work out.\" And holy [ __ ] this guy is the Well, actually, this guy's not the MVP. his wife is the MVP of this [ __ ] movie.",
            "start": 2578.48
        },
        {
            "text": "you're walking in you're like, \"It could be really cheesy. It might not work out.\" And holy [ __ ] this guy is the Well, actually, this guy's not the MVP. his wife is the MVP of this [ __ ] movie. The relationship between those two, the fact that this is basically just a love letter to everything that has happened in Mission Impossible up to this point. The fact that they have that wonderful conversation later where he's like, \"No, you changed my life and like I'm happy you're here. I'd still be in that little All of that [ __ ] starts right here.\" And this is where the movie becomes a [ __ ] Mission Impossible. It's very funny because like a lot of what you just said is what the first parts kind of tried to do is like let's connect things and let's bring things back or whatever and it just didn't work. This works because this is the type of [ __ ] that has emotional resonance. We actually do care and I feel like they took it the right tone like seeing him pop up. I think I was",
            "start": 2623.2
        },
        {
            "text": "it just didn't work. This works because this is the type of [ __ ] that has emotional resonance. We actually do care and I feel like they took it the right tone like seeing him pop up. I think I was sitting next to Eddie. It was this moment of like oh we all went like oh [ __ ] that's awesome. But not just in the movie like not just the second in the movie like they gave this guy lives. He's a character. So they go to the outpost and his wife answers uh and and his wife is uh I want to say Inuit. Yeah. Is that sound right? Um she was uh living there. That's how they met. And she goes, \"Come on in.\" Right. She doesn't she doesn't speak uh I don't believe she speaks English, but it doesn't matter. She She understands why they're there. The setup for this of like, \"Hey, there going to be a lot of weird like technical people and they're going to be weird and they open the door and it's just like it's just her little lovely old.\" He's like, \"Yeah, sometimes he's like, \"Follow my lead.",
            "start": 2661.52
        },
        {
            "text": "a lot of weird like technical people and they're going to be weird and they open the door and it's just like it's just her little lovely old.\" He's like, \"Yeah, sometimes he's like, \"Follow my lead. Don't worry about it. I'm telling anything. And it's just this. They're just there. It's just the two of them, right? So, of course, Dunlow walks in and I lose my [ __ ] He's got a beard. He looks good. He looks awesome. What a head of hair. [ __ ] head of hair. This guy's got him, right? Head of [ __ ] hair. Oh, lord. And he's like, \"Hey guys, I know exactly why you're here. You're here for the coordinates this like that that the sub that went down and uh and uh unfortunately the Russians beat you to it.\" And this guy that plays the Russian bad guy is awesome. He's been in other [ __ ] too. He's always dashing bad guy. I [ __ ] This is where we start. I'm like, \"Fuck yes.\" If nothing else happens in this movie, at least we got this cool scene. They're in the Arctic camo. They look cool.",
            "start": 2701.76
        },
        {
            "text": "He's always dashing bad guy. I [ __ ] This is where we start. I'm like, \"Fuck yes.\" If nothing else happens in this movie, at least we got this cool scene. They're in the Arctic camo. They look cool. Everyone looks [ __ ] cool. We're setting the stakes. You can't go outside cuz it's flashbite on your nose. Maybe there's a fire in here. Immediately, the gears start turning in your mind. You're like, \"How do they get out of the situation?\" If you're immediately worried cuz you go, \"Shit, Ethan Hun's about to embark on the most crazy thing possible to try to get these coordinates in time at the right perfect moment in these 10minute intervals or whatever and they're going to get them from Donlow. Holy [ __ ] the Russians are here. How the hell are they going to pull this off?\" And at this point is has Tom Cruz already Tom Cruz is now has gone into Tilman, what's his name? Um, oh, the sub from Severance. From Severance. I'm blanking on his Well, at this point, we'll just skip ahead. He's",
            "start": 2737.68
        },
        {
            "text": "is has Tom Cruz already Tom Cruz is now has gone into Tilman, what's his name? Um, oh, the sub from Severance. From Severance. I'm blanking on his Well, at this point, we'll just skip ahead. He's on the sub now. And they tase him and I like, was that necessary? And the lady from Love Lies Bleeding, I think, is in this, too, right? What's his name? [ __ ] We'll look it up. So, now we meet this crew of people that are on on the sub. Uh, I want I want to say the the the lady in this is the lady from Love Liies Bleeding. She's like jacked out, dude. Katie, is that her? Is that the same actress? O'Brien. Katie O'Brien. I want to say she was also in um Ahsoka Star Wars. She's so [ __ ] awesome. She's [ __ ] cool. She's everything I've ever seen her in. She's a badass and like her being in a Mission Impossible movie incredibly sweaty the entire time. Everyone's so perfect. It's [ __ ] perfect. You don't know this about submarines. Okay, cuz you don't you never watched her hunt for October.",
            "start": 2780.4
        },
        {
            "text": "Impossible movie incredibly sweaty the entire time. Everyone's so perfect. It's [ __ ] perfect. You don't know this about submarines. Okay, cuz you don't you never watched her hunt for October. Even though I [ __ ] asked you, they're always sweaty. Even though I [ __ ] asked you. You could see the color of the lights glistening off the sweat of everyone's faces in The Hunt for October. She's so [ __ ] awesome in this movie. And I I just want I want her in more big action movies and I think that this is like step one for that. [ __ ] awesome. And put on the team next. That's what I say. I think the next I think the second that Traml Tilman pops up though is like that's when the [ __ ] starts that's when the comedy for me starts working. Big smile for me is like oh yeah I forgot he was in this. He keeps calling him mister or whatever it is. I always see his name. I always want to call him Tremble Triml. Yeah, it sounds right. My my We're talking about the submarine captain, right? Yeah.",
            "start": 2826.64
        },
        {
            "text": "He keeps calling him mister or whatever it is. I always see his name. I always want to call him Tremble Triml. Yeah, it sounds right. My my We're talking about the submarine captain, right? Yeah. Yeah. Who's awesome in this? And that's why that's why I'm disappointed that they wasted time. Again, no respect to Hannah. Love her. But this dude, this dynamic, how did you not sit in the edit and be like, \"Let's get rid of that other [ __ ] That [ __ ] just bogs this stuff down.\" This is awesome. Katie O'Brien was in Mandalorian, not Andor. Yeah, fair enough. Um, so here's the blame. They got this cool experimental suit that'll allow you to breathe some gas that we're not even going to tell you what it is, right? Uh, and it can take you down, okay? But they start going like they do the Mission Impossible thing, and I kind of wish they didn't, but they do it where he's he's like, \"What the [ __ ] is your plan here?\" goes, \"Well, I need you guys to surface. My team's going to beam",
            "start": 2864.0
        },
        {
            "text": "Mission Impossible thing, and I kind of wish they didn't, but they do it where he's he's like, \"What the [ __ ] is your plan here?\" goes, \"Well, I need you guys to surface. My team's going to beam coordinates out into the universe every 15 minutes. You guys are going to pick it up. You're going to take me there. Um, and hope to God the Russians aren't listening or whatever on these on these old school VHF channels or whatever it is.\" And then I have to go down there. I have to get this thing and then I have to surface. And he goes, \"Okay, well, let me just explain to you. When you surface that quickly, you're going to get the bends, which is like the nitrogen and your and your muscles are going to it's going to expand so hard. It's going to curl you up. You're going to die. It's going to decompress and then you're going to have to decompress.\" And they're like, \"Don't worry about it. Instead of being a decompression chamber, I'm not gonna do We have a little tent. It's very",
            "start": 2899.36
        },
        {
            "text": "going to decompress and then you're going to have to decompress.\" And they're like, \"Don't worry about it. Instead of being a decompression chamber, I'm not gonna do We have a little tent. It's very experimental, but Haley Out will be in there, too. Now, I don't know anything about decompression. No, no, no. Well, here's the thing. No, no, no. He doesn't tell them about the decompression thing. We know that that's part of the deal, but at this I I think Treml Tim, bring back one of those uh popes. Traml Tilman is is explaining you'll have to be in this thing for Yeah. He's telling him like, you're going to have to get to a little decompression thing. We need that big ass tank we're going to take with you or whatever. And then eventually the plan kind of gets [ __ ] and he goes, \"Wait, well, how are you going to decompress?\" And he's like, \"I'll be honest with you, man. That was never part of the plan.\" Yeah. It was great. I'm just going to die. So great. I'm just going to die when I",
            "start": 2927.92
        },
        {
            "text": "how are you going to decompress?\" And he's like, \"I'll be honest with you, man. That was never part of the plan.\" Yeah. It was great. I'm just going to die. So great. I'm just going to die when I get this mate. So, uh, we I don't, again, this is where it's a Mission Impossible movie. Who gives a [ __ ] right? But I'm pretty sure, and again, I know nothing about saturation diving. I know nothing about compression. I know nothing about any of that. But I'm pretty sure if you don't immediately go from the depth that you need to be in into a decompression chamber, if you just pop up very very fast, I don't know that that's I think you I don't know. Maybe I guess you have to, right? I guess you get up there and you go into the chamber, right? Yeah. Well, I mean, we've seen deep sea divers like as soon as they get back up have to take all their [ __ ] off and then immediately get in. But it's like way more rushed. They also like if you spend a lot of time in there, they can do a thing where",
            "start": 2964.56
        },
        {
            "text": "as soon as they get back up have to take all their [ __ ] off and then immediately get in. But it's like way more rushed. They also like if you spend a lot of time in there, they can do a thing where they have like a chamber that's underwater. That's so that's what I've that's what I'm talking about. Like when you go really really low, don't they do like a decompression chamber midway and then another one up here so your brain doesn't explode. You're in like a chamber that's slowly Oh, that's slowly rising. Yeah. Well, it's not rising. It's the pressure is changing. Remember, it's how they decompress you. It's how they wanted to kill Godzilla and Godzilla one tough rush back to the surface. Is it a good show? Watch it. Um the uh Oh, you never watched that one? No. Oh. Oh, Kevin, you would love that. Oh, it's so good. And I'm not a big Godzilla guy. Um the the tech in the suit though. Very like this is like all experimental crazy cool suit. Of course. All experiment. And apparently the",
            "start": 3004.56
        },
        {
            "text": "love that. Oh, it's so good. And I'm not a big Godzilla guy. Um the the tech in the suit though. Very like this is like all experimental crazy cool suit. Of course. All experiment. And apparently the suit is all just one suit. You can't possibly take the backpack off and shove it through a torpedo tube. You have to be naked. Yeah, you got to be naked. Now, I'll tell you one thing right now. Couple things going on in this we got to talk about. Okay. While Tim's gone because he's always such a [ __ ] fddy duddy. He's such a stick in the mud. We can't talk about how good he's like, \"Look, you can't objectify Tom Cruz's [ __ ] hot 60-year-old body.\" Okay, be cool. But man, this dude looks [ __ ] good in tidy whies. He looks in those little boxer briefs that he wears. He looks good. He's got to have a blood boy. He's got a blood boy. We got to get blood boys. He's got to have a hair boy, too. Jesus Christ, guys. I mean, a blood boy. Does that mean what I think it means? Yeah. You take you",
            "start": 3041.84
        },
        {
            "text": "have a blood boy. He's got a blood boy. We got to get blood boys. He's got to have a hair boy, too. Jesus Christ, guys. I mean, a blood boy. Does that mean what I think it means? Yeah. You take you hire someone who's 17 years old and they have no money and you pay them a lot of money to have their to transfuse their blood into you so that you you look good. That's fine. Barry's fine. Oh, I thought Tim walked up with a drink to tell Nick saying there's no more. But I thought he's walking up to be like, \"Yeah, stop bothering.\" Now, I confirmed it. The thing about Tom Cruz that is amazing is he's very good at very good at giving you something and also taking something, right? It's good. It's that good shift of tension. So for every time he looks great shirtless, I then look at his hair and his hair in this movie. I didn't like the style of it. It's so weird. I didn't like it. It's so bad. Oh, Tom Cruz. Yeah, it's so long. Why is it long? I love it at the end though when he's on the plane",
            "start": 3087.36
        },
        {
            "text": "hair in this movie. I didn't like the style of it. It's so weird. I didn't like it. It's so bad. Oh, Tom Cruz. Yeah, it's so long. Why is it long? I love it at the end though when he's on the plane and it's just boopping around everywhere and it pulls back on him. He looks so silly. That honestly it looks okay here. It's the beginning of the movie where I I think they did some re-shoots where it's got it's like a wig or something, man. It's not looking good at the beginning of this film that when it's wet, it looks awesome. I just think the shorter hair works. Shorter hair is way better. Yeah. Uh so Tim, to catch you up, we're on That's Oh, yeah. That's kind of uh we're on the the sub now and he's training and he's naked. He's he's like doing the saturation training or whatever to like get his blood and he's running his Tom run like that. It's just the coolest thing ever. It reminds me of what, Nick? Uh Tom Gun Maverick. Exactly. In the very beginning when he's training to do the like",
            "start": 3130.64
        },
        {
            "text": "his blood and he's running his Tom run like that. It's just the coolest thing ever. It reminds me of what, Nick? Uh Tom Gun Maverick. Exactly. In the very beginning when he's training to do the like going fast. He's the fastest man alive. God damn. I want to watch that movie tonight. I'll tell you what. I'll tell you what we're gonna talk about in a second because uh we're still we're up at we're up in the Arctic, right? And uh Dunlow's like, \"Look, man, these guys want the coordinates. We got to go through all these magnetic drives, but I'm gonna be real with you.\" Like, by the way, first off, I was [ __ ] fascinated. I was like, \"You could do 20 minutes of this movie. I know I just complained about it being too long.\" I like, \"You do 20 more minutes on these two building a [ __ ] magnetic reader for these old discs?\" I was like, \"You can do that?\" And they're like, \"Yeah, we'll just figure it out.\" I was like, \"That's [ __ ] cool, right?\" But he's sitting there talking to Simon Peg",
            "start": 3164.08
        },
        {
            "text": "reader for these old discs?\" I was like, \"You can do that?\" And they're like, \"Yeah, we'll just figure it out.\" I was like, \"That's [ __ ] cool, right?\" But he's sitting there talking to Simon Peg and he's like, \"Hey, man. uh that team a team came a long time ago and took all this [ __ ] and even then it it wasn't there but I memorized the coordinates and I'm going to write them down for you just so you can get them and then all hell breaks loose cuz there's wolves outside there's a fire that happens all the wolves outside the wolves are hungry huskys you know they do the IDIDA rod sort of like husky thing and the the dogs you ever seen that video where the where it's they're doing the IDA rod and one of the huskys despite so they're all dragging around he's just trying to like skate as the shit's coming out of his I've never seen that. I've never seen that. It's awesome. It's like the bad guy like, \"Fuck, stop. Stop.\" He just turns it out. But what's what I love so desperately about",
            "start": 3197.84
        },
        {
            "text": "shit's coming out of his I've never seen that. I've never seen that. It's awesome. It's like the bad guy like, \"Fuck, stop. Stop.\" He just turns it out. But what's what I love so desperately about Nick Scarpedo is that he'll say like, \"You ever see that video where this happen?\" It's like, as he talks about that dog video as if it's like one of the the alltime like this is fine meme or something. You know what I mean? It's like in my world that's very important. Um it's on his algorithm. Yeah, the dogs are are barking. They're hungry outside. And then William Donald looks at all these Russian uh you know, spec ops or whatever. And he's like, \"Can my wife go feed the dogs?\" Like some, you know, they're really really hungry. That's why they're barking and being annoying. They're not going to shut up. And then Haley Atwell's like, \"I can go with her.\" And at first I at first I thought they weren't going to send a Russian. Yeah. I was like, \"Wow, these guys are very trusting.\" And I was",
            "start": 3233.68
        },
        {
            "text": "to shut up. And then Haley Atwell's like, \"I can go with her.\" And at first I at first I thought they weren't going to send a Russian. Yeah. I was like, \"Wow, these guys are very trusting.\" And I was like, \"That's would never happen.\" I think even though that they did, I thought it was a little weird. Like for how intense all because for sure they were going to kill everyone. Yeah. So why so why give a [ __ ] No, you're not going to feed the dogs. You're going to die. I'm going to kill everyone in here when we're done with this. There's leave, you know, no trace of this is going to be left alone. Cool little cool moments of tension of them talking to each other about what they need. And then but I like the wife's like this. Hey, hit him over the [ __ ] head. Yeah. No, but I love the moments of of Haley Atwell talking to these uh to the Russian dude and being like, \"Um, yeah, let's just talk person to person. Would you trust Yeah. like do you believe me?\" You know, and like he goes,",
            "start": 3277.52
        },
        {
            "text": "of of Haley Atwell talking to these uh to the Russian dude and being like, \"Um, yeah, let's just talk person to person. Would you trust Yeah. like do you believe me?\" You know, and like he goes, \"Will you trust me if I you were in my situation?\" And then it gets flipped. Would you trust me if you were in my situation? No. Hell no. I would [ __ ] stalemate again. Cold War politics, right? That's what Cold Wars are all about. It's like the old trust but verify. Yeah, exactly. Snow dogs Russia. Uh, so this goes down, man. And I'll tell you what, this is a great action sequence. The fighting, the choreography in this, the shooting, all that stuff. [ __ ] 10 out of 10 for me. I thought it was super cool. Anytime a building's burning around someone, you have cool karate happening. It's fun. How did it light on fire? Uh oil lamp, I want to say. Like a thing over the whole cabin that they live in starts like being ignited while everybody's fighting against the Russians. Yeah, these these",
            "start": 3317.36
        },
        {
            "text": "How did it light on fire? Uh oil lamp, I want to say. Like a thing over the whole cabin that they live in starts like being ignited while everybody's fighting against the Russians. Yeah, these these Russian dudes. And it's pretty tense. It's They get away, but they end up I think Dunlow stays behind to to to transmit the coordinates and then finally the USS uh submarine gets the coordinates. Here's what I hated. Massive plot hole, Nick. When you and I are playing war zone and we know a team's in that house and the circle's closing in. Mhm. What do we do? We usually wait outside that house for when they Well, I go to all the cash registers and make sure I get money even though there's nothing to buy and it's the final circle. But we know a team's coming out from that house. Shoot them when they come out. Yeah. I don't know what the like why the Russians what were they doing? Why how did they not cuz they left, right? We saw the main dudes like leave the cabin. Yeah. While everybody was",
            "start": 3355.12
        },
        {
            "text": "they come out. Yeah. I don't know what the like why the Russians what were they doing? Why how did they not cuz they left, right? We saw the main dudes like leave the cabin. Yeah. While everybody was struggling to leave and they were trying to save William there cuz William was out there doing the Morse code, sending the codes out or whatever, trying to do that in time. But like the Russians just left without I think because they got the code. I think because they were listening also my my my brain was just like oh like this is what we're here for. they were here for the code went out and someone was like we got it because of course we've set the stake here of what is the mission do you guys remember the original mission of the US submarine of the US submarine so Tilman what's he says he's like what are you doing in this ocean he goes my I have two jobs one one is to surveil and basically I have one job it's to sur it's to find and I forget how he phrases it but it's to find, we'll",
            "start": 3399.12
        },
        {
            "text": "like what are you doing in this ocean he goes my I have two jobs one one is to surveil and basically I have one job it's to sur it's to find and I forget how he phrases it but it's to find, we'll call it the hunt for October, which is this badass, brand new, top-of-the-line, super secret uh Russian submarine. He goes, I have to find and like he had a term where he's like and give trouble to or cause trouble for this Russian sub. I was like that is the coolest [ __ ] thing you It was just this just this subtle term that you use for basically like I want to get in this [ __ ] thing's face and like give it some grief, you know? So, we set that up. Well, that funny line of dialog he had with him was, \"If you're looking for someone to poke the bear, yeah, you found it. You found the right person, mister.\" Um, Kevin, what were we going to say? Oh, I was just going to say that the poke the bear thing of like what a great introduction like where they, you know, he jumps into the water, a",
            "start": 3444.92
        },
        {
            "text": "person, mister.\" Um, Kevin, what were we going to say? Oh, I was just going to say that the poke the bear thing of like what a great introduction like where they, you know, he jumps into the water, a bunch of guys just knock him out and take him. And then he wakes up and this guy's like, \"Oh, you want to poke the bear?\" Yeah, this guy's just down. I love poking bears. This guy's This the whole team here is awesome. It's a weird vibe, but you but they have the same vibe. You're like, \"Oh, you guys are a team. You guys have been doing this for a while. In a very different universe, they are their own cast. In a different universe, he's running that team. He's running that crew of people. Also, we we forgot like we really didn't mention it. It doesn't need to be mentioned, but like the acolytes of like the AI where they're just a bunch of people that are like, \"Oh, we love the AI. We're going to help it.\" Or the AI is like blackmailing people or whatever. And it's actually a good point",
            "start": 3487.52
        },
        {
            "text": "of like the AI where they're just a bunch of people that are like, \"Oh, we love the AI. We're going to help it.\" Or the AI is like blackmailing people or whatever. And it's actually a good point to be mentioning right now because there is one of those guys who's on the ship tries to kill Ethan and while the fire is burning down, he's rolling around with this guy. Oh man. And dude, he jumps on the treadmill. [ __ ] it, dude. Damn. Yeah. Him falling on the treadmill, but then the face on the treadmill, it was like the moment the treadmill was introduced, it's like a treadmill in the first act. We're about to get some Mchugh goodness here. And they delivered cuz they kept fighting around it and it's like, \"Oh, they're going to eventually get back to it.\" And they do in the most brutal way pos like everyone winced in the theater. That was crazy. This fight scene was crazy. It was great. It was visceral. It was loud. It was intense as hell. Like this is already where your body's like, \"Oh,",
            "start": 3522.72
        },
        {
            "text": "like everyone winced in the theater. That was crazy. This fight scene was crazy. It was great. It was visceral. It was loud. It was intense as hell. Like this is already where your body's like, \"Oh, [ __ ] This is awesome.\" So, and then that dude who tried to turn on Tom Cruz gets knocked out. Knocked out by uh what's her name, right? Doesn't she knock him out? Someone knocks him out? Yeah. Katie, was it Katie O'Brien? I want to say Yeah. But now it's time. We got to go. We got the coordinates. But the hunt for October is behind us. It's been following us. So sick. And now those scenes of like Stop, stop, stop, because we're going to get to this in a second. They know. No, no, they know that it's behind him, but they don't know how close it is. But the Russians don't know the coordinates. They know the [ __ ] They know the sub's there, and they know the sub knows the coordinates. They're like, \"We're just going to follow you. Figure it out.\" Did the Russians know that the Americans",
            "start": 3558.16
        },
        {
            "text": "They know the [ __ ] They know the sub's there, and they know the sub knows the coordinates. They're like, \"We're just going to follow you. Figure it out.\" Did the Russians know that the Americans submarine was there? Cuz I thought, \"Okay.\" Yes. Which is why they were like, \"We he needs to sneak out of this cuz they don't want basically he was like, \"They know we're here. I want you guys to go go get me close enough.\" And then boom, make a U-turn and get these guys to follow you no matter what. I don't want any Russians in the water, basically. So like, okay, cool. We put him in the tank. He's got the cool mask on, right? The light. See Tom Cruz's face. Katie O'Brien goes, \"Hey, don't [ __ ] up my suit.\" Cool line, right? Lock him in. Tank starts to flood. We see their faces. They're a little scared for him, but they're badasses. And he's a little scared, but he's a badass. Now, was anyone expecting the back door to open up? Because when it did and he looks out and we see the [ __ ]",
            "start": 3604.56
        },
        {
            "text": "scared for him, but they're badasses. And he's a little scared, but he's a badass. Now, was anyone expecting the back door to open up? Because when it did and he looks out and we see the [ __ ] hunt for an October 15t away from him, I thought to myself, this is where the greatest Mission Impossible movie ever made starts, right [ __ ] here. And from this point on, every single thing he did underwater, this movie does for underwater sequences, what Top Gun Maverick did for aerial sequence. Honestly, you could not have said that better. This entire sequence, riveting. Riveting. Every single they they made the most of the set piece. Nothing will ever be cooler on a submarine ever again. This shot of him looking out and seeing it trailing them is the single coolest [ __ ] shot of any like action movie I've ever seen. It was terrifying. Terrifying. It was so scary. It was awesome. And he's got to just It's like everyone's deepest fear when you look into an ocean and see you can't see the",
            "start": 3643.84
        },
        {
            "text": "movie I've ever seen. It was terrifying. Terrifying. It was so scary. It was awesome. And he's got to just It's like everyone's deepest fear when you look into an ocean and see you can't see the bottom of it. That's what this I mean, it's awesome. Kevin, what were you going to say? There was also a little bit of setup of like, hey, you're going deeper by a lot than this stuff's ever been tested there. You will have the bends and you will hallucinate stuff. Just a heads up. And it's like when they go in the goddamn Sebastiful. Yeah. And it's like, oh, it's it's so well set up and it got So, let's let's talk about this for a second. We we'll break it down a little bit and you guys fill in the gap. So, I I listen, right? So, he get he starts sinking and he's sinking and sinking. It very much reminds me of the abyss where he's just sinking [ __ ] It's so sad. Um, gets down to the bottom, sees I think what he thinks is the Sebastapool, which is sitting on a shelf, right? It's kind of",
            "start": 3697.44
        },
        {
            "text": "much reminds me of the abyss where he's just sinking [ __ ] It's so sad. Um, gets down to the bottom, sees I think what he thinks is the Sebastapool, which is sitting on a shelf, right? It's kind of sitting cockeyed on a shelf, but he can't quite see. So, what does he do next? Oh my god. Pops straight like flares. Yeah, he does. Straight out of Metal Gear. Dude, this is the coolest thing. And they go really far to the point where I was like, \"Oh, there's other divers in the water.\" And I was like, \"Oh, no. Those are just his flares that went.\" Yeah. I thought there were other divers when we saw the other ones. So cool. Opens up the hatch, floods the hatch, but in doing so, it changes the I guess the buoyancy of the boat and it starts to roll. Oh my god. So now So now it's rolling with all of these warheads around him. Warheads everywhere. It's rolling. He's got to go from compartment to compartment to compartment to get into where the big hard drive is, right? And this thing's rolling",
            "start": 3740.56
        },
        {
            "text": "of these warheads around him. Warheads everywhere. It's rolling. He's got to go from compartment to compartment to compartment to get into where the big hard drive is, right? And this thing's rolling and there's nuclear warheads that are about to [ __ ] explode. All they pin them down. They don't pin him down. It doesn't matter. I don't know that I've ever uh been in a theater that has had this much like crowd participation in a quiet way consistently where it was like every 30 seconds everyone would go, \"Yep, yep.\" And this is why you should see this movie in theaters. This is the shared experience that Tom Cruz is always talking about. This is why he makes movies and this is why we enjoy those is this. Thank you, Snowback Mike. We totally missed the part of him banging off the other submarine. Wild [ __ ] having to like hold on to the the flap of the submarine so that the propellers don't kill him cuz the massive scary submarine that Nick was mentioning being this huge foring",
            "start": 3780.08
        },
        {
            "text": "submarine. Wild [ __ ] having to like hold on to the the flap of the submarine so that the propellers don't kill him cuz the massive scary submarine that Nick was mentioning being this huge foring presence. He has to go past it. And then you think about people getting sucked into like whenever a ship goes down, you get pulled down with it usually. as he's kind of like spinning around and like, you know, getting [ __ ] up as he's bouncing off the side of it. That propeller was so close to clipping him. Dude, it is so amazing. So, he goes down. He's in this thing, man. He's in it. He's in it. And I love the visual of this big ball cuz it looks like the core of a nuclear bomb, right? You ever see like the the uranium core, whatever? We've all seen that, right? It reminds me of uh like um cerebrum cerebro cerebro. There we go. audio listeners. Nick put his hand to his temple as if he's Professor X. So he gets in, pulls the hard drive, puts it in his cute little sack. Yeah. I imagine the",
            "start": 3820.88
        },
        {
            "text": "cerebro cerebro. There we go. audio listeners. Nick put his hand to his temple as if he's Professor X. So he gets in, pulls the hard drive, puts it in his cute little sack. Yeah. I imagine the sack's waterproof, right? Is everything waterproof, right? I assume so. Waterproof. I got to assume this [ __ ] is just like waterproof as as I have to imagine everything's waterproof, right? Puts it in a sack, has to get out, but when he goes back out, bam, the nuclear warheads jam everything. So his only way out is through torpedo tubes. Torpedo tube number one. Not gonna open, right? Floods. Oh [ __ ] it's not. This thing's rolling down the hill, by the way. And you have to like toward the abyss. At this point, I think that was scary, dude. Yeah, the dead this thing. The way that the water kept shifting and stuff. It was like third act of Titanic, but an action scene. So it's like the water like the it reminded me of Leonardo's character was a highly trained CIA operative. It's funny you",
            "start": 3865.48
        },
        {
            "text": "shifting and stuff. It was like third act of Titanic, but an action scene. So it's like the water like the it reminded me of Leonardo's character was a highly trained CIA operative. It's funny you bringing up Leo because Titanic mixed with Inception. Like this is like the hallway kind of spinning fight scene but with water as well. Like [ __ ] this was so this is so well choreographed and so well like beat out from like a cinematographer perspective, from a pacing perspective that you have to imagine they were like look dude we have limited resources. We're going to throw our all with this in the plane sequence. And honestly I'm not mad at it. I just wish that they paid their editor five more dollars just going into a hacksaw in the first 25 minutes of this movie. Torpedo number one, no good. Torpedo tube number two, pretty good. Got to get into it. Uh-oh. Guess what? My pack doesn't fit in there. Now, I guess if you had the presence of mind, you would just unbuckle yourself. But he",
            "start": 3910.56
        },
        {
            "text": "good. Torpedo tube number two, pretty good. Got to get into it. Uh-oh. Guess what? My pack doesn't fit in there. Now, I guess if you had the presence of mind, you would just unbuckle yourself. But he was like, \"Fuck that. I got to cut myself out so that I can I can show everyone that daddy's daddy's been doing Pilates.\" is goes through it, stuffs the pack through in his little tidy whies in his little box of briefs. Right guys, this is so scary cuz I'm super scary. Is he not just going to implode here? Like I I did not understand the physics of all of this. The pressurization's fine. He's already pressurized cuz I guess he's gone down. Going down. You can always is fast. You can't go up. That's how pressure works, I think. Um he's in the tube and this is where my claustrophobia starts kicking. We're in a big theater. I'm freaking out. I'm telling the guy next to you don't remember me. That was the guy who whispered to you earlier about download. Remember down low? Yeah, you eat it",
            "start": 3951.4
        },
        {
            "text": "kicking. We're in a big theater. I'm freaking out. I'm telling the guy next to you don't remember me. That was the guy who whispered to you earlier about download. Remember down low? Yeah, you eat it like I'm claustrophobic. You can eat that popcorn. I do feel bad cuz the guy made a joke about he was like, \"Oh, your popcorn looks really good. You want to share it?\" And I was like, \"Yeah, I'll share. I ate the whole [ __ ] thing. I didn't share with him. [ __ ] you. Get your own popcorn.\" That's my friend Andy over there. He never gives me his Sour Patch Kids. Andy? Yeah. And Andy never gives me his pocket candy. So he gets out and it's awesome. And it's flipping around, flipping around, flipping around and he gets caught as this thing going down. His little thing's getting caught and he's Of course, we know we have what has to happen. He's got to [ __ ] raw dog it. My god. Tom Cruz has to raw dog in every movie. At least one scene. Whether it's rock climbing, whether it's scaling a",
            "start": 3993.6
        },
        {
            "text": "Of course, we know we have what has to happen. He's got to [ __ ] raw dog it. My god. Tom Cruz has to raw dog in every movie. At least one scene. Whether it's rock climbing, whether it's scaling a building, whether it's hanging onto the [ __ ] plane, you put anything around him and he just it just don't feel the same. Yeah. So, he takes the mask off and starts going up. I was so scared right I didn't get it. How so amazing obviously from a visual standpoint, but thematically also him shedding all of these things. This is the final reckoning. We have our our character who's been with us forever and he's shedding all of these pieces of mission and he just has to get to the surface. He has to get to light, right? Of course, he's going to heaven, right? He's dying and he gets up there and he's banging on the [ __ ] eyes. No one's there. Oh, Haley Outwall is there. Real quick, awesome perspective change. the moment where they have the the conversation where they're going over the plan and",
            "start": 4027.2
        },
        {
            "text": "banging on the [ __ ] eyes. No one's there. Oh, Haley Outwall is there. Real quick, awesome perspective change. the moment where they have the the conversation where they're going over the plan and they're like, \"And so we have to be there at the exact moment that your transponder connects so that we can dig you out.\" And he's like, \"Yeah, but also uh because the temperature is so low. It'll slow my metabolism down. I essentially I won't die. You'll be able to resuscitate me more time.\" I I felt cold watching this. Like this is the idea of every even just being there in the suit's cold. when he's just [ __ ] naked just swimming up this thing like how deep he was. It's like this he was deep. These movies have done some crazy like no way this could possibly have [ __ ] I think this might be the most outlandish thing. But I didn't care. It [ __ ] worked, man. This [ __ ] Who cares? Who cares? Because this is why you went to see this movie. And honestly, this scene alone, you I would have",
            "start": 4070.4
        },
        {
            "text": "the most outlandish thing. But I didn't care. It [ __ ] worked, man. This [ __ ] Who cares? Who cares? Because this is why you went to see this movie. And honestly, this scene alone, you I would have paid 20 bucks just to watch that scene. The submarine sequence just to watch this [ __ ] scene. It's so [ __ ] cool. It is exactly why we love Top Gun Maverick. Why do they have to do who the [ __ ] Who cares? Who gives a [ __ ] what's in the [ __ ] bottom of this gully? We got to fly up and we got to go down and we got to do this and we got to go that and I want to see though after top after Top Gun Maverick having these uh you know undisclosed European countries or you know like we're not going to say their name. We straight up were like [ __ ] you Russia, you're the bad guy again. Um yeah, dude. Like I think because of how everything was set up with pressurization, depressurization, the temperature of everything, it's a [ __ ] nightmare. And so when he's trying to shed himself from the",
            "start": 4117.2
        },
        {
            "text": "dude. Like I think because of how everything was set up with pressurization, depressurization, the temperature of everything, it's a [ __ ] nightmare. And so when he's trying to shed himself from the thing pulling him down and you see him bust out the kn like I thought he's just going to cut the suit off and I was like, \"Oh, he's going to keep the mask on because Yeah, he and then he just takes all of it off and I was just like, there's no way, dude. You're going to die. Like this is death.\" That was terrifying, dude. Well, it's not death because it's Haley Atwell. Yeah. Well, are they going to make me out? Is he Is this his daughter? I don't know what the relationship is here. It's not They don't have chemistry. I don't like this. It's If that was Rebecca Ferguson, this would have been one of the best most tender moments of the whole thing. God, he's makingense with Haley Atwell. And again, it's not it's not a knock of the character. It's just they didn't give her they didn't give",
            "start": 4156.56
        },
        {
            "text": "one of the best most tender moments of the whole thing. God, he's makingense with Haley Atwell. And again, it's not it's not a knock of the character. It's just they didn't give her they didn't give them any real moments for me to make this really They didn't have time to because they had to give her five minutes of slow-mo of her chest titty. Yeah, it was the most insane. I didn't all I had noticed that honestly Tim here. I'll say this. I'll say this. As the titties are doing their thing, I I was like true. He's not wrong. I was like they're doing like a and then they kind of cut away. I was like in their minds I bet you they were like can we go more? Yeah. Like we cut it off but I think we could do more. And then they didn't. So like as it's happening to him, we are thinking the same thing. We're we're seeing her resuscitate him and the you know then things are thinging and as it keeps on going I and then it kind of cuts off sooner than I thought they would. And I was like oh they",
            "start": 4198.88
        },
        {
            "text": "We're we're seeing her resuscitate him and the you know then things are thinging and as it keeps on going I and then it kind of cuts off sooner than I thought they would. And I was like oh they cut it out there because they know we're not going to we're not going to milk this. No pun intended. Yeah. We're going to cut it off here so that we can't be accused but you're getting accused cuz like you really just wanted that angle. I so I I I I don't know what you're talking about because I felt like in my memory they cut away and cut back 10 times and this thing lasted like 15 minutes. Like I was like I can't believe I'm shocked it didn't go long how gratuitous this is. That's right. I'm with you guys. I legit don't know what you guys are talking about. I honestly don't remember. Oh, so I I'll explain for everyone. So Ethan wakes up in the decompression tank or tent that uh Haley Outwell and the wife have set up. And by the way, by the way, we do get a before I gloss past it, we get a",
            "start": 4246.56
        },
        {
            "text": "I'll explain for everyone. So Ethan wakes up in the decompression tank or tent that uh Haley Outwell and the wife have set up. And by the way, by the way, we do get a before I gloss past it, we get a wonderful moment of comedic comedy where the wife's like, \"Hi.\" Like, you know, and from the window, uh, but Haley wakes up and she has to give him CPR, but she's in basically just a tank top. And I'm not sure why because we are still in the Arctic, right? Even when they were filming, they were [ __ ] freezing. Yeah, but her clothes can't get depressurized. I guess not. I guess you can't wear jacket. Yeah, like you would imagine like I guess they must have a heater. I guess whatever. But anyway, yes, there it was a gratuitous amount of of uh of cleavage in this particular moment with the with the shake in with imagine a camera basically between a human being's breasts. That's what these these shots were. Uh he's saved. He comes back. Ah, I'm Tom Cruz. My hair's still here. I got a blood",
            "start": 4289.28
        },
        {
            "text": "the shake in with imagine a camera basically between a human being's breasts. That's what these these shots were. Uh he's saved. He comes back. Ah, I'm Tom Cruz. My hair's still here. I got a blood boy. Mhm. Then we get on the plane and we get the sequence that I've been waiting for the entire time where they had to go. Okay, look. Uh we got to go to this under this bunker. Here's the plan. We got to go to the bunker. This is where all of the important information of the internet is stored just in case nuclear apocalypse happens. And who the [ __ ] knows billions of years from now, someone will find this and rebuild or the AI will take over. It doesn't matter. This is where the entity is going to hide. But we happen to have a 380 gajillion terabyte glowing [ __ ] infinity stone that's here. Where the [ __ ] did you get Why didn't I see you steal that? That would have been cool. Open the movie with that. This thing looks like it's [ __ ] Loki's, you know, the the tesseract for Christ",
            "start": 4332.0
        },
        {
            "text": "Where the [ __ ] did you get Why didn't I see you steal that? That would have been cool. Open the movie with that. This thing looks like it's [ __ ] Loki's, you know, the the tesseract for Christ sake. It's cool, but it's apparently a 4D, 5D, eighth dimension hard drive that can store the entity because the entity is so big. So, what we're going to do, here's the thing. What we're going to do, we're going to go to this thing. We're going to trick the entity into thinking like once basically all the nuclear arsenals have been taken over by it, it's going to launch those, but before it does, it's going to go store itself in this hard drive or in Yeah, we're going to tell it to basically come live in this bunker. The second it does, it's going to go to the hard drive. And as soon as it goes to the hard drive, someone has to snatch it up real quick. And they go, we say as soon as, we mean as [ __ ] soon. And they go, but and then Simon Peg's like, \"But Ethan, that would someone would have",
            "start": 4378.8
        },
        {
            "text": "the hard drive, someone has to snatch it up real quick. And they go, we say as soon as, we mean as [ __ ] soon. And they go, but and then Simon Peg's like, \"But Ethan, that would someone would have to have hands so fast.\" I don't know any Well, I started with Fallout. I was like, \"That's not him, right?\" But so Simon Peg's character was like, \"What the hell? So fast. What was that?\" Simon Peg goes, \"Ethan, nobody could possibly have hands that fast.\" And Ethan's like, \"Yeah, but you're forgetting we got Haley.\" Fast hands at well, the magic man at Well, that's the whole point of her being in this movie is that she has fast hands. Frames frames win games, right? Yeah, dude. Like, so she has to figure out how to cut the Oh, what is it? Okay, cool. [ __ ] it. I'm in. I don't care. We're going We're going in. Yeah, but but please, Tom, please make sure when you guys go there, please, for the love of God, dress appropriately. And I need all of you dressed in your best Indiana Jones",
            "start": 4415.04
        },
        {
            "text": "going We're going in. Yeah, but but please, Tom, please make sure when you guys go there, please, for the love of God, dress appropriately. And I need all of you dressed in your best Indiana Jones cosplay. Yep. What the [ __ ] Why? Like, a fedora. It's weird. Yeah. But before we get there, I want to talk about the scene, which is my favorite scene in the movie, right? And I know I just said that the the C sequence, that was my favorite action sequence. We're on a plane and William Dunlow goes, \"Hey, I'm William Dunlow.\" And he goes, \"I'm goes,\" Dunlow. \"Yeah, I know. You used to be working Langly.\" And he goes, \"Oh, you're him.\" And Ethan goes, \"I think I owe you an apology.\" And he goes, \"No, you don't.\" He's like, \"If you hadn't have done that, I would still be in that room and I would still think that I was happy and I would never have met the love of my life. I would never have the life that I have right now. So, I owe you a thank you.\" And it's just a great Damn, I was in the",
            "start": 4461.6
        },
        {
            "text": "still think that I was happy and I would never have met the love of my life. I would never have the life that I have right now. So, I owe you a thank you.\" And it's just a great Damn, I was in the restroom for this. Oh my god. It's just It was It was just Oh, Andy, you missed that. Really good. Yeah. Just very heartfelt. Beautiful shooting it right now. No offense. I thought he gave me chills, dude. Look at that. He gave me goosebumps. Yeah, I know. Um it's a great moment. It's a great moment. And uh the wife's there and it's great. So they land and they're like, \"Cool.\" And I'm like, \"Man, there's got to be like 20 more minutes left in this movie.\" Nope. 3 hours long. Three more hours. Uh we get there and uh they take over Gabriel and and then Kitri's people come and take over Gabriel's people and then Gabriel's people take over Kitri's people. And this is terrible. All of this is bad. We don't need any of this. But Kitrich is like, \"Go get the entity. Go get Go do the thing.\" They",
            "start": 4504.16
        },
        {
            "text": "people and then Gabriel's people take over Kitri's people. And this is terrible. All of this is bad. We don't need any of this. But Kitrich is like, \"Go get the entity. Go get Go do the thing.\" They get the virus thing back and then Gabriel's like, \"Nope.\" And then his people take over and he gets away and then Kitus gets away and then okay, here's where we're left at, right? There's a another nuclear bomb because Gabriel just has nuclear bombs all over the [ __ ] place. It kind of reminds me of when Alec Baldwin was like double triple quadruple crossing everybody in Fallout. I was like, I don't know who to roost. It was just very weird and not not particularly well blocked from like a a creative like how does Gabriel get the upper hand? Now he's just got more people in the back. I was like that's kind of [ __ ] boring. Anyway, long story short, Ethan goes, I'll go after Gabriel cuz he's got the vi the mind virus and I've got the hard drive. So, I'm going to put the hard drive on the",
            "start": 4539.12
        },
        {
            "text": "that's kind of [ __ ] boring. Anyway, long story short, Ethan goes, I'll go after Gabriel cuz he's got the vi the mind virus and I've got the hard drive. So, I'm going to put the hard drive on the mine virus and that's going to tell that's going to tell that's going to control the entity and let him know to [ __ ] go to the thing, right? Gabriel's gone. Krish is gone. But there's still this nuclear bomb just like Luther had at the beginning, right? So, what do we do? Well, somebody's got to disarm this bomb. So, new guy and William Dunlow and his wife have to sit there and disarm the bomb. And they figure out, oh god, we might have 10 seconds. If I can figure out how to give you 10 seconds before this thing explodes and we get through that door. Meanwhile, Simon Peg has taken a bullet and he's like, \"We're going to figure this out.\" Bleeding out. So, he's bleeding out uh while Haley Atwell has to figure out how to reconfigure the hard drive thing. Oh, no. She has to clip clip the",
            "start": 4574.8
        },
        {
            "text": "and he's like, \"We're going to figure this out.\" Bleeding out. So, he's bleeding out uh while Haley Atwell has to figure out how to reconfigure the hard drive thing. Oh, no. She has to clip clip the thing at the very very the second to let him in. And she puts the hard drive thing on there. Uh, and who I'm missing another [ __ ] character in this. Who's taking care of? Oh, Pond Clement is like taking I forgot she's in this movie. She does nothing else for the rest of the movie. She just shows up right here. She has a badass sequence though in the Arctic, which is great. Um, Palm's there. This whole thing happens. We go off and thank God, Gabriel's like, \"Hey man, just so you know, I knew this is all going to go down. I uh I I'm going to get on a buy plane after this, but I'm a man that believes in redundancy. So, just so you know, there's two by plans, not one.\" Thanks, Gabriel. Thanks for that line of clearly read, one very clearly yellow, so we can easily identify what's happening.",
            "start": 4612.08
        },
        {
            "text": "in redundancy. So, just so you know, there's two by plans, not one.\" Thanks, Gabriel. Thanks for that line of clearly read, one very clearly yellow, so we can easily identify what's happening. And you know what? I thank you for it. That was awesome. Because here we go. Here we [ __ ] go, ladies and gentlemen. How is he going to get on the other biplane? This is the helicopter sequence from Fallout. Slowed down, but then also taken up a notch. Yeah, it's it's so good. I mean, it cannot be uh overstated how amazingly well choreographed and bloodping this entire scene is. And it's funny because each of these movies, specifically the last handful of them, really focus on the the big set piece and like that's what they put on the poster. That's the thing that we see the behind the scenes of. That's the trailer moment, whatever. And I felt a little let down by Dead Reckonings where we get this big, okay, he's going to do the jump of the motorcycle off of the mountain. And it's like, yeah,",
            "start": 4651.36
        },
        {
            "text": "That's the trailer moment, whatever. And I felt a little let down by Dead Reckonings where we get this big, okay, he's going to do the jump of the motorcycle off of the mountain. And it's like, yeah, that's cool. And it is awesome. And in seeing it in the movie, it was awesome. But it was just over then. Like it just kind of felt like all right, you didn't add more to this. This is everything we saw in the trailer ramped up to 100 and then taken even further. The way that they play with the physics and as the planes turn, how Tom like differently kind of like jungle gyms around it, it's masterful. And the way that like the tension of him hijacking the different ships, the plane, the plane action, the plane to plane stuff, him grabbing onto the thing, all of that. Unbelievable. Ridiculous. And like this is the point Gabriel's character goes from being a a onenote villain to a cartoon character. I loved it. I loved it. The the ending of Gabriel's it's just like, oh, you know what? See",
            "start": 4697.04
        },
        {
            "text": "And like this is the point Gabriel's character goes from being a a onenote villain to a cartoon character. I loved it. I loved it. The the ending of Gabriel's it's just like, oh, you know what? See you later. I've got the and it's just like, all right, that was it. He's done. I appreciate it. I think it's [ __ ] hilarious. But a little bit of me was a little disappointed that he wasn't like, \"I've got the only parachute. See you later.\" Jumps off. And then Ethan has to pull a [ __ ] Yep. jumps and steals the parachute. Johnny Utah and steal the parachute. He has to pull a point break and go after him. And then they have to do the you pull it. No, you pull it. Get rid of the gun. All that stuff, man. You know, but also it was very long. Like there was a lot going on in this scene that I'm like I'm not mad. I I needed to breathe. I'm here for it. Like literally physically breathe. It's crazy how much was going on cuz they're also Aren't they also cutting back to the president? Oh yeah,",
            "start": 4745.8
        },
        {
            "text": "like I'm not mad. I I needed to breathe. I'm here for it. Like literally physically breathe. It's crazy how much was going on cuz they're also Aren't they also cutting back to the president? Oh yeah, the president who is about to nuke a I So this is where I went to the bathroom. Why did she have to nuke one an American city? What was the rale there? Because so they were going to nuke all the other uh places where they're nukes to stop the nukes from going off. And as a show of good faith of like, hey, we had to do this. Yeah. Like we we also are taking out of one of our major cities. Okay. That may Yeah. Great. That's a weird That's a weird logic there. Basically, so that when everyone comes back, the whole world doesn't unite against us. I still think they might. I don't know that. If I were if I were living in another country, I'd be like, well, first off, any if you've nuked all the nuclear arsenals in the world, wouldn't that just destroy the world? No, cuz they have to they have",
            "start": 4792.08
        },
        {
            "text": "were if I were living in another country, I'd be like, well, first off, any if you've nuked all the nuclear arsenals in the world, wouldn't that just destroy the world? No, cuz they have to they have to like trigger the nukes. Yeah, like the the nukes has to has to like trigger a certain way for it to actually explode. No, no, no. I mean, so they were just going to shoot missiles at the other ones. They weren't going to nuke the nuclear silos. Oh, no. They were going to I mean, cuz if you correct me if I'm wrong, and Kevin, maybe Google this, but don't do it on my computer. How many nuclear bombs would it take to destroy the world? Cuz we have in in our arsenal, we have to have like at least hundreds of these, right? And there has to be like I think there's thousands. So there has to be thousands around the world that we would nuke. So if we launched a thousand nuclear missiles at the rest of the world, wouldn't that just destroy the world anyway? No, cuz it's a nuclear explosion is",
            "start": 4839.84
        },
        {
            "text": "thousands around the world that we would nuke. So if we launched a thousand nuclear missiles at the rest of the world, wouldn't that just destroy the world anyway? No, cuz it's a nuclear explosion is smaller than you think and the world is bigger than you think. Fair enough. I was just thinking about the fallout and everything after there. What a good movie. What are you pointing out? Snow bike mic in the chat says I took that as every other country would think the AI did it, not America. So they'd be like, oh well, we didn't do it. No, no, no, no. It was definitely they made a point of being like we need to do this. Like I show a good faith. Yeah, I remember good faith thing of like, oh [ __ ] show everybody else that you are doing this so that everybody doesn't think you're just trying to [ __ ] everybody over. You doing like, no, we have to do this and we're going to hurt our own. But then she does what of course uh Debo does in the Dark Knight, right? What we should have done to",
            "start": 4875.04
        },
        {
            "text": "to [ __ ] everybody over. You doing like, no, we have to do this and we're going to hurt our own. But then she does what of course uh Debo does in the Dark Knight, right? What we should have done to [ __ ] begin with, which is throw the goddamn nukes out. Just disarm the nukes. Why would that not be step one for every nation? Hey man. Hey Russia. We're just going to disarm our nudes. You guys can do us if you want. But what? We're just going to take ours after the [ __ ] Yeah. It's all the misinformation, right? Yeah. But then how the [ __ ] do they know that the other arsenals have been taken over because they haven't been hacked yet? Once you're hacked, you don't have any control of anymore of anything, right? But how do they know that UK and Russia and China's have lost their control of their arsenals? How how would they not just assume that's misinformation? Well, but like they haven't been hacked, so they're still able to get information from other people. Who's they in this",
            "start": 4911.84
        },
        {
            "text": "of their arsenals? How how would they not just assume that's misinformation? Well, but like they haven't been hacked, so they're still able to get information from other people. Who's they in this situation? The US. The US hasn't been hacked, right? That's why they're using all these old Yeah, but we just set up a whole thing of like, all this could be real, all this could not be real, right? How do we know what's real? What's not real? That's the last thing they knew that was real. Wild on. Uh, either way, she's like, \"I'm not going to do this.\" And then Nick Offerman's like, \"Hey man, give me your gun.\" You're like, \"Oh, is he going to [ __ ] kill her?\" And he goes, \"No, he's [ __ ] ride or die for Angel Bass.\" Of course am I because I [ __ ] love though, man. This like that. This was a great subverting expectations thing. Like him asking for the gun, I was like, \"Oh man, Nick is gonna [ __ ] or Nick Offerman is about to shoot her and be like, \"We can't let this [ __ ] happen. We",
            "start": 4950.24
        },
        {
            "text": "a great subverting expectations thing. Like him asking for the gun, I was like, \"Oh man, Nick is gonna [ __ ] or Nick Offerman is about to shoot her and be like, \"We can't let this [ __ ] happen. We cannot take our bombs offline or whatever.\" It's a good moment. The gun. Yeah. Nick Offman, she's a [ __ ] guy. Guy just comes out of Yeah. One of the acolytes. One of the Sarah fights. It's so cool that he was actively like, \"No, we need to do this.\" And that guy came and he [ __ ] took him down and was like, \"Nope, it's your orders. We'll do what you want. A nice little red herring. A good man. Good man. Granted, now we could actually start to peel this back a little bit. Who? What's that? I didn't know Nick Offerman got shot. Oh yeah, he died. Did you go to the bathroom? Huh? Were you taking a key? No, no, no. When he died, like he dies cuz he shoots the dude, right? And I was like, Nick Offerman, that was cool, man. Like you in that moment, you realize this is the better call to save",
            "start": 4986.24
        },
        {
            "text": "a key? No, no, no. When he died, like he dies cuz he shoots the dude, right? And I was like, Nick Offerman, that was cool, man. Like you in that moment, you realize this is the better call to save the president and tr to trust in her and and I'm like, [ __ ] yeah, he did it. And they're like, Nick, oh [ __ ] And he just like, \"It's a pleasure, Madam President.\" And he just like closes his eyes like, \"Oh, I didn't know you got shot.\" I thought like, \"It's weird.\" Um, it's worse than I thought it was. He dies. But I will say this, I'm not I'm not saying like a harsh penalty, but some sort of reprimand for the Secret Service agent that gave him the gun or the the guard. You're not supposed to just be giving anyone who asks you for your sidearm, even if they are your superior. I'm pretty sure you're not supposed to do that in a situation like this. He's not. This is like we will never call you to ask you for your phone number. Exactly. The IRS never calls you. That kind of thing. Anyway,",
            "start": 5030.72
        },
        {
            "text": "you're not supposed to do that in a situation like this. He's not. This is like we will never call you to ask you for your phone number. Exactly. The IRS never calls you. That kind of thing. Anyway, long story short, like call your son and like we need to ask you for your phone number. I'm tired. This is Andy Cortez. Hey, what's your photo? You just called me on it. That's hilarious. I was hungry, man. So, man, Tom, we then we catch up with Tom, man. He's tumbling. Oh, he's tumbling. I tumble for you. Tom's tumbling. He's got the camera on. He's like, and he's like, I got to get this thing in the I got to jam the virus, the mine virus into the mcguffin before all hell breaks this. Apparently, this thing's got the best satellite up upload thing possible cuz he's out in the middle of [ __ ] nowhere. Oh [ __ ] So, I already missed the [ __ ] fall. Oh, yeah. We talked about the plane thing. Oh, god damn. That was sick as [ __ ] though. You should go back and watch it. Sick. Cool. Yeah,",
            "start": 5073.36
        },
        {
            "text": "nowhere. Oh [ __ ] So, I already missed the [ __ ] fall. Oh, yeah. We talked about the plane thing. Oh, god damn. That was sick as [ __ ] though. You should go back and watch it. Sick. Cool. Yeah, it's real fun, man. When he's like in zero G floating in, all that's so fun. Are you kidding me? Uh, mind virus goes in Tom Pop Tom Pops parachute, but it's on fire and he's like, \"Oh [ __ ] does he have a second parachute? We don't know.\" But it doesn't matter because he can't focus on that right now. He's got to get the mind virus into the Sebasta pool. And he kind of puts it in there. And the second he does, the [ __ ] light goes up. Haley clips the thing. It's so good. And it's done. It is such a like [ __ ] yeah moment in in movies of like oh yeah. I was expecting I was not expecting that because the whole movie is sort of like it it baits you into thinking everything is going to be overly long and the tension is going to build. It's done and I jumped out of my seat. I was like that was",
            "start": 5117.84
        },
        {
            "text": "the whole movie is sort of like it it baits you into thinking everything is going to be overly long and the tension is going to build. It's done and I jumped out of my seat. I was like that was [ __ ] I went that was [ __ ] awesome. That guy next to me this guy's like please stop. This guy's like I'm never coming to this theater ever again. Please. Unbelievable great moment of editing. Yeah. everything I said about the editing, how it should have been trimmed. This [ __ ] thing was amazing. What a great ending. Very similar to the Mission Impossible to Fallout, but better. And then of course, with the did it happen, did it work or not? But in this case, the did it happen, did it work? Is is he alive? Is he alive? He's he's free falling. Well, but like the the Fallout thing was like it cuts to white and with this it cut to black and it was just like ah the justosition was so good cuz the thing did the entity turn all the lights off? Is Tom dead? Are his lights off? And then he open and",
            "start": 5159.36
        },
        {
            "text": "to white and with this it cut to black and it was just like ah the justosition was so good cuz the thing did the entity turn all the lights off? Is Tom dead? Are his lights off? And then he open and he wakes up and who should be there old man Kitri and Shay Wigum. Hell yeah. But is it Shay Wigum Tim or is it Jim Phelps Jr. Jim Phelps [ __ ] Junior necessary thing that at this point they won me over. You gave me the submarine. You gave me the plane sequence. Sure. Let's have Shay Wiggham's character get more convoluted than necessary. You'll be John Void's son. I lost my [ __ ] at this moment and I loved it. Why did it have to be the rabbit's foot? Cuz they wanted to connect everything and they nailed it. They [ __ ] nailed it. It was so But but here's the thing. If Shay like look, if you tell me he's Jim Phelps's son or right and he's running covert teams and he's maybe he's going to be the new Jim Phelps, this is no disrespect to Shay Wigum. He's not John Voy and he's not Kitrich. He",
            "start": 5198.0
        },
        {
            "text": "me he's Jim Phelps's son or right and he's running covert teams and he's maybe he's going to be the new Jim Phelps, this is no disrespect to Shay Wigum. He's not John Voy and he's not Kitrich. He doesn't have that vibe. How dare you? Look at him. He's wearing a goofball that you put in these to get his ass kicked by Tom Clement. He always gets his ass kicked and everything. You got [ __ ] nose broken fast and furious for Christ's sake. What I hate about myself as a person is when all of this is all this is being explained. I I I may have worded to myself like I can see that like either the I was like, \"Yeah, look at them. They do look a lot.\" Can you please bring up a picture of John Voy from Anaconda? I don't know. It could be dangerous. Um, well, either way, they shake hands and he's like, \"It's cool.\" And then Kitrich puts him on the plane and all is saved. But we don't know if Benji's dead or not, cuz Benji took one to the gut. And then we go back to Trfll. There he is. Right",
            "start": 5247.12
        },
        {
            "text": "like, \"It's cool.\" And then Kitrich puts him on the plane and all is saved. But we don't know if Benji's dead or not, cuz Benji took one to the gut. And then we go back to Trfll. There he is. Right there. I guess they do kind of look similar. I don't know. It could be dangerous. Let's see if these guys I mean, she could be father and son. Yeah, look at the I kind of see it. I mean, they're only 5 years apart in age, but it's fine. Anyway, guys, we won. And now it's time to do the handoff. We I've got the McGuffin. I've got control of the entity. I'm not sure how technically that works. I think it's still in the thing. Oh, no. It's in the thing. That's right. It's in the little tester and I've gotten a cool little case and you know, let's just give it to each other hiding in plain sight because Tom Cruz uh Haley gives it to Tom Cruz and does the handoff in Trafalgar Square which is like the like the time square of you know, London. And then uh we see the other characters and they do",
            "start": 5297.68
        },
        {
            "text": "because Tom Cruz uh Haley gives it to Tom Cruz and does the handoff in Trafalgar Square which is like the like the time square of you know, London. And then uh we see the other characters and they do the thing. They do the stuff at each other. They get the nod and then and then it cuts in. Michael Kane's over there and he kind of nods Christian Bailey. And then we go we cut over and who should come out of the corner? Benji. He's still alive. Good. He's still alive. And then we look over being Reigns right there. He's like, I still And then we look over one more time. Rebecca Ferguson's like, hopefully Doom 3 does well or else I'm back with that stuff. Um, not disappointed that Benji's dead, but obviously like this is not the last Mission Impossible alive rather. Sorry. This is not the last Mission Impossible movie we're ever going to get. Oh, the whole cast is here still. They're very much still alive and Ethan could absolutely be the Jim Phelps of the next one. Yeah, it is",
            "start": 5333.04
        },
        {
            "text": "the last Mission Impossible movie we're ever going to get. Oh, the whole cast is here still. They're very much still alive and Ethan could absolutely be the Jim Phelps of the next one. Yeah, it is interesting. We're going to get another one. It's I'm not so sure. Like I And I say that because uh I I feel like they left it open, but I also think that just in terms of budget and how much money these movies are making. Like we'll see if this one crushes. But I wouldn't be surprised if these movies have just ballooned too much and Tom's instead going to do Days of Thunder 2 and do some other [ __ ] Like I I can see them like they've done so many. I at the very least I don't think that uh Mchugh comes back. Probably not. But I imagine that I mean Tom's not going to I don't think he's going to go to start doing indie darlings ever again. I think he really I think he loves doing he's definitely going to do I think they haven't they confirmed another Top Gun Maverick. Yeah, but like it's",
            "start": 5371.52
        },
        {
            "text": "to go to start doing indie darlings ever again. I think he really I think he loves doing he's definitely going to do I think they haven't they confirmed another Top Gun Maverick. Yeah, but like it's confirmed in the way of like there's no script. There's no sure. But they're going to do another one. And when he when he gets this the taste for that blood, he's definitely coming back to Mission Impossible. But so much of it is the magic of I want to do these stunts. So much of it is the tension there, you know, like I you you just feel so much more your butthole's so much tighter when you know that this is a real shot and and instead of a CG thing. Um I uh kind of forgot that the movie opens up with Tom Cruz Productions. Like did Top Gun have that or Dead Reckoning? Well, he's he always owns Sky Dance, right? Isn't that But like it was just weird seeing Tom Cruz Productions as like the thing that's I don't remember when that was first introduced. I don't think this is the first one",
            "start": 5410.8
        },
        {
            "text": "owns Sky Dance, right? Isn't that But like it was just weird seeing Tom Cruz Productions as like the thing that's I don't remember when that was first introduced. I don't think this is the first one though. Yeah, I thought it was. I didn't see it. Um, either way, that is Mission Impossible. And we didn't get a postredit sequence where he gets another mission, which is a bummer cuz it would have been cool. We were all waiting in the theater. I was like, for sure he's going to be like sitting in a cafe and it's going to be like, Mr. Hunt, your mission, did you choose to accept it? I do. I really love uh parts of the end here where I love the idea that as ridiculous as it is, eventually this movie earns the thing that yeah, Ethan Hunt is Jesus. Ethan Hunt is the guy. He's the one. Um and the concept of him being the only person that is capable of being responsible having this entity is so cool. Like it's so stupid and over the top, but like by the end of this movie, them handing it off",
            "start": 5455.28
        },
        {
            "text": "concept of him being the only person that is capable of being responsible having this entity is so cool. Like it's so stupid and over the top, but like by the end of this movie, them handing it off to him, I'm like, come on, that's [ __ ] awesome. But the Ving RAM speech, I thought, while incredibly on the nose and very just spelling it out for people, I thought it was utterly fantastic. I thought that taking this over-the-top action movie, but really trying to take the final moments to be like, \"Hey, all you people to just enjoy the hell out of the last couple hours of this thing, having the time of your life, your heartbeat, and stuff.\" AI is a problem, and we all do need to unite as a people together. Otherwise, we're all going to kill ourselves, kill each other, and everything in between. So, hey, let's not do that. Like, I'm happy they did that because they really really really were just like, \"Yo, this is inevitably going to happen to all of us if we don't just shape the [ __ ]",
            "start": 5496.96
        },
        {
            "text": "So, hey, let's not do that. Like, I'm happy they did that because they really really really were just like, \"Yo, this is inevitably going to happen to all of us if we don't just shape the [ __ ] up.\" Yeah. Espec I just loved that, you know, I I'll I left you a message for whatever, you know, and just having that call back was really really damn good. Oh, yeah. I forgot he left it on the [ __ ] hard drive. Yeah, this hard drive will self-destruct in 5 seconds. Hell yeah. [ __ ] cool. Good for you. Uh, ragu. Bagu. What's up everybody? Bagu instead of a C. That's okay. It happens. Remember when your seat didn't work for like 5 years? Uh, what's up everybody? Welcome to Ry Guys with Talk Bad Guys here for the Mission Impossible Universe where we want to rank the entity and Gabriel. Well, if you remember Nick. Oh, right. What if we don't do that right? We do a Well, we It's villain impossibly. Villain impossible, everyone. Sorry, my apologies. How could I forget? My apologies for all of",
            "start": 5541.52
        },
        {
            "text": "you remember Nick. Oh, right. What if we don't do that right? We do a Well, we It's villain impossibly. Villain impossible, everyone. Sorry, my apologies. How could I forget? My apologies for all of it. You know what's You know what's amazing? Can we talk about this for a second? I know we're getting long on this one, but the movie was like we're we're never going to beat the length of this movie anyway, so it doesn't matter. I'm always shocked when Greg's not on an interview and we have something dumb like that. Cuz don't you always think that you're doing Oh, yeah. That's Yes. But I always I always just think anything that's a stupid podcast in the podcast is just a complete and total waste of time comes from Greg's brain. Mission Impos. Is it still villain? Yeah. Yeah. Where do we want to rank Gabriel and the Entity in this? Yeah, Gabriel and the Entity. I think they suck. They suck. Yeah. So, um, they do. I think they suck. Uh, we have Lane/W Walker from Fallout at number one. We",
            "start": 5589.92
        },
        {
            "text": "to rank Gabriel and the Entity in this? Yeah, Gabriel and the Entity. I think they suck. They suck. Yeah. So, um, they do. I think they suck. Uh, we have Lane/W Walker from Fallout at number one. We have Lane/attly from Rogue Nation at number two. At number three, we have Owen and Musgraves from MI3. Number four, we have Jim Phelps from one. Five, we have Gabriel and the Entity from Dead Reckoning Part One. Then we have Shawn Ambrose from Mission Impossible 2. Ambrose Ambrose. We have Cobalt from Ghost Protocol coming in at the end. I I think that at the end of the day, I got to put this above Dead Reckoning part one. Sure. Just because they actually did things with it and it wasn't just mysterious [ __ ] Like Gabriel just like disappearing and stuff in part one. It's like what are we doing here? At least here it's like the threat of all of the nukes around the world being activated. I buy into that. I don't think it's that great, but I put it under Mission Impossible One above Dead",
            "start": 5626.76
        },
        {
            "text": "here? At least here it's like the threat of all of the nukes around the world being activated. I buy into that. I don't think it's that great, but I put it under Mission Impossible One above Dead Reckon. I'm glad that the Entity stopped talking early on. I thought that the whole movie was going to be constant cuts to the entity being like, \"What's happening?\" and [ __ ] Like, I'm so glad I'm so glad that didn't happen. But man, like we've seen so many movies where villains pop off regardless of the of the script. We've seen I like I mean Philip Sear Hoffman was great in the third one and that script was not it's just a very cut and dry action. I think of so many movies where we go man can you imagine like that this actor did such an incredible job. Can you imagine if they were given something great to work with? How much better it could have been. But he doesn't he wasn't this dude. He's not the guy for this. And I it it was always weird casting me at first because I always thought he",
            "start": 5673.92
        },
        {
            "text": "great to work with? How much better it could have been. But he doesn't he wasn't this dude. He's not the guy for this. And I it it was always weird casting me at first because I always thought he was the fake out bad guy cuz we're going to reveal who the real actor is for the real bad guy. And that never happened. I was like, you're just lacking the juice right now. He gets a lot of nuclear nuclear bombs. I heard this one sucks. Says W bomb. It sucks for the first 40 minutes and then it's the best movie you've ever seen for the next two hours. Yep. [ __ ] 100%. Cool. I'll put it there. Tim. Yeah. So, there we go. Now, it's time to rank the Mission Impossible movies. Kevin, if you could bring these up, please. Wait, I thought I wasn't supposed to bring it up. This is the old school voting way. We didn't do the new rankings for this because Okay, so that many Okay, this isn't mathematical. Yeah, got it. Currently, number one, we have Rogue Nation. Number two, Fallout. Number three,",
            "start": 5723.28
        },
        {
            "text": "way. We didn't do the new rankings for this because Okay, so that many Okay, this isn't mathematical. Yeah, got it. Currently, number one, we have Rogue Nation. Number two, Fallout. Number three, Ghost Protocol. Four, Dead Reckoning. Five, Mission Impossible 3. Six, Mission Impossible One. Seven, Mission Impossible 2. Was I at filed for putting Dead Reckoning over three? I don't think you were. You were. I really think you were. You were. Uh, you you were with me, the Dead Reckoning over three, and it was unanimous that Rogue Nation's above Fallout, which is something we're always like, really? That's [ __ ] crazy. Wow. I'm a Rogue Nation boy. I mean, I love I love majority of these movies. Wow. I can't believe I put Dead Reckoning over three. Um, but because of how the rankings go, this movie is better than This is tough. Tough. This is tough. Okay, so the top three right now, yeah, are better movies completely front to back. Tim, my mind is your mind. What was the big action set",
            "start": 5769.44
        },
        {
            "text": "movie is better than This is tough. Tough. This is tough. Okay, so the top three right now, yeah, are better movies completely front to back. Tim, my mind is your mind. What was the big action set piece in Rogue Nation? Is that Ethan Hunt? That's Rogue Nation, right? First appearance. That's where they push him into the box. Mhm. And then Ghost Protocol is the out of the plane in the beginning. And Ghost Protocol and that's not the not it's not the Burj Khalifa is Ghost Protocol. Yeah. And that's the one where the fights cobalt at the end on the on the parking structure, right? And you remember like the the the fake hallway imagery where they're sneak. They have the uh what's her name? Leia do where they're like tricking her. They're telling her she's in a different room. Tom Cruz. Tom Cruz has to do that cool thing that mountain climbers do where he like uses his foot. Yeah. All the time. He's always using his foot. Awesome. Um here's my thing. This movie is there. Half of this movie",
            "start": 5819.4
        },
        {
            "text": "has to do that cool thing that mountain climbers do where he like uses his foot. Yeah. All the time. He's always using his foot. Awesome. Um here's my thing. This movie is there. Half of this movie is the greatest Mission Impossible movie ever [ __ ] made. But the other half of the movie is just such a slog that I can't in good good faith list it any higher than above Dead Reckoning. I would put this at number four because I enjoyed the hell out of the last two hours of it way more than I enjoyed anything that was in Dead Reckoning. But that movie was a slog for me too. I was very very low on it. I didn't think any of the comedy worked. I didn't like the dynamics of anything. The other three, the top three movies are just start to finish what Mission Impossible movie should be. Granted, are we seeing the best underwater sequence ever? No. But I will gladly take that out to watch any one of those movies on a plane and be just in and just enjoy the [ __ ] out of it from start to finish.",
            "start": 5871.2
        },
        {
            "text": "we seeing the best underwater sequence ever? No. But I will gladly take that out to watch any one of those movies on a plane and be just in and just enjoy the [ __ ] out of it from start to finish. That's what I'll say. So, I would rank this number. Our top three right now is fast five through seven. Amen. I would put this in the same spot that Nick is doing uh putting it at number four underneath Ghost Protocol above Dead Reckoning. I also would put it at number four. So, that is where it's going to end up. But I will say it is not as easy for me to say as it sounds like it is for you guys. I think that Dead Reckoning front to back I was more entertained by and there was more things that I was interested in and the characters and the comedy and I liked Palm a lot better in that. I liked Kelly Atwell a lot better in that. But Rebecca Ferguson with the Rebecca Ferguson stuff was [ __ ] awesome. The train sequences at the end. Like I think Dead Reckoning is so much better than it gets",
            "start": 5914.16
        },
        {
            "text": "Kelly Atwell a lot better in that. But Rebecca Ferguson with the Rebecca Ferguson stuff was [ __ ] awesome. The train sequences at the end. Like I think Dead Reckoning is so much better than it gets credit for. Um and I think the biggest thing it had going against it was it was a part one. Um, but now that we've seen both of them, I I think that it just it works better than this movie does. But at the end of the day, the submarine sequence and the uh the biplane sequences, they're just that's peak peak Mission Impossible. It's so freaking good. It just sucks that there's another third of the movie that Yeah. And even even within those sequences, those sequences are great, but like surround the glue between them all, it's kind of weak. Uh, dude, there's definitely a cut of this movie that you could make that's two hours, and it's the greatest Mission Impossible movie ever. I mean, I think that there's a three-hour cut between the two movies that that can get there. I I honestly think,",
            "start": 5955.36
        },
        {
            "text": "you could make that's two hours, and it's the greatest Mission Impossible movie ever. I mean, I think that there's a three-hour cut between the two movies that that can get there. I I honestly think, yeah, that's probably true. But I think if that's going to be the case, just do take 20 minutes out of the first movie and let that be the setup for this and then just get me get me to the point where he gives the necklace to the guy and let's just [ __ ] go. Let's just [ __ ] go. Let's just go. Uh, so yeah, there we go. Number four for Dead Reckoning or sorry, the final reckoning. Remember in Dead Reckoning in the in the fourth movie where we were in that airport for like 45 minutes and then every single time you looked up Tom Cruz was just running. Not mad at that. It's weird. One thing I didn't love uh about Dead Reckoning was just like, you know, the whole train sequence. I was like, \"This is all CG.\" Yeah, it's all CG. This isn't real. Yeah, it's the opposite of what we want, dude. I",
            "start": 5994.64
        },
        {
            "text": "love uh about Dead Reckoning was just like, you know, the whole train sequence. I was like, \"This is all CG.\" Yeah, it's all CG. This isn't real. Yeah, it's the opposite of what we want, dude. I want you in danger. But yeah, [ __ ] put hang a train. Hang some train and uh let's go after this thing. Hang some train, dude. Put your life on the line. So, uh, the rankings, uh, potentially for the final time are number one, Rogue Nation, number two, Fallout 3, Ghost Protocol, four, Final Reckoning, five, Dead Reckoning. Six, Mission Impossible 3, seven, Mission Impossible 1, and eight, Mission Impossible 2. And there you go. We'll return next week with The Karate Kid in [Music] review. It doesn't make any sense in this podcast, but I love this song so goddamn much. We're going to see. Bye, guys.",
            "start": 6030.56
        }
    ]
}