{
    "id": 14053,
    "video_id": "Nx4vHbCKHf0",
    "show_name": "In Review",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Andy Cortez"
    ],
    "title": "Alien Covenant In Review  - Every Alien and Predator Movie Reviewed and Ranked",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page - https://store.steampowered.com/app/1377700/Empyreal/ \nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nThis episode is sponsored by BetterHelp — go to http://betterhelp.com/kindafunny to get 10% off your first month.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1746531921,
    "duration": 5605,
    "transcript_chunks": [
        {
            "text": "[Music] [Music] What's up and welcome back to Kind of Funny's Alien and Predator in review. That's right. We are ranking, reviewing, and recapping every Alien, Predator, and Prometheus film. Even when there's Prometheus sequels you didn't know about in your life. You know what I mean? What a fun surprise that was. When we were when we did it last week and we was like, they never made a sequel to this and chat was like, well, I was like, oh, interesting. And then for it to start, I was like, \"Holy shit.\" Okay, that's kind of crazy. Uh, if you love what we do, please support us with the kind of funny membership on Patreon, YouTube, or Spotify or Apple Podcast. It gets you the shows ad free and you get a daily exclusive Gregway. But either way, you can watch this show each and every week on YouTube or Twitch or podcast services around the globe if that is what you would prefer. Um, there's a lot going on right now in entertainment land at Kind of Funny. Right now, of course, we're",
            "start": 0.27
        },
        {
            "text": "on YouTube or Twitch or podcast services around the globe if that is what you would prefer. Um, there's a lot going on right now in entertainment land at Kind of Funny. Right now, of course, we're continuing Alien and Predator in review. But in addition to that, we're doing weekly breakdowns of The Last of Us and Star Wars andor uh Last of Us episode four. We just did our breakdown, me, Greg, and Bless talking about that today. Um but last week we did we're doing the weekly andor which is three episodes a week. So catch up with all of that. And uh episodes, what would it be? I guess 9 through 12, something like that. 6 through 9, that's what it'll be. is going to happen uh for Andor this Friday at 12:30 p.m. So be there live if you'd like. Um shout out to our Patreon producers, Anatoli Asked, Lady Twan, Carl Jacobs, and Omega Buster. Little housekeeping for you. Greg is going to be at PAX East. Please go support him as he does the keynote for PAX East with Ben Star. At 11:00 a.m.",
            "start": 70.96
        },
        {
            "text": "Asked, Lady Twan, Carl Jacobs, and Omega Buster. Little housekeeping for you. Greg is going to be at PAX East. Please go support him as he does the keynote for PAX East with Ben Star. At 11:00 a.m. Eastern if you're there in Boston, 8:00 a.m. Pacific if you're watching from home. And at 2:00 p.m. Eastern, 11:00 a.m. Pacific, Greg's hosting The Mafia: The Old Country Panel with the developers. Please support in person or at home. Just go to our Twitch and we'll be streaming both of those if you aren't there in person. And uh today we're brought to you by Imperial Frames and Better Help, but we'll tell you all about that later. We got to get into it. Alien Covenant, released on July 9th, 2017. A run time of 2 hours and 2 minutes. Directed by Ridley Scott. once again returning. He's back, baby. Uh music was done by Jed Kurszle and the budget was 111 million, box office 240 million. Budgets get crazy cuz I was like looking at my notes like the AP movies were 40 million and this was 111",
            "start": 113.76
        },
        {
            "text": "baby. Uh music was done by Jed Kurszle and the budget was 111 million, box office 240 million. Budgets get crazy cuz I was like looking at my notes like the AP movies were 40 million and this was 111 million, Andy. That's weird. You know what I mean? Like damn time. I mean them little crawly aliens. A whole bunch of them, right? A lot of CG how great they looked, right? Uh anyways, that this is Alien Covenant. I want to get into all of our thoughts. Who would like to start? I'll start. Go for it, Andy. I had never seen this before. Had no idea what it was about. Didn't know uh that Fast Bender was in it. What a surprise. I like I just didn't know what this movie was. It was kind of at a weird point in time where I mean, not that I was ever keeping up with Alien News, but I don't know. I just I just figured they would have called this Prometheus 2 or something like that. Uh but yeah, was kind of surprised by this one. I I it still annoys me that the character is just that [ __ ] little",
            "start": 160.8
        },
        {
            "text": "I just figured they would have called this Prometheus 2 or something like that. Uh but yeah, was kind of surprised by this one. I I it still annoys me that the character is just that [ __ ] little that little splotch of blood. We got to stop slipping on that thing. Like that little splotch of blood on the ground was so pivotal to the movie. Really? Well, that's something happened because of that thing. That like just that little thing like that's got to be a preferred partner. That's a real Z. That's a real preferred partner right there. Um do it. Yes. Don't worry. But um yeah, I I I still enjoyed this movie. I really enjoyed the freaky ass design of The Aliens. I I don't think it's like a good movie in terms of a lot of like storytelling and and maybe pacing. Um some characters just feel like they weren't aware of how they should have been feeling in certain moments and like they weren't given enough direction maybe. Um, but I mean all that being said, I I expected to hate this movie",
            "start": 209.84
        },
        {
            "text": "like they weren't aware of how they should have been feeling in certain moments and like they weren't given enough direction maybe. Um, but I mean all that being said, I I expected to hate this movie when that second woman slips on the thing of blood. Like I I legitimately stood up. I was like, I [ __ ] hate this. Like this is such [ __ ] There's actually there's a dread cut where the blood kills everyone. It's crazy. Everybody keeps watching. The alien the big alien watching slips. Stop moving and we'll be okay. Someone will come for us. I I still had a a good enough time with it. I think because it was such a surprise and um yeah, I guess this was just such a weird dark spot in my knowing about movies or anything like that. So yeah, it was pretty enjoyed. It was still pretty enjoyable for me. I'm going to jump off there cuz you saying that there was that moment you thought, \"Oh, I might hate this movie.\" Unfortunately, I hated this movie. Like this one, uh my my initial thoughts on",
            "start": 262.24
        },
        {
            "text": "me. I'm going to jump off there cuz you saying that there was that moment you thought, \"Oh, I might hate this movie.\" Unfortunately, I hated this movie. Like this one, uh my my initial thoughts on it, this is a stinker of a film. It's just boring. And that's about these movies. And I don't think that it's the worst of these movies. Like I I really don't. And I think there are multiple movies that are uh worse than this and this is better then. But watching this was such a slog and especially after coming off of Prometheus and so much of what I liked most about this movie is the stuff they're following up on from Prometheus. It just felt a little directionless and it felt like all right it it felt cash grabby in the way of like Michael Fasbender was great but we put him in an alien movie that wasn't called Alien. Let's just put him in a movie that actually call it Alien. And that that kind of feels like the end of all of it. All of it to me. Like uh I don't think that much of this was",
            "start": 306.32
        },
        {
            "text": "wasn't called Alien. Let's just put him in a movie that actually call it Alien. And that that kind of feels like the end of all of it. All of it to me. Like uh I don't think that much of this was horrible. It's just not entertaining. And I feel like so many of the movies that we've watched have done everything this movie does even okay, just so much better. Whether it's the creature design that I get what they were going for here. I think they kind of went a little too far with some of them. Um the insistence on trying to come up with potential origin stories for all of these aliens is another thing that I just don't think we need. Um so much of the the action is silly. the flute on the flute teaching scene, the Michael Fbender on Michael Fastpender stuff. Like I enjoyed, but I don't think I'm supposed to. It was like such a goofy flex of like what is this 1989 where I'm supposed to be impressed that they're talking to each other? Like they're spinning the camera back and forth. Like",
            "start": 344.8
        },
        {
            "text": "I'm supposed to. It was like such a goofy flex of like what is this 1989 where I'm supposed to be impressed that they're talking to each other? Like they're spinning the camera back and forth. Like I get it. Goofy, man. What's up? That's the only part of the movie that I actually like cuz I think Fast Burn is the only good part. And I think that I think the David versus Walter like conversations are the only interesting philosophical like themes that we explore in this entire movie. The rest of it is literally well well more in territory. We've done all this already in the first film and this coming out in 27 like again uh the the flute stuff and the um David as a character and like thinking about the concepts of creator versus creation and what the power dynamics are and what would you say face to face with your creator? Like that stuff is still so interesting and yeah the flute scene it's like it's just goofy in the context of the rest of this movie but I still thought was like all",
            "start": 387.28
        },
        {
            "text": "face to face with your creator? Like that stuff is still so interesting and yeah the flute scene it's like it's just goofy in the context of the rest of this movie but I still thought was like all right there's something here. the way the movie ends, I'm like, \"All right, that's cool, too.\" But overall, I just feel like it was a a big letdown. And I out of any of these Alien movies, I did not look at my watch more than this one. Like, constantly, I'm just like, I would rather be doing anything than watch this. And this was the first time one of these ended, I'm like, I can't believe we have more of these movies to watch. Like, I think we finally hit the point of like, I'm done being like, hey, I'm having a fun time with the ride. Like, I did not have fun with this movie. I would have preferred somebody telling me uh because I think back to some of my thoughts at the during Prometheus and during the interview I was like yeah but I get really just kind of pumped up at the concept of",
            "start": 424.96
        },
        {
            "text": "somebody telling me uh because I think back to some of my thoughts at the during Prometheus and during the interview I was like yeah but I get really just kind of pumped up at the concept of Shaw saying I don't want to go back to Earth I want to go back to where the engineers came from and how cool of a concept that was to me and if this movie didn't exist and you told me oh they wrote a side comic where actually David [ __ ] released this [ __ ] and just killed wiped out everybody on I would have like, \"Wow, that's [ __ ] sick.\" But like, it's still really cool and it's still sinister and it's an awesome concept. I just don't think they executed much of what could have made it cool. Yeah. I I I think the movie could have been better if it wasn't for the fact that it was a sequel to Prometheus because there's a lot of really interesting stuff here, but it's well warned territory. And I think back to this is going to be a bit of a walk, but I want to bring up the movie Pretty and Pink.",
            "start": 462.24
        },
        {
            "text": "because there's a lot of really interesting stuff here, but it's well warned territory. And I think back to this is going to be a bit of a walk, but I want to bring up the movie Pretty and Pink. You ever seen this film? Yes. Great movie. I've never seen classic John Hughes film, but he was it it when it ended, the test audiences didn't like the original ending. So, the studio made him change it and he hated that. So, what he did was he remade the movie, retold it with Some Kind of Wonderful. And Some Kind of Wonderful is a better movie, but it's boring as [ __ ] cuz it's literally the exact same story as Pretty and Pink with just the roles, the the two main roles gender swapped. And so I think this movie standalone you're like there's some cool stuff going on in this but the fact that it literally is just almost the exact same movie as Prometheus as far as the characters concerned. We got an android that's literally played by Michael Fastpender. We got a captain that's got a southern",
            "start": 508.0
        },
        {
            "text": "literally is just almost the exact same movie as Prometheus as far as the characters concerned. We got an android that's literally played by Michael Fastpender. We got a captain that's got a southern accent that's played by Danny McBride for no reason is in this movie. um spenders accent is so bad in this and we like and again we once again sort of barely explore the concept of like faith versus science and then creation versus like faith and all these things and none of it's very well fleshed out and then you add to that again another incompetent crew that just makes stupid choices at every single turn everyone on this crew must be married to each other J and I were watching like why would you do why at le when you're in space things happen freeze one of them I guess like you know what I mean so you're always looking for the good of the colony but each other. No, that's dumb. Yeah, I mean, we do get to that one point where it's like, oh, my wife's on the planet. It's like, well, and",
            "start": 542.56
        },
        {
            "text": "mean so you're always looking for the good of the colony but each other. No, that's dumb. Yeah, I mean, we do get to that one point where it's like, oh, my wife's on the planet. It's like, well, and then the lady Rosenthal is literally like, \"Hey, man, you can't do like you have to think about the 2700 colonists we have there.\" He's like, \"Bring bring the ship into 80,000.\" All right, what are we doing, guys? Like, you know that there's a there's only one person in all of the Alien franchise who's ever been like, \"Hey, man, there's something on that dude's face. We can't let him back up the ship.\" And it's Ripley. And then the only reason why they did it was because, you know, there was a conspiracy to let the guy back on the ship because Andrew did it. But in this, it makes no sense. Like they're coming back. This guy's spitting [ __ ] out of his [ __ ] mouth. Get him in your face. Don't touch anything. They're talking about quarantine profile, but nobody's following him. Nobody's",
            "start": 583.6
        },
        {
            "text": "they're coming back. This guy's spitting [ __ ] out of his [ __ ] mouth. Get him in your face. Don't touch anything. They're talking about quarantine profile, but nobody's following him. Nobody's following up. When you're in the moment, you married so I get it. But it makes me not like it just really makes me not like these characters. The same problem I have with Prometheus where I'm like, you got to write smart characters and you got to put them in a situation where it's it's a conundrum. It's it's difficult, right? But in this there it's a no-brainer. The guy's pale as a ghost spitting up black stuff and they're like, \"Get him onto the ship ASAP.\" And the lady has one moment she's like, \"Ah, I don't know.\" Ah, yeah. Okay, [ __ ] it. Put him on the ship. And then they lock Carvin to Jo. They do that every time. It's always this like, \"No, we can't.\" I guess we can. We can. Okay. Um, I'll say I I think the movie does have some good points to it. I do like I do like Dave. I I like",
            "start": 618.4
        },
        {
            "text": "Jo. They do that every time. It's always this like, \"No, we can't.\" I guess we can. We can. Okay. Um, I'll say I I think the movie does have some good points to it. I do like I do like Dave. I I like Michael Fastpender. I like exploring that. And I do like the concept that he like decided to create his own like Garden of Eden where he could create all these crazy things and like this this menagerie of horrors. And I think the ending might be one of the best endings in all of Alien movies even though you see it coming, but it's kind of ter Katherine Wat is like just terrified as she falls asleep and you're terrified for her and then he spits up little, you know, all that stuff is all that stuff is amazing. I just think they earned that ending. By the time we get there, I'm like, I'm glad that Billy Critter died. Why would you why would you say I've seen the devil and then follow this guy into a [ __ ] basement full of giant alien eggs and then go oh I'll touch the egg it's okay he",
            "start": 651.2
        },
        {
            "text": "that Billy Critter died. Why would you why would you say I've seen the devil and then follow this guy into a [ __ ] basement full of giant alien eggs and then go oh I'll touch the egg it's okay he keeps saying it's okay he keeps saying it's like it's okay but obviously the bad guy remember he's got faith he's a man of faith yeah he try the but you're talking to an android who's a human creation you're talking about [ __ ] robot it's like god made why would you have faith in this thing he believes in him all of these things the first rule with robots can't hurt us all all of these things just make a real another jumbled mess unfortunately um but at least we get to see a xenomorph at the end of this Yeah, at least we do. Greg, what did you think? I enjoyed this one. Uh, you know, my my expectations and were so low. I did not like Prometheus at all. What did I like about Prometheus? Fast bender. So, to start off, bam, it's Fast Bender. It's Aldrich Killian talking to each other. I'm",
            "start": 689.2
        },
        {
            "text": "expectations and were so low. I did not like Prometheus at all. What did I like about Prometheus? Fast bender. So, to start off, bam, it's Fast Bender. It's Aldrich Killian talking to each other. I'm like, hell yeah. All right. And then I was like, wait, are we going to get too f too fast? Too fast. Two furious benders and then a bunch of dumb [ __ ] and aliens and whatever. Yeah, it was fine. Uh, but in terms of like the movies, like you know, we talk about with Marvel and MCU, right? How we have the different, you know, tiers and the S-rank and the A rank and the B- rank. And I really feel like there's just like there's like the good section and then the rest of them here. And like I think this is like the best of the other section of just like I enjoyed this throughout. I thought Fast Bender was great and interesting. Uh, I think, you know, is it well are they hitting on same the same notes they hit with Prometheus? I think yeah, but I think there was more going on here that I",
            "start": 725.44
        },
        {
            "text": "Bender was great and interesting. Uh, I think, you know, is it well are they hitting on same the same notes they hit with Prometheus? I think yeah, but I think there was more going on here that I enjoyed than in Prometheus. So I enjoyed this one versus that one. I was really hoping for a moment where not Fast Bender Walter is just like, \"Well, we have to take them back to the ship and then somebody be like, \"Wait, David, is that you?\" No, no, no, no, no. It's it's me. You I'm in disguise. That was my thing. Such a weird When David came down and or when Walter came down and found David cutting his hair, I'm like, \"What the [ __ ] are you doing?\" Like, I can see where this is going immediately. What are you doing? Yeah, but like that's the that's the problem, right? is when you as the audience member who's like, I'm not a smart person. We can all agree. Agreed. We're the four of us together just dumb. I mean, you add us all if we kind of get one competent person. Yeah. But you see this",
            "start": 762.56
        },
        {
            "text": "member who's like, I'm not a smart person. We can all agree. Agreed. We're the four of us together just dumb. I mean, you add us all if we kind of get one competent person. Yeah. But you see this alien that's this this robot that's clearly off a little, right? He's a little weird. And you're like, and he's and then these little things just were like hunting you and you walk into this temple and you're like, \"Hey man, are we safe here?\" He's like, \"Perfectly safe.\" I'd be like, \"Question, why? How are we safe in that? There's a [ __ ] opening right here. Those things are all over the goddamn place. We don't know how many there are. Why are you so trustful? We saw all the people who were like frozen in time outside. We're fine. Yeah, the guys that were burned with [ __ ] They walked in there as if they had like armed turrets behind them looking out at like this the this little foresty area or whatever where all these little creatures were. I I thought the same thing. I was like, why?",
            "start": 802.64
        },
        {
            "text": "as if they had like armed turrets behind them looking out at like this the this little foresty area or whatever where all these little creatures were. I I thought the same thing. I was like, why? You're just think you're safe. Why would anyone go on there? You should just be running. And the captain's like, \"I want everyone to trust me because I really want to be a good captain, but hey, by the way, why don't you walk off into this mysterious complex by yourself? Just go ahead.\" At no point does anyone know walking twos for Christ's sake. Jesus Christ. Sorry, guys. No, I get so angry cuz it's such a so much amazing wasted money in this. And the setup's good, but it's just not Well, that's the setup. Sure. And then you get to the last I don't even want know if it's third, but like the big action scene is just so whatever to look at. Which big action scene? The first one or the one where we get on the ship and you're like, I wish this ended. Oh, I forgot there's another alien on board",
            "start": 841.2
        },
        {
            "text": "action scene is just so whatever to look at. Which big action scene? The first one or the one where we get on the ship and you're like, I wish this ended. Oh, I forgot there's another alien on board for no reason. Where the [ __ ] did that thing come from? Has to be. To me, I think the biggest uh upsetting point is this is a 2017 movie. Like this is 5 years after Prometheus and it's just just devoid of like new original ideas that are fun to watch. And comparing this to other movies in 2017 or around there, like think of how deep into the MCU we are at this point. Yeah, that's crazy to think that this movie like of course I didn't know [ __ ] about of course I've never heard Nick talk about Alien Covenants of my memory like oh I mean I've watched this movie one time and you see it in theaters or I saw in theaters because I love the alien movies but I remember watching this being like okay this really feels like they just remade Prometheus because people had grudges against it or",
            "start": 882.0
        },
        {
            "text": "theaters or I saw in theaters because I love the alien movies but I remember watching this being like okay this really feels like they just remade Prometheus because people had grudges against it or something and I know he wanted to do a trilogy originally but this one just was very poorly received because you get midway through it and you're like I'm bored and I think most people were and by the time you get back up to to the Covenant. You're like, I I want this to end. Man, I actually legitimately forgot there was a whole other action sequence in the cargo hold of this, which was very so sad cuz I think conceptually these movies are so badass. They're so cool on paper and they're just ultimately some really big fumbles cuz you could have had you could have had some of Hollywood's best writers and imaginators like taking this source material and making like true magic with it. And it just it really bums me out that they're just kind of so whatever, you know? Imagine if they actually",
            "start": 921.76
        },
        {
            "text": "and imaginators like taking this source material and making like true magic with it. And it just it really bums me out that they're just kind of so whatever, you know? Imagine if they actually sh did that that side comic that you were talking about where it was just Shaw and David going to the the engineers like home planet and like having to interact with them and like get overrun and having to kill them. Like that would have been a much more interesting story. But I think the problem was and the big the big criticism of Prometheus was like we didn't really see an alien till the end. So he's like oh let's put a bunch of aliens in them. I'm like kind of a it sucks to say cuz the movie is Alien Covenant but I kind of wish they didn't put any aliens in this. I kind of wish it was just more of a like high flutin sci-fi movie as opposed to a monster movie by the end of it. I guess I just really dug the the look of the creatures even though they didn't always look great because of the CG.",
            "start": 963.6
        },
        {
            "text": "of a like high flutin sci-fi movie as opposed to a monster movie by the end of it. I guess I just really dug the the look of the creatures even though they didn't always look great because of the CG. But there are so many of the shots from this movie that I realized I had seen that I thought were fan art that I thought were just fan creations with the xenomorph on the the airship or whatever and it does that and I was like, \"Oh, that's the gif. I've seen this gift a thousand times every time I look for an alien. No. Where it just goes like that and it looks really cool. Yeah. I like I like the little one when he was going like this and again for the wrong reasons, but I liked him just doing a little dance and he [ __ ] [ __ ] But also when he blows on his face cuz it's how Greg and I communicate. That's true. I mean Tim, you know me. I'm just a dude who loves variations of things. Sorry, I hit the wrong button. What's up everybody? back to those podcast. I don't think anyone gets",
            "start": 1001.04
        },
        {
            "text": "communicate. That's true. I mean Tim, you know me. I'm just a dude who loves variations of things. Sorry, I hit the wrong button. What's up everybody? back to those podcast. I don't think anyone gets naked in this entire film. What are you talking about? There's this scene in the shower. That's the That's the talking. That looks sick. That's a sick ass shot. We're back. We're done. Well, we got to end it. We talked about remember they [ __ ] in the shower. This movie does have boobs and and like and yeah, some some torso. That's it. Well, it's got it's got Jesse Smlet's torso. Thinking of the other Predator movies and being like, \"Oh, dude, those cool different mask variations.\" Love seeing those. I just love seeing different interpretations of the xenomorph, even though it's not really a xenomorph, but yeah, the peach color one with the They're just weird looking, man. They're [ __ ] scary. The weird [ __ ] the mouth that doesn't exist and then just bites his hand off like throats",
            "start": 1045.6
        },
        {
            "text": "a xenomorph, but yeah, the peach color one with the They're just weird looking, man. They're [ __ ] scary. The weird [ __ ] the mouth that doesn't exist and then just bites his hand off like throats his [ __ ] arm. It was crazy, man. Yeah, it does. I love how this movie insists on like, okay, there's the chest burster, but what if it burst out of a guy's back? What if it burst out of his face? But that's the other that's the other like I'm left with a lot of questions on this, and I think that's kind of purposefully done. And I think they they want you to like investigate a little bit more and like think about it, but I'm like I just don't understand what this stuff does. And I know that David's been like on this planet for 10 years biomechanically engineering and like splicing DNA and crossbreeding and stuff, but we start off and he's like, \"Yeah, I did like this thing like I I I bred it. I I spliced the DNA and it killed all living organisms on this planet and then it doesn't do",
            "start": 1087.76
        },
        {
            "text": "crossbreeding and stuff, but we start off and he's like, \"Yeah, I did like this thing like I I I bred it. I I spliced the DNA and it killed all living organisms on this planet and then it doesn't do that anymore. Now it makes a xenomorph.\" I just don't understand like where we're at with all I guess he's trying to create the perfect thing, but then why does some of it go into a little thing that then boofs into your ear and then kills you and then the thing comes out of your back and then why does some of it just an egg that pops into like what the rhyme or reason for this? Well, I think the permutations of it, right, where he had to he had to cross pollinate to get the face huggers in the egg. Yes. Which means he probably cross-pollinated with these little boofers as you call them out there that are happening naturally off of whatever DNA they intersect. Well, how come the bofers So like are the like my question is what killed all the wildlife on the planet and why the alien Well",
            "start": 1123.68
        },
        {
            "text": "there that are happening naturally off of whatever DNA they intersect. Well, how come the bofers So like are the like my question is what killed all the wildlife on the planet and why the alien Well then why when the thing boofed in my face didn't it kill me? Well, it's Well, they died the same way here, right? My popped out of them. Yeah, there's aliens everywhere. But I think now this is Hey, how many how many movies are we in now? 17 forget I'm still going. I'm still talking. I just one question. This is our 11th. This is our 11th movie. Throughout this entire thing, we've argued over and over again, was the aliens sleeping or dying, right? So, like every time we throw out any criticism of this [ __ ] movie, some nerd burglar in the chat pops up and is like, well, remember they die really quickly. So, my thought would be that like he unleashes this on and then I'm like, why don't why don't the why did it look like a horse that one time and a dog? Well, whatever they get to changes",
            "start": 1166.08
        },
        {
            "text": "quickly. So, my thought would be that like he unleashes this on and then I'm like, why don't why don't the why did it look like a horse that one time and a dog? Well, whatever they get to changes their DNA and they kind of look like that. So I think when he unleashes it, it has its own little life cycle out there of some become boofers which are like we're going to be the face hugger eggs, but since we we have to be activated like the face hugger eggs, so we sit there. But yeah, they basically infected all life on this planet, killed it cuz they gave them and then all the things that burst out of them died because it was all buggy or whatever like everything else, right? Okay. Yeah. This still leaves me and again no future spoilers even though I don't think that we'll get there, right? My question had been before like, okay, cool. How do we get where do how did we get the face huggers we know? I asked last week if this was there and we said no future sports blah blah. And so now I'm",
            "start": 1208.88
        },
        {
            "text": "question had been before like, okay, cool. How do we get where do how did we get the face huggers we know? I asked last week if this was there and we said no future sports blah blah. And so now I'm still on the same point of like cool. How did David with 2,000 colonists that he could infect at will I guess get the aliens to the giant ship that we found in Alien One where we had the aliens we know that are the alien. So, like David now took these colonists and his alien face huggers and aliens and found one of the giants and infected them and put them on their ship that then crashed on whatever it was from Alien One. Like, you know what I mean? Like, my problem with Prometheus and this is it's going out of its way to try to answer questions I wasn't asking. They're aliens. Cool. They evolved on a different planet. I'm not worried about like, oh no. But it turns out there were some boofers that got this. Cool. Now you've made me question even more of how the [ __ ] we got to where",
            "start": 1249.52
        },
        {
            "text": "evolved on a different planet. I'm not worried about like, oh no. But it turns out there were some boofers that got this. Cool. Now you've made me question even more of how the [ __ ] we got to where Sigourney Weaver ran into these [ __ ] things. Yeah. Yeah. I agree. I agree. And now we've had two movies. I wasn't asking those questions once, but now I am. Now I'm asking you shitty answers. God dang it. Make a movie about the big white alien that was Jesus. I want to see that on. Yeah. Do more of that. Do more of that. I didn't like how the the the big white Jesus men looked ate [ __ ] They just looked different here. clothes on and stuff. They're like the Avatar TJ Maxx versions. It's totally like I I didn't want this. I didn't want them to be that. I wanted it just to be like five dudes that look the same sitting like around a table and like they're like they're just like Dark Souls NPCs that it's like, \"Oh, you just sit here for millennia or whatever, but you play with sometimes.\"",
            "start": 1296.88
        },
        {
            "text": "that look the same sitting like around a table and like they're like they're just like Dark Souls NPCs that it's like, \"Oh, you just sit here for millennia or whatever, but you play with sometimes.\" So, the whole civilization was just hanging out and like families and [ __ ] They just all get over it's like, \"Oh, man. I I always saw them as like something else than us. They do different things than us.\" Exactly. Yeah, they're just congregating for a [ __ ] town square appointment. You're welcome. Oh no, they got all the nukes. We're going to go through the entire plot of this movie right after a word from our sponsors. This episode is brought to you by Imperial. We've told you all how important it is to developers to wishlist games that you're interested in. So, if this sounds cool to you, make sure you wishlist it. Imperial is a complex, featurerich action RPG where you'll be sent to a planet in a far-off corner of the galaxy to explore an imposing monolith. As an elite mercenary,",
            "start": 1340.72
        },
        {
            "text": "make sure you wishlist it. Imperial is a complex, featurerich action RPG where you'll be sent to a planet in a far-off corner of the galaxy to explore an imposing monolith. As an elite mercenary, you'll join the expedition tasked with unearthing the secrets of the monolith and face off against the deadly automatons within. In Imperial, you'll explore four vastly different quadrants of the monolith. Accessible only by using mysterious artifacts known as cardoggrams. Each card affects which enemies, boss fights, and loot will appear when you enter the monolith, so no two excursions will be the same. Find even more cardoggrams to explore by looting defeated enemies, or buy them from other players online at the trading post. Imperial features three weapon archetypes: the fast-paced acrobatic glaive, the defense focused mason shield, or the devastating cannon with a range of customizable skills and abilities that can make short work of the awaiting automatons. Your weapons and abilities",
            "start": 1378.08
        },
        {
            "text": "glaive, the defense focused mason shield, or the devastating cannon with a range of customizable skills and abilities that can make short work of the awaiting automatons. Your weapons and abilities can be changed before any excursion into a cardoggram. So, if a loadout isn't working for you, you can mix things up to create the perfect play style. Help the members of the expedition in deep branching quests and aid other players in asynchronous multiplayer. Get ready, mercenaries. The monolith awaits. Imperial is available May 8th on PC, Xbox Series X and PS5. Wishlist now. It helps so much. Wishlist Imperial. This episode is brought to you by Auraframes. If you haven't called your mom in a while, here is your reminder to do it. But then you want to go above and beyond. Mother's Day is coming up and I have the perfect gift idea. Aura Frames are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order",
            "start": 1422.48
        },
        {
            "text": "up and I have the perfect gift idea. Aura Frames are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preload it with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special they'll use it every day. Greg, Kevin, and a ton of people here at Kind of Funny are obsessed with their Aura frames. It takes about 2 minutes to set up a frame using the Aura app. So, the next time you need to call your mom, you can also send her a new pick of you from that trip you're telling her all about. Aura has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting aura.com to get $35 off plus free shipping on their bestselling Carver Matte frame. That's a r aframes.com promo code kind of funny. Support the show by mentioning us at checkout. Terms and conditions apply. The show is sponsored by",
            "start": 1469.84
        },
        {
            "text": "shipping on their bestselling Carver Matte frame. That's a r aframes.com promo code kind of funny. Support the show by mentioning us at checkout. Terms and conditions apply. The show is sponsored by BetterHelp. It's super great that mental health awareness is growing, but there's still progress to be made. 26% of Americans who participated in a recent survey say they have avoided seeking mental health support due to fear of judgment. We can do better. No reason for fear. BetterHelp has over 10 years of experience matching people with the right therapists from the diverse network of more than 30,000 licensed therapists with a wide range of specialties. Some of my best friends use BetterHelp and love how helpful it can be for learning positive coping skills and how to set boundaries. It empowers you to be the best version of yourself. It isn't just for those who've experienced major trauma. If you're thinking of starting therapy, give BetterHelp a try. It's entirely online, designed to",
            "start": 1510.32
        },
        {
            "text": "you to be the best version of yourself. It isn't just for those who've experienced major trauma. If you're thinking of starting therapy, give BetterHelp a try. It's entirely online, designed to be convenient, flexible, and suited to your schedule. We're all better with help. Visit betterhelp.com/kindfunn to get 10% off your first month. That's betterhelp hp.com/kindfunn. betterhelp.com/kindafoney. Danny McBride is in this film. McBride. [Music] That's all I got, man. I was I just couldn't think of nothing rhymes a covenant like Oh, man. It does continue the tradition of these movies at multiple times making me go what the [ __ ] there in this one had two James Franco had a couple briefest briefest [ __ ] second what was that about we're like right there let's just get to it cuz it happens like immediately right welcome everyone to Alien Covenant we begin with a flashback of course is uh the one and only Aldrey Aldrich Killian from Iron Man 3 Guy Pierce I believe is no wonder they made",
            "start": 1559.04
        },
        {
            "text": "like immediately right welcome everyone to Alien Covenant we begin with a flashback of course is uh the one and only Aldrey Aldrich Killian from Iron Man 3 Guy Pierce I believe is no wonder they made him look so shitty in part They they had to they had they had so much of future planned for him that he had to be here for this season. Remember it was supposed to be a trilogy. Shut up. How about that? Do you remember that? Really? Yeah. Ridley wanted to make a third after this, but they were like, \"Nude, we're good.\" No, man. We're good. We outsk. Yeah. Langley Melian Langley Mne a monster and xenomorph in his own right out there. And the chat was saying that he this was supposed to be a reboot. That's why none of it makes sense. That's what he says. Langley Neil's been inside Ridley Scott's nightmares. So, I don't know. Maybe he knows what he does. Anyways, we get a flashback here of him talking to David. Walter, right? It's this is he says they call him Walter. They call him David. I",
            "start": 1611.6
        },
        {
            "text": "nightmares. So, I don't know. Maybe he knows what he does. Anyways, we get a flashback here of him talking to David. Walter, right? It's this is he says they call him Walter. They call him David. I forget who call him David. Uh it's his original creation. They go back and forth. This is when I was already like what? Okay. Um what are you doing again? Are we doing Prometheus exactly again or whatever? But they banter about life and creator and creations and basically like back to the Prometheus bit of like what would you say to your creator if you could meet him? I met you but why are you doing the thing? Yeah. Blah blah. What's up? And and like another [ __ ] Hey, where the where'd you get them dice from? Oh, you're alone. Han Solo. You're Cuz you're solo. Cuz you're alone. What's your name? Looks up the statue of David. But it was that the real statue of David. That's the coolest thing. He's so rich. He owns it. It's pretty cool. That makes that does make it a little cooler. But I",
            "start": 1654.48
        },
        {
            "text": "name? Looks up the statue of David. But it was that the real statue of David. That's the coolest thing. He's so rich. He owns it. It's pretty cool. That makes that does make it a little cooler. But I like the book end, right? Where he's like, \"Play me play me a song.\" He's like, \"What is it?\" The the entry of the gods into Valhalla. Yeah. Yeah. It's like a ride. And then of course at the end, that's what he plays. But it's with the big symphony. Yeah. Kind of cool. Always gets better with the symphony. Again, apologies to everybody last week when we did this uh when he was old and under the makeup. Guy Pierce and Jen was like, \"Who is that?\" And I was like, \"I can only give you Aldidge Killian from Iron Man 3.\" I saw all your comments incredibly offended. I couldn't remember him from Momento or any of the actually good movies he's been. I'm like, I only know him as Aldidge. There's three polls. There's Momento, there's LA Confidential, which I know him from. Uh, and then there's",
            "start": 1692.48
        },
        {
            "text": "Momento or any of the actually good movies he's been. I'm like, I only know him as Aldidge. There's three polls. There's Momento, there's LA Confidential, which I know him from. Uh, and then there's Lockout, of course, which is the classic guy Pierce movie where he has to go up to this the space jail on the moon to save the president's daughter and then they go so much better than this right there. See that Halo map? Instead, from there, we jump to 2,14 on the ship Covenant. We're going to rank the ship names. Going to rank the ship names. Let's rank some ship names. What's up everybody? It's a podcast within a podcast where we rank all the names of the ships that appear in the Alien versus Predator movies. Currently, the list looks like this. Number one, the Nest Stromo from Alien. Number two, the Sulakaco from Aliens. Number three, Prometheus from Prometheus. Number four, the Aria from Alien Resurrection. Number five, the Betty from Alien Resurrection. And number six, Fiorina Fury",
            "start": 1732.4
        },
        {
            "text": "two, the Sulakaco from Aliens. Number three, Prometheus from Prometheus. Number four, the Aria from Alien Resurrection. Number five, the Betty from Alien Resurrection. And number six, Fiorina Fury 161, Alien 3. We ranked that too low. Where do we want to rank the one, the only Covenant from Covenant? Prometheus at number four. What's up about above? The Aruga, the Orga, the Aruga, the Arugala. I mean, which which ship is Covenant? The big one. The big the big one. But like, but that's So, here's my question cuz I think this is pretty cool. I mean, it takes a little some style cues from the Nostromo cuz the Nestromo was the ship that was like the tugging the big mining ship, right? We're not talking visuals, Nick. That's a different one. We're talking names. Just the name. My apologies. Yeah, I'm think I'm with Andy here. Like Covenant, very cool. But this is another example of this movie where I've given Aliens and Predator so many props for like inspiring so many classic video games,",
            "start": 1779.68
        },
        {
            "text": "I'm think I'm with Andy here. Like Covenant, very cool. But this is another example of this movie where I've given Aliens and Predator so many props for like inspiring so many classic video games, Metroid and Halo and stuff. Covenant, come on, man. You're just stealing that [ __ ] from Halo. Yeah, exactly. Exactly. I can't give him full full credit then. I still think I think for me the list just breaks it tulaku, which sounds like an Italian dish and I don't like it. Right. So, I'd put it in, but I lose the vote. You think it's got Italian beans in it, don't you? What What am I thinking of there? Sulaku, like a ziti or what? No, there's some [ __ ] dish I Oh, you're thinking about the the fish the um I'll think about. It doesn't matter. Anyways, so but anyways, the votes have I guess you want to vote with me or whatever. I don't know how. Sure, I'll take it cuz I have Prometheus at number three and this below that covenant at number four above. It's not cooler than Prometheus, but",
            "start": 1828.88
        },
        {
            "text": "want to vote with me or whatever. I don't know how. Sure, I'll take it cuz I have Prometheus at number three and this below that covenant at number four above. It's not cooler than Prometheus, but it's not cooler than hard to say. Cuz sounds like an Italian dish. Yeah, that's very just sounds like a cartoon sound effect. My eyes I just saw an attractive woman. My eyes are bulging out of my head. Steam coming out of my ears. Cory Clark in the YouTube says, \"Are you thinking of Sulaki?\" No, no, no. That no sugu. I don't know. Next I'm going to go back to Fiorella. I'll find out what the [ __ ] it's everybody. Okay. Anyways, Alien Covenant ship Covenant goes in at number four. Thank you very much. I here's a here's a question I have that I don't actually want the answer cuz I don't want future spoilers even though it's not that big of a deal. So from here on out are just the names of these movies the ship names cuz Prometheus with the ship coming to the ship is Romulus the [ __ ] ship",
            "start": 1865.04
        },
        {
            "text": "spoilers even though it's not that big of a deal. So from here on out are just the names of these movies the ship names cuz Prometheus with the ship coming to the ship is Romulus the [ __ ] ship [ __ ] cuz that's a [ __ ] cool name. Not very [ __ ] high. Oh [ __ ] Okay. All right. Well, you got me really pumped. Let's see. God damn. Romulus is a cool Put that number two. Okay. Well, what's number one right now? Nostromo. Nostromo. Man, come on. I don't know if Ramulus is cooler than that. If it is, we'll see. Anyways, the Covenant's out there and it's going to go colonize Jenny Ortega. Um, it's got like 2,000. It's going to like Orga 6. Oh, okay. I call the planet Jenny Ortega. Get on board or get out of the way. All right. Who's got the belt right now? Not you. Me. Okay. You should name uh if you and J ever have another kid. Nomro. Nomro Miller. Or Sulaku. Miller. Nomro. Sulaku Miller. Are you an Alien fan? No. Why? Dad can't pronounce your middle name. wife. Oh man, we were talking",
            "start": 1910.08
        },
        {
            "text": "uh if you and J ever have another kid. Nomro. Nomro Miller. Or Sulaku. Miller. Nomro. Sulaku Miller. Are you an Alien fan? No. Why? Dad can't pronounce your middle name. wife. Oh man, we were talking about that the other day cuz like Egon Egon wasn't in the running but it wasn't out of the running. Egon would have been a [ __ ] great name but but imagine I'm dropping him off at school and my freaking Mini Cooper. It's got an Ecto1 license plate. I'm dressed as a Ghostbuster named Egon. We've gone too far. We've gone through the You just keep introducing your wife as Janine and Jen's like that is not my name. Well, you know, what was the name of the planet? Like the one that you're calling or guy I want to say or orga three or something or guy three. Yeah or guy six or six or gay or a guy or a looking at Wikipedia it seems like this is Prometheus was 20 years before Alien one. This is 10 years before Alien one. Okay for context correct because he says he was on the planet for 10 years.",
            "start": 1951.76
        },
        {
            "text": "a looking at Wikipedia it seems like this is Prometheus was 20 years before Alien one. This is 10 years before Alien one. Okay for context correct because he says he was on the planet for 10 years. Yeah but I'm just saying Alien one. Oh my apologies. Yeah. And also according to Langley none of it matters so don't worry about And then there was a massive just loss of technology across the world and we switched to [ __ ] tube TVs in that one. You see what I'm saying? We could have had everything. No, let's see. Let's go back to the nerd burglars are going to tell you. Well, remember they they were financed really well. That's why their ships look better. And again, now the way they're freezing and unfreezing people is different, too. They got better tubes here because this colony ship had better. Shut the [ __ ] up, nerd burglars. Just admit it don't make sense. OMGX got me real good with his next one will be Gaka Miller. That's a That's a middle name. I was laughing. I was laughing. I",
            "start": 1996.64
        },
        {
            "text": "Shut the [ __ ] up, nerd burglars. Just admit it don't make sense. OMGX got me real good with his next one will be Gaka Miller. That's a That's a middle name. I was laughing. I was laughing. I was laughing so hard on the drive home just being like, man, you could not pay me a million dollars to think of the villain in Ghostbusters. I didn't even know that had a name. Underutilized. He was underutilized. He should have gone to Hollywood Horror Nights cuz he was a big enough deal to be featured there. Everybody, that right? I don't see [ __ ] Michael Fastpenders weird ass dildo robots walking around over there. Who do the Ghostbusters people? What? They have [ __ ] on somebody. Like why do they keep letting them make these movies? It's unbelievable. God damn it. Oh my god. This is supposed to be a fast plot. Not for a time. I just thought cuz it's a short shortage movie. Anyways, uh we're we're on the ship now. It's the Covenant. Congratulations everybody. Everybody's having a good",
            "start": 2039.68
        },
        {
            "text": "to be a fast plot. Not for a time. I just thought cuz it's a short shortage movie. Anyways, uh we're we're on the ship now. It's the Covenant. Congratulations everybody. Everybody's having a good little sleep and we get uh what's his name? Wester. Wes Wesley. Walter. Wesley's walking around. He's just doing the alien [ __ ] again. You know, he's a [ __ ] droid. We get it. He's touching the things. He's still touching everybody's screen. No, no dreams, but he looks like he could do it, but he's not doing it. But he's doing it. Do we know? Uh and everything's just [ __ ] Max chillaxing. You know what I mean? It's a like this [ __ ] wave goes out across the universe, right? some kind of like what do they call it? Neuro nutrino. Nutrino burst. A sudden nutrino burst goes off. I think he's like, \"Mother, make sure to turn off the sensors, mother.\" Like [ __ ] He put up He put up his sign. Yeah. Is the solar charging panels. This thing comes through. [ __ ] them up. But then it shoots.",
            "start": 2093.04
        },
        {
            "text": "like, \"Mother, make sure to turn off the sensors, mother.\" Like [ __ ] He put up He put up his sign. Yeah. Is the solar charging panels. This thing comes through. [ __ ] them up. But then it shoots. There's fires all over the place. Like emergency, wake up the crew, whatever. These poor bastards are getting up. They're throwing up. There's smoke and fire. Everything. Oh, the [ __ ] going on? And then James Franco's too. save him just [ __ ] burning alive while his wife's banging on the outside of him. Holy [ __ ] Could you tell it was James Franco? No. I think at a glance before it goes I was like he looks familiar. And then and I was like it looked like Franco. And then it was obviously when he's dead we go to his room or her room where she looks at a dig an aura frame. Use a promo code. Kind of funny. And uh she's like oh. And he's like I'm up on a mountain. Wish you were here. Why aren't you here? His friend almost dies behind. I'm like man I'm glad he's dead. the captain. It's",
            "start": 2132.96
        },
        {
            "text": "Kind of funny. And uh she's like oh. And he's like I'm up on a mountain. Wish you were here. Why aren't you here? His friend almost dies behind. I'm like man I'm glad he's dead. the captain. It's literally just watching 27 hours. But then they show remember when they like later when they're like we got to honor him. They show a picture of him and he's got the thing that like the Virgin Mary had like he's like Jesus in the middle of the [ __ ] Last Supper picture they show later. Like what are we talking about here? You don't remember this part? No, I I didn't stand out to me as a Well, you probably you probably rented version five of seven. That's 100%. There's it's literally we we'll skip ahead a little. They go, \"Oh, Billy Crup, you're the new thing.\" And he's like, \"I was never going to be the captain before cuz I'm really religious.\" They're like, \"Why does that matter?\" Yeah. Oh, cuz we have to explore the theme of rel faith versus science versus this versus that. And they go,",
            "start": 2175.04
        },
        {
            "text": "to be the captain before cuz I'm really religious.\" They're like, \"Why does that matter?\" Yeah. Oh, cuz we have to explore the theme of rel faith versus science versus this versus that. And they go, \"Hey, man, can we just take like one second to honor our crew?\" And he goes, \"No, we got to fix the thing cuz the nutrino blast might come again.\" And then he goes, \"Okay.\" And then he catches them like pouring out some whiskey for them and they're looking at a picture of him. They're all there and he's in the middle and he looks like Jesus. It's very weird. Maybe I Maybe it was. No, no, I believe it. I just It It didn't You know, I catch on weird things all the time. It just didn't catch me all the time. Yeah, I remember the picture. I don't remember like I James Franco could have been in the Goblin outfit and I would have not noticed. Fair enough. It's odd that they got and I don't remember when Franco had the controversies happening, but I think it was after this. So, it's very weird.",
            "start": 2212.16
        },
        {
            "text": "Goblin outfit and I would have not noticed. Fair enough. It's odd that they got and I don't remember when Franco had the controversies happening, but I think it was after this. So, it's very weird. It was after that after 2017. Oh, yeah. It had to have been James. No way. We were at IGN when James Franco first started going through stuff when he was like texting underage girl and stuff. No, this was like remember he started a college. Remember that? Like it was like some sort of college and then the they were like, \"Hey, this is [ __ ] What's happening? Uh, hello. Hello. This is This is the picture. This is Okay, I see it. Yeah. Why is he wearing that? Everybody, we have Chris Ank on the phone. Hello. Hello, Chris. Hi. Uh just for some context, it probably won't help you with the with how he is the film, but before this film came out, they filmed two short films and one of them is about the crew before they're going to sleep, which is where you get a lot more James Franco because it",
            "start": 2245.76
        },
        {
            "text": "he is the film, but before this film came out, they filmed two short films and one of them is about the crew before they're going to sleep, which is where you get a lot more James Franco because it is a really [ __ ] weird thing that they have him in here and they kill him in two scenes. And the other film they did is about David and Elizabeth going to the planet and actually about their time on that ship. and you kind of get a bit more of like why David is like this and like is kind of his feelings for Elizabeth. Um, but it's like they're just two weird YouTube shorts that just like aren't really part of the film, but they're out there and in, you know, in canon. So, how short are they? Like two, three minutes long. That's insane. Okay. Okay. So, I mean, short enough to have probably included in this movie. Do you know anything about when Oh, he's gone. Uh, I would like to officially move that we stop this interview then. I don't think in good conscious we can we can rank and review",
            "start": 2285.36
        },
        {
            "text": "in this movie. Do you know anything about when Oh, he's gone. Uh, I would like to officially move that we stop this interview then. I don't think in good conscious we can we can rank and review without these four minutes of footage that was said all this right you know James Frank says he uh groomed his students systemat uh systemically systematically I believe they were so when you when you brought up the grooming cuz I knew there was underage girls dude I started college just to just to try to get like underage or not underage actors like actors like do horrible [ __ ] I I was thinking like, no, you're probably thinking Jared Leto, but no, they both did really weird [ __ ] Letto I don't know. I don't follow Leto, but I know he hasn't been. Leto had a cult. He's still working though. He's still working. Look, I'm uninformed enough that I don't want to comment on any of this officially. You could just say allegedly. I think Leto allegedly had a cult with like He's still working",
            "start": 2333.36
        },
        {
            "text": "He's still working. Look, I'm uninformed enough that I don't want to comment on any of this officially. You could just say allegedly. I think Leto allegedly had a cult with like He's still working though. So, it wasn't that I mean, he didn't get like ostracized because he's in Tron Aries coming up, right? That's a big Disney movie. Yeah, but that but there's a lot of people being like, \"Fuck, I don't want to watch Tron Aries because of this asshole.\" You know? Well, either way, I'm gladly says Leto didn't have a real cult. It's not real. That was a joke cuz there's pictures of him. Okay, I'm going to look into this. But what about Yeah, let's just keep going. I'm about to go down a dark level of humor on this that we don't need. They get the fires put out. They uh Well, we said all this stuff. They lay him to rest even though he want they didn't listen to me. And he's like, \"You got to let him be or whatever.\" Then they they Go ahead. Sorry. Billy Kredup. Love Billy Kredup, right? Uh",
            "start": 2372.24
        },
        {
            "text": "They lay him to rest even though he want they didn't listen to me. And he's like, \"You got to let him be or whatever.\" Then they they Go ahead. Sorry. Billy Kredup. Love Billy Kredup, right? Uh uh. What I don't like about Billy Kredup is he looks too much like the guy who was in ET and so I can't keep him apart. Yeah, but wasn't he Barry's dad in uh the Flash at one point? Oh, was it him or ET? Guy, I can't [ __ ] keep it straight. Did I Did I stutter? I think it was Billy Cartup. Uh I love him in the in the in the Kate Hudson movie about the Rolling Stones. What am I looking at? What was that movie? Almost famous. Great in that. And then he just in this movie I just don't like this character at all. I actually don't like any of the characters in this movie with the exception of maybe Danny McBride cuz no you just got to love Danny McBride. Oh, he's ter the character is terrible but I love Danny McBride mostly cuz I always think about like check this out homie see this. He's smooth",
            "start": 2412.88
        },
        {
            "text": "McBride cuz no you just got to love Danny McBride. Oh, he's ter the character is terrible but I love Danny McBride mostly cuz I always think about like check this out homie see this. He's smooth aerodynamics when I fight. The great life. I must have had a typo cuz I was like what the [ __ ] was I saying here? They take a [ __ ] and launch his body into space. shot in his face. You didn't listen to me. They honored the dead. There was something going here that just like the idea of this new guy having to take on being the captain because the beloved captain just died, James Franco. And his first course of action being like we can't like have a moment for a minute. What the hell? And like, oh, like I'm a man of faith. None of this added up, you know? Weird. I thought I missed something when I was watching. It's like very weird and like no one's going to respect you, man. And like the whole speech that we're about to get to very soon of like, hey, you're going to have to live with these",
            "start": 2450.96
        },
        {
            "text": "I was watching. It's like very weird and like no one's going to respect you, man. And like the whole speech that we're about to get to very soon of like, hey, you're going to have to live with these people. like you're captain right now, but like they're going to be your neighbors on this planet. It's like, yeah, dude. Well, he has a chip on his shoulder because he didn't get picked as captain because he's religious and the company was like, \"We don't want you to be captain because we we don't we think, we don't trust that you're going to make good decisions. Everyone else here, best decision.\" Every other husband and wife combo that's here for some reason. And then the first decision he makes is let's not honor our debt. Which you could you could rationalize that cuz you're like, \"Hey, there might be another we got to get these sales fixed. We have to write the [ __ ] first.\" in that. But all he would have had to say was like, \"Hey guys, let's just fix the ship first.\" Which should",
            "start": 2493.92
        },
        {
            "text": "there might be another we got to get these sales fixed. We have to write the [ __ ] first.\" in that. But all he would have had to say was like, \"Hey guys, let's just fix the ship first.\" Which should be the correct order of operation cuz if the ship explodes, we all die. So, let's do that first and then we will have funerals for our dead. We'll bury our dead up. Which all he had to say, but instead he was like, \"Just do what I say.\" And then he chomps off and he's like, \"They don't respect me.\" I'm like, \"Well, you're kind of a dick.\" And then he proceeds to make the world's worst decision, which is let's just go to this uncharted planet. Incredible. Like incredible. Oh, while they send Danny McBride out to fix the solar panel, he fixes it. Hip hip hooray. On the way back, he gets and he gets a little he picks up a rogue transmission and it says, \"Whoa, y'all see that? He's bounded down Denver.\" And then he comes in and they watch it and they listen to it and he starts singing John",
            "start": 2525.92
        },
        {
            "text": "gets a little he picks up a rogue transmission and it says, \"Whoa, y'all see that? He's bounded down Denver.\" And then he comes in and they watch it and they listen to it and he starts singing John Denver song. A song that like, you know, the little storage cards on us. I'm great at singing. I'm great at music. I can't tell you a song from 200 years ago, right? But this guy sure can. He sure can. Well, they stopped making music after like got it. 21 21. Was that in the first movie? No. Mm-m. Her singing John. Why would it be Nick Dick? Remember [ __ ] weird. She got the ship and flew away. It must have been in the honestly it probably was in the YouTube short. Again, we should we should do our due diligence and stop this episode right now. We're playing this entire thing at our protest. We have another mall rat situation on our hands. Ladies and gentlemen, we have another mall a second mall rat. Uh, anyways though, they yeah, they piece it together and holy [ __ ] why would there be a",
            "start": 2562.56
        },
        {
            "text": "have another mall rat situation on our hands. Ladies and gentlemen, we have another mall a second mall rat. Uh, anyways though, they yeah, they piece it together and holy [ __ ] why would there be a human transition all the way out here? They trace it. Mother traces it all the way back. They trace it all the way back to this new planet that looks perfect for inhabitable people in us and it's everything we possibly need. It's a Goldilocks, whatever. It's really hard to make like um space floating in an astronaut suit look cool cuz gravity did it. It looks as it looks like it should, but it ne but it never looks like we want it to. Like it, you know what I mean? Like cuz you have the single bright ass light source from the only star out there and that shit's lighting you, but it but because of that it looks bad, you know, and it looks fake. Go ahead, Nickpino. There's a moment where Danny McBride takes a I would say probably a 2 to three inch thick cable and just takes a little laser",
            "start": 2601.76
        },
        {
            "text": "of that it looks bad, you know, and it looks fake. Go ahead, Nickpino. There's a moment where Danny McBride takes a I would say probably a 2 to three inch thick cable and just takes a little laser gun and goes, \"That's cool.\" And I think buy one of those. That's really [ __ ] cool. A handheld laser gun that can cut through [ __ ] steel cabling, right? Like like a Swiss like a hot but a hot knife through butter, right? And then when we go to the planet, let's just use AR 615s, what just regular [ __ ] bullets. We don't have some sort of laser technology gun that we can take to these planets. It only works in zero G. Oh, fair. Cuz that's what how light light doesn't work with gravity. I also like the idea that he laser the laser just keeps going. Yeah. Yeah. It's just God. It's good to prison. Yeah. If you use it on a planet with gravity, the laser like falls down. Uh well, holy [ __ ] Like this thing looks great. Jenny Ortega's planet, it's still years away and it's not it doesn't even",
            "start": 2650.88
        },
        {
            "text": "Yeah. If you use it on a planet with gravity, the laser like falls down. Uh well, holy [ __ ] Like this thing looks great. Jenny Ortega's planet, it's still years away and it's not it doesn't even have these numbers. So, what should we do? Like, let's go there. Like, let's just go and look at it. Says the guy from ET who might not be from ET. He's like, let's just go look at it. I'm the captain. What sucks the most is that somebody looks at him is like none of us want to go back to sleep. It's like that shouldn't be the deciding factor. This you're the captain. You want you want Yeah. You go. Sorry guys. Hey, we we reconed this planet for years before we did all the scientific data we possibly could beforehand. Get back in the [ __ ] pod or stay up for seven years. Those are your choices. Instead, the clone of Ali Sheeting who's mourning the loss of James Franco has to say all that to him and he's still like, \"It doesn't matter. I don't I'm not gonna listen to you. I'm not gonna have",
            "start": 2692.0
        },
        {
            "text": "Instead, the clone of Ali Sheeting who's mourning the loss of James Franco has to say all that to him and he's still like, \"It doesn't matter. I don't I'm not gonna listen to you. I'm not gonna have a part of this or whatever.\" Yeah. And so he's like and she's all mad about it and she walks off and he's they they change course and they go to this planet. Was it him just trying to be like, I'm I'm look, I can be a leader. Was it just him trying to do that? Again, it's a Jesus. It's like it's God's intervention thing and it's them examining that, but it just doesn't work very well because we don't we never get to a precipice where any of our characters have to choose between science and faith. They don't learn anything. There's never a crossroad. There's never a moment where the character goes, \"Oh my god, I have to take a leap of faith.\" And then God is real or not real. I don't know. Oh, it just has never Billy Kub took a leap of faith and walked into that little [ __ ] fast. He sure",
            "start": 2735.36
        },
        {
            "text": "\"Oh my god, I have to take a leap of faith.\" And then God is real or not real. I don't know. Oh, it just has never Billy Kub took a leap of faith and walked into that little [ __ ] fast. He sure did. And then he admits, remember a leap of faith in Spiderverse? That was cool. Wow. So cool. Remember the movie Leap of Faith with uh None of us do. Wait, no, I do. Yeah. Not Martin Shei and uh Martin Short. What's his name? No, maybe Steve Martin. [Laughter] Oh. Oh, yeah. Where he's like the preacher. Yeah, yeah, yeah. the confidence like what do you So they bring the whole [ __ ] ship over to find this new planet that was just a few weeks away. How we communicate guys are blowing air on each other's faces. Holy [ __ ] Uh they bring the ship over there and they roll up on this planet and you can just look at it and know it's evil. Like you roll up on any planet it's just constant lightning storms. You can see all these storm. Like I don't do me wrong. I understand a storm passing that",
            "start": 2769.12
        },
        {
            "text": "can just look at it and know it's evil. Like you roll up on any planet it's just constant lightning storms. You can see all these storm. Like I don't do me wrong. I understand a storm passing that happens on our planet too. The thing is covered in storm. I'm going down there. Why are we going to go down there? What I stom is very, very scary. Sounding. Nick, can I ask you guys a question? Go ahead. This is kind of a layman's question, but but follow me. You ever like go to some place you've never been to before and you dial up your GPS, right, and you drive there? Do you just randomly park wherever or do you drive past the place first and go, I see it. And then you circle around a couple times to find the nearest parking spot that feels right. Which one do you do? I do more preparation driving anywhere than they do going to somewhere they've never been. And again, let's walk with our [ __ ] helmets off. What helmets? There's not even helmets. They don't even have helmets in this. Why?",
            "start": 2817.44
        },
        {
            "text": "anywhere than they do going to somewhere they've never been. And again, let's walk with our [ __ ] helmets off. What helmets? There's not even helmets. They don't even have helmets in this. Why? They have cool arguably cool uh ripoffs of Star Wars. Oh, the little ear the little flappy things that always make me think of like Snoopy's ears. Well, they look kind of cool. You'd have to make an argument, man. Like a belly. The anorax. Come on. They roll up. It looks evil. They Here's a group of people. It looks like the [ __ ] beautiful planet from Prometheus. Like it. No, I'm talking about from above the cloud. You got You guys I I I [ __ ] missed the meeting. It kind of funny where apparently it's a four person plot recap and we can jump way the [ __ ] ahead cuz my guys aren't even through the [ __ ] shield yet. They're still up here to sign the ground. You guys like You guys are like, \"Oh, the thing pops out of Billy Groo's chest. That's not where I'm at.\" But I guess I I everyone can",
            "start": 2859.24
        },
        {
            "text": "the [ __ ] shield yet. They're still up here to sign the ground. You guys like You guys are like, \"Oh, the thing pops out of Billy Groo's chest. That's not where I'm at.\" But I guess I I everyone can read from the sacred text now. You know what I mean? It's true. Greg's right though. From the from the space view, the the Come on, Andy. From the from the space view, the clouds looked like really angry. It was an angry face in the clouds. It was just one. Everything you said happens. They come down. It's a rough landing. They get through. They do the thing, but they can't talk back to the ship. They get down. Then, yeah, they get out and there's we're going to walk. No helmets, no nothing, no tests, no whatever. And then there's a very, I thought, convoluted conversation is they leave the one woman there where it makes it sound like going to quarantine already, like shut it down or whatever. They literally say, \"Hey man, shut the ship up.\" She's like, \"Cool.\" and then just doesn't do",
            "start": 2900.96
        },
        {
            "text": "one woman there where it makes it sound like going to quarantine already, like shut it down or whatever. They literally say, \"Hey man, shut the ship up.\" She's like, \"Cool.\" and then just doesn't do any of that. It doesn't do any of that. Just hangs out. It's like all of us whenever Tim leaves, we just [ __ ] off. I'll tell you what I didn't like. The little uh you know the the what were you calling the boof? The like the air boof or whatever. The air booof. The first one looked noticeably like large in size to where the human eye could see it and then it became the smallest most microscopic. I think that was just a camera trick though, right? like weren't wasn't the Cuz I feel like they did like a weird little like lensy thing of like it it made you think oh it's big but it's like no actually it's really tiny. I don't think it got smaller. I think it was like a perspective play as it got into his [ __ ] ear. Bring it up kind of they got they get there. They're marching. They're",
            "start": 2937.44
        },
        {
            "text": "actually it's really tiny. I don't think it got smaller. I think it was like a perspective play as it got into his [ __ ] ear. Bring it up kind of they got they get there. They're marching. They're they're going to break into two teams. The one woman from the Penguins going to go with the one guy who's just a white guy. And what am I crazy in thinking these guns just don't they all grab guns which I'm like thankfully so they have some sort of projectile weapon but these guns look like they're from now not 200 years into the future right like when we get to Aliens they have they they make a big deal of being like hey these are pulse rifles with like exploding tip like [ __ ] I forget I forget the term they used for it but it was some sort of like nuclear exploding tip thing which is why when they hit an alien it explodes their heads. Oh, paying with the wife's she's the start talking like she's a sex worker, you know. Okay, I'm going to marry I'm going to marry her one day, you know.",
            "start": 2976.16
        },
        {
            "text": "they hit an alien it explodes their heads. Oh, paying with the wife's she's the start talking like she's a sex worker, you know. Okay, I'm going to marry I'm going to marry her one day, you know. Hey, I said, ding. She's great. This movie is the voice the and she goes out just real real sad in this one. This the blood the blood. You're almost there. You're almost there. Almost there. You guys again. You're just, you know, it's like I'm [ __ ] watching Momento the way you're all telling the story out of order. And then the credits hit. Uh anyways, so much going on this one, you uh the penguin lady and the guy go over there and the guy steps on it when he says he's going to go take a leak but he really wants to go have a smoke break and then yeah this is what's happen if you're watching this too and the thing comes up and he gets up and he goes in his ear like venom venom venom uh the other the other group they're walking along and they're checking things out and they're seeing stuff",
            "start": 3014.16
        },
        {
            "text": "too and the thing comes up and he gets up and he goes in his ear like venom venom venom uh the other the other group they're walking along and they're checking things out and they're seeing stuff and they're making brought up Venom which means we have to talk about the Eminem song Venom that came up on my shuffle recently and you know the most upsetting thing the song not bad at all I I would almost go as far as to say it's slaps It's just the chorus is the most god- aful thing in history. But if you just listen the first minute of that song, Andy, do it on your way home. You're gonna be [ __ ] shocked. We all will. Um, another just pet peeve of mine for this though is they're like, \"Where's the signal?\" Well, it's 8 kilometers up the mountain. Well, I guess we have to walk. There's no possible way we could take the ship, just do a quick fly over, and see all the burned bodies that are sitting at the bottom of this [ __ ] temple, right? Like, it's a great call. What the? They They",
            "start": 3054.08
        },
        {
            "text": "possible way we could take the ship, just do a quick fly over, and see all the burned bodies that are sitting at the bottom of this [ __ ] temple, right? Like, it's a great call. What the? They They have one throwaway line. We're like, \"Well, I don't like this terrain, so I'm going to I'm going to land in the water down there.\" Okay, that sounds good. But there's a distress signal coming from 8 kilometers away. If I elevation, but the you have a ship that can go up to space and they're like, and it's not they don't even say that it's like in this the ship's like hurt or not hurt, but like wrecked at all. They're like, \"Oh, we can't have a little problem calling back up to the ship. Take the [ __ ] do a fly over. See the dead bodies. This is obviously the devil's work. We got all the time in the world. We got all the time in the world. Uh instead they don't. You just saw the infection there for that guy. Uh meanwhile, the other group's walking and Billy Crudeup actually tells uh the",
            "start": 3095.6
        },
        {
            "text": "in the world. We got all the time in the world. Uh instead they don't. You just saw the infection there for that guy. Uh meanwhile, the other group's walking and Billy Crudeup actually tells uh the the widow uh James Franco's widow who I refer to as Ali Sheet's clone and everybody stared at me, but I could I thought she looked too much like her. I couldn't I couldn't do it. Yeah. I just don't know who you're saying. Daniels Katherine Watson. The main woman. Yeah. It looks like whose clone? Alien from the Breakfast Club. You were Yeah, you were 20. Got it. You were sperm still. Uh, you ever think about that? Him as a sperm. I do all the time. Actually, I like to think about where I was at when Tim was conceived in Riverside. Probably the video, man. Imagine that. That's probably at the video. Try to look through those little barn doors in the in the back, the adult section. Anyways, uh Billy K tells the widow about this be a good place for a log cabin, right? like she's like, \"Oh, you",
            "start": 3134.72
        },
        {
            "text": "Try to look through those little barn doors in the in the back, the adult section. Anyways, uh Billy K tells the widow about this be a good place for a log cabin, right? like she's like, \"Oh, you see she looks like that. That's how she's cheating.\" Now, granted, I mean, Kevin's bringing up a modern day photo of her, not when she was in Breakfast Club. Not that it matters that much, but just for the record. Um, and so this log cabin thing becomes a thing. It'll be important later. Uh, they're walking. The one guy, uh, who is this guy? Uh, the guy who's in, uh, this dude Lope Lupe Lope. Yeah. Yeah. Yeah. Yeah. Cuz click on him. What was he else? What's he known for? cuz I want to say he was he was in Weeds. Was he in Weeds and was he the main woman in Weeds? Uh he was in the Hateful Eight, Godzilla versus Kong, a better life and scroll down and give me a weeds. Give me a control of weeds. No weeds, Greg. I don't see a weeds. If you don't go down, you don't go down. See, you got to Yeah,",
            "start": 3181.12
        },
        {
            "text": "versus Kong, a better life and scroll down and give me a weeds. Give me a control of weeds. No weeds, Greg. I don't see a weeds. If you don't go down, you don't go down. See, you got to Yeah, exactly. Exactly. You never used IMDb before, I'm sure. No, it's not there. Yeah, there's weeds. Thanks for 27 episodes. Thank you. Yeah. Yeah, he was very important in that. So I but I didn't want to mis miscast them. How come it didn't pull it up? Well, because you have to capitalize it has to be Oh, I had to capitalize it. No, it's Yeah, I did. Look. No, but it's it's if you leave the search up while you hit see all, you have to edit what you search for. Anyways, weeds. I nailed that. I crushed. I love, man. Weeds is a good one. You know what I mean? Uh, so they're walking. They're doing their thing. It really wasn't. It like jumped. Yeah. You know what? Jump the shark. Come on now. Every show does at some point with the exception of Smallville. Anyways, we're moving on. We're walking. We're",
            "start": 3225.68
        },
        {
            "text": "It really wasn't. It like jumped. Yeah. You know what? Jump the shark. Come on now. Every show does at some point with the exception of Smallville. Anyways, we're moving on. We're walking. We're doing the thing. He the the guy from Weeds. He's like, we're getting close. Like, look at this [ __ ] Like [ __ ] trees are all cut off at the top. Some [ __ ] happened here. Like, oh my god, that's crazy. Did you catch that he also is the husband of one of the other guys? Oh yeah. Like they're all married. I I didn't realize that until when the guy died and I was like, did is everyone paired up on this? Like this is the worst idea ever. We're going to go start a colony and we need a crew that's all married. But again, why not put the the [ __ ] put my Jen I can be a pilot. Jen can be whatever. She can go get frozen. We're both frozen. I'm going to age a couple years while I make sure we do whatever, I guess. But like come out a little more distinguish. I was still asleeping. I was asleep. She",
            "start": 3273.2
        },
        {
            "text": "can go get frozen. We're both frozen. I'm going to age a couple years while I make sure we do whatever, I guess. But like come out a little more distinguish. I was still asleeping. I was asleep. She was asleeping. Again, I think put the people. Why does it matter? Like I mean it's convenient and weird and doesn't make sense, but like what's the difference? If she would if my if my loved one was in the colony, I would be looking out for the good of the colony, not the stupid people on the planet versus if we're if we're there and we're separating that way. It would be easier for me not to give a [ __ ] about the people I send on the rescue mission down there if I'm captain or at least remain professional and be like, \"Hey, we have to do quarantine protocol and not let them back on this massive ship cuz they'll kill everyone be in love with each other.\" Which is hilarious because I had this exact same conversation with my wife. I was like, \"See, I don't think I if I was like, if I was",
            "start": 3310.56
        },
        {
            "text": "ship cuz they'll kill everyone be in love with each other.\" Which is hilarious because I had this exact same conversation with my wife. I was like, \"See, I don't think I if I was like, if I was Danny McBride, I would probably like I would be so torn. and I would have to go down there and save you. And I was like, \"Wouldn't you want to save me if the rolls are reversed?\" She's like, \"Fuck no. I'm leaving on that plan. Look at that [ __ ] thing. It's terrifying.\" Yeah. I told Jen, \"Lucky, you'll never thought about this cuz the first sign of any of this [ __ ] I'm blowing my face off.\" When when I'm looking through the window, like when the woman runs back with a shotgun before she slips in the blood and I'm looking through the window and this thing coming out of this guy's back, I'm like, \"Peace be with you.\" Like, I'm not I don't want any of this. I don't want any of this. No, thank you. I hate the way he falls over. And I'll tell you the other thing I hate about this scene that we're",
            "start": 3348.48
        },
        {
            "text": "be with you.\" Like, I'm not I don't want any of this. I don't want any of this. No, thank you. I hate the way he falls over. And I'll tell you the other thing I hate about this scene that we're not to that we're just all [ __ ] this interview. It doesn't need to have a [ __ ] thing anymore. When I again the woman from the penguin when she gets locked in the room and she's like, \"Let me out. Let me out of the room.\" And then like I can't. It's quarantine promo, but I got a shotgun on the other side. Right. And then the other dude starts wigging out when he's about to explode. And first off, cool animation on him wigging out, right? Like good job on that guy. She comes over and she hugs him. And I was like, \"What the [ __ ] was that choice? I I I here's the choice is it would have been perfect if she the next scene doesn't happen cuz what what I when she yells let me out of the thing and the woman's like I can't let you out it's quarantine I got a shotgun out here sorry or she doesn't",
            "start": 3376.8
        },
        {
            "text": "if she the next scene doesn't happen cuz what what I when she yells let me out of the thing and the woman's like I can't let you out it's quarantine I got a shotgun out here sorry or she doesn't have a shotgun but I can't let you out it's quarantine I I I'm watching I'm like oh man she just accepted her fate of whatever's about to happen with this guy she can't get she's part of it now and she goes and hug him and I it would have been I think the better choice of the alien explodes out of his back stabs her in the hand like it does and she's like oh my god And then it just kills her. Instead of her being like, I accept my fate. I hug you. Ow. Oh my god, it's an alien. Back to pounding on the door. Let me out. I was like, you can't have it both ways. I thought this whole thing was a [ __ ] mess. I agree with that point. And like the woman on the outside, like I I hated it. I hated every choice she made. Yeah. Damra's wife is like my least favorite part of this movie. What about What",
            "start": 3417.12
        },
        {
            "text": "mess. I agree with that point. And like the woman on the outside, like I I hated it. I hated every choice she made. Yeah. Damra's wife is like my least favorite part of this movie. What about What about when she slips in the blood? It's just insane. All of it's [ __ ] insane. And is it her body that's flaming rolling down the ramp? I was clapping at that part. And I get in trouble for my Thunderbolts reaction. Who's the space family? The the that TV show of allets. No, the other one. Lost in Space. Lost in Space. Yeah. You imagine like, man, there'd be a lot of like, oh, we can't. We have too many people in danger out there. They they would be the worst people to really pilot the crew. Too many people that they're close with. You know what I mean? The family. They're all big family. That's true. The whole thing is a family. You know how Mark used today's such a trapeze. And it's like I could not grab Andy on that reference. I was just like, I'll see you later. I'm with You know how",
            "start": 3454.24
        },
        {
            "text": "true. The whole thing is a family. You know how Mark used today's such a trapeze. And it's like I could not grab Andy on that reference. I was just like, I'll see you later. I'm with You know how Mark Wahberg said he would he could have stopped 911. Yeah, he definitely could have and he wishes that he was on that plane. Yeah, I wish he was on that plane too sometimes. I feel that way about the Penguin's wife. Yeah, in this room. If you would have put me in that room with a knife like she had and that little [ __ ] thing's like like he's so small before it does the even crawly thing cuz I still think I would like have been in control in that situation. But when it's just kind of moving on the ground, I would have just like [ __ ] you know, like like spiky chopping carrots and [ __ ] I don't give a damn, dude. I think we make a covenant right now. Four of us. If anything that size ever comes out of any of us in front of the other person, you [ __ ] stab it. Yeah. Okay. Don't hug me.",
            "start": 3490.0
        },
        {
            "text": "give a damn, dude. I think we make a covenant right now. Four of us. If anything that size ever comes out of any of us in front of the other person, you [ __ ] stab it. Yeah. Okay. Don't hug me. Don't touch me. Let me go or call Kevin for Christ's sake. He'll stab everything in that [ __ ] room. It's not even a stab situation for me. Like I'm grabbing the head of Yes. Snap it at the neck, at the [ __ ] torso. Like Yes. Yes. Yes. Yes. Yes. Yes. Yeah. Got by the legs swam the put me in that room, man. So again, all that this happens, but remember just just to jump back. It doesn't really [ __ ] matter. We jump all the way back to the ship they were on, right? And they f they get to play the little message of her singing John Denver or whatever. And they see it was her, Elizabeth Shaw from the first movie, Prometheus, whatever book. Elizabeth Shaw, who's like see a reference to John Denver, at least that I don't know of. I mean, she was Swedish. Yeah, I don't know. Maybe she liked",
            "start": 3531.36
        },
        {
            "text": "from the first movie, Prometheus, whatever book. Elizabeth Shaw, who's like see a reference to John Denver, at least that I don't know of. I mean, she was Swedish. Yeah, I don't know. Maybe she liked Fallout, though. Uh remember the other guy there also got infected. The guy who's the lover of the guy from Weeds. Uh they then get the call, you know, that the guy's flipping out. They drag the guy flipping back. Everything just happened in the room with the blood and the little guy and the explosion. But then on the other side, remember they're trying to get back the the lover guy, too, and he's [ __ ] flipping out or whatever. And they get out just into like the [ __ ] reads and then the thing pops out of him and then the explosion happens over there and then his mouth. Yeah. Like it's a violent like throat situation. It pops out of his mouth. Oh yeah, cuz she shoots the all she's trying to shoot the little little car. I thought we covered that cuz we talk about the Flaming Body coming",
            "start": 3565.76
        },
        {
            "text": "like throat situation. It pops out of his mouth. Oh yeah, cuz she shoots the all she's trying to shoot the little little car. I thought we covered that cuz we talk about the Flaming Body coming up, but you saw the movie, everybody. I was also kind of so lost in this part that when it blows up, I was like, damn, Danny McBride died. Like, I thought he was on that ship, dude. Oh, that was the Danny McBride and the other married couple or these [ __ ] couple are still up there trying to radio back down. They can't the whole time or whatever. Uh, they they put pin down Billy Crudic who might have been inside of ET. And then, you know what I'm saying there, everybody? Billy, if you're watching, I'm just keeping uh What was that? Tom Hardy [ __ ] dude. They get back up. They get back up and they're trying to figure out what the [ __ ] to do. We keep saying like how like, oh, this is just Prometheus again or whatever, but like the planes of action of like them being caught in the room and the",
            "start": 3605.6
        },
        {
            "text": "trying to figure out what the [ __ ] to do. We keep saying like how like, oh, this is just Prometheus again or whatever, but like the planes of action of like them being caught in the room and the thing bursting out and like opening the door and then the the other group trying to get back onto the ship. I'm like, we literally saw this last week. And I get that sure these these movie goers, it's been 5 years, but I'm like, this was the worst version of it. Not saying the last one was great for either of those scenes, but they were better than this. And then you get to the scene of them in the field or whatever. The one like one of the moments I was like, \"Okay, we're cooking here.\" David shows up and I'm like, \"We're not there yet, though.\" No. These things start hunting them like Velocrap. Exactly. They're in the weeds, right? And all hell's breaking loose and one goes to jump on the widow and uh David put No, Walter puts out his arm and then puts it in his fa and then chops on his",
            "start": 3649.04
        },
        {
            "text": "Exactly. They're in the weeds, right? And all hell's breaking loose and one goes to jump on the widow and uh David put No, Walter puts out his arm and then puts it in his fa and then chops on his arm and throws him off and then there's some shooting. There's some stuff going on. Yada yada. That dude gets his jaw knocked off. Holy [ __ ] Not necessarily. It's the type of violence I'm like, \"We don't need.\" No, it was awesome. It was sick. And then David shows up and he's like, \"Fucking Highlander. I'm Link in my little garb.\" Dumb as [ __ ] Awesome as [ __ ] Like I was like, he shocks him to death. I he shocks one of them. What does he do? No, he just shoots a flare up into the sky and and it makes a sound and then they run away, which makes no sense cuz you're like, why? He is their father. He is their teacher. He knows them. Anyways, he's like, follow me if you want to live. And so they all walk back to David's HQ, which is surrounded by just trillions of burnt corpse. Just so many",
            "start": 3682.4
        },
        {
            "text": "He is their teacher. He knows them. Anyways, he's like, follow me if you want to live. And so they all walk back to David's HQ, which is surrounded by just trillions of burnt corpse. Just so many so many nothing to see here, folks. Nothing to worry about at all. No questions that any of us would ask of like, \"Hey, what happened here?\" Yeah. No, David. This this this clearly psychotic android who's running around with culots on like a [ __ ] hobbit from Lord of the Rings, just his bare feet out. He's fine. He's a cool guy. We'll trust him. Barking. Somebody in chat was asking how did he get his body back. Elizabeth lowered it down from the ship. Yeah, big mistake. She lowered it down from the ship. Yeah, at the end of Prometheus, she's like lowering it down like she takes it with her on on the ship and then presumably with David's instructions rebuilt him. Interesting. Okay. Uh I didn't I didn't remember that. I just figured there was future tech they did something with, you know, some",
            "start": 3720.88
        },
        {
            "text": "the ship and then presumably with David's instructions rebuilt him. Interesting. Okay. Uh I didn't I didn't remember that. I just figured there was future tech they did something with, you know, some kind of 3D printer inside this [ __ ] weird horseshoe. The nerd was going to tell us about it. Well, Langley's like, \"Well, there's a comic.\" You know what I mean? You play the record backwards the whole story. It lines up with Wizard of Oz. Anyways, uh this is Yeah. Now we're inside the giant's temple or whatever. The engineers temple, right? And it's just like this is where he takes off his hood. It's is He's got long hair. It's a long hair fast bender, right? This is David. Is it a wig? Is it a wig? I don't know. We're wigging out with Scarpino. Yeah, for sure it was a wig. And it was hideous and it's really off-putting. And then when he starts cutting it, that's that's the second time I'd be like, \"Okay, uh, strike number one, all the burnt corpses outside.\" Like the hundreds and",
            "start": 3763.76
        },
        {
            "text": "hideous and it's really off-putting. And then when he starts cutting it, that's that's the second time I'd be like, \"Okay, uh, strike number one, all the burnt corpses outside.\" Like the hundreds and hundreds and hundreds of burnt corps outside. Strike number two, this dude now looks identical to the dude we brought with. Problem. I got And it's problematic. Why did you do that, David? Why did you do it, David? Now, someone could cut himself a little mushroom cut like that one lady in the last as he cut just straight across. Like I would have been an awesome sick ass bull cut from the 80s. I'm honoring one of my fallen friends. Yeah, this is weird. That was it. Chris ain't an says Shaw fixing David's a big part of the short and like I don't know if he's [ __ ] with us or not, but I love that. Again, we got to throw this all out. You know what I mean? Throw it all out. I'm going to watch the short later tonight. If it's four minutes and we wrap this up in a timely fashion, let's all",
            "start": 3808.0
        },
        {
            "text": "that. Again, we got to throw this all out. You know what I mean? Throw it all out. I'm going to watch the short later tonight. If it's four minutes and we wrap this up in a timely fashion, let's all watch it. Let's watch it together out there. Yeah. Eat some popcorn. Um we it won't the popcorn won't be done cooking by the time these shirts are over. Um, anyways, David then starts giving the exposition of what's going on here, right? Him and Elizabeth crashed here. Uh, when they crashed here, the weapon they had on board became unstable. It it ran wild on the thing. Oh, we missed earlier when they were walking through the woods and they were like, \"Listen, you hear that? No, nothing. No animals, no nothing.\" You know what I mean? Like, uh, the thing went wild. You know, buck wild, some would say. Mhm. This is science for for for a cav question. Kevin, get ready. I'm going to throw to you in five seconds. Science. Science. Science with Kev. I'm Kevin. Can a planet exist without",
            "start": 3852.24
        },
        {
            "text": "some would say. Mhm. This is science for for for a cav question. Kevin, get ready. I'm going to throw to you in five seconds. Science. Science. Science with Kev. I'm Kevin. Can a planet exist without wildlife? With just trees and plants? Can an ecosystem exist without any sort of biological like animal? Plants are biological, right? Well, yeah. They had a way they had some way of saying there was something she said where she was like, \"There's nothing here that's like fauna or flora.\" No, flora is plants. So fauna. Yeah. She was like, \"Yeah, there's no fauna on this planet. Can a planet exist that way?\" I I think so. Right. I mean, like for a long time it was just vegetation here. Fair. All right. Thanks, Kev. They don't like I I guess you're thinking maybe different types of Well, what I think of Andy flora, how like, you know, bees and you know, and we poop and the poop goes into the ground and the trees use the poop to make fruit and it's the circle of life. We breathe out, they",
            "start": 3890.0
        },
        {
            "text": "I think of Andy flora, how like, you know, bees and you know, and we poop and the poop goes into the ground and the trees use the poop to make fruit and it's the circle of life. We breathe out, they breathe in. Planet's just full of apples. It's just falling. No one's picked these apples. It's crazy. Now Kevin, my question is if I could drill straight through the earth, one side of the other, right, ignoring the lava and everything else, then I jump in the hole, would I be You'd make it all the way right to the tip of the hole. Like if someone was there with like a stick, you might be able to grab it. Okay. You'd be going really fast though. Sure. And then what? I would come all the way back and I'm a little bit short every time. Yeah. Yeah. Yeah. And then in this eventually you're floating in the middle. How long would it take me to fall through that hole? How how how much you weigh right now? What he was saying is like drill a little hole. If the moon was made of cheese, would you",
            "start": 3936.08
        },
        {
            "text": "in the middle. How long would it take me to fall through that hole? How how how much you weigh right now? What he was saying is like drill a little hole. If the moon was made of cheese, would you eat it? Oh man. Anyways, so according to the AI overview on the Google here, uh, no world can exist solely with flora. Oh, interesting. Okay, but ask ask it the Greg whole question. No. Uh he he says all the stuff that we already talked about. Uh and then they're like, \"Well, can we [ __ ] please is there a place for us to send up a radio signal?\" He's like, \"Oh, yeah. Go upstairs.\" Like you said, it's totally safe. It's totally this. Whatever. They they go up there. They beam up to the old uh Covenant. Danny McBride accepts the hail. We need evac. We need this. Okay. We're working on this, that, and the other. Uh and then it's the hey, like, you know, can I talk to my wife by the way? And can you get on a secure channel? And he's like, \"Ah, he knows this as fuck.\" So he just goes into a big",
            "start": 3980.24
        },
        {
            "text": "and the other. Uh and then it's the hey, like, you know, can I talk to my wife by the way? And can you get on a secure channel? And he's like, \"Ah, he knows this as fuck.\" So he just goes into a big room, you know what I mean? Where the other the other married couple watches him on a camera, which seems like an invasion private. They can't hear, but they watch. And of course, she's taking the [ __ ] right now, actually. Yeah, she can't go. Oh, and they brought the ship down. We talked about this way way way long ago. You know what I mean? Where there was this on again, off again argument about are they going to get closer on the ship to get the signal? And yes, they brought it into way too close, 80 whatever clicks, I guess. And it was like that was bad. That was stupid. That was bad. Anyways, uh she's dead and that kind of, you know, [ __ ] him up or whatever cuz his wife's dead now. And this is going to keep happening where everybody's dead. Um, then we started to have a lot of",
            "start": 4030.4
        },
        {
            "text": "Anyways, uh she's dead and that kind of, you know, [ __ ] him up or whatever cuz his wife's dead now. And this is going to keep happening where everybody's dead. Um, then we started to have a lot of conversations. A lot of people are talking here. Oh, David talks to Walter. He learns how to play the recorder. Oh my god, dude. This This whole Oh, [ __ ] [Music] Strike two. Strike three. You're out. Why is it on quiff bass? I didn't It has to be, dude. I just said it's a quiff base. Remember when Greg monkey pod the [ __ ] out of that thing last week? Wow. Did you think I was going to [ __ ] that up? I thought I did, but you got there and it was real cool. This [ __ ] scene though, like him teaching him how to play the flute just like you blow while I finger. Like, oh my god, guys. Get a room. It's a weirdass scene. And I think is this the one that ends with him making out with himself? No, that's later. That's later. They say good stuff. I like what they're talking about here. I think",
            "start": 4060.32
        },
        {
            "text": "It's a weirdass scene. And I think is this the one that ends with him making out with himself? No, that's later. That's later. They say good stuff. I like what they're talking about here. I think this is the most fast. This is the best scene of the movie for me because they start talking about like he's like you're I'm an I'm outdated unit of like a version of you because you were very you were offputting to people because you could create you had these ideas. You were too curious and that scared humans. And he was like he's like but don't you feel sad that you can't create? Like you're just this sad like clone of me and I get to be out there and be God. It's awesome. It's awesome. Yeah. It would have been great in an awesome movie. But did no one bother to just go one room over and see new repair [ __ ] spled open like Silence of the Lamb? He's got drawings. He's He's been doing some [ __ ] He's trying to open a He's the goddamn guy from Animal Crossing. He's that [ __ ] owl. You",
            "start": 4112.88
        },
        {
            "text": "new repair [ __ ] spled open like Silence of the Lamb? He's got drawings. He's He's been doing some [ __ ] He's trying to open a He's the goddamn guy from Animal Crossing. He's that [ __ ] owl. You know what I mean? He's got [ __ ] Yeah. Um eventually uh the one uh other woman who's there is like, \"Listen, I need to wash up, captain.\" And he's like, \"Yeah, go do that. I'm sure there's water somewhere.\" And she just walks over to like a bird bath. This is where I'm going to take a bath. Like what are we doing here? She's rubbing her arms. [ __ ] She rubbing her arms in this water. And then wouldn't you know it, what's up there? Xenomorph. Xenomorph comes down. Bites her in the neck, right? Bites her, right? Oh, I guess I skipped. We have a xenomorph already. So I skipped I guess Billy Crew getting it. No, this is the one. This is the one. Yeah. It's the baby. The baby that survived. Yeah. Sorry. Sorry. Sorry. Sorry. But it's not a baby anymore. It's big. This is one big His mouth",
            "start": 4153.04
        },
        {
            "text": "Crew getting it. No, this is the one. This is the one. Yeah. It's the baby. The baby that survived. Yeah. Sorry. Sorry. Sorry. Sorry. But it's not a baby anymore. It's big. This is one big His mouth appears out of nowhere. Um, yeah. Bites her head off. Her head floats in the bird bath now. Her body's on the floor. Um, uh, David comes in and starts talking to him like, \"Oh, it's okay, little guy. You're on my side, right? We're all friends.\" Yeah. Blows in his face. The the me and Nick thing stolen right from ours. This is when, uh, Billy Crudup, who may or may not have been an ET, walks up and is like, \"Move out of the way.\" He's like, \"Don't [ __ ] do anything. If you breathe on them, they do stuff. I can control them.\" He's like, \"Give them the horses. I love you.\" N the reaction from Fast Better here is unlike anything I've ever seen him react like like he's he emotes here in such a way I don't think he's ever done in his whole life. It was crazy. Real good. Killed it. Killed it.",
            "start": 4196.32
        },
        {
            "text": "Fast Better here is unlike anything I've ever seen him react like like he's he emotes here in such a way I don't think he's ever done in his whole life. It was crazy. Real good. Killed it. Killed it. Uh from here Fastpender's like, \"Well, now you got to [ __ ] die, Captain. Come with me. I got some [ __ ] to show you.\" And so he starts walking him around. Again, the same hall of horrors, but now it's a little bit different. And we see stuff we see. We're like, \"Oh man, that's a face hugger back there in the drawing and yada yada yada.\" And he's like, \"Come on downstairs. Come on downstairs to my dungeon. Yeah, he literally I Perfect Fast Bender moment here, right? Where he where Billy Kreb goes like, I've seen the devil, David, and I see it in you or whatever he says. He's like, \"It's time. The the jig is up. Like, it's time to come clean.\" And Michael Fast goes, \"Okay, come this way.\" All right. Yeah, cool. Let's hang out. I'm [ __ ] sling my gun here. I trust you completely. Like,",
            "start": 4237.28
        },
        {
            "text": "The the jig is up. Like, it's time to come clean.\" And Michael Fast goes, \"Okay, come this way.\" All right. Yeah, cool. Let's hang out. I'm [ __ ] sling my gun here. I trust you completely. Like, [ __ ] All right. I wasn't expecting you to You went easy. He goes down there. He's got a bunch of the alien eggs. He talks about how he's been, you know, crossbreeding all this stuff to make stuff, but he's missing one vital ingredient. And since everything's dead on the [ __ ] planet, it's all safe. It's perfectly safe. Go tap that egg. It opens up. You know the little How many times do we see the four tongues and then it's all milky [ __ ] move around there looking like a weird oyster. And then bam, jumps out, gets him in the face. Face hug him. Face hug him. Face hug him. Face hug him. Face hug him. Face him. Face face. Face hug him. What's up everybody? Welcome to face hug them or [ __ ] them where we decide if the face hugger is in a given alien or predator movie. We're great and we",
            "start": 4272.96
        },
        {
            "text": "hug him. Face him. Face face. Face hug him. What's up everybody? Welcome to face hug them or [ __ ] them where we decide if the face hugger is in a given alien or predator movie. We're great and we want to hug them or if they sucked and we say [ __ ] them. Uh so face hug them or face [ __ ] them alien covenant. There's a few more. There's this scene and then there's another one that I liked. I liked them here. I'm face hugging them. Yeah. Yeah. I'm I'm going down for these. I think it's it's too much of a good thing and I just feel like they didn't know what direction to take them in this one. And the moment we see the egg and the setup, it's like we know as an audience what's going to happen. And it I'm looking at this character and I'm like, you can't [ __ ] trust this guy that you just called the devil telling you that this thing's okay. It's so Yeah, but again, I hear you. I would I would face [ __ ] um Billy Cruda possibly from ET in this one. Sure. I'm saying face hug the face",
            "start": 4306.88
        },
        {
            "text": "called the devil telling you that this thing's okay. It's so Yeah, but again, I hear you. I would I would face [ __ ] um Billy Cruda possibly from ET in this one. Sure. I'm saying face hug the face hugger. But the what the face hugger does, we've seen it 10 other times. Literally 10 other times. counter argument though. Which end is it going to come out? That's a good question. This thing's bursting out. It's so exciting. It's bursting out of the mouth, out of the back, out of your chest, out of your tooth hole. Like, we don't know. This is classic though. This is classic Coke. You're talking about new Coke. You're talking about Coke Zero. Too many Cokes in this though. I'll tell you. Count all of them. But I'll tell you what. One of the face huggers. ear [ __ ] them hides beh like runs away from the shoot from the shooting hides like against the wall and then the person like it just felt like a like a Call of Duty like inter like when you're fighting somebody inside of a room you",
            "start": 4348.64
        },
        {
            "text": "away from the shoot from the shooting hides like against the wall and then the person like it just felt like a like a Call of Duty like inter like when you're fighting somebody inside of a room you know what I mean and the person just like and it just it jumps at him it was like wow that was a smart face hugger smart guy hug him I say face hug him face I say face hug him thank you welcome to hell I will say Andy that's a perfect illustration of one of my other big qualms with this movie is that what was the name of that character that got killed and then the xenomorph popped out of chest. You don't know. Nobody knows. There's 30 [ __ ] Why are there 30 [ __ ] characters? This is like the third act of the movie and we still have characters on screen that I couldn't point out of a lineup as to whether or not they were in this movie. Why do you not whittle your goddamn characters down to like three like we had at the beginning or the end middle of Alien? We have like five characters",
            "start": 4387.2
        },
        {
            "text": "as to whether or not they were in this movie. Why do you not whittle your goddamn characters down to like three like we had at the beginning or the end middle of Alien? We have like five characters [ __ ] here. Those are the guys we know. Hicks, Hudson, Vasquez, Bishop. We immediately have the face. We, you know, Gorman. Captain wakes up and he's like, \"Oh, hey, what's up?\" And he's like, \"No.\" He immediately pops out of his chest, right? No. No, this thing this thing's moving fast. New coke. I need Top Gun call signs. You know what I mean? I need them to be, you know, sunburn out there. I did like that moment though with Crutup when he looks up and he's like when he's like Walter. He's like, \"Fuck no, I'm David, bitch.\" Eventually though, this everybody's looking for everybody now. The other guys getting infected talking about blah blah blah. Uh then we get uh Walter and David talking, right? Where uh Walter calls out David saying, \"You didn't [ __ ] this wasn't an accident. the",
            "start": 4425.12
        },
        {
            "text": "other guys getting infected talking about blah blah blah. Uh then we get uh Walter and David talking, right? Where uh Walter calls out David saying, \"You didn't [ __ ] this wasn't an accident. the pathogen. You did this. He's like, \"Yeah, and we get the cool flashback of all the stupid [ __ ] gods.\" Like, \"Oh, no.\" [Music] I thought that [ __ ] was cool. Like, it was a cool revelation cuz I didn't I didn't expect it to happen. I We know David's an evil like weird [ __ ] that just wants to experiment with life. But I I didn't expect that shot of him in that, you know, in the ship kind of looking at all this hell that he's just letting out. It was like, whoa, this is really messed up. You're a mean guy, dude. Like, you're really [ __ ] up. Don't you forget it. Uh then he stabs uh David stabs Walter in the neck and he does a really cool like fold them up like fall down for a robot. I was like, \"That's nice.\" His face makes he makes the weirdest face. Yeah. But then he starts healing",
            "start": 4462.64
        },
        {
            "text": "stabs Walter in the neck and he does a really cool like fold them up like fall down for a robot. I was like, \"That's nice.\" His face makes he makes the weirdest face. Yeah. But then he starts healing like, \"Oh [ __ ] he can heal.\" There's been some improvements he'll say later. Yeah. He bends he bends together like a like the Naboo robots. Yes. Yeah. The battle. Uh then uh Yeah. Oh. Uh, that was after the kiss. We've whittleled it down to the widow, right? Or almost. And now Walter wants to make her the new uh Shaw and do all that, but then guess what? David, no, sorry. David wants to do that. Walter shows up. Uh, they battle. Uh, they run out. They've got the guy who we already mentioned the other guy with the face hugger, but he gets face hugged here or whatever. Right. Presumably that's where the second xenomorph comes from, right? Yes. Cuz we don't really see that one get born, but it ends up on the ship later. Yes. cuz there's two actual alien xenomorphs in this. One is the one",
            "start": 4510.96
        },
        {
            "text": "where the second xenomorph comes from, right? Yes. Cuz we don't really see that one get born, but it ends up on the ship later. Yes. cuz there's two actual alien xenomorphs in this. One is the one that gets crushed by the crane later and the other one that just happens to somehow have gotten on the ship. Tennessee swings down. Oh yeah, that was what they cut the face hugger thing and it burned weeds guy's face. Remember they put the patch on his face or whatever. That's cool. Poor dude. He almost made it. He survived the a face hugger. He survived acid on his cheek and then, you know, quickly bit the dust after that. Did I I was wondering what are the filmmakers trying put in the crow chambers. Remember they put the goo on his face one by one. I was like there's got to be a better way to just squirt it. No, he got [ __ ] killed at the end, didn't he? I don't think Oh, does he get killed at the end? I don't think so. I thought he got put into his tube, but I forget. I thought she was",
            "start": 4553.2
        },
        {
            "text": "just squirt it. No, he got [ __ ] killed at the end, didn't he? I don't think Oh, does he get killed at the end? I don't think so. I thought he got put into his tube, but I forget. I thought she was like spreading the [ __ ] on his face. Yeah. Does he die at the end? I'm pretty sure he died after he had the goop, the helping goop that she was putting on his face. No, maybe I'm Maybe I'm doesn't really matter. Maybe I do. I saw the director's alpha cut. Well, I think this was just like a little homage to like Hicks getting the like having his face burned. Same side. I I I was wondering what the what the Oh, the second xenomorph came from him. Oh, yeah. In the incubator. Oh, yeah. It bur It burst out of his [ __ ] ass. Did it? I'm pretty sure. Yeah. Oh, maybe I missed that part. He died. God rest your soul, weeds guy. Roger. God bless his soul. But there's that moment where David's like, you know, or Walter, we don't know. Chrisa writes in and says the the alien came out of the weeds",
            "start": 4594.0
        },
        {
            "text": "God rest your soul, weeds guy. Roger. God bless his soul. But there's that moment where David's like, you know, or Walter, we don't know. Chrisa writes in and says the the alien came out of the weeds guy when they leave him in the medbay after getting the goo on his face. Yeah, there you go. I missed that. I must have gone to the bathroom at that point. And remember this is also I'm jumping then. So we had uh Tennessee come in uh Danny McBride get them. They get out. Xenomorph's on the ship. We have the one gift, you know, if you use the gifts. And then they had they had a big claw swinging up there and then the widow had to run around. She was tethered and she was doing [ __ ] This is such a bad video game level. swinging around her [ __ ] when she gets knocked off and she's on the rope like swinging. Like what are we doing here? Dude, they Well, the whole setup for this is kind of dumb, right? Cuz he's like, \"We don't have a lander anymore.\" Cuz we had one lander on this massive",
            "start": 4634.08
        },
        {
            "text": "like swinging. Like what are we doing here? Dude, they Well, the whole setup for this is kind of dumb, right? Cuz he's like, \"We don't have a lander anymore.\" Cuz we had one lander on this massive ship. What are we going to do? We're going to take this like terraforming ship that's kind of just doesn't can't you can't really like pilot it and we're going to take it down there. And then the entire time he's like, \"Oh, this is really hard to pilot.\" And then it cuts out and you're like, \"Is there a storm happening right now?\" No, man. It's like hard to pilot this thing. Swing it around like that. That's what the [ __ ] crazy. Just steady the ship so I can get a shot at this guy. Pick up a cargo driver in the Twitch chat asked the most important question that I wanted to ask a little while ago, but I didn't. But now I have to cuz I see the question. It's like I have to ask now. Seager asked, \"Wait, does Nick not pause the movie when he's home and has to pee pee?\" No, cuz my wife watches",
            "start": 4675.36
        },
        {
            "text": "but I didn't. But now I have to cuz I see the question. It's like I have to ask now. Seager asked, \"Wait, does Nick not pause the movie when he's home and has to pee pee?\" No, cuz my wife watches it with me and I have a bathroom that I can kind of see the the I was like, \"So I just leave it open.\" kind of like you kind of see it cuz I just imagine you being like let me know what happened. Well, honestly, by the time I normally I would pause it, especially for an interview movie, but this by the time we get up to the ship, I legitimately forgot that there was a xenomorph that was still left and I was like, \"Oh, we're almost done. We're going to get to the scene where she he talks to me, David, and then it's but no, there's a whole other like 10 more minutes left of this [ __ ] bored where guess what? They're all just chilling on the ship and alien life form detected or whatever like, \"Oh, fuck.\" And they can just track the [ __ ] thing. Don't worry about the alarm though because Jesse",
            "start": 4711.04
        },
        {
            "text": "guess what? They're all just chilling on the ship and alien life form detected or whatever like, \"Oh, fuck.\" And they can just track the [ __ ] thing. Don't worry about the alarm though because Jesse Small and his wife are still going to bang in the [ __ ] that you can't hear in [ __ ] the alarm in the [ __ ] shower. Not when you're that horny. This reminds me of like some of the [ __ ] I hate most about all the movies. Just one after the other where it's like, \"All right, cool. The alien's back again.\" We've seen that so many freaking times. We have to run from room to room as the gates close behind us. We've seen that now. This is the third time in these movies we've seen it. It's just so mind shower sex though, so give him some [ __ ] drink. You're right. I guess that tail was trying to tickle that cooter a little bit. Yeah, he was trying to be a th little [ __ ] in the corner. I like that. They're like participate. That's why he's in the corner cuz he throated Smlet like he he did",
            "start": 4750.92
        },
        {
            "text": "tickle that cooter a little bit. Yeah, he was trying to be a th little [ __ ] in the corner. I like that. They're like participate. That's why he's in the corner cuz he throated Smlet like he he did the We I guess he had his tail coming up. He was trying to get in a hole. Well, he tried to touch and No, get back in your chair. Get back in the cut. Get I like that they're like, \"Okay, we got him trapped in this little corridor. What do we do?\" All right. Uh let's not think about this for a second. Here's what we should do. We should let him into this big cargo bay. You know what I mean? This massive cargo bay. It's real big. And then what I'll do is I'll trap him I'll trap him in in the cockpit of this big truck and he'll surely won't be able to get out of the glass. We haven't seen him headbutt glass at all. Hasn't gone through any glass in this movie at all. Yeah. We won't try to shoot it when it comes out. We'll just let it escape. We'll be fine. A great plan. One thing I liked when",
            "start": 4786.0
        },
        {
            "text": "glass at all. Hasn't gone through any glass in this movie at all. Yeah. We won't try to shoot it when it comes out. We'll just let it escape. We'll be fine. A great plan. One thing I liked when they are kind of doing that crazy outdoor sequence. You know, you ever see videos of like a little a little puppy or a cat and like somebody has a big uh puppet that they're like and they think it's an animal, whatever. That's there's that moment where the xenomorph sees the big claw and it's like ah like it thinks it's like an animal or something. I thought she's like give me control of the claw. The claw goes like this. The aliens all mad at him. Suddenly it's like I've never seen this thing before. So I can't move left or right. I just have to stay in my tracks. Petrified. He's never seen a hand bigger than him. They ejected out of the the bay like you were talking about. We got the thing. Uh where did she jump? She just jumps down a little. Yeah. You know, it's just like the edge, right? I",
            "start": 4829.6
        },
        {
            "text": "bigger than him. They ejected out of the the bay like you were talking about. We got the thing. Uh where did she jump? She just jumps down a little. Yeah. You know, it's just like the edge, right? I guess. Yeah. I thought she was going to be hanging off in though. It's pretty cool. It's a good move. Yeah. Should I help a lady up? Uh now it's time to go to bed. Uh uh uh David. Well, Walter thinking he's David helps everybody to sleep. Uh, and then yeah, at the last second when she the widow's going to sleep, she's like, \"And will you help me? Walter, will you help me make the log cabin when I get there?\" And Dave is just like for just not I mean, I guess he wanted to reveal himself here, but he's just like, I'm not going to say anything. And I'm also going to look a little perplexed like David. He's like, \"You bastard.\" Let me ask you guys this other question. Okay. You've just encountered David who looks Okay, let's put it this way. Were you raising your hand there by the way? Yeah, I",
            "start": 4870.32
        },
        {
            "text": "He's like, \"You bastard.\" Let me ask you guys this other question. Okay. You've just encountered David who looks Okay, let's put it this way. Were you raising your hand there by the way? Yeah, I was just trying to be polite. Can I ask a question? Why is your hand like that? Let's bring it into real world scenario. Real world scenario, everybody. We've been friends with Tim for a real long time. Okay. But then suddenly we go to the Sarah Monte Mall and we see Evil Tim. Yeah. And evil Tim has been torturing Andy and like spllaying him open and probably doing all sorts of weird sex stuff to him. Right. Evil Tim's gone off the [ __ ] rails and we go through this whole crazy adventure with Evil Tim where we're like, we're pretty sure we think Good Tim killed evil Tim. Do you let Tim Good Tim tuck you in at night or do you wait until good Tim turns his back to you and you [ __ ] canoe the back of his head? Yeah, there's no [ __ ] way I'm letting an android put me to sleep after this whole",
            "start": 4910.08
        },
        {
            "text": "tuck you in at night or do you wait until good Tim turns his back to you and you [ __ ] canoe the back of his head? Yeah, there's no [ __ ] way I'm letting an android put me to sleep after this whole thing. No way. I just also feel like I understand I'm into tech to a degree. Not like Tim's into tech, but I'm into tech, right? So, like I feel like at some point on our journey or in our training, whatever it may be, if I knew we if code words, Kevin's an android and he's been working with me for as long as he's they've been working together. I feel like it would have come up in Kevin's user manual that he can't be harmed and he can self-heal. So that when the evil Kevin shows up and he's got stitches in his face that I helped put in, I'd be like, \"Could you could you, By the way, I remember your model could self-heal. Why am I helping you heal right now?\" Yeah. Yeah. That is a good point. And don't get me wrong, I don't know everything about every [ __ ] camera we use, but if we had a",
            "start": 4950.88
        },
        {
            "text": "your model could self-heal. Why am I helping you heal right now?\" Yeah. Yeah. That is a good point. And don't get me wrong, I don't know everything about every [ __ ] camera we use, but if we had a camera that could selfheal, I'd be like, \"Fuck, I Nick would tell me about that over lunch.\" We would have done some research, but we've already established that this is the dumbest [ __ ] crew on the planet who does zero research anytime they do anything. So true. I mean, when James Franco's your captain, right? Hey, man. I'm just out there. Let's go to space. I'm a vibes captain. I'm just tango planted out there. It'll be great. Great, man. You know what I mean? So, she goes to sleep and then David goes in there and barfs up a bunch of embryos. Watching this two face embryos. Actually, this was it was very well done and very cool and stuff, but like god damn, it's just like it made me even right now I'm feeling a little gagged. Yeah. It was like when you see an anaconda spit up an animal",
            "start": 5002.4
        },
        {
            "text": "it was very well done and very cool and stuff, but like god damn, it's just like it made me even right now I'm feeling a little gagged. Yeah. It was like when you see an anaconda spit up an animal because it can't fully digest it and it gives up. Mhm. And he puts them right next to the other little embryos cuz he's going to save those for later. He does the first way. You're like, \"Oh god.\" Then he goes, \"How many does he got? How many saw?\" And then he says, \"Yeah, play the song or whatever.\" Yeah. He He says, \"Play Wild Entry of the Gods in Bajalla.\" But I love, by the way, that Michael Fastpender speaks fluent German. I don't know if you guys ever that just a real trait that he has. So when he speaks German in as Magneto and he speaks it here, he speak like he has that real actual authentic accent which is so [ __ ] better than American accent. Dormal move and that is the one the only alien covenant. [Music] AV AV AV alien versus predator preferred partner. Alien Predator preferred",
            "start": 5041.36
        },
        {
            "text": "accent which is so [ __ ] better than American accent. Dormal move and that is the one the only alien covenant. [Music] AV AV AV alien versus predator preferred partner. Alien Predator preferred partner AV AV. What's up everybody? Welcome to our latest and greatest podcast within a podcast, Alien versus Predator Preferred Partner, where we give out the award for our preferred partner in each of the Alien versus Predator movies. So far, the list looks like this. Alien had Jonesy. Aliens had N. Predator had Mac. Predator 2 had Dannyboy. Alien 3 had Charles S. Dutton. Alien Resurrection had Wenot Ryder. AP had Alexa. AP Reququum had 90% Jesse, 10% Mutzy Mutzy. Predators had the Yakuza, and Prometheus had David, who was our preferred partner for Alien Covenant. Predators was [ __ ] It's got to be Walter, right? Walter's a cool guy. I would just put Fast Bender. Either one. David, Walter, you're both making good points. You know what? You bring either to a party is going to be something.",
            "start": 5083.76
        },
        {
            "text": "to be Walter, right? Walter's a cool guy. I would just put Fast Bender. Either one. David, Walter, you're both making good points. You know what? You bring either to a party is going to be something. The blood splatter. Yeah. Oh, the blood splatter. It really like without that blood splatter. I mean, does that but is that part of the ragu back? Is that a bad [ __ ] You're right. You're right. I mean, think of if that if it wasn't for that blood splatter, you have to think about it this way, right? How big was that the tiny little hole in the door? That window in the door, right? So, if they had if she had just not gone back in that room, that xenomorph would have been stuck in there forever, probably. I think I think about that sometimes. It haunts me. Yeah, I can understand that. Congratulations to Fast Bender for adding uh becoming our AV Ragu. What's up everybody? Welcome to Red Guys Talk bad guys, the podcast within a podcast that started it all where we rank all of the bad guys",
            "start": 5145.44
        },
        {
            "text": "to Fast Bender for adding uh becoming our AV Ragu. What's up everybody? Welcome to Red Guys Talk bad guys, the podcast within a podcast that started it all where we rank all of the bad guys in the Alien versus Predator cinematic universe. Uh so far the rank list looks like this. At number one, we had the Bad Predators and Perry White from BBS and Predators. Uh, number two, Aliens, Burke, and the Queen from Aliens. Uh, the Predator from Predator at number three. Number four was the Xenomorph, Face Hugger, Ash Combination from Alien. Number five was the Aliens, Face Hugger, and Big the Big Bad Queen from Alien versus Predator. Number six was David and the Big White Guys from Atheus. Number seven was Predator, King Willie and Gary Buucy from Predator 2. Number eight was the baby, the queen, and the military from Alien Resurrection. Number nine was 20th Century Fox and the Alien from Alien 3. And number 10 was the PR alien and his minions in Alien versus Predator Record. That movie, where",
            "start": 5185.36
        },
        {
            "text": "the military from Alien Resurrection. Number nine was 20th Century Fox and the Alien from Alien 3. And number 10 was the PR alien and his minions in Alien versus Predator Record. That movie, where do we want to rank David and the blood the blood spot? I go under Predator, too. I'll put it there. Sure. They didn't bring me joy in this. I like David a lot more in Prometheus. I just wish there was I wish the movie was more of the David Walter. I wish it was them in the complex trying to figure out whether or not David was a good person and just exploring that and trying to get and yeah I don't know it just they just don't do too much with it. So you want it below predator king Willie and Gary Buucy. King Willie is cool man. King Willie was the coolest. Voodoo magic. [ __ ] voodoo magic. That sounds about right. Remember? I do remember. I remember Nicki. I remember. You remember that. Do you have any other podcasts or is it just time to rank? Just time to rank. Oh it's not catch a",
            "start": 5237.92
        },
        {
            "text": "That sounds about right. Remember? I do remember. I remember Nicki. I remember. You remember that. Do you have any other podcasts or is it just time to rank? Just time to rank. Oh it's not catch a predator. No, there's no no Predator. No Predator bottoms. You are correct. Let's start with Andy Cortez who put Alien Covenant at number seven underneath AP but above Predator 2. Yeah, that's where it goes. Explain your work. Um, I mean Predator 2, you know, while silly to watch, there's still I guess I just look at the potential of what this movie could have been. It bums me out a lot. Um, but it still exists and maybe they'll one day want to remake it again. Yeah. Uh, Nicholas had it at number eight underneath AP1 but above Alien Resurrection. Yes. Uh, and my my choice behind that was that uh I kind of always looked at the one that I score right below and I think to myself, would I rather watch Alien versus Predator again or this movie? And hands [ __ ] down, I'd rather watch AP. It's",
            "start": 5280.0
        },
        {
            "text": "uh I kind of always looked at the one that I score right below and I think to myself, would I rather watch Alien versus Predator again or this movie? And hands [ __ ] down, I'd rather watch AP. It's just at the end of the day, it's dumb and it's not good, but it's fun and it's entertaining. And this movie, up until this point, and even Resurrection, up until this point, I've never been bored by an Alien movie. But we get to the end of this and I I literally went to go to the restroom because I thought it was over and I was like, \"Oh [ __ ] we have 10 more minutes in the cargo bay with this thing. I really want this to end.\" And that's just kind of unforgivable. Unforgable. Greg has it highest at number five under Aliens, but above AVP Requum. Yeah. Again, I I enjoyed Reququum and even AP for what they were trying to do or whatever. And we get into all these weird movies, but I feel like I just some of the thought the positive thoughts you had about Prometheus in some regards I had",
            "start": 5339.28
        },
        {
            "text": "AP for what they were trying to do or whatever. And we get into all these weird movies, but I feel like I just some of the thought the positive thoughts you had about Prometheus in some regards I had here. I was like, \"Oh, this is interesting to a degree.\" Like, I like the android verse and Android. I like us being on this world. I wish we would have done more with that of being on this alien world and these are the people who created it and flipped out and like you know what I feel like if you were you're one of those guys and you took Prometheus and this and you're like I'm going to edit these your toe for grace I'm going to edit these in one movie I think that would help a lot in terms of making this like oh the things you like from Prometheus the things [ __ ] workers the planets look identical right finding a better edit yeah yeah yeah that could that would be but yeah I I didn't I wasn't offended by this I also wasn't bored by it I thought fast benders performance carried it",
            "start": 5378.56
        },
        {
            "text": "identical right finding a better edit yeah yeah yeah that could that would be but yeah I I didn't I wasn't offended by this I also wasn't bored by it I thought fast benders performance carried it plenty of goofy stupid the cruise is a bunch of [ __ ] morons, yada yada yada. They're all married. The creepiness of the alien definitely put it up there to me, too. The two little flesh babies. Just like Nick, I had this at number eight, uh, underneath Predator 2, uh, but above Alien Resurrection. And it's a hard one for me. I was saying this earlier, but like I do think that this is so boring, and that is like the biggest sin a movie can commit for for my entertainment. Um, but Alien Resurrection, um, Predator, Alien versus Predator Recreum, and Alien 3, like I think that they're a level of bad that I can't put those above Covenant. Like, there is a movie here. I just don't enjoy the movie. So, based on my rankings, we are at that the tears that Greg were talking about. It's just like I we",
            "start": 5415.28
        },
        {
            "text": "that I can't put those above Covenant. Like, there is a movie here. I just don't enjoy the movie. So, based on my rankings, we are at that the tears that Greg were talking about. It's just like I we it really just doesn't matter. I don't recommend anybody watch any of the movies I just named there like at all. And like real talk, I would like Nick said he'd rather watch AP over this. Me too. any day of the week twice. I'd rather watch it twice than watch this again. And like I could say that about every single MCU movie. I would rather watch twice than have to see this. Yep. Um maybe even three times for for most of them. But yeah, didn't enjoy this film. Definitely dreading the rest of this franchise. I pray that it gets better. Um hey, I'm really looking forward. No future spoilers. Um yeah, I haven't seen any of the the rest of them, so we'll see. I'm in more for reassuring you or telling you the world. Uh, now our overall rankings are as follows. Number one, aliens. Number two,",
            "start": 5458.0
        },
        {
            "text": "yeah, I haven't seen any of the the rest of them, so we'll see. I'm in more for reassuring you or telling you the world. Uh, now our overall rankings are as follows. Number one, aliens. Number two, Predator. Kev, if you can bring it up, that'd be cool. Yeah, sorry, it's not working. Give me one sec. There it goes. Number three, Predators. Number four, Alien. Number five, Prometheus. Six, AP, Alien versus Predator. Seven, Alien Covenant. Eight, Predator 2. Nine, Alien Resurrection. 10, AP, Alien versus Predator Recreum. And 11, Alien 3. This is a list I can stand by. I look too mad at it. I can look at this list and take this one home to mom and dad, you know. Oh. Huh. Yeah. Yeah. Good sometimes. Mom and dad would say, \"Welcome to our family.\" Good decision. We accept you into our family. Yeah. Yeah. It's a good list. Good list. But your mom would always always be like, \"Would you always be my son?\" And I'll be the number one woman in your life. you like, \"Mom, that's going to cause a",
            "start": 5504.88
        },
        {
            "text": "Yeah. Yeah. It's a good list. Good list. But your mom would always always be like, \"Would you always be my son?\" And I'll be the number one woman in your life. you like, \"Mom, that's going to cause a rift way later on.\" Years later, we have the Predator next week, everybody. Uh, very interesting to see what direction that goes. Is it a reboot? Is it a sequel? I don't [ __ ] know. We'll see. I don't know. Uh, let us know in the comments what you think about uh, Alien Covenant. Uh, and what do you think about Michael Fast Bender kissing himself? You know, blowing, bangering. He does it all in this one. Till next time. Bye.",
            "start": 5555.6
        }
    ]
}