{
    "id": 14052,
    "video_id": "P87OMzsnRWU",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Blessing Adeoye Jr.",
        "Mike Howard",
        "Roger Pokorny"
    ],
    "title": "Grand Theft Auto 6 Trailer 2 Live Reactions - Kinda Funny Games Daily 05.06.25",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page - https://store.steampowered.com/app/1377700/Empyreal/ \nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nThis episode is sponsored by BetterHelp — go to http://betterhelp.com/kindafunny to get 10% off your first month.\n\nWe’re here to talk about video game news!\n\nRemember, Greg is ROCKING PAX East Thursday, and you need to be part of it:\nAt 11 am ET / 8 am PT, Greg’s the Keynote Speaker kicking off PAX East and will be doing a fireside chat with Final Fantasy and Expedition 33’s Ben Starr!\nAt 2 pm ET / 11 am PT, Greg’s hosting the Mafia: The Old Country panel with the devs.\nIf you’re in Boston, you need to be there, but if you aren’t, BOTH will be streamed to our Twitch channel!\nYou are about to witness history. SnowBikeMike, the most athletic man west of the Mississippi is embarking on his most daring quest yet, going step-for-step with Sam Porter Bridges in A LITERAL, marathon stream on a treadmill.\nCome join Roger and Mike this Friday as they attempt to do a FULL PLAYTHROUGH of Death Stranding 1 through the weekend, but they can only do it with your support! Will Mike and Roger break this treadmill and have to drive to Andy's home at 1am to borrow his?\nFind out, Friday: Twitch.tv/KindaFunnyGames\nToday after, KFGD, you’ll get:\nGAMESCAST - ONE MONTH UNTIL SGF 2025\nAfter Gamescast is Kinda Funny Podcast\nThen the STREAM is the Nuzlocke: The Hunt For Lugia Begins\nIf you’re a Kinda Funny Member:\nToday’s Gregway is coming from Roger.\nThank you to our Patreon Producers: Karl Jacobs, OmegaBuster, & Delaney Twining\n\n00:00:00 - Start\n00:02:30 - Housekeeping\nThe Roper Report   -\n00:12:08 - Grand Theft Auto 6 Trailer 2 is out now\n00:27:40 - Ad  \n00:31:15 - Character Breakdowns\n01:02:10 - SuperChats\n01:04:52 - Wee News!\n01:10:25 - You‘re Wrong\n\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1746555819,
    "duration": 4381,
    "transcript_chunks": [
        {
            "text": "[Music] Today's stories include GTA 6's second trailer is out right now. We have all this and more because this is kind of funny games [Music] daily. Yo, what's up? Welcome to Kind of Funny Games Daily for Tuesday, May 6, 2025. I'm one of your hosts, blessing Addio Jr. And joining me is the master of hype, Snowback Mike Glass, my dude. Thanks for inviting me on today to uh celebrate all things Grand Theft Auto and you and Roger on Kind of funny games daily. Oh wow. You're celebrating us today. I like to celebrate both of you. And you know, Blessing Blessing was gone for a whole week, Roger. And I didn't see you put up a Reddit post about how much you missed him. Were you the one that did that? I did that. Did not read the the Oh, no, I didn't. I just saw the mic about it. That's really good. I like that. Also joining us is Raj Bourney. What a beautiful uh thing to wake up to. Oh yeah. You know what I mean? Like you wake up like, \"Oh, what's today? What are we going to talk about?\"",
            "start": 0.0
        },
        {
            "text": "good. I like that. Also joining us is Raj Bourney. What a beautiful uh thing to wake up to. Oh yeah. You know what I mean? Like you wake up like, \"Oh, what's today? What are we going to talk about?\" We're talking about some layoffs. We're talking about some awful thing. Some thing that we don't really give a [ __ ] about. You know what I mean? Like secretly on the DL. It's like, \"Oh, wow. It's [ __ ] GTA 6. Holy [ __ ] Holy shit.\" So, to preface this, of course. Yes. You don't talk about the backbone, by the way. I You took a shot there. You took a shot there. I'll be honest. Went off the hip right there. I just remembered that I forgot to put it in Wei news. So, when we get to Wii News, remind me about the back because I still don't know what the news is, but we'll get there in a second. Of course, if you're listening, no, you did not misclick. No, you're not mistaken. This is kind of funny games daily. We have three people on the panel because this is also a live reaction to the GTA",
            "start": 52.84
        },
        {
            "text": "Of course, if you're listening, no, you did not misclick. No, you're not mistaken. This is kind of funny games daily. We have three people on the panel because this is also a live reaction to the GTA 6 trailer number two. It was going to be just me and Roger. And then I looked around the office and I was like, \"All right, who wants on? Who wants to hang out? Talk about GTA 6.\" Turns out the only other person in the office in the office is Snowike Mike because Greg's out of town. But I think we are the GTA 3. You know what I mean? Like I think that's GTA. I think we're the GTA 3 when you really think about it, right? When we all do our top 100s, we'll find out who really is. How many GTA How many GTA games are on our top 100? It's really hard for the GTA out there. Maybe how many GTA games are on my top five cuz it's more than one. Find out. Find out soon. You'll find out soon, of course, because this is kind of funny games daily. Each and every weekday, we run you through the nerdy",
            "start": 90.64
        },
        {
            "text": "are on my top five cuz it's more than one. Find out. Find out soon. You'll find out soon, of course, because this is kind of funny games daily. Each and every weekday, we run you through the nerdy news you need to know about live on YouTube, Twitch, and on podcast services around the globe. If you love what we do, support us to the kind of funny membership on Patreon, YouTube, and now on Spotify, and Apple podcast to get all of our shows ad free. Watch us record them live and get a daily exclusive show. For a chance to be a part of the show, send your thoughts and opinions as YouTube super chats as we go. Housekeeping for you. Remember, Greg is rocking PAX East Thursday, and you need to be a part of it. At 11:00 a.m. Eastern, uh, that's 8 am Pacific. Greg's the keynote speaker, kicking off PAX East, and we'll be doing a fireside chat with Final Fantasy and Expedition 33's Ben Star. Roger likes it. Roger likes it. Roger. I I edited the intro video for that. So, if you're there, uh, and",
            "start": 132.0
        },
        {
            "text": "PAX East, and we'll be doing a fireside chat with Final Fantasy and Expedition 33's Ben Star. Roger likes it. Roger likes it. Roger. I I edited the intro video for that. So, if you're there, uh, and I guess we're going to be streaming it live, right? We're going to be talking. Yeah. So, yeah, watch it live and, uh, experience that intro video because it's it's something. Yeah, you'll like it. Then at 2 p.m. Eastern time, that's 11:00 a.m. Pacific, Greg's hosting the Mafia, the Old Country panel with the devs. Thank you, Roger. I didn't edit any videos for that, but I still like it. If you're in Boston, you need to be there, but if you aren't, both will be streamed to our Twitch channel. Uh, of course, we got something special for you. Mike's walking away because you are about to witness history. Snow White Mike, the most athletic man west of the Mississippi, is embarking on his most daring quest yet. Going step for step with Sam Porter Bridges in a literal marathon stream on a",
            "start": 174.16
        },
        {
            "text": "history. Snow White Mike, the most athletic man west of the Mississippi, is embarking on his most daring quest yet. Going step for step with Sam Porter Bridges in a literal marathon stream on a treadmill. This has an actual treadmill. We're going to we're going to walk. Bless. We're going to make this happen is right. Wow. A lot of doubters out there, a lot of naysayers. A lot of people saying, \"Mike, you're probably going to die on camera live on Twitch. Mike, there's no way that you will do this.\" Mike will ask you walk now. I say no. This Friday I walk step for step with Sam Porter Bridges. Wow. In a marathon stream for the ages bless. This isn't just oh we're going to walk for 3 hours and stop and do this on Monday. No. No. We will go for as long as you want it. You bring the subs to Twitch. We will stream all night long into Saturday. Me and I will walk step for step with quarter bridges. He takes a step. I take a step. What about when he's on a motorcycle? We get a motorcycle.",
            "start": 220.24
        },
        {
            "text": "Twitch. We will stream all night long into Saturday. Me and I will walk step for step with quarter bridges. He takes a step. I take a step. What about when he's on a motorcycle? We get a motorcycle. We get a motorcycle. We will get a motorcycle in the office. Is right. Uh it's me and Mike. We're going to be we're going to be together. I'm going to be playing. People have been asking about that. I'm going to be playing uh I'm going to be his the walking uh of the sand border bridges, but you're actually going to be on the treadmill going step for step with it. And a lot of people say, \"Mike, have you done any training for this?\" No, but in my mind I have. Okay. Visually, I have. I have. Will you stretch your mind? Absolutely not. Am I gonna eat a heavy pasta dinner the night before? Of course I am. That's carbs, you know. Yeah, exactly. You gota carb out. You got to car. They always say carb load before these big events. And so to have some fun with everybody out there as we promote",
            "start": 264.48
        },
        {
            "text": "I am. That's carbs, you know. Yeah, exactly. You gota carb out. You got to car. They always say carb load before these big events. And so to have some fun with everybody out there as we promote this for the big Friday marathon stream to of course help keep the lights and mics on, keep us all employed and, you know, support the team here. Kind of funny. I want everybody in the chats, if you're watching live, you now get to be part of our office pool. So the office pool is going to go like this. I've given Roger bless and Kevin I'll take your time down. All of you will put out the time that you think Mike will walk until he says I'm not walking anymore. I'm done for good. Is it 1 hour, 2 hours? You can put a a minute. You can put a second. I don't care. But how long do you think I will go until I truly fold? Not, oh, I'm going to sit down for a moment. But like truly say, Roger, I can't do this anymore. What is the office poll? ends up the person that is closest. No, you can tell",
            "start": 309.92
        },
        {
            "text": "go until I truly fold? Not, oh, I'm going to sit down for a moment. But like truly say, Roger, I can't do this anymore. What is the office poll? ends up the person that is closest. No, you can tell everybody. We'll we'll talk about it. Give Roger the pen really quick and let's see what he is. This a cumulative number, right? Like, so let's say you start walking for a few hours. You take a break, walk for a few hours. You know what I mean? Like Well, I just want you to know I'm not going to do that. But you know, if I get This is the moment I look at No, no, no. Shut the [ __ ] up. You're not going to do that. I'm going to walk. Okay. You were going to take a break. I know you're ask question. This This is important actually because I wrote this down. I might have to switch it. Are you walking during the cut scenes? No, I'm not walking during the cut scenes. Anytime he steps, I'm This is cumul. This is what I'm saying. Like, we have to figure out a way to to add up all the time you're",
            "start": 354.72
        },
        {
            "text": "during the cut scenes? No, I'm not walking during the cut scenes. Anytime he steps, I'm This is cumul. This is what I'm saying. Like, we have to figure out a way to to add up all the time you're walking, right? Like, are you saying I'm just saying from the moment we started No. Are you Are you staying standing during the cut scenes or are you still standing? You might want to sit down in the Okay. Well, maybe we'll see. We'll see. I'm just saying now is your time. Get in part of it. See, I like it over here. 69 hours. Somebody believes in me. Somebody knows I can go the whole weekend. I think they're just saying the stupid number. In my mind, I can go the whole weekend. Yeah. In your mind, you do a line. I've adjusted it. You could have done a back flip. Okay. Uh Kevin, why don't you give us your time since you can't write it down? We'll write it down for you. Roger, if I order a stopwatch, will you maintain it? Click it every time he's walking. No, you're not good. I can tell. Yeah.",
            "start": 392.24
        },
        {
            "text": "us your time since you can't write it down? We'll write it down for you. Roger, if I order a stopwatch, will you maintain it? Click it every time he's walking. No, you're not good. I can tell. Yeah. Well, I'm going from like I'm playing the game. My my calculation is from the beginning of when you start walking to whenever you tap out, not including the cut scenes. Exactly. You know what I mean? I'm including I'm including cut scene time in this 8 hours in, 4 hours in. Exactly. That's how I'm looking at this. What? That's what I want to know from all. How far into the stream does he give up? My my other question which I'd like an answer for. I notic you didn't answer is when like if he gets a motorcycle, what do you We'll still walk. No. No. We'll still walk. Okay. Anything that's not a cut scene, we will walk. Like I think 10 hours or 22 hours. 10 or 20. What? That's a wide margin. It is. But if he makes it past 10, he's making it to 22. I like that. I like that. So, we're going to",
            "start": 425.76
        },
        {
            "text": "cut scene, we will walk. Like I think 10 hours or 22 hours. 10 or 20. What? That's a wide margin. It is. But if he makes it past 10, he's making it to 22. I like that. I like that. So, we're going to put 10 or 22 for Kevin. Okay, so let's go down the list. Roger, you're first. Uh, do you believe in Mike? I went very specific. I said 13 hours, 22 minutes, and 28 seconds. You have a lot of belief in this man. Wow. A lot of belief in this man. Of course, Kevin Coella said 10 or 22. Blessing. What about you? So, I first wrote down 4 hours until I learned that there are cut scene rests. There are cut scenes. As somebody who's played Death Stranding, very cut scene heavy game, so you're going to have quite a bit of rest time. Seven hours is what I'm saying. Seven hours. Seven hours. Snowike Mike's office full. the whole [ __ ] time, baby. You got to believe in yourself. I I I appreciate you. Turn the thing up. Plug it in under here. Just go the whole cage and you all walk in. It might blow",
            "start": 463.92
        },
        {
            "text": "office full. the whole [ __ ] time, baby. You got to believe in yourself. I I I appreciate you. Turn the thing up. Plug it in under here. Just go the whole cage and you all walk in. It might blow the thing up. I don't want to blow the setup there. This is from Tik Tok shop. This is from Tik Tok. Yeah, it's Leanza's. We're going to break the Another uh question for Rogers. Did Do you have any of the uh lubricant that you're supposed to use? Whoa. Actually, I think I do at home. I think I do at home. bring it cuz like there's a chance it's going to like dry out completely cuz it's not made to go that long, right? That's a great call. At the very least you can lube it up and keep it going. What are we talking about here? I'm going to ask L if she got that about. Uh, of course, come join Roger and Mike this Friday as they attempt to do a full playthrough of Death Stranding one through the weekend, but they can only do it with your support. Will Mike and Roger break this treadmill because",
            "start": 507.84
        },
        {
            "text": "and Mike this Friday as they attempt to do a full playthrough of Death Stranding one through the weekend, but they can only do it with your support. Will Mike and Roger break this treadmill because they don't have enough lube and have to drive to Andy's home at 1:00 a.m. to borrow his? Find out Friday on twitch.tv. TV/countindfunny games. His treadmill, not his loop. We have We got We can also ask him for his loop just in case, too. Remember, we're in 11 business all about live talk shows. Today after KFD, you're going to get Games Cast, which is going to be about uh it being one month until SGF 2025. After that is the kind of funny podcast. Then after that is the stream. It is the Nuzlocke. It's back and it is the hunt for Lugia beginning. I f I've tried my best bless to get them back in the room and get them back on track. Yeah. So, we're going to try today to get I've seen the demand every day. Is the Nuzlock done his Pokemon? They yell at me. It's not over till we say it's over.",
            "start": 552.64
        },
        {
            "text": "the room and get them back on track. Yeah. So, we're going to try today to get I've seen the demand every day. Is the Nuzlock done his Pokemon? They yell at me. It's not over till we say it's over. Yeah, it's not over. If you're a kind of funny member, today's Greg Way is coming from Roger. Thank you to our Patreon producers. Oh [ __ ] it is. Carl Jacobs, Omega Buster, and Delaney Twining. That doubled as a reminder. I knew it was going to be a reminder. I didn't even ask. Usually I'm on it. Usually I'm on it. Today we're brought to you by Imperial Aura Frames and BetterHelp, but we'll tell you about that later. For now, let's begin with what is and forever will be the Roper Report. It's time for some news. We have two stories today. A baker's dozen. We have one big new story and our second story is going to be Wii news. That's how big story number one is because of course we're talking about Grand Theft Auto 6. Trailer 2 is out now. Get in your super chats. I'm already seeing super",
            "start": 596.24
        },
        {
            "text": "story is going to be Wii news. That's how big story number one is because of course we're talking about Grand Theft Auto 6. Trailer 2 is out now. Get in your super chats. I'm already seeing super chats come in talking about the trailer, talking about GTA. Although Joey Ratzone does write into super chats and say, \"Buy some Monster Energy for the stream.\" We've been talking about We literally just got an order. Roger got the special heart rate of the game. Yeah, exactly. We got a heart rate tracker for him. Are you playing the director's cut? Uh, I'm assuming so. Yeah, cuz the director's cut doesn't have the monster just No, they removed the monster in the probably mod it. We could probably do a mod for that. I'm sure that exists. Yeah. Or you can play the OG version, but if you're playing on PC, then you got to play the very best. Unfortunate. Jeff Bull Jr. writes in and says, \"Get Mike a pedometer. Measure by step.\" Look, I'm on it, bro. Got it. So on it, we're excited. Ricardo",
            "start": 647.2
        },
        {
            "text": "on PC, then you got to play the very best. Unfortunate. Jeff Bull Jr. writes in and says, \"Get Mike a pedometer. Measure by step.\" Look, I'm on it, bro. Got it. So on it, we're excited. Ricardo writes in and says, \"Remember when a lot of super chats about this marathon?\" I'm glad that they're excited. Good, good, good. Remember when Mike ran around the block to prove he can run a marathon, but then never ran the marathon? Oh, I still Well, I have a medal for the marathon, so you know. So do I. Who ran it? Who didn't? I don't know. You know what I mean? And then a lot of hearing about Mike. I'm going to stop it after this one. DJ Kendall writes in and says, \"Every time Sam Porter Bridges drinks a Monster energy, then Mike has to chug one, too. Let's make his heart explode. That would kill him.\" We can do that for an hour. Well, maybe I'll drink baby juice. What? What does that mean? Cuz I have a BB. I have a baby. Stool Auto 6 trailer 2 is out now. Um, have any of us watched the",
            "start": 681.92
        },
        {
            "text": "kill him.\" We can do that for an hour. Well, maybe I'll drink baby juice. What? What does that mean? Cuz I have a BB. I have a baby. Stool Auto 6 trailer 2 is out now. Um, have any of us watched the trailer yet? No, I did watch the trailer early this morning. I had no idea what the [ __ ] was happening. Just woke up on a a Tuesday morning to Grand Theft Auto. It was pretty awesome. I love that you're here. I'm still laughing at Baby Juice. Yeah, we got him. We got He was telling me about the Baby Juice. I don't want to hear about Baby Juice. Hey, find out what's inside. Jesus Christ. All right. Uh me and Roger haven't watched it and so this is going to be our first gonna be our first time viewing the trailer. Kevin, hit play. He's adjusting. He's adjusting. He's doing the Kevin thing. Kevin, let me know when you're ready to hit play. There we go. There we go. Oh god, I'm so scared. What are you doing up there? I'm just fixing some leaks. Seriously, dude. You got some time on your",
            "start": 719.28
        },
        {
            "text": "Kevin, let me know when you're ready to hit play. There we go. There we go. Oh god, I'm so scared. What are you doing up there? I'm just fixing some leaks. Seriously, dude. You got some time on your hands. I got some properties with paying tenants. Well, that's why you came by. Just go get me my chicks. See you, Brian. Love you, Jason. Love you, Jason. Hi, Jason. I love how this thing is that he's hot. Oh, dude. He's hot. He's a hot man. Yeah, he's a hot dude. That's what it's like in my life. Yeah, I'm here for She's supposed to be getting out. What's your name? Jason Duval. I've seen you here before. You might have. Hey. Hey, these are two hot bods. Two hot. And they're about to say to each other here. Come on. You stay the new beginnings. You make the news. [Music] Trust me, this place is just the start for us. Ring the bell. Shots, baby. The only thing that matters is who you know and what you got. Got to do this. You're doing it right. [Music] Yo, D, this full effect. They got",
            "start": 768.36
        },
        {
            "text": "is just the start for us. Ring the bell. Shots, baby. The only thing that matters is who you know and what you got. Got to do this. You're doing it right. [Music] Yo, D, this full effect. They got your name, address, they got everything. Us cops, we got to protect each other. [Music] You and me, we got this. We got it. Holy [ __ ] What the [ __ ] It looks like Fast and the Furious Bad Boys. It's got all the vibes. Come to Bill's Ammunation today. We got more guns than all TV commercial. I love TV commercial. They had that in. Hey, if you got friends, can you hook me up, please? [Music] Let's just talk over this. May 26, 2026. Series X and S. Let's go. Series SW have smoke, bro. Uh Mike, let's start with you since you've had more time to sit with the trailer. Yeah. Uh this is my second time watching it now and it gets me even more excited of course now more devastated that we have delayed it until May next year. But you know I'm very happy just to know we're going to get GTA 6 here in",
            "start": 860.24
        },
        {
            "text": "watching it now and it gets me even more excited of course now more devastated that we have delayed it until May next year. But you know I'm very happy just to know we're going to get GTA 6 here in the near future. But it looks great. Bless right. I think this is a good tone setter. We got some great music to kick us off jumping from different genres giving you that you know South Miami vibes which I really like. I love seeing both of our characters here. Two hot bodies as you said. Roger going to be very exciting to see and you get all the vibes you want. All the crime vibes or vibes that you want from, you know, bad boys in Miami down there. Some Fast and Furious scenes. I can't wait to dive in. You got the cops of course, but there's so much more to dive into. We saw a football jersey. I want to see that kind of very similar to the Miami Dolphins look, but all in all, a great great trailer. Disappointing that we have to wait now a year for this. That's that's tough. Roger. Yeah.",
            "start": 951.84
        },
        {
            "text": "I want to see that kind of very similar to the Miami Dolphins look, but all in all, a great great trailer. Disappointing that we have to wait now a year for this. That's that's tough. Roger. Yeah. What's your reaction? Uh, I really love this trailer. I I was very surprised by how they cut this trailer, especially in the beginning of it. Like the kind of POV day in a life type deal. I think that's a very inspired choice to kind of show you how alive GTA is just from the first 20 seconds of it all. And of course, you then have the uh expected GTA trailer of it all where it's ass and [ __ ] guns and explosions. Uh, this is still an unbelievable game to me. It is a game that I look at and I I can't believe one we're seeing the number six after GTA and two that this game looks so [ __ ] good consistently. Uh will it actually look this good when it launches? Probably, right? But I I am I'm still shocked that this is not even a PC version necessarily, right? This is this is launching only on",
            "start": 994.72
        },
        {
            "text": "Uh will it actually look this good when it launches? Probably, right? But I I am I'm still shocked that this is not even a PC version necessarily, right? This is this is launching only on consoles. Uh it's it's crazy to me that this this game exists and I'm I'm excited to watch this trailer a million times. You know, some would say not enough ass though. You know what I mean? that first time when we when we we were bouncing on top of the car hood. It's like we got to get more. I think that's where I want to start with this trailer where I it's tough for me. I think often times often times with trailers for games that are somewhat known quantities, it is tough for me to watch a trailer and get super excited because I look at this gameplay-wise and I'm like, \"Okay, cool. It's more GTA.\" Like, it's more GTA. It's in Vice City. There's there's drugs. There's guns. There's sex. There's robberies. Like every everything that I'm seeing in this trailer is GTA. And so like I think as far as",
            "start": 1040.56
        },
        {
            "text": "it's more GTA. It's in Vice City. There's there's drugs. There's guns. There's sex. There's robberies. Like every everything that I'm seeing in this trailer is GTA. And so like I think as far as that aspect of it, I'm kind of like, \"All right, cool. Yeah, we got we got another trailer.\" But when you talk about the amount of ass that we're seeing in the trailer, I think that is one thing that does stick out to me in the sense of right now there's a movie that's out that people are loving, people are watching, people are into. It's called Sinners. Have you guys seen Sinners? Yes, I have. No, I have not. It's a horny ass movie. Okay. So, it's a horny ass movie. And I think the thing that for me I love about that and I think what a lot of people are loving about it is that it is like authentically horny. You know what I mean? Like it is like there's something about it where it's like, \"Oh, damn. Y'all have leaned into this in a way where this brings the characters together. It's not just",
            "start": 1075.36
        },
        {
            "text": "horny. You know what I mean? Like it is like there's something about it where it's like, \"Oh, damn. Y'all have leaned into this in a way where this brings the characters together. It's not just sexy and horny for the sake of being sexy and horny. It is a connective tissue between the characters to really like drive home what you're trying to do as far as their relationships and their dynamics and like this how this person responds to this person, all that stuff, right?\" Like I love that we're doing a Bonnie and Clyde thing here where um the main characters is it Jason and Lucia or Luca? Lucia. Lucia. Let me know. Chat correct me. Um but like seeing how much of it goes back and forth between I'm Jason, I'm working out. I'm [ __ ] hot. And also like I'm doing crimes. We're robbing trucks. We're doing all this [ __ ] But then every other scene we're also banging and like loving each other, right? Like that gets me excited on a narrative level of gets you excited for sure. I mean it gets",
            "start": 1113.12
        },
        {
            "text": "doing all this [ __ ] But then every other scene we're also banging and like loving each other, right? Like that gets me excited on a narrative level of gets you excited for sure. I mean it gets me excited but it gets me excited on a narrative level of Yeah, of course. Oh, this is I don't think we've seen this as much in a Grand Theft Auto as far as like two characters being this into each other, right? Like this kind of dynamic between two characters. Like I think oftent times GTA leans way more into like the satire and violence and the ridiculousness of it. But there's a authentic nature to this relationship between these two characters that I'm already feeling off of the show. Yeah. When there was relationships in GTA, especially with the main characters, it kind of felt like secondary, right, with Michael and his wife. That was that was in the game and it was like they don't love each other. It's not really like that. uh with uh GTA 4. You can have a romance there by the end of CJ",
            "start": 1154.96
        },
        {
            "text": "right, with Michael and his wife. That was that was in the game and it was like they don't love each other. It's not really like that. uh with uh GTA 4. You can have a romance there by the end of CJ and all of his girlfriends. I forgot about that. We were going to a lot of bars. We're going to a lot of bars. Uh but I I I the fact this is a dual narrative video game and we can see I mean we haven't confirmed, right, that we play as both these characters. You can assume you're playing as both these characters. You assume? Yeah. I think the rumors were that you were playing or like the leaks that were that you were playing both the characters. That just excites me. And have a a female playable character that is one of the two protagonists. That's that's really that's really exciting to me. Yeah. Oh, really cool. There's some cool moments in this right there. That like underground MMA fight in the cage. Like that would be cool if we have some cool like fist MMA fighting type style. I",
            "start": 1190.72
        },
        {
            "text": "Yeah. Oh, really cool. There's some cool moments in this right there. That like underground MMA fight in the cage. Like that would be cool if we have some cool like fist MMA fighting type style. I would love that. Kev, can you replay that part real quick? I want to see if that's just pure That looks like pure cut scene, but I would love if I They talk about with every Rockstar game I feel of improving the combat, like the hand combat. I would love to actually see Yeah, we've gotten it good enough to a point where we're actually doing MMA matches in a gym. Be a fun little side activity as well. We always talk about all the different sides. GTA San Andreas has had boxing to like learn new moves. Oh my god. Bring that back. Oh [ __ ] You can get ripped or you can get fat. Bring it back. I'll tell you right now. Jason's not getting fat. Yeah, it's going to take a lot of time for that one to try to turn. Uh he was pumping iron. Do you think you will have any sort of weightlifting miniame",
            "start": 1224.16
        },
        {
            "text": "tell you right now. Jason's not getting fat. Yeah, it's going to take a lot of time for that one to try to turn. Uh he was pumping iron. Do you think you will have any sort of weightlifting miniame or do you think that's in the past? I think so. I mean there's a reason they stopped doing it in five. There's a reason. And they stopped doing it in four, but also four I feel like strip back a lot of things, right? So, you were just jamming buttons and you tast really blow your top off on this one. It was just kind of fun. Yeah, but I more so there's a reason why you include that in the trailer and it could just be we're building Jason's character. Jason loves himself. Jason works out. Jason's whole thing is that he's hot. But it also could be a cool illusion to oh, we're bringing back some of those mechanics that people might miss from a GTA injury is. But here's the thing though, it's tough because if you if they have that in the game where they let you work out Yeah. Yeah, then they in",
            "start": 1261.28
        },
        {
            "text": "those mechanics that people might miss from a GTA injury is. But here's the thing though, it's tough because if you if they have that in the game where they let you work out Yeah. Yeah, then they in my opinion they also got to let you get fat. Well, I think that builds into my mind of GTA online having that true life sim, right? This is what like when I start to see smaller things, it's building into what people are really going to spend a lot of time with, which is that life sim that has become GTA online. And so now they give you the freedom of, hey, bless and Mike, you can build your character, sure, however you want. Or we can give you the freedom. You can become fat and eat a bunch of burgers or you can work out daily and we can build your bod that way. I think that also adds to the roleplay nature of it all would be fun. That's a that's a great call right there. Yeah. I didn't even think about the GTA online element of it, but in terms of like I there's no way that you can get",
            "start": 1300.4
        },
        {
            "text": "roleplay nature of it all would be fun. That's a that's a great call right there. Yeah. I didn't even think about the GTA online element of it, but in terms of like I there's no way that you can get fat as Jason like in my like that they clearly have set up that this guy is hot narratively. Yeah. It it doesn't make any sense. But I like where your head's at though. That's start thinking of when you look at some of these things. A lot of this is going to be GTA online. Of course, we'll enjoy it in the single player story as like side activities, but it will hopefully be building into this grander thing. the money maker which is GTA online at the end of it. But yeah, when we start breaking down some of these scenes, Kevin, if we can go back towards the cage scene, I just want to look at that guy's jersey right afterwards. We were talking Yeah. we kind of you build up the world, right? And it's always exciting to me to think back to San Andreas and of course four and five. You think of",
            "start": 1338.96
        },
        {
            "text": "guy's jersey right afterwards. We were talking Yeah. we kind of you build up the world, right? And it's always exciting to me to think back to San Andreas and of course four and five. You think of the sports teams around it. Like building that world in that city is always special. And so I'm really excited to see what do we have, who's on the radio, right? Like what kind of crazy radio we get? Yes. So, who's going to who's it going to be? Who's going to be who's going to replace Llo? Is it going to be a celebrity we know? We already sound like we have a funny comedic guy in this right there. Buddy at the bar who's yelling get the shots. He was seen about two times in this. I mean, I have more information about about all the characters. Well, let's look at this jersey really quick and then we can go into that cuz I I got to see the jersey. We got to talk about the jersey. You said the cage scene was it's right after this. Ready, Kevin? It's going to pop up right now. Yeah, man. manity.",
            "start": 1376.24
        },
        {
            "text": "we can go into that cuz I I got to see the jersey. We got to talk about the jersey. You said the cage scene was it's right after this. Ready, Kevin? It's going to pop up right now. Yeah, man. manity. That's great. Yeah. So, that's giving that's giving South Florida vibes. Is that like a Jaguars hat, too? He's wearing Oh, sure. I didn't see the hat. Well, when we go back to it, we'll look at it. Uh, someone also said in the chat that this is running on a base PS5. Is that confirmed at the ending of this? Yeah, I didn't see that. I didn't see that at the beginning. That would be crazy. Really? That's insane if that's true. Yeah. This all looks good. Yeah, this all looks real good. Oh, man. They got all the vehicles. are showing you all these cool vehicles. You're on the jet screen says captured on PS. You're on the fan boat. That's cool. I'm I'm Yeah, I'm very fascinated by some of these some of these set pieces that we're seeing. Right. That guy looks like Matty Matson. I don't know if",
            "start": 1414.8
        },
        {
            "text": "on PS. You're on the fan boat. That's cool. I'm I'm Yeah, I'm very fascinated by some of these some of these set pieces that we're seeing. Right. That guy looks like Matty Matson. I don't know if you He's from the Bear. He's the He's the guy. That guy looks like I know it's not him, but that's clearly like based off of him. We're going to see a lawsuit in the next few months. He kind of have the Jack Black voice. So, yeah, that that's going to be a fun one right there. to bring in some super chats. Danesta writes in and says, \"GTA 6's release date, May 26th, coincides with the day of Bonnie and Clyde's funeral, who are in who are an inspiration for Lucia or Lucia and Jason.\" Coincidence? Yeah. See, it's interesting, right? When I see this trailer, I'm like, man, it's so hot that these two hot bodies are together, right? They're we're going to have the tragedy, right? Like, you have to have the tragedy. There's no way that this game ends with them together falling in love, driving off",
            "start": 1452.88
        },
        {
            "text": "hot bodies are together, right? They're we're going to have the tragedy, right? Like, you have to have the tragedy. There's no way that this game ends with them together falling in love, driving off into the sun. Rockstar. Somebody's going to die. I Someone's going to betray somebody and I think this dude is a cop. That's what that's what they're leading towards. Jason is a cop. I think that's what I think he's he's a cop. It makes too much sense. It makes too much sense. Like and also they they had a shot I think it was like it was clearly inside of a police station of like police officers talking to each other. Why would that that's never in those games? You know what I mean? Like they don't cut away from the characters, right? Where it's like, \"Oh, now here's the police talking about a crime.\" Like no, someone's someone's in that room and it's probably Jason and he's talking to the police and he's like an informative. I mean, I think a story like this has to be tragic toward the",
            "start": 1490.16
        },
        {
            "text": "a crime.\" Like no, someone's someone's in that room and it's probably Jason and he's talking to the police and he's like an informative. I mean, I think a story like this has to be tragic toward the ending in some way, right? Jason dies this undercover cop and he's been lying, right? Or Lucia dies and it's this tragic thing. I And I here's the thing. GTA V spoilers for GTA 5 if that's the thing that we're doing, right? Like, and this isn't much of a spoiler, but you choose how that game ends, right? There are the decisions and that have major impacts on character fates. Maybe like you choose between one of these two at the end of it. Well, I was going to say, do you run that back again? I don't think you run that back again for the next game. I think that's too predictable. I think you gotta and especially a Rockstar that has put out both Red Dead one and two, I feel like they become a bit more confident in like no like if we're gonna break people's hearts, we're just gonna do it. We",
            "start": 1521.6
        },
        {
            "text": "and especially a Rockstar that has put out both Red Dead one and two, I feel like they become a bit more confident in like no like if we're gonna break people's hearts, we're just gonna do it. We got to do it. Like we have to have a definitive this is what the story is. This is our vision for the like where the narrative is going. It works so well with a dual uh protagonist video game, right? You choose the one. You choose the one's got to go or you have the option where you can run off into the sunset. Both of them are going to run off in my mind. Both of them get on a boat and they just cruise right into the sunset out of here. Red Dead according to Dean Brown in chat. Red Dead 2 had a few different ending variations. No one's ever finished that game. Nobody's nobody's ever finished Red Dead. No one's ever finished Red Dead 2. So, we actually don't know. Thank you. Well, that's an exciting date right there. I mean, what if we just did this year May 26? You know what I mean? Like,",
            "start": 1554.96
        },
        {
            "text": "Dead. No one's ever finished Red Dead 2. So, we actually don't know. Thank you. Well, that's an exciting date right there. I mean, what if we just did this year May 26? You know what I mean? Like, let's just drop it. I saw when I saw the trailer, there was a part of me where I was just like, what if they were just lying? Like, I'm so deep in the copium. I'm just like, what if this comes out today? I'm happy for you guys, but I'm also I'm I'm happy that this is next year. I don't want this this year. I had too much [ __ ] going on in 2025. Yeah. I mean, I get that argument. I I get how people feel cuz there's a lot of games, but I don't care when this comes out. This could have came out this year would have been happy. And next year in the summertime, it's going to be a pretty lit summer. So, I had no problem either way where it's landing. Um, we got a super chat in from Barista Bran who writes in says that trailer was pure baby juice. His [ __ ] beard grows. [ __ ] yeah, dude. Love",
            "start": 1588.4
        },
        {
            "text": "So, I had no problem either way where it's landing. Um, we got a super chat in from Barista Bran who writes in says that trailer was pure baby juice. His [ __ ] beard grows. [ __ ] yeah, dude. Love that. [ __ ] yeah. We're going to get into this, of course, right now. Kevin has pulled up the actual GTA 6 Rockstar website page. uh that gives a bit more of it gives a lot more screenshots, but then it also gives a bit more of a dive into who these characters are. I have a full article from VGC that I want to dive into where we talk about the characters, talk about the story setup, and get and get deeper about it. But before we get there, I want to get you to go over to patreon.com/kindfunn and youtube.com/confunname where you can get the kind of funny membership which allows you to get shows adfree. And speaking of ads, let us tell you about our sponsors. This episode is brought to you by Imperial. We've told you all how important it is to developers to wishlist games that you're",
            "start": 1619.84
        },
        {
            "text": "shows adfree. And speaking of ads, let us tell you about our sponsors. This episode is brought to you by Imperial. We've told you all how important it is to developers to wishlist games that you're interested in. So, if this sounds cool to you, make sure you wishlist it. Imperial is a complex, featurerich action RPG where you'll be sent to a planet in a far-off corner of the galaxy to explore an imposing monolith. As an elite mercenary, you'll join the expedition tasked with unearthing the secrets of the monolith and face off against the deadly automatons within. In Imperial, you'll explore four vastly different quadrants of the monolith. Accessible only by using mysterious artifacts known as cardoggrams. Each cardoggram affects which enemies, boss fights, and loot will appear when you enter the monolith, so no two excursions will be the same. Find even more cardoggrams to explore by looting defeated enemies, or buy them from other players online at the trading post. Imperial features",
            "start": 1656.72
        },
        {
            "text": "the monolith, so no two excursions will be the same. Find even more cardoggrams to explore by looting defeated enemies, or buy them from other players online at the trading post. Imperial features three weapon archetypes. The fast-paced acrobatic glaive, the defense focused mason shield, or the devastating cannon with a range of customizable skills and abilities that can make short work of the awaiting automatons. Your weapons and abilities can be changed before any excursion into a cardoggram. So, if a loadout isn't working for you, you can mix things up to create the perfect play style. Help the members of the expedition in deep branching quests and aid other players in asynchronous multiplayer. Get ready, mercenaries. The monolith awaits. Imperial is available May 8th on PC, Xbox Series X ands, and PS5. Wishlist now. It helps so much. Wishlist Imperial. This episode is brought to you by Auraframes. If you haven't called your mom in a while, here is your reminder to do it. But then",
            "start": 1699.76
        },
        {
            "text": "X ands, and PS5. Wishlist now. It helps so much. Wishlist Imperial. This episode is brought to you by Auraframes. If you haven't called your mom in a while, here is your reminder to do it. But then you want to go above and beyond. Mother's Day is coming up and I have the perfect gift idea. Aura Frames are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preload it with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special, they'll use it every day. Greg, Kevin, and a ton of people here at Kind of Funny are obsessed with their Aura frames. It takes about 2 minutes to set up a frame using the Aura app. So the next time you need to call your mom, you could also send her a new pic of you from that trip you're telling her all about. Ara has a great deal for Mother's Day. For a limited time, listeners can save on the perfect",
            "start": 1743.76
        },
        {
            "text": "to call your mom, you could also send her a new pic of you from that trip you're telling her all about. Ara has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting orura.com to get $35 off plus free shipping on their bestselling Carver for Matt Frame. That's a rare frames.com promo code kind of funny. Support the show by mentioning us at checkout. Terms and conditions apply. The show is sponsored by BetterHelp. It's super great that mental health awareness is growing, but there's still progress to be made. 26% of Americans who participated in a recent survey say they've avoided seeking mental health support due to fear of judgment. We can do better. No reason for fear. BetterHelp has over 10 years of experience matching people with the right therapist from the diverse network of more than 30,000 licensed therapists with a wide range of specialties. Some of my best friends use BetterHelp and love how helpful it can be for learning",
            "start": 1789.84
        },
        {
            "text": "right therapist from the diverse network of more than 30,000 licensed therapists with a wide range of specialties. Some of my best friends use BetterHelp and love how helpful it can be for learning positive coping skills and how to set boundaries. It empowers you to be the best version of yourself. It isn't just for those who've experienced major trauma. If you're thinking of starting therapy, give BetterHelp a try. It's entirely online, designed to be convenient, flexible, and suited to your schedule. We're all better with help. Visit betterhelp.com/kindfunn to get 10% off your first month. That's betterhelp hp.com/kindafoney. better betterhelp.com/kindofunn. GTA 6's cast of characters revealed, including conspiracy theorist and strip club gangster. This is from Jordan Midler at Video Games Chronicle. This is what I want to do. So up right now up right now. This is a long article. This is like a three-page long article. So this is what I want to do. I want to play a game of red light",
            "start": 1835.36
        },
        {
            "text": "Chronicle. This is what I want to do. So up right now up right now. This is a long article. This is like a three-page long article. So this is what I want to do. I want to play a game of red light green light. Okay. When I get to a point where you guys are like, \"Oo, I want to touch on that.\" Hit the red light and we'll talk about it. All right, hopping into the article. Rockstar Games has released new screenshots for GTA 6 and revealed the game's cast of characters and protagonists. The game will feature dual protagonists, Jason Duval and Lucia Caminos. Rockstar has confirmed, quote, \"Meeting Lucia could be the best or worst thing to ever happen to him. Jason knows uh Jason knows how he'd like it to turn out, but right now it's hard to tell. Reads a profile of Jason's character released by Rockstar. Yeah. Quote, \"Jason wants an easy life, but things just keep getting harder. Jason grew up around the grifters and crooks. After a stint in the army trying to shake off his troubled",
            "start": 1884.24
        },
        {
            "text": "by Rockstar. Yeah. Quote, \"Jason wants an easy life, but things just keep getting harder. Jason grew up around the grifters and crooks. After a stint in the army trying to shake off his troubled teens, he found himself in the Keys doing what he knows best, working for local drug runners. It might be it might be time to try something new.\" End quote. Mhm. That's being a CI right now. becoming a cop. Becoming a [ __ ] cop. He called me Roger. He does have such cop vibes. He does. He does. And when that when the jail guy saw him, he's like, \"Haven't I seen you before?\" It's like, \"Cop, he saw him pull up before.\" Yeah. Lucia's profile reads, quote, \"Lucia's father taught her to fight as soon as she could walk. Life has been coming at her swinging ever since. Fighting for her family landed her in the Leonida Penitentiary. Sheer luck got her out. Lucy has learned her lesson. Only smart moves from here.\" profile. Sheer luck. I'm sorry. Red light. Sheer luck. Not the police pulling the",
            "start": 1924.96
        },
        {
            "text": "her in the Leonida Penitentiary. Sheer luck got her out. Lucy has learned her lesson. Only smart moves from here.\" profile. Sheer luck. I'm sorry. Red light. Sheer luck. Not the police pulling the strings and making sure that she can get out. Whoa. Sheer luck. Why did we change? We pressed the wrong button. Cuz you said red light. Be fun. This guy. Listen, let me cook. I got scared because I cuz I saw Greg in the chat saying in the chat riing them up. So I thought I thought Greg was coming out. I got scared. The profile continues. Well, more than anything, Lucia wants the good life her mom had uh has dreamed of since her days in Liberty City. But instead of halfbaked back, yeah, call back. Instead of half-baked fantasies, Lucy is prepared to take matters into her own hands.\" End quote. I'm going to red light. Red light. Can we just talk about really quick her hairstyles in this? Yeah. Oh, fantastic looking at the different hairstyles. We don't need the red light, red light. I",
            "start": 1967.04
        },
        {
            "text": "I'm going to red light. Red light. Can we just talk about really quick her hairstyles in this? Yeah. Oh, fantastic looking at the different hairstyles. We don't need the red light, red light. I appreciate the multiple different hairstyles. And then if you go down, we got her hair down as well. be very interesting to talk about like yeah the beard right of like how much control do I have with this character and what can I do I mean do you think they're going to take after Red Dead where it is like time elapses and like as you go without getting a haircut your hair just naturally grows that way I would think maybe at least for the beard right that might be more difficult to do with hair with the different hairstyles that people might want on the on the spot and stuff um but I think that'd be [ __ ] cool these are the most the two most beautiful characters in video games holy [ __ ] oh god damn I need that on my wall. Take me back to when I was if I was in high school, bro. Did you guys",
            "start": 2015.6
        },
        {
            "text": "[ __ ] cool these are the most the two most beautiful characters in video games holy [ __ ] oh god damn I need that on my wall. Take me back to when I was if I was in high school, bro. Did you guys ever have GTA posters on your wall? Cuz I did, of course. Uh, no. No, I didn't. Dude, I had it. Yeah, actually, I have the cool um three box sets of the games with all the cute chicks on them and then the CDs in front of them upstairs. My friend Addison growing up was the one that like had like the hot photos of GTA characters on his wall. I I didn't have that in me cuz like I I grew up in a very Christian family with a pastor father. So, I just had the map. I just had the GTA map on my wall. Yeah. And then you flip it over. What if I flipped it over? Oh, man. Flipped it over, man. Uh, continuing on with the article Greenlight. The new profiles were released alongside the second trailer for GTA 6. Also introduced are GTA 6's supporting cast, which includes Cal Hampton, Jason's friend, who",
            "start": 2053.12
        },
        {
            "text": "on with the article Greenlight. The new profiles were released alongside the second trailer for GTA 6. Also introduced are GTA 6's supporting cast, which includes Cal Hampton, Jason's friend, who feels safest hanging at home, snooping on Coast Guard coms with a few beers and some private browser tabs open. So, he's he's our uh what's his name? What's that guy's name? Lester. Lester. Lester. He's our Lester. He's our Lester. A little more funny. I hope a little bit little more der. Yeah. Cal is at the low tide of America and happy there. Casual paranoia, loves company, but his friend Jason has bigger plans. End quote. Next up is Booby Ike, who's described as a local Vice City legend. Quote, \"One of the few to transform his time in the streets into a legitimate empire spanning real estate, a strip club, and a recording studio. Boobies all smiles until it's time to talk business.\" I'm going to pause there. Pause. Red light. Red light. Um, you're going to be doing you're going to be doing",
            "start": 2095.52
        },
        {
            "text": "strip club, and a recording studio. Boobies all smiles until it's time to talk business.\" I'm going to pause there. Pause. Red light. Red light. Um, you're going to be doing you're going to be doing a lot of things through movie. Like a lot of your like all your business them describing uh he's um like you know had this empire expanding real estate strip club and a recording studio. Those are all side activities right there. He'll get you into the real estate business where you start owning a strip club or something like Yeah. Yeah. I mean it's literally the exact same thing they did in GTA 5 as far as owning a strip club. Uh recording studio jumps out at me. One thing I think about a lot a lot uh regarding the next GTA is Rockstar has leaned in deep into their love and obsession really with like music and owning music and like they started a record label quite a few years ago. Like I think whatever this recording studio [ __ ] is going to be, I think it's probably it's probably more",
            "start": 2142.0
        },
        {
            "text": "like music and owning music and like they started a record label quite a few years ago. Like I think whatever this recording studio [ __ ] is going to be, I think it's probably it's probably more expansive than they're leading on with just this. Yeah. Remember when they had Dr. Dre recording an original [ __ ] song for DLC of GTA online? No, it was like five songs. Insane. Yeah. Yeah. We're going to get I I wouldn't be surprised if we get a lot of original a lot of a lot of original songs. They they did that with GTA V. They had like Tyler the Creator. They had like a whole soundtrack of original tracks. You know that that's a great song. I know song goes [ __ ] hard. They have like School Boy Q original songs. Yeah. Yeah. Yeah. Yeah. Those songs inc were incredible. But like yeah, I could see entire radio stations full of original songs. I mean I could see a mission I could see a side mission chain of like you collaborating with artists that are real life artists, right? Like if",
            "start": 2183.28
        },
        {
            "text": "could see entire radio stations full of original songs. I mean I could see a mission I could see a side mission chain of like you collaborating with artists that are real life artists, right? Like if there's not a Pitbull mission in this game, we've said this before. We said this a year ago. Pipple's not in this game. Pipple needs to be in this game. Mr. Worldwide. He's not in this game, though. There's no way. Is there a celebrity cameo in this game? Multiple. I mean, multiple. Multiple. Many for sure. And you're telling me that Pitull won't be in this then? He's He's not I think I don't think Mr. Miami. I don't think that Rockstar looks at him and like he's the guy. Uh, no. The entire world looks at him and says he's the guy. Roger. Are you insane? Yeah. No, Roger. I think you guys I think you guys are [ __ ] I think you guys are a little late. If we were making a movie in Miami, we were making a video game based in Miami and you say, \"We're going to pull some celebrities.\" The",
            "start": 2218.72
        },
        {
            "text": "I think you guys are [ __ ] I think you guys are a little late. If we were making a movie in Miami, we were making a video game based in Miami and you say, \"We're going to pull some celebrities.\" The first word out of our mouth would be Mr. Worldwide. But yeah, that's why you're not making the games. We making the games. Here's the list, right? It goes Mr. Worldwide people. Pizza Bet DJ Khaled. DJ Khaled. DJ Khaled for sure. 100%. Will Smith. Will Smith. All right. We do a pizza bet. I mean, I will put down the Yeah. Okay. Mr. Mr. Rob will not be in the base GTA 6. What do you mean base? I'm not I'm not saying 10 years from now in GTA. Okay. This [ __ ] guy I'm saying not in GTA [ __ ] online uh contract mode or whatever he'll music. No. No. I'm saying you're saying Pit Bull is going to be in the [ __ ] game. There's no shot. See, now you adding a bunch of stipulations. I'm adding two stipulations. I will take that. I will take that. I got a good feeling like you're going to show up",
            "start": 2254.72
        },
        {
            "text": "be in the [ __ ] game. There's no shot. See, now you adding a bunch of stipulations. I'm adding two stipulations. I will take that. I will take that. I got a good feeling like you're going to show up to a Pit Bull concert. The strip club will be popping off and all of a sudden Pit Bull pops out for What about What about Bad Bunny? Bad Bunny be sick. Why you looking at me like that's crazy? He's like literally the biggest artist in the world. I'm looking at you I'm looking at you like that's a [ __ ] guarantee Bad Bunny is going to be at least a song. A song a song and being in the game are different. A song and being in a video game are very different. Is literally in the video game if a song's in the game. Okay. Yeah. So the entirety of Guns and Roses inside of [ __ ] GTA. What are you talking about right now? I I think you're going to get a Bad Bunny mission. Okay. What? You want to make another pizza back cuz I'm getting two pizzas. No, no pizza. I'm just saying don't be surprised",
            "start": 2296.88
        },
        {
            "text": "about right now? I I think you're going to get a Bad Bunny mission. Okay. What? You want to make another pizza back cuz I'm getting two pizzas. No, no pizza. I'm just saying don't be surprised when you see Bad Bunny in there and he hits a wrestling move on you. Oh [ __ ] Uh so cool. Okay, hopping back uh to the green light. Quote, \"Booby might seem like he's just out for himself, but it's his partnership with the young aspiring musician mogul Dquin uh uh for Only Raw Records that he's most invested in. Only Raw Records. Uh now they just need a hit.\" Oh, you're for sure going to do this. Uh, in GTA San Andreas, who was the rapper that you work with? OG. And then you had to go steal the rhyme book. That was so good. Whose rhyme book are you stealing in Vice City? And is it Pitbull? Think about it. Flow rider. You're not stealing Flo. You guys are so flow. Dquin Priest is described as more of a hustler than a gangster. I said that in the most white way possible. He's more more of a",
            "start": 2337.04
        },
        {
            "text": "about it. Flow rider. You're not stealing Flo. You guys are so flow. Dquin Priest is described as more of a hustler than a gangster. I said that in the most white way possible. He's more more of a hustler than a gangster. quote, \"Even when he was dealing on the streets to make ends meet, uh, breaking into music was the goal. Now that he signed the real now that he signed the real dimes, uh, Dracoon's days of booking acts into Booby strip club might be numbered as he sets his sights on the Vice City scene.\" End quote. Uh, would you say Bayu or Bays here, Mike? What do you think? B AE-L XE. I'm going to say Bayu. Yep. Mhm. Uh, Bayux and Roxy aka Real Dimes have been friends since high school. So sick. Quote, \"Girls with the savvy to turn their time shaking down local dealers in a cold hard cash via spicy rap tracks and a relentless social media presence. An early hit single uh with local rapper Downplay took Real Dimes to new heights. Now after 5 years and a whole lot of trouble,",
            "start": 2380.48
        },
        {
            "text": "hard cash via spicy rap tracks and a relentless social media presence. An early hit single uh with local rapper Downplay took Real Dimes to new heights. Now after 5 years and a whole lot of trouble, they're signed to Only Raw Records, hoping Lightning can strike twice.\" End quote. A lot of Only Raw Records. This is so deep here. Like I didn't I This is nice that we're getting all of these breakdowns of this. I love that. Seems like it's going to be more than a side mission. That's awesome. Raulista, hold red light. Let's talk social media. This game really great, by the way. Yeah, these two girls look great. Great. These two girls are giving me the vibes. What are the two girls who came up with the songs that were running after they were on TikTok and they were running directly at the phone all the time. Um they were really fun. I had it. I had You know who I'm talking about. Those two girls were a lot of fun. They're giving me those vibes. Well, it's like City Girls. I feel like",
            "start": 2432.96
        },
        {
            "text": "phone all the time. Um they were really fun. I had it. I had You know who I'm talking about. Those two girls were a lot of fun. They're giving me those vibes. Well, it's like City Girls. I feel like that's what that's Yeah, but you know who they are though. I know. But yeah, let's talk about this. Fly on a boss is the name of one of them. One of them. Yeah, for sure. Maybe it's both of my but yeah. How about the social media? What do we think? Like in general, are you going to be looking at it often in this game? Oh yeah. Will you be You have to be able to pick up your How much do you think you'll buy into it? If this game doesn't have an option where I can press up on my D-pad and just scroll on Tik Tok endlessly, then there's an issue. No, this game is gonna have a Tik Tok and it has to just be endless. Just like [ __ ] like update it all the time. just like dumb [ __ ] Endless weird wacky things that they're pulling from the internet put from the game. I mean, that might be part of",
            "start": 2471.2
        },
        {
            "text": "just be endless. Just like [ __ ] like update it all the time. just like dumb [ __ ] Endless weird wacky things that they're pulling from the internet put from the game. I mean, that might be part of the live service element of this. I can see that being updated over the years of like, hey, every every few months, here's just a bunch of random [ __ ] we're going to put in this. I could literally see it being player driven as well. Like Rockstar is big on player created content. All the content we've see it, we pull it, we pull it in, put it in. Like I I wouldn't be surprised if they're like, \"Hey, here's a feature where you can record a 10second video or like a 30second video, edit it and put captions, edit it, and put captions and then upload it to a social media. That's enough likes. We put it on the real game. That's sick. What do they call What do they call it? Star Talk. Like Rockstar. Rockstar. Star Talk is good. I like that. Uh and then also on top of that, we talked about the",
            "start": 2506.96
        },
        {
            "text": "put it on the real game. That's sick. What do they call What do they call it? Star Talk. Like Rockstar. Rockstar. Star Talk is good. I like that. Uh and then also on top of that, we talked about the TV. Do you think we'll have active TVs where you can sit there and watch episodes? Yeah. I think that's been a staple since four. Well, I think it's going to be more like YouTube now. You know what I mean? Like it's it's going to be TV, but it's just going to be their version of YouTube. So, you're going to see podcasts. You're going to see all this [ __ ] Somebody in chat says Talk Star. That's not bad. Talk Star is really good. That's good. But I feel like the the the problem with it is that they I don't think they'd make a Rockstar pun. I think they make some kind of GTA pun, right? Like Rockstar doesn't really do like a lot of like inputting themselves in the game. Yeah. And I feel like if anything, it wouldn't be like a like a pun or anything. It would just probably be making fun of",
            "start": 2537.68
        },
        {
            "text": "doesn't really do like a lot of like inputting themselves in the game. Yeah. And I feel like if anything, it wouldn't be like a like a pun or anything. It would just probably be making fun of Tik Tok and they would make something. You know what I mean? Like it would be about the word of Tik Tok and they wouldn't be like that pair app that they always I was going to say social club. Yeah. Click clack is kind of good. Someone just said that. Click is really good actually. Uh somebody brought up the island boys. You know, we talked about the the Florida Joker man that he was like, I'm gonna sue these guys because that's me in the first trailer. I mean, you have to assume we will take shots at the Island Boys in this. There has to be. That was an insane time deep in the development of the Rockstar. You're so right. Actually, you're absolutely right. The Island Boys will definitely have a moment where you will see two idiots walking by and you're going, \"Oh, yeah. That's a reference to",
            "start": 2574.4
        },
        {
            "text": "Rockstar. You're so right. Actually, you're absolutely right. The Island Boys will definitely have a moment where you will see two idiots walking by and you're going, \"Oh, yeah. That's a reference to those two guys.\" I'll be honest. This is one of one of those scenarios where your your algorithm is just way different from my algorithm. No, they're big. They're a big You know who the Island Boys were for sure. I don't think I I don't think I know who the Allen boys are. Who are you? Do Do not look deeper into any of this because it gets bad. What the [ __ ] is happening? Let's just keep it going. Let's just keep it going. Keep it going. Go to the next one. Green light. Raul Batista is a seasoned bank robber. Oh, here we go. Yes. Always on the hunt for talent, ready to take risks that bring the biggest rewards. I'll be honest, this all just sounds like a GTA game. Yeah. Well, I'm just excited cuz now I mean we're going to get the expanded version of heists, right? We're going to",
            "start": 2610.8
        },
        {
            "text": "bring the biggest rewards. I'll be honest, this all just sounds like a GTA game. Yeah. Well, I'm just excited cuz now I mean we're going to get the expanded version of heists, right? We're going to actually we're going to push this forward even more. I mean, five had the expanded version. Well, even more. I mean, like I don't know. Like, we're going to get a lot more heist in this game. This game, I would say, is going to be majority heists. We're not going to have the three to four heist that we had in GTA V. We're going to have like 10 to 12. Okay, that's fair. I honestly, and we'll we'll read the rest of this and get to this. I think this is going to be even more of an online feature than even than the single player feature cuz heists were the way you did raids in GTA online essentially. Um, and they turn into a big thing for uh for online and I think like having a central person to be like, \"All right, this is your heist guy.\" Oh, is that is that our other main character in the",
            "start": 2646.96
        },
        {
            "text": "Um, and they turn into a big thing for uh for online and I think like having a central person to be like, \"All right, this is your heist guy.\" Oh, is that is that our other main character in the back? I think so. Lucia. Yeah, they're definitely robbing a bank. Rockstar says, quote, \"Raul's re recklessness raises the stakes with every score. Sooner or later, his crew will have to double down or pull their chips from the table.\" End quote. Finally, Brian Heder is a drug runner from the golden age of smuggling in the Keys. But dude, he's gonna have so many Vice City connections. Like he's gonna he's going to reference Tommy Versetti in some way. Like he's going to be like, \"Oh my god, this guy Tommy and I.\" That's good. That's how they do it. Still moving product through his boatyard with his third wife, Lori. Brian's been around long enough to let others do his dirty work. Brian's letting Jason live rentree at one of his properties. Oh, it's like uh JCole and his you know what",
            "start": 2678.72
        },
        {
            "text": "with his third wife, Lori. Brian's been around long enough to let others do his dirty work. Brian's letting Jason live rentree at one of his properties. Oh, it's like uh JCole and his you know what reference. That's a JCole reference. It's a two reference cuz JCole JCole was chilling at Muhammad's crib. Mohamd le. Anyway, so long as he helps with the with local shakedowns and stops by for Lorie Sangria once in a while. We'll definitely be grabbing some cocaine off the coast. He's going to be like, \"Get in that boat, go find the cocaine, then you'll have a plane fly right over your head, drop some bags of coke on the on you.\" It's going to be awesome. That is the full article, y'all. God, they're so hot. That's awesome. They're so hot. That's some great stuff. We also had some other things in there as Kevin was scrolling through. We saw a little national park there, which will be cool to see. You got to think about the Everglades will be present in this. Uh wildlife will be interesting",
            "start": 2719.12
        },
        {
            "text": "in there as Kevin was scrolling through. We saw a little national park there, which will be cool to see. You got to think about the Everglades will be present in this. Uh wildlife will be interesting to see what the wildlife really looks like and how that is. Can you skin and uh sells pelts and stuff or are we just killing these animals for I think we're just killing these animals. Yeah, we're just killing these animals. At a certain point it's like all right now we're playing ATVs. We're getting muddy. They're hunting right there for sure. Deer right there. Oh no. We're going to be able to sell these. You're right. You're right. Actually, I take it back. Yeah. They got kayaking in this game. That's nuts. ATVs. [ __ ] I love the idea that like there's a division at Rockstar that like was the animal hunting division for Red Dead Redemption 2 and they're like, \"You got to give us something to do. We're sitting on our division.\" Oh, we got bikers, too. Biker gang. You got to think",
            "start": 2760.56
        },
        {
            "text": "was the animal hunting division for Red Dead Redemption 2 and they're like, \"You got to give us something to do. We're sitting on our division.\" Oh, we got bikers, too. Biker gang. You got to think fishing mini game. This is going to be sick. No. Is there a fishing mini game? There 100% will be a fishing mini game. You got to remember GTA online. I need things to do to keep you captured in this. You're right. And people are asking for more. Yeah. Anything that you can make into something fun to do with your friends, that's getting it added in the game. Um, Ash X writes in with a super chat and says it's Luca. Emphasis on the C. Ask Kevin. Love you. I feel like I got that. I think I thought you were saying Lucy. I was saying Lucy the whole time. I did ask at the beginning, so that's probably response to that. But I appreciate it. I appreciate it. Um, man, we got a lot of super chats here. We got We got an update on the black hair video because man, the views are incredible. Oh my god.",
            "start": 2795.36
        },
        {
            "text": "response to that. But I appreciate it. I appreciate it. Um, man, we got a lot of super chats here. We got We got an update on the black hair video because man, the views are incredible. Oh my god. Can we scroll back to the girls for the the rap? Go back down. Oh, dude. The last few years. Really great. Look at them. Scroll down to the actual Holy [ __ ] Holy godamn. So good. Jay Colado writes in and says, \"Is the $100 price tag now a justifiable price?\" Well, it's not confirmed. I was like I was going to say you're asking this like we know that this is going to be $100, but yes, it should be. I I I know it will be more than $70. There's no way. Is there over under that it's less that is $70? Like it's not gonna be $70. It's gonna be over 70. I think it's gonna be right now. I think it's gonna be $80. I think it's 100. I don't I don't think that's crazy. Okay. But I'm going to sit on 80 and pray and hope that it's not more than that. I think once you get to 100, like it starts to get",
            "start": 2837.68
        },
        {
            "text": "gonna be $80. I think it's 100. I don't I don't think that's crazy. Okay. But I'm going to sit on 80 and pray and hope that it's not more than that. I think once you get to 100, like it starts to get to the thing of not not the question of will people buy it because people will buy it, but 100 gets to a place where I do think that like you said it cut out some people. Oh, it's got an eel. Some people, but like man, I I don't I don't think it cuts out many at all. Like I I do not I think if GTA 6 came out tomorrow at $100, everybody's like, I don't care. I'm I'm buying it right now. They wouldn't even think twice. Yeah, but like Yeah. Yeah. Sure. Like Yeah. It's We're talking a 78. We're a $30 difference, right? Like I feel like once you get to three figures for a I know, I know, I know, but it's not stopping anything. It starts to get egregious. We don't care. I don't think any Here's the thing. If anybody's going to do it, it's going to be them. Yes. But I also don't think that",
            "start": 2880.16
        },
        {
            "text": "but it's not stopping anything. It starts to get egregious. We don't care. I don't think any Here's the thing. If anybody's going to do it, it's going to be them. Yes. But I also don't think that anybody can pull it off. It will break the video game industry. If anybody if anybody else tries to do $100 after GTA 6 does $100, I think they're in for a rude awakening. Basketball, you know? Like I don't think Assassin's Creed Hexi is going to come out afterwards be like, \"Oh, it's $100.\" is like, \"All right, good luck with your failure.\" Then GTA Online tied to this. Where's GTA Online gone since that own separate app and is it free to play or is the $100 price tag now saying, \"Hey, you will have access onto the online.\" I think the premium version of this comes out later has to include online. Okay. But do you think that we will get to a point where GTA Online when it does come to that launch is its own separate thing and it's free to play or is it No, it's not. I don't think it's free",
            "start": 2929.6
        },
        {
            "text": "Okay. But do you think that we will get to a point where GTA Online when it does come to that launch is its own separate thing and it's free to play or is it No, it's not. I don't think it's free to play. Okay. I think maybe 6 years later, what I think it's going to be, now I'm thinking about it, I think the game launches at 80, the premium edition with GTA online is 100 to 120. Oh, you upcharge to get into online and then it's like a it's like a it's a dual pack game. And maybe it's like So like you're saying they sell GTA online separately? Yes, they sell GTA online separately. I don't think you do that. What if you did sell GTA online? Shark cards or whatever it is. I think shark I That's the thing is I think you sell a $100 version with shark cards. You're thinking here, Roger. What if you do sell GTA online? But it's not even separately. It's like it's a package deal or whatever. It's just a little bit more expensive. It's like a bundle at that deal at that at that price. But I",
            "start": 2965.84
        },
        {
            "text": "if you do sell GTA online? But it's not even separately. It's like it's a package deal or whatever. It's just a little bit more expensive. It's like a bundle at that deal at that at that price. But I think they want anybody who has GTA single player to have online. Like I think they want people to go, \"Oh, I just played 30 hours of GTA 6 single player. I want to play more. Let me hop into the online mode.\" Like I think they want that natural. What if there is some type of like And also think about how many people are buying it just for the online. How many people would just jump in only for the online though? Yeah. to play with their friends and then buy shark cards. That would make up the difference of skipping out of the campaign. Yeah. I mean, they sell GTA online separately, right? They do that for Red Dead, too. They already do it. This is a kind of This is a This is a chat. They for sure do Red Dead Rede Online by itself. I don't know if they do online by itself. I think we got",
            "start": 3004.08
        },
        {
            "text": "do that for Red Dead, too. They already do it. This is a kind of This is a This is a chat. They for sure do Red Dead Rede Online by itself. I don't know if they do online by itself. I think we got to a place where GTA online was somehow like a separate thing, but it I I think this is like 2020 PS5 launch. Like I remember there being a weird thing. But also online, great point, uh, John B and VOD. Online won't be at launch. So, you have time to sell this game if you really want to do GTA 6 80 bucks and then $40 for GTA online or if you have GTA 6 it's $30 or $20 or whatever it is, right? You can sell it both two times. People would come for both of those things because if GTA online GTA 6 online is as expensive expensive as we think it's going to be, that's a no-brainer for every person on this earth. Like if you were able to make your character, work them out, own a house, do all the things that we've always wanted in a GTA, that's like a perfect video game right there with your",
            "start": 3042.0
        },
        {
            "text": "on this earth. Like if you were able to make your character, work them out, own a house, do all the things that we've always wanted in a GTA, that's like a perfect video game right there with your friends. Yeah. Everyone's going. My My thing remains still that GTA the strategy they had with GTA 5, where it is GTA single player and GTA online made that the bestselling video game of all time. I don't think you fix what's broke, what's not broken. I think you just keep with it where it's like, all right, we know how valuable of a package this is. Like you want to talk about people showing up for $100, like Yeah. Like people will do that because they know the val like they know the value of that single player plus that online. I think once you start breaking it up and like doing different things with it like you miss out on the upcharge of oh but now if you buy the most expensive shark card pack it comes with the game and all these things like I think it's it's going to be more of a",
            "start": 3087.12
        },
        {
            "text": "things with it like you miss out on the upcharge of oh but now if you buy the most expensive shark card pack it comes with the game and all these things like I think it's it's going to be more of a strategy of how do we get everybody to buy like one expensive thing as opposed to like splitting up splitting it up in a way that's like not going to mean not going to retain that individual player every every single time. It's interesting. We're 10 years removed from it, right? So, yeah, they've had a lot of time to think about this. The industry has changed a lot now. And I think the catch is is this is Grand Theft Auto. The name with Rockstar is going to sell no matter what they do. But they do have an opportunity to definitely get in the business room and say, \"What can we do? Is there a better way to attract people or can we try something else that might, you know, generate even more money?\" It's going to generate money no matter what. This is going to sell. So, whatever they do will",
            "start": 3124.4
        },
        {
            "text": "way to attract people or can we try something else that might, you know, generate even more money?\" It's going to generate money no matter what. This is going to sell. So, whatever they do will be very interesting. I think what they do is they have GTA 6 come out, right? They're they're going to have some type of trailer or teaser for GTA online before GTA 6 comes out, right? There's no way we don't learn anything. What? Oh, really? You don't think that they speak about GTA Online once before GTA 6 comes out? I don't think you have to. I I don't think I think you do. I think you get an online trailer. I think you get a trailer or teaser. And then guess what? This is the way that they justify the $100 price tag or the $80 price tag. They say GTA online is included. You have GTA 6, you get GTA online. It's both included. We're also going to sell GTA online as a separate product for 20 bucks, 30 bucks, 40 bucks. Yeah, if you have GTA 6, you get GTA online as well. I was thinking no GTA",
            "start": 3165.44
        },
        {
            "text": "GTA online. It's both included. We're also going to sell GTA online as a separate product for 20 bucks, 30 bucks, 40 bucks. Yeah, if you have GTA 6, you get GTA online as well. I was thinking no GTA online until after launch. We get nothing but GTA until the launch and then after I have to talk about it. I think when I look at Rockstar, I look at a company that hasn't changed like in decades as far as like how they operate with this [ __ ] right? Like the rock the the GTA 5 like trailer roll out feel felt similar to the Red Dead 1, Red Dead 2 one, which still feels similar to how they're doing GTA 6 now, right? Like I think probably early 2026 you get one GTA online trailer that is like the last thing to wow us. I think right now we're getting the single player stuff because they know that's what that that's going to get that core audience in and that's going to get everybody in, right? Like everybody's excited for GTA 6 no matter what. I think that last stretch is going to be the hey",
            "start": 3199.84
        },
        {
            "text": "what that that's going to get that core audience in and that's going to get everybody in, right? Like everybody's excited for GTA 6 no matter what. I think that last stretch is going to be the hey here's the online trailer. It comes out a month after GTA 6 and it's already included in the game. Yeah. And so like is it a month or it's like three to four months? I think it's a month. I think it's a month or less. We just wait. Yeah. Yeah. The sooner the better, preferably, right, with the online. Give them one month. Once people are a little tired of GTA. Yeah. Give them Give them one month. Beat the game and like while you're still fiending for more, you got to hit them with it. I don't want to go longer than that for sure. Yeah. There's no way it's free to play. There's no way. Beat online. No, it's not going to be free to play. They don't need to do that. Zero shot. Maybe there's some type of like intro thing for the first month it's free and to get people, but like there's no I",
            "start": 3244.48
        },
        {
            "text": "No, it's not going to be free to play. They don't need to do that. Zero shot. Maybe there's some type of like intro thing for the first month it's free and to get people, but like there's no I don't even think you need to do that. Like you got to think about why people go free to play, right? right? Like you go free to play so you can get an audience so that you can have those like post uh uh like launch transaction those back transactions. They don't need that. They have the player base no matter what. Yeah, they have you get and you get to make 60 you get to make anywhere from 60 to $100 off of every package. They go free to play so there's no barriers though. But there's no barrier already. Like the barrier is technically the mature rating, right? Like I got I got to call Daddy Kevin over here into the room to like technically download it, but I don't think we all know that it's probably not anything like that. But like the freeto play is to get anyone on planet Earth to just hit",
            "start": 3278.08
        },
        {
            "text": "over here into the room to like technically download it, but I don't think we all know that it's probably not anything like that. But like the freeto play is to get anyone on planet Earth to just hit download and now you're in, right? And we all know how GTA online goes. The moment you're in and you see me and Rogers pull up in the coolest sports car, the first thing you're doing is where's the money app? How do I buy that? Right? There is no way that you are not spending $20 on that right away. It happens every time. So yeah, I mean I agree with you. I think they will if it's not broke, don't fix it, right? like it it's working. Everything is perfect. But we also are a decade later, different times, new business strategies. You could do something different. And I don't think anyone would go if they announced, hey, GTA online is free to play, separate app, nobody here is going to go, that's crazy. That's crazy. I'm going insane. We go like, oh yeah, that seems like the typical",
            "start": 3313.76
        },
        {
            "text": "would go if they announced, hey, GTA online is free to play, separate app, nobody here is going to go, that's crazy. That's crazy. I'm going insane. We go like, oh yeah, that seems like the typical marketplace and it's going to go sell gang busters still. I think the, you know, different time, different uh like, you know, business strategy works for every other company. That's not Rockstar. I think it is such a unicorn of a video game where when you look at GTA 6, let's assume it sells 10 million in one day. And that's me being conservative about it. Why do you need free to play? Yeah, you already have 10 million. And also GTA Online in 13 years later is is not even free to play. You know what I mean? It's still you still have to buy it, right? So it's like there's a reason why they haven't even done it now cuz it's so [ __ ] It's never been a barrier for GTA 5 as far as it not being free to play. Like if anything, it's been the opposite where it's sold more copies than anything. Like",
            "start": 3358.0
        },
        {
            "text": "even done it now cuz it's so [ __ ] It's never been a barrier for GTA 5 as far as it not being free to play. Like if anything, it's been the opposite where it's sold more copies than anything. Like I think freeto play is for those companies where that like really benefit from having it be Yeah. having it be no barriers. Like hey, come on in, play Fortnite. Buy the battle of like tell your mom mom to get it. Well, now we know that they've purchased and acquired companies that are in the roleplay space. What if there's premium servers with the super roleplay stuff for a subscription fee? I mean, they already have GTA Plus online. someone pointed out. So, I mean that that's probably gonna be rolled into it or whatever. And I do want to mention, right, like when I'm talking about it not being free to play, I'm not saying that it's not going to have a battle pass and hell of microtransactions. I think I think of course that's going to be it. Like when you want to talk about the business",
            "start": 3397.92
        },
        {
            "text": "free to play, I'm not saying that it's not going to have a battle pass and hell of microtransactions. I think I think of course that's going to be it. Like when you want to talk about the business strategy changing, I think that's where they take inspiration. I think you get Yeah. Like in the way that we talked about the GTA Plus subscription, I think you maybe you see that evolve into a battle pass like concept, right? Like I think you're going to have the collaborations with other brands. Fortnite has set such a strong precedent for that. I'm 1,000% sure Rockstar looks at that stuff and goes, \"Oh, that's a good idea. How do we put Batman in our game?\" Like, how do we tell how do we get um like, you know, companies or corporations to get like their properties in the game? Granted, it's tough because it's GTA mr rated way different for from Fortnite who they can get Cartoon Network characters and all this stuff, right? But like I think there's going to be a I think there's going to be",
            "start": 3437.12
        },
        {
            "text": "because it's GTA mr rated way different for from Fortnite who they can get Cartoon Network characters and all this stuff, right? But like I think there's going to be a I think there's going to be a lot of ways in which they're looking at like the audience that they already have and going, \"All right, how do we make that that money off of that audience? $100. So exciting. $100. Give us some super chats, Bliss. Let's keep the conversation going because it's fun. I mean, let's see here. What a crazy Tuesday to wake up to. It's incredible. After the delay, the delay announcement, I thought for sure I was like, we won't talk about GTA for a while. Yeah. And then Tuesday morning like we're so back. Alex J. Sandival writes in says, I haven't heard anyone ask this question in the wake of the delay. Do we think this means the PC release doesn't come out until 2027 now? Oh [ __ ] Yeah. I guess you don't really think you didn't really think about that one is right. Yeah. Why' you be like you",
            "start": 3474.72
        },
        {
            "text": "Do we think this means the PC release doesn't come out until 2027 now? Oh [ __ ] Yeah. I guess you don't really think you didn't really think about that one is right. Yeah. Why' you be like you didn't think about this? I mean Yeah. I guess what if what if it's delayed now? It's just closer, right? Maybe we don't make Maybe it's only six months now and it's still holding firm to that date, right? March if it's if it's at March the beginning of the year, right? By the end of May and then May. Yeah, it's May. Oh, I thought it was March. So, it comes out in May and then that puts let's say November PC launch. I could see that because that's kind of where we would line up right now if it was going to release this year. True, right? Like the following year. That's a whole year. But it's not released this year. You're right. I GTA 6 is going to be the marathon, not the sprint. So yeah, I could see it being 2027. Everything gets pushed. Everything gets pushed. I could see it being 2028. And",
            "start": 3510.56
        },
        {
            "text": "this year. You're right. I GTA 6 is going to be the marathon, not the sprint. So yeah, I could see it being 2027. Everything gets pushed. Everything gets pushed. I could see it being 2028. And the way that Mike, you're talking about private servers and charging for that stuff. That strikes me as more of a feature that maybe the PC audience might be more into. And you want to be you want to make sure you have it all there as soon as possible. Right. striking while the iron's hot. GTA is a little bit different because like there's going to be very long legs and you can you can put things in there different play styles and servers and stuff that people will pay for longer uh later on. But if you can do that day one, the sooner the better, right? Because then you instill, hey, we're charging for premium rockstar servers or hey, do you and your friends have hundreds of people you want to invite and you want to make your own little small business like we've seen with GTA role playing? You",
            "start": 3551.44
        },
        {
            "text": "for premium rockstar servers or hey, do you and your friends have hundreds of people you want to invite and you want to make your own little small business like we've seen with GTA role playing? You pay us $20 a month. you can go get, you know, your friends in here and have the ultimate experience. Sorry, I was just going to talk about the PC and the P the console of it all. Like maybe it is I think it is going to be a year after. Not because uh I think it's just because you're going to want to have get as many people as possible that have consoles and PCs. There's a lot of people out there that have both a competent PC and a competent and and a PlayStation 5 to buy it on PlayStation 5 and wait enough time to be like, \"Oh [ __ ] I want to buy on PC.\" You know what I mean? Like you just you just need that time. You just need that time and you need a year. I think like within that if it's with any time other than that you might just it's going to do amazing. Of course it's the biggest",
            "start": 3590.0
        },
        {
            "text": "just need that time. You just need that time and you need a year. I think like within that if it's with any time other than that you might just it's going to do amazing. Of course it's the biggest game ever but still you want to get as much as possible. Like I mean if Rockstar is anything they're business savvy and so I I I think there I think that is a reason. I also think it's just the fact of we're talking about a game that just got delayed out of this year to May 26th. I don't think Rockstar even though they've taken forever on this video game. I don't think they have the luxury of like let's launch everything perfectly the way we want to on day one. Like I think it's going to be that step by step. All right, day one is the launch on consoles. All right, day 30. We're gonna do online. It's gonna struggle for a bit. We got to pack the online. Oh, dude, that was two weeks of hell. It's gonna be that again. Creating a character character is deleted. Doing the first race. I think for",
            "start": 3626.88
        },
        {
            "text": "It's gonna struggle for a bit. We got to pack the online. Oh, dude, that was two weeks of hell. It's gonna be that again. Creating a character character is deleted. Doing the first race. I think for sure it's going to be deleted. Yeah, that was crazy. I I'll do the pizza bet. I'm crazy. I think this is We're going to look at this and we're going to be like this is not flawless, but it's going to be like Halo Infinite where like we're like, \"Oh [ __ ] this just works. What the fuck?\" You know what I Like, remember when that just came out? Just hit the pizza bet music. Hit the pizza music. This [ __ ] ain't working. Day one. Well, what is that? What do we We're going to keep trying to do a game story, a game a headline that says GTA online disaster. Yes. 1,000%. Okay, that's good. Hell yeah. [ __ ] yeah. I fet even on pizzas now cuz I don't believe in the first one. You also owe me pizza because Barrett owed you pizza or something like that. And then I owed me a pizza and then you owe",
            "start": 3662.08
        },
        {
            "text": "[ __ ] yeah. I fet even on pizzas now cuz I don't believe in the first one. You also owe me pizza because Barrett owed you pizza or something like that. And then I owed me a pizza and then you owe me. So, I got to get you a pizza. Um, all right. Let's do one more super chat. We're going a little bit late on this, but I'm having a fun time hanging out all day. Bless. Let's get crazy with it, man. There's a lot of good super chats. Lot rate a couple. Just go rapid fire. Let's have some fun. Uh, a lot of people are writing in about um like Bungie and Destiny. Okay. Talk about that tomorrow. I'm Yeah, we can talk about that tomorrow or unless Mike there's a quick news item that we're able to find on line or something because I know there's a whole Destiny thing happening today. Yeah, there's a Destiny reveal going on right now. I told Bless I was like, I'm pretty sure you and Andy will speak about this tomorrow because it was kind of happening while we were prepping games daily. So yeah,",
            "start": 3701.52
        },
        {
            "text": "a Destiny reveal going on right now. I told Bless I was like, I'm pretty sure you and Andy will speak about this tomorrow because it was kind of happening while we were prepping games daily. So yeah, how about this? Tomorrow you will get Destiny with Blessing and Andy. Uh Andy is their destiny guy here, so he'll talk about that. Cooking with Vinnie writes in says, \"Born and raised Miami in here.\" Every sing every single frame was accurate to how it is here. Yes. At time I couldn't tell what was real and what wasn't. I love I saw a bunch of people flaming that person in the chat be like, \"That's not true.\" I was going to say I was like, I got to move to Miami, but also maybe not. No, cuz it seems like chaos there. Y'all live in living living in Gotham. That's crazy. Um, oh man, there's so much here. Let's see. Oh, we talked about 2027 for lube now. That's why I got Yeah, get some treadmill lube. Uh, Sleep Lyric says, \"Mike getting excited about the animals is so wholesome.\" Same here.",
            "start": 3739.04
        },
        {
            "text": "much here. Let's see. Oh, we talked about 2027 for lube now. That's why I got Yeah, get some treadmill lube. Uh, Sleep Lyric says, \"Mike getting excited about the animals is so wholesome.\" Same here. I am so pumped to explore outside the city setting. Dude, there's going to be moments where you're going to pull into a neighborhood. So, like, if you've ever been to Florida, you've seen it before. Like, we're going to have Miami Beach, which is nice, right? We're going to get the Everglades, which is going to be your wild area that you're going to be out on the jet or the fan boats. But there are neighborhoods that are nestled right by the like the water of the lakes and the rivers and they kind of have like small little canals through them. You're going to see some lady walking her dog alligator come up. [ __ ] grab a hold of that dog. It's going to be wild. She'll be scraping, you'll be tick- tocking it. And then Yeah. And then Roger in his game, he pulls up the the in-game Tik Tok",
            "start": 3774.76
        },
        {
            "text": "come up. [ __ ] grab a hold of that dog. It's going to be wild. She'll be scraping, you'll be tick- tocking it. And then Yeah. And then Roger in his game, he pulls up the the in-game Tik Tok and he sees it. Mike always speaks like he he's a prophet, like he's seen the future and he's explaining it. That's going to happen. That that will 100% happen. Golly. Um I mean, speaking of being from Florida, Stake Stakes animation writes in and says, \"As someone from Florida, Jason definitely looks like someone who would scream a slur at you as he speeds away in his lifted and his lifted F-150. They nailed the accuracy. I've never believed more that Jason is a cop. Like you are 1,000% correct that he is an undercover cop. Yeah. And in the first trailer there's like a first person viewpoint of like a body cam or whatever. I'm like a [ __ ] You know what I mean? So cool. A [ __ ] man. He's so hot though. You know what I mean? Like he was pumping that iron on the beach. God, he really was. He",
            "start": 3813.52
        },
        {
            "text": "a body cam or whatever. I'm like a [ __ ] You know what I mean? So cool. A [ __ ] man. He's so hot though. You know what I mean? Like he was pumping that iron on the beach. God, he really was. He really was. All right, I'm going to cut it there. Super hot. Um Oh, man. GTA 6 when it comes out. It's going to be such a big game, guys. It's going to be huge. It's going to be gigantic. It's going to be large. But if I wanted something smaller, say the tiniest news I need to know about. Where would I go, Roger? You go to our last story, the Wii News Channel, where we cover all the small news items you need to know about. Story number two is Wii News. Let's start with a press release. Uh Steven Tetr, a prominent French Canadian entrepreneur and longtime leader in the collectibles and entertainment space, has officially acquired Electronics Boutique Canada, also known as GameStop Canada from GameStop Holdings, uh GameStop Global Holdings. Yeah. Okay. All right, dude. Yeah. Hey, you know, I",
            "start": 3860.24
        },
        {
            "text": "space, has officially acquired Electronics Boutique Canada, also known as GameStop Canada from GameStop Holdings, uh GameStop Global Holdings. Yeah. Okay. All right, dude. Yeah. Hey, you know, I went to a GameStop uh this weekend, and it's one of those I I love those. I will always love going into a game store, whether it be a mom and pop or the GameStops, because it's just special to me, seeing all the games on the wall. I love that they've got a bunch of collectibles. It's dying. Like, this is great. Breaking news. An Elden Ring movie is rumored to be in the works at 8:24 with Alex Garland set to direct. Holy [ __ ] Alex Garland, it turned back on him. What a [ __ ] [ __ ] that might have to be headline tomorrow. That could Alex Garland, I was literally on the [ __ ] video game movie podcast with with Andy and I was like, \"Bro, Alex Garland needs to direct a Gears of War movie and holy [ __ ] what the [ __ ] What the [ __ ] What does that look like? Alex Gard making an Elder Ring.",
            "start": 3901.6
        },
        {
            "text": "with with Andy and I was like, \"Bro, Alex Garland needs to direct a Gears of War movie and holy [ __ ] what the [ __ ] What the [ __ ] What does that look like? Alex Gard making an Elder Ring. Alex Garland's the goat.\" Of course, for those who don't know, he did X Machina, but also did uh Civil War recently. Uh Annihilation, which Annihilation, good ass film. Uh 28 uh years later he did that movie Men. Remember Men? Men? I never watched that. I saw the trailers so I looked into this is rumored. This is rumored. Rumored. Disgusting film is tweeting it though. So it's like But is it discussing film or is it disgusting? It's disgusting film. It's disgusting. How many S's? It's disgusting film. It's got 2.1 million followers. Are they verified? I guess that doesn't mean anything. That doesn't mean anything. 2.1 million. You know, it's rumored though. Rumored though. We'll see. But [ __ ] up. How cool that crazy. I don't know how that work. Well, you'll talk about it more later. We'll talk",
            "start": 3948.8
        },
        {
            "text": "mean anything. 2.1 million. You know, it's rumored though. Rumored though. We'll see. But [ __ ] up. How cool that crazy. I don't know how that work. Well, you'll talk about it more later. We'll talk about it. Yeah, let's talk about it later. That's another good Andy story. Um, man, Mike, you're talking about going to GameStop, giving them money even though they they [ __ ] over game form. How you feel about that, Mike? What you doing? What you doing at GameStop? Well, I didn't give them money, but I did film in front of them for about 4 hours. Oh, yeah. I did. I stood outside for a while. Uh, this, Dude, when I was pre-ordering my uh Switch to I shouldn't say this cuz people are getting mad, but like I was like on I was on all all the websites, all three of the websites that you can be on, right? I'm like panicking. Yeah. I'm like trying to like get it in my Target cart and then somebody's like like aren't we not buying things from Target? And I was like ah my bad. I'll go to",
            "start": 3989.2
        },
        {
            "text": "be on, right? I'm like panicking. Yeah. I'm like trying to like get it in my Target cart and then somebody's like like aren't we not buying things from Target? And I was like ah my bad. I'll go to GameStop. What am I supposed to do? They sell them on two places on my I'm at I'm at my wit's end trying to get a Switch 2 and I still didn't get one to go from Noble. Sony China has acquired the remaining 51% stake of their joint venture with Oriental Pearl. Uh Sony now owns the full hardware distribution of PlayStation in China. Uh, this next one is from IGN. Elden Ring is headed for the Switch 2 with its tarnished edition, and it looks like From Software's Massive Adventure will have a few new bonuses in tow, including new classes and appearances for Torment. The two classes are, as translated by RPG site, the Knight of Ides and Heavy Armored Knight. We don't have many details u outside of name and look. Uh these two sets will reportedly be the will reportedly be two of four new armors in",
            "start": 4024.0
        },
        {
            "text": "by RPG site, the Knight of Ides and Heavy Armored Knight. We don't have many details u outside of name and look. Uh these two sets will reportedly be the will reportedly be two of four new armors in the tarnished edition uh with the other two available uh to obtain in game. Moving on. Nothing like a Ganondorf for a Link look on those. I hope not. You know what I mean? Like do you remember like when they did Diablo? I think they had the look of those on Switch. Um I'd like that. You don't like the tiein like that? You don't want them to have fun. I think tie-ins work for some games, but like for other like an Elder Ring Nintendo tie-in just feels weird to me. Okay. You know what I mean? Like running around as [ __ ] Mario. No. Yeah. Samus is slaying Godric. Doesn't make sense to me. Cool. You know, save that for Hitman. Be a cool look. Let me walk around as a hitman and dress up as Luigi. That's pretty sick. Come on, dude. That' be sick. They show I mean, they showed it in the trailer.",
            "start": 4066.16
        },
        {
            "text": "know, save that for Hitman. Be a cool look. Let me walk around as a hitman and dress up as Luigi. That's pretty sick. Come on, dude. That' be sick. They show I mean, they showed it in the trailer. Oh, really? They showed in the trailer. That's not me. Clear obscure expedition 33 has sold over 2 million copies. Let's welcome them. The uh Bubsy in the Perfect Collection list of games have been announced. You got Bubsy 2, Bubsy 3D, Bubsy and Claus Encounters of the Furred Kind, and Bubsy and Fractured Furry Tales. Dan, do you think that the Bubsy fans like there's some type of outrage here? Like, is there something missing? I mean, where's Bubsy one? Oh, [ __ ] Where's Bubsy one? Where is the Bubsy that started it all? Yeah. Hate to see it. And then finally, new Xbox Game Pass games for May have been announced. On May 7th, you're getting Dragon Ball Xenoverse 2. On the eighth, you're getting Revenge of the Savage Planet and TMNT Mutants Unleashed. On the 13th, you're getting Warhammer",
            "start": 4113.92
        },
        {
            "text": "have been announced. On May 7th, you're getting Dragon Ball Xenoverse 2. On the eighth, you're getting Revenge of the Savage Planet and TMNT Mutants Unleashed. On the 13th, you're getting Warhammer Verment Tide 2. On the 15th, you're getting Doom: The Dark Ages. On the 16th, you're getting Koolabra and the Souls of Limbo. On the 20th, you're getting firefighting simulator and Pig Simulator patrol officers. [ __ ] yes. Ain't no way. [ __ ] yeah, dude. And then for standard game pass, you're getting Flint lock, The Siege of Dawn. Remember Flintlock? You're getting Dungeons of Hterberg. Remember Dungeonsburg? And you're getting Metal Slug Tactics. Metal Slug Tactics. There's no way that's out. It's been out for a long time. What about the war? Wasn't there wasn't No, that's Advanced Wars. You're thinking about Advanced Wars. That also came out, which is No way. Yeah. Came out. I mean, we'll have to talk about it at the end of the year, but this [ __ ] this Game Pass lineup that started",
            "start": 4153.36
        },
        {
            "text": "thinking about Advanced Wars. That also came out, which is No way. Yeah. Came out. I mean, we'll have to talk about it at the end of the year, but this [ __ ] this Game Pass lineup that started off this year has been redhot. It's been good. Game Pass has been firing off. You You Pig Simulator really does it for you? Uh, firefighter Simulator does it though. It is when I was [ __ ] EMT paramedic sim simulator, dude. I was rolling up to disaster scene, saving lives, bro. It's crazy. Hell yeah. I love that for you. And that is it for we news. Before we get out of here, let's hop into kind of Oh, backbone. Backbone. Backbone. We'll talk about that tomorrow. I'm sure we'll get one, right? We won't talk about it. Talk unless Yeah, unless we get it. We might get it. That's a good point. Okay, we're games. Uh, you're wrong. People write in and let us know what we got wrong as we got wrong so we can correct it for those watching later on YouTube and listening later on podcast services around",
            "start": 4189.84
        },
        {
            "text": "games. Uh, you're wrong. People write in and let us know what we got wrong as we got wrong so we can correct it for those watching later on YouTube and listening later on podcast services around the globe. Snake 5K6 says, \"I don't think Genkai is pronounced Genkai.\" You don't think I need you to come to me with facts. You can't think, you got to know. You got to When it comes to you're wrong, you got to know. You got to know. I also think you're right. But Okay. Okay. Why? Well, I think you're wrong. There you go. We got to take sides. Yeah. Um, more people saying that it's pronounced Lucia. Uh, what were you saying? Yeah, but I asked. Okay. Ask because I don't know at what point they wrote that in. Yeah. Okay. Um, Ber says, \"Bubsy one is in the collection. Is the claws encounter of the furred kind one?\" That Yeah, I did look it up. That's the long name. Yeah. Um, oh, and then Mr. Jantics writes in, it says, \"About the current GTA online via the Wikipedia page. A standalone version of",
            "start": 4232.56
        },
        {
            "text": "kind one?\" That Yeah, I did look it up. That's the long name. Yeah. Um, oh, and then Mr. Jantics writes in, it says, \"About the current GTA online via the Wikipedia page. A standalone version of GTA Online was released alongside the enhanced version of GTA V for PS5 and Xbox Series X on March 2022. It was released for $20. That makes sense. Took them a long time. That's what I'm saying. It's like I don't think you're going to get a freetoplay GTA 6 online for like the first eight years of that game being out. I think eventually you might. You might get it. You might. It'll be fun in a year from now. We'll probably be talking about it. I think I got one more as I close the page. There we go. Cheese wombat pronounced genki. Genki. Genki. What' you say? And what is that for? Genkai. G N Ki is like their thing. And that is it for countfind.com/ityou wrong. Of course, Mike, Roger, thank you both for joining me on this special episode. Thank you, Bless, for having us. You guys have a good",
            "start": 4282.88
        },
        {
            "text": "is like their thing. And that is it for countfind.com/ityou wrong. Of course, Mike, Roger, thank you both for joining me on this special episode. Thank you, Bless, for having us. You guys have a good time. Oh, yeah. I hope you both had a good time. Had a great time. I had a really good time. I love the little threeman uh kind of funny games daily. And we're going to run it right back for games cast. We're not really going to [ __ ] We are. Of course. This has been kind of funny games daily. Each and every weekday we run you through the nerdy news you need to know about live on YouTube, Twitch and on podcast services around the globe. If you love what we do, support us with the kind of funny membership on Patreon or YouTube to get all of our shows ad free. Watch us record them live and get a daily exclusive show. Enjoy the games cast next and everything after. But until next time, game daily.",
            "start": 4328.48
        }
    ]
}