{
    "id": 14167,
    "video_id": "QLi0t2lwkfI",
    "show_name": "Highlights",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "This Episode Was a Disaster",
    "description": "From KFGD: https://www.youtube.com/watch?v=Lsw52pAcC9E \n\nGo to https://mood.com and use code KINDAFUNNY to get 20% off your first order.\n\n\nFOLLOW US ON EVERYWHERE!\n---------------------------------------------------  \nYouTube: Youtube.com/KindaFunnyGames\nTwitch: https://www.twitch.tv/kindafunnygames\nPatreon: https://www.patreon.com/kindafunny/\nTwitter: https://twitter.com/KindaFunnyVids\nInstagram: https://www.instagram.com/kindafunnyvids/\nTikTok:  https://www.tiktok.com/@kindafunnygames?lang=en",
    "published_at": 1748631625,
    "duration": 1004,
    "transcript_chunks": [
        {
            "text": "Uh, story number two, Pokemon Scarlet and Violet update for Switch 2 detailed via Nintendo, which this being a new story a bit of a stretch. All right, cuz I I liked it. I liked it. Here's my thing. I saw uh Wario uh 64 tweet this. Yeah, Kevin, there's a link there if you want to throw it out. I thought it was bizarre because it was a link to the Nintendo Japan website with the same screenshots that we've already been seeing for Pokemon Scarlet and Violet's updates for Switch 2, which by the way, a funny thing about these is these screenshots aren't even in 4K. They're like, there's nowhere on the internet that I have found at least that these screenshots are actually showing what the advancements are. So, it's like, okay, cool. So, I was like, oh, we're actually going to get some more detailed information. So I go to this website and it my phone's like, \"Do you want to [ __ ] translate?\" I'm like, \"Yeah.\" And then it does that thing where it translates every other word. You know what",
            "start": 0.16
        },
        {
            "text": "information. So I go to this website and it my phone's like, \"Do you want to [ __ ] translate?\" I'm like, \"Yeah.\" And then it does that thing where it translates every other word. You know what I mean? And I'm like, \"All right. So what do we So let me read this for you.\" This Yeah. So if you want to click through, Kevin, it'll do the exact thing Kev Tim's talking about that I did where Yeah. It's all in Japanese, then Google translate it, and then it's about Pokemon Zah, which we talked about yesterday. Amazing art there. Can't wait to review it. I don't know if you saw the subreddit thread. People are behind me reviewing it to him. No big deal. Just telling you what the people want. And I will I will rough up Mario. Uh, thank you, Kevin. Look at this gorgeous art. And you scroll to the very very very very very very very very bottom. Trenton Williams in the chat. Tim doesn't consider this big news. Not sure if I want him reviewing Pokemon this year. Get his ass. And there you go.",
            "start": 45.6
        },
        {
            "text": "very very very very very very very very bottom. Trenton Williams in the chat. Tim doesn't consider this big news. Not sure if I want him reviewing Pokemon this year. Get his ass. And there you go. These are the details right there. Well, now there it is. Keep stop right there. That one paragraph. That's it. Tim, take it away. We got the news, everybody. You can now see Pokemon from further away, making them look even more vivid. With improved frame rates and other features, the movement smoother, allowing you to enjoy your adventure comfortably. So, be sure to update and experience the world of Pokemon on the Nintendo Switch 2 before anyone else. Now, there's one word here that sends me and it is comfortably like the fact that they are admitting to the experience of playing. Yo, we knew this was like glass in your eyes before that a game that sold what was it 20 something million copies. Last I checked, I think this is the second highest selling Pokemon game ever. And like by the end",
            "start": 76.16
        },
        {
            "text": "was like glass in your eyes before that a game that sold what was it 20 something million copies. Last I checked, I think this is the second highest selling Pokemon game ever. And like by the end of it it's probably going to be number one. Somebody fact check me on that. I didn't even know where I'm at with that. Kind of funny.com/ wrong or is chat live. But like what they're talking about, oh now you can now you can play it comfortably. Be one of the first to do that with higher frame rates. The Pokemon are they move smooth. I can't wait. Real talk. I [ __ ] can't wait. I can't wait to see this. I hope that it works. And I also think it's going to. I really do think there's no saving the visuals of this game. Like it looks like it looks right. Yeah. But if it looks sharp and smooth and runs, I mean, it's not going to hurt your eyes. It's going to be comfortable. I'm going to be so much happier. Um, and especially like we'll see what the frame rates and stuff are on handheld. Like,",
            "start": 121.44
        },
        {
            "text": "runs, I mean, it's not going to hurt your eyes. It's going to be comfortable. I'm going to be so much happier. Um, and especially like we'll see what the frame rates and stuff are on handheld. Like, can it how much can it go beyond 60? Am I getting crazy here? Yeah, I don't know. As somebody again who I am chomping at the bit for more of this, more Pokemon, you know what I mean? God only knows. I can't wait for Zah. You know what I mean? Especially when I review it. Uh, but to finish this, to go to the endgame, to do the DLC, I'm stoked about it. I Here's You want to know my problem with the Nintendo Switch 2 is that as somebody who didn't play a lot of Nintendo Switch one to completion, I have the Melissa Joan Hart pancake meme going on. Kevin, thank you for the picture and picture. I have the Melissa Jon Hart pancake meme going on where it's like, yeah, I want to play Mario Kart World, too. World, of course. Period. I love Mario Kart, right? Ben loves Mario Kart. But then when I'm",
            "start": 164.16
        },
        {
            "text": "the Melissa Jon Hart pancake meme going on where it's like, yeah, I want to play Mario Kart World, too. World, of course. Period. I love Mario Kart, right? Ben loves Mario Kart. But then when I'm not in the mood for Mario Kart, am I finishing Pokemon? M. I do in my new Tears of the Kingdom playthrough. Am I playing uh Link's Awakening? There's too much to play right now. Am I going back to Ultimate Alliance because that seemed like a lot of fun when me and Ben played it. It's so funny cuz like you've been saying a lot of this. We've been talking a lot about the Switch one and then now the Switch 2 and all this stuff. In the last couple weeks, you've been saying a lot of things that when you say them to me, it boils my blood. Like it just really really upsets me. But then I settle and to the best of my ability before I actually get mad, I'm like, you know what? This is a good thing. This you're going to experience all these great games in an even better fashion. And who is this? The",
            "start": 201.44
        },
        {
            "text": "the best of my ability before I actually get mad, I'm like, you know what? This is a good thing. This you're going to experience all these great games in an even better fashion. And who is this? The king of old game is old. You know what I mean? Well, old games old. I mean, I've played it before. Yeah. Have I played it before? Uh-huh. Uh-huh. There's still juice here. You know what I mean? Haven't you played Links Awakening the original? No, never did. The Game Boy one? No. Okay. No, I mean my Ocarina of Time starts my Zelda journey. Okay. Yeah. Well, I mean, you're you're about to play a whole bunch of great games. Yeah, we'll see. I mean, that's the Yeah, that is the thing. But I do love that instead of trying to play the new stuff, like I don't even know what is new necessarily. You're going to play your Mario Kart. Yeah. And you know, I'm gonna play Mario Kart. Yeah. But then I'll be right into it. I'll be your expert. Boning up for my Zah review. Boning up. I'm boning up my Zah",
            "start": 240.64
        },
        {
            "text": "going to play your Mario Kart. Yeah. And you know, I'm gonna play Mario Kart. Yeah. But then I'll be right into it. I'll be your expert. Boning up for my Zah review. Boning up. I'm boning up my Zah review. God, websites suck. All of them. I just went to one to try to find the the information for this Pokemon sales and there's one that was called like Statisfy and I'm like, this is going to get me the stats that I need. I'll be satisfied with them. No. I get there. It's like, you need a [ __ ] Satisfy unlimited account. I'm like, no, I'm not going to do that. And now I'm now I'm at GameSpot. GameSpot? You should be embarrassed of yourselves. Wow. What is this? What the [ __ ] Oh, where they do the articles that run into each other on top of each other. They run into each other and then like embedded videos that aren't It's just This looks like [ __ ] These ads. What are we talking about? Figure your life out, GameSpot. Yeah. God damn. I blame Tim. I can't even get the information I'm",
            "start": 274.24
        },
        {
            "text": "embedded videos that aren't It's just This looks like [ __ ] These ads. What are we talking about? Figure your life out, GameSpot. Yeah. God damn. I blame Tim. I can't even get the information I'm looking for. Okay, Tim. Now I'm getting angry. I was going to get angry at you, but now I'm getting angry at [ __ ] the spot. Damn. Remember Cool Spot? I'll never forget Cool Spot. Obsessed with that, man. The way people have been so adamant about bringing back long dormant franchises and things like, you know, Sneak King and stuff. I'm shocked we've never gotten a new Cool Spot. Who owns Seven Up right now? Is it Coca-Cola? No. Is Seven Up an Independ Dr. Pepper are homies. They're part of the same thing. It's owned by Kurig. Kurig. Seven Up is I don't want to live anymore. The brand and formula are owned by Kurig. Dr. Pepper cuz Kurig I guess merged with Dr. Pepper and internationally it's distributed by PepsiCo. Yeah. Mist is Pepsi. Get me seven up on the line. We're not even Sierra Mist",
            "start": 316.56
        },
        {
            "text": "are owned by Kurig. Dr. Pepper cuz Kurig I guess merged with Dr. Pepper and internationally it's distributed by PepsiCo. Yeah. Mist is Pepsi. Get me seven up on the line. We're not even Sierra Mist doesn't even exist anymore. Did you know that Sier got rebranded? Look at that guy. Nothing has ever been cooler. Nothing. We have Cool Spot and we have Chester freaking Cheetah, dude. Yeah, those two guys. Cool dudes. Pinnacle of cool. What's the commonality? No pants, sunglasses. Shoes. White shoes. I'm going to go Everybody knows I'm big on LinkedIn. I'm going to go to I'm not wearing white shoes. [ __ ] I'm gonna find the Who's the in charge? Key people right now is CEO Tim Coffer. We're going to we're going to get him on LinkedIn and we're going to start the movement. Everybody, not this picture, Kevin. Oh, not that one. I thought he was drinking. Snorting Cheetos is not cool, everybody. I found Tim Coffer. Great. Star is the new name for Sier. I'm going to connect. Send a note. Hey,",
            "start": 367.28
        },
        {
            "text": "picture, Kevin. Oh, not that one. I thought he was drinking. Snorting Cheetos is not cool, everybody. I found Tim Coffer. Great. Star is the new name for Sier. I'm going to connect. Send a note. Hey, Tim. Yes. No, no, I'm talking. I'm I'm drafting my thing. Hey, Tim. Mhm. I'm Greg Miller. [Laughter] Great start. You know what? Go to ads and I will draft this message everybody. Everyone, we'll be right back. Here's a word from our sponsors. This episode's brought to you by Mood. Let me tell you about the online cannabis company that's revolutionizing how we deal with life's challenges. From sleepless nights to stressfilled days, Mood.com has created an entire line of functional gummies that target specific health concerns with 100% federally legal THC blends. They'll deliver them discreetly right to your doorstep. And you can get 20% off your first order at mood.com with promo code kind of funny. I've been having a great time trying out their different gummies and am loving how each",
            "start": 416.08
        },
        {
            "text": "right to your doorstep. And you can get 20% off your first order at mood.com with promo code kind of funny. I've been having a great time trying out their different gummies and am loving how each one feels. Their Sleepy Time gummies will knock you out in about 15 minutes flat. No hangovers, no groggginess. Not only does Mood stand behind everything with an industry-leading 100day satisfaction guarantee, but as I mentioned, listeners get 20% off their first order with code kind of funny. So, head to mood.com, browse their amazing selection of functional gummies, and find the perfect gummy for whatever you are dealing with. And please remember to use promo code kind of funny at checkout to save 20% on your first order. Again, that's mood.com promo code kind of funny for 20% off. Is the email drafted? Well, it's not an email. Remember LinkedIn? I'm sending my connection with a note. Mhm. And it reads like this. Hey Tim, I'm Greg Miller, game award-winning owner of an online media company",
            "start": 474.56
        },
        {
            "text": "drafted? Well, it's not an email. Remember LinkedIn? I'm sending my connection with a note. Mhm. And it reads like this. Hey Tim, I'm Greg Miller, game award-winning owner of an online media company note is kind of funny. I'd love to connect and talk about bringing back the Cool Spot video game. Thanks. And that I that's only 183 of the 200 characters I have used. You should clarify that you don't have the ability to make games. No. Okay. That's super information. So, we're going to send it. And now here, this is one of our traditional problems that kind of funny. Mhm. Have I just kicked the snowball into the gutter or have I kicked the snowball down a mountain where pretty soon I'm going to be on the phone with the chief executive offer of chief the CEO of Kurig, Dr. Pepper and I'm going to have to have a pitch for what we're doing here cuz I can team him up with you know who. Oh no. I was Okay. Hold on. Move on to the next story. I'll make some moves over here. I like I think I like",
            "start": 526.32
        },
        {
            "text": "to have to have a pitch for what we're doing here cuz I can team him up with you know who. Oh no. I was Okay. Hold on. Move on to the next story. I'll make some moves over here. I like I think I like where your head's at. Real quick, I need to let you know something, Greg. Yeah. John Melany fought three teenage that happened. How was it? He fought him. He fought him and he fought him. Three hims, one Melany. Okay. All right. I don't want to spoil. Sure. What happened? I will spoil what happened immediately after. As soon as the fight ended arrested, the entirety of Bones Hug Bone Thugs and Harmony came out and performed. Amazing. I [ __ ] love Everybody's Live with John. Was it worth me watching? Should I watch it? No. Okay. But I mean, yes. Please watch it so it gets to season two. Please. Okay. Everybody, please watch Everybody's Live with John Malany on Netflix. What are we doing here? Uh, I think it's fun. We never really truly made fun of Nintendo enough or like that that being",
            "start": 571.6
        },
        {
            "text": "Okay. Everybody, please watch Everybody's Live with John Malany on Netflix. What are we doing here? Uh, I think it's fun. We never really truly made fun of Nintendo enough or like that that being the update, but yeah, that was where we were at with that. Yeah, I really ah man. Um, let's get to story number three. Another Persona 4 actor isn't returning to the as yet unannounced Persona 4 remake. Uh, this comes from Jordan Midler at VGC. On Wednesday, actor Yuri Lowenthal announced that he won't be part of the long rumored remake. Has it been long rumored or is it just kind of like eh? Coming for a long time. Yeah. Yeah. Yeah. So, it's been a rumor on that way. Yeah. And then Yuri, you know, said this and then Aaron says this. Despite his desire to repraise his role as uh Yoska Hanamura, Yoske. Yoske. Uh in a post on Blue Sky, Loenthal wrote, \"And for those who keep asking, no, I will not be returning as Yoske for the Persona 4 remake. I asked, maybe I even begged, but they don't want",
            "start": 614.0
        },
        {
            "text": "Yoske. Uh in a post on Blue Sky, Loenthal wrote, \"And for those who keep asking, no, I will not be returning as Yoske for the Persona 4 remake. I asked, maybe I even begged, but they don't want me to come back.\" Now, a second actor this time, Aaron Fitzgerald has claimed that she also won't be part of the game. For those asking, \"I have not been asked to repraise my role as Chia in the Persona 4 remake.\" Fitzgerald wrote on Blue Sky, \"RIP, I'm blessed to have recorded as many Persona 4 games as I did playing her. Neither Sega nor Atlas has adowed a remake of Persona 4, but reports have persisted for some time that I'm so sorry that what is currently in development. The last Atlas remake, Persona 3 Reload, was released in 2024 where it was met with critical and fanic claim. This is one of those ones that I'm going to regret. But I have to tell you, okay, Craig, I'm reading this now a second actor and you know, it reminds me of some things. It reminds me of things that Greg Miller talks",
            "start": 664.64
        },
        {
            "text": "ones that I'm going to regret. But I have to tell you, okay, Craig, I'm reading this now a second actor and you know, it reminds me of some things. It reminds me of things that Greg Miller talks about way too much. I need you to know that this morning I was on TikTok. And there was a high school cheerleading competition that came up and the clip the audio is George Bush talking about the September 11th attacks and these [ __ ] kids the cheerleaders. Wait, this is like not they didn't match this up. The cheer routine was George Bush was like there was like there was like emotional music playing and like it was George Bush talking about what happened and the kids the cheerleaders are like creating towers. No. and creating airplanes and you hear the audience like guys no what are we doing here and oh my god I was watching it and I was just like I what is [ __ ] happening and Greg the only reason I bring any of this up I'm not saying I think it's funny what I think is funny is how much it",
            "start": 711.2
        },
        {
            "text": "and oh my god I was watching it and I was just like I what is [ __ ] happening and Greg the only reason I bring any of this up I'm not saying I think it's funny what I think is funny is how much it makes me think of you sure that's fair that's fair like that's [ __ ] up man you're a good guy but you're a bad guy and listen someone's got to be the face of 911 and if it's Greg Miller it's Greg Miller It's not too late to not be the face of it. Never forget. [ __ ] man. All right. Um, getting back on track here. So, what do you take on this? Persona 4 seems to be happening. Yeah, it seems to be happening and I'm surprised to see uh the voice actors biting on it as much. You know what I mean? Like, this is this hearkens back to a a longgone day, I would think. Right. I remember Eric Leaden, voice of Cole in Infamous 2, right? And I remember when he got baited by fans into confirming he was in PlayStation Allstars Battle Royale and that Solid Snake was in it when none or you know it was",
            "start": 770.24
        },
        {
            "text": "voice of Cole in Infamous 2, right? And I remember when he got baited by fans into confirming he was in PlayStation Allstars Battle Royale and that Solid Snake was in it when none or you know it was like and I nobody knew any of this information and he was responding to a tweet as if it was thing and I had a DM like that's not public. Take it down. He took it down. It's the same thing here where it's like oh man like I'm it's interesting to see Yuri of course Spider-Man a million other roles uh fall for it. Enough fans are saying it that you believe it's true. And now granted these are all humans that have day jobs in families and lives. They're not following video game news. It's very similar to uh Kevin Conroy, right? When he got baited into confirming Arkham Knight when they they were asking about Arkham Origins and he confirmed Arkham Knight and it was a whole [ __ ] thing like this happens and I get it. But then for Yuri to take it down yesterday be like, \"Oh, [ __ ] that. Okay,",
            "start": 821.2
        },
        {
            "text": "asking about Arkham Origins and he confirmed Arkham Knight and it was a whole [ __ ] thing like this happens and I get it. But then for Yuri to take it down yesterday be like, \"Oh, [ __ ] that. Okay, I'll be quiet about it.\" And then Aaron to fall for it as well. It's like damn, man. But yeah, I I I wonder the biggest thing for me is I wonder if it's I think yesterday we were talking about this, right? And then it was like, \"Well, do you expect it to be at Xbox? Is it going to show up on the Xbox uh presentation SGF, the SGF stage?\" And I wonder if that's us looking too closely at where there's smoke, there's fire. Like this is happening because fans are asking about it, so they're doing it. It's not they're I don't Atlas isn't teasing anything to my knowledge that's causing fans to then go ask them. You know what I mean? Like I don't know if it's imminent finding out about I'm with you on that, but I do think it it's kind of 50/50 because they they truly are respectfully [ __ ] these",
            "start": 858.64
        },
        {
            "text": "ask them. You know what I mean? Like I don't know if it's imminent finding out about I'm with you on that, but I do think it it's kind of 50/50 because they they truly are respectfully [ __ ] these things out. like they they've gotten this thing down to a science where I feel like a lot of the uh remakes of RPGs specifically um specifically JRPGs they've really found a nice kind of cadence of being able to uh in different ways you look at the Dragon uh Quest games right on um the the one that just came out the the HD 2D for three and then we're also getting one and two um and I get that that's a very different style than uh what the Persona games are but they did just release Persona 3 remake and I'm pretty sure that like if we get a four, it's going to be in a very similar not style but engine. And I feel like it's not going to be the hardest thing that's going to need a 5year development cycle, right? Um, but is it too quick of a turnaround? I think we'll have to to wait and see.",
            "start": 896.88
        },
        {
            "text": "engine. And I feel like it's not going to be the hardest thing that's going to need a 5year development cycle, right? Um, but is it too quick of a turnaround? I think we'll have to to wait and see. But like I feel like they're not the type of group that really cares about spreading their releases out. Like if they can get it done that fast, they're going to, but that's not at all a guarantee that it's going to be next week. Yeah, I'd like to believe I think it'd be a great announcement. I love Persona 4 obviously, so seeing more from that. Uh, and again, you know, Barrett talked about this yesterday, too, of like giving new voice actors a shot at it, too. I think that could be super fun and see what they do with the characters. I'd like to believe it'd be next week. You know, easy points for a fantasy prediction if we want for when we get into predictions next week. Uh, but yeah, I I don't buy that it's imminent imminent. I think it's just uh two voice actors getting duped back to",
            "start": 941.6
        },
        {
            "text": "for a fantasy prediction if we want for when we get into predictions next week. Uh, but yeah, I I don't buy that it's imminent imminent. I think it's just uh two voice actors getting duped back to people have been asking when we're doing our summer gamefest predictions and we've now locked it in that on Monday games cast will be summer gamefest uh kickoff live or whatever it's called predictions and then Tuesday will be our Xbox showcase predictions. Sell you.",
            "start": 980.32
        }
    ]
}