{
    "id": 14133,
    "video_id": "qmZJNxHGg-A",
    "show_name": "Highlights",
    "hosts": [
        "Andy Cortez",
        "Mike Howard"
    ],
    "title": "What is Kojima Cooking?",
    "description": "From KFGD: https://www.youtube.com/watch?v=Tmshj9IMikI&pp=ygUEa2ZnZA%3D%3D Go to https://bit.ly/m/KindaFunnyXSubwaySurfers?r=qr to get special rewards and download it now!\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\nFOLLOW US ON EVERYWHERE!\n---------------------------------------------------  \nYouTube: Youtube.com/KindaFunnyGames\nTwitch: https://www.twitch.tv/kindafunnygames\nPatreon: https://www.patreon.com/kindafunny/\nTwitter: https://twitter.com/KindaFunnyVids\nInstagram: https://www.instagram.com/kindafunnyvids/\nTikTok:  https://www.tiktok.com/@kindafunnygames?lang=en",
    "published_at": 1747693800,
    "duration": 879,
    "transcript_chunks": [
        {
            "text": "I know we're running kind of late, Mike, because of the whole it computer issue and everything, but dude, these Street Fighter Overwatch skins look crazy. Oh, I haven't seen any. They just look so freaking cool. You going back? You got to buy a couple, right? Got to got to buy a couple. Got to go back. You got to put them in your locker just in case you come back. Well, I mean, I do really want to. Chris Anker wants to go back as well over Marvel Rivals. Well, I mean, we're enjoying Marvel Rivals, but it was it was more of a curiosity thing from from you know what I mean? I of like, will I vibe with this? I I mean, he was just like, I think one night we should just like go really hard onto Overwatch. I love that. Like, call me if you want to play Counterstrike 2, though. Okay. All right. I will. Look at this, dude. Freaking Damim Zenyatta's doulim. We got freaking Kico is Jury. Winston is Blanca. Goddamn Sigma is freaking uh and Bison. It looks awesome. Looks freaking damn good.",
            "start": 0.56
        },
        {
            "text": "I will. Look at this, dude. Freaking Damim Zenyatta's doulim. We got freaking Kico is Jury. Winston is Blanca. Goddamn Sigma is freaking uh and Bison. It looks awesome. Looks freaking damn good. Widowmaker is Cammy. What a perfect combo. Okay, story number two. Hideo Kojima reveals his next espionage game. Fizzant is five to six years away. This comes from Jordan Midler, the homie at VGC. Got to hang with Jordan Midler a bit more in uh in Los Angeles at the Liza P DLC event. Did he out energy drink you? Cuz you know that's his title. Well, I mean, I know you hold strong to that. It was I mean, there were a couple of dorky moments where I was just like, \"You try this Monster Ultra Blue Hawaiian.\" He was like, \"Oh, yeah, dude.\" Like, we were just we were just bonding over our love for energy drinks. Uh, the story goes, Hideok Kojima has said that one of his next games, Fizzant, won't be released for five or six years. Cojima recently spoke to French magazine Le Film Francois during uh",
            "start": 40.24
        },
        {
            "text": "drinks. Uh, the story goes, Hideok Kojima has said that one of his next games, Fizzant, won't be released for five or six years. Cojima recently spoke to French magazine Le Film Francois during uh which he was asked about the adaptation of the Death Stranding film which is currently in production at 824 and if he'd like to work on more films in the future. When asked if he'd like to direct a film, Cojima replied, \"I already have. It was called Metal Gear Solid one through whatever.\" He didn't reply that. Uh the actual quote was, \"Oh yes, I've received many offers after leaving Konami.\" Cojima went on to explain that he has multiple video game projects in development and that he may consider making a film once Death Stranding 2 and Fizzant are complete. Quote, \"Besides Death Stranding 2, there is Fizzant in development. That will take me another five or six years. Maybe after that I could finally decide to tackle a film. I grew up with cinema. Directing would be a kind of homage to it.",
            "start": 94.4
        },
        {
            "text": "is Fizzant in development. That will take me another five or six years. Maybe after that I could finally decide to tackle a film. I grew up with cinema. Directing would be a kind of homage to it. Besides, I'm getting older and I would prefer to do it while still young.\" Beautiful. Yeah. Not bad at all. I mean, this is a guy that we talked about just a couple weeks ago of like as he's entering the, you know, the golden era, the end of his career, what has he got left in the tank? What will he still be working on? And when you think about this next game, right, we still have OD with Xbox in the middle of all of this. So, five to six years out seems about right from the announcement that we had here with Herman Hol and the saying of like, yeah, we're going to get to that here in the future. Five to six probably more generous. Seven is probably right where we're at. Do you do you think part of him hopes that people forget about OD so you can just work on physics? It is odd he didn't say",
            "start": 138.72
        },
        {
            "text": "Five to six probably more generous. Seven is probably right where we're at. Do you do you think part of him hopes that people forget about OD so you can just work on physics? It is odd he didn't say that. Like I definitely took note of that. Like really odd you didn't say OD big dog. That's kind of weird. What's up with OD? Like what's that? I'm not sure. Next question. Uh yeah, that's one that I'm I think I'm way more fascinated by because fizzings we know will be a return to form with espionage action. It's why we love Cojima. why we grew up and people like me were putting him in the people you'd like to meet on your MySpace profile section. Like I was like, man, one day I want to meet Cojima. And that's what we know and love him for, but this OD project is still kind of looming out there. We've, you know, seen a lot of celebrities that are going to be in this OD game, and I just still don't know what the hell it is. Yeah, we don't know much details on that besides he was gathering",
            "start": 178.4
        },
        {
            "text": "We've, you know, seen a lot of celebrities that are going to be in this OD game, and I just still don't know what the hell it is. Yeah, we don't know much details on that besides he was gathering like the best of the horror genre to come help him and build this game out, right? So, like the Avengers. Yeah, the he was building the Avengers squad for this. But yeah, I mean, if you looking at this when he says five to six years for pheasant, right? I think you look at it and go, \"Okay, well then that means OD's got to be what, three years, four years if we're pushing it towards the back end.\" But yeah, this is a a man here who's probably looking at the tail end of his career going, \"How much more do I want to spend on games? I have a passion for directing. Can I still do that? When does that look like and how do I get into that still?\" So, yeah, he's got a lot of miles still left in the tank, but he's also probably planning out this takes a long time. What can I really do afterwards? You",
            "start": 223.04
        },
        {
            "text": "look like and how do I get into that still?\" So, yeah, he's got a lot of miles still left in the tank, but he's also probably planning out this takes a long time. What can I really do afterwards? You see how he's got all of his secret game ideas on a flash drive? I saw that. So cool. That's the coolest thing ever. Is that cool? I'm going to do that. I'm going to leave a bunch of uh just clues on a flash drive. Okay. Just hand them into the team and just say good luck. Just go on this trip. We don't even know what we're looking for. A bunch of clues. Uh the next story. Remember this moment though when Greg Miller predicted that? Like what did he know? Yeah. What did he know and who did he know? We don't know, man. We don't. Do you think this will be like a massive like Metal Gear Solid 5 or do you think it will be more tighter? Isn't Yeah. like a a normal like a Metal Gear one two type situation. More linear type Yeah. video game, man. I just I mean, who freaking knows? Like, we don't",
            "start": 267.6
        },
        {
            "text": "do you think it will be more tighter? Isn't Yeah. like a a normal like a Metal Gear one two type situation. More linear type Yeah. video game, man. I just I mean, who freaking knows? Like, we don't even know what the concept is. We don't We just know. All right. It's going to be dude in a suit. Yeah. [ __ ] robots crawling around. There will be some cool looking robots. Yoji Shinkaw will like, you know, dive into the bag and just come up with the craziest looking things ever. Um, cool. I'm pumped for that. You're not mad at that? Cuz you, by the way, 61 years old. Okay. Yeah. Lot a lot of people mad that they're announcing so early, but we've already announced this game like two years ago, so like we already kind of know about it. You're not mad at, oh, this is another game announced five to six years too early. That's never really bothered me. Okay. That only really bothers me when the whenever there are troubles in development. Like obviously that's you could say that right now and",
            "start": 310.24
        },
        {
            "text": "to six years too early. That's never really bothered me. Okay. That only really bothers me when the whenever there are troubles in development. Like obviously that's you could say that right now and there could be troubles in the future. But I it's never really bummed me out that much. I just go all right I'll put that in my you know the back of my brain. Hopefully I'll remember that later on and I get I'll get pumped up about it. Uh but it's always nice to have that thought in my mind of somewhere out there like in the next four years Mike in four years from now I'll be going man Cojima right now is working on an espionage accident and that's so cool to me. You know what I mean? This episode is sponsored by Subway Servers. The goated endless runner that carried me through middle school, high school, college, and now adulthood is celebrating their 13th birthday, which also marks their 200th World Tour update. And they're going big because Subway servers decided to travel to not one,",
            "start": 357.04
        },
        {
            "text": "high school, college, and now adulthood is celebrating their 13th birthday, which also marks their 200th World Tour update. And they're going big because Subway servers decided to travel to not one, not two, but 21 different locations in their 200th World Tour special event. As kind of funny as Resident Zoomer, I can seriously say that I adore Subway Surfers. It's one of my favorite comfort games. Grabbing items, completing challenges, and pulling out a hoverboard right as I'm about to hit a train feels just as good now as it did when I was sitting in the back of Mr. Coburn's Spanish class. Play through all 21 destinations to unlock amazing rewards such as characters, hoverboards, and in-game currency. Just tap the 200th World Tour button on the screen to start playing. On top of that, Subway Surfers has made a special QR code just for the best friends to get even more rewards. The update ends on June 1st, so scan that QR code, download Subway Surfers, and start running if you don't",
            "start": 398.32
        },
        {
            "text": "Surfers has made a special QR code just for the best friends to get even more rewards. The update ends on June 1st, so scan that QR code, download Subway Surfers, and start running if you don't want to miss out on all the rewards. I already did. This episode is brought to you by Factor. When life gets busy, food can sometimes feel like a chore. And the fast food trips can go from a weekly to daily occurrence very, very fast. So, buck those trends and make this season your best with nutritious 2-minute meals from Factor. Eating well has never been this easy. Just heat up and enjoy, giving you more time to do what you want. With 45 weekly menu options, you can pick gourmet meals that fit your goals. Truths from Calorie Smart, Protein Plus, Keto, and more. We at Kind of Funny Love Factor Meals. Bless and Greg love it for a quick lunch in between shows, and I adore it as a healthier alternative instead of the dreaded hump day too tired to cook drive-thru run helping me to get on track",
            "start": 442.56
        },
        {
            "text": "Meals. Bless and Greg love it for a quick lunch in between shows, and I adore it as a healthier alternative instead of the dreaded hump day too tired to cook drive-thru run helping me to get on track with my goals. Get started at factormeals.com/kindaffunny5050 off and use code kind offunny50 off to get 50% off plus free shipping on your first box. That's code kind of funny50 off at factormeals.com/kindofunny50 off for 50% off plus free shipping. Factormeals.com/kindfunn5050 off. Story number four. Injustice 3 could be in development according to a multiverse data miner. Once again, Jordan Middler at BGC. The development of a game of a third game in the Injustice series is being teased by a multiver data miner. An account that had a history of posting information about multiveres content before it was officially revealed has teased that a new game in the Injustice franchise is in development. Quote, \"Multiverse shutting down is an injustice. Then doing it all again is just another",
            "start": 486.8
        },
        {
            "text": "before it was officially revealed has teased that a new game in the Injustice franchise is in development. Quote, \"Multiverse shutting down is an injustice. Then doing it all again is just another injustice.\" Snap. Read the post. the post on Twitter from Multiver Suzie. Quote, \"Leaving me without any leaks is yet again another injustice.\" They continued, \"Multiver Suzie, uh, oh, it's Multiveres, but their name is Susie, so it's Multiverusi.\" Multiverse. No, can't pronounce it that way. We got a lot going on. Follow up with a reply reading the number three. Both Multiveres and Injustice are games publisher are games published by Warner Bros. games, which may explain how Multiverse Suzie has seemingly been able to acquire data on the ladder. That's exciting for uh Injustice fans out there. This person is in your colonels. They are in This person has your information, just so you know. You better watch out for Suzie out there. This person clearly has your number. They have infiltrated",
            "start": 541.2
        },
        {
            "text": "This person is in your colonels. They are in This person has your information, just so you know. You better watch out for Suzie out there. This person clearly has your number. They have infiltrated like fizzings. Be careful out there. Uh does this do anything for you? I know you and me are not generally the big fighting game fans, but I get pumped up knowing that we're going to get I think with Injustice and Mortal Kombat games, I would say those are more leaning towards the casual fighting game fans because you could also play those games as a story and see these amazing cut scenes. That's why I've always loved Mortal Kombat and I love Injustice for that, right? And so I'm super interested because of that campaign, that story. They'll tell all those wacky, insane moments of what will be happening on the screen. And so, yeah, I'm all in. If this is real and we can trust Suzie, then I'm in. Oh, yeah. I mean, as a Batman fan, you know, I'm I'm excited to to play as more Batman, but then",
            "start": 593.2
        },
        {
            "text": "on the screen. And so, yeah, I'm all in. If this is real and we can trust Suzie, then I'm in. Oh, yeah. I mean, as a Batman fan, you know, I'm I'm excited to to play as more Batman, but then to see more of that universe in Justice 2 was such a fun time. Like, one of the most beautiful games on last gen for sure. Um, Nether Realm just crushes it. It's ridiculous. As the chat says, they freaked it. Um, but I it also whenever we talk about Injustice 2, it just makes me think of, weirdly enough, my most viewed video that I ever made on the internet is the Injustice 2 the movie all cut scenes 1080p 60 fps on IGN. 9.5 million views pushing those visuals, dude. I'm going to check that out tonight. Yeah, people love the people love those cut scenes. You might not uh super be into the gameplay, but yeah, fun universe. Bar Mike, the views count on that video was huge. Huge. But I'm tired of all this huge stuff. I'm tired of all the big news. Take those views down. If I wanted something smaller,",
            "start": 638.56
        },
        {
            "text": "yeah, fun universe. Bar Mike, the views count on that video was huge. Huge. But I'm tired of all this huge stuff. I'm tired of all the big news. Take those views down. If I wanted something smaller, say the tiniest news I needed to know about, where would I go? Andy, you'd go to our last story, the Wii News Channel, where we cover all the small news items you need to know about. from Eurogamer. Infinity Nikki's development team has issued an apology following a recent and poorly received update to the game, which led to an influx of negative feedback on Steam. The developer released version 1.5, which added a number of bugs, which included players being able to start the game on PS5, meaning it had meaning or they were unable to start the game on PS5, meaning it had to be redownloaded completely. Other issues included crashes and Nikki not moving. God damn. Yeah, not a good start. Infinity Nikki not being able to move out there. Meanwhile, the developer Redcon Infinity Nikki's story",
            "start": 684.88
        },
        {
            "text": "Other issues included crashes and Nikki not moving. God damn. Yeah, not a good start. Infinity Nikki not being able to move out there. Meanwhile, the developer Redcon Infinity Nikki's story and in the words of one player, quote, \"Dive deep into scummy monetization practices for this update. We're acutely aware that these recent issues have impacted your experience and damaged the trust and affection you've placed in us. To all stylists, that's what they call their gamers stylist. I love it. I love it. Eyes up. Eyes up stylists. uh to all stylists with our uh we offer our deepest apologies. The developer wrote on social media. Yeah, that's a tough place to be. That's fantastic. Dived deep into shady monetization tactics is never a good thing you want to hear. Yeah, you don't want that in a news story or or a quote from a uh from a a viewer. Nintendo will be attending Gamescom in 2025. That's pretty huge. That's awesome. I mean, you got to think Switch 2. This will be August, so you're",
            "start": 734.8
        },
        {
            "text": "news story or or a quote from a uh from a a viewer. Nintendo will be attending Gamescom in 2025. That's pretty huge. That's awesome. I mean, you got to think Switch 2. This will be August, so you're coming hot off of Donkey Kong as well. So, yeah, this is the perfect time to showcase that. If people haven't jumped on board, hey, here's your chance. Go hands-on. Come jump in. Get your hands on one of them switches in case they're still really rare at that point. Who knows? Maybe maybe I'll sell my second one for $3,000. That's a scummy monetization tactic. Best Indie Games Summer Showcase is set for June 3rd at 8:00 a.m. PT. Now, is is best a part of the title or is that just or are they just claiming that's the best? Yeah, this is the best one. Indie games the best indie games summer showcase is set for June 3rd at 8:00 p.m. 8 a.m. PT. Be there. We'll see you then. It might be the best of the summer. Who knows? Uh, from Nobel, a new indie showcase with a focus on indie JRPGs was",
            "start": 780.36
        },
        {
            "text": "showcase is set for June 3rd at 8:00 p.m. 8 a.m. PT. Be there. We'll see you then. It might be the best of the summer. Who knows? Uh, from Nobel, a new indie showcase with a focus on indie JRPGs was announced. It's called Indie Quest, and it's set for May 29th, 400 p.m. PT with over 40 exclusive new trailers. Wouldn't it be great if it was like new indie game showcase, the best indie game, the best one, the best indie game showcase. We also have uh the 61 Indie coming out with theirs, which I've uh seen a lot of hype about. Oh, okay. Shout out to the squad at 61 Indie. Big Mike and Kyle. Yeah, a lot of people pumped for the 61 Indie Showcase and I don't have a date on that. I'm sure it's out there somewhere. Just look up 61 Indie.",
            "start": 834.32
        }
    ]
}