{
    "id": 14044,
    "video_id": "qPS2JYGeqqw",
    "show_name": "Miscellaneous",
    "hosts": [
        "Greg Miller",
        "Nick Baynes",
        "Alex Cox",
        "Tomas Hrebick"
    ],
    "title": "Greg's Mafia: The Old Country PAX East Panel!",
    "description": "The Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1746731084,
    "duration": 3568,
    "transcript_chunks": [
        {
            "text": "Heat. Heat. [Music] [Applause] [Music] [Applause] [Music] [Music] [Music] Whether it's sunglasses inside, blue light glasses inside, or night driving lenses in the dark. Zeni has affordable eyewear for everyone. Get 10% off with code packs at zeni.com. [Music] [Music] [Music] Heat. Heat. [Music] [Music] Hey, hey, hey. [Music] Heat. Heat. Heat. Heat. [Music] Everything. Everything I've done, I've done for my family. For the last 10 years, all I done was kill. I killed for my family. I killed anybody that got in my way. Family and who you're born with is who you die for. [Music] What's up, Boston? How are we this lovely Thursday morning? Boston, you can do better than that. I said, \"How are we?\" At least that second time got the Ghostbuster to yell. He still didn't clap. He yelled, though. I appreciate that. You want to clap for me? Stand up and clap right now. All right, everybody. Be more like the Ghostbuster. Uh, what's up, everybody? Welcome to your mafia the old country packs east",
            "start": 0.0
        },
        {
            "text": "I appreciate that. You want to clap for me? Stand up and clap right now. All right, everybody. Be more like the Ghostbuster. Uh, what's up, everybody? Welcome to your mafia the old country packs east panel. My name is Greg Miller from kind of funny games. And who's been to a PAX panel before? A lot of you raised your hands. That means you've been to bad PAX panels. All right. Today's about energy. You get to see stuff from the game that no one's seen. You get to hear straight from the developers. That's exciting. So when you see or hear something you like, I need you cheering. All right. 3 2 1 go. And when you hear something you don't like, like the game's delayed, you boo. But the game's not actually delayed. That's what I like to see. Everybody, uh, we're going to have a look at the gameplay, of course. We're going to have some spotlights with the developers, and then we are going to get to pick the brains of Hangar 13. But before all of that, let's watch some really cool videos.",
            "start": 303.6
        },
        {
            "text": "of course. We're going to have some spotlights with the developers, and then we are going to get to pick the brains of Hangar 13. But before all of that, let's watch some really cool videos. Okay. Come in. Bravery is not common in this world. Hanso. Loyalty, honor, obedience. They set the man apart from the rest. You took care of Messina. But this matter is not yet resolved. Will you help me bring it to a close? Of course. I'm not easy. Heat. Heat. [Music] Ally, you again. Hey everyone, I'm Nick Baines, president of Hangar 13. We hope you enjoyed this new look at gameplay in Mafia the Old Country. We're just three short months away now from getting this game in your hands and we can't wait. Mafia the Old Country is an origin story for the Mafia universe and as such is both a step forward and a return to the fundamentals of the franchise. The heart of Mafia has always been deep immersive storytelling and Mafia the Old Country is no exception. It's a premium experience in the vein of",
            "start": 354.64
        },
        {
            "text": "and a return to the fundamentals of the franchise. The heart of Mafia has always been deep immersive storytelling and Mafia the Old Country is no exception. It's a premium experience in the vein of early mafia games with a linear narrative set against the stunning authentic backdrop of 1900 Sicily. That focus has allowed us to deliver a classic organized crime drama in the period authentic mafia rules and traditions of the era. And as you just saw, we've made some exciting gameplay updates. Whether you're using a knife or a gun, using stealth or in a shootout, this is brutal and grounded in all the best ways. It's all going to pull you in from every angle, pushing the franchise forward in a location and time painstakingly created with the utmost authenticity and detail using Unreal Engine 5. Stick around because next up is our development team who have loads of awesome behind-the-scenes insights on how we brought this title to life. And stay tuned between now and August as we'll have",
            "start": 478.08
        },
        {
            "text": "5. Stick around because next up is our development team who have loads of awesome behind-the-scenes insights on how we brought this title to life. And stay tuned between now and August as we'll have even more to tell and show. Thanks for joining us on this journey. Come in. Our top goal for every Mafia game is to deliver the promise to a player that you're going to play a classic mob movie. Mafia the Old Country is a linear crime drama set against a beautiful Sicilian backdrop. The first step for us was to make sure that we were nailing all of the things that players expect from a Mafia game. the quality of it storytelling, how immersive it is, how authentic it is. Previous mafia games have been set in big American cities. We've taken the action and we've put our story in rural Sicily in the place where the mafia began. You really feel like you're transported into another time. It feels really unique and different, but yet really familiar. Players are really going to enjoy that aspect",
            "start": 523.92
        },
        {
            "text": "place where the mafia began. You really feel like you're transported into another time. It feels really unique and different, but yet really familiar. Players are really going to enjoy that aspect of it. Our entry point for making these crime dramas is always the protagonist. We wanted to make sure that our main character Enzo Favara lives up to the standard which we've set in the past and I hope in some ways even exceeds that. All of the men in this room are bound by blood. Enzo grows up in a sulfur mine. He's one of a bunch of children that are sold to the mine owners at this point in history in Sicily. Their life expectancy is short and they're essentially seen as disposable. Enzo turns to crime as a means to make something of himself. The odds are stacked against him. So what does he do? He sees an opportunity for himself to gain some status, to gain some respect. Do you wish to commit to this family? I do. Swearing the oath is the chance for him to finally be accepted. He's found",
            "start": 579.92
        },
        {
            "text": "He sees an opportunity for himself to gain some status, to gain some respect. Do you wish to commit to this family? I do. Swearing the oath is the chance for him to finally be accepted. He's found a family. It's the thing he's been searching for his entire life, but it comes at a cost. I think players are in for an emotional roller coaster. The high stakes of the mafia life present opportunities for us as storytellers to take players and put players through the ringer really in terms of what happens to the character, what happens to them in the game. You again. What makes a really compelling gameplay experience is the mix of the high-intensity combat, cover play, cover shooting set by these beautiful cinematics that make what you do in the combat so much more meaningful because you're fighting for something you really believe in. Authenticity and immersion are key. And so we wanted to take that philosophy from the storytelling and make sure that it was consistent in the gameplay. You",
            "start": 624.64
        },
        {
            "text": "for something you really believe in. Authenticity and immersion are key. And so we wanted to take that philosophy from the storytelling and make sure that it was consistent in the gameplay. You know, whether you come for that core cover combat shooting experience or that white knuckle driving experience, we have that in Mafia the Old Country, but it's unique. There's some downbeats, there's some deep storytelling moments, and then there's some like highintensity action. And I think that's what makes Mafia missions and the general experience so interesting is that we're constantly trying to change that roller coaster experience that you're on. Enzo's proving himself with guns and we wanted the combat to feel like there was a scarcity of resources. So, you have to be more tactical in the way that you approach combat. The knife has been an integral part of gameplay. It's a part of Sicilian culture. We wanted our gameplay to be immersive, to have a life or death kind of vibe. So, when",
            "start": 671.92
        },
        {
            "text": "way that you approach combat. The knife has been an integral part of gameplay. It's a part of Sicilian culture. We wanted our gameplay to be immersive, to have a life or death kind of vibe. So, when players are in a knife jewel, when they're in a gunfight, they're genuinely fearing for their lives. My flesh must burn like this saint if I do not keep my oath. Bringing 1900 Sicily to life for us, it infuses every aspect of the development. It's about the characters. It's about the music. It's about the story. It's about the setting. It's about the vistas. It's about the vehicles. It's everything. It always starts with research. It always starts with immersing ourselves in the subject matter. So whether that's reading every crime book around the Sicilian mafia, watching all of the movies, even driving the cars, firing the weapons, and then translating that into the game, that's the the development experience. We even sent some folks out to Sicily. We were then able to take all of those",
            "start": 710.16
        },
        {
            "text": "driving the cars, firing the weapons, and then translating that into the game, that's the the development experience. We even sent some folks out to Sicily. We were then able to take all of those experiences and try to translate it into an on-screen experience, but also a story. And those two things are woven together in a way that I think players are going to really enjoy. Bravery is not common in this world. And so the mafia that we see in the Mafia of the Old Country is is much different than the mafia that we see in some of the other mafia games. It's a timehonored tradition steeped in secrecy. And there's this sort of deep honor that we see within the Teresi family and within the characters there. The characters relationships with each other, the way they behave is very much influenced by that setting and that cultural difference. This is a distinctive experience that I've never played before and I'm sure that players are going to feel the same. Maf the country is our first",
            "start": 755.2
        },
        {
            "text": "by that setting and that cultural difference. This is a distinctive experience that I've never played before and I'm sure that players are going to feel the same. Maf the country is our first Unreal 5 game in the studio and it's particularly suited to the Sicilian setting. We've really been able to push the boat out in terms of sort of the real tiny details on everything. You know, one of the big ones for me is Metahuman. You have characters that have really lielike expressions, micro details. You know, many times when I'm watching the game, especially on a big screen in 4K, I start to forget that they're characters rendered in an engine. and they just look like real characters in a movie. I think that's the level of immersion that we want and it allows people, I think, to really suspend their disbelief and go along for the ride. Enzo is beautifully rendered in the game and I think he's one of the most compelling game characters we've seen for a long time. The thing I'm most excited",
            "start": 795.52
        },
        {
            "text": "their disbelief and go along for the ride. Enzo is beautifully rendered in the game and I think he's one of the most compelling game characters we've seen for a long time. The thing I'm most excited about from the Old Country is finally getting the game in players hands. The story pulls you through really quickly and at the end it takes your breath away and it's one that you're not going to want to spoil for your friends. The visuals and the storytelling are absolutely next level. Our setting's completely distinctive. Our story is completely unique. This is a game that you haven't played before. The best crime stories have unforgettable twists, and this game's no exception. Players in for a treat. Welcome, Hanser. And that's our panel, everyone. I thought you'd boo that. No, it was a boo moment. It was a boo moment. You got to get better at this. Ladies, gentlemen, in NBS, please put your hands together for, of course, the team of development leads from Hangar 13, the people making",
            "start": 840.08
        },
        {
            "text": "moment. It was a boo moment. You got to get better at this. Ladies, gentlemen, in NBS, please put your hands together for, of course, the team of development leads from Hangar 13, the people making Mafia the Old Country. All right, let's start with first day of school kind of stuff. Who are you and what do you do? Hello, Greg. I'm Nick Baines. I'm the studio president at Hangar 13. Uh, I'm Alex Cox. I'm the game director of Matthew the Old [Applause] Country. And hello everyone. I'm Tomasic. I'm the cinematic director. Of course, I want to dive in to Mafia the Old Country and talk all about this. It's the new game. It's the hotness. It's that. But we would be remiss if we didn't call out the very beginning, the little trailer, the tease of this has been 23 years of Mafia games. Nick, what does that mean to you? Well, it's it's incredible. I think you know to work on a franchise and a series of games that are this well- loveved by the players and also by the developers you know it's",
            "start": 889.28
        },
        {
            "text": "does that mean to you? Well, it's it's incredible. I think you know to work on a franchise and a series of games that are this well- loveved by the players and also by the developers you know it's like people join this studio to work on this game and there's so much passion for it and uh you know the opportunity to take it forwards to a new whole new story is something that's really huge and important to us. Um, but something also that people don't always realize when they hear about Hangar 13 and they think about Mafia 3 or they think about Mafia Definitive Edition, but Hangar 13 definitive edition. Come on. I was having dinner with Ben Star last night and he was like, \"No one talks enough about definitive.\" I'm like, \"No one talks enough about definitive edition.\" I I agree. I agree. Um, but uh, you know, but the thing is people don't realize necessarily that Hangar 13 has a lot of people uh that worked on Mafia all the way uh, back to the very beginning. you know, we've uh we've",
            "start": 955.76
        },
        {
            "text": "Um, but uh, you know, but the thing is people don't realize necessarily that Hangar 13 has a lot of people uh that worked on Mafia all the way uh, back to the very beginning. you know, we've uh we've got studios in the UK and in the Czech Republic who by the way, they are hard at work on this game right now, but they've taken a break to tune in to this. So, big shout out to those guys here and and so yeah, it's just something that uh it really is in the, you know, the DNA of the studio. And I mean, I've been here for like seven, eight years. Um, the two gentlemen to my left have been working on the projects for much much longer and now they they have mafia running through their veins. So, uh, Alex, how long you been working on the project on I've been working on Mafia uh, since 2007. So, I'm I'm uh, a relative spring chicken compared to some of those who've been around for a little longer than me. But yeah, my first game was my first Mafia game was Mafia 2, still very close to my",
            "start": 996.64
        },
        {
            "text": "So, I'm I'm uh, a relative spring chicken compared to some of those who've been around for a little longer than me. But yeah, my first game was my first Mafia game was Mafia 2, still very close to my heart, very dear to my heart. Oh, yeah. Um, and yeah, I mean I was as one of these the fans that Nick mentioned, you know, like I remember distinctly playing the first Mafia game 23 years ago. So I, you know, I played it. My first experience was as a player. I fell in love with the franchise then. You know, it was really um, you know, if you guys remember the first Mafia, it was one of the first games that really went hard on a movie like cinematic experience. It really blew me away at the time. I just left uni. I was a film student, right? So I was really like big into the whole idea of games as movies at the time. And um, yeah. So when I finally joined the fr yeah yeah joined the franchise a few years later um uh I was immensely excited and still am to be working on something and I'm",
            "start": 1043.28
        },
        {
            "text": "as movies at the time. And um, yeah. So when I finally joined the fr yeah yeah joined the franchise a few years later um uh I was immensely excited and still am to be working on something and I'm very glad that people still want to play those kind of games today. So 18 years of time on the franchise for me which um uh even after all that time I've not managed to make my way onto the box art unlike my friend Thomas here to the left who is uh featured on You're the box art. Yeah. Yeah. What do you do? We have an accent. What does that mean? He was the boxer. Like one of the artists just took the photo. We had a fun. So yeah, that's me 25 years ago as a young mafio. So so not so much a spring chicken. You've been around so much a little bit. So yeah, it's been incredible experience uh working on all the Mafia titles. And what excites me the most is that everything we learned uh on the journey we can now bring and use it on this new origin story and elevate it to next level of the",
            "start": 1080.88
        },
        {
            "text": "working on all the Mafia titles. And what excites me the most is that everything we learned uh on the journey we can now bring and use it on this new origin story and elevate it to next level of the storytelling. I mean that's a great transition. So then Nick as president big high flutin title even though you've barely been here a minute. That's right. What are you taking from Mafia 1, 2, and three when you look at Mafia the old country when you guys set off to do something that is so radically different? Yeah. Well, it's radically different in some ways and in other ways it's very much still in the the same vein as the other games. It has the same DNA. I think when we uh when we set out to make a mafia game and when we think about what a mafia game is, uh we really identify, you know, what the DNA of that experience is. And there's certain pillars that we, you know, we we we look at when we when we're deciding exactly what it is, uh we want to feature or how we want to, you know,",
            "start": 1136.8
        },
        {
            "text": "what the DNA of that experience is. And there's certain pillars that we, you know, we we we look at when we when we're deciding exactly what it is, uh we want to feature or how we want to, you know, what kind of gameplay, what kind of story. So, for example, you know, historical pulp fiction, brutal worlds of organized crime, uh gifted anti-heroes, setting as a main character, and themes of power. I think if you played other Mafia games, you'll recognize all of those things as really key uh elements of them. I think, you know, all of those are definitely true in all the games. So, when we look at what's next, we look back to this and we think, you know, how does what we're making now fit in with those and and deliver the kind of mafia experience the players want and that we want to make. So then let's move on. Let's talk about Mafia, the Old Country. Everybody's excited for it. I think what immediately jumps off at me, right, as a fan is, okay, it's a prequel. It's a new location. It",
            "start": 1179.6
        },
        {
            "text": "So then let's move on. Let's talk about Mafia, the Old Country. Everybody's excited for it. I think what immediately jumps off at me, right, as a fan is, okay, it's a prequel. It's a new location. It seems like a new tone. Am I wrong about that, Alex? I'm going off of what I've seen here. Well, the tone is we, you know, the tone is a little different to the other games, of course, but the setting is different to the other games. So that's the reason why the tone feels a little different. It's more, you know, it's got a kind of adventure vibe to it. Again, you saw in the video there, you know, right riding through the countryside, chasing that cart, for example, from the from the trailer. It's um the tone and the setting of the game has been, you know, tailored around a 1900 Sicilian setting. You know, we're not in a city anymore like the previous like the Mafia Trilogy titles. We're out in the countryside. We are in a time before Tommy guns and such like, right? So, we're in a kind of",
            "start": 1220.88
        },
        {
            "text": "You know, we're not in a city anymore like the previous like the Mafia Trilogy titles. We're out in the countryside. We are in a time before Tommy guns and such like, right? So, we're in a kind of a an old Yeah. We're just in a we're just in a different age. So that's kind of like in you know in infused all aspects of the design and the creative direction. Um and also this is an origin story. You know we've gone back to the start of the timeline of the of the of the franchise story. You know we're still in the mafia universe but we've gone back a little bit of time to right to the very beginnings but also not just the beginning of that story but the story of organized crime. You know like we all have a good idea I think of like what the American mafia looks like from films and TV shows. probably less of a clear idea about what the Sicilian mafia is or what that meant. But that is the start of it all. They they invented the they invented the term, you know. So, um that and that's what",
            "start": 1259.84
        },
        {
            "text": "less of a clear idea about what the Sicilian mafia is or what that meant. But that is the start of it all. They they invented the they invented the term, you know. So, um that and that's what our story is about is going back to the start there, exploring what what the what caused the Sicilian mafia to sort of originate in the first place and uh you know, set the course for what happens next later in the in the mafia story. Thomas, I think, you know, looking at the trailer, the gameplay, and of course the cinematics and stuff, what really pops is the performances right now. Obviously, when we get on Sticks, it'll be a different feeling. Nobody's getting a mouse and keyboard. When we get on sticks, it'll be a different feeling. Oh, there's a undercurrent of a boo there. Uh, talk to me about what it was approaching casting for this. How do you go and do something that's a period piece, but is being done in modern times? What do you What is that like? We had a very strong casting team",
            "start": 1298.8
        },
        {
            "text": "what it was approaching casting for this. How do you go and do something that's a period piece, but is being done in modern times? What do you What is that like? We had a very strong casting team behind us to help us to filter down uh all the candidates to final selection. We spent over like two months interviewing on all all the talents having the calls to making sure that we are selecting the the best possible fit for each of the role and I have to say that we are really lucky that we ended up with our first choices for each of the role of the main character. uh you know every game is uh very unique. Every mafia game is very unique and it's in a big part due to the cast and especially to the lead. So casting Enzo was very critical to us. uh we were looking for someone who can embody the specific Enzo journey and uh help us to set a distinct tone of the of the narrative you know and authenticity is also a huge part of our project. Uh so casting for 90 Sicily meant that we had to pay",
            "start": 1339.8
        },
        {
            "text": "specific Enzo journey and uh help us to set a distinct tone of the of the narrative you know and authenticity is also a huge part of our project. Uh so casting for 90 Sicily meant that we had to pay close attention to the all the details nuances even in the dialogues. So we uh hired dialogue coach who help us to uh and actors to mentor and make sure that all the dialogues were feeling the natural and authentic uh to this period. Awesome. Alex, piggybacking off that, we're talking about casts. We're talking about how close they have to work together because of course the mafia is all about family. What is the family in this narrative? What are we getting into? Yeah, it's a good question because like you know all of these crime stories I mean you know you know it's about family in some way a crime family but also family as it means to most of us right you the people you love and care about and um the drama in most crime stories is about that isn't it like the difference and the and the",
            "start": 1393.12
        },
        {
            "text": "a crime family but also family as it means to most of us right you the people you love and care about and um the drama in most crime stories is about that isn't it like the difference and the and the you know between those two types of families and the compromises the the decisions that the the characters have to make at the center of the story to trade off between those two things in our story um Enzo uh begins the story he has no family he's an orphan he grows up in a in a sulfur mind in a very terrible um environment. Um and when he finally finds uh him his way into the Tesi uh crime family, um he finds a sense of belonging, something he's been looking for all the time. But then it's about how much but then, you know, he he's not quite sure what he wants. He wants a sense of belonging. He wants to fit in somewhere. A gang seems to offer him that kind of uh that that environment. But then he also has some um uh you know other inclinations as to what he might want from his life. So",
            "start": 1448.88
        },
        {
            "text": "He wants to fit in somewhere. A gang seems to offer him that kind of uh that that environment. But then he also has some um uh you know other inclinations as to what he might want from his life. So what's he prepared to sacrifice for his family? I mean that's a big question uh around the whole story. And it'll be answered in Mafia the Old Country. You're a tough one to crack, Alex. All right. Uh my notes apparently say that of course the cast members have sent us messages that we are ready to show you. Are you wanting to see cast member messages? Paxis. Ghostbusters seems iffy, but everybody else is in. Let's watch him. Hi, my name is Ricardo Fascari and I play Enzo Fav in Mafia the Old Country. Enzo is a kid who gets a really hard start in life working in the sulfur minds, but through how is his his work and his resilience, he earns a chance to redeem himself with the Theresy family. That's where he learns the real values of family and loyalty. Enzo is a Kuzu. Kuzu is an orphan who",
            "start": 1490.8
        },
        {
            "text": "is his his work and his resilience, he earns a chance to redeem himself with the Theresy family. That's where he learns the real values of family and loyalty. Enzo is a Kuzu. Kuzu is an orphan who was sold to slavery when he was a boy who never knew family and Theres gave him a chance to to be somebody to belong and to make something out of himself. And characteristics are definitely his strength, his loyalty, his resilience, and his determination. He's very determined to to find his place in the world and to claim his spot as a free man. His strongest desire is to be a free man and to live his own life as he wants. Nick, he was very handsome. He is very handsome. Is the entire cast is handsome? Yes, they are. Yes, they are. And um before we talk about Enzo a minute, I just want to say firstly, Ricardo has put in an amazing performance. I think the whole cast are incredible. And I think the casting's been like Thomas was saying, the casting was incredible for this game and and I",
            "start": 1541.52
        },
        {
            "text": "firstly, Ricardo has put in an amazing performance. I think the whole cast are incredible. And I think the casting's been like Thomas was saying, the casting was incredible for this game and and I genuinely think, you know, we we we we see it in game and we're like blown away ourselves, right? It's incredible. And also, what's also cool, Ricardo is a really really nice guy. He actually flew out to our studio in the Czech Republic about a month ago. Wow. And hung out with the team and played the game. And yeah, so he's a top guy as well as being uh what I think uh is going to be Enzo is one of think going to be the next fan favorite character. Um, his story is really emotional. You see him going from real rags to Richie, but it's uh Riches, but he's, you know, he really starts at the bottom in those sulfur minds. It's a pretty horrific start to life. And, uh, yeah, he has some highs and some lows as he goes along the story, but I think everyone's going to love it. Um, I I really do",
            "start": 1603.36
        },
        {
            "text": "in those sulfur minds. It's a pretty horrific start to life. And, uh, yeah, he has some highs and some lows as he goes along the story, but I think everyone's going to love it. Um, I I really do think, yeah, he's he's up there with the best mafia main character. That's that's a high flutin praise. All right, that's a good list of characters right there. Hold me to that. Okay, hold them to it, everybody. Uh, let's see who we have next. This is This is where you boo. You can boo here. Thank you. You're getting it. You're getting it, everybody. And that's our panel. Well, I hope you're happy, everybody. You ruined Pax East. Panel number three of the day. And everything dies. me. I'm not pressing the buttons. I didn't do anything. Good lord. All right, let's reboot the thing there. You know, that's okay, everybody. No, what? Windows need to update. Will there be a I'm Karina Ki and I play the character of Isabella Torresi in Mafia: The Old Country. Isabella is intelligent, courageous, and",
            "start": 1646.16
        },
        {
            "text": "okay, everybody. No, what? Windows need to update. Will there be a I'm Karina Ki and I play the character of Isabella Torresi in Mafia: The Old Country. Isabella is intelligent, courageous, and passionate. While she is born into privilege, she's overcome hardship and life. And I think more than anything, more than even longing for her father's approval and love, I think she longs to drink deeply of life. I think she longs to fulfill her potential, and she's frustrated that the male-dominated society into which she was born doesn't allow her to do that. Isabella is a woman born ahead of her time. She is a loving daughter, but she's fiercely independent, so she longs for freedom from the structures of conservative society and from her father, Donzi. Alex, talk to me about Isabella. Well, yes. Uh, I mean, Isabella is um, as she as Karina then mentioned in the Why are you afraid of that microphone? Huh? You start here talking to it and you go away from it. I don't need it. Talk to the",
            "start": 1704.4
        },
        {
            "text": "yes. Uh, I mean, Isabella is um, as she as Karina then mentioned in the Why are you afraid of that microphone? Huh? You start here talking to it and you go away from it. I don't need it. Talk to the microphone, Alex. There's people here. Is this better? That's better. That's better. Okay. Uh, is Isabella, as she me as Karina mentioned in the uh, in the trailer is Don Teresa's daughter. And it really comes back to that family thing we were talking about a moment ago. She represents the other side of the family question to Enzo, you know, like is he going to commit to the crime family or is there something else that he can commit to a family uh more in a conventional sense which is going to be closer to his heart. Karina's performance is absolutely incredible. Again, I'm really really looking forward to for people to see her story and Isabella's story as um as she's playing as they're playing through the game. So, um yeah, that's uh another standout performance. I think I'm glad they",
            "start": 1779.28
        },
        {
            "text": "forward to for people to see her story and Isabella's story as um as she's playing as they're playing through the game. So, um yeah, that's uh another standout performance. I think I'm glad they got to see her message. Yeah. I mean, hey, round of applause for real to the packs text making it happen. If you're a kind of funny fan, you know, we wouldn't have come back. We would have just walked off. That's it. Go get lunch, Kevin. Uh, before we end the messages, we have one here. The final one from the Dawn himself. Can we roll that? Hi, my name is Johnny Santiago and I voiced the character of Bernardo Dissi in Mafia: The Old Country. Playing Dondori was definitely an honor. Uh he is a very complex and conflicted man with a brutal animalistic core which made it so much fun. Is constantly trying to find the right balance of his family, his business, and making sure that loyalty is above all things honored. Ronaldo is driven by his legacy and making sure that his family is taken care of,",
            "start": 1815.84
        },
        {
            "text": "to find the right balance of his family, his business, and making sure that loyalty is above all things honored. Ronaldo is driven by his legacy and making sure that his family is taken care of, most especially his daughter, and that what he leaves behind for her and the family is better than what he was given or came into. I hope you enjoy the game. Did he walk in Tomas? You're like, \"Well, that's the Dawn. He sounds like the Dawn. He looks like the Dawn. It's the Dawn.\" Johnny Johnny I I would just uh you know correct him slightly because he said he's the voice of the Dontoi. He created the full character obviously the full performance uh and he did great and awesome job as you can see. Doni is a patriarch of uh Tes family. He's very powerful and imposing person who commands respect and expects everyone to follow the mafia code. Don offers Enzo life-changing opportunities. However, this comes in price of total obedience and loyalty to him and his family. Amazing. I think it's",
            "start": 1868.36
        },
        {
            "text": "and expects everyone to follow the mafia code. Don offers Enzo life-changing opportunities. However, this comes in price of total obedience and loyalty to him and his family. Amazing. I think it's important obviously the cast of characters we're going to play as interact with all that stuff but as you guys called out in Nick in the front with your pillars and stuff the setting has to be a character as well right so talk to me about 1900's Sicily for the old country it's not something you can just go visit like well you can but are you but it's not like it was like how did you go about going back in time to do this going back in time would have been hard but yeah um the uh I think the thing with Sicily which is incredible is as the setting for a mafia game. It's totally brand new and fresh. It is an incredibly beautiful uh land. It's the countryside is amazing. The architecture uh is stunning. Um but it's the birth of organized crime. It's uh it's where there's a dark underbelly behind",
            "start": 1937.52
        },
        {
            "text": "It is an incredibly beautiful uh land. It's the countryside is amazing. The architecture uh is stunning. Um but it's the birth of organized crime. It's uh it's where there's a dark underbelly behind the doors there's there's bad things happening and in the shadows uh you know there's nasty people. So, I think that kind of contrast is really really uh memorable and uh yeah, I mean for us as always with Mafia games, authenticity is really key. So, we went out there, we've got a ton of reference, we really made it as authentic as possible, but to be honest, it's great. There's not that much artistic uh or creative interpretation required because it is such an amazing larger than life beautiful uh environment. So, yeah, it's it's it's a really really great setting for this kind of story. Tomas, what what is the research? Sure. You you guys went there, right? We saw that in some videos. Nick mentioned like the authenticity is really high priority to us. So the the research for very",
            "start": 1986.72
        },
        {
            "text": "Tomas, what what is the research? Sure. You you guys went there, right? We saw that in some videos. Nick mentioned like the authenticity is really high priority to us. So the the research for very extensive but the best for us was uh how to immerse ourselves was to send the dev team over to Sicily, you know, to to walk the streets to to feel the climate to talk to the people. Eventually we even talk to the local historians to learn what the life was like uh back then. What we love on the Sicily is the contrast between beautiful country of the Sicily and the harsh uh life conditions the people had to face back then. It was even more obvious when the when we went down to the sulfur mines and learn how brutal and dangerous the life was there just to survive. Actually, you were there on the trip. So, yeah, it's a tough life as a game developer going to touring around sleep. to holiday. I didn't I wasn't It was I mean the hotel didn't have a spa or anything, but everything else was great.",
            "start": 2033.68
        },
        {
            "text": "So, yeah, it's a tough life as a game developer going to touring around sleep. to holiday. I didn't I wasn't It was I mean the hotel didn't have a spa or anything, but everything else was great. Um good job. Uh yeah. No, it was great. We we get, you know, to really represent the authenticity of the environment as you say, uh Thomas, about like creating a game experience that's very immersive, that really transports you back to the time period and particularly to that location. It's very important to actually go and see it for yourself. Is the setting working with like the themes you're trying to go with family and all that? Abs. Well, there's plenty of there's there's a whole range of stuff there. So, when we went um when we went to Sicily, we visited sulfur mines. We visited in the Greek ruins. We saw some uh images there. The knife makers and people that fight with the Sicilian knife fighting, all kinds of stuff. We ate the food. We spoke to the people. We, you know, learned the",
            "start": 2090.08
        },
        {
            "text": "ruins. We saw some uh images there. The knife makers and people that fight with the Sicilian knife fighting, all kinds of stuff. We ate the food. We spoke to the people. We, you know, learned the swear words and the gestures and all of the other stuff. So there's some kind, you know, so we can translate that into a game experience which is um as authentic as we as as as everyone's expecting from a mafia game. I understand it was probably a million different things, Alex, but when you go there and you're talking to local historians or just people, are they stoked when when you're like, \"We're making a video game about here.\" They're like, \"Oh, is it positive?\" Like, Yep. Yep. Everyone was very excited about the idea. Yep. Yep. Yep. I'd say so. Yeah. It was great. Like everyone was very enthusiastic about it and I and and again I hope um particularly players in we've got the you know we we took that a little one one stage further as well. Like I think our Italian localized version is",
            "start": 2131.12
        },
        {
            "text": "about it and I and and again I hope um particularly players in we've got the you know we we took that a little one one stage further as well. Like I think our Italian localized version is actually also in S Sicilian dialect. Oh that's awesome. So yeah if you want to kind of like play through in Sicilian for a little bit more of an added uh vibe. Um that's there too which is which is great which is which is really cool. I was playing it last week and it's um yeah it's a different kind of vibe. [Laughter] Uh, Nick, let's pivot to gameplay. Of course, we're all gamers here, right? We love gameplay. That's was a big deal to see the gameplay trailer today for the first time. What were you guys trying to get across with the gameplay trailer? Mhm. Well, the first thing was was to hopefully make it really clear that if you love Mafia, you're going to love Mafia: The Old Country. Right. This is this is classic this is classic Mafia gameplay. Modernized. It's uh yeah, it's it's it's brought to",
            "start": 2177.84
        },
        {
            "text": "it really clear that if you love Mafia, you're going to love Mafia: The Old Country. Right. This is this is classic this is classic Mafia gameplay. Modernized. It's uh yeah, it's it's it's brought to 2025, but if you like it, if you like Mafia, you're going to love this. Um, but the other thing as well was to really show the variety of gameplay as well. The fact that, you know, there's there's knife fighting now. The combat's much more grounded and gritty. I hope that came across. You know, there's there's horses as well, which new thing, right? So, um, yeah, and and the jewels that you saw with the knife. So, I think the big thing was this is familiar, but it's better. And it's uh and also I think the other big thing really was just to really give a taste of how this setting gives a new twist on that classic formula. So yeah, I love that transition. Alex, back on you. Talk to me about combat. We see knife fighting, we see guns. Is it what we exactly expect or is it a take on it in",
            "start": 2220.72
        },
        {
            "text": "twist on that classic formula. So yeah, I love that transition. Alex, back on you. Talk to me about combat. We see knife fighting, we see guns. Is it what we exactly expect or is it a take on it in the mafia world? Well, again, we tailored combat um to the time period and the setting. We're talking about, you know, a time before automatic weapons. So, but also we're talking about an environment that's very sparse, that's very rugged. And actually, we al another kind of angle we wanted to take on the design is kind of to channel something which was a bit more from the original Mafia game where combat was a little bit more challenging. It was more tactical. With Mafia 3, we went in a more kind of like bombastic sort of combat direction. and we wanted to sort of pair that back, make combat feel more uh dangerous, kind of like having to survive combat encounters rather than just blasting your way through them. So, all of those things are really kind of like designed around the setting and",
            "start": 2266.84
        },
        {
            "text": "more uh dangerous, kind of like having to survive combat encounters rather than just blasting your way through them. So, all of those things are really kind of like designed around the setting and also Enzo's attributes. You know, Enzo as a character, he is this um kind of coiled spring as we describe him, a guy that's a survivor. He survived the mines. So him kind of like scrabbling around looting for kind of weapons in combat in combat scenarios for example is uh gives you a good idea about what it's like to kind of like survive through these combat encounters rather than um yeah just kind of uh shoot a shoot to win. Yeah. So um in addition I think we also saw um again in the videos but like the knife is quite a significant new addition in terms of uh combat in we wanted to make it so that the knife again it's it's kind of a Sicilian tradition. in Sicilian knife fighting is very evocative of the time period and of Sicilian gangsters generally. Um, so we wanted to make it so that the",
            "start": 2312.08
        },
        {
            "text": "the knife again it's it's kind of a Sicilian tradition. in Sicilian knife fighting is very evocative of the time period and of Sicilian gangsters generally. Um, so we wanted to make it so that the knife is more than just a kind of a one-shot kill kind of like animation. You know, it's it's your the players knife. You can choose from different knives in in the game. Each knife has got different attributes and skills associated with it. So, you can kind of like some knives you can throw, some knives give you uh bonuses in uh in in in other aspects of combat. Um, and then we've got this knife jeweling mode as well, which is new to the game and new to Mafia. So, you know, every now and again you come up against a kind of a boss character in missions and you have a kind of a one one-on-one kind of jewel to the death with them as well. So, that's okay. That's awesome. Uh, what's not awesome is that the there's no Tommy guns. And so, I would like to come back to that point, Nick. Thank you",
            "start": 2356.56
        },
        {
            "text": "of jewel to the death with them as well. So, that's okay. That's awesome. Uh, what's not awesome is that the there's no Tommy guns. And so, I would like to come back to that point, Nick. Thank you very much. Everybody, did you ever do you ever play Assassin's Creed? They make [ __ ] up all the time. You know what I mean? Here's a wing suit. Why not? I don't You know what I mean? Well, give me a prototype Tommy gun. But if there are no Tommy guns, Nick, what are we getting into when it comes to firearms? There are guns. We saw them in the trailer. Absolutely. And I think the big difference, you know, guns back in those days, uh they're less forgiving. Um you can't just like spray and shoot like a like a Tommy gun as well. Um so, you know, it's revolves, it's bolt, and rifles. But it's uh yeah, it's a much more tactical experience. You've got to really think about what you're doing. Uh you know, you're going to be in cover more. You know, as Alex said, really, it's about a feeling, it's",
            "start": 2392.08
        },
        {
            "text": "it's a much more tactical experience. You've got to really think about what you're doing. Uh you know, you're going to be in cover more. You know, as Alex said, really, it's about a feeling, it's about a feeling of vulnerability, like, you know, really fighting for your life. You know, every bullet counts. Uh, you're going to be relying on the knife, you're going to be relying on your guns, but really it's down to you as a player how you want to play. Um, it's just a much more brutal, grounded experience, I think, than maybe players are used to in a mafia game. But, uh, but again, keep saying the word authenticity, but that's that's what it was like. And I want to piggy back off that again as we continue to move through what we saw in the gameplay trailer. We talked about the pillar. We talked about this. We talked about vehicles and then Tomas, we see vehicles in there, but of course they're far different than the vehicles we've seen before. How do you bring those into this game,",
            "start": 2434.04
        },
        {
            "text": "talked about this. We talked about vehicles and then Tomas, we see vehicles in there, but of course they're far different than the vehicles we've seen before. How do you bring those into this game, make them authentic, but make them fun? Yeah, obviously the cars are always the the major uh feature of our games since the very first one. So, we are taking that very seriously making the cars authentic also in the mafia the old country. So the research was extensive and we are doing our best to find the best possible materials uh for our references. We are so lucky that in Czech Republic u we found the huge museum uh having all suitable cars for us. So and the owner was so cool that uh he allow us not to only take the pictures of the cars but even take them out you know and drive them. So this is first time we were able to hook up like dozen microsofts all around micros microphones all around the car and uh capture all the possible sounds not just the engine exhaust you know transmission",
            "start": 2469.52
        },
        {
            "text": "is first time we were able to hook up like dozen microsofts all around micros microphones all around the car and uh capture all the possible sounds not just the engine exhaust you know transmission but all the creeks of the the springs and all the metal uh shifts of of the body of the car. So the sounds of the of the cars are so rich and authentic that it's uh amazing. Let me stop the entire panel and ask. This is something we keep calling out and making a point about it. But to look at you guys first off looking like a bunch of goons, but I love it. With all the microphones on these cars doing all these things, we keep talking about authenticity. Why is that so important? Couldn't we record one car and put the engine on everything and then move on to something else? Why go to this Czech Republic car museum and record each and every one of them 15 different ways? It's just something we've always done, hasn't it, since the very first I don't know. We just This is what we do. Like all",
            "start": 2525.04
        },
        {
            "text": "Republic car museum and record each and every one of them 15 different ways? It's just something we've always done, hasn't it, since the very first I don't know. We just This is what we do. Like all of the guns get their own recordings, the cars, the we do the research and all the costumes and everything. Yeah. Better and better. Yeah. I mean, it's always been important to the franchise to be, you know, authentic. It's part of our kind of uh DNA really. It's part of the identity of the uh of Mafia games. So, yeah. I think as well we really want players to feel super immersed with the story and I think the more believable and the more genuine it feels the more you know you can really you know fall into the world and and and it it feels like something that is real and uh you can't really fake that you know I think you need to you know try and keep it as as truthful as possible. All right, thank you for the diet tribe. You've been nice enough to bring so many slides and I'm like, you",
            "start": 2578.24
        },
        {
            "text": "fake that you know I think you need to you know try and keep it as as truthful as possible. All right, thank you for the diet tribe. You've been nice enough to bring so many slides and I'm like, you know what, throw them out. Let's talk for a second. I was like, uh, to get back to it and to get back to the cars, Alex, talk to me about driving them again. I keep coming back to will they're going to be authentic. Will they be fun? Of course. Yeah. Like this is so like the car the um we got card chases just like previous Mafia games. Of course, like it's part of the um cinematic storytelling and part of the gameplay experience of all Mafia games. Again, cards are very important to us. Um, but this time we're at the dawn of motoring. You know, that's the the the the turning point between when uh you know, cars were starting to appear in Sicily. Um, so they're kind of rarer, let's say, but the car chases and all of the car gameplay is again very similar to, um, previous Mafia games, I",
            "start": 2618.08
        },
        {
            "text": "when uh you know, cars were starting to appear in Sicily. Um, so they're kind of rarer, let's say, but the car chases and all of the car gameplay is again very similar to, um, previous Mafia games, I would say. Um, but with the difference that the vehicles themselves are designed to feel like cars of the time period. So, uh, they kind of got a heavy, uh, kind of handling model and things like that to really kind of evoke the those 1900s vehicles. Now, Nick, you of course you called out the other new vehicle. Mhm. The horse. Uh, maybe the original vehicle. Um, talk to me about that, bringing that to Mafia. Well, we we couldn't really set the game in 1905 Sicily without horses and that's the first thing. Um, but it adds a really interesting dynamic to as you explore the world because the first thing is like Alex was saying, cars are cars are pretty new. So, a lot of the roads that are in the countryside are actually meant for horses and carts. So, as you go along uh there's kind of",
            "start": 2655.52
        },
        {
            "text": "first thing is like Alex was saying, cars are cars are pretty new. So, a lot of the roads that are in the countryside are actually meant for horses and carts. So, as you go along uh there's kind of choices of which way you take it and some are more uh suited for horses, some cars, but you can choose. You can go whichever one you want to. Um, and it's enjoyable. I think that's the main thing. It's about trying to give more uh enjoyment as you go from A to B and as you explore the world. Just just it's it feels great and it looks great. And you have to crank them when they break down, right? The horses. No, no, no. The cars you need. We we we could have done that. We could do the tail maybe, but I'm not sure. No, there are multiple ways to crank a horse. All right. Don't worry about that. I mean, I did Wonder. So, yeah. But no, that's right. Oh, me. Uh let's get back to hard-hitting journalism. Uh, Tomas, the one thing I think that speaks whether you've seen the game, you know the game,",
            "start": 2702.72
        },
        {
            "text": "mean, I did Wonder. So, yeah. But no, that's right. Oh, me. Uh let's get back to hard-hitting journalism. Uh, Tomas, the one thing I think that speaks whether you've seen the game, you know the game, whatever. You watch that trailer and the game looks really good. Are you prepared to go on record and say this is the best looking Mafia game of all time? Oh, [ __ ] yeah. Okay, good. Give me a little bit more than that. What goes into making it look like this? All right. Our goal was always to set the benchmark for the cinematic quality with our mafia games. We wanted the player uh to feel like they are stepping into and playing the the classic Mo movie uh in this settings and in this era. So we are creating incredibly detailed environment across the Sicily from the beautiful landscapes down to uh super detailed architecture. Uh one more feature we are bringing to this uh mafia old country we didn't have before is the seamless transition. So we are getting seamlessly from the game play",
            "start": 2746.16
        },
        {
            "text": "to uh super detailed architecture. Uh one more feature we are bringing to this uh mafia old country we didn't have before is the seamless transition. So we are getting seamlessly from the game play to the cinematics and back. So all the experience is fluent throughout the whole game. How much is that benefited by or because of Unreal Engine 5? I know you guys have talked a lot about that in some of the videos we've done, but I've got to imagine that's a big part of it. So you know um the technology advanced uh a lot since the first mafia you don't say 23 years with the moving uh as to anal engine 5 it opens uh new possibilities we were not able to uh reach before you know the details we are getting now is incredible. the nites uh allowing us to model everything like the environment, characters, cars, everything that you are losing even the sense and presence of the any triangles, polygons. It's so real realistic. The the lighting is so real and beautiful and uh makes the overall",
            "start": 2799.52
        },
        {
            "text": "characters, cars, everything that you are losing even the sense and presence of the any triangles, polygons. It's so real realistic. The the lighting is so real and beautiful and uh makes the overall picture so coherent and pleasant to eyes. uh and metahuman allowing us to not just create super real and detailed characters, but the how detailed how precisely we can transfer uh all those perfect uh performance from the stage to on the screen with all these micro details and on on the facial expression that you can feel and read the the emotions even without any spoken words. And I think you know you were the one of course to call out because these chuckleheads they don't care about the performers you do that the dawn so much more than just the voice that you guys did mocap these folks right have them in there what is why I don't say authenticity why does that matter so much and what does that bring in like what stories do you have from that authenticity authenticity thank you",
            "start": 2861.04
        },
        {
            "text": "right have them in there what is why I don't say authenticity why does that matter so much and what does that bring in like what stories do you have from that authenticity authenticity thank you authenticity really no but for bringing them in do you have like moments with them like is that what makes Do you think this story in cinema goes to a different level? Like what did you do you have stories about them that you loved? Help me here, Alex, please. I mean, yeah. I mean, there's plenty of course. Like there's that uh moment when um when the Dawn's uh cranking that horse that like Oh, we have footage of the cranking of the horse. No, no, no. I don't think we can show that. Um I mean I was on I was on the stage for a lot of the um for a lot of the mocap and actually the thing that really I that that um stands out to me when I remember from the um from the shoots is when we were shooting the scene of uh Enzo and Isabella's first meeting and obviously that's quite an important moment in",
            "start": 2919.28
        },
        {
            "text": "that that um stands out to me when I remember from the um from the shoots is when we were shooting the scene of uh Enzo and Isabella's first meeting and obviously that's quite an important moment in the story and we were like literally myself and Matthew Akin who's the lead writer on on on the game. We had been going back and forth for an hour beforehand rewriting the script like still trying to find the right you know just the right vibe. They got like I don't know 40 or 50 words in this thing and we writing it over and over again and when they did the scene it was amazing like you know everybody was kind of like hushed on the set. I actually got chills when I was watching them perform it and I'm really really looking forward to everybody playing that because it's it's a super cool moment and again I think indicative of a lot of the character nuance that we're getting from that moap uh uh process. That's actually something that um I think again going back to what Thomas was saying",
            "start": 2964.56
        },
        {
            "text": "and again I think indicative of a lot of the character nuance that we're getting from that moap uh uh process. That's actually something that um I think again going back to what Thomas was saying about the way we really now capture the the non-spoken uh acting because of the metahuman um some of these scenes that are are really really you know emotional scenes and maybe in the past you wouldn't have you know and not there's not many words spoken during them and you wouldn't necessarily get that in the game because the the nuances of the face wouldn't be wouldn't be there but but now they are and now there are moments that are actually unspoken where you you look at you look at it and it really it really you know hits you. So the little things that make them the facial movements that you would never normally get. Alex, you talked about being on set for those mocap moments and I've totally noticed that I didn't do my due diligence. How long have you been working on Mafia the Old",
            "start": 3004.48
        },
        {
            "text": "you would never normally get. Alex, you talked about being on set for those mocap moments and I've totally noticed that I didn't do my due diligence. How long have you been working on Mafia the Old Country? I mean the team, how long has this game been gestating? We get to this point. It's so exciting to get out in front of your audience to start showing gameplay. You know, we were joking back there, Nick. I was like, \"What did you do since rehearsal?\" And you were like, \"I've just been looking at gameplay reactions.\" Cuz again, like I think it's lost on us as gamers because on our end, there's a new game every week. There's something cool happening. Da da da da da. It's often lost that Yeah, it's been 23 years, but that's four games. You know what I mean? How long is this one being worked on? How big of a deal is it for you to be here right now saying, \"Here's our baby.\" It's a weird one actually because the first pitch for this game, I think I made it about 15 years ago when we we",
            "start": 3048.88
        },
        {
            "text": "on? How big of a deal is it for you to be here right now saying, \"Here's our baby.\" It's a weird one actually because the first pitch for this game, I think I made it about 15 years ago when we we were we were talking about the mafia story at large and the whole idea of telling the story of organized crime through the 20th century and the idea of going back to the start was there. That was before we decided to do the remake of the first game and things like that. That was part of that pitch even then. Um we started work on this this title just after we finished work on Mafia definitive edition. So um we just sort of taken a bath in Mafia. done the other definitive editions as well. Kind of reort discovered what was great about the IP and what we really loved about it and um yeah, so it's been four or five years of development, but first part of that was all on paper really story development and concept development. Um so yeah, now actually finally seeing it here and and and being at",
            "start": 3088.32
        },
        {
            "text": "been four or five years of development, but first part of that was all on paper really story development and concept development. Um so yeah, now actually finally seeing it here and and and being at the show in particular is like making it very real now. The game is going to come out soon is uh quite exciting. Thanks for coming. Congratulations, guys. You know what I mean? is what August is right around the corner. But I digress. Of course, before then you have to answer to your community. Uh we of course reached out. When I say we, I mean your amazing community managers over here for Mafia, the old country. Thank you so much. And said, \"Hey, who's got questions? They've got answers.\" So, we're going to read from this one. Good fella CL, which I mean, it seems Cleveland, you know, right? Probably maybe you're bombing these answers. Uh you have said the game is not open world but that you can explore areas. Can you elaborate on that? And even though the game is an is narrative driven,",
            "start": 3127.84
        },
        {
            "text": "Probably maybe you're bombing these answers. Uh you have said the game is not open world but that you can explore areas. Can you elaborate on that? And even though the game is an is narrative driven, will we be able to explore Sicily in more open areas? How interactive will the world be? Uh community managers, that was more than one question. Thought it was pretty clear, but let's start with that. It's not open world. I saw a buzz about that today that it was a linear one you guys said. Okay, I'll try and answer that question. So, I think the thing with this game is this, like Alex said, we started this when we came off Mafia the fifth edition. And we really took a lot of inspiration by how well, you know, that landed with people and, you know, the fact it's a focused story that takes you through. There's a world around you, but really we're pulling you through the journey. You know, we want these games are made for you to complete. We want you to see the story, right? So, um, so",
            "start": 3172.88
        },
        {
            "text": "you through. There's a world around you, but really we're pulling you through the journey. You know, we want these games are made for you to complete. We want you to see the story, right? So, um, so that's that's very much uh influenced the way we've created this game. So, when you're going through Sicily, when you're playing the game, you're going along a golden path, you're you're seeing the story unfold uh in front of you, but there are things going on around you in the world. There's there's uh if you stop and and and look around, you know, there's there's people in the fields harvesting crops. There's people going around their day. You can go off the the path if you want and explore elsewhere. So, it's kind of there's this beautiful world around you, but that's not our focus. Our focus has been let's do a real polished gem which is just something where it is super high quality AAA storytelling super high quality gameplay and that's the focus but yeah there is a environment around",
            "start": 3214.56
        },
        {
            "text": "has been let's do a real polished gem which is just something where it is super high quality AAA storytelling super high quality gameplay and that's the focus but yeah there is a environment around you if you want to go and look at it cuz it looks absolutely incredible but yeah we want you to go through that golden path that that that main story line I mean very similar to Mafia 1 and Mafia 2 I mean that's like literally the inspiration you know we wanted yeah you know we wanted to make a game that was of a similar kind of nature if you've played those games and you love those seems the the Murphy of the Old Country's got a very similar structure. Yeah. On behalf of me, yeah, I love that's what I want out of that. I want that tight mob story. So, yeah, that's pretty dope. Uh, EB Educational 21109. You can think of a better name. Uh, what types of missions and heists can players anticipate in Mafia: The Old Country, and how will they reflect the early era of organized crime in Sicily?",
            "start": 3254.32
        },
        {
            "text": "21109. You can think of a better name. Uh, what types of missions and heists can players anticipate in Mafia: The Old Country, and how will they reflect the early era of organized crime in Sicily? So um you know we've we tried to encompass a whole range of stuff when we were designing the game. We've got new scenarios that are entirely specific to the kind of things that happen in Sicily at the time. Actually the uh we saw some clips there of a kind of a kidnapping mission which was very common in that time. Bandits would go and kidnap people and kind of hold them to ransom. Not something that commonly happens in American crime. Um, but then we've got sort of similar scenarios to other mafia games. In some cases, some intentional remixes and revisiting of some some similar ideas. I mean, it's assassinations, it's killings, it's, you know, shootouts, it's, you know, all of the kind of uh the crime scenarios that you can imagine. And a lot of them have got like a distinctive Sicilian",
            "start": 3297.96
        },
        {
            "text": "it's assassinations, it's killings, it's, you know, shootouts, it's, you know, all of the kind of uh the crime scenarios that you can imagine. And a lot of them have got like a distinctive Sicilian twist, shootouts in Greek ruins or stealth missions in like catacombs and crypts, the kind of stuff that really is distinctive to the the time and place. question for me just off the top of my head here. When we're talking about this and we're talking about how deep this game is and how many things are going on, the story of this, the horses, the god, the horses, how much when you look at it and what you guys have right now back at the office is what you originally envisioned? You know, there's that old adage, right, of like every game's only 60% of the vision. Do you feel like you got above that? Yeah, I think probably closer to 80%. you never get everything you want, but like actually part of our goal here was to, you know, to sort of like design a game that we could deliver. So, um I'm,",
            "start": 3339.04
        },
        {
            "text": "Yeah, I think probably closer to 80%. you never get everything you want, but like actually part of our goal here was to, you know, to sort of like design a game that we could deliver. So, um I'm, you know, it's not more development talk now, but really we Yeah, we we got most of what we wanted to get in the can. So, uh I think we're pretty satisfied with that. Okay. And then final question comes from Game Over Gregy as well. Uh will there be any returning characters or references to the other Mafia games? You have a community here that loves Mafia, right? You're talking about the pantheon of protagonists. There's obviously you're pre-quilling it, so we're going forward, but there's people who could come back and be there. Like, are we doing that? Are we having that kind of crossover to make fans get excited? So, we've met some of the main characters today. There are additional characters, of course, in the main cast, and there are some returning characters. I'm not going to spoil who",
            "start": 3382.48
        },
        {
            "text": "fans get excited? So, we've met some of the main characters today. There are additional characters, of course, in the main cast, and there are some returning characters. I'm not going to spoil who those characters are now, but how many are there? There's four. Four. four four inerson returning characters. Some of them you're going to have to look quite carefully to find them, but they are there. They'll be babies. You'll walk by. They'll be in the hospital room. You can wait and see. Wait and see. Yeah. Any would you say horses? No. The horses are new. No. No horses. Horsepower. No comment. No comment on horsepower. All right. Uh we are just about out of time if you can believe it. But of course this isn't your last chance to see these fine gentlemen. Uh after this you can head down. Uh they are going to be doing a signing and signing room on level zero right after the panel. Uh 3:30 to 4:30. But before I let everybody go, is there anything else, Nick? Yeah, I've got one more thing to",
            "start": 3426.64
        },
        {
            "text": "are going to be doing a signing and signing room on level zero right after the panel. Uh 3:30 to 4:30. But before I let everybody go, is there anything else, Nick? Yeah, I've got one more thing to say to everyone. The first thing is it is just 3 months today until the game comes out. So we are working super hard to bring that to you. Um, as of today, you can now pre-order and we've got a gift for you all. Those of you that are in here and watching from home, if you scan this QR code, you get a special gift that that knife there, that can be yours. So, uh, there that's uh that's your reward for coming along today. So, thank you. Um, and we will see you in Sicily on August the 8th. Everybody, a round of applause, please, for hang. Well, hold on. Everybody's taking the Get your QR code scanned. You're not going to be able to applaud if you're QR scanning. Sir, how old is your phone? What was taking? All right. All right. Round of applause, please, for Hangar 13. Mafia the Old Country is",
            "start": 3478.24
        },
        {
            "text": "You're not going to be able to applaud if you're QR scanning. Sir, how old is your phone? What was taking? All right. All right. Round of applause, please, for Hangar 13. Mafia the Old Country is out August 8th. Have an amazing paxis. We'll see you at the signing, [Applause] everybody. Close. Airlock seven. You really don't know me, do you? The best high concept sci-fi rigomearroll in the universe is back.",
            "start": 3529.36
        }
    ]
}