{
    "id": 14092,
    "video_id": "wvQC5b_g2GU",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "Greg Miller's Superman Trailer Reaction & Breakdown",
    "description": "Go to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nGo to http://rocketmoney.com/KINDAFUNNY to cancel your unwanted subscriptions and reach your financial goals faster with Rocket Money.\n\nEnjoy this ad-free version! Thank you for the support! \n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1747265899,
    "duration": 4456,
    "transcript_chunks": [
        {
            "text": "[Music] Welcome back to another kind of funny trailer breakdown. This time to James Gun's Superman, the second full trailer. Greg, of course, I'm Tim Gettys. I'm joined with the biggest Superman fan I know, Greg Miller. Hi, Tim. How are you? I'm very good, but I'm sure not as good as you. Well, I'm not great. It's 12:17 as we record this. I have had to dodge everything, every question. I can't open Blue Sky. I can't look at Instagram. I I'll, you know, half-hazardly open it. It's either James Gun or David Korn. I see the DC Studios logo. I rip away. Yeah, you made me wait this long. You have not seen it yet. We can't do this trailer reaction live because last time we did a Superman one, we got in a little bit of trouble. Um, so we had to stop that. Um, so what we're doing now is recording it. We're going to post it and you guys can watch. Um, we're also doing our break or reactions and breakdowns to Iron Hart, Spider-Man Noir, and uh, The Peacemaker, uh, season 2 trailer. That'll be in",
            "start": 1.01
        },
        {
            "text": "We're going to post it and you guys can watch. Um, we're also doing our break or reactions and breakdowns to Iron Hart, Spider-Man Noir, and uh, The Peacemaker, uh, season 2 trailer. That'll be in a separate video. All three of those in one. But I'm sure that Superman's going to have the most discussion. Um, and I'm going to need the most help from you to explain to me what the hell's actually going on, who all people are. No, but I'm just assume, I mean, even based on last trailer, I'm like, Mr. Metamorpho. I'm like, I don't know what you're talking Mr. Just Mr. Terrific. Mr. Yeah, Mr. Terrific. That's a good guy. You know what I mean? There's a lot of people. There's a whole Isabella Mercedes here. You got to explain it all to me, Greg. I don't know if she's in the trailer. I don't know. I haven't seen it yet. I mean, she was in the Peacemaker teaser, so I'm I'm expecting Well, she'll be in the trailer. She's been in the teasers before for this movie. We're about to get a lot. Okay.",
            "start": 51.52
        },
        {
            "text": "I haven't seen it yet. I mean, she was in the Peacemaker teaser, so I'm I'm expecting Well, she'll be in the trailer. She's been in the teasers before for this movie. We're about to get a lot. Okay. You're going to learn some things from Greg Miller today. My first question is then, of course, I understand Roger's in there working the ones and two. We're down a man. We're making things happen out here. This is We are not going to do it this way. All right. I There's a giant glare right on me on the screen we'd be watching on. We have to figure this out. If it means killing every house light and it just it's a black frame reacting to this, I'll light myself with an iPhone. But I'm not watching the first [ __ ] fulllength Superman trailer with this giant light bar in the way. I don't I don't have a light bar. I don't think Yeah. [ __ ] Yeah, maybe. Maybe we should do that. Let's try. Does that change anything? No. No. Cuz it's it's it would be it's this guy up here. It's this one up",
            "start": 86.88
        },
        {
            "text": "have a light bar. I don't think Yeah. [ __ ] Yeah, maybe. Maybe we should do that. Let's try. Does that change anything? No. No. Cuz it's it's it would be it's this guy up here. It's this one up here. This is the [ __ ] trying to ruin my I love when Greg takes something seriously, you know? It's rare. It's very rare. But that means Superman or 911. All right. While we're Oh man, I was literally just to say thank you to our sponsor. I will say thank you to our Patreon producers Carl Jacobs, Omega Buster, and Delaney Twining. If you like this nonsense, please get the kind of funny membership. You get all these shows ad free. Uh you also get a daily exclusive Greg Wave for some reason. I can just watch I'd have none of it. I'd have none of it acting the way that he does on a daily basis. Um we're brought to you by Shady Rays, Raf Frames, and Rocket Money. We'll tell you about that later. We got to figure this out. Can I tilt the the screen forward? That screen will not tilt. Yeah, in its",
            "start": 124.08
        },
        {
            "text": "brought to you by Shady Rays, Raf Frames, and Rocket Money. We'll tell you about that later. We got to figure this out. Can I tilt the the screen forward? That screen will not tilt. Yeah, in its settings as it is set. Um, yeah, I I get it. This is a big issue. It should be solved if we just kill the two back lights, but I don't think that's as simple. Yeah, exactly. As it might sound over there on the the lighting board. It might be a fire hazard if I could grab a blanket. We could just toss them over the lights. Over the lights. Yeah, exactly. Okay. Okay, that sounds good. That sounds real good. This little that little guy up there and that little guy up there. If there's a way to just kill the back lights, I think that'll solve Greek's problem. You guys are not going to look great, though. Don't care. Don't care. Nobody cares about us. We never look great. Been on camera for 18 years. No one's ever been like, \"Man, that guy looks great. That guy looks great.\" That guy who just took",
            "start": 161.84
        },
        {
            "text": "Don't care. Don't care. Nobody cares about us. We never look great. Been on camera for 18 years. No one's ever been like, \"Man, that guy looks great. That guy looks great.\" That guy who just took down two Pac-Man donuts sure is the [ __ ] fit as a fiddle. Looking like a model. Did you take down two as well? I did. Yeah. Those strawberry donuts are too good. They're too good. I'm not a fan, man. Like, the moment that you get cute with the donuts, you you lose me. And even then, I like just my normal glazed ones. And they felt like the shitty ones that they just left out. Yeah. They didn't look the freshest on there. They weren't. I mean, here's the thing I will say. I'm not a I'm not a crispy cream guy. Yeah. If I was gonna go for a donut, I'd go for the mom and pop shop every time. I'd go for a Duncan. I'd go for a Dunkin Donuts and get the sprinkle there. Yeah. You did it. That was it. Thank you, Barrett. That's it. Yeah, that's it. That's it, everyone. You look great. I still look",
            "start": 200.0
        },
        {
            "text": "for a Duncan. I'd go for a Dunkin Donuts and get the sprinkle there. Yeah. You did it. That was it. Thank you, Barrett. That's it. Yeah, that's it. That's it, everyone. You look great. I still look great. Without further ado, let's superman it up. All right, let me press the button. Let me go here. All right, everybody. Here we go. 259. Nice. That's the logo I've seen a lot. It's gorgeous. Thank god, Rebecca. Are you being serious right now? Yeah. You'd let me interview you as Superman? Sure. [Music] Ready? Let's do it. Kronhite. Superman. Miss Lane. Recently, you've come under a lot of fire for what some might It's a lot. Today the Secretary of Defense said he was going to look into your actions. That That's funny. My actions? I stopped a war. Rick Fly. Yeah, Rick Fly. Maybe. Uh, not maybe. I did. In effect, you illegally entered a country. This is how you're going to be. I'm not the one being interviewed, Superman. Did you consult with the president? No. you seemingly acting as a",
            "start": 234.32
        },
        {
            "text": "I did. In effect, you illegally entered a country. This is how you're going to be. I'm not the one being interviewed, Superman. Did you consult with the president? No. you seemingly acting as a representative of the United States, representing anybody except for around the world and doing good. I would question myself in the same situation and consider the consequences. People were going to die. [Music] [ __ ] guys. Hey buddy, eyes up here. [Music] your choices. Hell yeah. Your actions, that's what makes you who you are. [Music] Superman. He's not a man. He's an it. Somehow become the focal point of the entire world's conversation. I will not accept that. I claimed your boots. I'll go get them for you. [Music] You have a dog. Gotta start with you, Greg. That got me. Yeah, you know what I mean? There's enough in there to well me up on that. That was a great one. That's exactly what I think I want out of this and especially out of a a Superman we need in 2025, right? Like this interview",
            "start": 292.24
        },
        {
            "text": "There's enough in there to well me up on that. That was a great one. That's exactly what I think I want out of this and especially out of a a Superman we need in 2025, right? Like this interview scene is so good. I think, you know, it's hard to talk about Superman in general and especially a cinematic version, I guess, and talk about the fact that like DCU was that the Clark and Lois we wanted wasn't we needed. You know that where I stand on all this, this not the DC universe I would have made. This looks very much like a DC universe I would have made, right? Uh I'm not at all if you're new around here and you're listening. This isn't me saying, \"Oh man, James Gun copied me.\" That's not it. But literally when I talked to you about like wanting to write a Superman comic and I did a whole thing about it in 2017, right? It was this idea and what does it start? It starts with Lois interviewing Clark interviewing Superman, right? So to get that there and then get an incredibly human Clark",
            "start": 433.84
        },
        {
            "text": "about it in 2017, right? It was this idea and what does it start? It starts with Lois interviewing Clark interviewing Superman, right? So to get that there and then get an incredibly human Clark there. Incredibly human Superman there, right? Where he's look at him get mad. When's the last time we saw Superman get mad but not like get angry. You know what I like especially when it's Lois here playing reporter, playing Lois Lane, playing the questions that he would be asked by the president, by the world at large. You know, I think they're already doing it there. This is this scene right there, the world they're establishing this trailer, and I'm not throwing shade at all by the Snider films, but it's already doing such a better job of what they were trying to do in BBS with Holly Hunter, right? Or no, is that her name? Holly Hunter. Yeah. Right. Where she was like, \"The world's been so busy. you know, being marveled at what Superman can do. They are not asking what he should do. And I",
            "start": 473.68
        },
        {
            "text": "Or no, is that her name? Holly Hunter. Yeah. Right. Where she was like, \"The world's been so busy. you know, being marveled at what Superman can do. They are not asking what he should do. And I think that's clearly what they're setting up here, right? As him going in stopping this civil war or not civil war, this war between two countries again pulled right from the headlines here of what would Superman do with Russia and UK Ukraine, right, in our own world right now. And then the political ramifications, world ramifications that would have here and have him dealing with it looks like uh from this, right? dealing with what a Superman's place is in a world that is so fraught with countries, boundaries, borders, what how is this all going to work out? And then of course seeing Lex on top of that obviously pulling the strings, you'd assume and yada yada yada like [ __ ] yeah, this looks amazing. Yeah, I mean I thought it was a great trailer. Again, I with a a score this good, I feel like",
            "start": 520.56
        },
        {
            "text": "that obviously pulling the strings, you'd assume and yada yada yada like [ __ ] yeah, this looks amazing. Yeah, I mean I thought it was a great trailer. Again, I with a a score this good, I feel like it'd be impossible to to cut a bad trailer. But, um, there's something about the the color grading of Superman so far, everything we've seen about it that I just really appreciate because it sticks to the comic book roots of being colorful. And, you know, we've had now hundreds of superhero comic book movies. We've talked about them in depth. And I do think we get to a point where it all starts to fit into this category or this category or this category. And I don't know that this is breaking any new grounds, but for it to be a Superman movie that has this look of everything's blue and orange tinted that reminds me of like, oh, this is about to be a quality graphic novel. Like there's a style to it. Like I think of like Spider-Man blue, you know, where it's just like, all right, cool.",
            "start": 558.88
        },
        {
            "text": "tinted that reminds me of like, oh, this is about to be a quality graphic novel. Like there's a style to it. Like I think of like Spider-Man blue, you know, where it's just like, all right, cool. There's an art style that backs this up and they're telling a cohesive story here that excites me. I feel like it kind of just gives it a bit of an identity even if it's not like and it's it's very funny that like this is coming out in the same month as Fantastic. styiz similar um I I I feel like I can use very similar words to explain how I feel about that. Um but and I actually I think it's very apt where we have two incredibly iconic to Marvel and DC respectively like uh characters that have not really had their time to shine for one reason or another. Yeah. Well, they've had times to shine but they didn't shine in movies, right? So to to come out and and do this and have such a a great vibe from the jump I think is important. I still really wonder what this movie is like what it's going",
            "start": 600.8
        },
        {
            "text": "they didn't shine in movies, right? So to to come out and and do this and have such a a great vibe from the jump I think is important. I still really wonder what this movie is like what it's going to be. It seems like everything in the kitchen sink. James Gun's proven he can make that work though, so I have no reason to fear. Um but I as not the biggest Superman fan at all watching this I am like, \"Oh wow, he's acting kind of like a dude.\" And um yeah, like him in the interview, the way he's talking to Lois here, it's like it it seems a little out of character for what I would expect from Superman, but I think it's because Exactly. From what I know of Superman is I'm the only guy who loves Superman and it's because of I think su I think of Superman being this. That's the thing and that's what we've lost throughout the Snider verse. I would go as far back. I know we're going to do Superman in review so you're going to see it firsthand. even the Donner film and what Christopher Reev did",
            "start": 644.56
        },
        {
            "text": "we've lost throughout the Snider verse. I would go as far back. I know we're going to do Superman in review so you're going to see it firsthand. even the Donner film and what Christopher Reev did which was such a great interpretation of a silver age Superman, a golden age Superman even to see a modern Superman where I think what you're seeing there and even that back and forth between Clark and Lois. She's interviewing Superman but he's responding as Clark in these instances which is so vital to the fact that Clark Kent is Superman. Superman isn't Clark Kent. Clark Kent is a human being and I know he's not but strict with me of like he is just a person. And so the way he's he's going to talk to Lois Lane is so far different than how he's going to present himself in public, how he would talk to a different reporter, how he would talk if he was actually being interviewed and whatever he thinks, right? And the way she's coaching him there again, how many times have we gone home and we're",
            "start": 692.96
        },
        {
            "text": "to a different reporter, how he would talk if he was actually being interviewed and whatever he thinks, right? And the way she's coaching him there again, how many times have we gone home and we're dealing with something at kind of funny, dealing with something publicly, and we talk to Gia for you, Jen for me, right? And it is that thing where you start getting vetted and you know, you say something, I want to say it that way. You know what I mean? like you're going back and forth of dealing with your own. You're a human being. You have this emotional spectrum that you're feeling, but you know you can't do that when you go out and represent. Kind of funny when you represent Superman, when you represent whatever's going on. Yeah. I mean, so is there anything you're surprised to see in this trailer? Oh um I think more than you not right it would be similar to what you're saying is that it's everything in the kitchen sink which isn't I like I like looking at this and even though I'm sure",
            "start": 734.4
        },
        {
            "text": "trailer? Oh um I think more than you not right it would be similar to what you're saying is that it's everything in the kitchen sink which isn't I like I like looking at this and even though I'm sure when we start breaking it down I'm going to start telling you what I've already told you in the be other ones of this is what I think is happening da da da da you put it together but I enjoy that there is a grander plot going on here. Um, I'm surprised in a way it does go so similar to what we saw in BBS. Remember, of course, the big brew haha there was the framing of Superman for killing a bunch of people in a foreign space, right? And then how that made it work. The fact that we're leaning back into that with him breaking up the war here and I'm going to say it wrong, but Bo Broaria Broia, something like that. Um, is interesting. And again, how Lex is tied into that will be interesting. How Rick Flag Senior, of course. Yes, from Creature Commandos uh will be tied up in this. We see the",
            "start": 769.44
        },
        {
            "text": "something like that. Um, is interesting. And again, how Lex is tied into that will be interesting. How Rick Flag Senior, of course. Yes, from Creature Commandos uh will be tied up in this. We see the hammer of Brovaria there, a James Gun original for this picture. Like it's a I think it is something ripped from the headlines in a lot of different ways of what would a Superman do in our world where there are all these conflicts. You know what I mean? It's my joke when I go back to I know no future spoilers for you. Sorry, Tim. But in Superman 4, when Superman walks into the United Nations and announces he's going to rid the world of nuclear weapons and all of the UN cheers him on, no one being like, \"This alien is ripping away our autonomy as a nation state. What are we doing?\" So to see how that falls in here to see again with, you know, I had the early on theory that Lex goes to the fortress, unleashes all the people or all the creatures Superman's either put in the Phantom Zone or",
            "start": 823.48
        },
        {
            "text": "how that falls in here to see again with, you know, I had the early on theory that Lex goes to the fortress, unleashes all the people or all the creatures Superman's either put in the Phantom Zone or like the animated series kept behind glass. I still think that's probably what's happening, but it's interesting that it's more based off of this and then so then you get to, you know, him getting hit in the head with the trash when he walks in. Is that him fighting these creatures and Lex saying, \"Hey, look at these creatures he put out.\" Or is it the hammer of Brovaria shows up, beats the [ __ ] out of Superman for a while, [ __ ] up Metropolis, and then it is him dealing with the fact that people are pissed that this fight's been brought to our door. Again, in a very similar way, right? If Superman was to go break up Russia, Ukraine, right? And then some Russian uh anti-hero, but a hero to them, villain to us, you know, it's all where what are you looking at the glass? Shows up and",
            "start": 863.92
        },
        {
            "text": "If Superman was to go break up Russia, Ukraine, right? And then some Russian uh anti-hero, but a hero to them, villain to us, you know, it's all where what are you looking at the glass? Shows up and beats the [ __ ] out of Superman in our in New York. And we're like, dude, why don't you just stay the [ __ ] out of this, right? And there'd be people who would actually feel that rather than, you know, Superman trying to use his powers for good. But if it's just one man deciding what's good, you're going to have a lot of problems there. Yeah. um before we do the full breakdown of all of the the screen by screen frame by frame situation like I feel like every time we see this there's more and more things in it right like more characters and more different groups and all of that gut check and I know that this is a loaded question and I mean it that way do you think that with all these groups it's not the Justice League these are a lot of people DLE like DC groups to an outsider Do you",
            "start": 901.68
        },
        {
            "text": "and I know that this is a loaded question and I mean it that way do you think that with all these groups it's not the Justice League these are a lot of people DLE like DC groups to an outsider Do you agree that they're D and do you think that that's the right move to start this all off with? Yeah, I mean, you know, Guy Gardner holds a special place in my part my heart, but Guy Gardner is a [ __ ] right? So, it's like I with us knowing Lantern's already filming and Guy Gardner's in that [ __ ] hell yeah. I I this is what you need I think of it's Superman. He is the star of this film. We're not trying to drop in Batman, Wonder Woman, etc. Have them all even how Jordan Green Lantern, right? Like I know that there's going to be more cameos in here, right? I think it is all but officially confirmed, but it might even be officially confirmed that Supergirl is going to be in this, right? Uh they're filming her movie one woman of Tomorrow right now. Like I expect those Poppins and those",
            "start": 942.96
        },
        {
            "text": "confirmed, but it might even be officially confirmed that Supergirl is going to be in this, right? Uh they're filming her movie one woman of Tomorrow right now. Like I expect those Poppins and those cameos to still be so brief. Even what we see here with Maxwell Lord's Justice League, right, of Hot Girl and Mr. Terrific. We see them over in The Conflict and we see them in Metropolis. I imagine those are really their only two big scenes of what's getting involved. I obviously the conflict is going to be obviously I say because it's Superman the conflict is Superman versus Lex. So I don't know what strings Lex has pulled to make the war go over. Maybe he didn't maybe Superman did actually just go get involved and now Lex is using that as his opportunity to bring in Ultram Man to bring in the engineer to have them upset the balance of power here. But I doubt that's what it is. Lex is always one step ahead, right? And he's always pulling all the schemes, stream strings. They are seeing,",
            "start": 987.76
        },
        {
            "text": "engineer to have them upset the balance of power here. But I doubt that's what it is. Lex is always one step ahead, right? And he's always pulling all the schemes, stream strings. They are seeing, you know, Clark laid up in the Smallville bed. I'm very interested in that. Right. That's the first point. I mean, we've seen him obviously in the teaser, get a [ __ ] kicked in, and then have to be out there. Oh, wait. Actually, well, we're we're going to do a frame by frame. Metamorphos hand looked pretty interesting there. Yeah. I want to I want to get all of your thoughts on everything going on in this, Greg. But we're going to do that right after a quick word from our sponsors. This episode is brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized sunglasses that won't break the bank. Shady Rays is an independent sunglasses company offering a world-class product rated five stars by",
            "start": 1028.96
        },
        {
            "text": "friends at Shady Rays have you covered with premium polarized sunglasses that won't break the bank. Shady Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people. Their shades have durable frames and crystal clear optics, making them the perfect choice for all outdoor adventures. They have hundreds of options to choose from, so you're bound to find the perfect pair to match your style. Take it from Tim Gettys, who rocks his shady rays every day, going on Pokemon Go Walks out and about SF looking dope. If you don't love your shades, exchange for a new pair or return worry-free within 30 days. There's no risk when you shop. Their team always has your back with personal and fast support. Exclusively for our listeners, Shadyra is giving out their best deal. Head to shadyrays.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. That's shady.com promo code funny.",
            "start": 1068.56
        },
        {
            "text": "out their best deal. Head to shadyrays.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. That's shady.com promo code funny. This episode is brought to you by Aura Frames. Every day we're taking photos from big events to silly moments. But doesn't it sometimes feel like all of your favorite photos are just stuck on your camera roll? Wouldn't it be great to have an easy way to share and enjoy them with friends and family? That's where Aura comes in. Aura makes it effortless to upload unlimited photos and videos directly from your phone, so your favorite memories are always within view. Plus, you can personalize and preload an Aura frame for a unique and special gift. We love Aura Frames in this office. Roger has one at home he got for his fiance's birthday, and she absolutely loves it. It takes about 2 minutes to set up the frame using the Aura app. Add unlimited photos and videos and invite as many people as",
            "start": 1110.64
        },
        {
            "text": "at home he got for his fiance's birthday, and she absolutely loves it. It takes about 2 minutes to set up the frame using the Aura app. Add unlimited photos and videos and invite as many people as you want to an Aura frame. There are absolutely no hidden fees or subscriptions. And for a limited time, listeners can save on the perfect gift by going to aura.com to get $20 off plus free shipping on their bestselling Carver matte frame. That's auraframes.com, promo code aura 20. Support the show by mentioning us at checkout. Terms and conditions apply. This episode's brought to you by Rocket Money. With prices going up on just about everything lately, being smart with your money isn't just a good idea. It's essential. But managing subscriptions, tracking spending, and cutting costs can feel overwhelming. Lucky for you, Rocket Money takes the guesswork out of it so you can easily make smart decisions. Rocket Money has helped multiple members of Kind of Funny learn they were still paying",
            "start": 1154.24
        },
        {
            "text": "overwhelming. Lucky for you, Rocket Money takes the guesswork out of it so you can easily make smart decisions. Rocket Money has helped multiple members of Kind of Funny learn they were still paying for things they totally didn't even realize. Rocket Money is a personal finance app that helps find and cancel your unwanted subscriptions, monitors your spending, and helps lower your bills so you can grow your savings. Rocket Money's dashboard gives you a clear view of your expenses across all of your accounts. And then you get alerts if bills increase in price, there's unusual spending activity, or if you're close to going over budget. Rocket Money has over 5 million users and has saved a total of 500 million in canceled subscriptions, saving members up to $740 a year while using the app's premium features. Cancel your unwanted subscriptions and reach your financial goals faster with Rocket Money. Go to rocketmoney.com/kindfunn today. That's",
            "start": 1196.08
        },
        {
            "text": "up to $740 a year while using the app's premium features. Cancel your unwanted subscriptions and reach your financial goals faster with Rocket Money. Go to rocketmoney.com/kindfunn today. That's rocketmoney.com/kindafoney.money.com/kindafoney. pocketmoney.com/kindafoney. Roger, before we get into the frame by frame, do you have any quick thoughts on that? Oh, no, that was awesome. That's exactly what I was looking for. I mean, after watching uh my adventures with um Superman uh the animated show, uh seeing more Yeah, Jack Quaid's incredible and then it's because he's a more human version of Superman. Um that's that that was my first represent uh brush with that representation of Superman. So, it's nice to see kind of Clark flip his lid a little bit there. That was that's nice and I think that's going to go a long way especially putting this in this first real trailer is is really huge uh in my opinion to to kind of get that over and show hey Superman is a multifaceted character here.",
            "start": 1234.8
        },
        {
            "text": "that's going to go a long way especially putting this in this first real trailer is is really huge uh in my opinion to to kind of get that over and show hey Superman is a multifaceted character here. He's not just what you remember from back in the day. Yeah. Yeah. Good stuff. All right. Let's get into this frame by frame. Greg Professor Greg. Sure. No pressure. Break it down. So that's the DC Comics logo. It's the best logo they ever had. They went away from it for a long time and that sucked. It was baby. Uh this is Clark and Lois. You might know. I'm kidding. Uh I think you know you talked about the gold in the you uh brought up Spider-Man blue for me being a DC kid of course actually if you could go back there's a fun one there. Uh the thing it reminds me of for this especially is Allstar Superman which had such a caliber pause right there. Lord tech at the top of that. Of course you're going to be very familiar with Maxwell Lord soon enough. Maxwell Lord is running the Justice",
            "start": 1278.48
        },
        {
            "text": "Superman which had such a caliber pause right there. Lord tech at the top of that. Of course you're going to be very familiar with Maxwell Lord soon enough. Maxwell Lord is running the Justice League. It could be better. Sure. Yes. Yes. Wonder Pascal. Yes. Yes. Who could forget? Never. Never never forget that. Uh instead, this will be Shawn Gun, James Gun's brother, who does all the voices and all the characters for Rocket and Weasel. Uh he is Maxwell Lord in this. You saw him in the Peacemaker teaser trailer uh that debuted before uh Walking Dead. Yes, Last of Us. There I can only keep so many things straight. Anyways, with him flanked by Hawk Girl and uh Guy Gardner, of course, the rumor forever has been that he's the funding this Justice League, so it's not even the real Justice League. Maybe it's Justice League International like the comics. We'll get into that. Justice League, Justice Society of America. That's different. Justice League. It is different. Oh, so Maxwell Lord",
            "start": 1318.88
        },
        {
            "text": "Maybe it's Justice League International like the comics. We'll get into that. Justice League, Justice Society of America. That's different. Justice League. It is different. Oh, so Maxwell Lord bonding a Justice. I mean, again, we don't know what's happening, but the logo they have looks more like a JL than a JS and that stuff. Okay, that's that's true cuz um in Black Adam, right? Yeah. It was Justice Society and that was Hawk Guy. Hawkman. Hawk Man. Yeah. Yeah. Justice Society is the golden age Justice League. Okay. And it's like that's what the original Flash, right? Jay Garrick with the little silver uh thing with the wings on top of it. Yeah. Hawk guy. Hawk Man. Uh but the boxer cat guy. I can never I can't remember his name right now. But yeah, that idea and and Dr. Fate, of course. Yeah. So they pulled on that thread for Doctor or Black Adam because of more of the mysticky thing. Cool. But you think this is different direction? Yeah. I mean again I'm cheating. That's a been a",
            "start": 1363.12
        },
        {
            "text": "Yeah. So they pulled on that thread for Doctor or Black Adam because of more of the mysticky thing. Cool. But you think this is different direction? Yeah. I mean again I'm cheating. That's a been a rumor forever. So, it's not like something I'm pulling off. And when we were watching it originally, I forget. I was the first thing I was all about the logo and people were like, \"It's Justice League has already been kind of confirmed.\" Okay. Sorry. Go ahead. Again, I think we're just getting a snippet here, but damn, the chemistry between these two, right? Uh, there was a fun one. Uh, pause. I love this little Easter egg I caught in the back there. The framed Lois, but with clouds. I assume at some point Superman had to write a message to Lois or maybe it was just for fun. Maybe it was for saving something and that she got that and framed it and put it up in her apartment. I assume we're in lots of books cuz she reads cuz she's a reporter. Spaceship down there. Pause. This is nice. What",
            "start": 1408.08
        },
        {
            "text": "something and that she got that and framed it and put it up in her apartment. I assume we're in lots of books cuz she reads cuz she's a reporter. Spaceship down there. Pause. This is nice. What if you want to go back one uh to see the spaceship a bit more? Uh interesting vibe to it. Kind of got that U- shape. Is it Ultram Man's thing? We'll find out. Who knows for right now what's going on exactly. Smash through the side of the building there though, too. You're already there in the after effects again. Superman being booed. Which which version? Because Lex just told the world he let all these things out of the Phantom Zone that he's been saving. He should have killed these creatures. He should have euthanized him and said he's been holding him in his jail in the Arctic. Or is it because of uh interfering in this war and now having the hammer of Braavaria come to your door? Uh, of course in the front Stag Industries, this is where we're going to walk into. We already talked about",
            "start": 1447.12
        },
        {
            "text": "of uh interfering in this war and now having the hammer of Braavaria come to your door? Uh, of course in the front Stag Industries, this is where we're going to walk into. We already talked about this. You keep saying this Hammer of Bravaria situation. Is this the Creature Commandos place? No, this is different. If you remember when we watched Creature Commandos, then the I I caught up on all the episodes at the time because they were about to drop the teaser for Superman and there was this thing and I thought for a second maybe that was the fact it wasn't. And then so many people had called out to me uh that from the shooting of the movie they had a newspaper article written by Clark Kent about the hammer of Brovaria being pissed off that Superman got involved in this war. He was coming over here and [ __ ] [ __ ] up then in fighting Superman. Even though I guess he's not he's not it's not like a title the president of Brovari is like hey he's not with us in a similar way. I imagine",
            "start": 1478.24
        },
        {
            "text": "over here and [ __ ] [ __ ] up then in fighting Superman. Even though I guess he's not he's not it's not like a title the president of Brovari is like hey he's not with us in a similar way. I imagine our president's like, \"Yo, Superman ain't a representative of America.\" But Stag is from the other one we've seen. This is leading into, of course, uh, him having this confrontation we saw with Green Lantern, Guygardner, and Huck Girl when they walk in and Guy Gardner goes like that and blocks out the windows. Yeah, this one right here. I guess I could have just let it play, but I don't I haven't memorized the new trailer I just watched. Interesting that they say the department or whatever director of defense or whatever his official title is. And then cut to Rick Flag Senior indicating he's got quite the promotion from when we last saw him, of course, uh banging in the one and only Creature Commandos. Yeah, Creature Commandos. Excellent show. Lot of fun. I I highly recommend people watch",
            "start": 1526.72
        },
        {
            "text": "quite the promotion from when we last saw him, of course, uh banging in the one and only Creature Commandos. Yeah, Creature Commandos. Excellent show. Lot of fun. I I highly recommend people watch it. Also, not that long, so it's kind of a a quick fun little easy breezy show. Um but yeah, Rick Flag. Um I Oh man, I had his name. This actor's name had him in my mind. Crossbone. Gorillo. That's his last name. Say it again. Gorillo. Gorillo is his last name. Yes. Frank Gorilla, thank you so much. Really, really enjoy him. I think he uh has a a great screen presence. Um a real nice kind of like that gruff actiony vibe. Um but a little on the leaner side, so it's not just like pure man muscle. Yeah. Um so yeah, him as Rick Flag Senior in live action. Love that they're they're doing the back and forth, him being the voice in the cartoon, but also here. Um obviously there's been a lot of interest. I'll say it's a mix of fear and hesitation and hope when it comes to James Gun's DC universe and",
            "start": 1564.08
        },
        {
            "text": "forth, him being the voice in the cartoon, but also here. Um obviously there's been a lot of interest. I'll say it's a mix of fear and hesitation and hope when it comes to James Gun's DC universe and how everything's connected and as much as possible the voice actors are going to be the actors and all of that. Um, but to see already so much indication of oh, they're doing it, they're actually like committing to that is is cool to see because I think we could all agree leading with Creature Commandos is a bizarre choice, not the best thing ever. Um, but that was a good show and if they are uh following up on it this way, I'm like, cool. That's probably going to be a good thing for the people that the many majority of people that did not watch Creature Commandos hopefully fall in love with watching Superman and then want more of this and it'll all kind of connect Peacemaker as well. Yeah, I was going to say, you know, Peacemaker coming out after this. Something I had thought about when",
            "start": 1604.72
        },
        {
            "text": "watching Superman and then want more of this and it'll all kind of connect Peacemaker as well. Yeah, I was going to say, you know, Peacemaker coming out after this. Something I had thought about when I caught the tr the teaser. I was like, \"Oh, awesome. They're doing the Superman stuff and they're like, \"Oh, okay. That's actually going to be here.\" Which is interesting. Then you guess showing the hand at least that that Justice League will still exist after the events of Superman. Yeah. But even there just like the character like I really love this I'm going to say quote unquote fight. It's not a fight. But this back and forth again of Lois I think it's very interesting even just from glancing at it, right? Lois moving into oh I can interview Superman. I'm going into reporter mode. I'm not gonna pull my punches. And then Clark being like oh I want to say it like from the very beginning I want to say it that way. And like no you I would. You know what I and like him not taking the",
            "start": 1649.52
        },
        {
            "text": "not gonna pull my punches. And then Clark being like oh I want to say it like from the very beginning I want to say it that way. And like no you I would. You know what I and like him not taking the exercise as seriously as I think she is. And god damn David, he looks good, huh? He looks good. Were they born born in labs? We'll find out. Uh this classic shot we've seen so many times now of uh the Daily Planet staff here. Lois Cat, Jimmy, uh Ron Troop, uh the sports guys in the back, Vince. Uh good stuff over there. Now, here we got Ultram Man walking with engineer walking Superman in. Okay, stop. Sure. You're going to have to explain more. Ultra Man. Yeah, this is one that again in our I've I waver. How much do I need to know? How much do I want to know? How much do I want to spoil myself? Future spoilers for when we do Superman in review. I [ __ ] up my entire Superman Returns watching experience by devouring everything. Right. So, I've kind of tried to keep it to what we watch in",
            "start": 1686.56
        },
        {
            "text": "Future spoilers for when we do Superman in review. I [ __ ] up my entire Superman Returns watching experience by devouring everything. Right. So, I've kind of tried to keep it to what we watch in trailers and teasers and then when somebody tries to educate me on something chat usually, even though we're not live today because of warriors coming at me. So, the internet is all but like no, no, that's Ultram Man. So, because of the U on his chest, which of course makes sense and I get, but it's just such a different interpretation of Ultram Man as we currently know him in comics. Ultramman generally is the Earth three Superman from the evil group of everybody. He's he's the evil Superman flanked by the evil Wonder Woman flank and they all have the little twists on their names, right? So, from what we've seen of Ultram Man in the trailers, both here restraining Superman and then also fighting him in the baseball stadium, right? Good job on the poll here. Thank you very much. It's like,",
            "start": 1735.52
        },
        {
            "text": "what we've seen of Ultram Man in the trailers, both here restraining Superman and then also fighting him in the baseball stadium, right? Good job on the poll here. Thank you very much. It's like, okay, I can see him matching Superman on a power level, but am I to believe? Like, it also then makes sense of why he's covered that eventually they're going to get into this fight and he's going to do the face off and it is David Corin sweat. Now, this opens up a whole can of worms that during commercial break, I immediately was like, what are other people catching that I'm not catching? What are they diving into? I think it's very interesting and we can get I was gonna save it till we get there, but we're all we're all jumping around. We're all doing our thing here. Bimbley Bimbley Screen Rant in their things they're pulling out, right? It says, \"Could Superman's trailer hint at a multiverse story?\" And what they're citing is not the Ultram Man stuff, right? But way later when I'll I'll",
            "start": 1782.88
        },
        {
            "text": "in their things they're pulling out, right? It says, \"Could Superman's trailer hint at a multiverse story?\" And what they're citing is not the Ultram Man stuff, right? But way later when I'll I'll pull it up, but when it looks like Mr. Terrific and Lois are coming out of some kind of they call portal and they're using that to jump off of the same fact of Peacemaker. The teaser we saw has of course pulling from the events we know from the DCU but not and James is very clear about that but the fact that there is a scene there of Peacemaker meeting Peacemaker and so is that a world thing and again if you're going to immediately introduce Ultra Man and he is going to do the face the mask reveal that he is evil Corin sweat. Okay, this is what the screen rat's calling as maybe thing. Who knows, right? I'm going to read from Screen Rat's article, right? Oh, man. The final reveal worth mentioning from Superman's official trailer is the potentiality of a multiversal story. Uh, few quick",
            "start": 1825.68
        },
        {
            "text": "knows, right? I'm going to read from Screen Rat's article, right? Oh, man. The final reveal worth mentioning from Superman's official trailer is the potentiality of a multiversal story. Uh, few quick glimpses towards the end of the trailer hint at this with Mr. Terrific and Lois Lane looking through looking as though they are standing in a portal. This portal exit is into a dark void-like plane that Superman is later briefly shown flying through amid the debris of multiple buildings. This combined with the hints from Peacemaker season 2's trailer could indicate that Superman is already hinting at multiversal possibilities in DC's future. I come down several different ways on this. Right. First off, I look at this and it kind of looks like boom tube technology. Not exactly. That would be you know boom tubes from from Dark Side Apocalypse. We saw that of course in the other one. Probably not. Maybe Greg. I've been hearing you say boom tube for over a decade. It solves a lot of things.",
            "start": 1873.28
        },
        {
            "text": "you know boom tubes from from Dark Side Apocalypse. We saw that of course in the other one. Probably not. Maybe Greg. I've been hearing you say boom tube for over a decade. It solves a lot of things. Mother box. What up? Uh, I don't I don't buy that James Gunn is rebooting the DC U and is immediately going to be like, \"Let's do Multiverse.\" As soon as I say that, I also understand as a DC Comics fan how much the Infinite Earths is part of DC. So, I could see him do it of Hey, guess what? The multi not like the multiverse exists. Ultram man's Ultram man's from Earth [ __ ] three. Lois has to go into Earth three for a second to get whatever with Mr. Terrific to do the thing. Notice Mr. Terrific not in the Justice League tease with Peacemaker. Right. I I'm making an executive decision here, Raj. If we can technically do it. Can we watch the Peacemaker trailer right now? I think we have the capabilities, Tim. Okay. The teaser or because there's a trailer you want to watch today and Right.",
            "start": 1911.68
        },
        {
            "text": "If we can technically do it. Can we watch the Peacemaker trailer right now? I think we have the capabilities, Tim. Okay. The teaser or because there's a trailer you want to watch today and Right. Yeah. I I I I'm confused if they're different or not. It's a two minute. This is clearly longer if that's too if it's So they had they had a shorter teaser that they showed between uh before left uh [ __ ] Walking Dead, whatever. Uh Last Last of Us. Uh and then uh yeah, they have the full trailer out. Let's let's watch this cuz I feel like the conversation we're having sounds like they're starting to run into each other. It's going to be better if we we combine uh the stuff here. Yeah, for sure. Do you really want to taste it? Oh, sorry. Uh you did great. What are you talking about? Oh, you see him? Yeah. Yeah. Everything is right where I need to be. Uh sorry. Hold on. Give me two seconds. Do your thing. You do this and then I press this button. Cool question. You ready? Yep. They're going to",
            "start": 1961.12
        },
        {
            "text": "Yeah. Yeah. Everything is right where I need to be. Uh sorry. Hold on. Give me two seconds. Do your thing. You do this and then I press this button. Cool question. You ready? Yep. They're going to be doing back flips to get you to join. Welcome, Peacemaker. Or do you prefer Chris? Maxwell. Either's fine. Can you tell us a little about your skills? I'm considered the finest marksman in the world. The mic is off. Yeah. I am also proficient in hand to hand combat. How many more of these do we have today? Is that popcorn still here? Love Bob Gordon. My buzz is getting really big lately. I have a variety of helmets. This guy sucks. Excuse me. Am I supposed to be able to hear you guys? Excuse me. You were talking about your button stuff and also you said that I suck. It is not funny. I don't get it. We saved the world. I thought everyone finally treat us like heroes. I don't need anybody else. I just forge my own path. You're living in the worst level of Grand Theft Auto. I've come to the",
            "start": 2001.36
        },
        {
            "text": "it. We saved the world. I thought everyone finally treat us like heroes. I don't need anybody else. I just forge my own path. You're living in the worst level of Grand Theft Auto. I've come to the conclusion you suffer from a particularly severe form of toxic masculinity. What? Argus has been monitoring Peacemaker ever since Rick Flag Senior was named director. Does he know that I am? Kill his son. Media. Bring me Peacemaker. Mixali, need to scan for any anomalies throughout that house. Pony boy, don't let him out of your sight. Titties, I want you to take the front door. And see, man, you take the back door. Got it. Yeah, but not the [ __ ] names. Dude, you can't just call us that. Where do you think we are? [ __ ] Berkeley. We haven't always been great people, but we are the 11 street kids. No one will ever break us apart. You ready for the next adventure, pal? Keep see who the [ __ ] are you? A lot of doors there. Yeah, we had a whole thing with pocket dimensions last time around,",
            "start": 2054.8
        },
        {
            "text": "No one will ever break us apart. You ready for the next adventure, pal? Keep see who the [ __ ] are you? A lot of doors there. Yeah, we had a whole thing with pocket dimensions last time around, right, where uh his dad, the T1000, Robert Patrick had a pocket dimension to store all their [ __ ] in or whatever. Yeah, I think it's it's not beyond the realm of possibility that again, not in a Andrew Garfield comes through the portal way. It is just like, yeah, no, there's a million Earths. There's an infinite Earths. And so they introduce this and it's like, oh man, we've even we've known about it. Lexus cracked the code, went and got that sup Superman, Ultram Man, brought him in. That's what it's going to be. I think Sounds like a crisis. It does. I mean, that's where we're inevitably this, you know, that's where they'd love to get this [ __ ] That's where they would love to get this if it doesn't collapse under the [ __ ] inadequacies of Warner Brothers. Once again, I don't want to go",
            "start": 2115.68
        },
        {
            "text": "you know, that's where they'd love to get this [ __ ] That's where they would love to get this if it doesn't collapse under the [ __ ] inadequacies of Warner Brothers. Once again, I don't want to go too down into this right now, but obviously the multiverse is uh happen, right? Everywhere you look is multiverse. Multiverse Marvel, Multiverse DC, Multiverse Invincible, like everything's multiverse and people are so over the multiverse. Even in DCU, we we just closed that loop with Multiverse with the Flash, which is why I would still put my money on it is not happening. Yeah. Okay. I would still put my money on they are not fully committing to doing this. And again, I I what I mean by fully committing is I mean making it a gigantic plot point. Yeah. You know what I It's just a thing that exists because this world has existed which means the multiverse exists because maybe they've already had a crisis. Maybe they've already met other versions of themselves, you know. So, just talking",
            "start": 2181.6
        },
        {
            "text": "exists because this world has existed which means the multiverse exists because maybe they've already had a crisis. Maybe they've already met other versions of themselves, you know. So, just talking about the Peacemaker side of this. Yeah. Do you think Greg Miller just without looking too deep into it, do you think that this is DCU Peacemaker and new DCU Peacemaker and they're like having some type of like let's blend season one and two and make that clear or no? I'm watching again. I just want to see it again. Cuz I mean, even if with what I just said, like this guy, the one on the right, which one would that be? The one on the left. He's in a very nice building, right? He's in a very nice thing. So, I think it's like he'd be the the suit even, right? He'd be a different universe. He'd be the universe where Peacemaker is successful and is a well-loved hero or some [ __ ] like that. Yeah. So, not DCU, like a different universe even, right? Yeah. Yeah. Yeah. Cuz I don't I think that's",
            "start": 2228.24
        },
        {
            "text": "the universe where Peacemaker is successful and is a well-loved hero or some [ __ ] like that. Yeah. So, not DCU, like a different universe even, right? Yeah. Yeah. Yeah. Cuz I don't I think that's the kind of [ __ ] they're going to not want to get get into. Yeah. They're not going to want to open the door to though, this is the DC EU caval universe. Yeah. But then again, I just I But here's my thing. I get and and I know this is a stupid thing cuz it's like, yeah, just [ __ ] move past and don't worry about it. But I do worry about it when I love Peacemaker. I love Creature Commandos. Peacemaker season one. They're calling this Peacemaker season two. Season one ended with Henry Caval. Yeah, but not his face. Yeah, exactly. I mean, well, the rest of them I feel like they can just say that cuz no one else saw that happen, right? They could just say that he was [ __ ] crazy, right? Like I don't know. Like I was watching a a video on Nando. I don't know if you know Nando movies. Uh he",
            "start": 2282.56
        },
        {
            "text": "cuz no one else saw that happen, right? They could just say that he was [ __ ] crazy, right? Like I don't know. Like I was watching a a video on Nando. I don't know if you know Nando movies. Uh he did Yeah. Yeah. He did a great job of like breaking down all the different possibilities that they could do for season two to like write that off. And there's there's a lot. Like it's not it's actually I don't know. It's not insurmountable. Yeah, but I mean that's the thing is you got to write it off if you're going to, right? Are they going to is the question for this specifically? It makes sense that it is a more successful Peacemaker. Just like the themes of the season, right, of like him just them just trying to be loved by everybody and they're just not. I think it's just going to be that this is the continuation of the Peace Peacemaker in his underwear is the Peacemaker we know. And I think they're just they're just we're done with we're not doing it because that was the one thing,",
            "start": 2323.76
        },
        {
            "text": "this is the continuation of the Peace Peacemaker in his underwear is the Peacemaker we know. And I think they're just they're just we're done with we're not doing it because that was the one thing, right, that like James Guns joked about in interviews, right? of like, no, Peacemaker's all canon except for the one scene. You know what I mean? So, it's like I think I I imagine with the infinite doors we saw right before this that there's infinite doors into other Peacemaker universes. Again, maybe this is where you leave the real comicy [ __ ] with it. It is just Ultram Man's Ultram Man and like he's evil Superman from another dimension and we just that's all we say. We didn't say universe, another dimension. It's another Earth. That's what it is. You either get that or you don't. Do you care? Do you not care? Yeah. Yeah. Anything else from the Peacemaker trailer you want to talk about? I can't wait. I It's fun to see this and just be like, \"Damn, like I I I didn't forget, but I have",
            "start": 2356.4
        },
        {
            "text": "care? Do you not care? Yeah. Yeah. Anything else from the Peacemaker trailer you want to talk about? I can't wait. I It's fun to see this and just be like, \"Damn, like I I I didn't forget, but I have like What a fun show this was.\" Totally, man. I see Vigilante, I'm like, \"Oh, I want more of you.\" You know, like this this is awesome. And I I really like I always forget her name. Um but the uh the blonde woman. Um Hardwood. Yeah, Hardwood. Uh she's awesome and I I Hardcourt. Thank you. Yes. Um I enjoy see her seeing her on screen. I think that she is a a great like one of the like action leads in Yeah, for sure. For sure. Uh, will they mention Shazam? No. Come on. I mean, [ __ ] Like, no. They will not mention Shazam. They will not mention Black Adam. I don't worry about that. They're going to see what they do with that. I wonder what song they're going to use for the intro. I know. I know. It's going to be glorious. Um, all right. Let's get back to Superman. Superman. I I really enjoy",
            "start": 2394.56
        },
        {
            "text": "to see what they do with that. I wonder what song they're going to use for the intro. I know. I know. It's going to be glorious. Um, all right. Let's get back to Superman. Superman. I I really enjoy though that there's crossover getting Frankillo in both. That is legitimately cool. Isabel Isabella Merrced uh and uh Nathan like that's really really damn cool. Yeah. So here you see the war you see Superman. This is him fighting in Metropolis right before he does the eyes up here or whatever. Uh okay. Sorry. Yeah. We were right there. We got Ultra Man. Cool. Yeah. Who is Little Miss? Engineer's this old Wildtor Storm character, so I'm not super familiar with her. New 52 did that stuff. Well, yeah, of course. But again, you're right. Uh what the This is from the DC fandom wiki. Uh the engineer is a name used by two characters in the Wild Storm universe. The original was a member of the Changers who would alter his body using nanotechnology. Uh his successor Angela Spicer Spika uh who",
            "start": 2434.88
        },
        {
            "text": "is a name used by two characters in the Wild Storm universe. The original was a member of the Changers who would alter his body using nanotechnology. Uh his successor Angela Spicer Spika uh who became a member of the authority. Her body is made of liquid machinery. She can morph into different uh weapons. Uh, in the New 52 reboot, uh, Angela becomes leader of Storm Watch and her predecessors named Archive Trinity. What's up with the Authority? The Authority? Uh, that's more Wild Storm [ __ ] Uh, the Authority is a team of superheroes in the Wild Storm universe. Uh, beginning as members of Storm Watch. Uh, they declare themselves beyond the world's government. This allows them to better the planet with without regard to politics. Sounds very in line with what we're talking about here, doesn't it? Uh, what? know what I was saying of what's up with Authority. I meant more moviewise because the Authority is that's the one that they they said they're not doing that one um as of now like",
            "start": 2485.36
        },
        {
            "text": "it? Uh, what? know what I was saying of what's up with Authority. I meant more moviewise because the Authority is that's the one that they they said they're not doing that one um as of now like that they they've kind of thrown that on the back burner as the the latest like round table they had. Gotcha. But yeah, there's also a great um video from Nando where he breaks down um all of the authority and kind of how they work. So if you ever want to watch that or have some type of reminder of it, a new version of the team was introduced in the Infinite Frontier and led by Superman. Superman. It's a great comic. Did you read it for him? Yeah, it's good. So anyway, she can make she's clearly the second one, right, with the liquid machinery able to do that stuff. Lex Luthther getting what? How you feeling about Lexi? Can't wait. Can't wait. I think Nicholas Holt's going to crush it. I think such a talented actor already, but the again, we're talking about what 15 seconds of snippets, but",
            "start": 2528.88
        },
        {
            "text": "you feeling about Lexi? Can't wait. Can't wait. I think Nicholas Holt's going to crush it. I think such a talented actor already, but the again, we're talking about what 15 seconds of snippets, but like the range he's shooting right now on his face. Exactly. Here's the smuggness of winning or seeing Superman get his ass kicked. We've seen him angry. We see him in the fortress coming up. You know what I mean? A great looking. This why boy can act. Okay. So, I think we got some good stuff happen. We better. We better. Superman annoyed. Annoyed by the questions of why he should save people. Screaming about why you should save people. Love that. And then, yeah, the building's toppling down here as Metropolis under attack. Seen this one before. Obviously, Lois still being fired up. And yeah, here the hammer. And so I mean this genuinely. I like how whatever the CG looks in this because I think it's good enough to get across a cartoony vibe, but it it's not in my opinion distracting enough",
            "start": 2567.68
        },
        {
            "text": "the hammer. And so I mean this genuinely. I like how whatever the CG looks in this because I think it's good enough to get across a cartoony vibe, but it it's not in my opinion distracting enough that it's like gh this is bad. It feels a little bit more art design. And later we see the big freaking lizard giant dragon monster thing. And it's like this is James Gun's [ __ ] man. Like watch the Guardians movies and like a lot of the there's a lot of creatures. There's so many aliens and creatures and talking animals and talking trees and all this stuff. And it's like I think that it's a smarter call to in a very Nintendo way like not buy into like the hyper realistic stuff, but it's more just like hyper believable as a world stuff where it's like, \"Yeah, cool. This it allows you to do cooler things like have this guy freaking blow up a building and stuff and like have all these characters together.\" Um, but so far, again, I keep saying this, but I believe in James Gunn. I think that he",
            "start": 2606.8
        },
        {
            "text": "things like have this guy freaking blow up a building and stuff and like have all these characters together.\" Um, but so far, again, I keep saying this, but I believe in James Gunn. I think that he makes really smart calls in terms of production design. Yeah. As opposed to now a man, look how amazing and realistic this superhero fight scene looked, you know. Yeah. Yeah, for sure. Interesting call outs here with the floating things around it. Uh, are these Mr. Terrific's balls? Are these just Justice League International things? Are they cameras in this world that are capturing the fight? like did everybody uh move into drone technology or are they just with the hammer? Because I'm interested to see how the hammer suit is able to stand up to Superman. I understand and I assume he's it's the suit that's given the power like Iron Man, right? But like why can't Superman just rip that off? Is it all enchanted? Is it some kind of magical thing? Has he already been weakened? Um ignorant",
            "start": 2655.44
        },
        {
            "text": "the suit that's given the power like Iron Man, right? But like why can't Superman just rip that off? Is it all enchanted? Is it some kind of magical thing? Has he already been weakened? Um ignorant question here. Having not seen the Superman movies besides the DC EU ones, I is Superman like seemingly underpowered in this cuz it seems like he's getting his ass kicked quite a bit and not in a way of like, well, I'm getting my ass kicked to not hurt buildings and people cuz he's hurting a lot of pe or buildings at the very least. Yeah. Um I mean, so again, you're talking to Greg Miller who wants a very specific thing out of Superman, which is a character people can enjoy. So, no, I want to see him get his ass kicked. I want to see that he's vulnerable. I think you need to, you know, the Superman the animated series laid it out very interestingly in their interviews then it was the you know it's then it's just a cartoon but like their Superman could in theory be hurt by earth weapons if",
            "start": 2704.32
        },
        {
            "text": "the animated series laid it out very interestingly in their interviews then it was the you know it's then it's just a cartoon but like their Superman could in theory be hurt by earth weapons if enough fired on him. He isn't god you know what I mean? I we don't need a god Superman. Obviously he's flying heat vision. I know he's a god but you know what I mean in terms of like he should get his ass kicked. He should be I'll be interested to see how they power scale here. I'm asking oh okay so why can the metal man hang in there with him? Is it because of magic? Is it because of kryptonite or is it just going to be like no this this is a really strong metal that like you can't just rip off because of some other reason or yeah I don't know uh underpowered no I think he's powered enough and especially when we're trying to make a movie that's interesting trying to put stakes on this character which I know so many people hate Superman because there are no stakes I like seeing him constantly",
            "start": 2743.68
        },
        {
            "text": "when we're trying to make a movie that's interesting trying to put stakes on this character which I know so many people hate Superman because there are no stakes I like seeing him constantly in the Goku state. I also like seeing the people run up to him right of like Superman like Metrop that's always been the thing with Metropolis in the best fiction right is like they're there behind him. It is actually the payoff and again it looks like it's already paid off here of the you know they eventually they'll join you in the sun right they'll stumble they'll fall but they'll eventually join you in the sun we never got that in the DCU it's nice to see that to a degree here even I think you know the people this is always interesting and there's another camera right on Superman or whatever that floating thing is another interesting conversation about the world you're building and what the world of Metropolis is in comics and most Superman fiction Right. When we watched uh Thunderbolts, no",
            "start": 2779.76
        },
        {
            "text": "floating thing is another interesting conversation about the world you're building and what the world of Metropolis is in comics and most Superman fiction Right. When we watched uh Thunderbolts, no spoiler spoilers here, but The Big Bad and Thunderbolts [ __ ] up New York City. And I made the joke with Andy in the theater and on the show of just like, \"Why would you still live in New York?\" Right? There is a scene coming up. First off, there's this one where people aren't running away from it. They're running towards it because they know Superman is their protector and will always save them, right? There's also a scene coming up where there's a woman taking a selfie while Superman it looks like uh the hammer fight outside, right? And I think on the one hand, oh my god, influencers or you know the the social media destroying our culture. The other being of like this happens all the time here and Superman always saves the day. Like if they're riding that stylized world we're talking",
            "start": 2817.36
        },
        {
            "text": "know the the social media destroying our culture. The other being of like this happens all the time here and Superman always saves the day. Like if they're riding that stylized world we're talking about, if they're really leaning into that, I really appreciate that. If it is like not like uh the Lego movie Everything is awesome, yada, but like somebody coming to [ __ ] help Superman. And what does Superman do? He throws the dude out of the way to go get the bad guy when he realizes he needs to throw the dude out of the way to get the bad guy. [ __ ] yeah. And I like seeing Superman need help up and I like that idea and I like seeing him dirty and I like seeing all this stuff. Yeah. And then again here like right okay the fight is [ __ ] up Metropolis. We need to get the [ __ ] out of here. Let's fly up into the stratosphere. Is that the Justice League? Yeah, this is the Maxwell Lord's Justice League building there apparently. Oh, Lord Industries. Yeah, I see there's the L. Yeah, the",
            "start": 2858.72
        },
        {
            "text": "Let's fly up into the stratosphere. Is that the Justice League? Yeah, this is the Maxwell Lord's Justice League building there apparently. Oh, Lord Industries. Yeah, I see there's the L. Yeah, the JL I guess around it for what he's doing. Wow. So good. pulling off a, you know, still sticking with that what you remember from the Donner movies and their title treatment, modernizing it. Engineer again, her and Lex and I assume I didn't see it. Ultram Man coming in here. They [ __ ] up the robot. They [ __ ] up Krypto, dude. Shout out to Krypto. Getting some action in here. Yeah, love to see it. And then, yeah, here we go. Superman in the containment units again. We assume from the one, the only. Ah, okay. Okay, everybody. I got it. I got it. Oh, Greg has it, everyone. So, Metamorpho, uh, we've talked a lot about this one, right? Him coming through, his connection to Stag Industries. I assume you've memorized everything I've ever said. Don't worry too much about it, though. Uh, Metamorph,",
            "start": 2896.56
        },
        {
            "text": "talked a lot about this one, right? Him coming through, his connection to Stag Industries. I assume you've memorized everything I've ever said. Don't worry too much about it, though. Uh, Metamorph, I'll give you, if you don't know, official, uh, description, uh, from just Wikipedia, right? Uh, I just wanted his powers for you. Uh, abilities, uh, elemental transmutation, superhuman strength and durability, hyper elasticity, immortality is what Wikipedia lists. So, in a little bit, you're going to see an interesting scene that I I called out earlier and you stopped me. Metamorpho, I believe, clearly has his hand form formatted into kryptonite. Uh, he has green hands. It's glowing behind him. Here is after Superman has convinced him and inspired him to give up whatever it is. Again, Metamorphos story is always tied up with Rick Stag, uh, Metamorphos's lover, which I think is Stag's daughter, right? This like Romeo Juliet thing, and Stag makes him into Metamorpho, right? I assume Lex has",
            "start": 2948.4
        },
        {
            "text": "story is always tied up with Rick Stag, uh, Metamorphos's lover, which I think is Stag's daughter, right? This like Romeo Juliet thing, and Stag makes him into Metamorpho, right? I assume Lex has got Metamorphos's number here, probably with some stat connection as well, saying you basically have to work for me and what we need to do is use you to keep Superman at bay. It'd be interesting to see if there's some thing of like Kryptonite's been erased from the world. They've taken it all out. So Metamorpho has to become Kryptonite to hold Superman down. Then we saw the confront, you'll see in a second, the confrontation with them in the thing while he's doing the kryptonite thing. I imagine then Superman is able to convince Metamorpho eventually that he can save uh the woman or he needs to help me. I you know I wasn't you I never could help you with your love but my love Lois Lane is in need I need help here as you see there it finally makes sense that's Metamorpho in the back then",
            "start": 2987.92
        },
        {
            "text": "to help me. I you know I wasn't you I never could help you with your love but my love Lois Lane is in need I need help here as you see there it finally makes sense that's Metamorpho in the back then becoming solar energy so he's powering Superman up after depowering him uh with the old uh kryptonite we crushed it finally put that together that's been bugging me some big stomp this poor woman back to the thing out of the sky [ __ ] up the world yeah jeez maybe Brainiac I mean We could hope, but maybe not. Probably not. Little little uh Clark Kent running over here to his father, John Kent. See the flashback from when he was young and veer uh to the I like how it's filmed like almost like a home movie. Yeah. Yeah. Yeah. Right. Then we hop over here to Jared Petty. Oh my god. Jared Petty, if you weren't going to cosplay as John Kent, you're screwing it up. Mr. Terrific getting involved. Lex Luthther here again. Now again at a computer, a very alien technology computer inside of the",
            "start": 3025.52
        },
        {
            "text": "if you weren't going to cosplay as John Kent, you're screwing it up. Mr. Terrific getting involved. Lex Luthther here again. Now again at a computer, a very alien technology computer inside of the fortress. We've of course seen this a bit from the other teaser trailer of Superman coming in wounded. Uh Alen Tudic as one of the Kryptonian bots fixing it all up again. If there is Credence 2, this multiverse thing, is this somehow part of it? Is the engineer from our world? I didn't see Ultram Man here. Is the Is the engineer from our world and Lex goes here because he knows he can open the Phantom Zone to get And that's the other way. You just That's the other way you do this, too. Phantom Zone. We just introduced the idea of like, yes, this universe has been rolling for a while. Yes, there's a phantom. There's a Phantom Zone. Yes, there's multiple universes. A long time ago, Superman fought Ultram Man put him in here. But then I think you'd give it away. Why? I guess why would you hide",
            "start": 3075.28
        },
        {
            "text": "a phantom. There's a Phantom Zone. Yes, there's multiple universes. A long time ago, Superman fought Ultram Man put him in here. But then I think you'd give it away. Why? I guess why would you hide your face at that point? Because Superman would then know. We'll get to we'll figure out how we're getting Ultra Man involved in all this. But Lex is in there. He's doing his thing, sucking his teeth. Uh here we go again. Click back. Uh Superman wounded in there. That's what I'm talking about. See Metamorphos's kryptonite hand. Metamorpho in there on his little stool doing it. That's Metamorpho. Okay. Thought that was Zordon. No, he does look like Zordon a bit. Uh Superman [ __ ] up here. Uh again, you're going to say, Greg, he's been [ __ ] up a lot in this trailer. Yeah, but not like this. So, what is this? Is there a kryptonite uh like bullet inside of him? Uh has he been stabbed with some kind of alien plague that's making its way through him? He's got a little bit of looks like veins",
            "start": 3115.84
        },
        {
            "text": "what is this? Is there a kryptonite uh like bullet inside of him? Uh has he been stabbed with some kind of alien plague that's making its way through him? He's got a little bit of looks like veins up on his neck there. Is it the doomsday virus, which I sincerely doubt we would also toss in this film, but maybe we are. Um an interesting look at Okay, cool. Uh, what's also fascinating about this, I saw this and I went, \"Oh, John Kent, Martha Kent, in a little bit we'll get Martha Kent.\" Oh, you get your boots. Screen Rant in their thing read into this being a prequel that they're like doing flashbacks, which I don't buy at all. I think Martha Kent is alive that I have been questioning that as well since we've only seen that one shot of Jonathan in the trailers. Is Martha dead? Is she sick? Do they have to sell the house? What's going on? I like this vibe that again I think it's not wellworn territory, but it's worn territory of does the world need a Superman? Superman's down on his luck",
            "start": 3151.44
        },
        {
            "text": "they have to sell the house? What's going on? I like this vibe that again I think it's not wellworn territory, but it's worn territory of does the world need a Superman? Superman's down on his luck and down on himself. Superman got his ass kicked in 90s. Again, BBS did all this to a degree. Didn't do it well, I don't think, but they did it. It's going to be interesting if it is here. Krypto brought him home and he got healed and then he went out and got his ass kicked again but somehow made it to Smallville and he's here now and then it's going to be that he has to get this pep talk from Jonathan outside then he comes in and sees on the TV whatever's happening and she says I'll go get your boots. Like with this being such a everything in the kitchen sink like there's so many characters and places and stuff going on. Is there potential that maybe it is a little bit more vignette focused where it is like we're going to get different bits of this is when he fought this guy and this",
            "start": 3190.4
        },
        {
            "text": "and places and stuff going on. Is there potential that maybe it is a little bit more vignette focused where it is like we're going to get different bits of this is when he fought this guy and this happened and he got beat this way and then he got beat this way and obviously have it all tie together but maybe the flashbacks aren't literally just like a 30 secondond thing that we see but what if we like live in that for a little longer anything's possible and you know making a a movie better than I do as in reviews has done every I don't buy that I do think it is that Superman gets his ass handed. Superman makes it out by the skin of his teeth against the hammer. He gets all the [ __ ] thrown at him. The Justice League yells at him for getting involved even worse. Whatever leads to him getting destroyed at the fortress is him destroyed or getting destroyed outside of the fortress. Then he gets that the healing thing. And then I think this has to be something because it does look like",
            "start": 3234.24
        },
        {
            "text": "destroyed at the fortress is him destroyed or getting destroyed outside of the fortress. Then he gets that the healing thing. And then I think this has to be something because it does look like Lois is here. This doesn't again I know back and forth maybe it could be. I don't know. I don't buy it vignetti but it could be. I could be wrong. Let it go. I don't either, but just throwing it out there. I love Lois being here. Of course, this is I I can't believe I never thought about Metamorpho being abused like this and having to use kryptonite like that. That's great. I wonder who what else we got going on in the the things. Right. If you pause right here, Raj, you look to the left there, that guy who's just a black silhouette. Yeah, I doubt like the entire He's like that the entire movie. And then over there, it's just a woman in a red dress. So, like that's like the uh the dancing emoji. Yeah, she does. She does look like that. And you see all sorts of people up there. So like, huh? And",
            "start": 3278.56
        },
        {
            "text": "then over there, it's just a woman in a red dress. So, like that's like the uh the dancing emoji. Yeah, she does. She does look like that. And you see all sorts of people up there. So like, huh? And these are Lex Core bad guys. You see the LC on their chest. So this is I assume a Lex facility. Is Lex working? I know I'm stretching. Is he prepping the world for Brainiac? Of course, we have the thing floating. Many people thought it was Brainiac. Brainiac bottles cities. Are we bottling people in Metropolis here? Are these just normie people and they have Superman, but they want to keep him? And maybe that's the whole thing of of course Brainiac is promised Lex the rule of Earth. uh he he understands the intellect that he has. He's going to abuse it and abuse Lexus hubris as he always does. But part of the deal was you have to subdue Superman as well. It's the it's the world turning on Superman because of the war to metamorpho that I I haven't connected that I haven't figured out Lex's",
            "start": 3317.04
        },
        {
            "text": "But part of the deal was you have to subdue Superman as well. It's the it's the world turning on Superman because of the war to metamorpho that I I haven't connected that I haven't figured out Lex's plan, which is good. I don't want to know the whole movie before I watch it. What a [ __ ] flick this is going to be. Cool shot here of just him arising from the dust and rubble as one does. Okay, so go can we go back one more time? Sorry to the Justice League there in the air. First off, you know, we love Isabella. Uh killing on Last of Us was very nice to meet the Last of Us party. We do have more of the floating things around Mr. Terrific. They don't look like the floaty things that we've seen in the rest though, cuz they look like little tees. They got teased on them. So that's I'm already disqualifying that. Guy Gardner looking great. These are the little things that we see. I don't know where if it was already past or later, but like there's a fight in the desert and he like it looks",
            "start": 3357.2
        },
        {
            "text": "disqualifying that. Guy Gardner looking great. These are the little things that we see. I don't know where if it was already past or later, but like there's a fight in the desert and he like it looks like they have a little red. Yeah, cuz he's out there. Yeah. Yeah. Yeah. That's terrific steel with the tech or whatever. Guy Gardner looking good though. I mean looking bad but looking good. Looking perfect. Yeah. Yeah. Engineer throwing a buzzsaw. I'm like a chainsaw. the iconic location from um Shazam Fury of the Gods baseball stadium. I mean, Superman returns, but no future spoilers for you. Here's Can we rewind there a little bit? See what's happening with the world getting set with the parting of the Red Seas. What? Very glyphy, very Minecrafty. Uh I wonder again, maybe this is Metamorpho. Maybe it's just some idiot. Maybe it's Phantom Zone. Maybe it's Maybe I'm just trying to figure out. But look at that building [ __ ] up over there. I simply can't believe how ingrained in comic",
            "start": 3411.2
        },
        {
            "text": "Maybe it's just some idiot. Maybe it's Phantom Zone. Maybe it's Maybe I'm just trying to figure out. But look at that building [ __ ] up over there. I simply can't believe how ingrained in comic book stuff I am, but it's Marvel. Yeah. So, everything now you know what it's been like for me. Everything you're saying, I'm just like, excuse me. How do you think it's felt for me for a better a decade plus to be like, I really invested in the wrong world. Imagine if I knew all this [ __ ] about [ __ ] Marvel. How how much better I'd be at content. Yeah. See, I think this is happening live. Oh, what's interesting though is Okay. Okay. Okay. So, stick with me. First off, love that picture of uh Clark in the background. Looks like a painting. Something totally your [ __ ] parents would have of you. I like him looking out the window, though. I wonder if maybe maybe he isn't healing here. Maybe he just came to visit his folks. Whatever happens is happening in Smallville because Lex whoever knows",
            "start": 3455.12
        },
        {
            "text": "I like him looking out the window, though. I wonder if maybe maybe he isn't healing here. Maybe he just came to visit his folks. Whatever happens is happening in Smallville because Lex whoever knows Ultram Man would know. And then he has to step out, fight, gets his ass kicked, gets put on gets put in the bed. Lois knows to come here for the story and to help. Something interesting there. Also, can you rewind one more time to that house? Okay, just let it go here. Just stop. You say the top corner of the house there. That's a water stain. Come on, Clark. You know what I mean? Like that. He could have identified that way earlier. I know. Like the black the black mold the family's got. Like I understand you don't want to rob, but just go get a piece of coal from wherever on some mountain, crush into a diamond, sell the diamond, finance your parents house. At least the mold part of it. You know what I mean? You're going to tell me, \"Oh, the kids wouldn't want a shortcut.\" I know. Okay.",
            "start": 3497.2
        },
        {
            "text": "crush into a diamond, sell the diamond, finance your parents house. At least the mold part of it. You know what I mean? You're going to tell me, \"Oh, the kids wouldn't want a shortcut.\" I know. Okay. Well, you're going way too [ __ ] fast here, Roger. All right. You need to I I understand this isn't your job usually, but if you [ __ ] me on this. All right. So, here we go. Big monster. Yeah, big monster. Again, I assume from the Phantom Zone andor uh whatever Clark's got up at the fortress where he's locked people in. Are we catching any fun Easter eggs on the billboards? The big belly. [ __ ] kill it. Oh, yeah. Big belly. This guy This is what I'm talking about with the the creature design. Like this reminds me a lot of the the battery eating monster. Oh, yeah. Yeah. Yeah. Yeah. Yeah. I'm trying to figure that one out. Yeah. You're moving fast. Doesn't matter. Right in front of Maxwell Lord's building though. Who is this on the screen now? New new regulations set to begin next week.",
            "start": 3548.72
        },
        {
            "text": "trying to figure that one out. Yeah. You're moving fast. Doesn't matter. Right in front of Maxwell Lord's building though. Who is this on the screen now? New new regulations set to begin next week. Huh. I wonder if there regulations on Superman or just superheroes in general. Yeah, that doesn't look like the Reeve boy. I don't know him. Well, I thought it was James Marson. Yeah, I Well, it's funny you said that. I thought it was James Franco for a second. Uh, of course, it is confirmed that Christopher Reev uh son, uh, well, Dana's son, too, uh, is in who is a reporter for CNN. I think Matt, but double check me on that. Uh, is going to be in this as a reporter, so that's pretty cool. There's your big belly burger down there. You got to have it. Guy Gardner throwing up a big old hand. Would love to see more of that. I can't wait to see what exactly he's going to do with it now. Oh, hot girl pushing somebody out. Who do we got here? Lux. Well, there's like a they they purposely put a",
            "start": 3590.24
        },
        {
            "text": "love to see more of that. I can't wait to see what exactly he's going to do with it now. Oh, hot girl pushing somebody out. Who do we got here? Lux. Well, there's like a they they purposely put a blur on his head. Yeah, they totally did. Yeah, that does look like a bald man to me. Yeah. Interesting. But I mean, that would be really that's some that's Oh, wow. They fully blurred that one out. Yeah, that's hilarious. That's great. Good. Yeah, that's You're [ __ ] somebody up, though. You push a human being out of stained glass window like that. Damn. Where are you? What is this city, right? Russia. Cleveland, Ohio. It could be. Yeah, I mean the Russell leveling thug one. Here we got Jimmy Olsson. Jimmy Olsson and Clark hanging out being funny. This is all I want. I love them so much. Oh, look a Superman uh toy right there. Like a classic. Oh, nice. And then look at the paper, too. It's talking about u the hammer of bro. This is the thing I was talking about that leaked. Oh my god. And",
            "start": 3634.4
        },
        {
            "text": "a Superman uh toy right there. Like a classic. Oh, nice. And then look at the paper, too. It's talking about u the hammer of bro. This is the thing I was talking about that leaked. Oh my god. And look over Jimmy's desk there on the left. Picture of Superman waving at him. [ __ ] yeah. Hell yeah. That's awesome. What a nice little world they have here. Just being bro. So much fun. This is This is Snowike, Mike, and Roger on a good day. Here's what I was talking about earlier with the Yeah. Like, we're going to take a selfie with a giant battle that could easily kill you outside, but you assume Superman's got you. So, what what is that? Like, this seems like even another bad guy that we haven't, right? Oh, yeah. Yeah. Look at that. That's the hammer floating there in his big suit with all the little cameras or whatever around him or Okay. engineer using the nanotechnology stuff to do it. Who's this now? Yeah. Superman throwing Lex's desk while talking to Lex. You got to love it. This is",
            "start": 3688.8
        },
        {
            "text": "little cameras or whatever around him or Okay. engineer using the nanotechnology stuff to do it. Who's this now? Yeah. Superman throwing Lex's desk while talking to Lex. You got to love it. This is so his he's all [ __ ] up here too. Black knowing he won't start. No [ __ ] And then yeah, here we go. What is this exactly again? Screen Rant says we're going to see Superman fly through in a second. I'll be interested to see that. Mr. Terrific doing his thing again. Audrey, do you have the means to look up Zordon Power Rangers movie? Uh, sure. Absolutely. Because we we can leave Metamorpho up. I can talk about or you need the browser, I guess, while you do this. Yeah. Uh, it's important most important thing. Power Rangers movie Zordon movie specifically. Yes. Okay. Which which movie? I I kind of want both. The 1995 and the 2017. Sure. Absolutely. Thank you. Uh is it when he's outside of the thing? Yeah. Okay. You know what he's going for. Yeah. No, I know what you're going for. There we",
            "start": 3725.52
        },
        {
            "text": "of want both. The 1995 and the 2017. Sure. Absolutely. Thank you. Uh is it when he's outside of the thing? Yeah. Okay. You know what he's going for. Yeah. No, I know what you're going for. There we go. That's the But yeah, this is the 2017 one. This is them trying to make the 1995 one look even cooler. And then this is the 1995. Yeah. Thank you. Exactly. Yeah. You mix these two, you get Metamorpho. Yeah. I'm not going to argue. Oh, wow. Is that Is that accurate though? Or in terms of look, is Metamorpho like does he look like Zordon from the movies? I mean, yeah. I mean, that's what I mean. That's one drawing of him. Yeah. Yeah. Cool. It's incredible. We've done it everybody. You You're happy. There you go. You somewhat This is when he's uh I would say pushing himself to make light, not not make uh uh whatchamacallit kryptonite. When he's actually trying to be good. Uh cuz I'm sure he's like, \"I've never done that before. I've never made the sun.\" Okay, hold on. Oh, Raj. Okay, so",
            "start": 3772.96
        },
        {
            "text": "not make uh uh whatchamacallit kryptonite. When he's actually trying to be good. Uh cuz I'm sure he's like, \"I've never done that before. I've never made the sun.\" Okay, hold on. Oh, Raj. Okay, so here's them flying through the darkness, the other otherworldly thing. And then yeah, here is someone shooting. It looks like heat vision at him. You're going to need to stop right there. I'm going to go check it out, too. He's He's getting close. I'm glad there's no reflection. He's looking at the boots, looking at the fur. I'm looking at the guy. Looking at the guy. Superman's flying towards a guy in the darkness. This is the screen rant. This is the screen rant. dark space they're talking about. So, are we fighting Ultram Man? Yeah, cuz he just shoots the big old like that's that those are like Superman's laser eyes, right? Yeah. So, but I mean we also saw uh the hammer do that as well, but I I am assuming that if we're buying into multiversal Oh my god, he cracked it. Are we so dumb that",
            "start": 3817.84
        },
        {
            "text": "Superman's laser eyes, right? Yeah. So, but I mean we also saw uh the hammer do that as well, but I I am assuming that if we're buying into multiversal Oh my god, he cracked it. Are we so dumb that we're so hung up on screen rants saying multiverse we're not just saying the obvious and this is the Phantom Zone? This is just their Phantom. That sounds way more likely, right? Yeah. Yeah. Yeah. Yeah. Like that's the hammer. Well, again, again, that's what it's the hammer, right? This is an ultra man. Well, no. You want to put the hammer in the phantom zone, please. So, this [ __ ] is just shooting. We have too many guys shooting red lasers. Raj. Yeah. Well, again, to keep you guessing, my thoughts here would be that this is the final showdown with Ultra Man where we Superman's been put into the Phantom Zone. He's Well, they both have, right? And so, they're battling it out here or whatever. Maybe not the final showdown because I guess Mr. Terrific and Lois then would come get him through",
            "start": 3860.08
        },
        {
            "text": "Phantom Zone. He's Well, they both have, right? And so, they're battling it out here or whatever. Maybe not the final showdown because I guess Mr. Terrific and Lois then would come get him through the Phantom Zone. This makes makes this makes a lot more sense to me. They didn't build a portal. That's the portal in the fortress to the Phantom Zone. It's not a port. It's not a Phantom Zone projector as it has been so many times in the comics. It's going to be a portal you walk through. Similar to like when Eduardo had to go into the containment unit and extreme Ghostbusters in the zone, you know, in fear of starting something and going down a whole whole tyrate. What is the Phantom Zone? Is that a different multiverse thing or is it in our universe? Like what is it? It's I mean it's whatever you want it to be. space between spaces. It's not another dimension, but I guess technically it probably would be defined. It's not a multiverse thing. It's a universe where time doesn't move.",
            "start": 3898.8
        },
        {
            "text": "you want it to be. space between spaces. It's not another dimension, but I guess technically it probably would be defined. It's not a multiverse thing. It's a universe where time doesn't move. You're put in it's purgatory for all intents and purposes. You're put in there and you don't need food or water, but you also don't age. Actually would have been a great solution for Krypton, but the scientists didn't want to listen to Jorel. You know what I mean? Uh we'll put ourselves in the phantom. Well, you're going to die otherwise. Nobody listens. You know what I mean? Thank god we live on a planet where we listen to scientists. Uh but no. Uh yeah, it's not a it's not a diff again. It's not a multiverse. I'll say that. All right. It's a pocket dimension. It's a space between spaces. It's a whatever where time doesn't move or whatever. Does that make sense? Yes, it does. You're betting that this movie is going to be end on a character verse character. No. No. I And that's why I dialed it",
            "start": 3935.68
        },
        {
            "text": "where time doesn't move or whatever. Does that make sense? Yes, it does. You're betting that this movie is going to be end on a character verse character. No. No. I And that's why I dialed it back. I think that they go in here and Superman gets stuck in here and then Ultram Man gets out and then Lois and Mr. Terrific have to come in to get him out and then we all get out and we go beat the [ __ ] out of the bad guys. Okay. And maybe that maybe we get out and we get dropped in Smallville and that's where Superman has to lie down and Superman Superman has to have a lie down. Superman has to get a pep talk. Superman has to get his boots and go kick the [ __ ] out of some bad guys. Sick shot. These two just they they [ __ ] man. Love it. You know what I mean? I do. Not married though. Come on Clark. Get it together. Wow. Superman flying up in the sky with a wall of fire behind him. Excited extend extended due to popular demand. Whatever that sign is up there. Yo, there we go. Look to the",
            "start": 3972.56
        },
        {
            "text": "Clark. Get it together. Wow. Superman flying up in the sky with a wall of fire behind him. Excited extend extended due to popular demand. Whatever that sign is up there. Yo, there we go. Look to the sky. Look up. God, love it. Love the colors, man. Love the vibe. They got a They got a nice thing. Krypto in his chest. All in on Krypto. Yeah. Okay. I'm I'm I'm I'm doing it. Well, first off, the Smallville Giants. Interesting. Not the Smallville Crows. Okay. Have your way, James. Uh, but I'm d I'm saying it. I'm putting it in here, everybody. This is what I just what it just happens. It happens. Superman trapped in the Phantom Zone. Lois and Mr. Turf get him out. They bring him to Smallville to rehab. He's here. He's reunited with Crypto. Krypto won't leave his side. Lays on him. He gets up, has the whole conversation with Pocket about whatever. Sees on the TV how bad everybody's being. Yeah. Roger. Do we have the technology? Oh [ __ ] Mighty Crab Joys. Yes. Yeah. We need to know. Are",
            "start": 4012.88
        },
        {
            "text": "has the whole conversation with Pocket about whatever. Sees on the TV how bad everybody's being. Yeah. Roger. Do we have the technology? Oh [ __ ] Mighty Crab Joys. Yes. Yeah. We need to know. Are the Mighty Crab Joys a real band? In Peacemakers room, it was a different band. They had Yeah, they had there were several bands up, but I did not see the Mighty Crab Joys. I would like to see it as well if we could go to the end of the Peacemaker thing and see if indeed there anybody's up there in the fancy Peacemakers room. He had fancy posters. I'm looking at the Red. Okay, so this is from Reddit. Uh, hold on. Let me triple check. Interesting. So, this is it's appeared in three different um things. It's now in Superman. It was in um Yeah, Creature Commandos. And I'm assuming this is Peacemaker. Very interesting. I don't know what that is. Will they perform the theme song in Peacemaker 2? You heard it here first. Yeah. Can you Oh, I guess they would have had this. No. Well, yeah. Can you",
            "start": 4063.92
        },
        {
            "text": "Very interesting. I don't know what that is. Will they perform the theme song in Peacemaker 2? You heard it here first. Yeah. Can you Oh, I guess they would have had this. No. Well, yeah. Can you go to like what you're talking about the end of the Peacemaker trailer and see? Oh, okay. Gotcha. I see what you're saying. Yeah. Yeah. You think I'm on to something there, Greg? Maybe. I think so. I think I think it's more interesting that like James Gunn finds some cool indie thing or whatever. He's so into music that he wouldn't use other people. Honoi, did they did Hanoi Rocks do the first one or are they also just a madeup band? Probably a madeup band. Oh yeah. Oh, so it is in the trailer. So the um the Mighty Crab Joys are are in the trailer for Peacemaker season 2 right here. Okay. So sick. And yeah, Hanoi Rocks is a real band. And I'm assuming even I'm trying to find it. Oh, so confident it wasn't. They're a real band over here. Well, I guess they I was saying that they weren't the",
            "start": 4113.92
        },
        {
            "text": "And yeah, Hanoi Rocks is a real band. And I'm assuming even I'm trying to find it. Oh, so confident it wasn't. They're a real band over here. Well, I guess they I was saying that they weren't the singers of the first theme song. Ah, okay. Sorry. Uh, and then can we go to the end of the Peacemaker trailer? Cuz it's the Henoi rocks, but then there's another shot with another band over his shoulder. Yeah. Hold on. East maker. Peacekeeper. Mess that up often. So, right there. What it the cruel the cruel interventions and there's one over here or something. He has a bust of himself. Of course he does. I love that. Some insane the cruel interventions. Well, cool. There we go. Greg, I'm happy you're happy. I'm very happy. I'm very happy. I'm happy as well. I can't We watch it one more time with volume the whole trailer. Yeah. Fine. Let's do it. I like it. Victory lap. Hold on. We did some good content out here, you know. Yeah. I Hey, I'm here for it, man. It's worth the strike. So nice being",
            "start": 4157.68
        },
        {
            "text": "the whole trailer. Yeah. Fine. Let's do it. I like it. Victory lap. Hold on. We did some good content out here, you know. Yeah. I Hey, I'm here for it, man. It's worth the strike. So nice being excited about things. All right, hold on one more time. All right, cool. Start. Are you being serious right now? Yeah. You'd let me interview you as Superman? Sure. [Music] Ready? Let's do it. Kronhite Superman. Miss Lane, recently you've come under a lot of fire for what some might It's a lot. Today, the Secretary of Defense said he was going to look into your actions. That That's funny. My actions? I stopped a war. Maybe. Uh, not maybe. I did. In effect, you illegally entered a country. This is how you're going to be. I'm not the one being interviewed, Superman. Did you consult with the president? No. You seemingly acting as a representative anybody except for around the world and doing good. I would question myself in the same situation and consider the consequences. People were going to",
            "start": 4216.4
        },
        {
            "text": "No. You seemingly acting as a representative anybody except for around the world and doing good. I would question myself in the same situation and consider the consequences. People were going to die. [Music] [Music] Hey buddy, eyes up here. This is going to hit. Oh my god. Take off sound. your choices, your actions. That's what makes you who you [Music] are. Superman. He's not a man. He's an it somehow become the focal point of the entire world's conversation. I will not accept that. I cleaned your boots. I'll go get them for you. [Music] You have a dog. I mean, come on. Joy really can't get here quick enough. Come on, guys. We have a great month ahead of us. We will be doing Superman in review leading into woo Superman starting off the DCU in movie form. Very exciting stuff. Um, we're going to react to the Iron Heart trailer and the Spider Noir trailer. I'm thinking this through right now. Uh, this video is probably going to go up today on um May 14th. May 14th. The Iron Heart one",
            "start": 4289.76
        },
        {
            "text": "going to react to the Iron Heart trailer and the Spider Noir trailer. I'm thinking this through right now. Uh, this video is probably going to go up today on um May 14th. May 14th. The Iron Heart one we'll put up tomorrow. Uh, just cuz I feel like this was such a substantial conversation, I don't want to step on it. Sure. Great. We're going to record it now, but it'll go up tomorrow for everybody. Uh, we did get in trouble with some stuff, so we're going to have to figure all that out. But you know what? Until next time, you don't need to worry about that. I love you all. Goodbye.",
            "start": 4424.48
        }
    ]
}