{
    "id": 14055,
    "video_id": "yMNoy2FZICo",
    "show_name": "Screencast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Blessing Adeoye Jr."
    ],
    "title": "The Last of Us Season 2 Episode 4 SPOILERCAST",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page - https://store.steampowered.com/app/1377700/Empyreal/ \nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nThis episode is sponsored by BetterHelp — go to http://betterhelp.com/kindafunny to get 10% off your first month.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1746475754,
    "duration": 2249,
    "transcript_chunks": [
        {
            "text": "[Music] What's Up and welcome back to kind of funnies the last of us season 2 breakdown. Of course I'm your host Tim Gettys. I am joined once again by blessing at Jr. Good day Tim and Greg Miller. Season 3 champ. Season 3 champ kind of funny game showdown. Go watch the finale now. YouTube.com kind of funny game. It's a great finale. Plus, you know, I got to give credit. Yeah, you do a great job with this show. The show is amazing. I app I'm glad you're saying it now that you won. God. You know, sometimes sometimes what? God and or Satan's on your side. Sometimes. Maybe they're both on my side. Who knows? Yep. Exactly. Uh remember everybody, this is our weekly breakdown of The Last of Us each and every Monday right after the Sunday night premiere of the latest Last of Us episode. We're going to break down everything we just saw. And of course, today we're doing that for episode 4, day one of season 2. This was directed by Kate Harren, who y'all probably know from the Loki series. Oh,",
            "start": 12.74
        },
        {
            "text": "to break down everything we just saw. And of course, today we're doing that for episode 4, day one of season 2. This was directed by Kate Harren, who y'all probably know from the Loki series. Oh, yeah, we do. Um, and Craig Mason wrote this one. We have three episodes remaining in this season of television. Very, very, very crazy. Um, of course, got some housekeeping for you. Remember, Greg is about to do a whole bunch of cool stuff at PAX East this Thursday. You need to be part of it at 11:00 a.m. Eastern, 8:00 a.m. Pacific. Greg's going to be the keynote speaker kicking off PAX East. And I don't think we're making a big enough deal about this. This is awesome. I know on some shows we might have, but like this is really freaking cool. Keynote speaker celebrating 10 years of kind of funny with Ben Star. Yeah. Ben Star coming through to interview me, of course. Kind of funny. Best friend who's a little bit famous, so why not have him come in ask a bunch of cool questions. I'm excited",
            "start": 71.84
        },
        {
            "text": "with Ben Star. Yeah. Ben Star coming through to interview me, of course. Kind of funny. Best friend who's a little bit famous, so why not have him come in ask a bunch of cool questions. I'm excited for it. Yeah. Very, very cool. I'm excited to see that as well. And I can because even though I'm not there, I get to watch live on Twitch. And also, he's hosting the Mafia Old Country Panel with the devs at 2:00 p.m. Eastern, 11:00 a.m. Pacific. You can, if you're at PAX East, if you're at Boston, go support both those panels in person. Otherwise, please watch online. They'll be on our We'll be streaming to our channel. So, you can come straight to twitch.tv/confunny games. Yes. No YouTube due to tech issues on our side. So, just watch on Twitch all day here. Remember, we are an 11 person business all about live talk shows. Today, we've already done a whole bunch of stuff. We have kind of funny games daily in the books. Kind of funny games. It's a month out from the Nintendo Switch 2",
            "start": 112.56
        },
        {
            "text": "business all about live talk shows. Today, we've already done a whole bunch of stuff. We have kind of funny games daily in the books. Kind of funny games. It's a month out from the Nintendo Switch 2 launch. We all talk about what we pre-ordered, what we want to get, and uh just our hype levels in general for the new console from Nintendo. After this, you're getting a stream, an Nvidia sponsored stream of Cyberpunk 2077, continuing Nick's addiction to the game. Then to close out the day, we are doing Alien in review for Alien Covenant. So stay tuned and hang out with us all day. If you're a kind of funny member, today's Greg's 15 plus minutes about how you failed him. Yep. So definitely pay us money to listen to content about you being the problem. Listen, you're not going to better yourself if you don't get some sour with the sweet once in a while. All right, every Greg White, I'm incredibly sweet to you [ __ ] But this time, you let me down. And so it's time you heard about this and",
            "start": 148.16
        },
        {
            "text": "if you don't get some sour with the sweet once in a while. All right, every Greg White, I'm incredibly sweet to you [ __ ] But this time, you let me down. And so it's time you heard about this and how you sandbagged me and tried to stop me. But if the championship strap didn't give it away, nothing's slowing me down. Ben Star, prepare your mouth, Pax East. Cuz he's a voice actor. Yeah. Yeah. I hope that's what it is. I really hope that's what it is. I really hope that's what it is. Thank you to our Patreon producers Carl Jacobs, Omega Buster, and Delaney Twining. Today we're brought to you by Imperial or Frames at Better Help, but we'll tell you about that later. Let's get into it. Last of Us season 2, episode 4. Bless, you've been gone from this show for a while cuz you had to go to Gallivant in Japan. That's what I do. Uh what did you think of this episode? Uh, I think this is the best episode of the season so far. Uh, one of the best episodes of the show so far. Um, I think this",
            "start": 190.88
        },
        {
            "text": "in Japan. That's what I do. Uh what did you think of this episode? Uh, I think this is the best episode of the season so far. Uh, one of the best episodes of the show so far. Um, I think this this episode did a lot for me in making me believe in the direction of the season and making me go, \"Oh, this show is okay without Pedro Pascal.\" Of course, Pedro Pascal, my favorite part of the show, right, in the first season and in a couple episodes, right? But like, you know, I think what they did here as far as introducing us to the new version of the show, I feel like the last couple of episodes have existed in like a different ether than like the first couple episodes. I think episode one and two felt like the continuation a bit of episode one, even though that feels weird to say because it's all season or Yeah, season one. Thank you. It's all It feels weird to say because it's all, you know, structured by how the games are, right? But there's something about being on the road with Ellie",
            "start": 235.68
        },
        {
            "text": "all season or Yeah, season one. Thank you. It's all It feels weird to say because it's all, you know, structured by how the games are, right? But there's something about being on the road with Ellie and Dena and getting that chemistry established and getting um Isaac as a character introduced here and getting his character established and seeing how they're building tensions between all these different things that is really working for me. I think this apocalypse got to be a top five apocalypse or worst five apocalypse to exist in I'll say, right? Like um I think there was the line partway through the episode where Dena's like, \"Man, what the [ __ ] is up with Seattle?\" Right? you know, and like you look at all the different things happening at once and it brings me back to I think some of my favorite um feelings of watching Walking Dead back in the day of like when something new gets introduced when you get to the farm or you get to like the governor's town or something and it's like",
            "start": 278.32
        },
        {
            "text": "my favorite um feelings of watching Walking Dead back in the day of like when something new gets introduced when you get to the farm or you get to like the governor's town or something and it's like a [ __ ] [ __ ] is [ __ ] There have been multiple times just this episode where I'm like damn dude like [ __ ] is [ __ ] right? like seeing the ways in which the scars have gone or the sarapites have gone after after the wolves. Seeing how you know I'm not going to use the slur fictional but seeing like you know how Isaac is uh like how he kind of got introduced uh to the wolves and like you know that turn of his character but then fast forwarding to how like he's gone full like I'm going to burn people with a pan. because I feel like they've wronged me. And then you get the other side of it, right? Like I think that stuff has been built very well, but then you get to um even just the wolves as a force. The fact that you are as Ellie and Dena dealing with like hordes of infected, dealing",
            "start": 315.36
        },
        {
            "text": "right? Like I think that stuff has been built very well, but then you get to um even just the wolves as a force. The fact that you are as Ellie and Dena dealing with like hordes of infected, dealing with the Sarapites tearing people apart, but then dealing with also a military, which is probably the scariest thing that you can deal with in a in a apocalypse. Like I think all that stuff is set up very well. Uh, and then not to mention like the excellent excellent uh redoing of like how they have the reveal of Ellie telling Dena that she's immune, Dena telling Ellie that she's pregnant. How that then leads into them confirming their relationship. Like I that that's been one of the few moments in watching this TV show where I'm like, \"Oh, y'all did it better than the game.\" Like there are very few parts of the show for me where I would say that. This for sure is one where I'm like, damn. Like, I can't believe how well you're able to build these things together to then have them all kind",
            "start": 360.32
        },
        {
            "text": "few parts of the show for me where I would say that. This for sure is one where I'm like, damn. Like, I can't believe how well you're able to build these things together to then have them all kind of lead into uh like what what each character is going through thematically with the story and then also what you're building on top of it. Like I think this is just an excellent episode of the show. Greg, what do you think? I mean, I echo everything you said. Fantastic episode of TV, fantastic episode of The Last of Us in terms of the pantheon of great episodes here. Uh yeah, they continue to do what we've complimented them for week after week, Tim of right, build off of what we already know and expect, but make it better. Flesh it out again. The stuff here with Isaac I thought was so well done. And what a cool opening, right? To go back to 2018, have him back there. Is it wish is that Drake or Josh? One. Don't you dare. Hilarious. I don't know. I know. I don't I never watched that show. I",
            "start": 397.76
        },
        {
            "text": "And what a cool opening, right? To go back to 2018, have him back there. Is it wish is that Drake or Josh? One. Don't you dare. Hilarious. I don't know. I know. I don't I never watched that show. I know. I know that it's a thing or whatever to have him there and then Yeah. have him be such an [ __ ] and then then just pan the camera to Isaac as he lays it all out of like everybody sucks and get out what's about to happen. Pulls the fresh meat with him, goes back, tosses the two grenades and shuts it. It's like damn that's awesome. let alone to get it to then, you know, where he is years later, obviously incredibly jaded, working with the wolves, burning people. And Jen was like, \"Oh, we were watching that after like, oh, was he he was he was in the game, too. I forgot about that.\" Like, well, yeah, because we've probably seen as much of him in this one episode as we did in the game. How underutilized Jeffrey uh Wright was and Isaac was in the actual game. Cool to see way more here and",
            "start": 435.36
        },
        {
            "text": "yeah, because we've probably seen as much of him in this one episode as we did in the game. How underutilized Jeffrey uh Wright was and Isaac was in the actual game. Cool to see way more here and see that he's going to be pivotable to this, more pivotal to the story. But yeah, then then, yeah, the rest of it just so well done. Uh so creepy, but so heartwarming. Again, I think it's so special that they were able to nail that aha take on me moment the way the game did cuz I remember when you get to that scene in the game as you know Neil calls out in the afterwards of like it was a fan favorite. It was something you couldn't miss whatever. I didn't miss it playing it. And I remember sitting there watching and you know watching the performance right from uh Shannon and from uh Ashley and listening to Ashley's vocals and I was like this I like I was it was one of those moments where I really felt like I was next to Dena watching it and it was so beautiful in this game that's obviously",
            "start": 474.32
        },
        {
            "text": "listening to Ashley's vocals and I was like this I like I was it was one of those moments where I really felt like I was next to Dena watching it and it was so beautiful in this game that's obviously always so dark and always so [ __ ] up to have that to see watch the show last night and have the exact same thing where it's just this beautiful ray of sunshine pouring through Ellie sitting there playing it Dena coming up, her sitting down, the tears in her eyes as she watches this moment of beauty in a world that's so ugly. So well done. And then yeah, the the changes they made, the things they did. I I had a great time last night. Was it was it Take on me that they sang in the game as well? Oh, I didn't know. I think I missed that part. Oh, yeah. Really? Wow. That that's I didn't know you could miss it, but I guess that's just the way I played that game. I'm like when he said that in the after thing like, \"Oh, it's optional.\" I was like, \"Was it really?\" Like I can't believe that such",
            "start": 514.16
        },
        {
            "text": "could miss it, but I guess that's just the way I played that game. I'm like when he said that in the after thing like, \"Oh, it's optional.\" I was like, \"Was it really?\" Like I can't believe that such an amazing uh moment is missable in in in that game cuz God, that was special. But yeah, I loved this. Continue to love the show. Continue to love the story. And for me, the thing I enjoy most about the the HBO version is where it stays the same and where it decides to be different. And as long as it's still great, like that's what matters. And I think that for me, the show continues to make the right choices and what to change and how to change them. I think that the relationship between uh Dina and Ellie in the show is better is almost a silly thing to to go with. I love it. like that's all that really matters. I loved it in the game, but I I want to say I love it more here just because we get a little bit more of it. I like this the shows Dena so much better than I liked her in the",
            "start": 553.92
        },
        {
            "text": "all that really matters. I loved it in the game, but I I want to say I love it more here just because we get a little bit more of it. I like this the shows Dena so much better than I liked her in the game and that's just from the amount she was in it. Uh I feel the first couple episodes we've gotten here of all the Jackson stuff got us to a point now that when the changes they made with the reveal of I'm pregnant, I'm immune, all that stuff, it just hit harder for me. Um, and I I thought that the them getting together officially and like the that whole scene was just believable. Um, in a way that I feel like they could have really fumbled if they made just a couple different choices in the prior episodes, but they got us here in such a beautiful way. Obviously, the Take on Me scene was like emotionally stirring, right? Like the performance from uh Isabella Merrced in particular. I don't know that I've ever on camera seen somebody look like they love someone else more. such chemistry,",
            "start": 593.92
        },
        {
            "text": "emotionally stirring, right? Like the performance from uh Isabella Merrced in particular. I don't know that I've ever on camera seen somebody look like they love someone else more. such chemistry, the tears in her eyes, just the the the glow on her face. Like, it was powerful stuff, man. And such a beautiful moment. you mentioned the the sun coming through and it's like I love so often watching the show how I I'm tempted to pull up uh on YouTube and just look up what did the scene look like in the game and to see how much they nail the the the authenticity of what the game presented but then have just these new elements that like real cameras can add and like real set design and production design that you can't do in CG. Like it it there's this human factor to it all. I'm so so damn impressed with it. And on top of that, the amount of things that happen in this episode is kind of wild. Like the amount of action set pieces, the amount of moments from the game they translate, whether",
            "start": 636.56
        },
        {
            "text": "with it. And on top of that, the amount of things that happen in this episode is kind of wild. Like the amount of action set pieces, the amount of moments from the game they translate, whether it's the TV station and the genuine fear you have for these characters as they're hiding from the [ __ ] WLF. Yeah. Getting into all the infected in the subway. Like, and it's just like moments that I'm like, \"Oh my god, they're translating the feeling of the game to a show.\" I think I I think this episode had Yeah. my favorite action of the show so far, right? like the uh going from being in the building where the scar the the S terafites I'm just keep saying scars on accident the Sarapites have like I'm so sorry but yeah like where they have like all the the wolf soldiers hung and their guts are out like seeing that it's like damn that's [ __ ] right but how that leads into a stealth sequence between Dena and Ellie hiding from the wolves that are now back and like trying to hunt down like",
            "start": 689.44
        },
        {
            "text": "out like seeing that it's like damn that's [ __ ] right but how that leads into a stealth sequence between Dena and Ellie hiding from the wolves that are now back and like trying to hunt down like there's a pable a [ __ ] you guys are [ __ ] like I know obviously it's a TV show so I know they're going to make it out but legitimately I am like damn like this is such a precarious place to be going into the uh uh like subway scene where you know you hear the soldiers, you hear the infected and seeing Dena just count like one, two, like putting up the fingers and as she gets to five and like just seeing the fear on her face, I'm like this is that good [ __ ] man. This is that good [ __ ] right here. Yeah. And and I didn't even mention Jeffrey Wright, which I do think is the so far in the entire show I think the best addition is getting more of him. Sure. Um, and and I've been so impressed with Jackson, but already how much more fleshed out the past and what we know will be future of the",
            "start": 731.12
        },
        {
            "text": "show I think the best addition is getting more of him. Sure. Um, and and I've been so impressed with Jackson, but already how much more fleshed out the past and what we know will be future of the WLF with uh Jeffrey Wright's character here is I think just phenomenal. Him throwing the grenade in there. Like the introduction of the concept of voters I think is terrifying and uh perfectly fit into this world. And it gives me a lot of hope for as we get towards the end of the game dealing with the the Raptors and the Santa Monica stuff. like I'm hoping that we get better, more fleshed out and uh like already like I thought the WLF was great in the game, but um seeing the scene with the the Sarafite being um tortured is it's so brutal. It's hard to to watch and hard to look at, but the the dialogue that they have, I think, is so powerful. And him saying that the we um how many wolves become saraphites like every day somebody does. Sarapites never become wolves. God damn. That's that that's",
            "start": 772.64
        },
        {
            "text": "that they have, I think, is so powerful. And him saying that the we um how many wolves become saraphites like every day somebody does. Sarapites never become wolves. God damn. That's that that's that good [ __ ] And it was the same thing too though. I thought, you know, the showsman did such a great job of talking about like, well, when we I was like last week, oh man, they introduced the Sarapites and the way they introduced them immediately makes them likable, you can understand them to some degree, blah blah blah. But then we keep seeing both the WLF and the Sarapites as humans, but then with the horrors they can do, right? And so to have that actually be part of the conversation in the torture scene, right, of like you're the one who you I can't do a good Jeffrey, right? Well, you're the one who teaches children to shoot us with you're it's cuz you shoot. I'm not going to get into this who shot first, dude. Not even into dismissive. you're right and I'm wrong way in a very much",
            "start": 819.92
        },
        {
            "text": "the one who teaches children to shoot us with you're it's cuz you shoot. I'm not going to get into this who shot first, dude. Not even into dismissive. you're right and I'm wrong way in a very much like no I don't who knows where it really started. We're not doing that right now. But it is like oh wow that's how complicated the world is for all these people. Yeah. Yeah. Absolutely. Uh bless where you want to take it now. Oh man. I guess trying to think because I want to talk more about like the Dena and Ellie of it all because I think one of the things that I really loved obviously the show takes place in Seattle, right? Like and this is something I loved about the game too is for me as somebody who lived in Seattle for for about four years that the show I think does well to do um or does well doing as well where you know in the game you I think you cross through the convention center like at some point I'm like this is [ __ ] cool. Yeah, it's packs. Like, I love that I'm seeing the",
            "start": 856.64
        },
        {
            "text": "well doing as well where you know in the game you I think you cross through the convention center like at some point I'm like this is [ __ ] cool. Yeah, it's packs. Like, I love that I'm seeing the landmark in the uh show. There's a moment where they go through Capitol Hill and why are there all these rainbows? Yeah. Like, why are they all these Why are there all these rainbows? Right. And like I I this is one of those things where I think the show does such an excellent job of pulling things together like thematically in ways that like I in ways that I think have led to the reveal of like the I'm pregnant, I'm I'm immune thing like really working out for me because you have that moment where they see that stuff and they're like we don't know what this means but like all right cool they they love rainbow. Maybe they were very optimistic. so good. But toward the end of the episode, right, like there is this like back and forth confession of like, hey, yes, like I uh I'm immune. Like",
            "start": 894.0
        },
        {
            "text": "they love rainbow. Maybe they were very optimistic. so good. But toward the end of the episode, right, like there is this like back and forth confession of like, hey, yes, like I uh I'm immune. Like the tension of, you know, Dena not believing at first and knowing that like [ __ ] like, you know, I'm pregnant, she's bit, like we got to do something about this and then, you know, that then leading into Ellie proving it to her. That then leading into I'm pregnant. That leading into like them, you know, confirming that relationship. [ __ ] uh and Dena then like kind of talking to Ellie about like no like you know I'm I'm I'm like girls but like my mom you know taught me this thing which wasn't right like it all came full circle in a way that I was like wow this is really beautifully handled like I like how even just Ellie being like I'm going to be a dad that was something I got to laugh out of and that goes back to like different than the game and which is better and which is done well",
            "start": 930.32
        },
        {
            "text": "like I like how even just Ellie being like I'm going to be a dad that was something I got to laugh out of and that goes back to like different than the game and which is better and which is done well like I I loved how the game handled it of it being more of a fight between them and Ellie just being like why would you come with me like when you're pregnant like now this is such a another thing that we need to deal with. But it's like this of just I'm going to be a dad. It's just again I think it strengthens the Belly Ramsay version of Ellie and I was talking about the cinematography and stuff earlier about like how the show can do such unique things like coming into the light is such a theme of Last of Us both one and two. But her uh Ellie's sleeping and being woken up by the the water falling on her. And when we ever see from her perspective looking at Dena, you can't see her cuz it's just blinded by the light, right? And then as they're having the conversation, she turns off that",
            "start": 974.72
        },
        {
            "text": "falling on her. And when we ever see from her perspective looking at Dena, you can't see her cuz it's just blinded by the light, right? And then as they're having the conversation, she turns off that flashlight and opens up the lantern. She's just like beautifully lit by it. It's like, damn, man. That those are the little things, right, of just like these character motivations and growth shown through visuals, right? Visually going from the walls up to the walls down. Now I'm back to being Dena and I, you know, I'm here. I believe you and I'm scared and I'm I'm crying and everything else. Yeah. Yeah. I I will say like I am I do want more push back from Ellie as far as Dena being pregnant and going along in the mission. Like I I know we got a bit of that toward the end of the episode and you know Dena looks at her and is like or I forgive if Ellie said this or Dena, but like they're like together and they hold hands. That seems to me like they're going to you know continue this",
            "start": 1012.72
        },
        {
            "text": "and you know Dena looks at her and is like or I forgive if Ellie said this or Dena, but like they're like together and they hold hands. That seems to me like they're going to you know continue this mission. I I I want more of that push back. I don't know. I feel like if you are on this like revenge mission, you know you're in now you have confirmation that you're in the most dangerous area you could possibly be, right? Like this the chances are that this isn't going to go good. You got to send Dena back. See, I understand that, but I also feel like they're in this on another level than video game Ellie and Dena where I feel like they are it's together. We're doing this 100%. It's been that way from the be the literally the beginning with the cookies, right? I was just like, I brought this cuz you're going to be mad. Here's everything I know. And then she shows up at the house that night, right? And she's like, \"You're doing this all wrong. X Y, like they're fused.\" I I'd be interested",
            "start": 1050.08
        },
        {
            "text": "cuz you're going to be mad. Here's everything I know. And then she shows up at the house that night, right? And she's like, \"You're doing this all wrong. X Y, like they're fused.\" I I'd be interested to see if it's at this next episode if they do two mushrooms again. And this time, one of them's Dena, right? That was such a big deal. We were talking about when they took away Joel in the intro, right? If they'll bring Dena in there to really signify that they're together on this for us as viewers or whatever, cuz I think that's sweet and I think it establishes the relationship and where they're going. But I think just the way they're playing this relationship, any more push back would, I think, be out of left field. based on Ellie like having this one moment of like you should go back but no we're together. Yeah. And Ellie's view this Ellie's view on life in general, right? I feel like we're seeing such a different Ellie here like constantly the the way that she was training with Jesse",
            "start": 1088.8
        },
        {
            "text": "we're together. Yeah. And Ellie's view this Ellie's view on life in general, right? I feel like we're seeing such a different Ellie here like constantly the the way that she was training with Jesse like all the MMA stuff which we see her use in uh this episode which I thought was great. But yeah, I feel like she's just a little bit more it's a different type of headstrong than the the game Ellie. Um, and I think that like the concept of a baby in this world, like to children, these are 19 year olds, right? Uh, that have g only known this level of uh, existence. I feel like the concept of protecting babies and like protecting a pregnant woman, it's just different. You know what I mean? Like these are people that every day are out there holding guns at all times. So, I just think that the the way the show's presented it, like I'm with what Greg's saying of like I that we're in this together, I think signifies such a different thing than I need to protect you for some weird dynamic",
            "start": 1123.36
        },
        {
            "text": "the the way the show's presented it, like I'm with what Greg's saying of like I that we're in this together, I think signifies such a different thing than I need to protect you for some weird dynamic between us, which again in the game that dynamic makes sense. But here, I I buy it. Yeah. And I'm I'm curious to see how it plays to of of where we know this is going, right, of like there's going to be a scene where Ellie's gonna take out somebody who's pregnant and it hits, I think, a bit different with knowing what her relationship is with Dena. And I think they do a good job here of, you know, Ella's reaction of, \"Oh, we're I'm going to be a father, right?\" Like, I think that excitement that Ellie's playing this as is, yeah, going to be very like, I guess, effective of where we're going to see that go when she has that moment with I forget the the character's name. It's not Nora, but like the Mel Mel, thank you. The character that she had, they had her name, too. They did. She was the",
            "start": 1164.8
        },
        {
            "text": "see that go when she has that moment with I forget the the character's name. It's not Nora, but like the Mel Mel, thank you. The character that she had, they had her name, too. They did. She was the only one they didn't remember. I want to keep talking about this episode after a quick word from our sponsors. This episode is brought to you by Imperial. We've told you all how important it is to developers to wishlist games that you're interested in. So, if this sounds cool to you, make sure you wishlist it. Imperial is a complex, featurerich action RPG where you'll be sent to a planet in a far-off corner of the galaxy to explore an imposing monolith. As an elite mercenary, you'll join the expedition tasked with unearthing the secrets of the monolith and face off against the deadly automatons within. In Imperial, you'll explore four vastly different quadrants of the monolith. Accessible only by using mysterious artifacts known as cardoggrams. Each cardgram affects which enemies, boss",
            "start": 1203.68
        },
        {
            "text": "within. In Imperial, you'll explore four vastly different quadrants of the monolith. Accessible only by using mysterious artifacts known as cardoggrams. Each cardgram affects which enemies, boss fights, and loot will appear when you enter the monolith, so no two excursions will be the same. Find even more cardoggrams to explore by looting defeated enemies, or buy them from other players online at the trading post. Imperial features three weapon archetypes. The fast-paced acrobatic glaive, the defense focused mason shield, or the devastating cannon with a range of customizable skills and abilities that can make short work of the awaiting automatons. Your weapons and abilities can be changed before any excursion into a cardoggram. So, if a loadout isn't working for you, you can mix things up to create the perfect play style. Help the members of the expedition in deep branching quests and aid other players in asynchronous multi Xbox Series X and PS5. Wishlist now. It helps so much.",
            "start": 1243.68
        },
        {
            "text": "up to create the perfect play style. Help the members of the expedition in deep branching quests and aid other players in asynchronous multi Xbox Series X and PS5. Wishlist now. It helps so much. Wishlist Imperial. This episode is brought to you by Aura Frames. If you haven't called your mom in a while, here is your reminder to do it. But then you want to go above and beyond. Mother's Day is coming up and I have the perfect gift idea. Aura Frames are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preload it with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special, they'll use it every day. Greg, Kevin, and a ton of people here at Kind of Funny are obsessed with their Aura frames. It takes about 2 minutes to set up a frame using the Aura app. So, the next time you need to call your mom, you can also send her a new pick",
            "start": 1288.0
        },
        {
            "text": "here at Kind of Funny are obsessed with their Aura frames. It takes about 2 minutes to set up a frame using the Aura app. So, the next time you need to call your mom, you can also send her a new pick of you from that gift by visiting oruraframes.com to get $35 off plus free shipping on their bestselling Carver Matt Frame. That's a rare frames.com promo code kind of funny. Support the show by mentioning us at checkout. Terms and conditions apply. The show is sponsored by BetterHelp. It's super great that mental health awareness is growing, but there's still progress to be made. 26% of Americans who participated in a recent survey say they have avoided seeking mental health support due to fear of judgment. We can do better. No reason for fear. BetterHelp has over 10 years of experience matching people with the right therapists from the diverse network of more than 30,000 licensed therapists with a wide range of specialties. Some of my best friends use BetterHelp and love how helpful it",
            "start": 1332.72
        },
        {
            "text": "people with the right therapists from the diverse network of more than 30,000 licensed therapists with a wide range of specialties. Some of my best friends use BetterHelp and love how helpful it can be for learning positive coping skills and how to set boundaries. It empowers you to be the best version of yourself. It isn't just for those who've experienced major trauma. If you're thinking of starting therapy, give BetterHelp a try. It's entirely online, designed to be convenient, flexible, and suited to your schedule. We're all better with help. Visit betterhelp.com/kindfunny to get 10% off your first month. That's betterhelp hp.com/kindfunny. betterhelp.com/kindafoney. And we're back. CJ splits on in the chat says, \"To me it feels like Ellie and Dena are trapped in Seattle, not there to shed blood.\" And I I think that that's something that I appreciate about it where I think that uh it's not till Aby's story where we see the football stadium and like like how big the WLF is that you",
            "start": 1378.88
        },
        {
            "text": "shed blood.\" And I I think that that's something that I appreciate about it where I think that uh it's not till Aby's story where we see the football stadium and like like how big the WLF is that you kind of like understand like oh damn like Ellie was crazy for going into this like that. I think that the show has done a uh again it's different but a great job of showing like the military force that the WLF has and even um having Dena like see the the tower and the WLF graffiti and being like that's a sign like that that's them like messing with us or whatever. I think that the the big the presence of the WLF in Seattle and the how much they are running it and owning it that level of fear it's different uh different position for them in this episode them seeing like the kind of war between the presumably Sarah fights and WLF happening in the middle of the city and then them like being like we're doing this together. I just think that it it adds a context to it that's not just whatever",
            "start": 1429.2
        },
        {
            "text": "the presumably Sarah fights and WLF happening in the middle of the city and then them like being like we're doing this together. I just think that it it adds a context to it that's not just whatever it takes we're going to go kill Abby you know. I think I think it it becomes in a lot of ways an underdog story. the the Ellie and Dena feel small in this. They've entered a grand thing. Whereas I feel like and I think it's perfectly illustrated by the news news uh news station fight where it is that like Ellie almost gets killed and it takes everything she has to stop take that one guy down, right? It's not the video game of sneaking sleuththing killing seven people and then a cut scene story happens. We have to run, right? It is like this happens but the gun still goes off and Dina say it's like it's like pandemonium, right? let alone to see the size of the military like you're talking about on the amount of people in clickers and stuff we would have killed to get there. I think it's",
            "start": 1472.8
        },
        {
            "text": "like it's like pandemonium, right? let alone to see the size of the military like you're talking about on the amount of people in clickers and stuff we would have killed to get there. I think it's another interesting point of like as fast as last episodes trip from Jackson to Seattle happened. I was like, damn, we didn't run into any infected. We didn't do anything like that to get there where we are now and have it again mean that like well we didn't because they actually are such a bigger a grander threat than they are in the video game. everything is a grander threat that I think that's what makes that me moment here at the end of the episode even more powerful or it's funny because Jen was watching last night she's like if I didn't know everything this is where I'd be like that's unbelievable where it is the together and they look out across a war zone to see the building they need to get to where it's like you the way they've set stakes for me as a viewer watching I'm like damn",
            "start": 1517.44
        },
        {
            "text": "where it is the together and they look out across a war zone to see the building they need to get to where it's like you the way they've set stakes for me as a viewer watching I'm like damn deck is packed stacked against them what are they going to do how what what other horrors they have to get through and it's only because It's been this slow build to there. Yeah. For me, the fear of the WLF came in for me of Dena and Ellie's perspective. Um, when they're in that stuff when you see the smoke grenades come in and there's like an organization that they have, right? Like they are this is military like they now see that and I think that sets the stage very interesting where I I I think you are going to see it as as this underdog thing, right? Uh, but one of the thoughts I had and questions I want to present to you guys because it's been a a minute since I played last was too. Here we go. This is where we always get ourselves in trouble since since launch, right? Like when does Ellie's",
            "start": 1557.44
        },
        {
            "text": "I want to present to you guys because it's been a a minute since I played last was too. Here we go. This is where we always get ourselves in trouble since since launch, right? Like when does Ellie's blood lust come in? Like really obviously like she's going after Abby that like her and Dena are on this mission, but I know I know there's like a turn at some point or maybe just a gradual that's the real but my thing is I think gamewise I felt a blood lust from Ellie from the jump. I feel like it's like she jumps like from the journey to Seattle. It feels different than how they're presenting it in the show. I do think in the show we're that it's gonna be the Norah moment that I think especially now well you guys didn't watch the [ __ ] next time because whatever but I did. Okay, cool. Last week I didn't just because it happens after like I said we're talking about all spoiler stuff for this but yeah the spores they're being introduced and I that's an interesting thing especially because",
            "start": 1594.64
        },
        {
            "text": "I didn't just because it happens after like I said we're talking about all spoiler stuff for this but yeah the spores they're being introduced and I that's an interesting thing especially because uh they didn't have them last time. So why are they doing it now? I was saying uh in last week's episode I think that like to me it makes sense because we are talking about a grand ground zero. the lower levels of the hospital are kind of the craziest that we've seen in the game so far um in terms of infected and what that could mean. And I was gonna be let down with the Nora situation because I do think that the spores in that scenario make it so much scarier and like more visceral. Um but this episode proved that you don't need them because the Dena turn of the bite and all that stuff work just as well. Um but yeah, I think that uh in the episode where she kills Norah, like I think that's going to be blood, lust, and anger to a degree that you can't return from. I feel like that's when it's",
            "start": 1633.92
        },
        {
            "text": "as well. Um but yeah, I think that uh in the episode where she kills Norah, like I think that's going to be blood, lust, and anger to a degree that you can't return from. I feel like that's when it's going to be killing like not just to kill but it's like oh it's Yeah, exactly. It's like oh [ __ ] we're too far gone. That's when we're on the hunt, right? Like this has all been the the prelude to actually getting there and that's why she you know I think that's when we see the Ellie that we saw at the kitchen table when she whispered Abby, right? Like I would I will re I rewatched last week's episode again because Jen hadn't seen it because of how we reviewed. And so like again that's for me one of the most powerful understated moments from Bella Ramsayy's performance so far of just like in the girl with the braid Abby Abby like she just says it in a way of like I have been it's just all told with the voice and the look of like I have been questing for that one piece of information",
            "start": 1670.32
        },
        {
            "text": "in the girl with the braid Abby Abby like she just says it in a way of like I have been it's just all told with the voice and the look of like I have been questing for that one piece of information since that moment and I finally have it. I'm going to [ __ ] kill her. And I think we get now that same we kind of saw that today of like or yesterday watching when the thing goes off and mentions Norah and she's like Norah's one of them and she see her like kind of go like you know the point of back on that track. Uh we got some super chats. CJ Splitzson says how do we feel about the lack of Tommy in Seattle? I still think we'll get there. I think so too. Like we we build up Jackson so much like we're going to get uh back in Jackson and there's going to be the conversation of where's Ellie and Dena and then you think so? I think so. I my my prediction and I'm often wrong, but I would think you're going to get, \"Hey, they're going to that building and get pinned down and it looks all like",
            "start": 1710.64
        },
        {
            "text": "Dena and then you think so? I think so. I my my prediction and I'm often wrong, but I would think you're going to get, \"Hey, they're going to that building and get pinned down and it looks all like all is lost and then ping ping sniper shots are going off and they're like what the [ __ ] isn't that's going to be Tommy?\" Well, yeah. I mean, that could happen too. Maybe we don't actually get it in. We're going to get the context of Tommy comes to Seattle and the reason being like he'll explain to them or maybe not. Maybe they don't even actually meet up or anything like I mean I feel like that's big for the story of of like you know Tommy and Jesse coming to Seattle and what happens when they when they have like that big encounter. So you got to bring them at some point. I was going to bring this up earlier the theater. Like walking to the theater I was like oh my god. Like I didn't expect it to hit me as hard as it did. I was like damn this is where [ __ ] goes down man. And like I",
            "start": 1750.88
        },
        {
            "text": "this up earlier the theater. Like walking to the theater I was like oh my god. Like I didn't expect it to hit me as hard as it did. I was like damn this is where [ __ ] goes down man. And like I just love seeing them like just start walking around and I'm like oh man there's going to be so much more here. What what about the horse? They never blew up the horse. Which honestly like like honestly that's fine. I'm I don't need you to blow up a horse. But I was surprised of like oh cool we just locked away Shimmer in a room and Shimmer never got blown up in the music store forever. That is interesting. I wonder if Shimmer returns. Shimmer will return. Uh El Capitan says, \"Based on the trailer for next week, do you think we're getting the Rat King before the end of the season?\" H I guess I didn't see the trailer for next week. Is it implied? I I mean it's building towards it for sure. It's the hospital stuff they're talking about. I think you do. Yeah. By the end of the season, I think",
            "start": 1786.8
        },
        {
            "text": "didn't see the trailer for next week. Is it implied? I I mean it's building towards it for sure. It's the hospital stuff they're talking about. I think you do. Yeah. By the end of the season, I think that it would make sense. That also a big end of season kind of like moment and thing. Similar to like that when the bloaters got introduced at the end of last season, right, when that one village fell. I I I could see it, especially if they are doing the I haven't watched this season at all, so you can correct me if I'm wrong, but if they're doing kind of holding a lot of Abby stuff for the next season, I think there could be some playful like playful um you seeing the rat king stuff from Ellie's perspective, which then like if you cut over to Aby's episode and perspective from it, you could possibly see kind battle or anything with the racking But I definitely think it'll be like we will know there's this big ass scary thing here. Sure. [ __ ] yeah. Um, and then Cooking with Vinnie",
            "start": 1824.8
        },
        {
            "text": "possibly see kind battle or anything with the racking But I definitely think it'll be like we will know there's this big ass scary thing here. Sure. [ __ ] yeah. Um, and then Cooking with Vinnie says, \"I just don't believe in this Ellie's revenge quest. The games Ellie gave me the sense of blind rage towards Abby and when Dena was a burden for being pregnant.\" Yeah, I just think it's different. Like again, I feel like the game did a great job of setting up that story, but I think the story they have here is is a different It's just the weird thing of Yeah. translating it to TV cuz also in the game, you're you're murdering so many people on the way there, right? Like there's just a different feel to video game Ellie than TV Ellie. And honestly like I think for me this season it took me a minute to warm up to TV Ellie. I think this episode was the thing to sell me though. Like I think the back and forth uh with Dena is more vital to I think establishing Ellie's character as somebody you",
            "start": 1870.16
        },
        {
            "text": "to warm up to TV Ellie. I think this episode was the thing to sell me though. Like I think the back and forth uh with Dena is more vital to I think establishing Ellie's character as somebody you connect to and somebody that like I think that is her grounding in this world. Well, she's finally happy, right? She finally has something to be happy about or show light. She's been so dark this entire time. And and I but I also think there's the thing of you know TV Ellie doesn't sometimes doesn't even feel as practical as like video game Ellie where video game Ellie for me feels like a soldier a lot of times I think like having Dena there in the show to be like hey you need boots hey you need supplies you need you can't just take bullets like yeah no chucks there's something about it being a Dena Ellie like team as opposed to it being Ellie Solo which I'm sure we're going to get there to Ellie Solo right but like I think there's something about that that paints the story a bit more um of a",
            "start": 1910.64
        },
        {
            "text": "Ellie like team as opposed to it being Ellie Solo which I'm sure we're going to get there to Ellie Solo right but like I think there's something about that that paints the story a bit more um of a different yet still interesting and fascinating way that I like uh versus the video game version where I think to murder 100 people like you need like you need that blind stab VA girl in the neck. Yeah. Like I think no matter what for Lastless 2 as a story like that is a video game story that works because it's a video game because it is about like being in this violent place and like as a player what it means to go go through on this like war rampage across people so you can do this revenge quest. Um, so I I I I think a slow build in a TV show toward the blind rage makes more sense, especially if the Norah moment is the thing to turn it. Yeah. Yeah. And the thing for Ellie in the show to me is that I feel she's a lot more look before you leap or leap before you look um than the game",
            "start": 1952.72
        },
        {
            "text": "if the Norah moment is the thing to turn it. Yeah. Yeah. And the thing for Ellie in the show to me is that I feel she's a lot more look before you leap or leap before you look um than the game version. And it's because you're playing the game, so it is different. You're you're more actively in control and you the person is making decisions of how to go about things. whereas uh pairing her with Dena who does seem a lot more uh strategic and understanding of like how this is all going to go. I like the concept of them being this team and what happens when they're separated and what happens when Ellie is then going too far both because of anger or whatever and doesn't have somebody to not just pull her back but also like allow her to stop and think about her actions. And I think that's where we can easily get back on track, quote unquote, to where the story needs to get in terms of Ellie's choices and actions or lack thereof thought process turning into disaster for everybody around her.",
            "start": 1996.16
        },
        {
            "text": "we can easily get back on track, quote unquote, to where the story needs to get in terms of Ellie's choices and actions or lack thereof thought process turning into disaster for everybody around her. Yeah. I mean, do you I guess a bigger question here is do you see them altering from the video game story in a major way for like character fates and stuff? Cuz I could also see in the way that we're talking about Ellie and Dena in their relationship and what Dena does for Ellie and Ellie getting in like what pushes Ellie to blind rage mode in the way that we're talking about like oh maybe Ellie doesn't kill Mel or something like that, right? Like could it be that Dena gets killed also by one of the wolves people or by Abby and that is like the thing to really send Ellie? I will be incredibly upset if they kill Dena. Yeah, I think that that will be a bridge too far for me that I'm like I don't think that that's a difference that I don't think they can back up. I don't think there's any",
            "start": 2036.8
        },
        {
            "text": "upset if they kill Dena. Yeah, I think that that will be a bridge too far for me that I'm like I don't think that that's a difference that I don't think they can back up. I don't think there's any way they can tell a story that that's the right choice. Like I feel that would be just for shock for shock sake and all that cuz I think getting to the end of the game like really the theme of the Last of Us 2 and the core story of it all I think it's important that Dena and the kid live like I think that is so and that and that Ellie makes be with them around. Yeah. Yeah. I really hope that that's not the case. Yeah, I don't think No, I don't think that'll happen. I think there's two reasons. One's the weakest. The second's the strongest, I think. But the first one would be remember when we got the initial trailer and the initial characters and everybody was like, they're going to fridge Dena. They're just going to do this trope and da da da da da. I imagine first off, again, that's still a",
            "start": 2080.08
        },
        {
            "text": "the initial trailer and the initial characters and everybody was like, they're going to fridge Dena. They're just going to do this trope and da da da da da. I imagine first off, again, that's still a trope and people would still be like that. And I just don't think that's the vibe you'd go for. Secondly is more important. Did you ever watch uh a [ __ ] The Claw, right? What is that? the the wrestling movie. Tim, I need your help. The wrestling movie. It's the claw, right? Ironclaw. Ironclaw. Thank you so much. Did you ever watch Ironclaw? Yeah, I watched Ironclaw. Cried through Ironclaw. Claw. What a great movie. And then reading about it afterwards cuz I know about the Von Eric family obviously through pro wrestling, but reading about it and finding out that there was another brother that they just didn't put in the movie. And it's another brother who also had a very shitty end like the other brothers in that movie. And they in one of the interviews with the writer/director, whatever",
            "start": 2120.08
        },
        {
            "text": "they just didn't put in the movie. And it's another brother who also had a very shitty end like the other brothers in that movie. And they in one of the interviews with the writer/director, whatever it was, was like, \"Why?\" and they were like, \"Yo, he was in early versions of the script, but it turned out that was just one tragedy too far. Like, it's just like you can only take so much.\" And I think if you were to bookend this season with like Joel dies and then so does Dena, like I think you'd lose everybody and it would just And then it would also be completely unbeliev What's Ellie's journey from there, right, of just being like the coldarted murderer, but also like nothing to live for. Yeah. But it's cuz she has something to lose and she loses it and we see her lose it and come back to it, right? Like that's why it's so powerful. Go back to the farmhouse, find it empty, open the room, try to play and get the visualization. And again, like are they ever going to introduce Future",
            "start": 2156.8
        },
        {
            "text": "to it, right? Like that's why it's so powerful. Go back to the farmhouse, find it empty, open the room, try to play and get the visualization. And again, like are they ever going to introduce Future Days? Is are we ever going to hear the Pearl Jam Future Days song, right? Which is the backbone of the entire game. Like it's it's all it all leads back to that song, right? If I ever to lose you, I'd surely lose myself. And that's every relationship in this game. And it's Ellie's end, right? Yeah, I think we do. I I do too. I do too. Yeah. Uh well everyone, let us know in the comments what you thought of this episode of The Last of Us and uh who you think's going to die in the future of this show. Um stay tuned. We're about to do a Cyberpunk 2077 stream and then after that, Alien Covenant in review. Until next time, love y'all. Goodbye.",
            "start": 2196.4
        }
    ]
}