{
    "id": 14050,
    "video_id": "ySIlCz7X-pA",
    "show_name": "Kinda Funny Podcast",
    "hosts": [
        "Nick Scarpino",
        "Blessing Adeoye Jr.",
        "Mike Howard",
        "Roger Pokorny"
    ],
    "title": "The Kinda Funny Civil War is Coming - Kinda Funny Podcast",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page - https://store.steampowered.com/app/1377700/Empyreal/ \nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nThis episode is sponsored by BetterHelp — go to http://betterhelp.com/kindafunny to get 10% off your first month.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1746565410,
    "duration": 3245,
    "transcript_chunks": [
        {
            "text": "[Music] What is up ladies and gentlemen? Welcome back to the kind of funny podcast. I'm one of your hosts Nick Scarpino alongside blessing Junior. Good day Nick Scarpino. And rounding out the triplets today is Roger Pakornney. The GTA 3. Hey the GTA 3. GTA 3. Oh, we already GTA 3 right there. We're already here. Mike's here. Oh, [ __ ] My bad. When did Mike get here? You guys, we we're we're short staffed today. Uh Greg's packs. Tim's down in LA seeing a game. We All sorts of stuff's going on right now. Uh the the podcast prior to this went a little bit long. Everyone got off and we're like, \"What's the energy? What's going on? Who's who's got energy for this? Who doesn't have energy for this?\" We go around the table and we're like, \"Mike, Mike, do you want to be on this?\" Mike's like, \"Whatever you guys need is totally fine.\" And you guys were like, \"Let's just rock it, the three of us. We'll give Mike some some time off.\" Mike goes, \"No problem. I don't even want to be on the",
            "start": 0.42
        },
        {
            "text": "\"Whatever you guys need is totally fine.\" And you guys were like, \"Let's just rock it, the three of us. We'll give Mike some some time off.\" Mike goes, \"No problem. I don't even want to be on the podcast.\" Not a problem. As we're getting ready to do this, Mike pulls up a chair, a mic, and his computer, and is now sitting off to the side. One more time. The coldest water, too. Just the ice cold water. Ice cold water. Gigantic smart water. I want some juice right now, Nick. I don't know if you saw, uh, but there's a new advertisement out on the billboards around town. a new Simply Pop. I think Simply Juice, but they're making a soda pop. So, they're taking juice and just carbonating it, making it a pop. And I said, \"Man, I really want that.\" I wanted to. It worked. No, cuz like you've had Simply Lemonade and Simply Lemonade is incredible. I'm a Simply Pineapple man. Sometimes they go mango. Have you ever had Simply Simply Pineapple? Mike, we got to talk about it. It's got It's got to",
            "start": 58.72
        },
        {
            "text": "Simply Lemonade and Simply Lemonade is incredible. I'm a Simply Pineapple man. Sometimes they go mango. Have you ever had Simply Simply Pineapple? Mike, we got to talk about it. It's got It's got to have the moment. Why do you drink so much pineapple juice? Why you Are you doing it because it makes your thing taste better? Baby juice sound. Why do I need to get ready when you're out there ready? That's true. That's true. Ladies, just let you know. Look at the shot. Look at the shot. Look at this amazing shot from Mike. Couldn't have sat in a worse place. Could have sat one over right there, but wanted to put his feet up on this [ __ ] massive speaker that we have. Just wanted to be comfortable. But by the way, those seats are like the the least comfortable seat we have in the entire office. I know. You could have been sitting in this nice cushy chair, ladies and gentlemen, because this is the kind of funny podcast where each and every week, three, sometimes four best friends gather",
            "start": 99.12
        },
        {
            "text": "I know. You could have been sitting in this nice cushy chair, ladies and gentlemen, because this is the kind of funny podcast where each and every week, three, sometimes four best friends gather around this table or that truss over there. Each bringing topics for your amusement. Couple housekeeping things before we begin. Hey, Alien in Review is back. It continues this week with Alien Covenant. We recorded that yesterday if you guys weren't watching live with us. Hey, it's a banger and it's a really, really fun one. So, go check that out on podcast services around the globe. Also, this Friday, history is about to be made. Snowbike Mike, the most athletic man west of the Mississippi, is embarking on the most daring quest yet, going step for step with Sam Porter Bridges in a literal marathon stream on a treadmill. A marathon stream. There he is. He's bringing it in right now. Ladies and gentlemen, come join Roger and Mike this Friday as they attempt to do a full playthrough of Death",
            "start": 137.6
        },
        {
            "text": "stream on a treadmill. A marathon stream. There he is. He's bringing it in right now. Ladies and gentlemen, come join Roger and Mike this Friday as they attempt to do a full playthrough of Death Stranding one through the weekend, but they can only do it with your support. Will Mike and Roger break this treadmill and have to drive to Andy's home at 1:00 a.m. to borrow his? Probably. Probably. Mike, how you feeling about it? Good. Oh Jesus. [ __ ] what are you doing? Nick, I am super excited to walk on this treadmill. Uh we have a lot of cool sub incentives and a lot of goals that we're going to do. We also have an office pool going on. I don't know if you heard, but today we kicked off the shows with a fun office pool on who can guess when Snowike Mike will throw in the towel and officially give up walking. Interesting. I want I say I'm done. Yeah. So this I'm done at the speed show. Okay, we have a jib shot, but Mike already sounds out of breath. I know. I am out of breath. I am out",
            "start": 175.68
        },
        {
            "text": "give up walking. Interesting. I want I say I'm done. Yeah. So this I'm done at the speed show. Okay, we have a jib shot, but Mike already sounds out of breath. I know. I am out of breath. I am out of breath. The jib is refusing to focus correctly. So, here's the deal, Nick. I I've asked the office and of course, winner of this pool gets to go out to lunch with me and Roger. Okay. Okay. So, I'd like to get in on this. You're in. So, when we start this walk-athon at 12:00 p.m., let's say most likely 2:00. We know how this shows around here on the days. Well, this podcast was supposed to actually Yeah, we're pretty close. We're pretty close enough. What time? How many hours, how many minutes, how many seconds will it take until I say no more, Roger, I can't do it. Now, some poll options here. Yeah, of course, Andy said 14 hours. Barrett said 12. Kevin said 10 or 22. Couldn't decide between one or the other. Um, Blessing said 7 hours. And of course, Snowike Mike said the whole damn time.",
            "start": 213.28
        },
        {
            "text": "Yeah, of course, Andy said 14 hours. Barrett said 12. Kevin said 10 or 22. Couldn't decide between one or the other. Um, Blessing said 7 hours. And of course, Snowike Mike said the whole damn time. So, this is not the stream. It's just how how long until you stop walking until I look at Roger in the chat and I go, \"You've killed I'm going to die here. I can't walk anymore.\" into the stream, right? So, that includes like him sitting down or like Well, he only he No, he only sits down like during like the cut scenes or he stops walking at the very least during the cut scenes. I think I think five hours. Yeah, I'm gonna say five hours. Five hours of straight walking is very difficult. Now, here's what might not be straight walking, though. This is what I'll factor in is that the cut scenes, this is a Cojima game. You got some long cut scenes. Long cut scenes. That's true. But he will walk during the cut scenes if the character walks. No, you can't do then. Let me change my answer. I'm",
            "start": 259.92
        },
        {
            "text": "this is a Cojima game. You got some long cut scenes. Long cut scenes. That's true. But he will walk during the cut scenes if the character walks. No, you can't do then. Let me change my answer. I'm going to sit down during the cut scenes. Got to rest. No, I don't think that the is the character moving that much during the cut scenes. If the character standing, Mike needs to be standing during the cut scenes. And we're going to keep to that. Oh, you're not doing Yeah, give me give me my blessing. Update your time and put down Nick's time. So, Nick, you are going to stick with five hours. Oh, five hours. You think 5 hours until I throw in the towel and I say, \"Roger, no more.\" I think I think your legs are going to burn so badly after 3 to four hours of playing this game that you're going to be you're going to be ready to sit it out for the rest of your life. Just remember, my bottom half doesn't match the top half. My bottom half, that's the strongest part. That is the strong part. We",
            "start": 306.16
        },
        {
            "text": "be you're going to be ready to sit it out for the rest of your life. Just remember, my bottom half doesn't match the top half. My bottom half, that's the strongest part. That is the strong part. We don't talk about the top part. We don't talk about the top. Look at that. Godamn. Look at these jams. Holy [ __ ] He climbed Mount Everest once on a treadmill. Well, ladies and gentlemen, find out this Friday on twitch.tv. TV/kind of funny games exclusively on Twitch, I imagine. Uh, shout out to our Patreon producers James Hastings, Carl Jacobs, Omega Busters, and Delini Twining. And also today we're brought to you by Imperial Oraframes and Better Help, but we'll tell you about that a little bit later. For now, let's start with my topic of the show. Also, I I um changed my number to 3.5 hours. 3.5 hours. Oh, you Oh, you undercut me. Yes. I'm going to go three hours. Mike hours. Okay. You know what mine was? No, I'll say five. I'll say five. I'll say you know what mine was? What's that? 13",
            "start": 340.64
        },
        {
            "text": "3.5 hours. Oh, you Oh, you undercut me. Yes. I'm going to go three hours. Mike hours. Okay. You know what mine was? No, I'll say five. I'll say five. I'll say you know what mine was? What's that? 13 hours over 13 hours. You shouldn't be allowed to bet because you work for the company. You know what I'm saying? Me, too. Yeah. But but my thing is this. What I mean by you work for the company. Oh, I'm the one controlling is that I mean, you know, when like they're like, \"Oh, you can enter in the sweep stakes at Kelloggs, but you can't enter that in if you have anything to do with it at all cuz then you could like manipulate it. You could [ __ ] with Mike constantly and make it your time. So, you're just stand you're allowed to come to lunch if I win, but you have to stand outside and look at at the window. Okay, I'm getting cucked. Yeah, you're going to get cucked. You stand in the cuck window. Yeah, we're going to eat pizza. We're going to eat round table pizza and you're going to have",
            "start": 380.8
        },
        {
            "text": "at the window. Okay, I'm getting cucked. Yeah, you're going to get cucked. You stand in the cuck window. Yeah, we're going to eat pizza. We're going to eat round table pizza and you're going to have to sit over by the salad bar. Just eat chickpeas while you while you maintain eye contact with me at all times. Here's the topic of the show. Tot. We have a couple topics that we want to talk about. Blessing, you brought the Met Gala in. We're going to look at the the fashion for that MetGala and just see what Walton Gogggins was wearing. But I have the two of you here and you two are the most the ones responsible for Game Showdown. Yep. So my question to you is, has Greg Miller gone too far with the Tim Farewell Tour? Let's have a conversation. Let's go behind the scenes. Let's go the scenes. Let's feel this out. Because Tim the other day before we were starting was like I think actually I think we were on a podcast. We were on Gamescast. We were talking about uh uh Extraction Shooters.",
            "start": 418.48
        },
        {
            "text": "Let's feel this out. Because Tim the other day before we were starting was like I think actually I think we were on a podcast. We were on Gamescast. We were talking about uh uh Extraction Shooters. Yeah. And we were joking around. We got off on a tangent and the set changed to the podcast and Tim had an like a a visual tightening up. Like he went like this and looked around. It is so Pavlovian now that anything that's out of the ordinary here is terrifying to him. Like legitimately probably causing him to not be able to sleep at night, which I think is hilarious. But I wonder from your guys's perspective as more I would say well put together human beings. Do you think Greg's taking it too far? It's infected me as well because today uh we were doing a thing where uh we were reading out Bless was reading out a bunch of the details of Grand Theft Auto 6's characters, right? And he was like, \"Okay, green light. I'm just going to keep on going. Say red light whenever you want to stop and",
            "start": 460.32
        },
        {
            "text": "was reading out a bunch of the details of Grand Theft Auto 6's characters, right? And he was like, \"Okay, green light. I'm just going to keep on going. Say red light whenever you want to stop and talk about a detail.\" Right? So then Kevin had a great bit where he changed the set. Jesus Christ, it wasn't doing that. Uh, but it turned red, right? It turned red almost like in review and I got scared. One of the chances that he can't stop. One of the changes that he's pressing a button and it's just not working. It doesn't stop immediately. There's like a transition period. But the whole set turned red and I got so scared because in the chat was Greg. Clearly, he was there cuz he was saying AUV PPP and I got so scared. I was like, is this a Greg bit? Is he calling in? Is this continuing the whole thing? So, it's it's seeped into not just him. I think it's just all of us a little bit. See, I don't mind it because I don't pay attention to anything at all ever. But, I do think that it's it's",
            "start": 508.0
        },
        {
            "text": "thing? So, it's it's seeped into not just him. I think it's just all of us a little bit. See, I don't mind it because I don't pay attention to anything at all ever. But, I do think that it's it's I I worry that it's one of those things where you've all we've all been to prison, right? Yep. Uh you definitely don't want to be the new guy. You want whatever guy's getting harassed in the prison, you want to just help the guy that's harassing him so that he doesn't turn that [ __ ] on you. And I worry that we're all doing that now. I we're all just letting Greg run a muck just so that he doesn't turn his sights on Blessing or Roger or me or he's turned his sights on me before. Has he? Yeah. When he threw the buzzer and he threw a tantrum. Oh, that's true. Him and I have have been have been not not, you know, seeing eye to eye for a few years now, so he can turn on me anytime. But I think Andy's the biggest person. The thing is I think Andy was very much happy about this whole situation",
            "start": 549.2
        },
        {
            "text": "not not, you know, seeing eye to eye for a few years now, so he can turn on me anytime. But I think Andy's the biggest person. The thing is I think Andy was very much happy about this whole situation because yeah, that meant that he didn't have to get the attention from Greg, which I understand. I think for me the part of Greg going too far is less about the effects that it's had on Tim and more so just the enabling of Greg Miller. M and I I I think for me this has been the game showdown season where I've realized that uh this office is just the Greg Miller circus where we just let him do whatever he wants and he just goes crazy with it and every day is you know some new clownery that's going on in the Greg Miller circus and that's the thing that I worry about a bit more is like we the war of escalation the the war of escalation uh the amount of ground that we've given him the amount of how much of this how much of Greg uh like is I guess how much of it is him feeling like he needs to",
            "start": 590.96
        },
        {
            "text": "of escalation the the war of escalation uh the amount of ground that we've given him the amount of how much of this how much of Greg uh like is I guess how much of it is him feeling like he needs to do this right like this is what drives the company this is what like it's almost a responsibility oh I see that of him to like you think so us I think Greg Gre you think Greg looks at the landscape looks at the makeup of kind of funny and says the majority like the reason people like this company is because of the zenness that he brings to it so you think he ramps that up is that what you're saying I I think it's that plus the fact that I think he has found a way to monetize torture. I I think I think on it. Thank you. That part. Yeah. I I think it's the thing of like, you know, he terrorizes Tim and it's like, all right, that's what I got to do. It's for the He's able He's able to uh justify it. It's a self-fulfilling prophecy. Yeah. Yeah. It's a self-fulfilling prophecy. He's able to",
            "start": 638.64
        },
        {
            "text": "Tim and it's like, all right, that's what I got to do. It's for the He's able He's able to uh justify it. It's a self-fulfilling prophecy. Yeah. Yeah. It's a self-fulfilling prophecy. He's able to justify it because we, you know, the audience gives him money to do it. But how how far is too far on that? Like when it gets turned to Andy or when it gets turned to Roger? Well, when it gets turn into Andy, it's gonna be it's gonna be it's gonna be bad. Yes. Because Andy will pull us into a room like, \"All right, hey guys, we probably shouldn't do this anymore.\" Yeah. And then then it won't be fun anymore. Whereas Tim doesn't have a choice because he's a co-founder. Yeah. So, and and it's in the bylaws of our company that it says literally the last paragraph it says, \"Go Tim, go [ __ ] yourself.\" Like literally, we'll just torture you if we want to torture you. Yeah. Nick, I'll cathartic. I'll ask you this question. Right. as somebody who's who's also a co-founder alongside Tim and Greg.",
            "start": 685.52
        },
        {
            "text": "Like literally, we'll just torture you if we want to torture you. Yeah. Nick, I'll cathartic. I'll ask you this question. Right. as somebody who's who's also a co-founder alongside Tim and Greg. Of course, Tim allows a lot of Greg, right? Like Tim allows the tor his own torture because he believes in the content. He wants to make this like, you know, the best content possible. Yes. But I think we all have a shared understanding that Tim I don't think Tim's ever going to get the get to the point where he says no. No, I don't think he will. I think Tim is I think Tim is along for the bit. He's what's what's the term? Kayfab. Kayfab. Yeah. Kab. I think he's along for the kayfabe for now. I think there would be a there is a turn like a threshold. What is that turning point for Tim is what I want to know. Yeah, I think honestly if we went to his house and scared him about a fire, I think he would that would have been the drawing point cuz that was the plan originally was for us to go to",
            "start": 725.6
        },
        {
            "text": "want to know. Yeah, I think honestly if we went to his house and scared him about a fire, I think he would that would have been the drawing point cuz that was the plan originally was for us to go to his house with with Greg and then somehow convince Gia to be like, \"Hey, oh my gosh, there's a fire in the there's some there's some type of leak or fire in the uh in the theater room. you need to come downstairs and then boom, we'll be there with Nick and cameras and lights and we're [ __ ] ready to go at 3:00 a.m. I truly believe that that would have been the turning point because right before we did all of this, he like not gave it this is not like breaking cave or anything. He had no idea about the cash in, right? But he did give us like the kind of like push of like you guys could do whatever you want like I like just do it. Don't worry about me. Don't tell me just do it. Don't worry about me. And I looked at him, I said, \"Are you sure about that?\" Because there's some ideas here that",
            "start": 767.52
        },
        {
            "text": "you want like I like just do it. Don't worry about me. Don't tell me just do it. Don't worry about me. And I looked at him, I said, \"Are you sure about that?\" Because there's some ideas here that that might [ __ ] you over. Yeah. I mean, for for sure going to a person's house, that's probably crossing a line. But I think he might have left it though. I think 50/50. I think he either might have been like, \"That's too far.\" Or he might have been like, I don't think he That's the thing is I don't think he would have said it was too far. Really? I think he would have been like, \"Damn, you guys are You guys are fucks.\" Like say the Tim, well, you guys are [ __ ] Yeah. But tired Tim is different. Tim. Yeah, you got to remember that because you have to remember the thing about Tim is that he is a consmate professional and he understands Tim has the ability to see what's happening outside like take a step back from his own body and be like is this good content? Yes. Yeah. And you could even",
            "start": 812.8
        },
        {
            "text": "a consmate professional and he understands Tim has the ability to see what's happening outside like take a step back from his own body and be like is this good content? Yes. Yeah. And you could even see it like midway through the like when when the interview happened when he was doing the Onamush interview and all the stuffed breaking, you could see him confused, but there's a little bit in his brain that's like, \"Okay, this is kind of genius, right? This is going to be a great way a to get eyes on this interview and b to really kind of put a pin in this whole SARS in the bank thing.\" I I think he probably would be okay with it to a certain degree. I know for sure I would not be. Yeah. I know for sure that if like cuz there have been moments where Greg has crossed the line with me where he's like got my mom to call in and I was like look dude my mom doesn't understand what the [ __ ] going on and like you're going to confuse her and scare her so like let's stay away from that aspect",
            "start": 849.12
        },
        {
            "text": "he's like got my mom to call in and I was like look dude my mom doesn't understand what the [ __ ] going on and like you're going to confuse her and scare her so like let's stay away from that aspect of it but I think Greg also understands that I there's there's like two schools of thought in this in this company right one is if a joke is played on you haha right and we all just wait for it to mellow out or him. Do I escalate it? Yeah. And I think Greg knows Greg knows that I have a 50. I'll say 30 3030. 30% shot chance of being like, \"This angered me. I don't like this. Let's have a real conversation about it.\" 30% chance of me like hilarious, but I have other [ __ ] I got to do, so I'm not going to worry about this anymore. And then another 30% chance of how many footballs can I buy and put in his house before he can't physically inhabit the house anymore. That's where my brain goes. And I love that kind of [ __ ] I love that. Yeah. Yeah. You are pretty even keel. You are pretty",
            "start": 889.44
        },
        {
            "text": "and put in his house before he can't physically inhabit the house anymore. That's where my brain goes. And I love that kind of [ __ ] I love that. Yeah. Yeah. You are pretty even keel. You are pretty even kill. And I think Mike, you could probably hit with a stick and he'd still love you. Mike's like Mike's like a dog. Yeah. You know, no matter what you say to Mike, what you do to Mike, he loves you. Like a dog. I would love you guys through and through. I picked up the microphone like it was going to love you guys through and through. I'd do anything for you. The GTA 3. I'd rather die. You'd rather die. Ride or die. The GTA. You could show up at my house, wake me up at 2 o'clock in the morning. I might wake up butt ass naked, but I'm still getting up with those. You know what I mean? I I I appreciate, Nick, that you view me as as even kill. You're even cute. Because I because I feel like Greg does have restraint when it comes to me. Yes. He doesn't He never goes that crazy when it's",
            "start": 933.76
        },
        {
            "text": "I appreciate, Nick, that you view me as as even kill. You're even cute. Because I because I feel like Greg does have restraint when it comes to me. Yes. He doesn't He never goes that crazy when it's just me. Yeah. I think I think it's because you represent probably like the most professional aspect of our business. Like the stuff you do for the actual podcasts, the shows. I look at that and I go, \"Oh, that's the actual like real professional our our visibility in the video game industry.\" Like people would see that like Shuhi has compliments for you. People listen to the words you say and go, \"Wow, this guy really knows what he's talking about.\" And that's really great. But our business is always such a weird amalgamation of both of those sides. It's always the DNA of hardcore we want to be the best at IGN versus I mean I brought those flowers home to my wife yesterday and you brought them home and I forgot to read cuz no one they left them here. I was like oh I'll take them home and",
            "start": 973.36
        },
        {
            "text": "be the best at IGN versus I mean I brought those flowers home to my wife yesterday and you brought them home and I forgot to read cuz no one they left them here. I was like oh I'll take them home and and my wife picked up a note and said hey did you get these for me and I was like no someone got them at work and she goes why does it say that Tim's pee pee no longer work and I'm like I don't know how we exist. That's hilarious. How do we exist? That's so funny. How have we not picked a lane yet as kind of That's so funny. That's hilarious. That is so And you didn't even read the the note. You just gave it cuz I was like literally as I was leaving I had to leave late yesterday and I was like, \"Uh, is anyone take these flowers? They're really nice flowers.\" I'm like, \"We'll leave them here, but they're pretty and like they would look good in my house and and Greg was like, \"No, Nick, take them home. You're fine.\" And I put them there and I brought them home. It's just this first off,",
            "start": 1020.4
        },
        {
            "text": "but they're pretty and like they would look good in my house and and Greg was like, \"No, Nick, take them home. You're fine.\" And I put them there and I brought them home. It's just this first off, Greg's handwriting looks like a [ __ ] psychopath. He looks like a serial killer. And second off, he did the thing. I mean, the note was perfect. He did the thing where it was like it started writing big and then got smaller and smaller and smaller and then kind of curled around because he didn't have he didn't know where he was going to go with it cuz he's [ __ ] Greg Miller. I mean, really, the company is Greg in a nutshell. You think about it. Well, I think we're we're we're doing the deep dive into the the mental psychology of Greg Miller and we're saying, \"Oh, he does he do it just cuz he, you know, feels like he has to, right?\" But I think at the end of the day, Greg is a child at heart, right? He sees he sees toy and he wants to play with toy. He sees stars in the bank. He wants to",
            "start": 1060.48
        },
        {
            "text": "you know, feels like he has to, right?\" But I think at the end of the day, Greg is a child at heart, right? He sees he sees toy and he wants to play with toy. He sees stars in the bank. He wants to play like like wrestler, right? He sees the that flashback of watching wrestling growing up feeling like I want to be Edge or Exactly. Yeah. Uh he see he gets the the championship belt. He uses it way more than we've ever have this entire show. And now he's actually wearing it all day. He gets to wear the suit. He gets to do a Cody Rhode thing. I think it is just it's wish fulfillment through and through. I I don't think it is there's less of like this the It's amazing to me though. It's like nobody else does it. No, no one else. And I think it's earnest, too. I think it's genuinely earnest. I do wonder how much of it is the analysis of like him being a content creator, right? Of like every day needs a moment. Every day needs a breakout. I'm going to put And I And I know that if I zero in",
            "start": 1092.72
        },
        {
            "text": "do wonder how much of it is the analysis of like him being a content creator, right? Of like every day needs a moment. Every day needs a breakout. I'm going to put And I And I know that if I zero in on Tim, like he's the he's the one. He gets it. Yeah. That Yeah. That that gets it. But also like he's my he's my co- co-CEO. Yeah. And so like he's in this with me. He can't leave. He can't leave. He locked in here. There's nothing I can do. He's stuck. And that's why I think when you start dialing it back, why do you think it is that it's always Tim? M I think back too hard. I I think Tim is Tim. What are you gonna say? What are you going to say? What are you going to say? I just don't think Tim would fight back. I think Tim is just like, \"All right, cool.\" Like, no, I think the thing is that we need to account. Every man has a breaking point. Every man has a breaking point. Yeah. And there's going to be a moment where Tim breaks. I don't know if it's on content. I don't know if it's I",
            "start": 1129.6
        },
        {
            "text": "we need to account. Every man has a breaking point. Every man has a breaking point. Yeah. And there's going to be a moment where Tim breaks. I don't know if it's on content. I don't know if it's I don't think Tim's gonna break because what breaks I think that's my other thing is what breaks Tim I think because I can see I can maybe maybe a parade maybe a parade outside his house maybe something like that I don't think that breaks Tim because I think here's the thing right I when I look at Nick yeah Nick is a man that has a lot of self-respect and a lot of boundaries don't cross me is what I see when I see Nick Tim I Tim has self-respect of course right but like there's Tim I don't has those same level of like, you know, like, hey, don't let you know, don't disrespect my free time. Don't like I feel like if I showed up to maybe not me, if Greg showed up to Tim's house after hours and was just like, hey, what's up, Tim? And like, you know, [ __ ] around with him, I think Tim would be",
            "start": 1176.48
        },
        {
            "text": "like I feel like if I showed up to maybe not me, if Greg showed up to Tim's house after hours and was just like, hey, what's up, Tim? And like, you know, [ __ ] around with him, I think Tim would be okay with it for the most part as long as there's a grander purpose as long as it's leading towards something that's going to like, you know, go viral or help a business or whatever. But that's the best part about it is that granted it's I think it's hilarious and it's great content, but there's a little part of Greg doing this [ __ ] maybe more than a little maybe like 50% of it that I know that Greg is just doing this for himself. Yes, absolutely. He's literally just doing it to make himself laugh. Yeah. At his own joke. Yeah. And that's why when you start really pulling it like pulling apart the layers and like going deeper and deeper into the psyche of Greg, he I honestly think there's a little part of him that's like this whole world is just here for me and I live I'm the center of",
            "start": 1221.12
        },
        {
            "text": "the layers and like going deeper and deeper into the psyche of Greg, he I honestly think there's a little part of him that's like this whole world is just here for me and I live I'm the center of it. Yeah. And when I'm doing stuff, nobody else is real. Like we're all just AI and he's here to make himself happy. And if we make him happy too, great. But if not, we're just like play things for his amusement. Interesting. And Tim's trying to monetize that. And Tim just wants to Yeah. Yeah. Exactly. Just wants to pay his monthly bill. Let me pull some hypothetical scenarios. I like this. Greg in the safest way possible. Mhm. Kidnaps Tretto. Yes. In the safest way. In the safest way possible with G's permission. There's like a dog carer, you know, and then he kidnaps Torto for let's say 3 days. Oh my god. It's way too long. and like makes makes content out of it, turns into a vlog, right? And like leaves like Riddler notes in at Tim's house to be like, \"I have I have Tretto. This is how you",
            "start": 1262.0
        },
        {
            "text": "Oh my god. It's way too long. and like makes makes content out of it, turns into a vlog, right? And like leaves like Riddler notes in at Tim's house to be like, \"I have I have Tretto. This is how you get him back.\" Sort of thing. Do you think that'd be too far? They for Tim. Do you think Tim would be like, \"All right, this is where if Gia is in on it, then no.\" If Gia was not in on it, then yes. I feel like I feel like even if Gia is in on it, I feel like Tim's might Tim might be like, \"No, we can't do that. You can't I mean, dognapping might might be a bridge too far.\" Yeah, but I don't know. I don't know. I mean, what if he just It's the dog's happy, though. Maybe the Maybe that might hurt the most. If the dog's happier than ever, you can see the song. He's recording the entire time. He's like, \"Look, he's falling. He's smiling for the entire 3 days. He's not barking a lot. He's just enjoying his life. He's sleeping. He's has no anxiety. It's perfect.\" Scenario. Scenario number two,",
            "start": 1315.52
        },
        {
            "text": "like, \"Look, he's falling. He's smiling for the entire 3 days. He's not barking a lot. He's just enjoying his life. He's sleeping. He's has no anxiety. It's perfect.\" Scenario. Scenario number two, right? Uh Greg, of course, does like a lot of the uh interfacing with with publishers, developers, get interviews, and all this stuff, right? Greg gets in an a email an email from Nintendo and it's like hey we want kind of funny to interview Miiamoto about the next big Mario game and Greg says yes and as a bit Greg impersonates Tim doesn't tell Tim about the Miiamoto interview instead has Miiamoto fly down sits down with Miiamoto and Greg introduces himself as Tim Getty's dresses up as Tim and just does a full interview doing an impression as him doing an impression as This is burning content. This is just good ideas. It doesn't it doesn't tell anybody else. Like Greg does this. It's just Greg and Kevin that do this whole thing. Wait, that's just actually a great idea. This is a great idea.",
            "start": 1357.44
        },
        {
            "text": "is just good ideas. It doesn't it doesn't tell anybody else. Like Greg does this. It's just Greg and Kevin that do this whole thing. Wait, that's just actually a great idea. This is a great idea. And it allows it to go live and Tim learns by seeing kind of funny me like for the entire week. We got a really special interview coming up. Like it's a personal pet project. How much that piss off Tim? And do you think that's a line for cuz I think that I think Tim is also like you can't do that ever again. No, I think Tim would love that one. Actually, that's a that's a coin flip for me. That's a coin toss. Really? Yeah. Because I think there's Tim has an ego. He does. And I think Tim's reputation in the industry is very important to him. And I think that if you did anything like Miiamoto's like god tier, Tim, right? That's like that's like the goat of of games for him. Tim is a Nintendo boy through and through. the ability to sit down with that that person. I think he actually has",
            "start": 1407.28
        },
        {
            "text": "like god tier, Tim, right? That's like that's like the goat of of games for him. Tim is a Nintendo boy through and through. the ability to sit down with that that person. I think he actually has interviewed him before. So, I don't know how he would take that because I also imagine because there's a possibility that Mimoto's like, \"Oh, you're just like, how insulting is it a to the man that you would play joke on? He'd have to get on it and b so black bulb for Nintendo forever. Oh my god, forever. Forever. But B, you but if if you somehow pull the pull that over on Nintendo, how insulting is it to Tim that they know so little of him that they don't know who they can't tell the difference between him and Greg Bow? But also, how funny would it be? Plus, seeing the picture of Tim of Tim watching the thing live and we just see his face. Now we got to do it cuz now like I'm now I'm thinking of like the level of like are is it Greg as Tim or is it Greg as a caricature of Tim? Yes. Is it Greg",
            "start": 1453.84
        },
        {
            "text": "the thing live and we just see his face. Now we got to do it cuz now like I'm now I'm thinking of like the level of like are is it Greg as Tim or is it Greg as a caricature of Tim? Yes. Is it Greg wearing like a Pokemon outfit and like and like having like a Super Mario World uh like cartridge or like the um 3D all not 3D Super Mario Allstars jacket and blue contacts dude. Yeah. And being like hey can you sign this for me? Dyed hair like going all all the way in. He I don't think it would be that hard. Tim went well because Tim Tim went as uh Greg for a Halloween one year and it was eerily close to each other. I mean they actually have very similar body types now and like they're similar in height to each other. The wild card though is I think Greg could do Tim for 15 minutes, maybe 10 before he started laughing maniacally. He started dying and but there's no way that Tim could do Greg. I just don't think that he could ever do that. No, he couldn't. No. I mean, he'd have to We'd have",
            "start": 1497.8
        },
        {
            "text": "he started laughing maniacally. He started dying and but there's no way that Tim could do Greg. I just don't think that he could ever do that. No, he couldn't. No. I mean, he'd have to We'd have to go comb through the archives and figure out all the Greg sayings. If I'm lying, I'm dying. No. Uh, Grandma Miller be damned or whatever the [ __ ] else he used to say. But I just don't think Greg could pull it off. I don't think he's got the stuff. Candidly, Greg to pe an hour podcast. There's no way. That is a level of commitment that I don't Not that Greg are getting for an hour. You know what I We're going to be for 10 minutes. Yeah, it would have to be like a 10-minute interview. That's perfect. Yeah, I can only think I can trust Greg to play a character for an hour, but for 10 minutes. Let's dial this back because we're not going to get access to Mimoto. It's not going to happen. No. But we have access to any American game publisher pretty much. Like we could get anyone, right? With",
            "start": 1555.88
        },
        {
            "text": "dial this back because we're not going to get access to Mimoto. It's not going to happen. No. But we have access to any American game publisher pretty much. Like we could get anyone, right? With the rare exception of like maybe some of the super ultra ultra like we're not going to get any Rockstar guys or anything like that, but like we could we could easily get See, they they would all know Tim and Greg. That's the problem. Anyone who knows Greg Miamoto is the only person we can do it with. Miiamoto is the only person we can do with this or that would be hard enough to or maybe the Sonic creator who who was in jail that I don't think I don't think Tim idolizes that guy. That's the thing is like it has to be it has to be started idolizing him after you went to jail. Yeah. Like it it would have had to been been the developers. Yeah. Which like thank god we didn't go that direction. You got to get him in on it though. And the interview has to go south fast and it has to be like very",
            "start": 1596.32
        },
        {
            "text": "have had to been been the developers. Yeah. Which like thank god we didn't go that direction. You got to get him in on it though. And the interview has to go south fast and it has to be like very offensive both to both to the developer and just the Japanese just the Japanese culture. Sakurai would be great. Sakurai. Sakurai would be would be actually the guy. Sakurai would 100% be the guy. Yeah. Somebody else makes a good one. Tony Hawk. [ __ ] Tony. Yeah. But Tony the thing about Tony is that he doesn't give a [ __ ] who any of us are. No. So, I don't think the joke would be I don't think it would matter because Tony Hawk I I mean person I've interviewed the man. He's been in the public eye for so long that I don't think he ever I don't think he gives a [ __ ] who anyone is anymore and like he's not going to most mostly he's never going to know who Tim is. So, it doesn't matter. Whereas Tim has a shot of Miamoto like knowing him and like respecting him whereas Tonyy's just like",
            "start": 1634.24
        },
        {
            "text": "and like he's not going to most mostly he's never going to know who Tim is. So, it doesn't matter. Whereas Tim has a shot of Miamoto like knowing him and like respecting him whereas Tonyy's just like cashing checks and doing the next Tony Hawk pro skater or whatever the [ __ ] happenion. Yeah. Does do you think Tim will ever participate in the war of escalation? No, because Tim is I think Tim is ultimately a peacekeeper in this office. I think one of his main jobs is obviously leading a lot of the the initiatives from like a content strategy standpoint, but I think his secondary job and perhaps his most important job is keeping the peace between every single person that works at this company and making sure that everyone's happy and moving forward in a productive, happy, like positive way. Greg is an agent of chaos and I think there's a part of him and a part of me that sees Tim doing that. They we see the value in what that brings to the company and what that brings to enriching",
            "start": 1678.4
        },
        {
            "text": "way. Greg is an agent of chaos and I think there's a part of him and a part of me that sees Tim doing that. They we see the value in what that brings to the company and what that brings to enriching everyone's lives here and we just want to light it on fire. We want to burn him alive on fire. And I don't know why that is. I mean, it's the younger brother of it all, right? Like it's the younger like more successful brother. You know what I mean? Like he's got like I look at him and I'm like, you know, you got your life put together. You're you're tall. You're good-look. You got you're you're younger than me and and and and you're just such a nice human being. And I just that can't stand that I can't afford. That's what I'm saying. There has to be a moment where he breaks. Every man has a moment where, you know, once the damn breaks, there's no putting that water back in. Do we want that? I think there will be a war of escalation one day. I don't know when. I don't know when. What do",
            "start": 1724.16
        },
        {
            "text": "moment where, you know, once the damn breaks, there's no putting that water back in. Do we want that? I think there will be a war of escalation one day. I don't know when. I don't know when. What do you know? What do you know? I don't know anything. I just look at him. I just look at him and I just see a man that almost breaks multiple times. Well, now we have to [ __ ] Now we have to figure out where our allegiances lie. In the war against Tim and Greg. In the war between Tim and Greg. I'm sneaky on the kind of funny Civil War. Do we side with a good headline right there. Steve Rogers, who is Tim? Or do we side with Iron Man, who is Greg? I'm on Tim. Team Tim. I don't want to take sides. I have to. I'm already on the side. I think team Tim. It has to be team Tim because Greg too out there. You know what I mean? He's He plays his hands too much. Yeah, but Greg is scarier. Like I don't think But Tim is sneaky. He's a schemer. Yeah, but like does he have the stuff to take it to where",
            "start": 1763.92
        },
        {
            "text": "You know what I mean? He's He plays his hands too much. Yeah, but Greg is scarier. Like I don't think But Tim is sneaky. He's a schemer. Yeah, but like does he have the stuff to take it to where Greg would be willing to take it? No, I don't think so. I think he has the smarts. The thing about Tim is he's got the smarts to do it. But I think Tim is Tim is like like the American president in the sum of all fears. Stick with me on this one. Right. The American president in the sum of all fears. Tom Clancy book. Oh, okay. Yes. Where he's sitting there and he's trying to figure out what the Russian prime minister is going to do. Are we going to start shooting nukes at each other? But in the back of his brain, he's like, \"We I need to do something to deescalate this because if I let one nuke fly, the entire world is gone.\" Tim's never gonna let that nuke fly. And we know that. That's why he's always good to negotiate with. And when I say we, me and Greg are Russia in this particular",
            "start": 1807.84
        },
        {
            "text": "nuke fly, the entire world is gone.\" Tim's never gonna let that nuke fly. And we know that. That's why he's always good to negotiate with. And when I say we, me and Greg are Russia in this particular instance. We are willing to just nuke everything just cuz it's funny and cathartic. Yeah. But I don't think Tim will ever I don't think Tim takes it up at all. I think he continues to just go, \"That was funny. Monetize the content. That was funny. Monet.\" Because I think there also is a part of Tim that just knows that at some some some point in the future something will burn this entire business down and he's just staving that off for as long as possible. The thing is like Tim has played Last of Us too, right? Like he doesn't want that back and forth war that's never going to He wants to end the cycle of violence. He wants to end the cycle of violence. I think in the scenario where Greg interviews Miiamoto while impersonating Tim. Oh, a scenario by the way that we have completely made up",
            "start": 1851.04
        },
        {
            "text": "the cycle of violence. He wants to end the cycle of violence. I think in the scenario where Greg interviews Miiamoto while impersonating Tim. Oh, a scenario by the way that we have completely made up right now. What if I think in that in that scenario, Tim is like 95% more likely to be like, \"Hey, you went too far.\" As opposed to being like, \"I got to get you back for this.\" Cuz I think then it gets scary of like Tim How does he get back? If Tim Yeah. How does Tim get Greg back? And if Tim does, how far does Greg take it then? Because I think Greg then goes nuclear or whatever. That's the problem, right? Is Greg's the wild card. What's he going to do? What is he going to do? I like Is there because I guess on the flip side, right? Is there a way for Tim to go too far with Greg? No. I think the only Yes. Absolutely. Yes. Cuz Greg has boundaries. We just never test those boundaries. All right. I don't want to If we showed up at Greg's house at night, he would not be happy about that. He",
            "start": 1888.96
        },
        {
            "text": "the only Yes. Absolutely. Yes. Cuz Greg has boundaries. We just never test those boundaries. All right. I don't want to If we showed up at Greg's house at night, he would not be happy about that. He would not be happy about that. I think I have a solution to this, but I think we should save it for after the ad break because I have a solution to this whole problem. Let's take a break to hear from our sponsors. This episode is brought to you by Imperial. We've told you all how important it is to developers to wishlist games that you're interested in. So, if this sounds cool to you, make sure you wishlist it. Imperial is a complex, featurerich action RPG where you'll be sent to a planet in a far-off corner of the galaxy to explore an imposing monolith. As an elite mercenary, you'll join the expedition tasked with unearthing the secrets of the monolith and face off against the deadly automatons within. In Imperial, you'll explore four vastly different quadrants of the monolith. Accessible",
            "start": 1930.72
        },
        {
            "text": "tasked with unearthing the secrets of the monolith and face off against the deadly automatons within. In Imperial, you'll explore four vastly different quadrants of the monolith. Accessible only by using mysterious artifacts known as cardoggrams. Each cardoggram affects which enemies, boss fights, and loot will appear when you enter the monolith, so no two excursions will be the same. Find even more cardoggrams to explore by looting defeated enemies, or buy them from other players online at the trading post. Imperial features three weapon archetypes. The fast-paced acrobatic glaive, the defense focused mason shield, or the devastating cannon with a range of customizable skills and abilities that can make short work of the awaiting automatons. Your weapons and abilities can be changed before any excursion into a cardoggram. So, if a loadout isn't working for you, you can mix things up to create the perfect play style. Help the members of the expedition in deep branching quests and aid",
            "start": 1973.84
        },
        {
            "text": "any excursion into a cardoggram. So, if a loadout isn't working for you, you can mix things up to create the perfect play style. Help the members of the expedition in deep branching quests and aid other players in asynchronous multiplayer. Get ready mercenaries. The monolith awaits. Imperial is available May 8th on PC, Xbox Series X and PS5. Wishlist now. It helps so much. Wishlist Imperial. This episode is brought to you by Auraframes. If you haven't called your mom in a while, here is your reminder to do it. But then you want to go above and beyond. Mother's Day is coming up and I have the perfect gift idea. Aura Frames are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preload it with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special, they'll use it every day. Greg, Kevin, and a ton of people here at Kind of Funny",
            "start": 2015.6
        },
        {
            "text": "it with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special, they'll use it every day. Greg, Kevin, and a ton of people here at Kind of Funny are obsessed with their Aura frames. It takes about 2 minutes to set up a frame using the Aura app. So the next time you need to call your mom, you can also send her a new pick of you from that trip that you're telling her all about. Ara has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting oruraframes.com to get $35 off plus free shipping on their bestselling Carver Matt frame. That's a rare frames.com, promo code kind of funny. Support the show by mentioning us at checkout. Terms and conditions apply. The show is sponsored by BetterHelp. It's super great that mental health awareness is growing, but there's still progress to be made. 26% of Americans who participated in a recent survey say they have avoided seeking mental health support due to",
            "start": 2065.68
        },
        {
            "text": "great that mental health awareness is growing, but there's still progress to be made. 26% of Americans who participated in a recent survey say they have avoided seeking mental health support due to fear of judgment. We can do better. No reason for fear. BetterHelp has over 10 years of experience matching people with the right therapist from the diverse network of more than 30,000 licensed therapists with a wide range of specialties. Some of my best friends use BetterHelp and love how helpful it can be for learning positive coping skills and how to set boundaries. It empowers you to be the best version of yourself. It isn't just for those who've experienced major trauma. If you're thinking of starting therapy, give BetterHelp a try. It's entirely online, designed to be convenient, flexible, and suited to your schedule. We're all better with help. Visit betterhelp.com/kindfunn to get 10% off your first month. That's betterhelp hp.com/kindofunn betterhelp.com/kindafoney. And we're back.",
            "start": 2106.24
        },
        {
            "text": "and suited to your schedule. We're all better with help. Visit betterhelp.com/kindfunn to get 10% off your first month. That's betterhelp hp.com/kindofunn betterhelp.com/kindafoney. And we're back. Roger had a thing to pitch. What's your what's your pitch? Um I think the only way to do this is we can't have escal escalation on Tim's side. We can't have escalation on Greg's side. We need a third party. And I think that that means that Andy needs to needs to grow up and grow a set and actually do it. You need to win. He needs to win game showdown and [ __ ] actually shut these [ __ ] up. Okay. Well, now we're talking about the impossible. Come on. Okay. I didn't know we're talking about fantasies. I didn't know we're talking about fantasies. That's the only way. And Andy will never get involved. Andy's only ever, and this is a compliment. This is going to sound like a negative, but it's a compliment. He's only ever 90% in this office. He keeps a little back for himself at all times. And",
            "start": 2151.52
        },
        {
            "text": "Andy's only ever, and this is a compliment. This is going to sound like a negative, but it's a compliment. He's only ever 90% in this office. He keeps a little back for himself at all times. And that's smart because if he commits that 10% then he's in and then he's fair game for Greg. Yeah, we still text Andy all the time. Me and Greg, we're on the same thread. I texted him Sunday. Not Andy. I just text Greg on the thread because I enjoy having Andy see the back and forth. It's hilarious. He hates it. Yes. What are these conversations like, \"Hey, how you doing? How's your weekend?\" Do it right now. Hold on. Pull it up for real. Wait, I had no idea about this. being in a text thread with Nick and Greg just talking about each other. I'll block both of your numbers so Sunday 7:29 p.m. Greg, we need to normalize wearing zip-up hoodies with no shirt underneath. Greg replies, I want to wear my blue suit to mock Tim tomorrow, but in review next week, I'm in. Andy, you brave enough to",
            "start": 2200.4
        },
        {
            "text": "Greg, we need to normalize wearing zip-up hoodies with no shirt underneath. Greg replies, I want to wear my blue suit to mock Tim tomorrow, but in review next week, I'm in. Andy, you brave enough to three-way with us? Andy didn't respond. Does he ever respond to that thread? No. No, because he knows if he responds, it will just keep it going. The thread's going to go no matter what. The question is how much pain do you want along with the medicine? Yeah. And the more that you you respond in that thread, the deeper you are. Exactly. Then you're part of the [ __ ] and it becomes a whole thing. Exactly. I I do think he's the solution though. You think he's the solution? See, I would think Nick would be the solution. What am I going to do with this? I'm in. I love it. You want to be the solution out of all this. You want You need I think Nick is the closest to Greg as far as where he'll take it. I guess Greg might get a bit more extreme, but Nick will get funny. You know what I mean?",
            "start": 2250.0
        },
        {
            "text": "out of all this. You want You need I think Nick is the closest to Greg as far as where he'll take it. I guess Greg might get a bit more extreme, but Nick will get funny. You know what I mean? Yeah. Yes. Like Nick, I think will find like the goofiest [ __ ] possible to introduce to like this whole start sending footballs to people's houses. Yeah. I got that football [ __ ] I got him. I was waiting to I was like, \"He's going to figure this out.\" And like the third football that came, he just I just saw a text pop up and go, \"Haha, I get it.\" Just the [ __ ] receipt. I was like, \"I [ __ ] nailed the The thing though, the other thing is if you want more chaos, if you want to lean into the chaotic element, then you bring in Kevin as a third person.\" That's nuclear cuz Kevin will cross the linear. That's nuclear. No, that that is the nuclear bomb. Kevin Kevin will cross the line too hard and then nobody will want to play anymore. But that's what I'm saying. That's how you see. That's Tim.",
            "start": 2290.16
        },
        {
            "text": "That's nuclear. No, that that is the nuclear bomb. Kevin Kevin will cross the line too hard and then nobody will want to play anymore. But that's what I'm saying. That's how you see. That's Tim. Tim always knows he has the Kevin nuclear option if he needs to. Yeah, he'll bring Kevin and Kevin will put this [ __ ] Kaibos on all this [ __ ] right now. We're exploding it all. Yeah, he's going to explode it all right now. I have another thought. I used the time you guys were talking to not pay attention to you and think of something else because we're in the brainstorming phase. Tim used to Oh, no. You know how Tim used to like go do those fan films like Danny would like hire him to go be like the pink ranger or the yellow ranger? Like it'd be like him and then like some YouTubers and then like one dude from like a TV show 30 years ago. What if we orchestrated that again and we did a Nathan for you where we just conned Tim in believing he was in a fan film and we got her we got him to do",
            "start": 2329.12
        },
        {
            "text": "one dude from like a TV show 30 years ago. What if we orchestrated that again and we did a Nathan for you where we just conned Tim in believing he was in a fan film and we got her we got him to do crazier and crazier and crazier [ __ ] and then at the very very end of it Greg's just there. I love this. I mean it's a whole day of filming which No, I'm talking like 12 hours. Like it goes You see how far we can push him into the night of like, \"I'm sorry, Tim. We just need you for 10 more hours.\" 10 more. When you say crazier [ __ ] are you talking about like like fear factor type [ __ ] I'm talking like we need you to eat donkey dick or and like you to wear smaller and smaller outfits until he's like just wearing the borat borat thong. Yeah. Yeah. Just just push it. That's the breaking point. Like how much of Tim's body hair can we see before he goes like I'm not doing this anymore. Can we trick him into thinking it's a Mr. Beast thing from Carl? That's a great idea. Like, oh yeah, Mr.",
            "start": 2368.72
        },
        {
            "text": "Like how much of Tim's body hair can we see before he goes like I'm not doing this anymore. Can we trick him into thinking it's a Mr. Beast thing from Carl? That's a great idea. Like, oh yeah, Mr. Beast is not going to be here. We just need you to submit all these things. If you do all these things, Beast will come, you know. Oh, okay. Not see you. Okay, get your head out of the gutter. Yeah, Roger. Yeah, come on. There's something here, guys. I like that. I like that. I I It would have to I think start very subtle, like very minor inconveniences of like they said they will send an Uber and they didn't. So, like Tim, he's like, \"Oh, [ __ ] these guys. Whatever.\" Never been able to do it. Tim, I've never Tim I've se I've I've been through some crazy ass productions with Tim before and he has just hung in there. Tim has the ability to just put his head down and just get through the thing no matter what the thing is. Whether it's like hanging out with people I he just want to hang out",
            "start": 2410.64
        },
        {
            "text": "has just hung in there. Tim has the ability to just put his head down and just get through the thing no matter what the thing is. Whether it's like hanging out with people I he just want to hang out with or doing a production, whatever. He just goes, I don't want to be rude. Let's just keep doing this thing. Whereas I have a breaking point where I will just walk off of the set and be like, I don't [ __ ] want to do this [ __ ] anymore. It's not worth it for me. I do want to point out that C twigs 10 in the chat says, how come the top search for Tim is that he's leaving KF? This is exactly what we're talking about. This is what we're talking about. Yeah, this that may Greg orchestrated it so that people everywhere think that Tim is leaving. So I think that might might be the reason why I'm thinking this is going to be a breaking point, right? The amount of people that I have seen, professional people in the industry that have walked up to Tim and the first and only thing they say about",
            "start": 2449.2
        },
        {
            "text": "thinking this is going to be a breaking point, right? The amount of people that I have seen, professional people in the industry that have walked up to Tim and the first and only thing they say about kind of funny is, \"I heard you're leaving.\" Like, we saw it. We witnessed it. We witnessed it so much during the Nintendo event and it keeps on happening to him. So, I think that that's where the breaking point's going to happen. Just one person's going to come up and say, \"You're leaving kind of funny.\" And he's just going to [ __ ] break like, \"Fuck this. [ __ ] this. [ __ ] you.\" I think he will, man. I think I think it'll just continue to crush his soul more and more. I think if anything, real talk, I think if anything happens, it's just Tim's going to have a heart attack one day and just drop dead. Yeah. I think he's taking all this stress and just shoving it into his arteries. And something's just going to pop one day. Tim's just going to like his left eye is just going to b like",
            "start": 2481.12
        },
        {
            "text": "drop dead. Yeah. I think he's taking all this stress and just shoving it into his arteries. And something's just going to pop one day. Tim's just going to like his left eye is just going to b like his left eye bone. Stroked out. Yeah. Yeah, dude. Our pizza's here, by the way. The question is, is the camera on when that happens? And can we make content? Yeah. Can we make content out of it? Mike, can you get the pizza? Thank you. Mike's putting his Halo 3 hoodie on. his best halo for and he's doing it. All right, that was a good discussion. That was a good discussion. We have a few more minutes left. I do want to talk about the Met Gala. Yeah, I want to go through this. Did you guys check out any Met Gala? I saw Joey was looking at some of the fashion yesterday. She was telling me the theme of it which is interesting and so I did want to go through that real quick for the last like 10 15 minutes. Is it in the assets or did you send it to Kevin or anybody? I think did you send it to me?",
            "start": 2516.0
        },
        {
            "text": "of it which is interesting and so I did want to go through that real quick for the last like 10 15 minutes. Is it in the assets or did you send it to Kevin or anybody? I think did you send it to me? I sent it directly to you. No. Oh, my bad. I thought you said send it to me. What was the theme this year? I want to get this right before I start roasting some people. It was it was it was uh super fine tailoring black style. Yeah. So it was it was black in terms of like African-American like style like that type of deal. Okay. Did you see Lisa from I believe she was in Blackpink. Did you see her outfit? No. Kevin, can you type in Lisa? He's going to bring it up. He's got I literally just sent the Vanity Fair page with every We got to look through Lisa specifically because it is the most atrocious offensive thing that I've ever seen. Really, dude? Unbelievable [ __ ] that she did. It is like it is like a level of like I can't believe that anyone let this happen. Let's stop for a second.",
            "start": 2553.04
        },
        {
            "text": "offensive thing that I've ever seen. Really, dude? Unbelievable [ __ ] that she did. It is like it is like a level of like I can't believe that anyone let this happen. Let's stop for a second. So the theme is actually Say it one more time. So it's super fine tailoring black style, right? It's a basically to read the part of the first paragraph, right? Like the world is once again reminded of the indisputable role fashion has played in history as much of the evening's conversation centered around the cultural and historical examination of black style in relation to super fine tailoring black style. the Costume Institute's spring exhibition. Um, this just seems like a terrible idea for anyone who's not black to be a part of this. Oh, yeah. And I'm looking at Walton Gogggins up here and I'm just thinking to myself, that you're threading a line right now, Walton, with what you're wearing here. Like, he's basically dressed as a like, I don't know, a stereotypical pimp. What is he doing?",
            "start": 2595.76
        },
        {
            "text": "just thinking to myself, that you're threading a line right now, Walton, with what you're wearing here. Like, he's basically dressed as a like, I don't know, a stereotypical pimp. What is he doing? Oh, is it? So, it's it's well, here's thing. It's like a note to dandism, right? So jumping forward in a bit in the article, uh the exhibit which includes a collection of garments, accessories, paintings, photographs, decorative art, and more from the 18th century to the modern day presents visitors to the New York City landmark with a cultural and historical examination of black style that has dandism at its epicenter. Uh it opens goes on to talk about it. Real quick, I I don't have access to this cuz I'm not subscribed. Oh. Oh. Oh, I didn't think about that. That's a good point. You're subscribed to Vanity Fair. That's fire. Am I? I don't think so. Yeah, maybe you are. Maybe I should find out. It is partially inspired to do this. Let's Let's just Kevin, if you could just type in Lisa from",
            "start": 2637.68
        },
        {
            "text": "to Vanity Fair. That's fire. Am I? I don't think so. Yeah, maybe you are. Maybe I should find out. It is partially inspired to do this. Let's Let's just Kevin, if you could just type in Lisa from Blackpink Mech Galla because we just we need to talk about this specifically. Let's talk about this. We got to [ __ ] I saw this theme yesterday and I was and Joey was going through it. I was just like there's going to be some fallout from this. Yes. Right. Someone's going to take this too far and not understand the thing. For a little bit more content. It is partially inspired by slaves to fashion uh black dandism and the styling of black diasporic uh identity right so it's taking like essentially styles of the past um that were rooted in like older black culture slavery like multiple things and you know bringing it up right up kind of thing uh which risky depending on who you are that's what I'm saying what direction you go but it's evocative and that is interesting to me right and",
            "start": 2677.76
        },
        {
            "text": "and you know bringing it up right up kind of thing uh which risky depending on who you are that's what I'm saying what direction you go but it's evocative and that is interesting to me right and obviously when you when you brought this up and I heard the theme I was like we should have a conversation about this but just seeing Let's let's let's look it up as soon as Kevin gets the picture. Yeah, I'm I'm trying to find like there must be like a thread like a blue sky or Twitter thread that is all the looks. Yeah, Joey incredible. You know, a lot of people looked incredible. Sabrina Carpenter looked fantastic, too. What you saying, Kevin? Lisa. Lisa. Uh, just type in Lisa. Black Pink. I believe she's in Blackpink. I I typed in Matt Gala 2025. Lisa. Yeah, that that's perfect. Yes. Okay. So, if we could find a photo of her from like the front on uh keep on going down because uh Hold on. Hold on. This page is like Okay, there it is. Keep on going down. Let's see if we can find it. Okay, so",
            "start": 2718.56
        },
        {
            "text": "we could find a photo of her from like the front on uh keep on going down because uh Hold on. Hold on. This page is like Okay, there it is. Keep on going down. Let's see if we can find it. Okay, so maybe it's on there. Maybe it's on there. Maybe if we could keep on scrolling down actually a little bit more. Uh no, it's just the old stuff. I'm going to give you another link from Vogue. Yeah, so she had um she had a bunch of I believe um black uh women throughout history on her outfit. Um Okay. She had Rosa Park. Okay. No, don't say it. On her vagina. Oh. On her JJ. That's not That's not where I thought that was going. If you zoom in to her crotch area, which she is wearing just pretty much panties, it is Rosa Parks. Is that I mean, is there vagina? Is there any part of your body you can put Rosa Parks that's not kind of offensive? I thought you were going to say [ __ ] insane. Put it toward the back or something. You're not going to more if that's from the front or the back. It's It's",
            "start": 2760.56
        },
        {
            "text": "Rosa Parks that's not kind of offensive? I thought you were going to say [ __ ] insane. Put it toward the back or something. You're not going to more if that's from the front or the back. It's It's not a good image here. But like if you zoom in, it is absolutely Rosa Parks on the vagina. That's crazy. That is obscene. That's the kind of [ __ ] that I'm talking about where if I were a publicist, I'd be like, \"Maybe you sit this one out, guys. Maybe you sit this out.\" It's like at that point, just wear a regular like just whatever. Like regular regular dress. Just wear a dress. Wear the you know, whatever. That's crazy, man. Nuts. I want to see more. I want to see who else who else did it right and who did it. So Coleman Domingo always goes crazy. Coleman Domingo's got amazing style. Coleman Domingo is different. He just looks great no matter what. Oh yeah, this is it. This is a zoomed. Oh, so it's like their portraits. Yeah. Oh, yeah. But you thought it was a JPEG. No, I think I",
            "start": 2806.48
        },
        {
            "text": "Coleman Domingo is different. He just looks great no matter what. Oh yeah, this is it. This is a zoomed. Oh, so it's like their portraits. Yeah. Oh, yeah. But you thought it was a JPEG. No, I think I thought it was the names. Oh, that's even Oh, no. It's a picture, which is even worse. That's crazy. Oh my interesting. Kev, I dropped the Vogue page. Hopefully that worked. Let's take a look at this. Okay, Rihanna looking good. I mean, Rihanna always looks good. Praggers. Pers. Oh yeah, that is true. Yeah, for some reason I thought it was the same baby. I was like, damn. Oh my god. But yeah, look at Coleman Domingo. He's so gorgeous. I know. This is great audio content. Um, who is that? Hamilton. F1, right? Oh, was he an F1? Is he? I don't know. F1. Mike says F1. Got it. Um, we got Fel. Fel always looks good. God, I like the I like the boot cut. What's up with this hat? Do you Would you guys ever want to go to the Met Gala? Like, would you want to dress up for the meal? No. I mean, I",
            "start": 2847.28
        },
        {
            "text": "always looks good. God, I like the I like the boot cut. What's up with this hat? Do you Would you guys ever want to go to the Met Gala? Like, would you want to dress up for the meal? No. I mean, I This is my dream. [ __ ] no, dude. I hate I I'm not a fashion person. I don't like dressing up like this. And I just I something about like just the whole vibe of just like a bunch of celebrities come around and just jerk each other off and dress up and I I just hate this. I hate this. I don't know, man. Kevin, if you can scroll down to That's Emma Chamberlin. Can if you scroll down to where Tiana Taylor is. I think she's like one or two. This is her. Tiana Taylor looks [ __ ] And she had the do-rag underneath this. Incredible. Come on. She looks so good. Um I would love to go go to something like this. I don't know to get styled by like a professional fashion designer like partner up and be like oh she who's that canvas Louis Vuitton. I mean I will say this. Who is that right there? Is that",
            "start": 2894.48
        },
        {
            "text": "this. I don't know to get styled by like a professional fashion designer like partner up and be like oh she who's that canvas Louis Vuitton. I mean I will say this. Who is that right there? Is that H Haley Babber Justin Bieber. That's Kendall. That's Kendall incredible. I will say this. This is also look at Io Edberry man. Oh [ __ ] I didn't even see that. She looks great. This is arguably the most not I don't want to say conservative, but the most like dialed in theme I've seen the Met Gal in a long time cuz sometimes it's just like cakes and everyone dresses crazy and they look dumb and so none none of these people look dumb. They all look actually pretty incredible. Anna Winour. Yeah. I don't know. I I just for some reason like this just I mean everyone just kind of nailed it. I guess I want to see Walton. Everybody looks great except for Lisa. Come on. Yeah. What's What's the word with Walter Gogggins? Well, Wong Gogggins was Walton Gogggin. Sorry. We got to look. We got to look",
            "start": 2930.4
        },
        {
            "text": "I want to see Walton. Everybody looks great except for Lisa. Come on. Yeah. What's What's the word with Walter Gogggins? Well, Wong Gogggins was Walton Gogggin. Sorry. We got to look. We got to look at what he's wearing cuz you might have to control F cuz there's a a lot in here. Yeah, there a lot of people cuz he was in that top image and I was like this one might be one where you go if you see this out of context you might be like this is a little offensive. I got to go home. Yeah, I don't think it's loading unless I scroll down. Just keep scrolling. We'll find him. We'll find him. We'll find him. Scroll. Scroll. Scroll. You looking at Yeah, but it is cool to watch like the live stream and stuff. I L is really into it. So what do they do? Did you watch it? Is it a show? Do you know who's hosting it? Like they have multiple hosts from different places. Go back. I don't know. The one I was watching it had um it had Tiana um Tiana Taylor. Tiana Taylor almost said Trump. Was that Jenn I",
            "start": 2977.04
        },
        {
            "text": "hosting it? Like they have multiple hosts from different places. Go back. I don't know. The one I was watching it had um it had Tiana um Tiana Taylor. Tiana Taylor almost said Trump. Was that Jenn I almost [ __ ] up every time. It's not good. I was thinking about that earlier of like I've done that I've done that before like on not on since kind of funny but like by a previous podcast OKBR a lot. No, I I meant to say like the name of like an actress or a character and I accidentally said the name of a porn star and I felt so ashamed and now he just passed I'm like oh no that's not something to be ashamed about but like oh that you that you admitted to watching porn. Yeah. Something that no one knows. No one would ever do that. The dark ages when we couldn't talk about people are saying we should see Andre 3000 as well. Holly Berry [ __ ] Oh my gosh. How many people go to the makeup? Oh, hey. Is that Jane Smith? Who's that? Jaden Smith. I mean, lots. I think you have to be invited,",
            "start": 3018.32
        },
        {
            "text": "we should see Andre 3000 as well. Holly Berry [ __ ] Oh my gosh. How many people go to the makeup? Oh, hey. Is that Jane Smith? Who's that? Jaden Smith. I mean, lots. I think you have to be invited, right? You have to be invited. You have to be a famous celebrity. You have to You have to donate money. Donate money probably. Yeah, it's like it's a paytoplay thing. It's dumb. It's a paytoplay thing. Is that Sydney Sweenie? Go back up. Zoom in a little bit on enhance. I believe that is. Oh, is it? Oh, it is. Yeah. Wow. He looks great. And then after that, we got the city. We got the bear right there. The kid that a fast scroll of that city right there. Zoom in a little bit. Let's have a a conversation. Also, you see Doi. Have you already passed Doi? Do is she down there? I don't know. We got to zoom in a little bit. Whoa. Whoa. My god damn it. We broke OBS. We broke it. It's okay. We broke OBS. It's pizza time. It's pizza time, everybody. We'll check We'll take a look at Walton Gogggins",
            "start": 3062.08
        },
        {
            "text": "to zoom in a little bit. Whoa. Whoa. My god damn it. We broke OBS. We broke it. It's okay. We broke OBS. It's pizza time. It's pizza time, everybody. We'll check We'll take a look at Walton Gogggins offline and double check his outfit, but Oh, no. Wait. This is actually insane. Kevin's gone 300%. It's magnified everything. There we go. There we go. Let me just Let's just before we go, can you type in Google Walton Gogggins MetGala 2025? Yeah. I just want blessings perspective on what he's wearing. Only 15K to get in. That's a bargain right there. 15,000 to get in. I'd do that tomorrow. I crowdfund that tomorrow and you'll get in a day. 15,000. Nick's at the beta. It's already closed. Here's the thing. I would never pay 15,000 to go to a party for one night, but I'd think about it for the meal. I mean, if you got money like that, yeah, it's easy. I mean, that would be a sick party. But 15,000 is I mean, it's a networking thing, right? Like you're just you're in network. This is what",
            "start": 3105.76
        },
        {
            "text": "meal. I mean, if you got money like that, yeah, it's easy. I mean, that would be a sick party. But 15,000 is I mean, it's a networking thing, right? Like you're just you're in network. This is what Walton got. Okay. You think Do's going to give me a job? The network for What is he wearing? I don't know. What is the is I [ __ ] with Kevin? Is there a way I can see like the bottom part of it? Is this like a You can zoom in. Yeah, click on that. Are these pants? I think it's a skirt. Skirt. Like a skirt. It's cute. I like it inside out. Yeah, I don't know if I'm feeling this. Yeah, I don't Yeah, I don't think I don't like this. Mr. Hawkeness says, \"Would Greg pay $15,000 to get to the Met Gala as Tim?\" As Tim, that's a great question, ladies and gentlemen. And that's a question you're going to have to ask yourself as we round out this episode of the Kind of funny podcast. Thank you guys so much for joining us. Remember, if you guys are watching live right now, Pokemon happening after",
            "start": 3154.24
        },
        {
            "text": "to have to ask yourself as we round out this episode of the Kind of funny podcast. Thank you guys so much for joining us. Remember, if you guys are watching live right now, Pokemon happening after this. Stay tuned. We go back to Johto. We're going to take on Lugia. We're gonna try to beat the Elite 4. We're gonna have some fun, of course, with your support. If you guys can't watch right now, if you got to go back to work, you got other stuff to do, do that, will be posted uh later. But until next time, ladies and gentlemen, it has been our pleasure to serve you. Pizza time. [Music]",
            "start": 3193.44
        }
    ]
}