{
    "id": 14040,
    "video_id": "zYw5LEKgmhM",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Mike Howard",
        "Rich Lambert",
        "Matt Firor"
    ],
    "title": "What Was Cut from the Elder Scrolls Online? - A Kinda Funny Gamescast Limited Series",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page - https://store.steampowered.com/app/1377700/Empyreal/ \nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nThis episode is sponsored by BetterHelp — go to http://betterhelp.com/kindafunny to get 10% off your first month.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1746819216,
    "duration": 3786,
    "transcript_chunks": [
        {
            "text": "[Music] What's up everybody? Welcome to The Elder Scrolls Online podcast, episode three, a kind of funny Games cast limited series. I'm one of your hosts, Greg Miller, alongside the master of hype in no joke, no lie, no nothing, no cap, my favorite one of your little Zeba hoodies, Snowike Mike. Uh, thank you, Greg. You always make me smile. And I want you to know that this is a medium and I'm an extra large. How does this work? I don't know, but we're making it work. I mean, it look I mean, is it do you feel comfortable in it? I feel very comfortable. Now, the guy behind the counter definitely looked at me and was like, \"This is a medium.\" And I said, \"Well, it fit. It fit.\" And I walked away. Rich Lambert, game director on The Elder Scrolls Online. Is he pulling off the medium? He is. Thank you. Looking good. Our guests are saying that. That makes me feel good. Matt Fyroy, you're back one more time. Of course. Here we are. What do you think? What do you think? Um I'm I'm a big",
            "start": 8.76
        },
        {
            "text": "is. Thank you. Looking good. Our guests are saying that. That makes me feel good. Matt Fyroy, you're back one more time. Of course. Here we are. What do you think? What do you think? Um I'm I'm a big Carheart fan. Yeah. All right. And they're cut very generously. There we go. Work where it's in right now. Generous cut. Studio director Zenamax online. He's right there for you. Yeah. Right there for you. Uh welcome back everybody to episode three of our four-part series. Yes, that's right. The end is in sight, gentlemen. We'll let you go home to your family soon. You'll be able to stop talking about this game you've been working on for 10 years. Launched. Can't stop. Won't stop. Can't stop. Won't stop. But this is your life. This is it. Yeah. I guess you know what? Even before we get into any the rigma roll, where we been? Rich, is this the last game you'll ever work on? Do you think you work on this until for just And this is like by the time this all wraps up. I truthfully going into",
            "start": 61.44
        },
        {
            "text": "the rigma roll, where we been? Rich, is this the last game you'll ever work on? Do you think you work on this until for just And this is like by the time this all wraps up. I truthfully going into it, I didn't know we were going to be working on this for 17 18 years. So, who knows where the future goes? Yeah. Okay. Bad answer. Matt, what about you? Is this the last? You've already retired once. You already tried to get out once. They pulled you back in. I I I've launched two games since 2001. So, uh Right. And when you're in this in the live service game, you know, when when you do that, it's you're in it for the long haul, right? Because it's uh you go where the community takes you and you think it's going to take you forever. Is this it? You think you do this? I mean, I guess how do you guys tackle that when you think about your own personal career? You forget you're on the ESO show. Your personal careers, right? Like is there always something happening with ESO? So it feels like a",
            "start": 101.92
        },
        {
            "text": "guys tackle that when you think about your own personal career? You forget you're on the ESO show. Your personal careers, right? Like is there always something happening with ESO? So it feels like a new adventure cuz this is something we talk about a lot where it's like, oh well, you know, Sony Santa Monica, they didn't want to do three God of War games because they didn't want to work on this for 30 years or whatever. Like how do you tackle that and keep your team motivated? I mean, it's a privilege to work on this game. I mean, it's it's a this is not this is a a force of nature, right? But the there is a reason why my title is studio director and his is game director. Ah, you have more you can you can freely move about the cabin whenever you want to. Yeah, I appreciate that. Okay. Well, everyone, if you want to hear more about The Elder Scrolls Online, guess what? You're in the right place because this is the Elder Scrolls Online podcast, a Kind of funny games cast limited series.",
            "start": 142.08
        },
        {
            "text": "everyone, if you want to hear more about The Elder Scrolls Online, guess what? You're in the right place because this is the Elder Scrolls Online podcast, a Kind of funny games cast limited series. No matter where you're getting it right now, whether it's over on the Elder Scrolls Online channels, whether it's on the Kind of funny channels, please like, subscribe, share so we can do more stuff like this, and of course, get you involved in the conversation as we build to the next big update for ESO as we move into these crazy seasons. We got the worms. It's all happening. But we're not even talking about that. Of course, last episode we touched about on about the early days, right, of what was happening with launch, then of course the console stuff, and then we started tiptoeing around one Tamriel. We're going to talk about the secrets of Tamriel today. All right. Well, I want to get into this. This is something we talked a little bit about, but again because it's so great to have",
            "start": 184.4
        },
        {
            "text": "one Tamriel. We're going to talk about the secrets of Tamriel today. All right. Well, I want to get into this. This is something we talked a little bit about, but again because it's so great to have these episodes where we can come back to stuff. You talked about sitting down with Todd Howard. Okay, this is their game. Oh, this is this great spot where, you know, nobody really knows the historical record of what was happening. Have fun with that. I need to know what we're talking about when we say, \"Hey, let's make a new entry into the Elder Scrolls universe. Make it online multiplayer. Do all these different things.\" How do you tackle that from a story perspective? That's a really good question. I mean, it really starts in the location. Where are we going? What are we doing? When is it? when is it? And as that starts to to materialize and starts to gel, then you start digging into, okay, well, in this particular province, Hierrock, right, or orinium or well, I guess Orsenium was",
            "start": 219.76
        },
        {
            "text": "it? when is it? And as that starts to to materialize and starts to gel, then you start digging into, okay, well, in this particular province, Hierrock, right, or orinium or well, I guess Orsenium was postaunch, but um you start digging into those like what are the people doing there? What are the stories? What are those thing? And they just start coming together. So my question would be, and I you pro tip there, like I asked question, I didn't direct. I wanted to see who would bite first. Right. Okay. Now I I'll go to you, Matt, because of course you get called in the ballroom here, right? You get called in this meeting room and they're like, \"Hey, come out of retirement. Come do this for us.\" Like, \"Can I default it?\" They say, \"No, you can't.\" You're like, \"Okay.\" Even when you say, \"Okay, we're going to do this. We're going to pick this time period where there isn't much known about what happened.\" Does that mean that you then go home and replay all the Elder Scroll games that you",
            "start": 265.76
        },
        {
            "text": "we're going to do this. We're going to pick this time period where there isn't much known about what happened.\" Does that mean that you then go home and replay all the Elder Scroll games that you start and while you do it, you're taking copious notes or is there a giant Bible that's being handed over from Bethesda? Like, where are we at? How does that happen? So, it really starts with you sit down and uh none of us use this terminology then because it's more modern than 2007. But what we really do is we set up what I call the virtual world. Like what do you want players to do in this game? Don't worry about the IP yet, right? What do you what's what's happening? Like uh and and like I said in the previous episode or two episodes ago, um like we knew we wanted a strong PVP system. we knew we want which if you if you go down that road it starts asking a lot of questions like who's fighting in this PvP system. Um I'm a historically a strong fan of three-sided PvP because we did that in",
            "start": 306.72
        },
        {
            "text": "we want which if you if you go down that road it starts asking a lot of questions like who's fighting in this PvP system. Um I'm a historically a strong fan of three-sided PvP because we did that in Dark Age Camelot and it worked really well there because in a 50/50 game the one with 51% of the power always wins, right? In a three-sided it it can go on forever. And so we were committed to that. But that asked a lot of questions. Who are the three sides? And then that asks the questions, all right, there's nine provinces. Well, there's 10, but what's happening with the right? And then the question start, well, who would be allied together? What are they fighting over? And then you're like, Siridil's in the middle of the map. Oh, Oblivion just came out. We don't want to really go to Siridil because that's where Oblivion just was. So, let's make that the PVP zone. What's in the middle of Siridil? The Imperial in the Imperial City with the Ruby Throne. Okay, we're going to have a PvP",
            "start": 351.12
        },
        {
            "text": "because that's where Oblivion just was. So, let's make that the PVP zone. What's in the middle of Siridil? The Imperial in the Imperial City with the Ruby Throne. Okay, we're going to have a PvP system where you fight other alliances to become emperor and sit on the ruby throne, right? Those are the kind that's the way the conversation usually goes. Um, and then it's like, okay, now we know that there's these three alliances fighting over the throne. What does each alliance do? Right? And Rich, I think, came up with the names, which is like the pact, the alliance, right, and the Dominion. And the names of those are very evocative of what they are. The right the pact is like three groups of uh provinces that aren't usually allied with each other but they're in it together because it they have to. The alliance is like uh we're a union of equals and then right and then the dominion is like okay you're here whether you want to be and if you look at the stories for each of those alliances",
            "start": 393.12
        },
        {
            "text": "to. The alliance is like uh we're a union of equals and then right and then the dominion is like okay you're here whether you want to be and if you look at the stories for each of those alliances which we launched with right th those themes go throughout those. So you have to set up the foundation for the world and a lot of these questions start to the more that you answer the more other questions get answered when they come up. Gotcha. Yeah. Rich for you come coming up with these names. Yeah. Like is this just you guys back in your house on a holiday break with a ball like a tennis ball bouncing off the wall. What about this one? This is in the basement at Bethesda which is where BGS was at the time on on whiteboards. Yeah. In the loading docks. Yeah. I mean a lot of it is just throwing ideas out onto a whiteboard and seeing what sticks. Um, but you have to have those foundational pillars that you're starting to build stuff off of. And you just start you just start going one block at",
            "start": 436.56
        },
        {
            "text": "out onto a whiteboard and seeing what sticks. Um, but you have to have those foundational pillars that you're starting to build stuff off of. And you just start you just start going one block at a time, building, building, building, and then something catastrophic happens and you have to solve that problem. And that's that's gamedev, right? And you just keep going until you're done shipping and then keep going and going and going and going and going and going and going. But to get there, you have to build a series of boxes, right, that you contain the story and the developers and the narrative into because it can't be wide open, right? You have to be like, okay, this story is going to be about this and right, you're working in the IP at this time, so you're going to have some limitations about that. So, it's not like blue sky, do whatever you want when it comes to the storytelling. It's more like you're telling the story of the Dominion. What are they dominating? Right? How how how",
            "start": 481.44
        },
        {
            "text": "about that. So, it's not like blue sky, do whatever you want when it comes to the storytelling. It's more like you're telling the story of the Dominion. What are they dominating? Right? How how how does that work? Um, and I don't actually know who came up with the Mullig Ball stole my soul uh uh main main story, but that's how it was pitched. Literally, Mullig Ball has stolen my soul and I want to get it back. That was literally the tagline for for the main story. Um, and so, right, and then it's like, okay, that that's what we knew about the story when it started. Nothing else except Muller Ball's stolen my soul and I want it back. Yeah. And then uh was it was Lawrence did a lot of a lot of that. winded a lot of that stuff for for bringing back Man of Marco and they're like, \"Oh, man of Marco, right? Here is a necromancer who could work with Mullig Ball, right? And he comes from um going really deep into the geekery of Elder Scrolls. This is what it's all about. Four-part show to get",
            "start": 521.6
        },
        {
            "text": "right? Here is a necromancer who could work with Mullig Ball, right? And he comes from um going really deep into the geekery of Elder Scrolls. This is what it's all about. Four-part show to get as geeky as you want.\" But but but Manamarco is is like the uber lich in the Elder Scrolls universe. He's he's lived for almost forever and he pops up in various Elder Scrolls games doing various nefarious things, but he's always the head of the warm cold. Um, and the seasons coming up is called seasons of the worm cult. So, um, but it's uh, right, it's like so we have a we have a villain now. We have Moolik Ball who's a Drich Prince. And, uh, again, our frame of reference at the time was Merun Deon stomping the Imperial City flat at the end of Oblivion. So, that that concept was fresh in our mind. And if you played that part of ESO where you get to meet Moolik Ball, right, uh, I'm not going to spoil it too much, but there's a scene very similar to that except he's stomping you flat. And uh and",
            "start": 560.96
        },
        {
            "text": "And if you played that part of ESO where you get to meet Moolik Ball, right, uh, I'm not going to spoil it too much, but there's a scene very similar to that except he's stomping you flat. And uh and so that was very much done in an homage to Oblivion. Sure. Uh at the time, but um anyway, I I I digress. So you have you you have Mana Marco, you have Evil, you have Moolik Ball, you're getting your soul back, and then it's creating great characters, and that's what the characters just start to organically happen, right? Like, and going into that stuff, I think a really good example would be Cadwell. Like Cadwell wasn't actually part of the main story when we originally pitched it. You know, Cadwell was written specifically for John Cles once we realized we could actually get him. Yeah. And the team went off. They went and did their thing. They introduced this new character. Right. We got all the time in the world. We got all the time in the world. So, pull I want to put a full stop on",
            "start": 605.68
        },
        {
            "text": "the team went off. They went and did their thing. They introduced this new character. Right. We got all the time in the world. We got all the time in the world. So, pull I want to put a full stop on that. How do you realize, oh, we could get John Cle? Like, what is that? Did somebody know him and casually mention it or That's a good qu. I don't know how we got him. Yeah. Um I I mentioned it in in the earlier episodes, but um Zenamax obviously pre Xbox had a board of directors that was full of Hollywood people and so Hollywood insiders and uh so we had lots of connections and even um the past Bethesda games had major major voice talent and uh and that's the reason it's cuz we they knew those people and so uh it was uh we were given a pretty good budget because it always makes great headlines when you say that you're working with Malcolm McDow and Kate Beck and Sale and and John Cles and uh Alfred Molina and uh Michael Gam, Bill Na, right? These are all like all like super super super",
            "start": 647.92
        },
        {
            "text": "when you say that you're working with Malcolm McDow and Kate Beck and Sale and and John Cles and uh Alfred Molina and uh Michael Gam, Bill Na, right? These are all like all like super super super good actors and uh and not only did they help raise the profile of VSO, but they're really really good. Like when you interact with them in game, they know what they're doing. Like 100% even as a noob, right? I mean, when John Cle pops out, oh my god, this is awesome. Yeah. Yeah. And he's believable in that character, right? And it's because our writers, which we'll I'm sure we'll get into, our writers are amazing in ESO and know how to write a character that could take advantage of John Cleas's unique personality. So, you you've laid out so much on the table for me and I like that. I appreciate that. Thank you. You say when you're sitting there, you know, well, forget the world and the IP. What is this game? You know, you want the strong PVP foundation. What are the other boxes that you put",
            "start": 693.92
        },
        {
            "text": "that. Thank you. You say when you're sitting there, you know, well, forget the world and the IP. What is this game? You know, you want the strong PVP foundation. What are the other boxes that you put up on that whiteboard to really start building out what the original ESO is? I mean, there were there were so many different ones and some of them actually got cut. Like housing was an original plan. Many of them got cut. Yeah. Um but we just didn't have time to do it. We couldn't, you know, do it the way we wanted to. Um but we we started going down the well, what is a Elder Scrolls player want? Well, they want the single player story stuff. Okay, we got got that pillar. What do MMO players want? Well, they want group activities, so that's probably where dungeons come in. That's where trials come in. Um the veteran content type stuff comes in. Um and we just slowly keep call building out those pillars until you get to a point where you're like okay we have enough or we have too much we",
            "start": 735.12
        },
        {
            "text": "come in. Um the veteran content type stuff comes in. Um and we just slowly keep call building out those pillars until you get to a point where you're like okay we have enough or we have too much we have to scale back and then that comes to Yes. That happens in every game of course. Yeah. And what's the you know it's something like right like any game you play is like 60% at best of what the vision was when it got started. Right. Yeah. because you really find the fun once you start playing it and then you realize what's necessary and what's not and then you realize what you literally can't do because of technology and you pair that back and then we don't have all the time in the world or budget so you pair it back a little more and that's where you end up when you and I'll start with you Rich but when you think back to this whiteboard and you think about everything on there do you laugh to yourself like that like you were that ambitious or that's what you thought the game would be?",
            "start": 776.16
        },
        {
            "text": "Rich but when you think back to this whiteboard and you think about everything on there do you laugh to yourself like that like you were that ambitious or that's what you thought the game would be? Yeah. I mean, it's one of those things where wouldn't it be cool? Like that stuff goes up on the board. Yeah. Right. It's oh, it would be cool if we did this. Oh, it would be cool if we did that. And then you take a step back and you look at that board and you're like, that's going to take us 30 years. Like, how can we do all this? And so then you have to go through this triage process, figure out what's the most important, um, and then start building on it. And there there are things, like I said earlier, there are things that we wanted to do for launch that we just couldn't get to. and we eventually did put in the game. Talk to me about the things that you couldn't do. I figure you sit down, you make the boxes, we make the pillars, we're building block by block, and then you start in on a",
            "start": 815.44
        },
        {
            "text": "did put in the game. Talk to me about the things that you couldn't do. I figure you sit down, you make the boxes, we make the pillars, we're building block by block, and then you start in on a story. Is there a meeting with Bethesda Game Studios where you're like, we want to go XY and you're like, not a chance. You can't do that. Like, were there sacred cows this way? Yeah, those were laid out mostly before just like, hey, you're going to again boxes, you know, here's here's where you are. You stay inside here. You can do basically whatever you want. you want to get outside of that, come talk to us. So, dragons, right? Dragons were verboten because Skyrim had just launched and right and was still going strong and it was no dragons, right? Yeah. And eventually we're like, we're getting to the point in ESO's development where we want to introduce some cool new system. We're like, we need to do dragons. And they're like, okay, it's been long enough and that's why there are dragons in",
            "start": 853.28
        },
        {
            "text": "to the point in ESO's development where we want to introduce some cool new system. We're like, we need to do dragons. And they're like, okay, it's been long enough and that's why there are dragons in elsewhere. Gotcha. And then with we had to come up with a reason why dragons existed in this place that nobody knew about. And and that was that was part of the fun of, you know, the the negotiations, I guess, in all of that, which was, okay, dragons aren't generally in the second era. Why were they there? Uh, and how to train your dragons was the the thing that popped into my head. It was like, well, they just got released out of a vault. We could make something up. And apparently, they were hiding in a cave for a very long time. Who would have thought? They were they were locked away in a in a in a cave in a vault, and you accidentally set them free, and now you got to go fix your mistake, right? And yeah, it was really cool. So, the other thing I would say that's interesting for me",
            "start": 892.88
        },
        {
            "text": "a in a in a cave in a vault, and you accidentally set them free, and now you got to go fix your mistake, right? And yeah, it was really cool. So, the other thing I would say that's interesting for me talking about this, you're like, \"Okay, we can't start the game where Oblivion takes place because we were just there.\" So, then how do you key in on other spots? And then is it again or I I can't even fathom like I'm a big Superman fan, right? But if you were to say, \"All right, cool. Take the current run of Superman and build it.\" I'd be like, \"Well, I got to go. It's going to take me three years to read everything to know.\" How do you get your head wrapped around what this place that you would know that you've seen on a map would look like? and it was in this letter that they said like what I don't understand how that works at all. I I mean it's it's just again it kind of goes back to the you just start going and you just start you start building. You put something down on a whiteboard",
            "start": 926.72
        },
        {
            "text": "I don't understand how that works at all. I I mean it's it's just again it kind of goes back to the you just start going and you just start you start building. You put something down on a whiteboard and then that starts the conversations and you just you take your steps because it is overwhelming. Elder Scrolls is 30 years old 1994. Um, and generally Bethesda game studios always focused on a single province and did like that super deep dive on the on the province. Um, and really Arena was the only game that had them all together. And so being able to dig through some arena stuff through lore books and all that other pick and choose the the really interesting bits and that was something that the team really enjoyed like Rancers War was a really good example of that, right? digging through and that was just a lore book and we turned that into like an entire series of stories in in Rivenspire. Incredible. Yeah. What was it like creating hubs? Right. We always talk about these big hubs,",
            "start": 963.28
        },
        {
            "text": "and that was just a lore book and we turned that into like an entire series of stories in in Rivenspire. Incredible. Yeah. What was it like creating hubs? Right. We always talk about these big hubs, these center areas that everyone meets at. What is that like for your team of what were the fun ones? What were the challenging ones? What are the ones that don't get enough love? What are some that never were to be? So, so I'm gonna mangle this answer a little bit because I know I'll get called out by someone who watches it, but uh uh I think I believe it was EverQuest made an amphitheater and it was where players were supposed to going to get together and and do performances and everyone was going to go to the amphitheater and of course after launch nobody went to the amphitheater, right? everybody was in South Row like like fighting uh dorm right in between the comments and and so that's the beauty of these games is it it's hard to script what people are going to do when you get into",
            "start": 1011.92
        },
        {
            "text": "everybody was in South Row like like fighting uh dorm right in between the comments and and so that's the beauty of these games is it it's hard to script what people are going to do when you get into the game. So we tried not to do that. We just tried to make a great fantasy world and build you know Daggerfall has to look like a a medieval you know English place and what Black Marsh has to look like a swamp that lizard people would live in right and we just leaned into that and then players made it what they want and of course it turned into they did all that around every waist shrine in the game in the major cities but right and but that but we let them do it we didn't try to lead it you know into into a conclusion. Yeah we focused really heavily on the services side of things making sure that there was a location somewhere in a zone where they got the things the vendors the you know all of the crafting stations like all that that was the the focus. Um, and then yeah, like Matt said,",
            "start": 1054.4
        },
        {
            "text": "that there was a location somewhere in a zone where they got the things the vendors the you know all of the crafting stations like all that that was the the focus. Um, and then yeah, like Matt said, let players figure it out. And when it came to like biggest problems, biggest challenges, it was what happens if everybody decides this is the hub, this is the city, and that's where they go. And we have a few of those. Rocka was one of them, right? Where that was the the top end. Is that how you pronounce it? That's how I pronounce it, but I also say archinist. You say that's the classic rocka. Rocka. Um, but yeah. So, it's right. It's it's just kind of a guess. Yeah, best guess. And and and who knew that players would end up our number one uh place where players get together is in the middle of the desert uh in right in in Hammerfell cuz that's it's a very uh it's like 3% um better more efficient leveling there. So because they figured out where the dark anchors fall and how the way",
            "start": 1101.68
        },
        {
            "text": "of the desert uh in right in in Hammerfell cuz that's it's a very uh it's like 3% um better more efficient leveling there. So because they figured out where the dark anchors fall and how the way shrines are closer to the dark anchors in that zone than anyone else. And they there's this literally this train of of I don't know hundreds of players that run through that zone 24/7, right? And it's like you think Müller Ball would stop invading that zone because uh it's it's literally falls in. It's an immediate blood bath and then they run onto the next one. But yeah, and we didn't design that. That's just players found it. Yeah. And I think the other other big part in that too was access to guild traders. Yeah. Like they were literally right right next to the waist shrines. So people could just waste shrine in, take two steps. The guild traders were there, they get their stuff, and then they get out. So yeah, it's it's interesting. I know. I I I said I would let you go, but a question I",
            "start": 1146.72
        },
        {
            "text": "waste shrine in, take two steps. The guild traders were there, they get their stuff, and then they get out. So yeah, it's it's interesting. I know. I I I said I would let you go, but a question I have here is like, is that loss of control not maddening for you? It's awesome. Yeah. It's it's the same design as like uh universities a lot of time if they're redoing a a quad or or a field or something, they don't actually put in the paths first. They wait and see where people walk and then and then they pay them, right? That's kind of what we do. Interesting. Yeah, cuz like it's, you know, something we talked about in the previous episodes. We're going to talk about the community going forward since then, you know, this big update you guys are here to talk about is all about that. But it's that idea for me of like you all exist in such a interesting and special place which I know you know but you know we talk every day on games daily about these games that are this happens they're",
            "start": 1191.84
        },
        {
            "text": "it's that idea for me of like you all exist in such a interesting and special place which I know you know but you know we talk every day on games daily about these games that are this happens they're starting up they're doing the thing they're out they failed they didn't that first week dead no not enough people showed up they're pulling the plug yada yada there's a million games that lime the streets as corpses like this right but for you guys to be able to come out struggle like we talked about but find the what you need then get iterate, change, go, evolve with this and get to this point. Like, it's just such a special thing that I don't know, and I I guess I shouldn't even hypothesize. Do you think, Matt, and I'm coming to you, Rich, do you think that that's something that can still exist in 2025, that games can launch like this and be like, \"Hey, it ain't going to be perfect because you need to help us make it perfect.\" M No Man's Sky, Valheim, uh those games exist very much and",
            "start": 1234.24
        },
        {
            "text": "in 2025, that games can launch like this and be like, \"Hey, it ain't going to be perfect because you need to help us make it perfect.\" M No Man's Sky, Valheim, uh those games exist very much and they become better if if the developer sticks with it through the criticism stage. Sure. Right. Sure. Sure. And so it all depends what your goals are when you launch, right? If your goal is to launch a completely finished game that's uh you know that's going to have 5 million active players and Right. That's probably not going to happen. Yeah. Um on the people at the top who usually need to understand that on that level. But um it's very it's always good to build the foundation and build the world and test it a little bit. Like Valheim was perfect for that, right? The first version Hades. I mean, you could there's many of these games, right? That that that do it in a way that um failure is not catastrophic, right? Because it's built into the plan. I love that. Okay, Rich, that was pretty well",
            "start": 1275.84
        },
        {
            "text": "you could there's many of these games, right? That that that do it in a way that um failure is not catastrophic, right? Because it's built into the plan. I love that. Okay, Rich, that was pretty well said. Maybe you're off the hook. I I mean, he he's right. I I think we were also in the very fortunate position that Robert Yeah. believed in us, believed in the IP um and didn't quit. Like he didn't quit on us. Yeah. Um he forced us not to quit. Right. Exactly. Um and that was a that was a big thing. Like there's not a lot of companies around that have that kind of foresight and and leadership. So, yeah, there was literally a meeting uh after launch um with just a few of us, me and uh and and and Robert and and some of the higher-ups at um at Zenamax. And basically, it was like, \"All right, didn't go the way you planned, right?\" Yeah. Now, what are you going to do? Yeah. And that was literally the and and the subtext was very clear, which is don't wallow in misery and uh you know, and",
            "start": 1321.12
        },
        {
            "text": "didn't go the way you planned, right?\" Yeah. Now, what are you going to do? Yeah. And that was literally the and and the subtext was very clear, which is don't wallow in misery and uh you know, and and uh get fixated on, you know, comments on YouTube, right? just tell me how you're going to fix it and uh you know what's the plan to go forward and uh cuz we did have a lot of players and he was very very uh Robert was very very aware of this cadre of players that was smaller than we thought but who was playing every day and that that's that was the argument that always won and so he gave us the the runway to do that couple episodes I I want to get back I want you go but I do want to talk about it we keep occasionally in this story coming back to Robert Aldman I and I mentioned of course the late great was he special? Uh, it seems like everybody who ever talks about him in relation to this, can you explain to a listener or viewer who doesn't know who he is, what what his role was, why he",
            "start": 1371.92
        },
        {
            "text": "late great was he special? Uh, it seems like everybody who ever talks about him in relation to this, can you explain to a listener or viewer who doesn't know who he is, what what his role was, why he was so special? So, he he, you know, he was uh um he was the founder of Zenamax Media. Um, and he had a great You start grinning because you're like, \"All right, here comes the diagram tree.\" So, uh, he was a Washington DC lawyer, banker, right? Worked worked with Clark Clifford who was one of the adviserss to presidents and I think a secretary of defense in the back in the day. And so he was a connected guy in DC. And so in 1999 he started Zenamax to be a media holding company where they would buy different companies. And it was 1998 it was you know do era and so they bought a lot of companies including this this little startup called Bethesda Softworks which had been around for 15 years. Sure. Then the do bubble burst and they were basically left with Bethesda which is why there's only",
            "start": 1413.52
        },
        {
            "text": "including this this little startup called Bethesda Softworks which had been around for 15 years. Sure. Then the do bubble burst and they were basically left with Bethesda which is why there's only been Zenamax and Bethesda. There were other companies in in the umbrella for a brief shining moment before uh Rich and I were there, but it basically turned into we're going to be the management company for Bethesda. So, Robert was not a game guy. He was a business slash human guy, right? And uh so he very much looked to people to solve problems and he mentored people to become the people that would be able to make big decisions and and be the people that would that would bring the company forward. And so if you know anything about Bethesda throughout the years, very strong personalities, right? Very firm uh vision on what what we do and how we do it. And that almost universally came from Robert. It was like, \"Tell me what you're going to do and do it.\" Right. And don't don't don't squirm",
            "start": 1461.28
        },
        {
            "text": "Very firm uh vision on what what we do and how we do it. And that almost universally came from Robert. It was like, \"Tell me what you're going to do and do it.\" Right. And don't don't don't squirm around. I don't want to hear, you know. He did not like puffery. Yeah. Yeah. He he could tell if you were bullshitting. And but but he wouldn't be he wouldn't be mean about it. He would be like, \"Just collect yourself for a minute. Tell me what you're actually trying to say.\" Right. I don't tell me the bad stuff. If I don't know the bad stuff, I can't help you. Right? And of course, we always tried to hide the bad stuff. And but but it was uh it was near impossible because he was really really good at just understanding problems and then helping you figure out how to solve them. Even if he didn't know the answer, he knew the process that it would take to get there. Yeah. His his to me his superpower was he made you feel like you were always heard. It didn't matter what level you were or",
            "start": 1506.96
        },
        {
            "text": "know the answer, he knew the process that it would take to get there. Yeah. His his to me his superpower was he made you feel like you were always heard. It didn't matter what level you were or anything like that. You could be a frontline dev. You could be a senior exec. He found a way to connect with you and actually feel make you feel like he listened to you. Yeah. You were always the most important person in the room when he was talking to you, right? He he focused in and there was like and he he cared about people as people like not just as game developers or people that work for him. He you know he knew he knew your family. He knew uh right and he cared. I mean it was very very human level that I haven't seen anywhere else. like it's impossible to describe kind of the family feel that that Zenamax had because it was a very close-knit organization of people that that really cared about each other. Yeah, that's I I've talked to other developers, other people connected and I've",
            "start": 1547.04
        },
        {
            "text": "that that Zenamax had because it was a very close-knit organization of people that that really cared about each other. Yeah, that's I I've talked to other developers, other people connected and I've always heard that and I don't think it's something that gets talked about enough because usually these podcasts are so short and these interviews are so on point. But it is that idea of like God bless them, right? Cuz like I feel and I'm on a soap box now, but that's what's missing from the equation on so many of these companies where it is the chase the bottom line, chase the profit. This you said, you know, I love it. Failure is not catastrophic, right? But for so many people, they don't have the stomach for it. That's not what I was in here. I was in here to make a Fortnite. You're not making Fortnite, so see you later. Yeah. And his his going in position to any project was make a great game and the business will follow. Right. Right. don't um this isn't necessarily my story to tell,",
            "start": 1590.64
        },
        {
            "text": "Fortnite, so see you later. Yeah. And his his going in position to any project was make a great game and the business will follow. Right. Right. don't um this isn't necessarily my story to tell, but there's a very Todd has said this many times, but um the wisdom uh in the industry was not that RPGs were dead uh when Oblivion was green lit and and Robert was like, \"Is it going to be a good game? Is it going to be the best RPG ever?\" And they were like, \"Yeah.\" And he's like, \"Do it.\" Right. And it's like uh that means no one else is making RPGs and and come out at a time when there were no other RPGs and it was, you know, one of the best games ever made. Hell yeah. So that's his personality was like if if he trusted you that you were passionate about it, it was it was that was the the key. I love that. Well, rest in peace. Of course, we lo in 2021. Yeah. Um Mike, I want to get you back onto your Elder Scrolls train. I know you got your bonus points. You didn't bring your glasses. That",
            "start": 1626.72
        },
        {
            "text": "I love that. Well, rest in peace. Of course, we lo in 2021. Yeah. Um Mike, I want to get you back onto your Elder Scrolls train. I know you got your bonus points. You didn't bring your glasses. That was so special. Now it's just a tough one to follow up. That's why I want to follow up by reminding everybody that this is the Elder Scrolls online podcast. A kind of funny Games Cast special limited series. If you like that, thank you. Like, subscribe, share, support us however you can. And for right now, here's a word from our sponsors. This episode is brought to you by The Elder Scrolls Online. Every legend starts somewhere, and in ESO, it starts with you. Join the millions of players in the awardwinning online fantasy RPG. Write your story into a vibrant chapter of Tamreel's distant past and discover a world steeped in adventure and possibility. ESO is more than a game. It's a virtual world where you belong. This year, ESO is breaking the mold, and introducing the content pass,",
            "start": 1669.04
        },
        {
            "text": "past and discover a world steeped in adventure and possibility. ESO is more than a game. It's a virtual world where you belong. This year, ESO is breaking the mold, and introducing the content pass, complete with two new dungeon packs, two-part story content, a brand new zone to explore, and a worldchanging in-game event, all released throughout the year. And talking about story, 2025 brings us the Seasons of the Worm Cult, a direct sequel to ESO's main story. Travel to the never-before explored island of Solstice, where worm cult activity is surging. It's up to you to unite the three alliances against this old foe that has mysteriously returned. Pick up The Elder Scrolls Online now on PlayStation, Xbox, and PC. This episode is brought to you by Imperial. We've told you all how important it is to developers to wishlist games that you're interested in. So, if this sounds cool to you, make sure you wishlist it. Imperial is a complex, featurerich action RPG where you'll be sent to a",
            "start": 1710.16
        },
        {
            "text": "it is to developers to wishlist games that you're interested in. So, if this sounds cool to you, make sure you wishlist it. Imperial is a complex, featurerich action RPG where you'll be sent to a planet in a far-off corner of the galaxy to explore an imposing monolith. As an elite mercenary, you'll join the expedition tasked with unearthing the secrets of the monolith and face off against the deadly automatons within. In Imperial, you'll explore four vastly different quadrants of the monolith. Accessible only by using mysterious artifacts known as cardoggrams. Each cardoggram affects which enemies, boss fights, and loot will appear when you enter the monolith, so no two excursions will be the same. Find even more cardoggrams to explore by looting defeated enemies, or buy them from other players online at the trading post. Imperial features three weapon archetypes. The fast-paced acrobatic glaive, the defense focused mason shield, or the devastating cannon with a range of customizable",
            "start": 1756.24
        },
        {
            "text": "online at the trading post. Imperial features three weapon archetypes. The fast-paced acrobatic glaive, the defense focused mason shield, or the devastating cannon with a range of customizable skills and abilities that can make short work of the awaiting automatons. Your weapons and abilities can be changed before any excursion into a cardoggram. So, if a loadout isn't working for you, you can mix things up to create the perfect play style. Help the members of the expedition in deep branching quests and aid other players in asynchronous multiplayer. Get ready, mercenaries. The monolith awaits. Imperial is available May 8th on PC, Xbox Series X and PS5. Wishlist now. It helps so much. Wishlist Imperial. This episode is brought to you by Auraframes. If you haven't called your mom in a while, here is your reminder to do it. But then you want to go above and beyond. Mother's Day is coming up and I have the perfect gift idea. Aura Frames are incredibly smart and easy to use, allowing you",
            "start": 1798.64
        },
        {
            "text": "here is your reminder to do it. But then you want to go above and beyond. Mother's Day is coming up and I have the perfect gift idea. Aura Frames are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preload it with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special, they'll use it every day. Greg, Kevin, and a ton of people here at Kind of Funny are obsessed with their Aura frames. It takes about 2 minutes to set up a frame using the Aura app. So the next time you need to call your mom, you could also send her a new pic of you from that trip you're telling her all about. Ara has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting aura.com to get $35 off plus free shipping on their bestselling Carver for Matt Frame. That's a frames.com promo code kind of funny. Support",
            "start": 1845.6
        },
        {
            "text": "time, listeners can save on the perfect gift by visiting aura.com to get $35 off plus free shipping on their bestselling Carver for Matt Frame. That's a frames.com promo code kind of funny. Support the show by mentioning us at checkout. Terms and conditions apply. The show is sponsored by BetterHelp. It's super great that mental health awareness is growing, but there's still progress to be made. 26% of Americans who participated in a recent survey say they have avoided seeking mental health support due to fear of judgment. We can do better. No reason for fear. BetterHelp has over 10 years of experience matching people with the right therapist from the diverse network of more than 30,000 licensed therapists with a wide range of specialties. Some of my best friends use BetterHelp and love how helpful it can be for learning positive coping skills and how to set boundaries. It empowers you to be the best version of yourself. It isn't just for those who've experienced major trauma. If",
            "start": 1887.6
        },
        {
            "text": "how helpful it can be for learning positive coping skills and how to set boundaries. It empowers you to be the best version of yourself. It isn't just for those who've experienced major trauma. If you're thinking of starting therapy, give BetterHelp a try. It's entirely online, designed to be convenient, flexible, and suited to your schedule. We're all better with help. Visit betterhelp.com/kindfunn to get 10% off your first month. That's betterhelp hp.comkindfunny. better betterhelp.comkindfunni big dog. Yeah, let's get in. Let's have some fun. Um, you know, it's wild where I want to go and I know we have a lot of time so we'll be able to jump all over the place, but yeah, I want to talk about zones really quick, right? We talk about the map and being bu building it out and adding new zones. What is that like finding that balance of keeping a player in a zone, making sure they see enough of it before they move on to the next zone at the pacing wise? You always talk about talked about",
            "start": 1934.8
        },
        {
            "text": "What is that like finding that balance of keeping a player in a zone, making sure they see enough of it before they move on to the next zone at the pacing wise? You always talk about talked about it in the past couple episodes of like the Elder Scrolls player, you put them in the world and they just go wherever they want, right? And so is there a push and pull? I I think it was so great before the outbreak of talking about the players are the ones that are driving this, right? So, is it hard to be like, \"Hey, we want you to go from quest A to quest B, do all this, and then go to the next zone.\" When really, it's well, now with the world that it is, I can go anywhere and just have a great time. It took a while for us to get right. Um, but we learned a lot in terms of tricks and tips and and things. And I think the the biggest thing for us was just making sure that there was something cool over every hill, every rock. You know, waterfalls have to have chests behind them. P.S., My wife",
            "start": 1981.52
        },
        {
            "text": "things. And I think the the biggest thing for us was just making sure that there was something cool over every hill, every rock. You know, waterfalls have to have chests behind them. P.S., My wife will kill me if I don't put one back there, right? Cuz she's she's that explorer, right? You know, when you go behind it, there's it's just a surface. Like, what the heck? Right. You know, a player gets to a cool spot, they want something neat. And it doesn't always have to be a chest. It can just be like a cool little vignette scene of a skeleton with an arrow in its knee or in its head or something like that. And then players can can make their own stories up. Um, but yeah, so we focus a lot on just creating interesting locations for players to find. And then when we're telling our stories, we try to guide them through areas where they might get sidetracked and discover something else. So those are kind of the two big things. And then there's lots of like world building tips and tricks",
            "start": 2022.0
        },
        {
            "text": "we try to guide them through areas where they might get sidetracked and discover something else. So those are kind of the two big things. And then there's lots of like world building tips and tricks with lighting and stuff like that. You know, if it's brighter over here than over here, generally your eyes going to draw you over there, so you go that direction. It's it's it's those kinds of Yeah. our art team had uh um very much led by a guy named Jared Carr who was who was who has since retired but he's amazing art director but he was very good at whenever you crest the hill there should be something behind it that looks awesome right to make people want to climb hills and and and keep going right and the reveal right the scenes in ESO are all all because of that very very very well done also ESO is a basically a masterpiece of art style and fid fidelity where because we we have a really forgiving engine that can run on many many different different types of uh on our on our PCs,",
            "start": 2066.16
        },
        {
            "text": "also ESO is a basically a masterpiece of art style and fid fidelity where because we we have a really forgiving engine that can run on many many different different types of uh on our on our PCs, right? It looks fantastic, but not everyone has super high-end gaming rigs and ESO runs on just about anything. And so, but when you get to the running on lower power devices, it still looks amazing because of the art style, right? It's not it doesn't have the fidelity of of turning on all the settings, but it still looks amazing. And that's a very hard thing to do, and we we managed to pull that off. Yeah. When we talk about the engine, what was that like of when we talk about console in particular, Xbox One, now we move on to the next generation? What was that moment of, well, we can do all of this, are we leaving this behind? How do we find that blend to make sure everyone can see it in all of its glory? Well, this leads down a whole another tangent that we haven't even gotten to, and we",
            "start": 2107.04
        },
        {
            "text": "this, are we leaving this behind? How do we find that blend to make sure everyone can see it in all of its glory? Well, this leads down a whole another tangent that we haven't even gotten to, and we probably don't have time for this, but what are you talking about? We wrote a we we have our own engine for, right? Um and um we started by licensing an engine and we basically over time before launch just swapped it all out for our own. So it makes decisions like going to console or hey now the next generation of consoles out and we want to do you know cool lighting and shaders and uh since we can do that all ourselves because it's our engine. It makes it makes that possible. And our engine, our client was specifically designed for scalability. Like it has to look great on high-end machines and it has to run great on on low-end machines within reason. There you go. Really quick before we get away from zones, just two more fun going. Um on the zones, I want to talk about revisiting some",
            "start": 2150.72
        },
        {
            "text": "and it has to run great on on low-end machines within reason. There you go. Really quick before we get away from zones, just two more fun going. Um on the zones, I want to talk about revisiting some starter zones, which we're about to do here. I think that's really important and special. We talked about the new players jumping in and what they're experiencing. What was that like to finally circle back? How long did it take the team after 10 years and be like, \"Oh man, the starting areas, maybe we should go back there and reook at those.\" I mean, o over time as we've launched new things, right? Our tools have matured. We've matured as developers. Our art has matured. Uh, and a lot of those starter zones were, I guess, some of the last ones we built before launch, but they weren't up to the same standards as like our latest chapters, our latest DLCs. And so when we first started talking about, you know, looking at the new player experience and bringing players back to the game,",
            "start": 2192.32
        },
        {
            "text": "to the same standards as like our latest chapters, our latest DLCs. And so when we first started talking about, you know, looking at the new player experience and bringing players back to the game, returning players, we knew we had to go and do something there cuz they were good, but they weren't as good as as what they should be. And we started digging into what that meant. And we looked at everything. We looked at, you know, specifically lighting, doing propping, doing clutter passes, and then swapping out like ancient ancient assets for newer ones and and whatnot. And it really changed the spaces like just doing the water going from the old water to the new water was night and day difference night and day. We have old water in very very old water. Yeah. So was there push back at all from the team and I know the community is just learning about all this and stuff like that's going but of like well why are we going back to a starter zone and we have so many. Absolutely. Yeah. Well",
            "start": 2238.68
        },
        {
            "text": "from the team and I know the community is just learning about all this and stuff like that's going but of like well why are we going back to a starter zone and we have so many. Absolutely. Yeah. Well half the team pushed back why are we doing the other half were like we want to do more. We want to go back and fix everything. Can we just burn this down to the ground and start again? No. No. But yeah, it's it's, you know, like we were talking about when Tamriel, right? The team plays the game as well. And they want to be perfectionists and yeah, looking at your your older stuff, you want to redo it and we have to find that balance between a complete overhaul and just touching some stuff up. I know I am number one when it comes to guilty of this, but I am the player that when I get something new, I always ask, well, what's next? What can we expect? And what is that balance like? How tough is it to put out a new zone and then think about, okay, we're putting out another new zone in the",
            "start": 2286.32
        },
        {
            "text": "new, I always ask, well, what's next? What can we expect? And what is that balance like? How tough is it to put out a new zone and then think about, okay, we're putting out another new zone in the next one? What's the balance of new zones? Of course, we'll get into new classes eventually, but what is that balance of, hey, let's do it this update, but let's skip the next two updates and then do a new zone. Is there a balance? Is there a perfect world or is it just we got to do it every single time? A lot comes down to what teams are doing what and where they are. Like it takes it takes a while to build a zone. Um so like we're releasing this first half of Solstice or in June I guess it is. Um the team's been working on that for nine months already and they're already working on the second half of that as well. And so it just it just comes down to how much bandwidth does the team have. That's why we generally do like a dungeon update and then we do a story update and then we'll do like",
            "start": 2330.32
        },
        {
            "text": "half of that as well. And so it just it just comes down to how much bandwidth does the team have. That's why we generally do like a dungeon update and then we do a story update and then we'll do like a systemsy update and then we'll do another story update and we just kind of leap frog the teams that way. Generally, we divide players into different behavior types, which is like co-op, PvE, uh story based, sto, you know, questing, uh systems based like crafting and uh right. And uh we want to make sure that every year we kind of hit those groups at least with a couple of new things like new dungeons for co-op PvE, a new story, new quest, new zone for for the story people. Um which is kind of the foundation of the game of course being being Elder Scrolls. But we always try to pop in a new system like you know the card game or housing or there's there's so many of them at this point. Uh antiquities and those are the things that give players a ton of things to do over time but we don't",
            "start": 2377.04
        },
        {
            "text": "system like you know the card game or housing or there's there's so many of them at this point. Uh antiquities and those are the things that give players a ton of things to do over time but we don't have to handcraft all of them. So you can put that system in the game for antiquities and then we just add a couple of antiquities every once in a while to give a new scavenger hunt for players to run around on. So we consciously have a cycle where we try to hit the different groups of players with new with new content like that. Can we talk a little bit about the wall? Of course, we have something new coming our way and it's exciting, right? The the mystery. What is Has there been stuff in the past that you've done that you really like highlight like this was a cool moment mapwise, zonewise, and just player experience-wise similar to what we'll experience with the wall? I think this is kind of the next evolution for us in terms of a major event. And let me stop you because I want to know.",
            "start": 2421.28
        },
        {
            "text": "just player experience-wise similar to what we'll experience with the wall? I think this is kind of the next evolution for us in terms of a major event. And let me stop you because I want to know. There's plenty of people who are the kind of funny who Yeah, they watched the direct like a month ago. What is the wall? What are we talking about for the new update? So, the the soul wall is this giant ball of soul magic, I guess, that um is uh separating the the western and eastern halves of solstice. And so you the two parts broken up. It's the two parts, right? Broken up. Um and the the worm cult has kind of erected this thing to protect whatever's on the other side. And you don't know. And so as a server, you are working together to bring that wall down to open that second half up. So each server will progress in their own way, their own pace. Wow. Which is cool, right? We've never done that before. And uh pull together PlayStation 5. We got to get this thing done and it's going to be",
            "start": 2461.36
        },
        {
            "text": "server will progress in their own way, their own pace. Wow. Which is cool, right? We've never done that before. And uh pull together PlayStation 5. We got to get this thing done and it's going to be really interesting to see how this works, right? We've never done something like this on this scale and the team's really really excited about it. So now back to Mike's question, sorry, of things that were similar to that or learning experiences on that path to this whole wall. So, I think the the closest thing, you know, we obviously we've got lots of events in game. We've got, you know, the New Life Festival, we got Witches Fest, um, things like that. We have our prologue quests. So, those are the the quests that kind of give you that little teaser into what's coming up. Uh, so Elsewhere is probably the closest thing where you unleash dragons on the world. So, that's that's kind of what this is is all about when you're talking about these giant events in this and the little things you've",
            "start": 2512.0
        },
        {
            "text": "the closest thing where you unleash dragons on the world. So, that's that's kind of what this is is all about when you're talking about these giant events in this and the little things you've done to build this prologue When you look at this, do you compare it to other I know we already talked about what both of you, but what MMO online players you are. What does that speak to? Because you start talking about that, it reminds me so much of Guild Wars 2 where there would be those giant events, right? We had They're living world stuff. Yeah. Exactly. Exactly. Yeah. Is that an inspiration for you? Sure. I mean, we're all gamers. We we take inspiration from games and movies and books and TV and and all that. So, Okay. That's really exciting. Uh, talking about the new player experience, we talked on that. Of course, updating the intro and welcoming players on that new onboarding experience. I know me and Greg have jumped on to a couple of MMOs where they've had something fresh and new to",
            "start": 2551.04
        },
        {
            "text": "on that. Of course, updating the intro and welcoming players on that new onboarding experience. I know me and Greg have jumped on to a couple of MMOs where they've had something fresh and new to welcome players that have maybe never been in the universe or it's been quite some time. What has that been like talking about jumping back to the starting areas now creating kind of a new welcome? Matt, what's that like? It's he's being careful to figure out how we could go through and do this. But um I think the best way is is you know we use a lot of player metrics and player data to kind of help inform some of our decisions. And the launch tutorial that we had a lot of the feedback we got was it was too long. Just get us into the game. We want to play update six was our first new tutorial tutorial. Yeah. And now we're on we just launched 46 something like that. U so you know we try to use that to inform it and that was that was good that was an interesting thing. And then when we switched",
            "start": 2591.12
        },
        {
            "text": "Yeah. And now we're on we just launched 46 something like that. U so you know we try to use that to inform it and that was that was good that was an interesting thing. And then when we switched the model to chapters uh we started talking about well how can we make it so that the tutorial kind of feeds directly into the new chapter so you kind of get an idea of what it is and maybe more players will go to the new stuff. So that was when we started thinking about, okay, let's do a new tutorial every year. That, you know, looking back, probably not the right thing. Pro tip, don't don't do probably not the right thing. Um, but yeah, and so we just started continuing to iterate through that. And then, um, we took a a really hard look at that and what it was doing to player retention numbers and things like that. uh with Gates of Adamant. I don't know if you guys remember that, but that was I guess that was last year's tutorial that we did where you get to the end of the tutorial. And then",
            "start": 2639.28
        },
        {
            "text": "things like that. uh with Gates of Adamant. I don't know if you guys remember that, but that was I guess that was last year's tutorial that we did where you get to the end of the tutorial. And then there's different portals in the room that allow you to pick whatever zone you want to go to depending on what access you have. Yeah. Which sounded great to us. Yeah, it was awesome. But imagine you're a player who has never experienced this world before and you go through a tutorial and then you're there's a choice of things that you have no concept of what you're choosing. And can I tell you the game? I was on the phone with all my friends like, \"What alliance did you choose? Where are we going? What how do we all stick together?\" So, yeah. Like, yeah. And and so again, you know, looking back at it, it's kind of like, well, duh. Like, why would you give players that many choices when they're just starting the game? Hey, why not go back to the tutorial that has Jennifer Hail and John Cle,",
            "start": 2684.8
        },
        {
            "text": "at it, it's kind of like, well, duh. Like, why would you give players that many choices when they're just starting the game? Hey, why not go back to the tutorial that has Jennifer Hail and John Cle, right? It's like, why would you ever not Michael Gam, right? So, and so we did that and we went back and and we kind of this latest tutorial that's that's out right now is very much the old one but with a lot of improvements, focusing on the areas that players need in terms of core mechanics to to understand the game and be able to play the game better and introduce the story the re the main story, right? And not a chapter story. Sure. Because it got really confusing for people that started and say more wind and they did it and they finish the story and then they're like, \"Oh, wait, there's more, right?\" And then there's like seven, not 70, but you know, there's a ton of other zones and stories and uh and that they were kind of sheltered from until that. And this is a much better way to",
            "start": 2723.44
        },
        {
            "text": "more, right?\" And then there's like seven, not 70, but you know, there's a ton of other zones and stories and uh and that they were kind of sheltered from until that. And this is a much better way to get players in to see kind of the whole game and explain the alliances because you go to an alliance city first now and and so forth and so on. And the new the new starter zones, too. I like that we come all the way back to starter zones and how you start the game because I still want to talk about this whiteboard and I'll get out of here. But it's you guys, it's Bethesda Game Studios. You're figuring out you're noodle in the story. You get this thing going and then this is something I honestly don't know like what happens next is it we talked about it being mechanics and a PvP pace and this is so is it that somebody goes and you start really rough with an engine? Do you also hire writers at that time to start noodling on this story? Like where does that kind of thing go? So projectwise,",
            "start": 2765.04
        },
        {
            "text": "is so is it that somebody goes and you start really rough with an engine? Do you also hire writers at that time to start noodling on this story? Like where does that kind of thing go? So projectwise, yeah, you we started with the whiteboard map of what the alliances are and which provinces were in which alliances and that made a world exist. And then um inside of that it's like okay then you have to then then it gets to your point which is what is a zone, right? And and it's like and that's usually a technical exercise of how much stuff can you load in at one time? Are there loading screens between zones? We actually had a version of Tamreel that there were no loading screens and then we decided to go to loading screens uh for a whole another reason which we haven't talked about which is our mega server technology um which allows uh a lot of the social systems uh that we have in the game. But it was the right call but we had to go back and and which is why in many zones you just walk",
            "start": 2808.44
        },
        {
            "text": "our mega server technology um which allows uh a lot of the social systems uh that we have in the game. But it was the right call but we had to go back and and which is why in many zones you just walk and you hit an invisible wall and then you zone and it used that's because that's an original game zone that used to just be able to walk into the other zone. Interesting. But uh and we didn't have to worry so much about memory and stuff in that sense. But yeah, so it's like you're making the Daggerfall Covenant. Okay, got to have Daggerfall, right? Okay, let's start in Glenn Umber, which everybody knows from the from the game Daggerfall. And then what's in there? Okay, the Red Guard are there. So you got to have Sentinel and uh and the the orcs are there, and we're not going to give the orcs a homeland until after launch. Yeah, they're the they're the underdogs for sure, right? But that's where it starts. And uh yeah, we had an engine. We started prototyping things. We actually had zones",
            "start": 2852.96
        },
        {
            "text": "a homeland until after launch. Yeah, they're the they're the underdogs for sure, right? But that's where it starts. And uh yeah, we had an engine. We started prototyping things. We actually had zones that were too big, zones that were too small, zones that made no sense at all. Um, and then we, like I said in last episode, we fixated on Storm Haven because we needed to focus the team on one zone, get something correct, and get something correct and then replicate that uh throughout the rest. And so Storm Haven actually grew and shrank and had many quests in it and then had not enough quests in it. And finally, we hit the right balance of it's 15 hours to get through a zone. I forget. We came up with a yeah it's about with a metric 15 to 20 hours right and then then we replicated Storm Haven to Rivenspire which we also redid about 50 times and uh I it was only five but it was I mean it it's known to us internally as revision spire because we redid it I love that. Okay. So then it it's",
            "start": 2891.76
        },
        {
            "text": "to Rivenspire which we also redid about 50 times and uh I it was only five but it was I mean it it's known to us internally as revision spire because we redid it I love that. Okay. So then it it's playing trial and error really. Yeah. Yep. At what point or is this while you're doing all the trial and error for the zones are you having somebody concurrently write and write and write? Okay. Yeah. So, we knew what the stories were going to be for the zones early on. Gotcha. Um, so there's a main story that goes that carries the player from the be from the tutorial through to the alliance to the end of the alliance and then into Cold Harbor, which is where the story ended in the in the in the launch version of the game. And so, we had that spine and then you see what POIs, what points of interest there are in each zone and then you start writing a little quest thing for each of those and then so the stories just kind of grow from there. But it's pick your characters, pick the spine that",
            "start": 2933.2
        },
        {
            "text": "there are in each zone and then you start writing a little quest thing for each of those and then so the stories just kind of grow from there. But it's pick your characters, pick the spine that moves the player through through the zones and then uh and then go from there. And we had 10 voice uh really good voice actors and we might made sure to split them up among alliances or in the main story so that you already gave a shout out to Jennifer Hail of course. Oh yeah, Commander Shepherd. I think the best way to think about it is we tried to build a a box for the teams um that you know had that spine had a couple of key points and then let the team go and fill out the world and so a lot of that stuff just kind of started to organically happen as the team started to iterate on things. Talk to me about are you guys then I know it's not really your thing but are you going to these uh like I got to see Kate Beckett I got I gotta go listen to John Cle were lucky enough to do that. Yeah.",
            "start": 2980.16
        },
        {
            "text": "to me about are you guys then I know it's not really your thing but are you going to these uh like I got to see Kate Beckett I got I gotta go listen to John Cle were lucky enough to do that. Yeah. Yeah. You guys have to imagine there's lots of neat stories. Give me some of them. Uh John Cle maybe going to his uh his island in order to record. That was the second one. first one, the first one was funnier, which was uh um so you always get contracts, right? These are busy people that have a lot to do and uh we got the message that based on his schedule, right? He was going to be recording in Morocco, right? Uh cuz he was he was he he was there. And so, you know, we which is fine, right? This is voice over. You know, you set up you can set all in the closet, put a put the blanket over the door, you're all set. Exactly. So after after going through the technical exercise of getting the equipment to Morocco and uh which we have a team dedicated which we still have a team dedicated to doing",
            "start": 3023.6
        },
        {
            "text": "you're all set. Exactly. So after after going through the technical exercise of getting the equipment to Morocco and uh which we have a team dedicated which we still have a team dedicated to doing VO exhaust you know they set it up and then of course it turns out we basically financed a week of John Cle vacationing in Morocco. Right. Where he worked for a couple hours a day very professionally. Right. Right. To to to record the to record the What are you in Morocco for John? Oh you guys. Yeah. And and then when we brought him back for elsewhere, it was the same story but in the Caribbean. Yeah. I love that. And they went to a big ballroom and built a blanket fort as a sound booth. Yeah. So, and he crawled under this tent and recorded his lines in I love that. I love that. Meanwhile, Kate Beckell just went to a studio in LA. Well, the LA actors, right, that's what they that's it's all set up. You don't have to do anything anything special for that. But, you know, we we released a video",
            "start": 3070.64
        },
        {
            "text": "just went to a studio in LA. Well, the LA actors, right, that's what they that's it's all set up. You don't have to do anything anything special for that. But, you know, we we released a video right before launch that actually has some behind the scenes stuff with all the actors talking about their characters and everything. And it's well worth it to go back and and look at that. Yeah. Because this isn't like, you know, oh, it's a line and they're gone. Like with these characters. Yeah. And we brought we brought Kate back in uh I mean, every time that the the queen, right, is is in there. We brought there's a chapter she was in. I mean, she wasn't in with Raz and whatnot. Yeah. Um, we're finally seeing them turn on each other. I know there's so many. No, no, it was uh it was High Isle with when the Alliance leads came back and then like Alfred Bolina came back for Edner Thorne and and elsewhere. He's amazing to work with like super professional. Is there a moment? I mean, I know",
            "start": 3116.48
        },
        {
            "text": "with when the Alliance leads came back and then like Alfred Bolina came back for Edner Thorne and and elsewhere. He's amazing to work with like super professional. Is there a moment? I mean, I know again, okay, there's Hollywood people on the board. So, but is there still a moment like I can't believe we're working with these people? Oh, yeah. Every day. I mean, Troy Baker, right? Who's who's like Yeah, but Troy sucks. It's fine. Yeah. Yeah. But but it's like uh you know he's he's a voice of Indiana Jones and he's he he's additional voices in ESO, right? And but he's done so many lines for ESO just cuz they're so good at doing different voices and Troy's amazing and uh yeah Laura Laura Bailey's been in there too. Laura Bailey's there. She's one of the major companions that that that that you can get um uh have follow you around and talk to you all the time. So her character is great. Yeah. Uh, one of the things you talked about back there and I think we're starting to get u, you know,",
            "start": 3156.8
        },
        {
            "text": "can get um uh have follow you around and talk to you all the time. So her character is great. Yeah. Uh, one of the things you talked about back there and I think we're starting to get u, you know, as we move on in the timeline here and flesh out there is what was it like, you know, you talk about, okay, well, Oblivion was there, so we don't want to go there, but then of course you've done, okay, well, now we're going to Morowind, now we're, you know, you started going back to the places obviously that people know from Elder Scrolls. What's that like? And is there a process with that again of having to go meet with Bethesda and check with their historian or somebody of like this that the other or then also then the expectation of well I know this and in my playthrough of Skyrim there was this thing and it said it's been there for thousands of years. So so we have to have the Lawrence discussion now. The discuss. So so Lawrence Shik is one was one of the original ESO team members. Um",
            "start": 3201.04
        },
        {
            "text": "this thing and it said it's been there for thousands of years. So so we have to have the Lawrence discussion now. The discuss. So so Lawrence Shik is one was one of the original ESO team members. Um long uh many people watching this uh have just gone I know that guy cuz he was one of the original 10 uh designers of D&D. So he did uh way plume mountain module in 1970 whatever right he was an original OG game designer he's amazing he he he ended up I mean he worked for us for years and years and years he was the lore master uh so his job was literally keep everything on a timeline that made sense cuz this is canon right? This is all absolutely it's all canon and uh and so he was the liaison to BGS you know so we could make sure that that everything was was copathetic on the timeline and our character names were right right all all that stuff that all all went through Lawrence and he kind of whipped all that into shape with with like guidelines for everything and uh and basically made",
            "start": 3241.44
        },
        {
            "text": "character names were right right all all that stuff that all all went through Lawrence and he kind of whipped all that into shape with with like guidelines for everything and uh and basically made made the characterization of of ESO and and fitting it into the timeline like make was coherent Cuz before he was there, everyone could name things and there were crazy names all over the place. Right. But yeah, it was kind of the wild wild west. Yeah. Yeah. Yeah. So he tightened his belt and said, \"Not at my watch.\" Yeah. And I mean, and then when it comes to like where do we go next? How do we choose the next thing? A lot of that is like conversations between Matt and I and it and it comes down to like looking at what we've done and we try to do almost the exact opposite the next time. So it's doesn't feel like it's it's sy. And a lot of times we talk about like a word to kind of evoke the emotion and rally the team around things. So like elsewhere was I think it was revenge. Yeah. The",
            "start": 3290.8
        },
        {
            "text": "doesn't feel like it's it's sy. And a lot of times we talk about like a word to kind of evoke the emotion and rally the team around things. So like elsewhere was I think it was revenge. Yeah. The dragons. Morwin was nostalgia. Exactly. Love that. Greymore was gothic. Yep. Uh but yeah, but your your question about zones. Morwind. We literally used the height map from the game Morin from Elder Scrolls 3. We imported it in and made our zone based on that. That's awesome. So we in we actually leaned in to making sure that we had is because we were 600 years before the events of Morwind. So we could have lots of call outs to what was going to happen 600 years later. And if you play through it and you played Elder Scrolls 3, you'll be like, I know that guy or oh that's the grandfather of that guy or Right. So it's full of references and Easter eggs if if you played Elder Scrolls 3. My question then would become as we move out of these the zones the story that this how do you get to",
            "start": 3333.84
        },
        {
            "text": "that guy or Right. So it's full of references and Easter eggs if if you played Elder Scrolls 3. My question then would become as we move out of these the zones the story that this how do you get to something like nuts and bolts of like all right, here's the classes we're going to have and obviously you've added since then. I mean, there's been a whole bunch of stuff, but like for the this starting core, here's who you can be. How do you zone in on that, Rich? That was really hard. It wasn't We didn't really start nailing that stuff down until like 2012. Warrior in Storm Haven. Yeah, it was. And we don't even have a warrior in the game. That's that's that's the funny part. There is no class called Warrior, but there was for three years. A warrior in footy pajamas in Storm Haven. Yeah, that was uh so it was just a lot of trial and error, a lot of trying to dig through like what are the kind of core fantasies that players want to fulfill as their class and we ended up, you know, digging",
            "start": 3376.08
        },
        {
            "text": "was uh so it was just a lot of trial and error, a lot of trying to dig through like what are the kind of core fantasies that players want to fulfill as their class and we ended up, you know, digging in on like the Dragon Knight and the Nightblade and the Templar, you know, Paladin healer kind of thing. Yeah. And then Sorc, right? Those were the originals. Yeah. Um and how do they balance a PvP game? How do you make sure no one's overpowered? Right. constant figuring out. And the fun too with that is you could use any weapon and any armor type. And so like how do you balance with all of that and how do you know we've got this deck builder game but you can your class is really just three skill lines and then there's 10 others that you can add to you can make a healing based rogue a healing based or you can make a a heavy armor two-handed sorcerer, right? It's like you can do all that in ESO, right? It's uh you can basically build really weird characters and uh it's cool, right?",
            "start": 3422.32
        },
        {
            "text": "healing based or you can make a a heavy armor two-handed sorcerer, right? It's like you can do all that in ESO, right? It's uh you can basically build really weird characters and uh it's cool, right? Obviously, if you want to if you want to do the most damage or you're you're into that, right? There's a clear path that you need to take, but if you want to role play some pretty crazy combinations, it's it's all it's all there. And it's only getting crazier now, right? Again, the direct a couple weeks ago, we're talking about subasses. Yeah, it's going to be But we're taking skill lines, but we're taking skill lines that were balanced, right? And and mixing it with other skill lines that were already balanced. So, um I'm sure there will be uh some revisions at some point because that's the way these work. But I was going to say you were talking about balancing, but like I'm sure you've been shocked time and time again of what people figure out and oh this not so much shocked. This is my",
            "start": 3468.96
        },
        {
            "text": "these work. But I was going to say you were talking about balancing, but like I'm sure you've been shocked time and time again of what people figure out and oh this not so much shocked. This is my shock face. Yeah, exactly. But we're not surprised. Okay. Right. Like players are super super um ingenious when it comes to like thinking outside the box and doing things. There's the meme video that I'm sure everybody's seen about developers where the square peg goes in the round hole and the triangle goes in the right like it goes in the square like that is gamedev in a nutshell and I laugh at that video anytime I see it because yeah we built it with this in mind and players do the exact opposite you're like huh okay good for you right exactly um but you know leading up to subclassing the the last three four years we've been focused on balance and standardizing things and right like going through literally every combat system and do that. Um, and a lot of players were like, \"Why are you",
            "start": 3507.52
        },
        {
            "text": "last three four years we've been focused on balance and standardizing things and right like going through literally every combat system and do that. Um, and a lot of players were like, \"Why are you doing it now? Why are you doing it now? Why are you doing it now?\" Well, it's because we were going to do kind of this at some point and we had to make sure we got to a point where all of the lines were balanced to a specific point. So that when we started adding in all this other crazy like now I can be a nightblade with warden abilities, right? or I can be a necromancer and a warden and a sorc, right? And have just pets galore. Like what does that look like? And and yeah, that like there was a method to the madness, but it was it was a long long haul. Matt, does this play into something I've heard you say before, but it's the fact that there's uh there's no right or wrong way to play this game. And the other thing I've heard you say is like, and correct me if I'm wrong, but I think it was",
            "start": 3550.08
        },
        {
            "text": "you say before, but it's the fact that there's uh there's no right or wrong way to play this game. And the other thing I've heard you say is like, and correct me if I'm wrong, but I think it was on McCaffry's podcast where you were like, I don't even call this an MMO anymore, right? What? Talk to me about that. Our next episode is all about community. So, I think it's a good like build up to that. That's a good GDC presentation. What is an MMO? And the answer there, every game's an MMO. FIFA is an MMO. I mean, like it's it's multiplayer in massive numbers is everywhere at this point. But, um, yeah, it's MMO is more of a technology than a game design now. It's a technology that let lets people play together in whatever way the game designer wants them to play. Yeah. So then is that all tied up together then? And like I do you again same look at the whiteboard and the stuff that didn't make it and laugh. Do you look at your conceptions and your preconceived notions of you know hey we're",
            "start": 3597.92
        },
        {
            "text": "up together then? And like I do you again same look at the whiteboard and the stuff that didn't make it and laugh. Do you look at your conceptions and your preconceived notions of you know hey we're launching this PvP focused Elder Scrolls PV and PV. Yes. Yes. Yes. But it was one of your pillars. It was your first pillar. One of the three. Yes. Okay. But do you look at it now and then go like you see people just cooking or people just running around building their homes or whatever? It's it it is when you hand the game to the community on launch day, right? you you lose control. Not all control. You lose some control, course, right? And and then you you look at what players do. And did we think we were going to have one of the premier uh end games in the in the game were going was going to be housing? No, we had no idea, but we're very happy that that it is. And and I think the quote I did on that podcast, which is what I usually say, so I'm going to do it on this one. Thank you. Uh",
            "start": 3641.84
        },
        {
            "text": "to be housing? No, we had no idea, but we're very happy that that it is. And and I think the quote I did on that podcast, which is what I usually say, so I'm going to do it on this one. Thank you. Uh is uh in your face, Macaffrey, we're stealing your content. Uh if you ask five ESO players to describe the game that they're playing, they will describe five different games. And to me, that means we've succeeded because we've made a virtual world where different activities are valid and fun and players love to do them together. Michael, I'm just going to mic drop on that. Give me the outro. You covered on your stuff. Uh yeah, I'm excited to jump into the community. We haven't we've tiptoed around PvP and I think community really drives that. So, we'll talk about that. Housing is a fun one, Greg. The addition of all of that. So, I'm really looking forward to talking about the community that drives this game and the things that they really love, the things that they want, the things maybe",
            "start": 3681.68
        },
        {
            "text": "The addition of all of that. So, I'm really looking forward to talking about the community that drives this game and the things that they really love, the things that they want, the things maybe they've given you a lot of feedback on and we've changed up and we'll talk more about that next time. Yeah, we asked for questions. There was one question that kept getting asked. We're going to ask it next time. Don't worry about it. I'm sure we No, I know you have. I don't think any of Don't worry about it. Everybody, this has been episode three of your The Elder Scrolls Online podcast, a Kind of funny games cast limited series. Thank you for your time and attention. Remember, of course, we'll be back in two weeks for our final episode on Friday, May 23rd. Of course, if you like this, like, subscribe, share, wherever you're getting it. Maybe it's over on the Elder Scrolls Online's channels. Maybe it's over on the Kind of funny channels. No matter where it is, we couldn't do it without your",
            "start": 3727.84
        },
        {
            "text": "share, wherever you're getting it. Maybe it's over on the Elder Scrolls Online's channels. Maybe it's over on the Kind of funny channels. No matter where it is, we couldn't do it without your support. So until next time, no, it's been our pleasure to serve you.",
            "start": 3769.04
        }
    ]
}