{
    "id": 2568,
    "video_id": "rXvF1leQTGU",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Game Announcements - Kinda Funny Gamescast Ep. 116 (Pt. 3)",
    "description": "What company does the best job at announcing games?\n\nThanks to Blue Apron for sponsoring this episode. Go to BlueApron.com/gamecast\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1492605002,
    "duration": 1350,
    "transcript_chunks": [
        {
            "text": "What's up, guys? This episode of Kind of Winning Games Cast is brought to you by Blue Apron. Not all ingredients are created equal. Fresh, high-quality ingredients make a real difference, so it's important to know where your food comes from. Choose from a variety of new recipes each week. Or let Blue Apron's culinary team surprise you. A couple upcoming meals include spinach and fresh mozzarella pizza with olives, bell peppers, and raakota salada, and sweet and sour salmon with bok choy, carrot, and ginger fried rice. Does that sound good, Kev? Yep. Yes, it does. Check out this week's menu and get your first three meals free with free shipping by going to blueapron.com/gamecast. So that's gamescast without the s in the middle of it. It feels and tastes good, too. Create incredible home-cooked meals with Blue Apron. So don't wait right now. Do it. blueapron.com/gamecast. Blue Aapron. It's a better way to cook. [Music] Next topic. I want to talk about how these companies get their",
            "start": 0.08
        },
        {
            "text": "meals with Blue Apron. So don't wait right now. Do it. blueapron.com/gamecast. Blue Aapron. It's a better way to cook. [Music] Next topic. I want to talk about how these companies get their information out there. These [ __ ] companies, Nintendo, Sony, Microsoft, they each have varying versions of the same type of thing when it comes to to talking to the audience. Nowadays, everyone has YouTube channels. They're can put up their own trailers whenever they want. like PlayStation's channel's like pretty legit like they they release stuff constantly. Um Nintendo has its directs. Xbox has Xbox Wire and um Nelson just like killing it with all all that type of stuff and making it more personality driven while still getting the the information out there. But with the amount of conventions there are where there's E3 being the kind of main one and then there's the still the Paris Games weeks, the Gamescoms, the TGS's and all of that, there's pretty much every month something happening. And now",
            "start": 39.84
        },
        {
            "text": "where there's E3 being the kind of main one and then there's the still the Paris Games weeks, the Gamescoms, the TGS's and all of that, there's pretty much every month something happening. And now with even with E3 with people splintering off and doing their own thing with EA Play and Bethesda having its um conference and and event and all that stuff like what what do you think is kind of the best way for them to get the information of their games out there? I mean it depends on the announcement I think. Right. That's the big thing. I I I mean to take PlayStation example I love the fact that there's PSX because PSX is hey I want to talk to the people who listen to PS I love you every week. I want to talk to if you're so into this one thing. Yeah, we want to talk to you about the indies we're bringing to Vita. [ __ ] yeah. But in the same breath, what is it? 6 months prior. Hey, USA Today, here's all these [ __ ] awesome AAA trailers that we're talking about and we're not going to",
            "start": 100.56
        },
        {
            "text": "we're bringing to Vita. [ __ ] yeah. But in the same breath, what is it? 6 months prior. Hey, USA Today, here's all these [ __ ] awesome AAA trailers that we're talking about and we're not going to mention VR, which is weird, but no big deal. We're doing all this awesome stuff. You know what I mean? Like, they have a great balance to it. I don't think they nail it all the time. You know what I mean? The PlayStation blog's great, but I I love the idea of Major Nelson. And if I I don't and I mean I know Major Nelson, but if I I think maybe was more of an Xbox guy, you know, for the last 10 years, I would know more. I would love to see them take the reins off of Sid and Ryan and all of them and let them be personalities. I would love it if they were on the YouTube channel and if you went to the PlayStation and it was Yeah, exactly. It was them chilling out. You can go to PlayStation blog and read a whole bunch of posts and stuff, but they're PR and stuff and that's not bad. I mean,",
            "start": 140.08
        },
        {
            "text": "to the PlayStation and it was Yeah, exactly. It was them chilling out. You can go to PlayStation blog and read a whole bunch of posts and stuff, but they're PR and stuff and that's not bad. I mean, that's coming from PlayStation. It's an official channel. I mean, I that I kind of like that though. I like that. Uh, not that they aren't allowed to really have their personalities out there, but I like that the PlayStation blog is uh a place to kind of get all of the information about games. Like when the Crash Bandicoot uh trilogy was actually announced or whatever, like I went to the PlayStation site and it had everything. It had more information than I even got from like Activision's press release and it's just like cuz they they dived hardcore. They're hardcore and it goes into the like, yeah, they're totally remastering the soundtrack and it's going to be this, this, and that. The PR thing didn't say anything about that. And there's been a lot of other times uh recently like uh when",
            "start": 176.56
        },
        {
            "text": "yeah, they're totally remastering the soundtrack and it's going to be this, this, and that. The PR thing didn't say anything about that. And there's been a lot of other times uh recently like uh when last week when the Uncharted Lost Legacy release date was out there, reading that blog post, I was like there's a lot more information here directly from the source from Naughty Dog that makes this feel different than normal just PR statements. Sure. Yeah. I think it's interesting how we've really shifted from, you know, these big brands always releasing their biggest stuff at E3 on stage at a press conference to now in these two months leading up to E3, we're probably going to get most of the big announcements before E3 even gets here, Destiny 2. I mean, I think we're going to hear about, you know, Scorpio before E3. we probably won't see it until we get to the stage. But like Nintendo, you know, kind of led the way with saying, \"Hey, we're not going to be doing a press conference at E3",
            "start": 212.08
        },
        {
            "text": "know, Scorpio before E3. we probably won't see it until we get to the stage. But like Nintendo, you know, kind of led the way with saying, \"Hey, we're not going to be doing a press conference at E3 anymore. Instead, we're going to do our Nintendo Directs.\" You know, they just had a recent one talking about, you know, a lineup for for Switch games that are coming out later this year. And, you know, they are kind of marching to the beat of their own drum at E3, too. And even companies like Bethesda that are putting out their stuff. I mean, I didn't expect to see that extensive scene we saw from The Lost Legacy um until E3. and Naughty Dog's just like, \"Here's a cool trailer, you know, get your pre-orders in now.\" Um, and so I think it's for people like us that, you know, make a living off of speculating on what's going to happen is really kind of throwing a wrench into the whole situation going, \"Well, when is Xbox going to going to tell us what their next big first party game is? When",
            "start": 256.0
        },
        {
            "text": "speculating on what's going to happen is really kind of throwing a wrench into the whole situation going, \"Well, when is Xbox going to going to tell us what their next big first party game is? When are we going to see that trailer? Is it going to be E3? Are they going to have a standalone event? When are we going to see, you know, new hardware from, you know, PlayStation? Are they going to respond to Scorpio? When is that announcement going to happen? It's It's been interesting looking at how YouTube specifically has kind of changed the way that these publishers make their big announcements because before they would go to like your IGN, your EGMs, your, you know, Eurogamers of the world and Exactly. or your Game Informer exclusive reveal. And now we're seeing less and less of that because well, first off, leaks are everywhere and if they have their own channel, why not just release it there? Yeah, it's interesting too because since there's been this shift uh away from E3, like E3 is",
            "start": 296.24
        },
        {
            "text": "well, first off, leaks are everywhere and if they have their own channel, why not just release it there? Yeah, it's interesting too because since there's been this shift uh away from E3, like E3 is obviously still the big one, but that kind of scares people off to do their own thing as well so that they can own the moments and it allows them to put content out in a different way. Like they I don't think they would have shown that scene from Uncharted at E3, you know, be like it was kind of weird just being a random snippet of the story, right? But because it was just the whole post was about Uncharted, they're allowed to kind of do their own thing and then just be graded and like judged and commented on based on, oh, this is just about Uncharted's release date. Cool. Whereas if that was part of a bigger messaging, then it's just like, all right, well, that announcement is not as big as this announcement that it's next to and compared to this press conference. Who won Tuesday? Yeah.",
            "start": 337.76
        },
        {
            "text": "part of a bigger messaging, then it's just like, all right, well, that announcement is not as big as this announcement that it's next to and compared to this press conference. Who won Tuesday? Yeah. So, what's interesting though is going to the Nintendo side of things, like the Nintendo Directs. I love them because it's just randomly once a month, maybe once every two months, there's just going to be Nintendo news. And they've seen a bunch of different changes over the last couple years in terms of directs being their more press conferency type thing. If we're going to announce a whole bunch of [ __ ] over this hour, they've kind of turned into, all right, this is a direct about Smash Bros., this is a direct about Mario Kart. And they really dive deep into those things. But the problem is because Nintendo Direct used to be this other thing, everyone kind of expects major announcements all the time. It's a Nintendo Direct. We're getting Metroid. We're going to get uh F-Zero. It's like,",
            "start": 380.4
        },
        {
            "text": "because Nintendo Direct used to be this other thing, everyone kind of expects major announcements all the time. It's a Nintendo Direct. We're getting Metroid. We're going to get uh F-Zero. It's like, no, you're not. Like, stop. You're going to get ARMS release. Shut up. You're going to get a couple. You're going to get release dates. You're going to hear about a bunch of like smaller titles and you're going to get amiibo news. Like, that's the amiios have been like the one constant of the Nintendo Directs for the last year. And uh seeing the new direct they just did uh a couple days ago. I'm fascinated by the new style that it took where cuz it's this was the first direct with uh Coruma I think his name is. Um cuz before it was AA and that was a very distinct style of how he'd present the information. It was really goofy and stuff. This was way more like news update um where there was actually like headlines behind him that you could see like all here's all the announcements we're",
            "start": 417.04
        },
        {
            "text": "the information. It was really goofy and stuff. This was way more like news update um where there was actually like headlines behind him that you could see like all here's all the announcements we're talking about today. And it it was a different tone of it's going to be rapid fire. we're just going to announce a bunch of things. And it reminded me of PlayStation's press conference last year, which was great. Games, games, games, games, games games. And the problem with it is it was a great direct. Announced like 20 games coming to the Switch or 3DS. Gave uh real in-depth look at Splatoon 2 and at ARMS. Gave release dates for those. It answered a lot of questions that people had um about upcoming Switch titles that are coming very soon, like pre3. But then of course the reaction to it is like they didn't [ __ ] why they even [ __ ] do this. They didn't announce any of this other stuff, but it's like it was about Splatoon in ARMS. Sure. Right. But don't Here's my my argu",
            "start": 456.48
        },
        {
            "text": "to it is like they didn't [ __ ] why they even [ __ ] do this. They didn't announce any of this other stuff, but it's like it was about Splatoon in ARMS. Sure. Right. But don't Here's my my argu counter-argument to that is just the fact that you now got to deal with the fact that you got to educate people like me on what this is. You know what I mean? Like I I mean I'm a student of the game. I've paid attention. I know what directs are and you talk about them all the time. But I think that Switch has brought in so many people and so many sleeper people who didn't give a [ __ ] about Wii U. They didn't give a [ __ ] about DirectX. They didn't care that now you're there. it is. You're thinking it's going to be a PlayStation announcement thing. It's going to be some kind of thing. And that's why I always go back to, man, I want to see another one with puppets because now that I give a [ __ ] about the games and I'm going to play them. I'm like, all right. Yeah, I love your system. Give",
            "start": 498.32
        },
        {
            "text": "why I always go back to, man, I want to see another one with puppets because now that I give a [ __ ] about the games and I'm going to play them. I'm like, all right. Yeah, I love your system. Give me some puppets. Give me some weirdass Nintendo [ __ ] I don't think that people who would maybe be considered a casual Nintendo fan if they, you know, skipped the last version of Wii and they just got back into Switch because of of Zelda that do they really care about what Nintendo was talking about in their directs anyway? I mean, are they even bothering to to watch or read those headlines? I mean, if you're if you just bought a Switch, I think you are, right? Because you're like, man, I want to play more things on this. What am I going to play on it? I mean, I think the most people are going to IGN afterwards and looking at the like what happened in the direct. They're not actually watching. I think the people watching the direct are just the like not casual game fans, the hardcore game",
            "start": 529.52
        },
        {
            "text": "to IGN afterwards and looking at the like what happened in the direct. They're not actually watching. I think the people watching the direct are just the like not casual game fans, the hardcore game fans that are like people that listen to podcasts and you know kind of indulge in all that stuff. And what I was saying, like the point that I was trying to make is it's interesting to look at Nintendo Direct versus the Uncharted Lost Legacy reveal where both are we're just doing one thing like that was for Uncharted whereas this was for ARMS and Splatoon, but because it was under the Nintendo Direct banner, it people didn't receive it the same way. They got angry that they didn't get Metroid, you know, even though all it was was just an info dump. It was a PlayStation blog post about those two games, right? Um and as a fan, I I enjoy that we did get a lot more than I expected. I thought it was just going to be those two games. But then the other side of that is it was a bunch of stuff",
            "start": 565.92
        },
        {
            "text": "two games, right? Um and as a fan, I I enjoy that we did get a lot more than I expected. I thought it was just going to be those two games. But then the other side of that is it was a bunch of stuff that I don't care about and like I don't know who cares about. But I I don't I enjoy that they at least put that information out there and that they announced those games and do kind of celebrate them in a way. Otherwise like I wouldn't know about a lot of the like the Kirby games coming out or whatever the the Hey Pikmin 3DS platform. So you like the direct or would you prefer a more flashy kind of announcement? See no I I think that the the direct I think what they did with the Nintendo presentation, the Nindy's thing last month, which wasn't a direct but essentially was, was brilliant because they took out the direct name, so people didn't go into it expecting a press conference and they got just 15 looks at games coming to the Nintendo Switch and then a screenshot of 60 logos of and",
            "start": 602.24
        },
        {
            "text": "they took out the direct name, so people didn't go into it expecting a press conference and they got just 15 looks at games coming to the Nintendo Switch and then a screenshot of 60 logos of and here's a lot more. Yeah. Right. And that felt satisfying to everybody because they didn't expect Metroid there. They didn't expect these big announcements. Whereas to you direct means something. You're saying you're saying to the wider gamer audience direct means Fire Emblem in Smash and we're going to get a big big thing. Yeah. And so I just think that had they just called this something different. Had they just called this Arms and Splatoon presentation, I think people would have not disliked it to hell and and and all that, right? So, I do think that Nintendo has a a bad um style of putting the stuff out because they are so traditional in what they're doing even in the last couple years of being really innovative in how they're putting the information out there. They're just so stubborn in",
            "start": 646.56
        },
        {
            "text": "stuff out because they are so traditional in what they're doing even in the last couple years of being really innovative in how they're putting the information out there. They're just so stubborn in standing to like going off the beaten path and being like, we're not doing the E3 press conference. It's like, well, you need to think about how you're delivering the message otherwise. Well, their last live press conference, no thank you. Just do just do directs from now. That's fine. Yeah. Uh, what did you think about Xbox using a single outlet to put out the big news about the Scorpio effect? So weird. It was I mean it's it's different. And no, that was the thing is like don't get me wrong, I'm not saying it was weird in a bad way. It's weird like that cool kid in your class who sits in the back and wears those like long long black shirts underneath white t-shirts. You're like that's and they draw and they got the hair over there and then they make you feel things sexually. You want I",
            "start": 691.08
        },
        {
            "text": "back and wears those like long long black shirts underneath white t-shirts. You're like that's and they draw and they got the hair over there and then they make you feel things sexually. You want I don't know why. Is this hitting home for you? Were you that kid? Yeah. Yeah. Right. No. God can't wear layers. No, it was weird, but it it made sense. And that was the thing with the announcement of like, wait, they're doing what? They're doing it over with. And then it was the idea, well, oh, those guys know what they're talking about with this. They're going to be able to speak to it in a way that kind of backfired on the PS4 Pro with, hey, I'm a huge PlayStation fan. I don't get what I'm looking at or why I would buy this thing. What's a teraflop? Exactly. Oh, so many there's so many teraflops in all these things. And I you're totally hitting it on the head there where it's just like the going to Digital Foundry, they are the guys that know what teraflops are. Yeah. [Music] Yo, no, this",
            "start": 728.4
        },
        {
            "text": "in all these things. And I you're totally hitting it on the head there where it's just like the going to Digital Foundry, they are the guys that know what teraflops are. Yeah. [Music] Yo, no, this is good. It's like that's what people like me need to hear. Yep. Not some dude like Andrew House coming out and and talking about all the stuff where it's like, okay, well, I I don't trust you telling me that it's good because you don't trust Andy House. No. not what he's telling me about like teraflops and [ __ ] that I I don't really understand, you know, whereas these digital foundry guys don't care about Mark Cernney. I'll give it to Are you going to trust? Okay, I'll trust Mark. Remember, he's the one who said Knack was good, too. Yeah. Hey, don't hit on the Lord and Savior. Knack. Knack. Yeah. Yeah. Yeah. Uh, but no, I I thought that was a bold move from from Microsoft. And I I'm very very interested to see if we do see Scorpio before E3 because I think that this might have been the",
            "start": 764.0
        },
        {
            "text": "Yeah. Yeah. Yeah. Uh, but no, I I thought that was a bold move from from Microsoft. And I I'm very very interested to see if we do see Scorpio before E3 because I think that this might have been the pre3 that we saw and then E3 being its kind of like debut as like a system. Yeah, we probably won't see the box on stage until E3 if even at E3. I hope we do. We will. You if it's coming out in the fall, you're going to see the box at E3. You think so? I do. Yeah. Okay. They're still sticking to this fall in a hard way. Not in the like, oh, Persona 5 is still coming in 2014 or whatever. Wink. John Harden, you piece of [ __ ] It's not John's fault. Back then it was. He's gone now, but he I heard was the one. They were like, can we release this? And he said, \"No, delay it five times.\" And they're like, \"But we really want to release it. It's done.\" And John Harden was like, \"No.\" And then they finally overthrew him and got him out of there. These are all lies about a PR person you probably",
            "start": 815.68
        },
        {
            "text": "like, \"But we really want to release it. It's done.\" And John Harden was like, \"No.\" And then they finally overthrew him and got him out of there. These are all lies about a PR person you probably don't know. But yeah, it's very interesting that all three play uh guys have such different ways of going about this. And it's funny that like PlayStation's the most traditional but the most successful it seems in getting the information out there and having the most people talk about it. I mean what's interesting about it is I wonder and I don't have the crystal ball. I don't know where the timeline would diverge. I wonder how much longer PlayStation can continue to be successful like this because the thing is PlayStation came out and knocked it out of the park with that PlayStation 4 event. Here's the games. Here's what we're doing. Here's you know the E3. Here's a funny video with Adam and Shu about how to share. They were I'm like, \"You guys are on another [ __ ] level. You are insanely",
            "start": 863.12
        },
        {
            "text": "the games. Here's what we're doing. Here's you know the E3. Here's a funny video with Adam and Shu about how to share. They were I'm like, \"You guys are on another [ __ ] level. You are insanely you're destroying this.\" And then since then, they've started to go back a little bit towards the PlayStation 3 era of like not making the crazy bad decisions, being [ __ ] about it, but being quieter and not promoting the indies as much. And here are the AAA games. And then we get to PSX and PSX is normal where it should be. And I think that's the balance. That's the sweet and the sour. But like Xbox, you know, this week being like, \"All right, cool. Yep. We are now instituting digital refunds.\" You know what I mean? Like, oh [ __ ] that's [ __ ] aw Okay, we have fixed backwards compatibility. Oh, that's really cool. All right, here games. Game game pass. Here's the ability to [ __ ] order your custom controllers. Like all these little things that really are Goodwill pro gamer choices in a",
            "start": 902.16
        },
        {
            "text": "Oh, that's really cool. All right, here games. Game game pass. Here's the ability to [ __ ] order your custom controllers. Like all these little things that really are Goodwill pro gamer choices in a way that PlayStation were all still like, \"All right, it's not cute anymore. Can we change your names?\" Like, that should be something we should do. And I'm not saying that that stuff's the Achilles heel, but it's interesting to see Xbox slowly but surely build up all these pieces of gamer goodwill in terms of the fact of I don't know if it's Scorpio or if it's something else or it's the next generation, if there's a full generation or however this is all going to work from here on out. But I do feel like Xbox and that team really is setting up these dominoes. And I don't know if they'll ever fall because PlayStation's so far ahead with PS4. But if PlayStation does continue to it seems like they're going back to being quieter where it seems like I'm seeing more from Phil Spencer now like",
            "start": 936.4
        },
        {
            "text": "fall because PlayStation's so far ahead with PS4. But if PlayStation does continue to it seems like they're going back to being quieter where it seems like I'm seeing more from Phil Spencer now like you know his post today about the Scorpio just hey all of a sudden here I am in Xbox Wire all this information about Scorpio we'll see 83 when we show it and you're like oh we'll Scorpio will be 83 like okay great that's cool and to see them getting out in front of it it's just interesting. Yeah, definitely. Yeah. The the last thing I want to say about Nintendo is I I think the solution because I I was pitching about the problem, but I do think the solution is focusing more on directs about specific games and they this could have been two directs or even just one direct that is very clearly called Splatoon in arms and keep Nintendo Direct as a thing that people expect it to be. If you're going to announce the Metroid and you're going to announce the big games and it's more of like a press",
            "start": 974.32
        },
        {
            "text": "Splatoon in arms and keep Nintendo Direct as a thing that people expect it to be. If you're going to announce the Metroid and you're going to announce the big games and it's more of like a press conference, come out with that. Otherwise, the people are going to be upset about Splatoon because they didn't want to like it anyways, even though Splatoon is a hit and people buy it, you know, and more people are going to buy Splatoon 2. Like, I bet Splatoon 2 outs sells Splatoon one. Oh my god. Yeah, it'll take it'll be it lifetime. But the thing is Splatoon 1 sold super well for a Wii U game, but even at 5 million, like almost 5 million, like that's I had no idea it sold that many. Yeah. The people who love Splatoon love. That's the thing. Splatoon 1 on Wii U is like a 4.7 or something like that. Last I checked. I'm sorry. What's up everybody? Welcome to the Kind of Funny Morning Show for April 13th. One of your hosts, Greg Miller, alongside Kevin. What are you doing? BLC doesn't even know",
            "start": 1011.44
        },
        {
            "text": "Last I checked. I'm sorry. What's up everybody? Welcome to the Kind of Funny Morning Show for April 13th. One of your hosts, Greg Miller, alongside Kevin. What are you doing? BLC doesn't even know what's happening back there anymore. Oops. But I I love you, Kevin. I think that like Nintendo does a bad job of telling people that didn't know it sold that well that it did. You know, like like people they just kind of expect that like, oh yeah, it's Splatoon. What's happening? People like that. Kevin's fixing everything. Don't worry, Kevin's on it. That's how it happens sometimes. Garbage truck on fire. But ARMS is another example is when you see ARMS next to like in a in a press conference, like when they revealed it for the first time, it's a [ __ ] joke and people are like, \"What the [ __ ] is this [ __ ] I want Metroid.\" You know, but ARMS could be a hit and it could be another Nintendo character-driven IP that people really like like Splatoon if they play their cards right. Why are",
            "start": 1050.56
        },
        {
            "text": "is this [ __ ] I want Metroid.\" You know, but ARMS could be a hit and it could be another Nintendo character-driven IP that people really like like Splatoon if they play their cards right. Why are you shaking your head? It's not gonna be a hit. That's what everyone said about Splatoon and 5 million on the Wii U, which only sold 13 million is pretty good. I know, right? ARM ain't going to do it. I mean, even looking at PS4 game sales, like what's the top selling PS4 game? Uncharted, which is that like 8 million digital or retail? Overall, uh, in we're talking about exclusive. Are you talking about first? I mean, can it be a third party? Doesn't matter either way. Because it would be probably Call of Duty then, wouldn't it? Yeah, I think so, right? Yeah. Um, yeah. I don't know if it's an exclusive. Exclusive would be Uncharted. Nothing got sold more than 8 million. What's Oh, Horizon's off to like a crazy start, though. Yeah, but Horizon. But even then, we're just talking through the",
            "start": 1090.96
        },
        {
            "text": "exclusive. Exclusive would be Uncharted. Nothing got sold more than 8 million. What's Oh, Horizon's off to like a crazy start, though. Yeah, but Horizon. But even then, we're just talking through the math. Tim, Horizon hasn't sold as much. This is a noble thing. I understand. I'm just saying. I was talking through the math. I wasn't make the real argument. See if I could look it up really quick. Andrew Rene going to look up what's the bestselling PlayStation 4 game. Oh, dang it. If Colin Morardi was here, he would say it immediately, but he wouldn't really know. He would say it and we would all be like, \"Oh, it must be right.\" Yeah, that's true. And I want to I want to also want to make sure that Splatoon sold as much as I You can check that, too. I'll talk to the audience and saying, \"Hey, everybody, it's me, Greg. How you doing?\" I don't say anything that involves numbers, so I don't have to check them or do math. If I had another dart right now, I'd call Andy and shoot at his face.",
            "start": 1135.12
        },
        {
            "text": "everybody, it's me, Greg. How you doing?\" I don't say anything that involves numbers, so I don't have to check them or do math. If I had another dart right now, I'd call Andy and shoot at his face. Now, for the record, I was shooting Tim's chest that time, but it went right by his eyeball. So, this is a very dangerous toy, and that's why it's in the knockoff. Uncharted 4: Thief's End sold 8.7 million copies, followed by Horizon Zero Dawn at 2.6, followed by Killzone, Shadow Fall. So, we're talking about exclusives or we're talking about like just games in general. Those are just exclusives. Okay. Which granted, there's a lot of third party games that sell super well. Grand Theft Auto, Call of Duty, Assassin's Creed, like all it does. GTA might be the highest selling. I don't know. GTA 5 is the highest selling uh game of all time. All SKs are. Yeah, you imagine. Yeah. Yeah, it was. Doesn't matter which. Always on top. Yeah. Okay. Well, there you go. What do you got for Splatoon?",
            "start": 1169.6
        },
        {
            "text": "5 is the highest selling uh game of all time. All SKs are. Yeah, you imagine. Yeah. Yeah, it was. Doesn't matter which. Always on top. Yeah. Okay. Well, there you go. What do you got for Splatoon? Splatoon 4.76 million. There you go. That but that impresses me when you granted Horizon's only been out for a couple months. A couple months and Splatoon was out for years. The only the thing you're what you're talking about here is the interesting part of I think Splatoon is going to sell incredibly well at launch because more people are excited about their Switches than they were their Wii. But the problem is yeah, lifetime. how many Wii Us were in the install base, you know, but there's not five million Wii or Switches out there for people to buy the [ __ ] game on. Yeah. So, that's why the lifetime thing once there's bundles. But even like first week sales and stuff like that would be interesting to see, I think. Yeah. Yeah. And for ARMS as well, and AMS comes first. ARMS has a release",
            "start": 1205.84
        },
        {
            "text": "lifetime thing once there's bundles. But even like first week sales and stuff like that would be interesting to see, I think. Yeah. Yeah. And for ARMS as well, and AMS comes first. ARMS has a release date now of June 16th. So, if you if anybody out there buys ARMS, I'll break your legs. What? That's I just thought it'd be funny, but ARMS isn't going to sell. Let me know in the comments below if you're excited for ARMS. It ain't about that. It's about I'm saying it could be a hit. I in the same way that Splatoon was because everyone had the same reaction to Splatoon that they do to ARMS. No, I disagree. What? Yeah. I think more people were outward about how much they loved Splatoon than they have been about ARMS. You're talking about after it came out. No, I'm talking about like people like games critics who played the game in advance of its release. Everyone I know that played that game came away liking that game. But a lot of people I know have done nothing but make fun of ARMS that",
            "start": 1247.12
        },
        {
            "text": "games critics who played the game in advance of its release. Everyone I know that played that game came away liking that game. But a lot of people I know have done nothing but make fun of ARMS that have played it. Yeah. Really? See, I don't buy this. I don't buy this. The guy who likes sniffer clips. No, no, no. Yeah, exactly. I'm not saying ARMS is a bad game. Yeah. And I'm not even saying is a good game. I'm just saying that when I remember being at IGN when the direct happened and they announced Splatoon, laughs, groans, everybody was just like, \"Are you [ __ ] kidding?\" Yeah. The Squid jokes. Yeah, I know. The whole the whole thing. And that's that was all inked himself. He did. He did. And but then yeah, of course the people that play it love it. That's because that's what Nintendo fanboys do. True. True. Right. But anyways, hope you enjoy that episode. You can click here to subscribe to Kind of Funny Games. You can click there to subscribe to Kind of Funny. You can click here to",
            "start": 1286.96
        },
        {
            "text": "do. True. True. Right. But anyways, hope you enjoy that episode. You can click here to subscribe to Kind of Funny Games. You can click there to subscribe to Kind of Funny. You can click here to support us on Patreon. You can click there for some stuff that I'm not sure, but I'm sure that Kevin's going to put something fun there. Bye. What if you click here?",
            "start": 1327.44
        }
    ]
}