{
  "id": 284,
  "video_id": "3uQ_RJgvczw",
  "show_name": "The GameOverGreggy Show",
  "hosts": [
    "Greg Miller",
    "Tim Gettys",
    "Nick Scarpino",
    "Colin Moriarty",
    "Portillo"
  ],
  "title": "Star Wars, God, Comics, and Cell Phones! - The GameOverGreggy Show Ep. 22",
  "description": "Full Episode Friday! Get it EARLY here! http://gameovergreggy.bandcamp.com\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1399618802,
  "duration": 5867,
  "transcript_chunks": [
    {
      "text": "[ Music] what's up everybody? Welcome to the GameOverGreggy Show. I'm Greg Miller and this is my group of friends right here, the pride of Long Island, Colin Mori arty. Hello, how are you? Oh, hello, hello. Yes, that's how microphones work. You've been, you've been on your retirement vacation to Long hashtag retirement vacation. What is hashtag retirement Vacation all about? Uh, I'm on vacation all week and and the theme of the vacation is retirement. So I'm pretending like I'm actually retired. So I've been getting up every, I've been getting up every morning going to the diner down in the Inner Sunset that really like and I, I'll read the news with the old people sitting at the counter, which is a lot of fun. Do they know you by name yet? Do you hang your hat when you come in? No, no, I'm just like, hello, how are you? You do it in a disgruntled fashion though, so like no matter what the new story is, you're disappointed with it. Yeah, well, I'm, I'm trying to be a little angry, a little more cronly DOI person to when",
      "start": 1.1
    },
    {
      "text": "you you do it in a disgruntled fashion though, so like no matter what the new story is, you're disappointed with it. Yeah, well, I'm, I'm trying to be a little angry, a little more cronly DOI person to when you're reading like a story about like, like a fire fighter that saved like kids or you just like, yeah, you got to do that that yeah, that that heavy side not agree with anything. Are you drinking coffee or you drinking the the din cups of coffee? You got to do that. That's, that's a staple. I don't like, I don't like coffee. I, you don't, but you got to do it. You got to do. I'm not that committed to to retirement vacation, I guess. Otherwise no, I've just been hanging out, not doing anything, going to San Diego in a couple days. That'll be fun tomorrow, right? No, is how days Frid? I thought you left Thursday. No, Friday night, Friday morning. Yeah, all right. Then of course, the producer Seducer, Nick Scarpino. Hi everyone, how are you for joining us? I'm doing well, thanks. Good to see you. Good to see you be looking",
      "start": 36.8
    },
    {
      "text": "no, Friday night, Friday morning. Yeah, all right. Then of course, the producer Seducer, Nick Scarpino. Hi everyone, how are you for joining us? I'm doing well, thanks. Good to see you. Good to see you be looking good, thanks. It's full. Yeah, it's going to get, it's going in for a trimming this weekend. Wait, who trims it? I do it my, you're sending it in. Okay, I was going to say rco beard trimmer, but I got to get a haircut and I can't decide whether I should go super short on the sides, keep it long on top and then just have the beard be big or do my normal thing where no matter what I do, it looks exactly the same. You know what I mean? I mean, it always looks awesome though. Yeah, but like sometimes I just like, I'll tell the girl like, hey, I want sort of like a kind of like a Justin Timber leg sort of like a, uh, you know, Jason Sudekis from the Circ Academy Award when he showed up with a very lovely and very pregnant Olivia Wilde. They're in love. They have discussed a really good relationship. I'm so jealous of all",
      "start": 77.6
    },
    {
      "text": "know, Jason Sudekis from the Circ Academy Award when he showed up with a very lovely and very pregnant Olivia Wilde. They're in love. They have discussed a really good relationship. I'm so jealous of all both of their success and their looks. Anyway, so I'm probably just going to go with something short. I'm probably just going to go short, like just a little long on top, short on the sides. That's it. That's fun. I, I recently saw a video of us from a couple years ago. We were in a cameo appearance in Cheap Cool Crazy. Oh, little start. That was a hit show. And, uh, there's a clip of me and you walking out of an elevator and we both look like we are 10. Did I have the beard? I didn't have the beard. Did I? You could have had the beard if you l 10. It was crazy. You were beardless kind. Yeah, someone on Twitter pulled a, uh, a clip from Up at Noon when I was in the intro for it. Yeah, I think I was talking about Game of Thrones and how it's the best game, um, ever. It's the only game that matters. It's the only game that",
      "start": 113.68
    },
    {
      "text": "a, uh, a clip from Up at Noon when I was in the intro for it. Yeah, I think I was talking about Game of Thrones and how it's the best game , um, ever. It's the only game that matters. It's the only game that matters. Thank you, Tim. Uh, and I didn't have the beard. I was like, I look disgusting without a beard. My beard is so much better than me, my non- beard that is. Does the wife like it? Uh, she likes it. She doesn't like when it, uh, becomes unruly like it is right now. What's that? Where it's just creeping North? The, well, it starts to go here and then you get the over the lip beard where you we can kind of play with it and she doesn't like when I talk that it kind of dips in the mouth and then you get the the wings on the side here is just starting to look where if I fluff it out a little bit, it's it's a little too long. See, that's the problem with my beard is it doesn't get full, it gets long. Yeah, and then I have to like kind of quaff it back into place. So it's like get some of that hair gel, put it in",
      "start": 153.2
    },
    {
      "text": "little too long. See, that's the problem with my beard is it doesn't get full, it gets long. Yeah, and then I have to like kind of quaff it back into place. So it's like get some of that hair gel, put it in there. So I think I got to shave it down a little bit, but you know, we'll see what happens after this weekend. We'll see next next week what it look like. Then I was going to say beardless, but you have a beard too, the pure one, Tim Gettys. Tim, I like your shirt today. Thank you. It's new. It's very nice. Yeah, my friend was get doing an interview, so we had to buy a new shirt and I was with him and I'm like, well, I want to buy a nicer shirt than the one you're buying. So I bought this one. Yeah, that's not fair. I know, like you're trying to get a job, but I have so much money. Yeah, so maybe it gives him something to look forward to. Yeah, exactly. That works. Well, ladies and gentlemen, if you didn't know, this is the GameOverGreggy Show. Every week for best friends gather around this table each bringing a random",
      "start": 186.24
    },
    {
      "text": "to look forward to. Yeah, exactly. That works. Well, ladies and gentlemen, if you didn't know, this is the GameOverGreggy Show. Every week for best friends gather around this table each bringing a random topic of discussion to discuss with each other. If you like that, you should like the video, subscribe to us over on youtube.com/gameovergreggy. But if you really like the show, you can wait every Friday we put up the MP3 at gameovergrey.bandcamp.com, the full show, every topic right there for a dollar days early. Then over on that YouTube channel I just mentioned, you get it day by day, topic by topic until Friday we post the entire shebang for your approval. Greg, I'm sorry, but I'm a little distracted right now. Yeah, you should be. Your shirt's really nice. Thank you. I'm not you're not the only one with a nice new shirt here. Everybody, this literally is just out of the package, the new Sean Finnegan likes hiking there GameOverG. Oh God, at districtlines.com. Awesome. That would have been the endgame overy.",
      "start": 224.16
    },
    {
      "text": "a nice new shirt here. Everybody, this literally is just out of the package, the new Sean Finnegan likes hiking there GameOverG. Oh God, at districtlines.com. Awesome. That would have been the endgame overy. Oh, he's come back from, he's come from back from bigger hits than there. But look, it's green. It pop. I really like the logo. Another Nick Scarpino production. Good job. No, that actually was, that was Mike NS actually. Uh, I can't believe I just raised your hand. You **** ****. You didn't do anything for this shirt. I put the logo together and I picked the color scheme, but Mike NS actually was one of the, one of the, uh, designers. Well, the designer, not one of them, like a whole team, a whole team back behind. We cut to like the GameOver T-shirt shop, people of like beers and stuff, they're pouring smoke and all this crap. But yeah, Mike, Mike is on Twitter. You can hit him up. I think it's at Mike NOS, um, and thank him for this, this sign. If you like it, if you hate it, let them know you hated it and, uh, don't do",
      "start": 263.64
    },
    {
      "text": "all this crap. But yeah, Mike, Mike is on Twitter. You can hit him up. I think it's at Mike NOS, um, and thank him for this, this sign. If you like it, if you hate it, let them know you hated it and, uh, don't do that. Don't put out negative. If you like it, the best way to not like it is to go to districtlines.com/gameovergreggy and buy them all. Yeah, buy them all and burn them. Yeah, that's a perfect example . If you don't like it, buy 30 of them and burn them. Just buy us out or just buy the other shirt so we see how unpopular the Shan Finnegan shirt is. That's true. We do have other shirts, right? Yes, there's a Nick Scarpino one. There is lot of pictures of that going around, Sco Shadow Boxing Association EST established 199. It's interesting. I it it's the most popular shirt last month by a landslide. Yeah, I beat out the Callin for president one. I beat out the GameOverGreggy one. I beat out Sean Finnegan. Yeah, I didn't expect it. Well, you didn't our golden calav. You're the one we got a. I'm the one who's te. You're",
      "start": 301.76
    },
    {
      "text": "the Callin for president one. I beat out the GameOverGreggy one. I beat out Sean Finnegan. Yeah, I didn't expect it. Well, you didn't our golden calav. You're the one we got a. I'm the one who's te. You're suckling. Yes, all day God willing. Oh my God. God willing . Su what what other shirts you got in your repertoire? What we do right now? I think that's it. We got one more in the back r more. We got the Oreo gasm. We the or we got the GameOverGrea staple on the channel. I might I might add. It's as classic as the Rayb band sunglass named Brothers wore GameOverGreggy shirts underneath their outfits. I heard that. I heard that. That's what killed John Belushi too tight. We're on a mission from Gad. That's what they said. 6 miles to Chicago, full tank of gas , half in a lot of ways you remind me of Dan Aykroyd and John Belushi in one. I got I have the Dan Aykroyd height have high. You actually look a lot like a young like when he was like skinny and fit. No, I look like Dan a just as he starts to turn the corner to",
      "start": 337.76
    },
    {
      "text": "John Belushi in one. I got I have the Dan Aykroyd height have high. You actually look a lot like a young like when he was like skinny and fit. No, I look like Dan a just as he starts to turn the corner to super fat Ghostbusters too like right they all started getting a little sucking the guts guys with the Ghostbusters yeah yeah that horrible scene what do you mean that horrible scene they come triumphantly into the museum yeah and it's this really bad music and they stal they stop there totally self-aware of the fact that they're in a movie which is like just totally against everything they it's not sare they're in a movie they're the Ghostbusters showing up at this likeu museum two people look over at him and then he's like sucking in guys with the Ghostbusters and they all try to suck in their guts and you're it just reminds you of how young and awesome they were in the first one and how everything has to die when I was a kid I did not remind me of that at all remind me great I just",
      "start": 385.32
    },
    {
      "text": "their guts and you're it just reminds you of how young and awesome they were in the first one and how everything has to die when I was a kid I did not remind me of that at all remind me great I just watch that everything must die though that is true that is true that's I think there's a new book right next to Everybody Poops Everything Must Die by Colin Mor arti just a black cover and two red eyes on it George railroad Martin right next to George railro railroad Nick kick it off this week so this uh this question is actually was submitted to us uh as a result of our topic uh last week I believe which was if aliens were to come to Earth what would happen and I think a couple of us said well I think it was Colin and said that would completely destroy religion right like it would just completely uh negate everything that was written in the Bible because there'be another creature out there that wasn't accounted for this question is a really interesting one though so we all decided okay",
      "start": 424.72
    },
    {
      "text": "uh negate everything that was written in the Bible because there'be another creature out there that wasn't accounted for this question is a really interesting one though so we all decided okay that would probably make us um not believe in God but this comes from K Kenny Belo well you like The Jungle Book Guy my dude Kenny K Belo I'm not sure what he is on Twitter I didn't write it down here but he's on Twitter everybody search for Kenny beloo what would it take find The Jungle Book Guy there you go he's it's that's I don't watch Disney film B is the Bear right he's the one the necessity that's the one and then in the sh the cartoons he eventually becomes a pilot correct yes in in in ta oh my God yes tail that's not right him looks like I'm right that was BL him D I feel bad that I don't know this off the top of my head but I'm I'm pretty sure it's blue no no you all you give topic I'm the topic is this so if the aliens came uh and and you know discredited religion and made you not",
      "start": 467.88
    },
    {
      "text": "know this off the top of my head but I'm I'm pretty sure it's blue no no you all you give topic I'm the topic is this so if the aliens came uh and and you know discredited religion and made you not necessarily believe in religion what would it take to make you believe in God so this is wait is this related to the aliens or just in general people who don't believe because like I believe in God we know Colin doesn't right what would it take to make non-believers like would you need to get a sign would it have to be like a cross that just floated around behind you the entire time and was like hey hey you're like that's how God sounds huh yeah probably that's my mom sounds I don't know Colin what would it take **** it is blue I totally took a shot in the dark there and I connected that the bear **** grew up from The Jungle Book and learned to fly he was old then you're thinking Mowgli Mowgli is the kid no I'm not thinking about the kid he was the one that grew up blue was always just 40",
      "start": 510.28
    },
    {
      "text": "bear **** grew up from The Jungle Book and learned to fly he was old then you're thinking Mowgli Mowgli is the kid no I'm not thinking about the kid he was the one that grew up blue was always just 40 years old 40y old there Tail Spin Tail Spin was awesome so good it was it was really good what would it take to make me believe in God yeah uh I would some irrefutable proof that he what does that mean like God talking the burning bush yeah I mean like my legs getting broken there are there are things especially in you know even with Jesus in the New Testament where if I saw certain things that he did I would believe you know now you'd have to see those with your own eyes right yes because here's my thing um I the first thought I was like okay I would I would just love to see someone descend from heaven and land and then I'm like wait how would I want what up right and they were like yo I'm back um but what would then I think watching that on TV most likely and I probably I would use that",
      "start": 555.32
    },
    {
      "text": "heaven and land and then I'm like wait how would I want what up right and they were like yo I'm back um but what would then I think watching that on TV most likely and I probably I would use that as a device to dis believe it right TV they're totally Faking It Like A lot of people think the Apollo Moonlighting was a fake and the ET Atari thing and the ET Atari dig was a fake right which I still don't quite understand why everyone would go through that much trouble to fake to seller Xbox TV show ish yeah Sam Clayborn made some compelling anyway go on well we can talk about that later at a different time um yeah I think I would probably need something the same right I would I I would need I would need to see God come down from the heavens yeah I mean here's the thing here's the thing that always bother me about religion this is the questions I started asking when I went to Catholic school and didn't engender me to the nuns very much which was why like why is it Jesus says something",
      "start": 600.6
    },
    {
      "text": "always bother me about religion this is the questions I started asking when I went to Catholic school and didn't engender me to the nuns very much which was why like why is it Jesus says something along the lines of you know blessed are those who believe without seeing right he says that in the New Testament and why but why like what the whole like Faith right the word faith is having faith in something that you can't see or touch or feel but you know exists or you think exists that's Faith but that seems like that that particular issue of faith is in every major religion like you can't see and you can't touch you know but you just have to believe that it's there or whatever and to me that's not a coincidence that's because that there is there is nothing there you know what I mean like why doesn't like what about God makes him not want to make himself known right like you can just solve everything all of these problems every like if especially if it was like well it was the Christian",
      "start": 645.8
    },
    {
      "text": "doesn't like what about God makes him not want to make himself known right like you can just solve everything all of these problems every like if especially if it was like well it was the Christian God or the Muslim God or whoever where it's like make yourself known and your your shit's obviously legit you know like and it never made any sense to me where it's like well you have to have faith you have to have faith that something's there because God will never make himself well why not yeah it doesn't make it doesn't make any sense and if aliens were going to invade Earth it would be brilliant for them to act as if they were God if they knew something about like seriously if they knew something about our society and they like these people are like there's a billion people on the Earth that believe in Jesus Christ and if we just pretend you're Jesus then like we will get seriously we'll get no resistance like know yeah like I'm throwing out a good idea for fiction here like that does",
      "start": 686.88
    },
    {
      "text": "believe in Jesus Christ and if we just pretend you're Jesus then like we will get seriously we'll get no resistance like know yeah like I'm throwing out a good idea for fiction here like that does you know like they're so smart they can they can travel you know galac galactically or whatever and they and they arrive at Earth they obviously know about us and they can study us and all those kind things and it would be interesting to see if they were like well I'm Jesus who are you to say that he's wrong you know like like he does have a really especially if he has powers levitate stuff uh I love how he went powers like this like like like a general or like I assume that's how Jesus used his power yeah definitely water that's right I stand I mean an Ali an alien being able to get to earth or whatever makes means that he's so hyper Advanced or you know it is so hyper Advanced that that is his close to God as we will ever see you know in terms of like power yeah and we talked you can have",
      "start": 726.12
    },
    {
      "text": "whatever makes means that he's so hyper Advanced or you know it is so hyper Advanced that that is his close to God as we will ever see you know in terms of like power yeah and we talked you can have telekinetic powers and all those kinds of things in the mind the mind gets bigger and more robust and can do more things I mean who knows but see I feel like that would still freak me out right I think that would still like if I saw someone come down was like I'm Jesus I'm like he looks like Jesus and he can shoot lightning out of his hands i'be like dude I'm terrified of this gu are you Jesus or are you Emperor Palpatine because you're confused here you're mixing your metaphors here a little bit mixing your fiction Tim what would it take to make you believe in God I mean obviously seeing something seeing something what would you me I don't know I don't know I you're the kind of person that that that would like like when there's a magician in front of you you're the one that's like I know I",
      "start": 772.88
    },
    {
      "text": "seeing something seeing something what would you me I don't know I don't know I you're the kind of person that that that would like like when there's a magician in front of you you're the one that's like I know I know how that Trick's done so if there was like a burning bush you'd be like dude kerosene and a bu L the stuff yeah like a lot of the stuff I I I've often I'm very ignorant and do not know the backstory on a lot of this at all the back story of Jesus yeah I don't know caught up on those back issues the Bible but uh you know like so I don't know that so when I talk to people about this stuff and a lot of things they say like oh this happened and this happened and I understand a lot of it's like metaphorical or whatever but like I'm just like what if he was just a dope ass magician like and he he is tricking these people and like you know what if he was just a really smart dude that knew a lot of magic tricks and did the magic tricks and then everyone's like oh man and then he got his way",
      "start": 809.92
    },
    {
      "text": "he is tricking these people and like you know what if he was just a really smart dude that knew a lot of magic tricks and did the magic tricks and then everyone's like oh man and then he got his way because he's really smart and like his way was a good way or whatever got his way get crucified that's true though I mean that's that's often something I think of right that uh how how you easily you would be able to get you can commit a crime back then and get away with it because no forensics there was no forensics if you didn't have any sort of I mean they would probably just point the finger at someone you can easily frame someone be easy yeah the Ripper I was think about going back in time with the machine gun being being yeah being the dopest **** Robin trains be good guy but I take care of bad guys with the machine gun yeah yeah you only have a limited cartridge though so you scw the whole thing is I would have had I would have brought a whole bunch of bullets he's ready oh so",
      "start": 848.96
    },
    {
      "text": "care of bad guys with the machine gun yeah yeah you only have a limited cartridge though so you scw the whole thing is I would have had I would have brought a whole bunch of bullets he's ready oh so that would be your weakness like just steal his bullets steal those things he puts in that thing I'd figure you out I'd stop you you couldn't stop me your ancestors are too dumb no that's true you couldn't stop me they were like Pig Farmers or something yeah so I would I would have to see something that like I'd be like you know what that might be magic but it might not be I feel like that'be enough for me and also like the moon landing thing I mean I'm convinced we went to the moon cuz enough people said we did and enough people are like I saw that that did happen I'm like okay so if enough people saw it and enough people are like yeah it's legit that checks out i''d be like okay if there's only one dude that was like oh no I know the trick to this he's doing all this stuff it'd be like",
      "start": 889.84
    },
    {
      "text": "people saw it and enough people are like yeah it's legit that checks out i''d be like okay if there's only one dude that was like oh no I know the trick to this he's doing all this stuff it'd be like but if there's a lot of them then I'd be like I don't believe this at all do you think that if you were to believe it do you think it would change anything in your life the way you guys did anything would you stop masturbating as much I mean I don't know no I'd masturbate more on one hand what does that even mean is that is that possible God I'm so God I'm stoked I'm going to heaven yeah he like Pops in he's like that is not guaranteed by anything you are doing right now that's a Surefire way to not get yourself an invite to a party I feel like it's on one hand it'd be smart if you know it exists be like oh I probably should be better but on the other hand if you know it exists it's just like well then you're going to just be cool with whatever I do and forgive me for things right that's",
      "start": 928.32
    },
    {
      "text": "be like oh I probably should be better but on the other hand if you know it exists it's just like well then you're going to just be cool with whatever I do and forgive me for things right that's how this works see I feel like you're really good at gaming the system so you'd figure out how to be like okay how I can mate all the time and be cool one two Hail Marys yeah that's how I got through college completely was just like okay here's the syllabus who's exactly what I need to do to get an A I'm going to do that and I got a lot of A's that's how a lot of people got their college things are easy things are great so that's what I'm going to do with Jesus one day Greg yeah you already believe yeah but you believe in a spirit I believe in a guiding force of some kind I'm talking about Jesus Christ yeah who I learned about in the history books what would it take for me to believe Jesus Christ is back he's back I don't think it's going to I don't think there's if Jesus comes back there's no",
      "start": 968.96
    },
    {
      "text": "yeah who I learned about in the history books what would it take for me to believe Jesus Christ is back he's back I don't think it's going to I don't think there's if Jesus comes back there's no doubting that's Jesus whole bunch of people just **** dis appeared and now hell on Earth is beginning yeah we have to we have to be clear that that if Jesus returns it's the Rapture and it's fair enough so like that is in the the New Testament and it's re and it's the Book of Revelations it's if I'm ground level Jesus is back and I'm not gone I'm like **** so I've heard I've heard a lot about this this Rapture business I don't think it's ever been clarified to me so why we're he's going to come back and **** things up so Jesus he's going to come back and take all the Believers take all take all of his people with them my all the good people are going away so like it's very it's it's obviously a very Christian thing it's a very Catholic thing like the Rapture and um just like our",
      "start": 1005.0
    },
    {
      "text": "take all of his people with them my all the good people are going away so like it's very it's it's obviously a very Christian thing it's a very Catholic thing like the Rapture and um just like our obsession with Revelations is which Revelations is the **** best book by the way if you like it is so **** up it's the last comes after The Return of the King yeah it is it's Revelations is the last book in the New Testament and it's **** up it's about the end of the world and every and it's it's beautifully written people should like go read it it's just it's absolutely awesome quoted in the movie Ghostbusters so so the Rapture is is basically yeah God coming back God will come again and takes everyone but it's like that all the Believers and so like my mom used to tell me stories you know that her parents probably told her whatever like theoretically like one day Jesus comes back and you're flying the air and you're in an airplane and the Pilot's gone like that yeah and and half the",
      "start": 1042.76
    },
    {
      "text": "that her parents probably told her whatever like theoretically like one day Jesus comes back and you're flying the air and you're in an airplane and the Pilot's gone like that yeah and and half the people on the plane are gone and their plane just crashes well that's the book Left Behind what what Left Behind Left Behind the in incredibly popular book series about the the it's a fiction series okay that's probably where she yes Kirk Cameron did the made for TV movies but yeah is newer yeah yeah yeah it's uh no it's old early but the books are old books are old oh the books are old though books are from early 2000s oh no no she was talking about this way before so straight up thisa so no yeah this is like in the'80s I I used to be obsessed with Revelations like my mom I was so obsessed with Revelations and the Stations of the Cross oh Stations of the Cross that U my mom when I was like really young brought me into talk to the priest like one day which is me",
      "start": 1083.28
    },
    {
      "text": "my mom I was so obsessed with Revelations and the Stations of the Cross oh Stations of the Cross that U my mom when I was like really young brought me into talk to the priest like one day which is me and him and he would he brought me around to each of the stations love to have heard that conversation and I I was it's fascinating the stations across all **** up to but you walk in and there's just a Roman numeral and Jesus is getting like you know **** nailed to a cross like what in the **** is going on here um and why do we have this on every Church uh got our mind everybody got a guilt everybody to come back so yeah Rapture happens and then everyone you know is it's hell like like so okay so that's that creates hell CU they took all the good people so it's just left with a bunch of **** well so I think it's got a timeline on it though it's got It's hell on Earth for a while and demons and Devils is what this is the end was dealing with I was about to say this sounds yeah and",
      "start": 1123.08
    },
    {
      "text": "**** well so I think it's got a timeline on it though it's got It's hell on Earth for a while and demons and Devils is what this is the end was dealing with I was about to say this sounds yeah and so it's all that happening I forget what the timeline is I can slow look it up on how long that lasts but that's the idea is it like longer than a year yeah okay I couldn't deal but it's not a good year you don't want to be down there and that's what the whole Left Behind series is is like that happens and then it's living in the aftermath of it as it starts and the guy who's like the Antichrist that's obviously the big bad dude on Earth he's spoilers for The Left Behind I want toot no I want to read it don't say okay okay I'm going to read it I'm going toload I read B sounds really cool it was it was a cool idea then they made a really bad movie with Kirk Cameron like you were talking about so I mean so to me like that's all it's just it comes Nick it comes back to this for me there's",
      "start": 1159.0
    },
    {
      "text": "it was it was a cool idea then they made a really bad movie with Kirk Cameron like you were talking about so I mean so to me like that's all it's just it comes Nick it comes back to this for me there's something when all right when you go to like the molecular level of like Judeo-Christianity right like there's just everything doesn't make any sense like nothing makes sense and and I can't you know over time in my 29 years like I like I said before I have a huge respect for religious people I have a huge respect for my the Christian faith I consider myself culturally Catholic and my family is very religious um well not everyone but like my you know my dad especially is like very religious man and uh but like I get into we and we agreed 15 years ago to never talk about religion again you know you shake hands on it walk away but like because I you get to the molecular level of you know a science and you understand it like like chemistry and you get to the you know to the molecular level of",
      "start": 1193.96
    },
    {
      "text": "you shake hands on it walk away but like because I you get to the molecular level of you know a science and you understand it like like chemistry and you get to the you know to the molecular level of the atoms and quarks and all this kind of stuff like but when you get to the molecular level of some of humanity like religion everything starts to fall apart nothing makes any sense you know like and and to me I can't I can never run away from that even as a little kid I can never like convince myself that it felt to me like I was lying to myself and I I always felt like that was kind of weird and I didn't want to diminish people's religion and I don't if you're if you have faith out there and you believe more power to you but to me it's like it how like Jesus comes back to earth right in in around the turn of you know BC to AD he dies in 32 AD or whatever um he is the Son of God but God is one in the Trinity so Jesus Is God and the Son of God and the spirit of God all at once he comes",
      "start": 1232.28
    },
    {
      "text": "around the turn of you know BC to AD he dies in 32 AD or whatever um he is the Son of God but God is one in the Trinity so Jesus Is God and the Son of God and the spirit of God all at once he comes back to Earth why then like they they they draw this whole thing out where he has to be not only die but has to be crucified by the Romans why like why why is it so hard just bring everyone to Salvation like if you're like why does it have to be a game you know what I mean that's like why I don't think God exists because it doesn't make **** sense you know well yeah I mean in that sense right like they I mean he gives his life and everything to put you in debt right to indebt to indebt your followers or you to indebt the human race how many Twitter followers would Jesus have oh so more than Ellen more than Ellen his selfie would go bigger I mean right that's the idea he gave his life for you and but his death opened the Gates of Heaven so everyone can go or whatever like that's the thing",
      "start": 1271.2
    },
    {
      "text": "more than Ellen his selfie would go bigger I mean right that's the idea he gave his life for you and but his death opened the Gates of Heaven so everyone can go or whatever like that's the thing that's why on top of original sin right you're also carrying this guilt that this guy died for you it just doesn't it's just I know but it doesn't make any like like just in a philosophical way just like why did just cut to the chase if like why are you letting all these bad people live for thousands of years just **** have the Rapture now you know yeah kill them be done with them and then it's like Free Will and all this stuff but if you're a Calvinist you don't really believe in free will but if you know and then like it just gets into this granular level where like now none of them disagree the Jewish people you know the Jewish faith believes Jesus existed and was a holy man but he's not the Messiah yeah he's not the Son of God you know so then like it splits up that way then it's like",
      "start": 1319.0
    },
    {
      "text": "the Jewish people you know the Jewish faith believes Jesus existed and was a holy man but he's not the Messiah yeah he's not the Son of God you know so then like it splits up that way then it's like Jesus is a holy man in the Muslim faith but he's not the Messiah you know what I mean it's it's like I don't know it just doesn't make any sense if I'm reading this graph right it's the second coming and then a millennium and then last judgment how long is the Millennium thousand years do thousand years yeah the willennium is much shorter is hasn't the willennium come and gone yes it has Circa What Men In Black too yeah something like that when I was when I was young um you know and there's Santa Claus Easter Bunny and tooth fairy and all that stuff like I remember fairly young realizing that these are made up things uhhuh and when I was younger and dumber than I am now slightly hard to believe yeah I know it's crazy especially with what I'm about to say um I always used to I I thought",
      "start": 1355.96
    },
    {
      "text": "these are made up things uhhuh and when I was younger and dumber than I am now slightly hard to believe yeah I know it's crazy especially with what I'm about to say um I always used to I I thought that that Jesus was part of that crew yeah I also thought that Michael Jackson was no way swear to God how was that possible when I was young king of Pop when I was young well so here's the thing so I grew up with um like very close to this one one family and they now we have our next shirt we had we had Santa Claus and Easter Bunny and Jesus and Michael Jackson so christas like um my my close friend's Peruvian and when it'd be Christmas time we'go to his house and like we'd be talking about Santa Claus and he's talking about this little little rat that would come like they I I want to say his name is Pepe but it's probably not Pepe Pepe would come racist a little rat that would bring present and I'm like that's **** stupid and then then I like he was like your shit's **** stupid I'm",
      "start": 1403.6
    },
    {
      "text": "name is Pepe but it's probably not Pepe Pepe would come racist a little rat that would bring present and I'm like that's **** stupid and then then I like he was like your shit's **** stupid I'm like I guess you're right my **** is stupid and then that's kind of the source of realizing that wasn't true and then there's all these other things right and I thought that religion was one of those things right like later I realized that oh you know it's it's not but um then Michael Jackson I thought he was a made I thought it was a madeup thing because I would see Michael Jackson and he was a black man and then all of a sudden I saw him and he was a white woman and it confused me cuz I knew him sing he sounded like a woman he looked like a woman was like five and he was singing the Free Willy song and I was like I don't this and yeah that classic so the I see the thing about it is that's the thing that's so hard to wrap your head around when you know Colin and I talk about all the time",
      "start": 1446.16
    },
    {
      "text": "song and I was like I don't this and yeah that classic so the I see the thing about it is that's the thing that's so hard to wrap your head around when you know Colin and I talk about all the time right that you know raised Catholic or whatever we go to these Catholic schools or whatever and then when people are so quick right now to tear apart Scientology or any other religion or but mainly Scientology these days right Book of Mormon something like that and you sit there and you're like yeah that is silly aliens coming down and and then you start and when you actually turn it around and look objectively at the Christian faith or the Catholic faith huh I guess there's some flaws in that one too you know what I mean like it just this is what bothers me the most right like we Catholicism specifically Rome right like has evolved many times o over the years right and like some people in the comments of last week's video about aliens we like well religion doesn't necessarily or Christianity",
      "start": 1484.76
    },
    {
      "text": "Rome right like has evolved many times o over the years right and like some people in the comments of last week's video about aliens we like well religion doesn't necessarily or Christianity doesn't necessarily disappear because of you know aliens showing up I'm like no it does it does because we have to draw the line somewhere you know because the line the line you know during you know during Galileo and and you know um you know the the Renaissance scientists that you know the enlightenment scientists that were like no the Earth's not at the center of the of you know of the universe it doesn't make any sense but the Bible says that it is you know the Bible also says the Earth was created before the sun which makes no sense because there can't be a planet around with no star holding it into a gravity well right so like there's all these things and they're like no no that's just a that you know that's just metaphor yeah it's just a metaphor it's just a metaphor it's just a metaphor",
      "start": 1525.52
    },
    {
      "text": "into a gravity well right so like there's all these things and they're like no no that's just a that you know that's just metaphor yeah it's just a metaphor it's just a metaphor it's just a metaphor it's just a met like over and over again it's like well then what in this book is real you know because even the part where you hate gay people and can't masturbate right exactly that's the real stuff not the part where you can Stone your wife or any the other stuff yeah it's like it's like adult it's like div divorce and adultery is like is totally totally illegal in the Bible you know in the Old Testament nope not anymore you know like slavery even like it's like you know there was people that justified slavery with the Bible but no that was you know now yeah homosexuality is probably the new battle but it's like eventually you have to draw the line and be like listen there's more wrong in this book than we've ever really examined before maybe we have to look at it is a great manual to",
      "start": 1568.72
    },
    {
      "text": "battle but it's like eventually you have to draw the line and be like listen there's more wrong in this book than we've ever really examined before maybe we have to look at it is a great manual to which to in which to live your life written by people that didn't even agree with each other even the even you know even the gospels **** contradict each other you know and they're all supposed to be together it's not like they were like all you know like all the these you know these four guys specifically that wrote the four you know the four gospels whatever like weren't together they were **** together you know and then but obviously they were written by people afterwards but they don't even agree with each other some of them all tell the same story different ways and different ways and someone will tell this story and someone will tell this story that seemed to have happened at the same time and it's like come on guys yeah you know yeah and so that's like where I'm coming from it's",
      "start": 1603.92
    },
    {
      "text": "someone will tell this story and someone will tell this story that seemed to have happened at the same time and it's like come on guys yeah you know yeah and so that's like where I'm coming from it's like I believe I like religion and I like Faith but I also feel like it holds us back to understanding like the true nature of humanity the true luck of us being here sure and that maybe we shouldn't take our lives for granted because we're like well we'll be in a better place one day maybe we won't be maybe we only have our 80 years of existence well that's the whole thing too of like when people talk about the the book being a metaphor right and the fact that the kingdom of God and the Kingdom of Heaven is Earth you know Heaven is on Earth and so you're supposed to be living a just life now to enjoy the fruits of all this right you know how blessed we are to live and do all these things but that gets lost and gets mistranslated or whatever maybe doesn't get mistranslated people",
      "start": 1636.8
    },
    {
      "text": "life now to enjoy the fruits of all this right you know how blessed we are to live and do all these things but that gets lost and gets mistranslated or whatever maybe doesn't get mist ranslated people interpret how they feel but but yeah I I agree you know it's just like when I think about like the heliocentric theory or like like versus the geocentric theory and like how they were like G to **** kill people over this and they were like going crazy and they're like forget it you're right you know or like how like you know L Martin Luther was the one that went to Rome and was like what are you doing like you have all this money and all this gold this is wrong you know nailed his you know thesis to the to the you know the church door and started basically started protestant ism you know it's like there already were these disagreements everyone's just like kind of sweeping them under the RO me like well everything's kind of still the same but it's not because like over and over again",
      "start": 1670.08
    },
    {
      "text": "it's like there already were these disagreements everyone's just like kind of sweeping them under the RO me like well everything's kind of still the same but it's not because like over and over again like you check things off just like you know it insinuates the seven days of Genesis and then the seven days are metaphors but then maybe they're not and then maybe it's like but then things are made out of order and it doesn't make any sense woman comes from man's rib no no no no that doesn't make any sense yeah we we got we got a little bit of a long lineage of proof against that one you know what I mean like we know where women come from where do they come from babies I was going to say the kitchen but Jes Christ ni wow I'm joking I'm but who built the kitchen God yes God now you want to mark that one are we taking that one out no it's so I don't know to me it's like there's just all these there's all these philosophical issues like that and and and I can't be intellectually honest",
      "start": 1707.08
    },
    {
      "text": "mark that one are we taking that one out no it's so I don't know to me it's like there's just all these there's all these philosophical issues like that and and and I can't be intellectually honest myself and think that this is real you know like like I said God bless you if and more power to you and I respect religion and I will always stand up for the Catholic faith as a culturally Catholic person I'm Italian and Irish it's very Catholic but um yeah it's just I so proof I need to see and seeing is believing but the New Testament says that you you know blessed are those who believed and did not see yeah well that's that's the Brilliance of all the religions that put that in there is that it's a fail safe right yeah you can't sit there and be like well I need to see something well no the faith is it's based on you not seeing that makes sense wait so then if you saw it then it doesn't exist no your chosen one you saw the toast that had Maria burned into it it's but think about it this",
      "start": 1750.44
    },
    {
      "text": "faith is it's based on you not seeing that makes sense wait so then if you saw it then it doesn't exist no your chosen one you saw the toast that had Maria burned into it it's but think about it this way like Tim makes a a good point like think about Lazarus right like people saw him coming out of the Grave so everyone there that knew and then the people they told and maybe just a few Generations were like that was **** up like that dude was dead you know and like he like came out of the grave and he was alive or when Jesus cast The Net into the waters and pulls it back and there's you know all the fish and turning water in the wine like yeah exactly it's like Jesus so like those are the kinds of things that people did see that like apparently did see that and again we've said Josephus and Roman historians have talked about Jesus Jesus existed there's no doubt about that but maybe he was maybe like we don't often think about like he like I don't want to say cultist or anything like",
      "start": 1792.72
    },
    {
      "text": "and Roman historians have talked about Jesus Jesus existed there's no doubt about that but maybe he was maybe like we don't often think about like he like I don't want to say cultist or anything like that but like he might have just been delusional you know like too like there's totally a possibility of that plus you have Mary Magdalene who is probably his wife which the Bible would never ever ever touch in a million years you know and then you have his mom Mary and Joseph who really only alluded to a few times the Virgin birth and all this kind offf it's just like what the **** this is so complicated just come back you know this is so complicated it's too complicated it's too complicated I appreciate it because it's fascinating I've read the Bible I take classes on the Bible I know the Bible but I study it as you know a piece of fiction you know and I took a great class A couple classes in college and we wrote we read a book called uh which is a great book it's a short book too",
      "start": 1834.04
    },
    {
      "text": "the Bible but I study it as you know a piece of fiction you know and I took a great class A couple classes in college and we wrote we read a book called uh which is a great book it's a short book too called you know who wrote the Bible and it's it's it's split into four parts for the four gospels and it ties all the who they might think wrote it and when they wrote it and stuff like that it's fascinating stuff yeah but it's for Scholars now not theologians to figure everything out in my opinion interesting I like that yeah also real quick yeah the thing that bothers me the most Catholic faith has books in the Bible that are not accepted by other faiths and vice versa we have the Book of Ruth for instance which is considered part of the New Testament that is then not considered new so like there's all this like I don't know doesn't make s I'm done okay so we're done with your topic that's it all I'll you out I always talk about it I always see little signs and feel the presence of God",
      "start": 1874.12
    },
    {
      "text": "there's all this like I don't know doesn't make s I'm done okay so we're done with your topic that's it all I'll you out I always talk about it I always see little signs and feel the presence of God and that's how I know like when you see Portillo yeah only you see God's eyes in Portillo only a Only a God could make something this perfect look at him aerodynamic look at him low to the ground able to bounce back from any problem got his own built-in spoiler on the end there Colin what's your topic first of all I want to read this real quick this tag from Eagle Rare oh please do remember drinking Eagle Rare it's great bourbon it's a little expensive but you should drink it it's good it says lead a rare life courage leadership survival heroism devotion character I that character to live by got a throwing character so I'm going to need a drink for this one col what before we start what would the what would like the five or four words be that just describe you heroisms definitely would",
      "start": 1914.88
    },
    {
      "text": "got a throwing character so I'm going to need a drink for this one col what before we start what would the what would like the five or four words be that just describe you heroisms definitely would heroism be in there would do those all apply let let me read those again let's go on the table here courage yeah oh yeah he's courageous leadership sure survival oh yeah why is survival that's the one that stands that when you want to survive you drink whiskey whiskey cuz that's the one thing you'd eat out in the wild to survive all right sorry Colin no it's okay what is your topic so I want to talk to uh real quick and and I'm just going to come out and say it um a decision was made the last few days that really disgruntled me and made me state that Star Wars is officially dead to me officially dead dead to me how could Star Wars be dead to you because they went ahead Disney went ahead and took the expanded universe and said that it's all not canon anymore but hasn't it always been that",
      "start": 1962.24
    },
    {
      "text": "dead dead to me how could Star Wars be dead to you because they went ahead Disney went ahead and took the expanded universe and said that it's all not canon anymore but hasn't it always been that though no no it certainly hasn't a lot a lot of people have been trying to say that that they've been saying this but that's **** it's always been part of the cannon oh most of it not all of it some of it hasn't been and they've tried to work it in or whatever but this is officially stating that anything that happened in the expanded universe mostly in between Empire and Jedi and then after Jedi um is no longer part of the story and this frees up the writers of course of JJ Abrams Trilogy to write what they want but it bothers me not in the sense that they can't do this they can do whatever they want you know a lot people would be like you sound awful entitled and I'm like no no no no because I'm not saying that they can't do this if they want to do that that's fine I'm just saying I'm",
      "start": 2006.6
    },
    {
      "text": "they want you know a lot people would be like you sound awful entitled and I'm like no no no no because I'm not saying that they can't do this if they want to do that that's fine I'm just saying I'm not giving you another scent of my money ever ever and that the hundreds of dollars I spent on that EU **** when I was a kid all the time I read it and studied and all that stuff wasting my **** time you got a higher education than that didn't you you're a but it's useless I basically had a bachelor's degree in Star Wars expanded universe as a kid self-taught in addition to my degree from North Eastern and I only have one degree and it's from North Eastern because this other **** thing ended up being you're literally half a man right now I ended up going I ended up going to a bu mail Technical Institute you know no no here here's my thing on that one though don't you feel like that's a little bit of a relief though because now they can go forward with Lawrence Kasdan as a writer and write",
      "start": 2050.76
    },
    {
      "text": "Institute you know no no here here's my thing on that one though don't you feel like that's a little bit of a relief though because now they can go forward with Lawrence Kasdan as a writer and write something good they don't have to adhere to metac cloran well I guess they actually still do don't Lucas wrote that and that is Canon and so was Jar Jar Binks yes Jar Jar Binks is Canon Prince Shor not canon Dash Rendar not canon Mara Jade not canon Gror Thon not canon Jar Jar Binks and those racist Asian **** Trade Federation people Canon N Gun let me ask you let me ask you a question so so like flash forward to like s months from now right and everyone's like when you're sitting in the **** theater watching it no you get into work and everyone goes like everyone goes dude you have you haven't seen it yet you got to come see it this what always happens at work everyone's like dude you haven't and they act like the thing came out 18 months ago and you're just now catching up even you're",
      "start": 2087.6
    },
    {
      "text": "seen it yet you got to come see it this what always happens at work everyone's like dude you haven't and they act like the thing came out 18 months ago and you're just now catching up even you're the one that does this the trailer just dropped so literally so literally you walk in and and Colin someone goes Colin you got to come see it this is the first Star Wars Episode 7 teaser trailer right and it gets the no it doesn't doesn't do that right whatever and it's going to be the Disney house with the thing it gets so it's the really cool Lucas emblem then right cuz that's still available thing um no so then it starts right it's like and you hear some cool sort of voice and it's like the Empire's wake and then the next thing you see is Jar Jar Binks what do you do I kill myself and everyone around me like it's a me I'm a Jar Jar BS you're Miss it'll start with some something alluding to it's I never thought I'd see you again Skywalker and then like it'll start with the crawl of the ****",
      "start": 2128.32
    },
    {
      "text": "around me like it's a me I'm a Jar Jar BS you're Miss it'll start with some something alluding to it's I never thought I'd see you again Skywalker and then like it'll start with the crawl of the **** story no he's talking about the trailer trailer the crawl we have 60 seconds to make an impression here's text that would be more interesting at least it's the **** story so we can see where all I don't think they're going to start I don't think they're going to show they'll show like one or two that'll be later in the trailer they'll show H that'll be the end yeah oh yeah at the end it'll be like the the door opens and it's all three of them there sucking look at all old and **** this is the other thing sucking the guts guys we're the Star Wars sucking the guts guys we're the Jedi oh Leia God bless God I love Carrie Fisher God bless her in this movie it's going to be amazing because so but that's not even my problem I'm glad they got Luke and Leia and Han they're in the expanded",
      "start": 2175.96
    },
    {
      "text": "God bless God I love Carrie Fisher God bless her in this movie it's going to be amazing because so but that's not even my problem I'm glad they got Luke and Leia and Han they're in the expanded universe right like and all these things have happened in the expanded universe what really bothers me is that not all these stories are good I haven't read them all and even the ones that I've read weren't good but there's some really really good ones so good that George Lucas **** stole from them like Coruscant the imperial capital was created by Timothy Zahn in a book what if he what if they now steals what if they steal good **** from it and like make something new that is the good part yeah but it's kind of messed up right because if you're going to take Source material that Source should be Canon right like it's it's kind of it's kind of messed up if iote like the Timothy Zahn books were amazing awesome the Empire there was a huge uh you know backlash when they said they wouldn't be doing",
      "start": 2217.52
    },
    {
      "text": "Canon right like it's it's kind of it's kind of messed up if iote like the Timothy Zahn books were amazing awesome the Empire there was a huge uh you know backlash when they said they wouldn't be doing those right like I remember Gios was like I think he was pretty pissed off about that because that's what everyone thought they would do they would go to the Mara Jade story they would do the the the grand animal th animal Thrawn which is badass right are you familiar with these yeah um but you know if you're going to develop those cool characters you got to give a little credit to the author that's doing it and I think to me that credit is you make a Canon like it has to be Canon like if the character was originated in a work that's not canon it's kind of it gets murky you know that's my thought it's all **** up what do you the best part is that there's no redeeming Boba Fett story lines anymore so I don't have to put up with **** that this guy was an interesting character just a ****",
      "start": 2250.28
    },
    {
      "text": "it's all **** up what do you the best part is that there's no redeeming Boba Fett story lines anymore so I don't have to put up with **** that this guy was an interesting character just a **** **** I know but he was a **** in the movies and then you always called in these **** little asides that happened in the back water **** I even know where oh he did this thing no he's just an idiot with a jetpack That Couldn't fly he couldn't catch any he had the Mandalorian armor and he's proba the stock so dead he probably could have surved CL and he's dead he could have survived I think like in in I think it's Tales From Jabba's Palace which was released in the mid 90s they tell Boba Fett's story I think about how he gets out of the Sarlacc pit so like how he blows it up or something he might commit suicide in it I don't I don't think so I think that's he like gets out of it I probably would have uh taken a thermal nuclear detonator out and just nuked myself cuz want to be slowly",
      "start": 2288.36
    },
    {
      "text": "he might commit suicide in it I don't I don't think so I think that's he like gets out of it I probably would have uh taken a thermal nuclear detonator out and just nuked myself cuz want to be slowly you know digested in the Sarlacc pit for the next thousand years did you guys see the uh the Robot Chicken Star Wars specials yeah yes I have I love them I love them a lot and how they deal with Boba I think it's just great they're not canon either damn it no but the big so the biggest thing to me is that like it's the EU stuff like post Jedi is disappointing that that's not like a lot of that's not Cannon but actually this brings Shadows of the Empire in into into trouble to and Shadows of the Empire is **** awesome really really good I thought he officially was like no this is Cannon did he never do that they said that everything that is not from Clone Wars or one other show Rebels or the six movies are not Cannon anymore they're not canon too bad so like so for people that don't",
      "start": 2327.92
    },
    {
      "text": "did he never do that they said that everything that is not from Clone Wars or one other show Rebels or the six movies are not Cannon anymore they're not canon too bad so like so for people that don't know Shadows the Empire was released in the in like 96 or 97 and it's the story between Empire and Jedi and it's awesome it's really really good it introduces like a bunch of new characters and explains things like about how Leia becomes the bounty hunter in J abba's Palace and Stu like that yeah like like that's all explained in the book Prince Shor and in Dash Rendar um who was like a little bit of a poor man's Han Solo yeah he was a poor man's Han Solo but he had that cool ship um what was it called remember what was called yeah I can see it in my head it had it looks a cool name yeah it looks kind of like a B-Wing hey look it up right that's what you got the one with the yeah the thing the B-Wing was the one with the like the one yeah that kind of looked like that I always thought the",
      "start": 2366.2
    },
    {
      "text": "looks kind of like a B-Wing hey look it up right that's what you got the one with the yeah the thing the B-Wing was the one with the like the one yeah that kind of looked like that I always thought the expanded universe stuff like wasn't Canon that it was expanded see I could have sworn I could have also sworn that it was always like the only thing that was Canon was the movies and the TV shows that was it no so and this is the debate that comes back I looked this up um what Dash Rendar B-Wing plane didn't bring me any like sorry Nick I can't help you with your **** **** that do something other than play a video game for once in your true story I Mike a Seph used to work with this at IGN Colin and he used to use the gamer tags and stuff of Dash Rendar whatever and I thought for I thought for the longest time I thought it was reindeer that he like I was like is that like short for Dasher Dash yeah Dasher the reindeer but it was some stupid madeup guy who doesn't even exist anymore",
      "start": 2405.0
    },
    {
      "text": "for the longest time I thought it was reindeer that he like I was like is that like short for Dasher Dash yeah Dasher the reindeer but it was some stupid madeup guy who doesn't even exist anymore whose existence is I don't think he ever now now he never really existed no I'm almost positive that like they went to lengths to explain that expanded universe was not canon that it was just these movies and stuff and that it was expanded universe no similar to it says that um this is Wikipedia um on April 28th April or a April this is in this is in European dating and I don't like it very much April over here in April April 20th 2014 following the acquisition of Star Wars license by Disney was announced that all previously released expanded universe content would henceforth be considered an alternate universe referred to as Legends a Lucas film story group moving forward will ensure that all new Comics books games and other media are considered Cannon and valid to the story being told in",
      "start": 2448.28
    },
    {
      "text": "universe referred to as Legends a Lucas film story group moving forward will ensure that all new Comics books games and other media are considered Cannon and valid to the story being told in the films so the so I think that there was like there was people that worked at Lucas SS that were just their whole job was to keep the expanded universe not conflicting with it itself and then the movies so they would if that if it was never considered Canon they wouldn't have given a **** about what's the big uh they have some sort of big Anthology something Library some big thing they keep the records in what that what's that thing called it's holocron the holocron yeah isn't that a cool thing and there's people that are a cool thing that's a cool name what do you do I'm The Keeper of the holocron and there's people there like that they just they just keep that **** straight so it doesn't conflict with the movies or what George Lucas wants or even though that never stopped George Lucas with",
      "start": 2492.92
    },
    {
      "text": "and there's people there like that they just they just keep that **** straight so it doesn't conflict with the movies or what George Lucas wants or even though that never stopped George Lucas with Boba Fett story for instance in Episode two but we we I guess we saw shades of them doing this in episod in Episode two because they ruined the backstory Boba Fett in that movie and the Stormtroopers um by I thought I thought that there was some Theory theories that the Boba Fett in the latter three or the later three movies sorry the original Three movies was a different Boba Fett than the one we saw there no that was a bunch of hurt Fanboys coming up with stories to try to salvage a character that was never cool and try to give him a shot to be cool again two things great hey I've got this hey I've got this gun in this jetp pack and I got this guy oh I'm dead **** **** have you ever tried using a jetp pack they're exceedingly hot The Rocketeer did it pretty well well not at first",
      "start": 2528.88
    },
    {
      "text": "hey I've got this gun in this jetp pack and I got this guy oh I'm dead **** **** have you ever tried using a jetp pack they're exceedingly hot The Rocketeer did it pretty well well not at first remember when he pokes through the plane he's like I'm here so you're saying that was Boba Fett's first outing I mean maybe he just didn't brush it off I mean he's traveling in space he's a jet there space uh it's the outrider what's his ship's name the out rder right I had it I bought it badass name they sold they sold it here's my and I'll be serious for a changing this topic this is where I think it hurts you not being a comic book fan cuz the comic book universes are all shattered I've read so many Superman stories that don't connect at all are not in the official DC especially not now in the new 52 Cannon but you enjoy the experience and what you had with it great stuff great stories you still had great stories with old Dash reindeer running around fighting old bot dried whatever bot",
      "start": 2568.04
    },
    {
      "text": "the new 52 Cannon but you enjoy the experience and what you had with it great stuff great stories you still had great stories with old Dash reindeer running around fighting old bot dried whatever bot I'm with call he was devious bot ride was **** bad dude I think that I think that the botch ride is that everyone I just Jimmer t r y that's what your ship would be called bide bot ride bot ride not bot bot ride like B yeah like like a bot like a robot bot ride he's rtd's friend that's a badass name for a **** right my thing I'm with Colin on this one here's why you you want to the part of the power of Star Wars is the vastness of the universe right it's all the crazy things and the possibilities that can happen and to take 90% of those things and just immediately take them off the table it's it's kind of a let down they door to some of it being they said that they might take some of them back exactly which I think is good it's like let's take the right parts not the dumb **** yeah",
      "start": 2608.4
    },
    {
      "text": "it's it's kind of a let down they door to some of it being they said that they might take some of them back exactly which I think is good it's like let's take the right parts not the dumb **** yeah but the problem is the right parts are already there I mean the the wrong parts are already there right and the thing that they should take back is the original Three movies like that well yeah but that's not going to happen or one two and three rather not the original Three the original things are amazing um the first three but that's the problem like those are the things that everyone has a problem with when other people were allowed to come in and rewrite store or write stories about Star Wars they were **** awesome because it wasn't Lucas it was people that were like I care about this awesome they are but but they didn't happen they're not meaning meaningful I mean that's what I'm saying like it's like Comics but it's not because you know obviously every comic bookville you know",
      "start": 2658.24
    },
    {
      "text": "awesome they are but but they didn't happen they're not meaning meaningful I mean that's what I'm saying like it's like Comics but it's not because you know obviously every comic bookville you know every comic book has its origin and stuff like that but like really the events of New Hope Empire and Jedi are like you can't do that over and over again like that is the event right like the Death Star Luke finding Obi-Wan all that kind of stuff Luke's father with like you can't you like you can't retell that over and over again that is it like that's what Star Wars all revolves around the like the stories of those for you know Hoth and Endor and all that kind of stuff and I don't know to me it's just like these are this is one of the few things I really care about like in a huge nerdy way and I was really disappointed when I read that because they can do what they want they own it and if they want to do that that's fine but I am not going to give them any more money I gave I I used to be",
      "start": 2693.8
    },
    {
      "text": "I was really disappointed when I read that because they can do what they want, they own it, and if they want to do that that's fine, but I am not going to give them any more money. I gave, I, I used to be obsessed with the Expanded Universe when I was a kid because that's all we had. And a lot of people forget about that, like before the special editions came out in'97 and then obviously in'99, we like the Expanded Universe is what kept Star Wars alive and it's what kept Star Wars relevant to people. And people like me, the ones who bought the books, were the ones that were keeping Star Wars alive before the films came out, you know? And suddenly you're just like, ah, you know, we don't, we don't care about any of that stuff you bought or read or anything like that and all the toys you bought and this, that, the other thing, it doesn't matter because none of it, obviously none of it ever happened, none of it's real. But it's like saying like I, it's me, DAV, it's fan fiction now, now it's just **** fanfiction.",
      "start": 2732.12
    },
    {
      "text": "the other thing, it doesn't matter because none of it, obviously none of it ever happened, none of it's real. But it's like saying like I, it's me, DAV, it's fan fiction now, now it's just **** fanfiction. It's not like we, it used to be cool because it seemed like it was endorsed, it was endorsed, you know? Yeah, like Lucas Films endorsed these books and said like these are Canon and this is the way things went down. And we even borrowed certain things from the books again, like the, like Coruscant, a huge setting in one, two, and three , and that's from a Timothy Zahn book, you know? Like he didn't, Lucas didn't make that up, you know? That's one of the only cool things from the prequels, ironically. Real quick question, is Steven Zahn related to Timothy Zahn? No, Timothy Zahn. Yeah, who's Timothy, Steven Zahn related, timoth, who's Steven Zahn? That sounds familiar. Saving Silverman, he's one of the actors in that. Oh, also in That Thing You Do. Oh, look it up. Thank you. That's a better reference. There you go. So that's it. I just,",
      "start": 2764.44
    },
    {
      "text": "who's Steven Zahn? That sounds familiar. Saving Silverman, he's one of the actors in that. Oh, also in That Thing You Do. Oh, look it up. Thank you. That's a better reference. There you go. So that's it. I just wanted to kind of, you know, I just had to kind of, kind of talk about that. So I'm not spending a dollar on, on Star Wars ever again. And, uh, I, I will not be seeing the movies in the theater. If it's on TV, wait one day, you know, in the future and it's on, no, might me, I'll watch it, but I'm not, I'm going to go out of my way to not see it. And that's just my, my little, he's not going to go to the theater, he won't go to the theater see it. He doesn't, he talked forever about Red Dawn remake and we never even made it out to the theater to see that. He ain't gonna go see any of this. That's a slightly different, this news really, it excites me actually . Like I like the fact that now they, they are officially saying everything henceforth is Canon. So it's like, okay, cool, now this is a cool jumping in point to like get,",
      "start": 2803.68
    },
    {
      "text": "news really, it excites me actually. Like I like the fact that now they, they are officially saying everything henceforth is Canon. So it's like, okay, cool, now this is a cool jumping in point to like get into all these things and whatever. It's no longer expanded, I mean, I guess it is still the Expanded Universe, like from now on Comics, books, all these things are going to be telling the same story and that's cool. I like that cuz like before it's, it wasn't like that. It was like there was all these different little things going on. It was like, I don't know which the **** Dark Horse Comics or the these other **** like, should I read these ? Do these even have anything to do with the characters I give a, yeah, but I didn't, I didn't, I, I didn't have that that luxury, right? Like I read them all, I bought those books and I don't know, it's just disappointing to me , especially because they had the choice of saying like, like God, go back and redo the **** one, two, and three, like go back to what's wrong, like,",
      "start": 2846.84
    },
    {
      "text": "books and I don't know, it's just disappointing to me, especially because they had the choice of saying like , like God, go back and redo the **** one, two, and three, like go back to what's wrong, like everyone hates those movies, everyone **** hates those movies. Not find people that hate Heir to the Empire or Shadows of the Empire. People would like those books, you know? Like Shadows was amazing, it was a really good book, really good book. Yeah, it's excellent. I read it in one day. I remember I think I read, yeah, I think it was one of those books it was in like seventh or eighth grade when devoured in like two days. It was awesome. Like Goosebumps, I hear what you're saying and you're right, like it's cool now that like, yeah, from this point forward everything we write and everything we put out is Star Wars cannon, but you know, for OG theying, yeah, that's what they said like to make or is it really just the movies that they're putting no, they're saying like everything henceforth will be years.",
      "start": 2887.44
    },
    {
      "text": "is Star Wars cannon, but you know, for OG theying, yeah, that's what they said like to make or is it really just the movies that they're putting no, they're saying like everything henceforth will be years. They'll blank it out of existence and you'll be like, I warned you when they came from my Boba Fett and Bot Rider no one stood up. I don't know. I think it's, I think it's stupid and and a lot I the good thing I know is that my, my instinct when I read that I was like, that's ****, you know, I'm like, that really makes me mad and I looked it up and everyone's mad. So it's not, so it's not like I'm, I'm the, I'm the only one that's mad. You're not the only Star Wars nerd who's mad. All the Star Wars nerds are mad. Not all of them. I'm sure a lot of Star Wars fans are happy about that too, but I think older Star Wars fans that really were into the lore of the series before the special editions came out so in the early mid before they started blinking things out of the actual movies, right? Exactly, Theo,",
      "start": 2922.4
    },
    {
      "text": "Star Wars fans that really were into the lore of the series before the special editions came out so in the early mid before they started blinking things out of the actual movies, right? Exactly, Theo shoots first. Yeah, I don't understand though, like with, with the old Expanded Universe, like how could that have been Canon when there was so much of it like the video games all like not only Mak sense so on top of each other. Yeah, more I mean like Dark Forces does, you know, like Kotor would make sense like, like the good ones, the good games, X-Wing versus TIE Fighter. I get I mean like, like the game Dark Forces has like a real story, you know, like those kinds of games they, they did make sense . Obviously there was like weird games like Yoda stories, remember that that weird it was like a procedurally generated garbage game, obviously that had no yeah, it's just I don't know, it's just it's just disappointing because I was really into those books and into those stories. I felt like I knew the characters.",
      "start": 2957.84
    },
    {
      "text": "garbage game, obviously that had no yeah, it's just I don't know, it's just it's just disappointing because I was really into those books and into those stories. I felt like I knew the characters like even though like you see IG-88 for five seconds in the movie, but there's like a lot of story about IG-88, but now like and that makes it interesting in his relationship to Boba Fett and all that kind of stuff or Zuckuss's relation to 4-LOM, you know, and all that kind I like that kind of stuff. I thought it was interesting. I like reading books so you know, it's dis point they're saying like nah, like you just wasted all your time. I could been reading other cooler **** that you know, but you enjoyed your time and for years he had something to talk about. Now I don't, now it all doesn't matter. Well you Al you turned on him, you hated them before this. So that's true. Yeah, so it's like they saw what you were doing and like what I did, but like this is this was the turning point for me where I was like that,",
      "start": 2997.72
    },
    {
      "text": "you turned on him, you hated them before this. So that's true. Yeah, so it's like they saw what you were doing and like what I did, but like this is this was the turning point for me where I was like that the prequels are **** terrible, man. Like they were so bad and you know, they hurt me like on a personal level and I think they heard a lot of Star Wars fans on a personal level where they're like, man, this is bad, you know, like this is bad, bad, bad ****. Um, but like they could have wrecked IFI that situation somehow, instead they're saying like middle choran that's the real **** man. How awesome is it going to be just stick with me. How awesome is it going to be to have Luke Skywalker mention midi-chlorians now and have that be Canon. Like that's real **** now. My God, that's, that's actually how the trailer is going to open. Metac, it's been a long time, Skywalker. What's up? Hold on, I got to check my midi-chlorian Bot Rider, take this. I, I, I, I really, I'm interested to see like if the new movie if people,",
      "start": 3031.52
    },
    {
      "text": "is going to open. Metac, it's been a long time, Skywalker. What's up? Hold on, I got to check my midi-chlorian Bot Rider, take this. I, I, I, I really, I'm interested to see like if the new movie if people think the new movies are good. I think it'll have the same Arc as episode one where everyone thought, everyone, if you remember correctly 1999, everyone thought episode one was good for a few days. I don't know if you guys remember that. Like it came out maybe a few weeks, especially because we didn't have this internet, like this hyper internet culture where I like I remember going to see him like I like that and then I saw it again and I'm like, I don't know, like that I don't know about this. And then I went and saw it again and I was like, oh, oh no, is he talking into a Gillette lady's razor? And then and then and then as the years went on I was like, oh man, this is really bad. And then episode two came out, no one had any expectations. Episode three was like no one had any expectations. There were some people,",
      "start": 3070.84
    },
    {
      "text": "and then as the years went on I was like, oh man, this is really bad. And then episode two came out, no one had any expectations. Episode three was like no one had any expectations. There were some people that were like, this is going to be great. Yeah, I enjoy three was good. Well, I, I like as a guy who never read any of these goddamn stupid Fanfictions, I thought it was fine. I only knew the movies and I had, I thought finally shit's happen in it. Three stupid ****, I have the high high ground, I Lop off every limb except one, but whatever, robots. So that's where I say I'm, I'm done. If you guys don't have any anything else to put into this particular, I have to chime in that Steve Zahn was born in Marshall, Minnesota, the son of Zelda who worked for the YMCA and Carl Edwards on a retired Missouri Lutheran Pastor. Now related to whatever his facebooth is, Timothy Zahn still alive, probably he probably super pissed off right now. You think he is? He probably is. He probably is. He so much money or no, Disney Abrams all,",
      "start": 3106.68
    },
    {
      "text": "now related to whatever his facebooth is, Timothy Zahn still alive, probably he probably super pissed off right now. You think he is? He probably is. He probably is. He so much money or no, Disney Abrams all right, good topic. I'll go next. My topic is also controversial from this past week, Comixology, an app to read Comics. Colin, don't fall asleep yet. I'm getting to the part you'll care about. Uh, I've been a big supporter of Comics Aly. It was something I'd been calling for a long time. It's the reason I bought my iPad to read Comics digitally, not to have to collect Comics, to be happy reading them digitally, spending way too much money on Comics. Tim, you do this as well. Nick, you've just begun. I have, I've just ventured into that. They got bought by Amazon not too long ago. Last month. M big news. Oh, cool. They got bought by Amazon. Everybody's like Amazon's going to ruin them and we're all like n it'll be fun. Uh, they release a new, they close their old app. Yeah, it's not even an update by the way. No, it's not,",
      "start": 3146.44
    },
    {
      "text": "got bought by Amazon. Everybody's like Amazon's going to ruin them and we're all like n it'll be fun. Uh, they release a new, they close their old app. Yeah, it's not even an update by the way. No, it's not even an update. They close their old app, create a new app, you have to go into and log into and the big thing is that there is no store anymore inside it on the on the digital iOS front or the Android front for that part. You have to go to the Comixology website, which is always exists where you can read comics online as well, but now you have to go there, buy your comics on the web and then they'll appear in your reader. You have to go download them in your reader . Kindle, yes, which Kindle used to be able to buy books in as well. Your Kindle laugh on your iPad, you used to be able to buy your books then when when was that? That was long time ago. Yeah, exactly. But never had cuz this is exact like so this happens, people flip the **** out. Saturday I woke up and the Twitter was a flame with people,",
      "start": 3200.8
    },
    {
      "text": "then when when was that? That was long time ago. Yeah, exactly. But never had cuz this is exact like so this happens, people flip the **** out. Saturday I woke up and the Twitter was a flame with people freaking out . This is the worst thing ever, they've ruined Comics, they've ruined this and my initial reaction was, yeah, this sucks. This is a, it's a hurdle, right? The fact that I'm reading comics and I want to read the next comic but I have to go to the website or whatever blah blah blah. But then you think about it and really it's just the, you know, Screw job, no offense of the or not even the screw job, but like how the inapp purchases work that 30% of an inapp purchase needs to go to Apple, right? So for Amazon to come in, sell things through Kindle, sell through Comixology, now it makes sense for them to force you to this and at first again, yeah, like I get the KNE your re action of but I won't be able I mean like the, you know, the guy who wrote Punisher and did all this stuff, created Punisher, he's,",
      "start": 3236.2
    },
    {
      "text": "to force you to this and at first again, yeah, like I get the KNE your re action of but I won't be able I mean like the, you know, the guy who wrote Punisher and did all this stuff, created Punisher, he's had had like a long diet Tri, not diet tribe, but a long thesis on why this is horrible, right? And all these reasons we'll get to them. But when I stopped to actually think about it, my iPad is Wi-Fi only, not 3G. So anytime I'm around reading comics , I'm usually on or computers within arm reach, right? When new Comics come out on Wednesday, I just have to change my mindset of well that I'll get them when I get home to. I'll check it out on a lunch break and see what I want to buy this week and click click click and be done. Also Comixology a few months ago before the Amazon acquisition introduced subscriptions where I love Invincible and I love Walking Dead and I love a bunch of other the series. So I just click a button and I'm subscribed now. So I Auto buy those every time they come out every Wednesday,",
      "start": 3279.68
    },
    {
      "text": "where I love Invincible and I love Walking Dead and I love a bunch of other the series. So I just click a button and I'm subscribed now. So I Auto buy those every time they come out every Wednesday that they come out of the month. So for me not that much changes. At first sounds horrible, whatever, for me personally not that much changes, but I know other people are freaking out. Are either of you freaking out? Uh, so that makes a lot of sense now because I thought I was going crazy because I, I opened up my Comixology app a couple days ago and couldn't and it told me to download the other one. I was like, that's weird, it's not an update, normally it's just an update. So now I've got two Comixology apps on my phone and I just finished finished Invincible 107 and I wanted to get, I wanted I was like, okay, I have to know what happens next. I'm going to buy, uh, I'm just going to really quickly, you know, it's linked to my, my iTunes account, just going to buy 8, n, and 10, right? And, uh, I could not figure out why it,",
      "start": 3321.84
    },
    {
      "text": "to know what happens next. I'm going to buy, uh, I'm just going to really quickly, you know, it's linked to my, my iTunes account, just going to buy 8, n, and 10, right? And, uh , I could not figure out why it would not let me purchase and I, I logged in online, started a Comixology account, did it doesn't ask me for any credit card information and I gave up. I was like, I'm going I give up. I don't, this is too much work to get three comic books where it, it shouldn't be that hard, right? I think it's actually worth the 30% for the ease of use that by the way, I dropped when they had a sale, I dropped $40 on comic books. I bought like 40 issues just ke I just marathoned through these things. Why? Cuz it's you don't stop to think, right? You just go, I've done that too. Oh, I got to get the next one. Oh, I gotta and the only thing that stopped me was that I was literally falling asleep and I'm like, uh, okay, I, I'll table this until tomorrow. So I think it's going to hurt their business considerably in the short term. I'm,",
      "start": 3357.36
    },
    {
      "text": "thing that stopped me was that I was literally falling asleep and I'm like, uh, okay, I, I'll table this until tomorrow. So I think it's going to hurt their business considerably in the short term. I'm sure Amazon has a plan cuz if there's one company that can go out there and actually take on Apple, it's Amazon. They're crushing, well they've already been doing with Kindle. I mean this isn't like something crazy. This is what you're talking about earlyer. Yeah, mean I, I've had the Kindle app on my iPad since 2009 and I've never had it any other way than me having to go to a site oneclick order send it to Andrew Jackson. That's the name of my iPad and then I love it. I love it and then you know and then it's loads up. I think my wife has a Kindle Fire and I think she can just buy stuff directly from her Kindle. Well yeah, you can do that. We're talking about the app, the Kindle app app is the same thing, it's run by Amazon. Yeah, Ian to me so I'm not a comic reader, you know, whatever. I didn't even know,",
      "start": 3404.96
    },
    {
      "text": "her Kindle. Well yeah, you can do that. We're talking about the app, the Kindle app app is the same thing, it's run by Amazon. Yeah, Ian to me so I'm not a comic reader, you know, whatever. I didn't even know Comixology was purchased by anyone. Uh, two things strike me as interesting. First is that Amazon and Google are the two companies in the in the world that no one will ever admit does anything wrong because everyone's obsessed with them. So it's interesting to see, you know, Google does stupid **** all the time, no one will ever say a word about it. It was interesting for me to see people get mad at Amazon because I've never seen that before, you know, like like everyone loves Amazon, everyone when Amazon Prime went up, everyone's like, ah, it's the perfect that's great, who cares which I agree because Amazon Prime is awesome. Um, so that was that was the first thing I struck me. I'm like, wow, people are being critical Amazon, this is a new frontier here on the internet. The second thing I was thinking was, um,",
      "start": 3442.04
    },
    {
      "text": "Prime is awesome. Um, so that was that was the first thing I struck me. I'm like, wow, people are being critical Amazon, this is a new frontier here on the internet. The second thing I was thinking was, um, this makes perfect sense. Why the **** would Amazon want to give 30% of their revenue from from this a thing they probably spent tens of millions of dollars on when they can just cut them out completely. That makes perfect sense to me to. I want to point out this that on the Android app you can still pay the reader with goog with uh PayPal. Yeah, PayPal only but jumping back to what I was saying earlier, it's Jerry Conway, thanks for reloading that while I was reading it. Uh, co-creator The Punisher, he had this whole thing put up about how and the first line is and so as we could have predicted Amazon Rex Comixology and it's this whole thing and what he brings up is interesting to the fact that he loves comic shops but they're dying, right? And that this is Comixology was the perfect portal to get people,",
      "start": 3479.84
    },
    {
      "text": "Rex Comixology and it's this whole thing and what he brings up is interesting to the fact that he loves comic shops but they're dying, right? And that this is Comixology was the perfect portal to get people into Comics making Split Second PCH, you know what you're talking about. Yeah, I'll buy another one. Yeah, I'll buy another one. Yeah, I'll buy another one. I still think that exists. I don't think we're giving readers enough credit, you know? I mean granted it's another step to jump through, but I still think it is you buy no, it's not another step to jump through, it's like three steps to jump no, it's cuz you're stupid and don't remember your your password for Comixology. All you had to do on your new reader was log in with your username and your password and you were set to go. You have a Comixology account, but how does it download to your to your phone through the actual app? It just sink, it sinks, it's just like Kindle. I don't know. Does it do that actually, but you have to S it to your laptop, right? When you,",
      "start": 3519.44
    },
    {
      "text": "but how does it download to your to your phone through the actual app? It just sink, it sinks, it's just like Kindle. I don't know. Does it do that actually, but you have to S it to your laptop, right? When you buy a comic on Comics Aly on the computer, I point cuz there's a computer over there, right? You guys never seen the other world. I log in as Greg Miller, right? And then I buy my comics and then they are on my account, right? So then when I come to my computer now I you're right, I got you. Okay, you're pointing out a step correct. There is the thing here of where there's on on device and then in the cloud, got it. So I don't I haven't fooled around enough with the app yet cuz it's new to me, but like every comic I've ever purchased from Comixology is here and I can just go and download them and even and like I can just click that one and download my last whatever 120 books. Okay , yeah, I mean that is an extra step yeah and I and it's annoying, don't get me wrong, but I think what this is something we face,",
      "start": 3556.88
    },
    {
      "text": "I can just click that one and download my last whatever 120 books. Okay, yeah, I mean that is an extra step yeah and I and it's annoying, don't get me wrong, but I think what this is something we face in our day jobs when we're talking about video game companies and people freak out that Sony's charging this or Xbox is changing that or whatever we we're so quick to overlook the hard facts of being a business, right? Like everybody businesses exist to make money and get you the services you need, right? And like Amazon sure, like they are a smart company, right? They must have weighed options of this 30% is costing us X millions of dollars. If we lose this we're if we change it we're going to lose probably estimate this percent but they'll come this percent will come back and it's like it's got to work out. Yeah, they did a cost benefit analysis and that and they were like we're losing we're losing $40 million a year say just to Apple if we do this we'll lose 20 million so make 20 million but that's,",
      "start": 3594.28
    },
    {
      "text": "out. Yeah, they did a cost benefit analysis and that and they were like we're losing we're losing $40 million a year say just to Apple if we do this we'll lose 20 million so make 20 million but that's the thing is like it's not even I don't think it's even a traditional cost benefit analysis being like where we're losing money it's being like like we're not getting money that our direct competitor that our job is to put out of business because that's what Amazon wants to do to Apple it like everything they're doing and everything they have going on is to **** compete with apple everything you know smart from like their you know their devices to you know to uh you know the the Amazon box and the store and everything like everything they want Apple you know they want them and so like it's not even about like them losing money to a third party of some sort it's losing money to the company that they **** hate true you know and so like that they they buy things like Comics Aly just like,",
      "start": 3639.04
    },
    {
      "text": "even about like them losing money to a third party of some sort it's losing money to the company that they **** hate true you know and so like that they they buy things like Comics Aly just like they got made the deal with HBO to **** they competitors you know like the HBO GO deal or the HBO deal on Amazon Prime **** Netflix well this deal **** Apple you know and like that's like when you have a lot of money you throw it around and like I want to get there I want to get there one day this this really sucks for users you know because whenever a feature is taken away from them whether or not they actually use it like I I don't buy comics from the iPad like that's not something I would ever do I don't really care about historically I do when I have one offs but it's it's never and I understand that I think maybe we're in a privileged group right and I'm sorry to cut you off sorry to be Nick Scarpino to you um that's what people say in the comments they don't like you they,",
      "start": 3673.84
    },
    {
      "text": "and I understand that I think maybe we're in a privileged group right and I'm sorry to cut you off sorry to be Nick Scarpino to you um that's what people say in the comments they don't like you they said in the comments one video and we CA I've been better uh for me personally it's my friend says this comic is great and I'm like okay great I trust their opinion I sit down and I usually off a computer buy 10 and then go so it'll be annoying when I finish those 10 I'm like I want to read the next I got to go to my computer it's all the way over there you know what I mean like when I when I fly somewhere I load the I make sure I'm loaded up on comics and go but it's yeah I mean I mean for me like the thing that draws me to Comics is not necessarily artst of Storytelling right it's the fact that you can get lost in a in a really fleshed out world that can be fleshed out over the span of hundreds of issues potentially and so when I get in that mindset where I'm vibing and the story is,",
      "start": 3712.16
    },
    {
      "text": "that you can get lost in a in a really fleshed out world that can be fleshed out over the span of hundreds of issues potentially and so when I get in that mindset where I'm vibing and the story is really resonating with me it's there's an addictive quality to it that I want to stay there in that mindset for as long as humanly possible right and that's when I start marathoning through these things and I think from a business standpoint I think you'd want to keep your customer in that mindset as much as possible cuz literally like I said I bought a bunch of invincibles when they were on sale well guess what I also bought a bunch of them when they weren't on sale because I needed to know what happened and now those were like the five issues or the eight issues that I bought were that's expensive yeah you know um but I mean if you're still addicted to it are you are you not going to just go to the website and then buy them later anyways probably probably but it's it's one more it's one,",
      "start": 3751.28
    },
    {
      "text": "yeah you know um but I mean if you're still addicted to it are you are you not going to just go to the website and then buy them later anyways probably probably but it's it's one more it's one it's it's you know like we all work on a on a website right and there's a there's a good rule of thumb which is like don't put any barriers between few barriers between the the the consumer and the content as humanly possible right and like that's why we don't want to Route people through like 30 different things to find this show right we want them to come to one place and find it and we want GameOverGreggy.com right and we want them to to watch as much of it as humanly possible um without having to stop and like you know like if people had to download this and it would it took you 20 minutes to download like we people probably be less into it right and I think ultimately like I'm saying it's a great it's a smart business move for them because ultimately I think they probably have something,",
      "start": 3786.6
    },
    {
      "text": "download like we people probably be less into it right and I think ultimately like I'm saying it's a great it's a smart business move for them because ultimately I think they probably have something more in store for us than than this process I mean that's the thing like I I feel like this is going to end up being good at the end like it sucks that a feature's getting taken away but obviously Amazon's now going to focus on Comics a bit more promote them and it's like to me the whole the App Store thing it's more about discoverability than it is about like being able to purchase it right there it's being able to look at like oh what is hot right now what's going on and all this stuff like oh I want I want you get the free like you get the free first issues of everything too so you can read stuff often times with I think you can still do that on the website you know the app too I think I think you can still read if it's free I think you can read it right there oh cool well it doesn't,",
      "start": 3825.88
    },
    {
      "text": "stuff often times with I think you can still do that on the website you know the app too I think I think you can still read if it's free I think you can read it right there oh cool well it doesn't seem like that big of a deal right like Amazon's already the master of one click shopping like they they they've always been better than iTunes iTunes has always been this cumbersome garbage I **** hate using it and you know Amazon has always been like signing we remember you we're not **** crazy like like you could find like I I I buy like my the analog to me is I buy a ton of books right like on Kindle and I have to go on my computer sometimes I go on my iPad just go to the browser and buy them and it's so easy easy it's like almost too easy like sometimes I'll wake up you know I I'll be up late night there's a beer next year and there's 40 new books oh my God I'll wake up like you know because I like to I I like start reading something really interesting and I go look for books on and,",
      "start": 3860.28
    },
    {
      "text": "late night there's a beer next year and there's 40 new books oh my God I'll wake up like you know because I like to I I like start reading something really interesting and I go look for books on and I'll just buy them or like this is almost too easy you know like see so it's the same thing maybe they're doing you know you say it's a bad bad for the user maybe it's good for the user maybe it's going to be like why don't you think twice before buying you know $50 worth the comics today see I not that I'm sure that that that's what they want but it might be kind want that well see here's here's my thing I will support this if it eventually leads to uh some sort of subscription like you're talking about subscriptions but you don't mean it in the same sense of Netflix like when are they going to do uh and and now Amazon has the the capability of doing this because they've got the power behind you know their huge corporation when are they going to do the $10 unlimited Comics per month,",
      "start": 3896.28
    },
    {
      "text": "to do uh and and now Amazon has the the capability of doing this because they've got the power behind you know their huge corporation when are they going to do the $10 unlimited Comics per month subscription model. Marvel does that do they? Marvel does it for but it's like older stuff and then after what a month or two months it pops up not a Marvel guy sorry DC yeah and it the problem with that though is I mean you know it's there are so many ICS that come out every sure but here's what I'm saying like I know there are only so many right that's not like I mean are you saying there's not there's I say I think there's too many to be able to offer that at a competitive price that makes sense yeah but what if I I I don't when it comes to like these TV shows and stuff like you're not getting the newest stuff always sometimes you are I mean like with what I mean I don't know sometimes I mean sometimes you'll get that right when it's over I'm say but that's what I'm saying like well with Hulu,",
      "start": 3928.84
    },
    {
      "text": "new est stuff always sometimes you are I mean like with what I mean I don't know sometimes I mean sometimes you'll get that right when it's over I'm say but that's what I'm saying like well with Hulu you get you can get stuff that's that's there but it's that's not a subscription model I see what you're saying um what I'm saying is like they give you yeah you have to limit it like Netflix is limited you're not getting anything really that good except for occas an occasional cartoon that I think is amazing like like Ultimate Spider-Man Young Justice but you don't get the newest Ultimate Spiderman sure but I wouldn't care about that right because if I now then well that's what I'm saying but when but Netflix does isn't just studio specific right so Netflix puts everything on their platform that they can get their hands on right uh similar to Spotif I'm thinking more like Spotify right where Spotify is a third party company that can get any song from any label right when can Comixology",
      "start": 3968.08
    },
    {
      "text": "they can get their hands on right uh similar to Spotif I'm thinking more like Spotify right where Spotify is a third party company that can get any song from any label right when can Comixology become that thing cuz that's what I would pay $10 a month for which is I would pay $10 a month to be able to read any DC any Marvel any Image comic that I wanted beyond a certain point right like before a certain point I think that freaking awesome I'd love to go back and reread like all the old DC comic books like all the old like Frank Miller stuff any anything that he did and I'd pay $10 a month for that and I totally forget that I that's why I think this is also not that big of a deal I mean I think it is a huge deal and it's like it does suck that something's being taken away but the way that like me specifically when I'm when I buy comics like either a friend recommends it to me or I go to like IGN and see like what they're talking about and then a lot of research you just go to",
      "start": 4006.12
    },
    {
      "text": "way that like me specifically when I'm when I buy comics like either a friend recommends it to me or I go to like IGN and see like what they're talking about and then a lot of research you just go to Wikipedia and just kind of read and you're like oh I'm interested in that and I'm never going to buy one issue you're right you buy 10 someone recommends you something you're going to get at least enough of them at least six yeah to be like am I into this or not and you buy them at once I'm not going to buy just issue seven and then maybe issue eight and then maybe issue n what no I'm going to buy the next 10 you know like to prepare for the airplane or to prepare for whatever it's like so far my biggest complaint with it right is that now that there's a new app my library isn't there so I have to redownload everything which sucks cuz I had so many books in there I know that some of them weren't read so I don't want to just do like the blind download everything cuz then I'll just have a",
      "start": 4044.2
    },
    {
      "text": "to redownload everything which sucks cuz I had so many books in there I know that some of them weren't read so I don't want to just do like the blind download everything cuz then I'll just have a million books that I that are going to say new I imagine but whatever uh back to Jerry over here he ends his article like this there is no upside to this development people there are no positives yes yes I know now Apple can prevent sex criminals now Apple can't prevent sex criminals from appearing in Comixology in store or in app storefront because there is no in app storefront this is progress I'm outraged and deeply concerned for the future of digital Comics you should be too shame on you Comixology shame on you Amazon shame on you Jeff Bezos and shame on you supposed comic book fans if you don't make your voices heard against this that's some dramatic **** right there and see that was my problem with it I respect everything he's done as a Comic Book Creator but I'm a comic book fan and I think",
      "start": 4081.28
    },
    {
      "text": "your voices heard against this that's some dramatic **** right there and see that was my problem with it I respect everything he's done as a Comic Book Creator but I'm a comic book fan and I think I think from working in the internet on a day-to-day basis that this is a giant knee-jerk reaction that anytime 100% a kneejerk reac anytime anything happens on the Internet it's the worst thing ever oh my God today this that Will Powers always puts it great he'll always tweet something along the lines of oh so this is what we're mad about today like we're always mad about something and in a week everyone will be accepting of the new Comixology platform it's silly it's just silly to put it that way in this sense you know I'll just say I'll just put it like it is Apple is not going is not necessarily ubiquitous company right like they are going to go like they have great computers I use I have a Macbook I have an iPhone and I have an iPad I'm a huge Apple consumer but they are not an Untouchable",
      "start": 4119.68
    },
    {
      "text": "ubiquitous company right like they are going to go like they have great computers I use I have a Macbook I have an iPhone and I have an iPad I'm a huge Apple consumer but they are not an Untouchable company like Amazon is for Amazon which is a much more secure company and is going to be here in this in its status for a lot longer than Apple is going to be to buy something like that is good for Comic fans because exactly like because like Amazon Amazon is **** really legit you know like really legit they're not they're not making this in they're not making this this is not a purchase this is an investment for them right they clearly see that there are fans out there that are yearning for something and that in the platform is not quite there yet right I think you're going to see an evolution of this that's something that we're not expecting because honestly I think the digital platform is probably still failing the comic book industry like I don't know how I mean I don't know I",
      "start": 4159.8
    },
    {
      "text": "evolution of this that's something that we're not expecting because honestly I think the digital platform is probably still failing the comic book industry like I don't know how I mean I don't know I haven't looked up any of the statistics on it but they're probably doing better than they were 20 years ago but they're probably still not outrageous success like they should be yeah wa that's a question I have how does this affect the actual the creators of the comics at all well I've I've looked around I've you his Forbes letter here didn't point it out I was over here on this other article I've been trying to figure out what exactly the breakdown is Comixology has not released a statement on this they're totally just like should we call Linda flip the F Portillos is being sold ladies and gentlemen I will Kickstart us to buy that but we will need $360 million we need a lot of venture capital get it I think we can get it I don't know if we can that I almost had that be my uh my topic and",
      "start": 4195.64
    },
    {
      "text": "I will Kickstart us to buy that but we will need $360 million we need a lot of venture capital get it I think we can get it I don't know if we can that I almost had that be my uh my topic and I was going to be like how do we run a hot dog chain business oh i'I'd quit I'd quit everything we do right now to run Portillos that's that's an Empire hot dog Empire so so yeah Greg I'll close with just my own personal opinion saying this is not a big deal this is actually probably a good thing ultimately for Comixology and for comicbook fans for the comic book industry and that a company like Apple is very reliant they make a ton of money on the App Store no doubt but they are reliant on new technologies and if they don't find that new technology really soon uh they're going to be a very old school Apple again because you know the tides are changing they're losing market share with iPhone they're losing market share with iPad um you know they they're making money but you know and they're profitable and I",
      "start": 4232.64
    },
    {
      "text": "because you know the tides are changing they're losing market share with iPhone they're losing market share with iPad um you know they they're making money but you know and they're profitable and I wish I owned Apple stock but they they're shit's not written in the stars yet frankly Amazon is people are always going to want to buy stuff Amazon undercuts everybody free shipping Amazon Prime all the stuff they are going to be fine Amazon will be here in 50 years and you know uh they they're always innovating and they make it easy for the to shoper Amazon has been one of the best things that's happened to the American Consumer ever and you know so to have have them you know they're very different than Apple they're all about like cheapness they're like the Walmart of the internet apple is like you know the the Tiffany of the they're the highend yeah and like they're very different companies you know here's here I have three things to close on for me and they're all kind of quick one",
      "start": 4272.8
    },
    {
      "text": "like you know the the Tiffany of the they're the highend yeah and like they're very different companies you know here's here I have three things to close on for me and they're all kind of quick one talking about this Amazon's cool I think I like Amazon I like what they're doing had a problem with they're going you know what about what if what we were talking about here your unlimited Comics right what if unlimited comics in the storefront came through the Amazon Kindle and that was tied in with Comixology and Comixology could then have the storefront there or whatever what if they develop some kind of tablet tech for that that's and I'm just putting it out there just chew on yeah dog smells so wait a tablet just for Comics No a Kindle that does everything that a Kindle does now but also has the Comixology storefront and everything else you want and they can do a subscription model where you get every from Image for 10 bucks that be that could be really cool and maybe that's what we",
      "start": 4310.24
    },
    {
      "text": "has the Comixology storefront and everything else you want and they can do a subscription model where you get every from Image for 10 bucks that be that could be really cool and maybe that's what we were talking about them building towards something maybe they could be building my iPad was bought my iPad was bought for a Comics reader too so if somebody comes out with a better Comics reader and I can do more cool stuff with it capitalism brosive it doesn't atrociously load imagine a full like I know a lot of people don't like this and a lot of people like the backlit screen but what if it wasn't a backlit screen that was full color it actually looked like the comic book you know or they came out with a new technology that was that I would buy that thing and plus it was Amazon it be like 200 bucks maybe Max you know they don't sell they don't sell stuff for like really expensive which is awesome number two on my closing things uh in July 2011 Amazon made a similar change to its Kindle",
      "start": 4349.16
    },
    {
      "text": "bucks maybe Max you know they don't sell they don't sell stuff for like really expensive which is awesome number two on my closing things uh in July 201 1 Amazon made a similar change to its Kindle app removing access to the Kindle Store to comply with Apple's regulations on inet purchases so that's how long that's been gone yeah it be to see what that did for them the business and stuff like you know cuz now we're looking at like oh whatever I wonder how it's going to affect them but I we have we have proof from before yeah for a company so profitable it's probably worth with them to eat it and make sure Apple doesn't get any of the money right and then the final thing is that the DC Marvel Image app all that is run by Comix ology and that still has in store purchasing our good friend Little Sin tweeted a a photo that was funny of my iPad Saturday and it was just the Comixology app and then my iPad Sunday and it was each one of the Publishers individual apps so that he can still",
      "start": 4382.36
    },
    {
      "text": "little Sin tweeted a a photo that was funny of my iPad Saturday and it was just the Comixology app and then my iPad Sunday and it was each one of the Publishers individual apps so that he can still purchase in an app like that so if it is a huge deal to you you can still do that I wonder how long they're going to keep that and if that's maybe some weird deal with specifically I think it's a weird deal with who made your app because it's one of those things like obviously they're in Partnerships with these people in DC Comics and everybody else so if they were like now we need to strip this out and DC's like we don't want to deal with our fans flipping out company X can start carrying our Comics digitally and then Comixology would crumble yeah man let the market sort it out mhm if you hate it so much don't use it yeah go to comic shops again I won't I I'd go back to not reading I go I go to Amazon and buy the actual physical versions I don't want that I don't want that crap I love it",
      "start": 4422.84
    },
    {
      "text": "it so much don't use it yeah go to comic shops again I won't I I'd go back to not reading I go I go to Amazon and buy the actual physical versions I don't want that I don't want that crap I love it I'm so sick of having crap see you're a physical media kind of guy you love that stuff I love it so much I'm super happy to do a comic book on my phone I I do you not you would think you couldn't do it but on Comixology it's really cool no I can't do it they do a really good do the panels and everything I don't like it it tells a story it tells it an emotion way I think I think it's really cool it's it's not ideal I would to do it on an iPad but if it's just me and my phone waiting somewhere for a meeting or something like that I just pop it open it's awesome reading on iPad you specifically you look like you're checking email when you do it on your phone because you're just like this yeah you can't do that with an iPad Tim mhm what's your topic so my topic today is cell phones now that",
      "start": 4461.28
    },
    {
      "text": "you look like you're checking email when you do it on your phone because you're just like this yeah you can't do that with an iPad Tim mhm what's your topic so my topic today is cell phones now that might sound like a silly topic and it is but I'm talking to just m topic your memories with cell phones and how important they were to you guys I don't know where you guys were at in your life when you first got cell phones you in college I was in my like junior year of college when I got a cell phone for the first or sophomore year I started driving and my mom and it wasn't a cell phone it was a car phone oh the car phones are the best and it was just like a long receiver that had a power plug and it was literally put in the glove box in case the Carver broke down and I needed to call it and I remember I had my cell phone number which is my cell phone number for the rest of my not until I changed it to a California number but it was in Sharpie on the back of it cuz like like tell I",
      "start": 4499.68
    },
    {
      "text": "and I remember I had my cell phone number which is my cell phone number for the rest of my not until I changed it to a California number but it was in Sharpie on the back of it cuz like like tell I remember this dumb number that I'll never use in I don't even know what a car phone is the car phone would be in the middle usually in the like in the console between the driver seat and the passenger seat and it was attached to the car the power car and it was just it was a box and you would interesting I remember very OG the first cellular phone we had it was my when my grandfather was dying and my Portillo hey uh I think it was my mom or my Portillo bro come here shut up mom or had it and it was in a bag it had like an external battery that was so big that you it rested on it came it was corded to the battery like that's how crazy used to be the one I had was a car phone that was way long and then it just said it wasn't like Z thick no similar to that just Googled car phone out there",
      "start": 4538.24
    },
    {
      "text": "corded to the battery like that's how crazy used to be the one I had was a car phone that was way long and then it just said it wasn't like Z thick no similar to that just Googled car phone out there they were awes they were awesome I always wanted one I never never could afford it but yeah I had it and I never ever used it and then I remember that when I went to college freshman year I did not have a cell phone and I came back and my mom was like we need to get you a cell phone so we can actually communicate with you and I got that Nokia blue brick phone that everyone had yeah with snake that's that's why I brought this topic up it's these weird memories cuz once I started thinking about it um I saw a a Motorola Razor so that is what triggered this and I was like man that hits me my wife had that phone until we like our second year of marriage she had that phone Alfredo had his till he got his iPhone I had to literally that's my wife my wife had the the flip up it was in like",
      "start": 4583.36
    },
    {
      "text": "had that phone until we like our second year of marriage she had that phone Alfredo had his till he got his iPhone I had to literally that's my wife my wife had the the flip up it was in like pristine condition cuz my wife takes good good care of all of her technology it's amazing and I had to pry that thing out of her hands and put an iPhone 4 into her into it cuz I was like you you've got to get rid of this thing you've got to be able to answer email on your phone she's like I'm not going to do it I'm not going to do it I don't need that see see this is interesting because like for me it was Middle School cell phones that was middle school and like while you'd be aiming people you'd be like talking about what cell phone do you have and stuff like that it's just crazy where like I remember my first cell phone it was not the flip phones it was like just uh I don't even know how you it was kind of like it wasn't a Nokia but it was like that and everyone had those then flip phones",
      "start": 4626.96
    },
    {
      "text": "remember my first cell phone it was not the flip phones it was like just uh I don't even know how you it was kind of like it wasn't a Nokia but it was like that and everyone had those then flip phones came out like design flip phones were like the coolest thing ever so small yeah I remember I got the well they were not small though which is the best my when you well the Razer was I the Razor the Razer was well compared to like my first phone was like K Kera phone that was probably like you know this big mhm and then I and then I had like a I had a Samsung that was like a little little guy I had yeah I loved the flip phone and it's because this is the flip phone can do one thing that no other phone will ever be able to do that cool and then I'm done cool and you just knew you were G to feel it when you shut that phone it was sick click yeah and you knew you thought you looked cool in reality you look like a giant so there was I think it was the Samsung the t720 series which was it was",
      "start": 4664.32
    },
    {
      "text": "it when you shut that phone it was sick click yeah and you knew you thought you looked cool in reality you look like a giant so there was I think it was the Samsung the t720 series which was it was like the flip phone that everybody wanted and then everyone got it and you could take off the the cover and like switch it out with like different covers you go to Chinatown and like they'd have like all the bootleg different covers you could use and it was like that was such a big deal was changing out the it wasn't even a case it was like just the the phone and like that was the coolest thing and being able to you could make purchases on the phone of downloading ringtones and being able to like change your ring ton so it wasn't just the Nokia sound effects and stuff it was you get to listen to these horrible MIDI versions of songs you love like M&M's Without Me which was my ringtone for way too long yeah and um should still be a ring I remember that being such a big deal and then you know",
      "start": 4708.76
    },
    {
      "text": "these horrible MIDI versions of songs you love like M&M's Without Me which was my ringtone for way too long yeah and um should still be a ring I remember that being such a big deal and then you know then eventually I'll never forget being at my friend's house for his birthday and then we're all just sitting there doing something stupid probably like playing Yu-Gi- Oh and all a sudden the like TV like a commercial comes on we all just go just look over and it was the Razer and we just see it just spinning and stuff and like I remember all of us being like Oh my God like that is what rich people do this is awesome I hope that one day we get to see one in real life yeah I have that story from the opposite end where I had I got a Razer I I had graduated college maybe I was still doing no I was in a shirt and tie so I must have graduated and I was working at the paper and I went out to an event at a middle school where I was reporting on what they were doing and my phone rang and I pulled",
      "start": 4746.84
    },
    {
      "text": "in a shirt and tie so I must have graduated and I was working at the paper and I went out to an event at a middle school where I was reporting on what they were doing and my phone rang and I pulled it out and flipped it open like a badass and took it and all the kids like he's got a Razer and they like grouped around me while I was on the pH that would have been me that was so crazy like it was the Holy Grail of like and yeah when we'd see people it'd be like oh my God Razer That's crazy dude do you remember how fast you got at texting on those things oh yeah where it was like eventually like the one two 3 one two3 yeah it like it blew it blew my mind there cuz I think I think the maybe it was Nokia or maybe it was my Verizon phone could do the predictive Tech stuff remember that where it was like you you wouldn't have you just like click and it would figure it out for you and I was like this is cheating cuz I loved the AA I like the challenge and if you messed up halfway you're like",
      "start": 4791.44
    },
    {
      "text": "was like you you wouldn't have you just like click and it would figure it out for you and I was like this is cheating cuz I loved the AA I like the challenge and if you messed up halfway you're like she's not going back now I just she she'll just have to figure out what I mean Scarpino texting Association there you go God it was the bomb yeah I had the Nokia phone I always wanted the Crazer the rer then there was a something called the Crazer right the CER yeah what's the Crazer the that was the one that it wasn't a flip phone it was a just a oh it kind of flipped up like there was all there was a time when had a bigger screen and stuff and then that came out around the time if I remember correctly when the original Apple phone came out before the iPhone where it was Apple teamed up with I want to say AT&T and they made a phone where it had iTunes support in it and you can play music so it was like an MP3 player it was kind of like an iPod but it was also a phone um and then it was",
      "start": 4833.92
    },
    {
      "text": "I want to say AT&T and they made a phone where it had iTunes support in it and you can play music so it was like an MP3 player it was kind of like an iPod but it was also a phone um and then it was **** **** it was so bad like I remember my friend also that was another one where like oh my God I wish we had the Apple phone and then like Janie Lee got it and was like this thing sucks Janie go away I had I don't want to talk to you again Janie Lee yeah I had a uh a Blackberry so when everyone else was going Apple I was like I was I wanted to stay on Verizon so I'm like no I'm going to go Blackberry I'm going prove everyone wrong with the blackberries want to prove everyone wrong it's better for business it's better for you no it's not better for any like that with Palm Prix the oh you loved your palm I forgot about that yeah Palm Prix was **** legit as **** it really was web was awesome web is still better than anything Apple's ever done and I've been using iPhone for a long",
      "start": 4870.92
    },
    {
      "text": "loved your palm I forgot about that yeah Palm Prix was **** legit as **** it really was web OS was awesome web OS is still better than anything Apple's ever done and I've been using iPhone for a long time now um but yeah I love because I I had a Kera in the in the late 90s I think it was like 2000 and then like a bunch of flip phones and I don't know about you but all my flip phones were smaller than this everyone I ever had so and I have about like the thickness thck the t720 was like that thick and that was a thin one mine mine weren't too much too much let's take a to all Apple we all iPhones yeah I have they win they won it's crazy for me to meet somebody who doesn't use an iPhone they're uh there are many of them they're let me drive that back let me pull that one back a bit sorry crazy for me to meet somebody in San Francisco that doesn't use an iPhone everyone in San Francisco uses an iPhone almost Scott Lowe is the only one that seems to sub in and out with something El there's a",
      "start": 4914.96
    },
    {
      "text": "for me to meet somebody in San Francisco that doesn't use an iPhone everyone in San Francisco uses an iPhone almost Scott Lowe is the only one that seems to sub in and out with something El there's a lot of Android users it's crazy to me is seeing people with flip phones or stuff like or razors like my friend James had freaking flip phone until like literally a month ago when he got his first iPhone and now he's blown away it's crazy to see him it is it is wild when you finally succumb to it because I stuck with web OS for a long time because that operating system was awesome um and it was like so quick so much quicker than iPhone um and it had tactile buttons on it too which was a like really awesome the screen was nice we get it you like it but uh my buddy also my buddy was electric I went to North Eastern was electrical engineer worked on that phone too and uh lot good that got him begging for change now works at Apple now no he does he doesn't he works with the same firm uh but uh",
      "start": 4958.6
    },
    {
      "text": "to North Eastern was electrical engineer worked on that phone too and uh lot good that got him begging for change now works at Apple now no he does he doesn't he works with the same firm uh but uh he you know we used to talk about like you know the the the advancements that other the companies we're making were usually overshadowed by the how big these companies were like you know Android with Google and and apple with iPhone kind of just pushed everyone out and a lot of good ideas whatever um yeah but like we're we live in a bubble with apple here because Apple's user base with iPhone is plummeting and is in like the teens I think um so like like like we everyone we know has Apple but if you go like normal place in the United States most people have Android and do you think that's because the Allure of the like the Apple device is just worn off or it's because they haven't iterated they haven't actually because there's so many Android devices yeah they're Apple Apple's share of",
      "start": 4994.12
    },
    {
      "text": "the Allure of the like the Apple device is just worn off or it's because they haven't iterated they haven't actually because there's so many Android devices yeah they're Apple Apple's share of the phone market has never been like dominant like if you looked at it it was only I think at at at the peak of it it was only like 10% of the market or something like that cuz there are so many other types of phones out there that that compete like I don't think it was that low I think it was pretty low I I mean I don't think it's ever been like insanely vastly dominant uhhuh insanely vastly because you have to remember also like Domin the smartphone category maybe the smartphone category yeah but I originally dominated that then it got dialed back down once Android started doing a lot more and more and more and it's Metro PCS you can get like I think they make the the bulk of their money off of off of iTunes and their subscri their services but Apple has the whole approach the old Nintendo",
      "start": 5036.32
    },
    {
      "text": "more and more and it's Metro PCS you can get like I think they make the the bulk of their money off of off of iTunes and their subscri their services but Apple has the whole approach the old Nintendo approach which is like we make the hardware we make the money off the hardware use our operting Google Google's very different they're like anyone can make a phone we don't give a **** in fact you're going to make our phones cheaper and then we make all the money on the back end with licensing fees and then on on you know Google play or whatever so it's like you know to me like that makes sense and you know Apple you know did a very un Steve Jobs thing which was make a cheaper iPhone which Steve Jobs would have never ever done because Apple's always been looked at as like a really luxury product you want to make it really expensive and nice yeah that was the first step I knew they were like I'm like they're on the way down yeah app and looked worse than a Samsung device we'll save it",
      "start": 5078.0
    },
    {
      "text": "product you want to make it really expensive and nice yeah that was the first step I knew they were like I'm like they're on the way down yeah app and looked worse than a Samsung device we'll save it for another day but Apple's Apple's going to be in a world of hurt I think in the next 10 years I I think oh I think they're they definitely have to come up with something big yeah because like I I always I was talking about with my my father when I was home on Long Island and I was like you know he we were talking about Apple and how you know he was he's Amazed by Amazon and like how you know's he's an older man he's like he's like I was on my phone and I like I what's an Apple device you get col he has he has an Android and he was all like you know it's so cool because I just went on my Amazon app and I ordered something it just came to the door and I was like totally Blown Away by that I'm like yeah it's it's really cool but like like we were talk we we ended up segueing and talking",
      "start": 5114.48
    },
    {
      "text": "app and I ordered something it just came to the door and I was like totally Blown Away by that I'm like yeah it's it's really cool but like like we were talk we we ended up segueing and talking about you know iPads and iPhones and I was like you know the the beauty about Apple has always been with Steve Jobs has always been like you didn't know you didn't even understand that you didn't have something that you needed you know like he filled a need that you didn't you couldn't even comprehend like so true and it happened with Mac you know Apple 2 apple one and Apple 2 and then really MacIntosh and then it happened again with yeah the iPod and then the iPhone the iPod was the first thing that really blew me away where I was like cuz there had been other devices out there like Sony been trying to figure it out for a while you had the Walkman you had the disc man little what was the the smaller one the mini disc I had a mini disc player and then all of a sudden Apple comes up with this",
      "start": 5147.92
    },
    {
      "text": "to figure it out for a while you had the Walkman you had the disc man little what was the the smaller one the mini disc I had a mini disc player and then all of a sudden Apple comes up with this device that looked more clunky than everything else and it had that horrible spin wheel it did not look more clunky at first it wasn't a spin whe first the first time it was buttons I don't yeah and like the well it didn't design aesthetic wise it looked totally different than what Sony had been putting out to marker right so put like the futuristic like they had the and this this was just something that you're like this is friendly I want to interact with oh that thing was a brick it was a brick but like that's why they broke it so easily revolutionized the game man it was just like yeah they're not the first ones they weren't the first SP they didn't make it the MP3 player they didn't invent the MP3 player they made it something appealing to make it feel you needed it you know and they",
      "start": 5182.56
    },
    {
      "text": "not the first ones they weren't the first SP they didn't make it the MP3 player they didn't invent the MP3 player they made it something appealing to make it feel you needed it you know and they didn't invent the smartphone they they they didn't invent the tablet like they they have these things and you're like my cuz my dad admitted I'm like he's like I didn't realize I needed a smartphone now I can't imagine not having one I'm like but that's the thing like they don't have that magic anymore because Steve Jobs is dead you know like I hate like put in such gr terms but like now they don't have anything like what like what is they smart they got the smart watch yeah I think that that's not they weren't even the first they weren't even the first to Market yeah that's exactly the point though they don't need to be they need to be the ones to do it right and to make people realize why they need it and I think that's what we're all waiting for is I have no idea like I do",
      "start": 5218.6
    },
    {
      "text": "the point though they don't need to be they need to be the ones to do it right and to make people realize why they need it and I think that's what we're all waiting for is I have no idea like I do not want to buy one of those it's not interesting to me that thing's not going to be anything the watch is not going to be anything that's that's to me that's redundant right to me that's going to be the same as like the the iPod Nano remember when remember those things that was like this big and you couldn't pick the song you just kind of Shu was it the shuffle yeah um like that thing where you're like okay that's kind of cool and it's going to flash and then it's going to go out I think that's my theory well the shuff's one of their most successful iPod L was it really yeah I don't know was it really definitely they still selling them yes yeah wow that's one of the only ones I do still sell a little tiny one that's like this big yeah yeah you clip on while you go running to me they're funny",
      "start": 5250.72
    },
    {
      "text": "definitely they still selling them yes yeah wow that's one of the only ones I do still sell a little tiny one that's like this big yeah yeah you clip on while you go running to me they're funny because they're very they're very like Nintendo to me like where they have a ton of money so they can afford to make like a lot of mistakes um but if you give them a few years of making mistakes and then slowly they become not profitable which they're still far away from not being profitable because they makes a **** ton of money then you you quickly find yourself in trouble with a business that size we we mustn't forget you know in the mid 90s Apple was two months away or two quarters away from closing up completely and like they've come a long way you know since then are H huge megalithic company but I do not think that they are an immortal company they have to they have to come up with something new because people like cheap goods and cheap electronics are not hard to come by and quality",
      "start": 5283.88
    },
    {
      "text": "but I do not think that they are an immortal company they have to they have to come up with something new because people like cheap goods and cheap electronics are not hard to come by and quality cheap electronics are not hard to come by I buy Apple products I really like the quality MH I will never use anything but a Macbook ever again you know I will always use an iPhone I will always use an iPad but not everyone has that kind of luxury they you know I have disposable income well that's the thing you talk about it was I mean it's a I remember the day I got my first iPhone and it's back to what you're talking about I mean I remember I used to have the stupid flip phone still I had the Razor till I had the iPhone and it was one of those things of like you know when I got the job at IGN it would suck to come in in the morning you know leave at 5:30, 6:0 0, 6:30 come in in the morning at 9:30, 10:00 and have all these emails right and it was like it's going to be awesome able to check",
      "start": 5319.16
    },
    {
      "text": "it would suck to come in in the morning you know leave at 5:30, 6 :00, 6:30 come in in the morning at 9:30, 10:00 and have all these emails right and it was like it's going to be awesome able to check the email on the go and I sold my car the night Barack Obama got elected the first time and the next **** day we walked in with that money and bought iPhone like that's what I did that's what I did with that money you know what I mean and then from there on out I had the I and that was like what we're talking about right like that was a huge investment that was like buying a computer right it was like what $500, $600, $600 the first iPhone was $600 and that was insane see I didn't buy the first one I remember still $600 sure well but now we before was $600 like no matter what no matter what yeah but I remember when Craig Harris got it Craig Harris was the first guy I knew to get an iPhone or whatever and it's like mindboggling to see this thing and then slowly understand why you needed it",
      "start": 5353.44
    },
    {
      "text": "but I remember when Craig Harris got it Craig Harris was the first guy I knew to get an iPhone or whatever and it's like mindboggling to see this thing and then slowly understand why you needed it and then a year later buy my own it's remarkable it's a remarkable machine you know I remember so going back to my flip phone it was the first one that had internet it was like when internet phone was like first thing and I'll never forget going to GameFX and being able to actually read the forums wherever the hell I was and I was like oh my God my life will never be the same iPhone smartphones in general just completely man it's just crazy what they did to us as people it really is it's hard to think of life without them um so when I think about the wearable tech I'm like I mean what could it possibly bring to my life that I don't have right now right that's what I want tell the exciting thing right you're like that's a good point they can they can twist a narrative but I",
      "start": 5395.56
    },
    {
      "text": "possibly bring to my life that I don't have right now right that's what I want tell the exciting thing right you're like that's a good point they can they can twist a narrative but I just don't think the W like when I see those watch commercials for Samsung whatever running and here's your heartbeat and here's this this is stupid I mean honestly I'll tell you right now sound it to me the next piece of technology that I think is super cool and I'm going to wait several iterations is Google Glass oh when Google Glasses you can go into a store and buy whatever glasses you want that then can give you an overlay of stupid information yeah hell yeah **** give me that's so weird to me like I don't know if I need that Google Glass when I see someone with Google Glass I'm like Col you know better than anyone we don't need any of the **** we have like think about if you start if the EMP went off tomorrow we what do we really need not much you know what I mean like that's",
      "start": 5435.76
    },
    {
      "text": "Col you know better than anyone we don't need any of the **** we have like think about if you start if the EMP went off tomorrow we what do we really need not much you know what I mean like that's Bott eal raring I feel like a gun I feel like there's still like but that's the thing like the HUD I think the next iteration is having all that information right like on your I hate wearing watches so I don't want to wear it and I think I'll get more information here I see I think that's just going to cause more car accidents oh look at that I'm going oh see or not I don't know like I often think about it like with how Google Glass Works with the speakers and stuff being being able to give you the GPS direction just kind of see you're looking at your phone you're looking at your thing like if it is there you just got Timmed I don't know I think my attention span I'd be like I'd constantly be taking and everything and I think I just it's too much for me I think Google Glass is like way too",
      "start": 5472.6
    },
    {
      "text": "it is there you just got Timmed I don't know I think my attention span I'd be like I'd constantly be taking and everything and I think I just it's too much for me I think Google Glass is like way too Orwellian for me I'm not interested in at all I think it's **** creepy but someone did put a video of Google Glass on the internet about six months ago of them playing hockey with it on very cool you know like like no but like the first person ha it but I'll wear it for hockey no but the first person perspective like the video like the cinematography that you can do with it is so cool like it was I played hockey for a long time it is like being on the ice like like watching that guy play in HD was **** awesome so like that kind of stuff cool but I'm always creeped out when I see these dudes wearing Google Glass and a lot of bars and restaurants will not let you wear wear Google Glasses inside and I don't blame them cuz it's **** weird why yeah well it's like upskirts right like I mean",
      "start": 5509.16
    },
    {
      "text": "wearing Google Glass and a lot of bars and restaurants will not let you wear wear Google Glasses inside and I don't blame them cuz it's **** weird why yeah well it's like upskirts right like I mean somebody's going to use it to be creepy so yeah I can totally understand why you wouldn't wear it harder to put your head up a skirt I guess yeah I I haven't wrapped my head around how to do upskirts with I'm just saying that's why I don't want to wear it creepy stuff happens in bars you don't need creepy photos how do you do upskirts normally just with your phone just like I've never understood can you explain to me how you normally do I've never understood how anyone I can barely take a selfie let alone put a digital camera on my shoe no I think you're just like you're standing on on the BART or whatever you you tell me how you do it how do you how I know there's I've seen when I was in Japan there were a bunch of signs on how you know drive it out here beware of people taking up skirts",
      "start": 5543.28
    },
    {
      "text": "or whatever you you tell me how you do it how do you how I know there's I've seen when I was in Japan there were a bunch of signs on how you know drive it out here beware of people taking up skirts or whatever and they showed people with cameras on their shoes that's that's that's that's inventive yeah that's really inventive people are creeps they are people are creeps dude I think Japan is different it just is just done there I mean well there's more they're definitely more I'd say risque as far as like just ridiculous things like I've never seen in America a sign beware of upskirts it's such a it is such a problem in Japan that they need to put up a sign yeah in America we're just like don't we look out **** weird yeah exactly you're on your own it's basically what our signs say good luck good luck it's just the sign that you get on a part it says good luck how terrifying would that be oh my God that's amazing really terrify underneath or above it it's like a pooping bomb and",
      "start": 5576.28
    },
    {
      "text": "luck good luck it's just the sign that you get on a part it says good luck how terrifying would that be oh my God that's amazing really terrify underneath or above it it's like a po oping bomb and upskirt drugs syringes then it just says good luck that is so that's hilarious so the birthday party I was at when I saw the Razor commercial was in El Cerrito which is in the East Bay it's kind of near Oakland and when we were um we got on BART we're a bunch of 12-year-olds Jesus God I don't like the story already all of us is get on BART and then we're going and like you know more and more people are getting off the the train and we we're like almost near Richmond which is a not good place and um there's this guy that he just looks at us where you going we're just like ah Cerrito he just goes you're going to die I we like's like make sure you get off before Richmond good luck and then he gets off and we were horrified got out the bar ran into the Target we just sat there and called my friend's mom",
      "start": 5626.88
    },
    {
      "text": "to die I we like's like make sure you get off before Richmond good luck and then he gets off and we were horrified got out the bar ran into the Target we just sat there and called my friend's mom like dude come get us now that would terrify me that would absolutely terr ify me also if I were a bum that's exactly what I would do you're gonna die Charlie it turns out it's like a guy in a business suit with a briefcase you're gonna die that would be even scarier even like this guy looks like he knows what he's talking about this guy's got and also we had we had our backpacks filled with Xboxes the original Xbox and Halo and a bunch of controllers where like kind of have a LAN party and I was like we're going to get robbed of our Xboxes yeah that was fun I only had one LAN party in my entire life I had to take my PC over to my friend's house and I just gotten a Voodoo graphics card so we could play uh I want to say it was like Doom multiplayer against each other or Quake maybe it was Quake was",
      "start": 5672.88
    },
    {
      "text": "had to take my PC over to my friend's house and I just gotten a V oodoo graphics card so we could play uh I want to say it was like Doom multiplayer against each other or Quake maybe it was Quake was it Doom 2 I can't remember which one it was it it was 3D anyway it was so much fun what are you doing I'm readjusting what you just turned around with your things just to make sure you're happy fine I can hear everything Uh I that the I remember the first time I ever heard of a LAN party we're having a I had read about them obviously forever in E but the first time I ever saw one in the wild we were having a house party at the Antler house my sophomore year and all of a sudden like it just started vacating and it was all the new kids and I was like where are you you all going and like we're going over Devon's house playing Halo I'm like you're a bunch of **** just drank my beer yeah I was never interested in LAN parties cuz I remember in college people even were connecting their Xboxes",
      "start": 5716.52
    },
    {
      "text": "over Devon's house playing Halo I'm like you're a bunch of **** just drank my beer yeah I was never interested in LAN parties cuz I remember in college people even were connecting their Xboxes together and I was I had an Xbox and I was you know you want to play Halo I'm like not a prayer they're like all right you want to can we borrow your Xbox I'm going go ahead and then I just play my my my RPG whatever I've always been a single player guy you know that would never like I remember when people were having LAN parties for Halo was so stoked or Doom 2 and like Quake back in the day and you know I was like I don't care just don't want to play with you yeah I'm a single player guy too but local multiplayer that's why Smash is good and Street Fighter was good and like there's nothing better thaning Capt the flag with in two different rooms and hearing like the different rooms screaming like oh was the best well ladies and gentlemen that's the GameOverGreggy Show every week four best",
      "start": 5752.76
    },
    {
      "text": "thaning Capt the flag with in two different rooms and hearing like the different rooms screaming like oh was the best well ladies and gentlemen that's the GameOverGreggy Show every week four best friends gather around this table each bringing a random topic of conversation and discuss it for your amusement if you like that like the video subscribe to us at youtube.com/gameovergreg gy and watch for a video well I'm not going to put that up there don't even bother that's nope I did it once for you when you said I wouldn't do it now you're just looking like a psychopath where'd you go Jesus with the electricity you Jesus me oh good lord make sure you like the videos we put up each topic is a breakout video each and every day if you want it early go over to gameovergrey.bandcamp.com every Friday we post the full show is an MP3 for $11 if you don't like that go get it for free at gameover grey.com go buy this Sean Finnegan sh along with a number of other ones let's see if we can get",
      "start": 5788.08
    },
    {
      "text": "Friday we post the full show is an MP3 for $11 if you don't like that go get it for free at gameovergrey.com go buy this Sean Finne gan sh along with a number of other ones let's see if we can get Sean Finnegan to beat Scarpino this month huh that's all I want it's not going to happen no not going to happen nothing beats Scarpino nothing thank you all for watching thank you all for being nothing beats [Music] Scarpino",
      "start": 5833.76
    }
  ]
}
