{
    "id": 3430,
    "video_id": "34dvl9-SBz0",
    "show_name": "Kinda Funny Morning Show",
    "hosts": [
        "Nick Scarpino"
    ],
    "title": "No Morning Show Today - The Kinda Funny Morning Show 03.21.18",
    "description": "Huge apologies to everyone trying to tune into the Morning Show today. The Internet went out right as we started streaming/recording and everything went to hell! Bad news: we lost the file and wont be able to post to YouTube either. Good news: we'll be back tomorrow!!!\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1521666047,
    "duration": 65,
    "transcript_chunks": [
        {
            "text": "hey everyone uh sorry there is no Morning Show today we had a little bit of a technological uh mishap our internet went out halfway through streaming which borked OBS which is how we normally record the show and we did not realize that until too late um so there will be no Morning Show today for the first time I feel deeply bad about this as the for the first time as my reigning Championship uh I'm the champ I don't know if you know that or not um there there was no Morning Show there will be one tomorrow I promise we're going to come back it will be uh twice as good to make up for today and we will use all the stupid bits that we had today tomorrow so you really won't miss anything other than a couple stories uh and my Sterling personality for everyone that looks forward to watching the show live super sorry about that again Comcast screwed us um but we will make it up to you with some some kisses for tomorrow this is what they're going to sound like tastes [Music] good anyway uh",
            "start": 1.4
        },
        {
            "text": "show live super sorry about that again Comcast screwed us um but we will make it up to you with some some kisses for tomorrow this is what they're going to sound like tastes [Music] good anyway uh apologies again hopefully this reaches you and if you're looking forward to the show it'll be back tomorrow love you guys sorry",
            "start": 39.96
        }
    ]
}