{
    "id": 2408,
    "video_id": "J9cNyNicubs",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Nick Casts Actors As Game Characters - Kinda Funny Gamescast Ep. 107 (Pt. 4)",
    "description": "Nick is a certified crazy person.\n\nThanks to MVMT Watches for sponsoring this episode. Go to http://www.MVMTwatches.com/kinda\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1487250002,
    "duration": 967,
    "transcript_chunks": [
        {
            "text": "this episode of Kinda Funny Gamescast is brought to you by MVMT Watches, MVMT Watches was founded on the belief that style shouldn't break the bank, the watchmakers goal is to change the way consumers think about fashion by offering high-quality minimalist products at revolutionary prices with over 500,000 watches sold to customers in over 160 countries around the world, MVMT Watches is solidified itself as the world's fastest growing watch company, that's right, MVMT Watches, Greg Miller has had his sexy one, you know, the sexy one with the red hands and the black face, and it looks good, MVMT Watches started just $95 at a department store, you're looking at 400 or 500 bucks, they're expensive, movement figured out that by selling online they were able to cut out the middleman retail markup all that stuff providing the best possible price we're talking classic design Quality Construction styled minimalism it's everything you can want you can get yours with 15% off today with",
            "start": 0.16
        },
        {
            "text": "\"Markup all that stuff providing the best possible price we're talking classic design, Quality Construction, styled minimalism. It's everything you can want. You can get yours with 15% off today with free shipping and free returns by going to MVMTwatches.com Kinda. If you like super clean designs and getting compliments, now's the time to step up your watch game go to MVMTwatches.com Kinda join the movement. Still one of my favorite catchphrases, good job guys. Last up for the day as always brought to you by you. You can go to Kinda.com Gamescast topic leave your questions for us and we will answer them this week, week very Nick themed I decided to kind of you know bring you back into the the fold here a little bit um wasn't planned to have you on the whole show today it was supposed to be just a topic but then kind of just fell into it and we're like why not why you know let's just roll roll through this so Richard Watters okay says I'd like to see him cast video game characters cast\"",
            "start": 39.2
        },
        {
            "text": "Be just a topic but then kind of just fell into it and we're like why not, why you know, let's just roll through this so Richard Armitage okay says I'd like to see him cast video game characters cast video game characters. I imagine he means in a movie. Oh, in a movie. So I'll throw some characters at and we'll let's just start off old brainy, you know, with a nice segue. Solid Snake, solid snake uh, I mean obviously the obvious answer is Michael Biehn because that's the character on the covers based off of Michael Biehn's career did not pound out the way he wanted to also he's a bit old for that. I would say a Taylor Kitsch would be awesome for a Solid Snake or uh maybe someone oh let me think who who am I thinking that I love right now yeah I would go Taylor Kitsch, I love him and he's so underrated and he's so underused unfortunately. Who else? They make it a Legend of Zelda movie okay who's Link? I think you'd cast H interesting interesting because you have a character",
            "start": 97.76
        },
        {
            "text": "so underrated and he's so underused unfortunately who else they make it a Legend of Zelda movie okay who's Link I think you cast H interesting interesting because you have a character who's got to be childlike doesn't speak Haley Joe Alwyn for Link and then he grew up you know right no he's grown up he'll always be that kid that's six s for me and I would cast Emma Watson as Zelda because I want to C I just would want to work with her 100% in the whole well now you're directing the movie I like that of course **** yeah I'm casting if I'm casting the movie I'm clearly directing the movie got it all right uh let's go with just any video game character at him oh God Greg right Dark Chief DARPA Chief you've already cast it for Middle Earth oh uh this the guy that hosts Family Feud Steve Harvey by the way Steve Harvey very versatile actor he could have played all the roles you already talked about very true he could play Zelda he could play Link absolutely 100% okay so any",
            "start": 141.76
        },
        {
            "text": "Steve Harvey by the way Steve Harvey, very Universal actor, he could have played all the roles you already talked about, very true, he could play Zelda, he could play Link absolutely 100% okay so any video character we already do Nathan Drake, do we already figure no did Nathan Drake go for it Nathan Drake, I mean the obvious see I don't want to go the obvious though because everyone's always like it's either Bradley Cooper or uh uh what's his butt from Jurassic World Chris, I don't want to go there though Nathan Drake how about you can think about it if you want for a second how about this how do you feel about the Tomb Raider girl woman Alicia Vikander I don't know anything about her I saw that first Set photo of her though I like she was I love it oh I do know her then okay yeah she photos of her I was like oh **** looks just like the game this looks just like the game good for you guys she's aw she's an amazing actor I think they did a great job with that let me",
            "start": 193.8
        },
        {
            "text": "okay yeah she photos of her I was like oh **** looks just like the game this looks just like the game good for you guys she's aw she's an amazing actor I think they did a great job with that let me this you yeah Crash Bandicoot. Crash Bandicoot is a CG movie are we doing the voice of it or does someone actually have to be in a Crash Bandicoot costume because I very much they casting the commercial and they're putting him back in the suit we're crashing if we're casting Crash Bandicoot I think we have to bring back probably arguably the most underrated comedian ever to live Mr Carrot Top I think Carrot Top has to be Crash Bandicoot I think it has to be I like it like if it's the voice of Crash Bandicoot I think there's only one person who can do it and that man's name is Tim Gettys thank you thank you I'll take it up if I have to take up the mantle boogah mhm trying to think of a fun one Bayonetta oo ooh that's tough you want to go with someone like Rose McGowan but I don't know if",
            "start": 236.48
        },
        {
            "text": "you thank you I'll take it up if I have to take up the mantle, boogah, mhm trying to think of a fun one Bayonetta oo ooh that's tough you want to go with someone like a Rose McGowan but I don't know if Rose McGowan's doing stuff like that I was thinking Ashley, Ashley I was thinking Angelina Jolie yeah she might be a little too motherly now okay okay you know what I mean well she's out in the press now what's that oh she has that's right right they broke up Bayonetta kind of has like a sexy thing to it she got the librarian thing on it yeah at least Bayonetta too definitely yeah yeah that's a that's that's I me there's lots of women that could that could do that I want I would want to put like I want to put like an Eva Mendes in that just to see what it's like I know the character is traditionally supposed to be Caucasian but mhm there's a Japanese it's she looks kind of a witch she's from yeah she's white but I would do like an Eva Mendes in that like a Jessica Alba get a little flare I like that",
            "start": 277.44
        },
        {
            "text": "to be Caucasian but mhm there's a Japanese actress, she looks kind of a witch, she's from yeah she's white but I would do like an Emma Stone in that, like a Jessica Alba get a little flair, I like that hot, I like the Jessica Alba factor, I mean they don't have to be like you know uh-huh all that crazy Pac-Man and four ghosts, Pac-Man we got to go with Adam Sandler and the four ghosts, all the other people whose names I don't know in the Adam Sandler crew, gotcha, in pixels yeah pixel pretty much the same crew worked with since Happy Gilmore and Billy Madison, big uh Lee Everett and The Walking Dead do you ever you know The Walking Dead the game character oh Daryl's character yeah then then Dave okay okay perfect well do that Dave is one of those fascinating guys that he's super talented and I want him to do more live action work yeah me too um and I don't get me wrong I like the Ezio on uh uh the Walking Dead right now but I think Carla Gugino, car-goo-nee-no, I for you pronounce it, I think Dave would have crushed",
            "start": 324.6
        },
        {
            "text": "do more live action work yeah me too um and I don't get me wrong I like the Ezel on uh uh the Walkie de right now but I think Carrie Pton car pton I for you pronounce it I think Dve would have Crush that role Final Fantasy VII yes Super Mario and Luigi if they were to make a live-action movie live action movie well I mean I think you got to bring back John Lasseter on it John L was we lost unfortunately Bob Hoskins is dead yeah that's sad um didn't have a one-up Mario he's a real man who died I feel like if you want to get crazy about it you want to get **** crazy about it you want to get like take it up to 200 million $300 million budget yeah Mark Wahlberg as Mario no stop putting Wahlberg in everything yes I'm kind of down or no Mark Wahlberg as Mario The Rock as Luigi you got to do it you want to do Vin Diesel as Mario I want The Rock as Toad I feel like that's Toad be amazing that would be amazing okay so we're casting Super Mario Brothers 2 the movie okay all right it's going to be a semi",
            "start": 373.12
        },
        {
            "text": "do Vin Diesel as Mario I want Dwayne \"The Rock\" Johnson as Toad, I feel like that's a great casting choice, that would be amazing. Okay, so we're casting Super Mario Brothers 2 the movie, okay all right it's going to be a semi-reboot sequel to The Super Mario Bros. Movie but this one it's of Super Mario Brothers 2, okay where they're in Subspace or not sub... yeah, Subspace, just Subspace and uh you we need Mario, Luigi, Peach, and Toad. I'm thinking Mark Wahlberg as Mario, okay feel like that works. This movie I don't know why Hollywood would either cast Mark Wahlberg or Channing Tatum as Mario but if Mark Wahlberg, if it was Channing Tatum then you got to go you got to flip it a little bit and maybe go Channing Tatum as Luigi and Jonah Hill or Seth Rogen as Mario, got that connection. Or if you want to go really hard and you want to bring a little like not go true to form like maybe one of them was adopted by the Italians you go Danny McBride and Craig Robinson as Mario and Luigi right or Craig Robinson can play",
            "start": 418.92
        },
        {
            "text": "it and you want to bring a little like not go true to form like maybe was one of them was adopted by the Italians you go Danny McBride and Robinson as Mario and Luigi right or Craig Robinson can play Toad because that kind of is fun right so any combination of that of like the Danny McBride Channing Tatum Craig Robinson and then for Peach I'm gonna go with Aubrey Plaza because I just watched Dirty Grandpa and now I have a huge crush on her she's great huge crush on her what about Zac Efron could also be Solid Snake I just want you guys to know that Robert Irizarry from Mario he's a little yeah he could work I mean he's an amazing actor yeah um I think he could definitely work um but I feel like you want the Mario character if he's going to be acting opposite Channing Tatum and Craig Robinson you might want him to be in that in that bracket you know what I mean Steve Harvey on the other hand would make an amazing Mario because as we know Steve Harvey would make an amazing",
            "start": 470.72
        },
        {
            "text": "Robinson you might want him to be in that in that H bracket, you know what I mean. Steve Harvey on the other hand would make an amazing Mario because as we know Steve Harvey would make an amazing he's the Mushroom Kingdom King right, oh the king. Who do we cast as Bowser though? Do we have to have a bad guy here? No, Bowser's not in Super Mario Bros 2; he's like a frog, a frog and Berto who's Berto? I mean I feel like that's maybe where John Leguizamo can come back into play. Oh no, things didn't turn out too well for him. No, I don't know. I mean you know his career's he's had a great career, you know always gives me Berto vibes to me. Alfredo Diaz I can see him playing a hell of a Bowser; he could be a great Bowser. Someone about it... I love that. He's pretty from Street Fighter too, to worry about it what if it's not a crossover we don't have to worry about it. He, I guess you're right, he can be both. You're right. Lilu says how do y'all feel about that? Castlevania cartoon have you heard about this? Yeah, I heard about one.",
            "start": 514.52
        },
        {
            "text": "we don't have to worry about it he I guess you're right he can be both you're right Lilimura says how do y'all feel about that Castlevania cartoon have you heard about this yeah I heard about on the news I haven't seen did you hear more details about it no all I saw was what we kind of covered the last story when you and I were doing animated by Frederator oh really okay so that's just going to be good produced by Joe Shankar oh that's right I did hear that hard R that's going to be awesome for this thing that's going to be amazing hell yeah Joe Shankar for those of you who don't know produced Dread but he also more importantly did that amazing uh Power Ranger short that came out about a year and a half ago with uh Sackhoff and James Van Der Beek directed by Joseph Khan of Taylor Swift video and the Thong Song video and Larger than Life by Bad Boys for Life director Michael Bay no, I mean, larger than life by Backstreet Boys and directed by Joseph Khan who's a bad guy he really is bad news from uh did he right Preacher no he did The Expanse thing",
            "start": 564.2
        },
        {
            "text": "Nick Casts Actors As Game Characters - Kinda Funny Gamescast Ep. 107 (Pt. 4)\n\nThong Song video and Larger than Life by Baadshah, a bad **** he really is bad **** comic book writer Warren Ellis, oh war no **** from uh did he write Preacher? No, he did The Authority, that's going to be dope as **** yeah I'm very excited about that yeah Matthew Evans, I'm calling it right now Colin will hate it. Go ahead Matthew Evans say I don't think Colin even watches it. Oh he watches, oh God I don't want to watch cartoons. Matthew EV says as someone who's big into production what draws Nick's attention to a game the design music the setting things like that definitely the style, for instance Hitman, the style the music actually really got me when I was walking around and it felt like a 60s Noir secret agent film I was like I'm really getting into this so yeah definitely um oddly enough the cinematics don't really draw me in I like I like storytelling through gameplay and so if",
            "start": 602.88
        },
        {
            "text": "a 60s Noir secret agent film I was like I'm really getting into this so yeah definitely um oddly enough the cinematics don't really Draw Me In I like I like storytelling through gameplay and so if I'm actually playing a game and and I get a sequence of cinematics that are just characters in uncanny valley it doesn't really draw me in um but I do like I I like discovering those stories kind of organically through the gameplay Jose Lewis AKA Pello 14 says what's the first video game you played and could you ever fathom that you'd be going to work in an industry related to them no because I never really wanted to um the first game I think I remember playing was was Jesus Christ it was got to be on the Apple IIc cuz I think that was the first like computer that I had that could play a game it was either that or the Atari 2600 and I think that was like like River Raid I think was a game right on Atari I remember playing that and then also uh the the the game that I wanted to master so badly",
            "start": 649.4
        },
        {
            "text": "was either that or the Atari 2600 and I think that was like, like River Run, I think was a game right on Atari. I remember playing that and then also uh the the the game that I wanted to master so badly but never could because I loved the movie franchise so much Aliens, which was on the Apple IIe and it was impossibly hard, it was so hard I got to the I got to the ending every time you just had to keep dropping flares and I just couldn't figure out how to get through it probably the easiest game on the planet but I was like four yeah makes sense. John Leola if you would write a video game what game would you want to write oh interesting um that's a very interesting question I would probably want to try to write something that played out similar to like a Gone Home because I feel like that's a really good use of the medium that really combines all the aspects of cinema and the interactivity of games to tell a really compelling cool story um and it's only four hours so even if you don't",
            "start": 696.64
        },
        {
            "text": "a really good use of the medium that really combines all the aspects of cinema and the interactivity of games to tell a really compelling cool story um and it's only four hours so even if you don't like it it's only four hours you get through it actually I think that might not be even a bit four hourss hours um but I like that and I like what that what um his team did with that where you just kind of go through and experience it and you're being told a story very first is another example of a game that I really really really liked in that regard had some problems toward the third act like everyone knows but I like I like the concept of just being in that world being able to explore it and then experiencing that story kind of organically and the way they did it I thought was really genius Jotun says if you could make any change to the DSX franchise moving forward what would it be I mean another game would be good unlikely yeah we'll see um I don't know I mean I'm not that deep in",
            "start": 741.16
        },
        {
            "text": "jotus says if you could make any change to the DSX franchise moving forward what would it be I mean another game would be good unlikely yeah we'll see um I don't know I mean I'm not that deep in DSX but I but uh I like I like the gameplay and I was I'd like that I'd like them to make another game but unfortunately they're probably not going to Matt Labuhn says what's the next game you're going to play after Hitman probably Uncharted at some point I have to go I've never played one starting I've played the first two hours of one three times now I **** you not I'm like this game's cool I should go back to this and then you know what's putting me off now is that I just don't want to **** play that sub level again I don't want pick up from where you left off I don't think I have my save I think I I did it on yours that **** so it goes by so fast I know I know I'm being a **** about it it's one of those things where like I I just I've been I've held ground so long on this and I know",
            "start": 779.8
        },
        {
            "text": "I did it on yours, that **** so it goes by so fast. I know, I know, I'm being a **** about it. It's one of those things where, like, I've been holding ground so long on this and I know I'm going to like it, that I'm just dreading having to eat my words, you know? You're like, \"God, I know I'm going to like this one.\" Yeah, you're suck it up and go play. Chris Moore says Nick, what's up with that Robotech battle cry? Let's play. I'm going to change that question to have ever you ever played Robotech battle C? Yeah, we should do a let's play on that. Really, can you still... I don't know be PS2 GameCube and Xbox? We get creative. Yeah, we'd have to get creative with that. That was it, was fun. We'd have to like, it had a cool multiplayer. Yeah, did you guys ever play it? No, I didn't. I loved the style that was back when S that cell shaded C shaded games were still like a huge deal so it was like, \"Oh man.\" Unfortunately, the actual single player campaign for that was not very fun cuz you",
            "start": 823.44
        },
        {
            "text": "the style that was back when s that cell shaded games were still like a huge deal so it was like oh man unfortunately the actual single player campaign for that was not very fun cuz you didn't I think they there was something off with the sense of momentum they had in space when you actually played the vertical fighter in space but when you played the actual battle mode it was a lot of fun and hard and cool very cool let's see want that Robotech: Crystal Dreams let's play remember that game no I don't remember any of these things i' never even really heard about Robotech BR my **** hard that was when I was hella into video games and I I wanted an N64 so badly because I wanted to play Mario and I wanted to play Robotech: Crystal Dreams and everyone was like this game's going to be terrible because you're in space fight a bunch of crystalloids just crystals cuz that's all that the N64 could render and then they cancelled it oh wow okay I think it was a rare game trust me you could have actually",
            "start": 861.2
        },
        {
            "text": "you're in space fight a bunch of crystallids just crystals cuz that's all that the N64 could render and then they cancelled it oh wow okay I think it was a rare game trust me you could have actually gotten the game you wanted Superman 64 is your prize sorry about that gangster wants to know how's it being so damn swag um it's it's really fun but it's really hard because um you know I get to be around you two beautiful sons of bitches so you guys keep you guys set the bar high he said it high and then there's Kevin speaking of Kevin Bongos for stepping up you know what I mean Jesus Christ going to hear this go for Kevin wants to know what are Nick's thoughts on explicit sex scenes in games I always find them super awkward but I also always find explicit sex scenes in movies pretty super awkward like it's very hard to do a sex scene tastefully and you've got characters that clearly aren't real like the only sex scene that I can really think of that comes to mind is like the Mass Effect sex",
            "start": 897.68
        },
        {
            "text": "like it's very hard to do a sex scene tastefully and you've got characters that clearly aren't real like the only sex scene that i can really think of that comes to mind is like the Mass Effect sex scenes where you're like i've wanted this for so long and you got it you're like all right miranda what's up but all right all right fine thanks nick for joining us ladies and gentlemen this is the kinda funny gamescast we will join you next week for another enthralling episode but until then i love you",
            "start": 940.04
        }
    ]
}