{
    "id": 2433,
    "video_id": "o_qL8L0BQVM",
    "show_name": "AMA",
    "hosts": [
        "Nick Scarpino"
    ],
    "title": "Ask Kinda Funny Anything - February 2017: Nick",
    "description": "It's our newest Patreon-powered show! Enjoy an hour of Nick answering your questions.\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1488038407,
    "duration": 3282,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to this month's AMA. You drew me today. Nick the producer seducer. Yeah, I just grabbed my own chest. What of it? It's free country. Um, I'll be filling questions today from uh Patreon.com/KindaFunny, our main Patreon. Uh, Tim Gettys is doing the Kinda Funny Games, which is good because I don't know much about games. Let's get right into it. This question comes from John Bx32. Says, \"All right, Nick, let's set the stage. Let's say the last DC movie comes out in 2019 and completely fails. Hypothetical, but okay, let's go with that. Uh, you put you're in charge of the reboot of rebooting the DCU. How long do you wait? What would your first two to three movies be? And most importantly, who is your Batman? Well, I think you answered yourself question there. Uh, my first three movies would just be Batman movies because let's be perfectly honest, those are the only movies that are going to do well. Okay. My Batman Ryan Gosling. I'll go with",
            "start": 0.16
        },
        {
            "text": "There. Uh, my first three movies would just be Batman movies because let's be perfectly honest, those are the only movies that are going to do well. Okay. My Batman would be Ryan Gosling. I'll go with Ryan Gosling as my Batman. Because he's Jack. He'd get it right and he'd do a good job. What do you mean what, Kevin? I don't like it. Who would your Batman be? I don't know. I haven't thought about it. But like Ryan Gosling, that's Christian Bale. Let's get Christian Bale back to be Christian Bale did it. He's done. We don't need Christian Bale back anymore. Okay. You can go off to American Psycho 2 for all I care. That's all I'm saying. Uh, as to who would direct the Batman series though, I guess in this hypothetical, I'd be directing the Batman series. So, yeah, it would be Ryan Gosling just so I could hang out with him. And here's what I would do the entire time. That literally that's all I would do. I would have cast him. I'd be like, \"Hey, Ryan Gosling. Hey, Ryan Gosling. When",
            "start": 45.2
        },
        {
            "text": "just so I could hang out with him. And here's what I would do the entire time. That literally that's all I would do. I would have cast him. I'd be like, \"Hey, Ryan Gosling. Hey, Ryan Gosling. Hey, when you did La La Land, was Emma Stone cool? Was she really cool?\" And he'd be like, \"Nick, stop talking to me.\" Like, \"Hey, hey, Ryan Gosling. When you did the new Blade Runner movie, was Harrison Ford cool?\" I was like, Nick, you could just you could just get all those people in those movies, too. Yeah, I would probably try to cast I would probably try to cast Harrison Ford in something as well. Commissioner Gordon. He could be a dope ass Commissioner Gordon. So, imagine this. Batman 2020 is what the name of the movie is, right? Or I would call it something cool like what would we call it? Arkham. I would just call it Arkham or something like that. I say that would be cool to redo everything. What? Just do the um Kingdom Come. Kingdom Come. Yeah, that could be cool. Yeah, that could be",
            "start": 84.24
        },
        {
            "text": "Arkham. I would just call it Arkham or something like that. I say that would be cool to redo everything. What? Just do the um Kingdom Come. Kingdom Come. Yeah, that could be cool. Yeah, that could be cool. But then you got to get you gotta get old Don like Greg's concept of Don Draper as a as Superman. That would be fun. That makes a lot of sense. The thing is I Don Draper would make a dope Superman. Yeah, the thing is I would do Yeah, I would just do three Batman movie. I would do another Batman trilogy. Why not? It'd be fun. I would love to do a Superman movie, but those are just the curse of death. No one's been able to do a good like a knockout Superman movie since Dick Donner did it back in the 80s. Though or late '70s, early 80s. So, I don't know. That's the answer to that question. Next question. Jiren Dorsy says, \"Hey, Nick. Why is it that everyone says there's no good video game movies?\" I get most of them are bad, but when one comes out that has received well, Angry Birds.",
            "start": 126.36
        },
        {
            "text": "Next question. Jiren Desus says, \"Hey, Nick. Why is it that everyone says there's no good video game movies?\" I get most of them are bad, but when one comes out that has received well, The Angry Birds Movie. Everyone just writes it off. I get it's a mobile game, but it's a video game movie that people seem to like, at least the kids. Any thoughts? Are there really no good video game movies, or is it just the video game movies we want to be good aren't good? I think it's a little of column A and B. I did not see The Angry Birds Movie uh because I'm not a three-year-old. Uh I did play a lot of Angry Birds when it came out back in the day. And that's to say, I played the first three levels and decided this game is the stupidest thing I've ever seen in my life. I never interacted with it. And then that stupid Words with Friends game came out and it owned me for approximately four to five years. I'm not kidding about that. Um no, the fact of the matter is I've said this before and I'll say it again is that I",
            "start": 164.0
        },
        {
            "text": "with Friends game came out and it owned me for approximately four to five years. I'm not kidding about that. Um no, the fact of the matter is I've said this before and I'll say it again is that I believe they can make a good video game movie. I believe there has not been a good video game movie that has come out yet. But I also believe that the reason why people are so overcritical of video game movies is because video games are better spent as video games than they are as movies, right? And we have to stop looking at this whole thing through the lens of the fact that movies are the height of whatever you can achieve as an artist as far as like in the digital medium, right? Movies are movies, video games are video games, they're equal. And if you want to play Halo, if you want the Halo experience, go play Halo, right? If you want Assassin's Creed, go play Assassin's Creed. You're",
            "start": 202.4
        },
        {
            "text": "movies, video games are video games, they're equal. And if you want to play Halo, if you want the Halo experience, go play Halo, right? If you want Assassin's Creed, go play Assassin's Creed. You're not you're never going to be able to have something if you're a hardcore gamer that's every bit as fulfilling in a 2-hour experience as like a 20-hour experience. It's just a different beast. Um, so take that for what it is. It's sort of like that 360 video stuff, right? Which is really, really cool. But like in order to really do that, right, it just needs to be a virtual reality game that looks really photorealistic. And that's pretty much it. So, that's my thought on that one. Um, one day they'll make something good. Then, yeah, I was I was excited about the Neil Blomkamp Halo movie. I thought that could have been cool, too. But, I'm not a huge Halo fan. I'm also not a big video game fan. Did I see the Michael Fassbender Assassin's Creed? No. Did you? Why not? Patrick Higgins says, \"Hey,\"",
            "start": 241.52
        },
        {
            "text": "That could have been cool, too. But, I'm not a huge Halo fan. I'm also not a big video game fan. Did I see the Michael Fassbender Assassin's Creed? No. Did you? Why not? Patrick Higgins says, \"Hey, Nick, who your favorite who is your who are your favorite director, actor, and actress in Hollywood today?\" Huh. Great movie. I would give it to Damien Chazelle is one of my favorite upcoming directors. He is really, really, really something special right now. He's two for two with La La Land. Uh, I mentioned it before. I love Ryan Gosling. I think he's the best actor in Hollywood today. The guy just has charisma with a capital C. Um, and as far as actresses are concerned, I want to say Emma Stone, but that's just the easy get because I'm so in love with La La Land. Um, there's Brie Larson's awesome right now. Love seeing her work. Um, gosh, there's lots of good people. Lots of good people out there. Also very excited that Ridley Scott's coming back. Alien: Covenant going to be fantastic.",
            "start": 279.36
        },
        {
            "text": "Awesome right now. Love seeing her work. Um, gosh, there's lots of good people. Lots of good people out there. Also very excited that Ridley Scott's coming back. Alien: Covenant going to be fantastic. See where that is? No. You don't think it's going to be good? Didn't he do the last uh Didn't he do Prometheus? Shut up. Shut your mouth. I'm just saying like your dirty mouth. Stop. Take a fire hose and just hose your mouth out with it, my friend. Cuz you're a dirty human being. We know you comic book girl 19 has an amazing video about what why Prometheus like failed so you should check that out. I would love to actually I've never watched that but uh I've got my own reasons why that movie failed. Not enough Charlize Theron. You know why Mad Max: Fury Road worked? Because it could have been called Charlize Theron's movie because she's a badass. She's another great actor. Nicole Humphrey says, \"Hi Nick. What are your thoughts on Moonlight plot, characters, cinematography, etc. It was one of",
            "start": 329.04
        },
        {
            "text": "Chariss Thrones movie because she's a badass. She's another great actor. Nicole Humphrey says, \"Hi Nick. What are your thoughts on Moonlight plot, characters, cinematography, etc. It was one of my favorite movies last year and one of my most unique movies I've seen in years. Um, she says, \"Thanks for being the adult slapping the boys in shape.\" I really liked Moonlight. Moonlight's very very much one of those like interesting and very cerebral movies. And what I liked most about that film was how much he used um I believe it's Barry Jenkins, how much um he used like silence in it. There's not a lot of dialogue, not a lot going on, but the kids the actors they got were phenomenal. And uh you I was really taken back. It's one of those things where you go in and you sort of have this is why this movie is so important is you go and you have this sort of like you don't really know that you have these these preconditioned responses to certain things, homosexuality being one of them, right?",
            "start": 375.76
        },
        {
            "text": "this movie is so important is you go and you have this sort of like you don't really know that you have these these preconditioned responses to certain things, homosexuality being one of them, right? And then by the third act, you see these two people finally get together. These two guys finally get together. And it's not about the physicality anymore. It's really just about that emotional connection between two human beings. and he did such a great job getting you to that moment where as a person I mean I'm fairly open-minded as far as everything everything's concerned but e you know but I was taken aback by how much I just really appreciated those two guys being in that room and like how much that like you could feel that general just love between the two and that affection between the two that kind of transcended the gender which I thought was really really cool that's that movie was that movie is something special also um I'm gonna get the guy's act the actor's name wrong but",
            "start": 425.6
        },
        {
            "text": "The two that kind of transcended the gender which I thought was really really cool that's that movie was that movie is something special also um I'm gonna get the guy's act the actor's name wrong but shout out to Michael B. Jordan who was in he's the actor from um uh House of Cards on Netflix. He's awesome. He's also the bad guy in Luke Cage. That dude's dope. He's so good. He's one of my favorite up-and-coming actors. Um Ali, I think is his name. Michael B. Jordan, I'm looking this up real quick. Hold on. Everyone just chill. Say hi to your mother for me. Yes. Michael B. Jordan. Yeah, he's badass. He's awesome and he's up and coming like mofo. Also, shout out to Donald Glover. Donald Glover is like taking over the world right now and Tim loves him so I love him. That's what we have to do. Back to questions. Back to questions. All right. Uh Cam O'Neal says, \"Hey man, if you could live to see one technological ad achievement, what would it be? I'd like to see people living on the moon because then I could make",
            "start": 462.96
        },
        {
            "text": "to questions. All right. Uh Cam O'Neal says, \"Hey man, if you could live to see one technological ad achievement, what would it be? I'd like to see people living on the moon because then I could make fun of them for living so far away and they couldn't do **** about it. You know what I'm talking about, Greg? 100%. Greg, if you could if you could get a condo on the moon, would you do it? I mean, only if teleporting technology has been created. It doesn't take that long to get out there. How long does it take to get from here to the moon? Yeah, I think it's 3 days. I wouldn't want to be in something for 3 days. But here's the deal. It's zero gravity, so you can just sleep. Yeah, but like you can only sleep so much. You know what I mean? And also sleep a good two days out of it. You can sleep on a plane. Yeah. But sleeping on a plane sucks cuz it's really uncomfortable. Sleeping cuz you're always like this, right? Yeah. But imagine if there's zero gravity, you're just like and you just",
            "start": 519.48
        },
        {
            "text": "on a plane. Yeah. But sleeping on a plane sucks cuz it's really uncomfortable. Sleeping cuz you're always like this, right? Yeah. But imagine if there's zero gravity, you're just floating and you just go to sleep and you don't have to worry about anything. Yeah. But you'd like know how bathrooms work in space? Yeah. You gotta plug your ass into the vacuum system and then it's like I think there's a seatbelt and then it vacuums. Yeah. It's got a vacuum that keeps going, it just vacuums up what doesn't come out of you. That doesn't seem out of this world to me. I wouldn't want to experience that. So, I feel like if I'm going to go to space, it's going to be for like a day trip or I'm going to hold it for like a couple days. You'd have to hold the poop for a couple days? Kevin, that's six loads. Can you actually hold six? I think that's nine. Nine. Yeah. When I was young, I went on outdoor ed and I learned about...",
            "start": 559.04
        },
        {
            "text": "that's that's like six loads. Can you actually hold six? I think that's nine. Nine. Yeah. Whenever like you know when when I was young like you know what outdoor ed is? Outdoor education. You had to go to a class that was outdoors. You have to camp overnight. It was a week. A week and you didn't **** for an entire week. Oh, man. For most of it. Just like like a bear hibernating. Just Why was it because the bathroom was It just made me It makes me uncomfortable. It just made me uncomfortable. I don't know. I was young, too. I was like 10. Yeah. I still get uncomfortable. I don't Now I can **** anywhere. I don't see I don't I don't like outside of my normal areas. Really? But you Well, it's just because I don't like being around other people while they're pooping. Yeah. I mean, I hate bathrooms. Like I hate public bathrooms. Yeah. Oh, it's the worst. I hate hearing someone **** while I'm trying to take a piss",
            "start": 594.88
        },
        {
            "text": "other people while they're pooping. Yeah. I mean, I hate bathrooms. Like I hate public bathrooms. Yeah. Oh, it's the worst. I hate hearing someone fart while I'm trying to take a piss because it sounds like this. No, you don't have to. I I told you I don't like it. Don't you don't have to give me a little bit more of it. Spelunk. I'm going to go. All right. Tyler Hansen says, \"Hey, Nick, you had the opportunity to see Harry Potter and the Cursed Child in London last year. Do you think that it would be worth it to plan a trip around seeing a performance of it either in London or or in New York when it comes to Broadway?\" Uh, definitely. Definitely. First off, London's amazing, so it's worth it just to go to London and have an excuse to go to London. Uh, second off, New York's amazing as well. It'd be a great excuse just to go there um and have something to do for a half a day or actually I guess I guess that would be two halves of two days, so a whole day almost. Um, the show is amazing.",
            "start": 634.48
        },
        {
            "text": "It'd be a great excuse just to go there um and have something to do for a half a day or actually I guess I guess that would be two halves of two days, so a whole day almost. Um, the show is amazing. And if you're a Harry Potter fan, you've probably already read the book, which is unfortunate because uh the play while good is much it would have been much cooler to see on Broadway or on uh in the West End without knowing what was happening. I can't. So, like I I got halfway through it. I'm like, \"This is awesome.\" And I'm so jet-lagged and I know exactly what happened. So, it kind of takes this thing out of it a little bit, but still a beautiful, beautiful production. And I'm sure they'll do just as good on Broadway. RJ Davis says, \"Hey, Nick. Out of all the guys, I find that I can relate to you most. I'm the oldest in my friend group and I love film. I love film and want to make it. When you started out making wedding video wedding videos and such, did you ever do short films or",
            "start": 673.76
        },
        {
            "text": "To you most. I'm the oldest in my friend group and I love film. I love film and want to make it. When you started out making wedding videos and such, did you ever do short films or anything like that? I've done a one-film for my own talent comic expo 48-hour film challenge and it was terrible and I'm very proud of it. What are your favorite things you ever shot? Sorry for the two questions. Uh don't be sorry for the two questions. I appreciate both of them. Appreciate you. Yes, I made two short films, three short films right out of college. Um and I always talk about how unmotivated I was kind of around the college time. Uh I made a short film called High School which uh is still floating around somewhere. I think uh there's a I think I have a copy of it at home. It's on DVD. It probably doesn't work anymore because those old DVDs that you burned like just died after a while. Um, and this is I don't think that was accurate. No, I mean the ones that you",
            "start": 709.84
        },
        {
            "text": "Home. It's on DVD. It probably doesn't work anymore because those old DVDs you burned just died after a while. Um, and this isn't accurate. No, I mean the ones you burned yourself - they would just go bad after a while. They were weird. Really? Yeah. I never had that issue, but mine were always like my own bootleg stuff. Yeah. I don't know. I mean, I used to burn them and they'd just... people would go back and watch them a year later and they wouldn't work. What do you do? That sucks. Um, now well, everyone gets digital files anyway. Yeah, I made a movie called High School about three kids stuck in a room the last week before they're supposed to graduate. There are three kids who don't really know each other that well. It's kind of like The Breakfast Club but in modern times. I was a huge John Hughes fan. Huge fan. Still am.",
            "start": 750.96
        },
        {
            "text": "supposed to graduate. Um and there are three kids that don't really know each other that well. It's kind of Breakfast Club but in a modern time. Was a huge John Hughes fan. Huge fan. Still am. U and I entered it into one film competition and didn't get in and then I gave up. Do you see uh any more like videos near your future entering any more shorts? Yeah. Oh, of course. Let's get that going. I mean, the thing is this, short films are really hard to make. Um, and really good shorts really hard to make, too, because that medium is not necessarily something that's commonly accepted by everyone, right? We want long form or we want internet video. And it's hard to make something that's like 5 to 10 minutes and be compelling. But if you can do that, um, then you're off to a really, really good start because if you can make people if you can evoke emotion in a 5 10 minute short or even a two-minute short, um, then you're probably on your way to being able to do that in more longer forms.",
            "start": 783.04
        },
        {
            "text": "Start because if you can make people if you can evoke emotion in a 5-10 minute short or even a two-minute short, um, then you're probably on your way to being able to do that in more longer forms. I would say this though, um, the one thing I'm disappointed with myself is that I always felt my work never really lived up to what it should. Um, and I produced a couple of short films, then I directed one, which was high school. Um, and I just never had the confidence to get my work out there because I always just assumed that you were just supposed to make the thing that got you the next movie, right? Like, I never really understood that you have to put the work in. I never really understood that, you know, you're supposed to make that first one and it's supposed to suck. And guess what? The second one's going to suck probably a little bit less, but it's still going to suck. And then by the third or fourth or fifth one, you've probably got you've built your crew, you've kind of got the",
            "start": 822.64
        },
        {
            "text": "second one's going to suck probably a little bit less, but it's still going to suck. And then by the third or fourth or fifth one, you've probably got you've built your crew, you've kind of got the experience, you've seen all the things you're not supposed to do. Uh you've got maybe a couple talented actors that really want to hone their craft. Um and then you can go and do something. Uh it's it's unfortunate because we all idolize guys like Kevin Smith. Like he's one of my idols. Absolutely. And I've had the pleasure of podcasting with him and meeting him. Um but Kevin Smith is an anomaly. Kevin Smith is not the rule. He's the rare exception to the rule, right? going out with Clerks. Like if Clerks came out now, I don't know that it would have been as popular as it was back then. It was just this weird thing that happened and caught the cultural zeitgeist. Um so don't compare yourself to people like that. Don't think that you like your first thing has to be",
            "start": 862.48
        },
        {
            "text": "It was just this weird thing that happened and caught the cultural zeitgeist. Um so don't compare yourself to people like that. Don't think that your first thing has to be perfect. In fact, it's almost better when it's not perfect because you can learn from it, you know, you look at it, don't put that expectation on yourself. Just say to yourself, \"This is going to be what it is, and I'm going to have great fun with my friends making a piece of art, and we're going to enter it in some festivals and get some experience that way, and if you get turned down, you've got all that wealth of knowledge to take into your next project and do it again.\" Um, and so, you know, some words of encouragement for you would just be definitely do another one. I'm proud of you for making it. That's awesome. You should definitely share it with everyone and be open to any feedback that you might get. But the most important thing is that you immediately start working on",
            "start": 898.16
        },
        {
            "text": "Awesome. You definitely share it with everyone and be open to any feedback that you might get. Uh, but the most important, the single most important thing is that you immediately start working on the next one. Just keep doing it. Because I'm a firm believer, by the way, that all success is just time and motivation. And if you have both of those things, you can do really anything you want. You've got to have motivation. Motivate. Everyone's got a lot of time. This one's the harder one to have. So, keep motivated. Diego Del Silva Gosh says, \"Hey, Cocaine Nick, what are your thoughts on the full season of Westworld given that you discussed it when it was only about three episodes in? What are your final thoughts on the season?\" Cheers from Brazil. Um, I loved Westworld. I You're right. I I got to about episode 3 or four and was like, I don't know if I'm liking the show. I liked the first couple of episodes, but it kind of dragged a little bit. But then I realized it was all set up for what I\n\nI corrected the following:\n\n* \"U\" -> removed (unnecessary)\n* \"Motivate\" -> capitalized (proper noun)\n* \"Cocaine Nick\" -> assumed to be a nickname for Nick Scarpino, so left as is\n* \"Westworld\" -> capitalized (TV show title)\n* \"Diego Del Silva Gosh\" -> no changes needed\n* \"Cheers from Brazil\" -> removed the period at the end of the sentence fragment",
            "start": 935.44
        },
        {
            "text": "to about episode 3 or four and was like, I don't know if I'm liking the show. I liked the first couple episodes, but it kind of dragged a little bit. But then I realized it was all set up for what I would say is probably one of the best seasons of television ever made. Um, if you haven't watched it, you don't have HBO, do yourself the service. Buy it somewhere. I'm sure you can get the whole season somewhere. Um, it's really, really cool and it's a very unique show. Um, and it has lots of nudity in it. So, if you don't like deep sci-fi and deep cuts when it comes to that, you can see a lot of dicks and a lot of uh boobs and some uh some pubic hair. So, you know, take that for what it's worth. Brandon Lopez, aka the notorious Jose Ruckus says, \"Hey, Papa Nick. If a different decision had been made on that faithful day all those years ago, and instead of directing silly internet videos, you followed your true calling to direct porn, what pseudonym would you use in place of your true name?\"",
            "start": 975.92
        },
        {
            "text": "been made on that faithful day all those years ago, and instead of directing silly internet videos, you followed your true calling to direct porn, what pseudonym would you use in place of your true name? I would probably call myself Kevin Cole. Knowing what I know now, I don't think you need a pseudonym to direct porn. You do. Well, you don't. Well, you you do if you want credit for it. There's lots of people who have directed porn that have pseudonyms. So, like when they if they give you credit, you just you have it underneath there. All right. I would either go by Kevin Cole or Rick Dick. Rick Dick. There you go. Nerd Cave says, \"Hey, Nick. I hope things are fantastic for you and the rest of the Kinda Funny crew. My question for you is on the production side of things. I'm wondering what you use to bring all the camera feeds in. Currently, we run one camera into a Blackmagic Intensity Pro and it works really well. If we were to bring more in more cameras in the future for",
            "start": 1017.84
        },
        {
            "text": "what you use to bring all the camera feeds in. Currently, we run one camera into a Blackmagic Intensity Pro and it works really well. If we were to bring in more cameras for more angles in the future, how would you do that? Any advice on making content that my girlfriend and I think would be uh any any advice on making the content that my friends and I make better would be awesome. Here are the links to both of the channels we do. Thanks for everything. All right. Well, here we go. We're going to watch this first one. NerdCave Network. Let's see what your channel video is. Yes. Yes. It's a podcast",
            "start": 1062.4
        },
        {
            "text": "We do. Thanks for everything. All right. Well, here we go. We're going to watch this first one. NerdCave Network. Let's see what your uh let's see what your channel video is. Yes. Yes. It's a podcast that starts mid-sentence. Well, here's Okay. Bold. Bold. You're just saying yes to a question. Podcast number 198. Holy **** that's a lot. I'm going to skip around here a little bit. Yeah, there will be. Um, to answer your original question, I'll mute this. We use uh a Blackmagic switcher. Uh, Kevin, what's it called? Which one is it? We use the HyperDeck recorders and the ATEM 2ME broadcast studio, but they sell a smaller one that might be better. It's relatively affordable. So, to get more camera angles in, we use a video switcher. Uh, we use the Blackmagic Design ATEM 2, which is a broadcast version. It's very big. It has a lot of inputs. Um, you don't or the 2ME. You don't need that. You can do you can do something a lot smaller than that if you just want two or three cameras",
            "start": 1099.84
        },
        {
            "text": "Version. It's very big. It has a lot of inputs. Um, you don't or the 2ME. You don't need that. You can do you can do something a lot smaller than that if you just want two or three cameras that go in, but you'll need someone to actually physically switch for you. So, what it does is it has it's just a big board that rack mounts about this big and it's got a bunch of inputs and outputs on the end and then that goes to a control board and then that final which goes to multiple outs. You can take one to your to your deck to actually hit record on it and then you have to have someone like Kevin sit there and go they also live himself in the TV the TV studio which I think is less and like accepts HDMI. Yeah, they're really really annoying to use though. The TV studios. Yeah. Well, no. I mean all like broadcast like any switcher is difficult and challenging so you'll have to do a lot of research. A lot of good YouTube videos out there if you just start looking for them. And Derek we're",
            "start": 1158.32
        },
        {
            "text": "all like broadcast like any switcher is difficult and challenging so you'll have to do a lot of research A lot of good YouTube videos out there if you just start looking for them And I'm going to be talking about Look at you You got that key down though Little little known movie Please tell me you guys are twins Are you guys twins Decent I'm going to think of you all It's actually just one dude It's just one dude He's talking to himself Do you like about it No I think I think you guys are off to a really good start here Um and if you want to you know put more cameras in there there are very easy switchers that you can get that can do that for you Then you'll just need a cabin of your own He can uh be the bane of your existence as well Also if you don't want to use more cameras and you're running it all to a computer you could use multiple uh AVerMedia live gamer or something like that use OBS and OBS and you can use that to switch between up to",
            "start": 1195.28
        },
        {
            "text": "To use more cameras and you're running it all to a computer, you could use multiple uh AVerMedia Live Gamer or something like that. Use OBS and OBS, and you can use that to switch between up to we have used that for two of them but you could probably put more that's an um yeah the other the other tool a lot of people use is something called a TriCaster but you're getting expensive there and that actually I believe will will stream out as well as uh do all the all the switching internally Michael Inzinger says hey Nick I've seen I've seen on a couple shows you talk about needing to manage taxes and payroll my question is what roles 's work do each person do for the company outside of what we see on camera. It would be great to get insight into all that work that needs to occur not only for the production but the running of your company. Um what you don't see is, you know, I take care of a lot of the administrative work. So making sure people get paid, making sure the taxes get",
            "start": 1238.32
        },
        {
            "text": "Only for the production but the running of your company. Um what you don't see is, you know, I take care of a lot of the administrative work. So making sure people get paid, making sure the taxes get paid, making sure we have healthcare policies up to date, workers comp, liability insurance, things like that. Um I work with our we have a small accounting team uh that's that we contract out that we work on to get all that stuff done as well as legal. Um, and of course people who um, you know, we work with for payroll and things like that. Um, so that side of the business is what I take care of. I take care of any anytime anything needs to be like managed, getting our name on bank accounts, things like that and ordering new checks. Um, pretty much any anything invoicing. And so if if people owe us money or if we owe people money, I make sure all that stuff gets paid out correctly. Um, Kevin obviously takes care of all of our technical stuff, so he makes sure all the shows are up and",
            "start": 1284.08
        },
        {
            "text": "We owe people money or if we owe people money, I make sure all that stuff gets paid out correctly. Um, Kevin obviously takes care of all of our technical stuff, so he makes sure all the shows are up and running. He takes care of Patreon. Um, so he's the one that organized this today. Um Tim is really the master facilitator when it comes to um working with Rooster Teeth and their store and and all the sponsorship stuff they bring in for us. Uh Tim's also great about going out there and trying to find some of the bigger sponsorship deals that we get. Um and then of course Greg is the master networker and he's kind of the he's kind of the tip of the spear when it comes to a lot of this stuff because he's obviously the most outrageous person that we have and so he you know he's really great about outreach, really great about community building. Um, and then of course there's Colin who's also good with community uh building and and does a lot of our social work. Actually, he does all the social",
            "start": 1320.2
        },
        {
            "text": "really great about community building. Um, and then of course there's Colin who's also good with community uh building and and does a lot of our social work. Actually, he does all the social media stuff that we do right now. Um, in addition to being on all podcasts and writing. Colin was right. It's just taking more and more of his time. Um, but don't tell him I said that because we want him just we we want him to to keep tweeting for me so I don't have to. So there you go. And now Cool Greg uh is fl been floating around the office a lot lately. So he he he basically just teaches me all the cool catchphrases uh like juice. And today he was like, \"That's cool. I gotta cool down.\" I was like, \"What does that mean?\" He's like, \"Or else you're gonna heat up, dog.\" And I was like, \"All right, that's cool. I respect that.\" Alexander Gates says, \"Hey, Nick. I'm a massive Harry Potter fan, much like yourself. So, what's your favorite Harry Potter book and why?\" Harry Potter book was Prisoner of Azkaban",
            "start": 1359.2
        },
        {
            "text": "That's cool. I respect that.\" Alexander Gates says, \"Hey, Nick. I'm a massive Harry Potter fan, much like yourself. So, what's your favorite Harry Potter book and why?\" Harry Potter book was Prisoner of Azkaban because it was uh obviously one of the best books. Uh, I loved the relationship between him and Sirius Black and it was the last time Harry Potter had any hope until the very very end of the series. Um, favorite Harry Potter film, the first one. And the fifth and the last two, I didn't care for Prisoner of Azkaban as a film. I didn't like Alfonso Cuarón's uh direction of it. I thought it was visually too far away from what Chris Columbus had established beforehand. It jolted me and took me out of it. But a lot of people love that. That was a lot of people's entry point into the series. So, I get it. Not for me, though. Demetrius Newell says, \"Nick, how often do you and Kinda Funny cast get out to the East Coast? It would be really great to have the opportunity to meet you guys\"",
            "start": 1397.04
        },
        {
            "text": "So, I get it. Not for me, though. Demetrius Newell says, \"Nick, how often do you and Kinda Funny cast get out to the East Coast? It would be really great to have the opportunity to meet you guys in person. I am in the Air Force Station in uh Virginia, but can make trips to DC, New York, and and New York City to meet you guys. Uh Colin makes it out a lot. Obviously, he's got family there. We haven't had a reason to go to New York Comic-Con yet. And that's the big problem is like we haven't really been able to get out there for that as a group and so there's no real reason to be kind of in that area. What's up, Kev? Oh, I was just going to say I think our biggest issue with New York Comic-Con is it happens at the end of all the conventions. Yeah. So, we're really like exhausted by then. Yeah, generally. Yeah, but hopefully someday we'll go. I'd love to. I love New York. I've said it time and time again. It is the greatest American city. Um, and so I'd love to I'd love to go out there",
            "start": 1436.64
        },
        {
            "text": "generally. Yeah, but hopefully someday we'll go. I'd love to. I love New York. I've said it time and time again. It is the Greatest American City. Um, and so I'd love to I'd love to go out there to the uh the real America and uh and see all you guys on the East Coast. I'd also love to do a European trip as well. Nick Scarpino says, \"Hey, Nick.\" Mike Pedro says, \"Hey, Nick. Do you ever listen to Screen Junkies' Movie Fights podcast? I know Greg has participated in an episode of Gamer Fights and I think you'd be an excellent competitor in the film counterpart. Uh, ever thought of going on an episode? Hope you are doing well.\" Yeah, we know Andy. Um, we've we've mentioned it back and forth and throwing it back and forth a little bit, but scheduling is always a little bit of a of a pain. Um, I just did the Smoke Showdown, which was fun. Um, and I'm going to probably do another episode of that. I'd like to get on more podcasts about movies. I love talking movies and I like shooting the ****",
            "start": 1475.2
        },
        {
            "text": "Did the Smoke Showdown, which was fun. Um, and I'm going to probably do another episode of that. I'd like to get on more podcasts about movies. I love talking movies and I like shooting the **** on that. So, I think Screen Junkies would be a natural fit for me. Um, but yeah, well, I'm sure at some point we'll make that work. It's just scheduling is always a bear and we're always kind of crazy busy. But yeah, those guys are great. Um, Dylan Liebermann says, \"What is the best food related item to buy at Starbucks?\" I like the Protein Pack. Comes with an egg, some uh some white cheddar cheese, a little bit of peanut butter, one of those weird lavender breads, and some and some fruit. I love that. That's my favorite thing. Second close favorite are these little Egg Bites they're selling now because it's just solid protein. It's disgusting, but they're good. Yo, Nick, do you go do you have a go-to choke submission in jiu-jitsu or do you just take whatever you can get? Well, at this",
            "start": 1511.36
        },
        {
            "text": "now because it's just solid protein. It's disgusting, but they're good. Yo, Nick, do you go do you have a go-to choke submission in jiu-jitsu or do you just take whatever you can get? Well, at this point, I'm still a white belt. Uh, I'm getting my my bearings underneath me, but yeah, I pretty much just take whatever I can get. The what I normally end up in um because I still hate being on my back, so I always kind of I'm always basically working passing guard um and trying to get people into either side control or or to actually mount people. Um, what I what I get more often than not is the Kamaru. Um, because I feel like it's it's something you can get from a lot of different positions. Um, either Kamaru or Americana. Um, and I get that especially from out. I don't know why. I just always kind of find it right naturally right when I can um, sweep someone over into that. Um, but I also have really short legs and I know that's no excuse because that's the whole point of jiu-jitsu. But",
            "start": 1551.12
        },
        {
            "text": "Kind of find it right naturally right when I can um, sweep someone over into that. Um, but I also have really short legs and I know that's no excuse because that's the whole point of jiu-jitsu. But I'd love to be better at triangles and arm bars. Just the basic stuff right now is what I'm working on. Um working on passing, working on obviously just being more comfortable in general when people when I'm in bad spots. Um and so, you know, until I kind of work through all that base level stuff, I don't think I'm going to have a go-to. Um I can tell you I get caught in triangles non-stop. So, I think that's probably everyone in my gym's favorite uh choke to use on me. Uh cuz I leave my arm out there and I get choked pretty much every probably other time that I roll with someone. I just get caught in a triangle. Um but I'm working through it. We'll see. Um, I also do I also can actually pull off pretty wicked arm bar from mount as well, but it's just because I'm so heavy and I just put all",
            "start": 1592.08
        },
        {
            "text": "in a triangle. Um but I'm working through it. We'll see. Um, I also do I also can actually pull off pretty wicked arm bar from mount as well, but it's just because I'm so heavy and I just put all my weight on their chest and pull it back. Um, but uh Oh, and I'm working uh ankle locks right now. That's dangerous, but fun. Not heel hooks, ankle locks. Uh, hey Nick, do you feel This is from Christopher Leone. Leone says, \"Hey, Nick, do you feel like like Star Wars Episode 8 and IX will break away from the safe storytelling in episode VII and grow into its own epic trilogy?\" No. I'd like to say that it would, but I doubt it. I think we're going to get probably a very close proximity or facsimile of what we saw in episodes V and VI. So, while I want to say yes, and I'm sure they'll have some unique elements, I think it really is just going to be about I think episode VIII is just going to be about Rey's story and how she's coming up as a Jedi, and then episode IX is going to be her",
            "start": 1631.92
        },
        {
            "text": "Unique elements, I think it really is just going to be about I think episode eight is just going to be about Rey's story and how she's coming up as a Jedi, and then episode nine is going to be her fighting Kylo Ren again. And we'll see. Hopefully, I mean, it'd be great to see what they can do with that. It'd be great to see if they can get Kylo Ren back and they have to go fight Snoke or whatever the hell that thing's going to be. But, uh, I think Disney and Star Wars, uh, they know what they've got and they don't want to screw it up, and I think they're going to play it a little more safe on this one, then take some risks. The Assassin AK-47 says, \"Hey, Nick, what are your top five mafia movies? Do you like the genre?\" I, for one, love mafia movies, but what is your take on them? Also, tell Kevin, I want bongos. Kevin, the Assassin AK-47 wants bongos. You have to give it to him. Okay. Uh, top five mafia movies. You got to go with Goodfellas, The Godfather, The Departed, Casino, and...",
            "start": 1681.68
        },
        {
            "text": "movies, but what is your take on them? Also, tell Greg, I want bongos. Greg, the assassin AK-47 wants bongos. You have to give it to him. Okay. Uh, top five mafia movies. You got to go with Goodfellas. Probably my number one mafia movie. Followed by Godfather 1 and two, not three for obvious reasons. Um, I'm a huge fan of Casino as well. Um, although I'm not sure if I'd put I'd probably put Casino top five. Um, mafia movies. Mafia movies. Why can't I not think of any more mafia movies right now? Greg, what are your favorite mafia movies? Do you see a lot of mafia movies? Yeah. I mean, I really like The Departed, which shocks me that you don't like cuz I feel like I'm not a fan of The Departed. Yeah. And then um not a fan of The Godfather: Part III. Another big one that's uh Brooklyn Story, I think it's called. Brooklyn Tale, maybe something like that. Oh, a Bronx Tale. Bronx Tale. I love Bronx Tale. Oh, yeah. I never get that jazz commentary. Fantastic. I mean, those are the classics. Those",
            "start": 1720.16
        },
        {
            "text": "It's called Brooklyn Tale, maybe something like that. Oh, A Bronx Tale. A Bronx Tale. I love A Bronx Tale. Oh, yeah. I never get that jazz commentary. Fantastic. I mean, those are the classics. Those are the ones I end up watching more often than not. Goodfellas is one of... it's just the movie that when you see it, you and it's on TV, you have to keep watching it. It's so freaking good. Um, yeah, but that's those are probably somewhere on my top five list. Sean Penn says, \"Hey, Nick. I met you guys last year at PAX East. I accidentally ran into you in the bathroom or I told you that you were uh in the poop line and not the PE line. We made small talk and parted ways. It was the only time that weekend I managed to actually speak to you guys coherently during PAX. Name a time you were really nervous to meet someone. And also, do you remember that magical moment on the bathroom?\" I do remember that moment in the bathroom. Thank you for that. Um, I appreciate that. Um, a",
            "start": 1770.88
        },
        {
            "text": "really nervous to meet someone. And also, do you remember that magical moment on the bathroom?\" I do remember that moment in the bathroom. Thank you for that. Um, I appreciate that. Um, a time I was really nervous to meet someone. I mean, probably when we went down to podcast with Kevin Smith. That was like that was nerve-wracking because the whole day was nerve-wracking. He had to change it around a little bit on us cuz his dog was sick. U, we were up really late and you know, obviously you're just meeting an idol, so you don't it wasn't so much nervous that I I didn't think I was going to be able to perform or speak coherently around him. It was more just that I wanted him to be as cool as I thought he would be and he totally was. Um, and it was fantastic. It was very splendid. So, that was probably the last time I was nervous meeting someone. I get randomly nervous around um I get nervous around people sometimes in the industry that I should know better that I",
            "start": 1807.84
        },
        {
            "text": "Splendid. So, that was probably the last time I was nervous meeting someone. I get randomly nervous around um I get nervous around people sometimes in the industry that I should know better that I don't, which is weird. Uh, so a lot of game developers sometimes will come over and I'm like, \"Holy shit.\" Like, you know, Tim Schafer was here the other day and I'm like, \"I really want to impress Tim Schafer.\" And I ended up just talking about how badly my beard smelled for like a good hour. And Tim's like, \"What? Scarpino, what the **** you doing?\" It's a very strange day for me. But I've also been a little off lately. I'm not getting good sleep. And I ate some Girl Scout cookies last night, so I think they threw off my gut floor. Hey, Grant Atkins says, \"Hey, Nick. I need you to settle a long-standing debate between my friend and I about Ronald Reagan. Was he or was he not the homie? Thank you.\" Um, I don't know enough about Ronald Reagan to really talk about his politics. I know a",
            "start": 1852.4
        },
        {
            "text": "a long-standing debate between my friend and I about Ronald Reagan. Was he or was he not the homie? Thank you.\" Um, I don't know enough about Ronald Reagan to really talk about his politics. I know a lot of people love him as president. I know a lot of people like, you know, a lot of uh uh Republicans aspire to have fiscal policy like his. Um, from a personal standpoint, you know, he's very conservative. Uh, uh, Nancy Reagan was always like a pretty conservative voice in the community. So, I'll give him I'll say he was the homie. But uh and I can see how he could be the homie. He was definitely a G. You know, anyone who became who was an actor for a long time and decided to just run for governor and then president, you got to give him some a little bit of a little bit of something on that. You know what I mean? Uh Michael Crichton says, \"What do you think is the best Indiana Jones film?\" Uh no contest there. It's clearly Raiders of the Lost Ark. Nailed it. Um followed very quickly and",
            "start": 1886.84
        },
        {
            "text": "You know what I mean? Uh Michael Cera says, \"What do you think is the best Indiana Jones film?\" Uh no contest there. It's clearly Raiders of the Lost Ark. Nailed it. Um followed very quickly and very closely by The Last Crusade. Everything else is just not really working there. Yep. Um although all four of them are on Amazon Prime, so I've been thinking about marathoning them over the weekend. Oh yeah. I give a shout out to Temple of Doom because I when I was a kid, I thought that was the best Star Wars or excuse me, Indiana Jones film because that was the one that I saw first. Then I went back and watched Raiders. I was like, \"This is way better.\" Yep. Way better. Similar to how all of us thought Back to the Future 2 was better than Back to the Future 1. And then you see them back to back and you're like, \"Holy crap they really got this one out fast, didn't they?\" No, you're wrong. Back to the Future 2 is so good cuz it's Oh, I'm not saying it's bad. It's just not nearly",
            "start": 1936.16
        },
        {
            "text": "to back and you're like, \"Holy **** they really got this one out fast, didn't they?\" No, you're wrong. Back to the Future 2 is so good cuz it's Oh, I'm not saying it's bad. It's just not nearly as It's not nearly as beautifully well-made as the first one. Like the first movie script and acting and everything and cinematography is **** almost perfect. And then you watch the second one and it really is like because I watched them back to back and they had to refilm that that that last scene because they recast Jennifer. Um, and you're like, \"Well, this is just like this movie kind of looks a little thrown together.\" You can tell they spent a lot more money on the effects than uh than the rest of the shots. I would have thought I would have thought that the first one had a lot of trouble because they like reshot it after doing like a third of it, right? Yeah. But it's still really good. Yeah, it's one of my favorite movies. Uh Josh Betts says, \"If you were to\"",
            "start": 1977.6
        },
        {
            "text": "One had a lot of trouble because they liked reshooting it after doing like a third of it, right? Yeah. But it's still really good. Yeah, it's one of my favorite movies. Uh GameOverGreggy says, \"If you were to direct a movie, what would your basic premise be?\" And if that is too strong a question to think about for a Q&A, uh then what type or style of movie would you want it to be? Um I think about this a lot. I write a lot uh in my off time and I'm developing a lot of projects on the side. They always start as really like really small indies and then when I get to writing them um they become really raunchy comedies. So I think somewhere in that genre is where good old Uncle Nick needs to be uh playing around and anybody's playing around in that in that sandbox. Um, but you know, I've the last movie I wanted to write was about San Francisco and about how you can use the city. Um, you know, how people who are single can use the city as either, you know, a playground or a place to get lost in. Um,\n\nI corrected the following:\n\n* \"reshot\" (corrected from \"resshot\")\n* \"Josh Betts\" (corrected to GameOverGreggy, based on the metadata)\n* \"runchy\" (corrected to \"raunchy\", assuming it's a typo)\n* Capitalized proper nouns like \"GameOverGreggy\" and \"San Francisco\"\n* Left all other text intact, as per the instructions.",
            "start": 2014.32
        },
        {
            "text": "I wanted to write was about San Francisco and about how you can use the city. Um, you know, how people who are single can use the city as either, you know, a playground or a place to get lost in. Um, it's my big love letter to San Francisco when I think back to when I was single. Um, and you know, had these big moments, these these big times in my life where I had these big decisions to make and what the city meant to me. Um, I'd like to shoot that with the city as a backdrop. Um, but then uh we're not ready to talk about yet, but Greg and I are writing a script right now. Um, that could be very fun. So, we'll talk more about that premise as it comes close. Um, and as we can talk more about it. Uh, Josh Coller says, \"Where do you see your guys company in 10 years?\" Uh, deep legal battles probably. Uh, one of us will probably, if not two or three of us will be in prison, I have to imagine. Um, no. Honestly, in 10 years, gosh, I hope we um my hope would be that we're as diverse and as",
            "start": 2059.36
        },
        {
            "text": "\"Probably one of us will probably, if not two or three of us will be in prison, I have to imagine. No, honestly, in 10 years, gosh, I hope we um my hope would be that we're as diverse and as big as someone like Rooster Teeth. I'd really love to grow like see what our channels are going to look like in 10 years. I'd like to see, you know, I could envision us being in a big building with 30 employees in 10 years, developing things on the game side, working with sponsors in games, movies, comics, developing stuff for Netflix, Amazon, theatrical release if that's still around in 10 years. And just having our hands in everything. Having just a great crew of people like we've already been able to kind of start to form here, just further out with maybe even a young class of content creators on camera as well. I think that'd be really cool.\"",
            "start": 2102.4
        },
        {
            "text": "been able to kind of start to form here, uh just further out with maybe even a young class of content creators that can be on camera as well. Um I think that'd be really really cool. Hey, Kevin. Big C dog. Yep. Okay. Cool. Greg, bring me some water. Yeah. Thanks. My throat is super dry. Chris Johansen says, \"I'm not very educated on movies and which ones are the best and I would like to watch something that isn't Star Wars or Marvel. What movies, films, in your opinion are the best you have seen throughout your life that you could recommend? Thanks.\" Um, it's hard because my favorite movies aren't the best movies. That's just the way it goes. The movies that I that are my go-to movies are are ones that are very nostalgic most more often than not for me. Um, not to say I have terrible taste of movies, but you know, obviously I love um classics and I love really terrible bad movies, too. So, I would say for starters, I'll just name five off the top of my head. Uh, some of which I think",
            "start": 2151.92
        },
        {
            "text": "Of movies, but you know, obviously I love um classics and I love really terrible bad movies, too. So, I would say for starters, I'll just name five off the top of my head. Uh, some of which I think you'll like and some which you'll find a little weird. Um, let's go with Goodfellas. You should watch that. It's my top. It's probably my favorite mafia movie. We answered that earlier. Um, I'll say Blade Runner because you have to everyone that quote quote unquote studied film has to include that on their list. Um even though I happen to find it very beautiful. Um thanks cool Greg. No problem. I appreciate that. I'm going to take this and trade you. Hey, gracious. You know it's a mafia movie that I didn't think about before. I mean I think it is. Maybe it's a more of a heist movie, but Snatch and that's also probably my top 10. Yeah, that's kind of that's kind of mafious. Yeah, I really like Snatch. Um but I'm just going to run down a list for you right now.\n\nI corrected the following errors:\n\n* \"Good Fellas\" → \"Goodfellas\"\n* \"Bladeunner\" → \"Blade Runner\"\n* \"graci ass\" → \"gracious\"\n* Capitalized proper nouns like names and movie titles.",
            "start": 2195.84
        },
        {
            "text": "of a heist movie, but Snatch and that's also probably my top 10. Yeah, that's kind of that's kind of mafia-esque. Yeah, I really like Snatch. Um but I'm just going to run down a list for you right now. Ferris Bueller's Day Off. Anything John Hughes made basically. Breakfast Club, Ferris Bueller's Day Off, Sixteen Candles. Um, you can go, if you're going to go 80s, you can go Pretty in Pink, Say Anything, those are great films. Um, you want to go more in the western genre. I love Unforgiven. It's my it's my all-time favorite western movie ever made. Um, if you want to go a little bit more cheesy '80s, you got to go John Carpenter, in which case you should watch Escape from New York. You should watch The Thing, which is a crazy good horror movie. Um, kind of horror sci-fi. Um, and then you should watch one of my all-time favorite movies, which is Big Trouble in Little China, which is currently on Netflix. It will forever be on my queue until they decide to take it off Netflix and then I'll just",
            "start": 2237.92
        },
        {
            "text": "One of my all-time favorite movies, which is Big Trouble in Little China, which is currently on Netflix. It will forever be on my queue until they decide to take it off Netflix and then I'll just try to buy it somewhere else because I love having that movie in my life. That's my That's my I'm not feeling very good and I just want to eat crap food and watch the best movie ever made, movie. Um, so those are some fun ones to start with. Also, shout out to The Hunt for Red October. Um, which I love. John McTiernan. Oh, also Die Hard. Go back. Go watch Die Hard and stop messing around. That's the first movie you watch if you haven't seen it. Die Hard. Come on out to the coast. We'll get together. Uh Emily Bordon says, \"You said that one of your goals is to direct a feature film. What steps do you see yourself taking to progress toward that goal? Kinda Funny Shorts, the Taco Bell series. Also, could you please get uh Aaron Marqua as a guest for Kinda Funny, the animated",
            "start": 2274.56
        },
        {
            "text": "You see yourself taking to progress toward that goal? Kinda Funny Shorts, the Taco Bell series. Also, could you please get uh Aaron Marqua as a guest for Kinda Funny the animated series? He should be your rival for Nerdy Barb's Love. Um, I write a lot. Uh, and I'm developing a lot of different projects just every day. So, the animated series is one. Yes, we do want to do Kinda Funny Shorts, uh, eventually. Um, but ultimately, I think when it comes to like directing a full-length film, you just have to just kind of that's that's a harder target. Um, for me, I always kind of default to the writing. And so, you know, instead of trying to look at that in the long haul and be like, \"Oh, I want to be directing this film by the time I'm, you know, 38 or 39 or whatever.\" Um, I'm really just focusing on trying to write something awesome. Uh, and if that works out, then that'll be the one we try to make. And if it doesn't work out, then um, yeah, keep",
            "start": 2312.64
        },
        {
            "text": "Or whatever. I'm really just focusing on trying to write something awesome. And if that works out, then that'll be the one we try to make. And if it doesn't work out, then yeah, keep going. I'd love to have that experience at least once in my life to try to put something together. Not to be able to call yourself a director, but to just have something that you can be proud of that's a long-form project because there's so much work that goes into even making a fairly mediocre movie, let alone a great one. And right now it's just about sharpening those tools that we'll eventually need to get that done. And also just making the necessary context to get that done too because movies aren't cheap. And if you want to do them right, they're especially not cheap. And you need a lot of people in your life that you can surround yourself with who are ride or die for that project.\n\nI corrected phonetic mistakes and spelling errors, capitalized proper nouns (none were present), and left the original meaning, slang, and grammar intact. I also preserved filler text and incomplete sentences as they appeared in the original chunk.",
            "start": 2356.8
        },
        {
            "text": "Cheap. Um, and if you want to do them right, they're especially not cheap. Um, and you need a lot of people in your life that you can surround yourself with who are ride or die for that project. Jason, no last name. Just like Greg says, \"What do you think video game movies why do you think video game movies don't work? When are huge directors?\" When are a huge director, excuse me, I believe he said, \"When you are a huge director, will you ever make a good one?\" Um, I think the reason why a lot of video game movies don't work is because there's a lot of chefs in the kitchen. And in order to make a good movie, not even one based on a prior property, you have to have someone at the top that has a good creative vision and has a team of people that can support that creative vision and is given the sort of room and the space to breathe and let that vision come to fruition. Right? I think, and I don't know because I've never made movies before and I've never been in the Kinda Funny rooms",
            "start": 2395.68
        },
        {
            "text": "the sort of room and the space to breathe and let that vision come to fruition. Right? I think, and I don't know because I've never made movies before and I've never been in the in the in the rooms where people are talking about this stuff, but from what I read and what I hear in interviews, a lot of the reasons why movies fail is because people everyone working on them doesn't see them in the same light. Um, right? Everyone's kind of working against each other instead of with each other. Um, and so I think a lot of the reasons why the video game movies fail is because I I don't Well, I mean there's probably a myriad of reasons, but I have to imagine it's because there's a lot of stakeholders that want to see that they have a lot of, you know, a lot at stake in the projects. Um, take a movie like Assassin's Creed. Obviously, that's a huge huge huge franchise for Ubisoft, right? Um, and you've got Michael Fassbender and you've got Marion Cotillard, I think is was in that",
            "start": 2437.68
        },
        {
            "text": "Take a movie like Assassin's Creed. Obviously, that's a huge huge huge franchise for Ubisoft, right? Um, and you've got Michael Fassbender and you've got Marion Cotillard, I think is was in that movie. Um, again, I didn't see it unfortunately. I'll watch it when it comes on HBO. Um, there's a lot of writing on that and I think that, you know, when it comes down to it, it just it really just boils down to you have to have a good story with good character development and and and good people to back that up. And if if that if for whatever reason that's not your priority, if that's not every single person who's working on the film from the executive level to, you know, all the IP holder level all the way down to the, you know, the PA that's stopping traffic, um, you're going to have a problem. Uh, so, you know, I don't know. Can they make a good video game movie? Of course they can, because I mean, what are you really talking about here? You know, one one of the reasons why you probably",
            "start": 2477.36
        },
        {
            "text": "Uh, so, you know, I don't know. Can they make a good video game movie? Of course they can, because I mean, what are you really talking about here? You know, one of the reasons why you probably love all these video games is because the story in them is really good and keeps you going, as are the game mechanics. Um, so I don't think it's not beyond a shadow of doubt or a shadow of belief that someone could make a good video game movie. I just think it's just it just comes down to priorities, right? Often times it's just about like furthering the name of the series than it is more about that than it is about actually making a quality film. Um, because as we all know, success and quality don't necessarily have to be intermingling together for something to be to make money. You know, we've all seen the last three Transformers movies. Well, I haven't seen the last three Transformers movies and I'm like, \"These movies aren't very good at all,\"",
            "start": 2520.4
        },
        {
            "text": "You know, we've all seen the last three Transformers. Well, I haven't seen the last three Transformers. I saw the first two Transformers movies and I'm like, \"These movies aren't very good at all, but spoilers, they make a lot of money.\" So, I think when it comes down to it, I think the better question you ask is, do people actually care necessarily about making something that's good or do they care about making something that's profitable? Um, and sometimes the answer is um maybe they want just something to be profitable. I don't know. Again, take everything I say with a grain of salt. I've never made anything longer than like 10 minutes. So, what the **** do I know? Um, Apothecarian says, \"Hey, Nick, we all know you love your wife to death and that the joking about cheating and divorce are just your humor, but I got to ask, does that translate to home? Do you make similar jokes with her? And is that uh is that a just for the guys kind or is that just just the guys kind of thing?\" I",
            "start": 2559.92
        },
        {
            "text": "are just your humor, but I got to ask, does that translate to home? Do you make similar jokes with her? And is that uh is that a just for the guys kind or is that just just the guys kind of thing?\" I guess really what I'm asking is uh and I know this is a personal personal as **** What percentage of the real Nick do we see? Um, I definitely turned it on for the camera, but I mean I am me. Like none of us are playing characters here, so I talk to my wife very open and honestly about I mean I joke with her open and honestly about all the stuff. I know that's kind of silly to say. You can't really joke with someone open and honestly, but no, I mean I just I just am who I am, right? Um, we've talked openly about um what our relationship means to each other. We've talked about our fears of never being with other people. Uh, we've talked, you know, I I'm I'm about as subtle as a **** heart attack. So, when a good-looking girl walks by, like, and I look at her, my wife's not stupid. Um,",
            "start": 2599.92
        },
        {
            "text": "being with other people. Uh, we've talked, you know, I I'm I'm about as subtle as a heart attack. So, when a good-looking girl walks by, like, and I look at her, my wife's not stupid. Um, but I, you know, I have at least the decency to not pretend like I'm not a human being in front of her. Um, and she has the same respect for me. So, um, you know, we talk about all that stuff, but, you know, when you joke about things like that, you're really just saying to people like you're kind of just getting working through some of your own insecurities with it. And no one's 100% secure. And marriage is a is a hard thing, right? Marriage is something you have to work on every freaking day. Um, and so you owe it to yourself to have a little bit of humor about that. And if you're with someone who has a little bit of humor about it, too, then you're probably just going to be you're going to be just fine. But if everyone's so like hard up about like I have I have friends that are like their",
            "start": 2641.04
        },
        {
            "text": "who has a little bit of humor about it, too, then you're probably just going to be you're going to be just fine. But if everyone's so like hard up about like I have I have friends that are like their wives are like, I would never let him watch porn. I'm like, well, you know, you got to sleep sometime. That's what I say to you. Jose Gomez says, \"Two questions. One, favorite movie of all time.\" It's a movie target, but I'll get to that in a second. Two, upcoming movie that you are anticipating. Last and final, that's third question. You should totally compete in Screen Junkies movie fights. I saw Greg was in their spin-off show, Gamer Fights, and I believe you will kick ass. Uh, I agree as well. Well, guys said before, we were talking to those guys. We've always been talking to Andy and the bunch and the crew. Um, I'd love to go on that show for sure and we'll make it work one day. My favorite movie of all time is Ferris Bueller's Day Off follows. Nope. Top three favorite movies of all",
            "start": 2679.2
        },
        {
            "text": "The bunch and the crew. I'd love to go on that show for sure and we'll make it work one day. My favorite movie of all time is Ferris Bueller's Day Off, followed by The 1989 Batman and Big Trouble in Little China. I think I'll probably put those as my movies today - that always changes every time people ask me that question. Holy **** Sorry. Hold on, I have to text my wife. Let her know I'm filming something right now. Everyone hang out for a second. She never calls me during the day, so it might be an emergency. But you'll be back in a second. Okay. Um, upcoming movie that I'm anticipating is Logan, because we're seeing it next week, I believe, and I really want it to be good - even though I think we'll see how it goes. Patrick Cannon says, \"Nick, if you could be any '80s movie character, who would it be?\" Ferris Bueller, that's easy.",
            "start": 2720.24
        },
        {
            "text": "though I think we'll see how it goes. Um, Patrick Cannon says, \"Nick, uh, if you could be any '80s movie character, who would it be?\" Ferris Bueller, that's easy. Um, because Ferris Bueller can do anything he wants and everyone wants to have sex with him. Joseph Wag says, \"Hey, Nick. I was born in '89, making me a '90s kid.\" Nope, you're an 80s kid. Sorry, buddy. No, you're right. You're a '90s kid. Yeah, we'll get to that in a second. Which I kind of regret. Tell us why it would have been awesome if I was born 10 years earlier, 79. What makes the 80s so special? Also, please say buttholes in this AMA, too. There's never enough buttholes in our lives. It's something that's is that something that stems from the 80s. Love, Jerry Co. Um, but first off, buttholes. Hi. Uh, second off the 90s had a lot of great stuff going on it too. So, I'm not going to let I'm not going to sit here and let you despair in the 90s. I had my coming of age in the 90s, right? I was 10 when the ' 90s started.",
            "start": 2780.08
        },
        {
            "text": "a lot of great stuff going on it too. So, I'm not going to let I'm not going to sit here and let you despair in the 90s. I had my coming of age in the 90s, right? I was 10 when the '90s started. So basically my entire puberty threw out like this the whole sexual discovery area for me was in the 90s which I so that's that's an area a decade rather I look back with severe fondness if not a little chafing. Um the 80s to me was so special because obviously every decade is just kind of a direct reaction of the decade that came before it. Right. The 70s um had a lot of great things going on but it also had a lot of turmoil. The Vietnam War. Um, you had the the sort of hippie movement, you had the feminist movement start popping up. Um, the '80s was sort of the antithesis of all that in such a way where it was like instead of the free love and spirit, it was like the age of capitalism and the age of like neon and shoulder pads and everything had to be bigger and better. And so it was",
            "start": 2825.04
        },
        {
            "text": "a way where it was like instead of the free love and spirit, it was like the age of capitalism and the age of like neon and shoulder pads and everything had to be bigger and better. And so it was really kind of an interesting dichotomy in the 80s because while you had this like severe capitalism happening over here, you also had the birth of, you know, because of that you had the birth of like the Hollywood blockbuster that was happening, right? And you had the you had the first sort of um the stems of that of what we see as modern movie culture now, which is like take Star Wars for instance. Star Wars was really one of the first movies. I know it came out in the late '70s, but the Star Wars franchise that continued on through the 80s was really one of the first movies that was like, \"Hey, movies are more than just movies. Movies are toys and posters and and and TV spin-offs and cartoons and um all this sort of quote unquote synergy that you can get from this one big thing that's not",
            "start": 2866.32
        },
        {
            "text": "movies are more than just movies. Movies are toys and posters and and and TV spin-offs and cartoons and um all this sort of quote unquote synergy that you can get from this one big thing that's not that doesn't just stop when someone leaves the movie theater.\" Um, and so for me, that's why I love the 80s and that's why I love like living through that era because it just seemed to me that from especially from a movie standpoint, it was the first era of film where anything could happen. I mean, remember we're getting movies like, you know, that that start to have massive massive effects budgets or at least I'm sorry, massive massive um effects in them in that era. The stuff that we didn't no one could even have imagined uh before the advent of like computer-generated imaging uh before the 80s. So, you've got, you know, Star Wars, you've got Aliens that are coming out, things",
            "start": 2901.44
        },
        {
            "text": "So, you've got, you know, Star Wars, you've got I'm blanking on some of them now, but you've got movies like Predator that are coming out, you've got movies like Aliens that are coming out, things that are things that are are just honing that craft of of like these special effects that you've never seen before. Sorry to get lost in a little bit in this, but basically the reason why I like the 80s is because the '80s for movies uh was when you really really really liked there was just so many unique things happening during that era. There was so much competition that was driving so many people like Spielberg um uh uh James Cameron and all those all their crews to just do really really cool work. Um and I think that you know you see a lot of that now but there's just a magic that's lost that you don't see anymore in films because anything's possible now like you can you can do anything in a computer including remake your actors in a computer and that's just it loses a little bit of the heart and",
            "start": 2942.64
        },
        {
            "text": "see anymore in films because anything's possible now like you can you can do anything in a computer including remake your actors in a computer and that's just it loses a little bit of the heart and soul of it. Back, you know, back in the 80s, you had to really, really be you had to have a really, really uh creative uh crew of people who could make films to make those effects to make to make those realities come to life. And now we just kind of generate them by computer. Not to not to, you know, in any way, shape, or form uh uh throw shade on people who work in, you know, do CGI for movies, but back in the day when they'd have to do the practical effect of like uh uh from Poltergeist where the film, the house sucks itself into a hole, like they physically had to do that. They had to build the scale model and and figure out how to pull the whole thing through itself, you know. So, there's just a specialness to that that I don't think we're ever going to see again. Um, because it really",
            "start": 2984.4
        },
        {
            "text": "the scale model and figure out how to pull the whole thing through itself, you know. So, there's just a specialness to that that I don't think we're ever going to see again. Because it really was the birth of a brand new era of cinema. And pop culture in general. Let's get to couple more questions here. Tyler Drummond says, \"Hey, Nick, are you interested in writing more original scripted content like the animated series? And how has that experience been for you? Each episode is better and better than the last one, and TR episode was exciting, was exceptional writing.\" Yeah, absolutely. And I, like I said before, I write constantly. I always write. I write at least an hour a day every day. Sometimes it's blank. Sometimes I'm just typing the same word over and over again. And sometimes really fun thoughts come out of my brain. But I always have a bunch of projects that I'm working on depending on the mood that I'm in or what's happening.",
            "start": 3023.04
        },
        {
            "text": "and over again. Um, and sometimes really fun thoughts come out of my brain. Um, but I always have a bunch of projects that I'm working on depending on the mood that I'm in or what's happening. Um, but I'd love to do more of that work uh and present that to you guys. You know, Tim Gettys and I have always talked about floating the idea of doing shorts or sketch comedy. Um, but really the the the sort of uh the brass ring for me is is a feature film one day. And so that's those are the kinds of projects that I sort of tend to gravitate toward. Um, Stephen Patrick Moore says, \"What was your favorite episode of Psych?\" **** It's been a while since I've seen Psych, but I want to say the any of the Halloween episodes they did for Psych were always fun. There was one episode that sticks out. Oh, no. Anything with Mary McNamara was really really fun. Pretty much anything where like any of the season finales with the killer. Lots of good episodes like I can't really think of one specifically",
            "start": 3066.0
        },
        {
            "text": "Oh, no. Anything with Mary too was really really fun. Pretty much anything where like any of the season finales with the killer. Lots of good episodes like I can't really think of one specifically right now because that's just kind of Psych in general, but but yeah, I'd have to I'd have to think hard on that one. Um, Amy Gill says, \"Nick, if you could star in any movie since the 80s, what would it be and why?\" Uh, I always wanted to be Batman, so it would have been the 1989 Batman. Would have been the worst movie ever made cuz I was very chubby at 9 years old. I would have looked really weird in the suit, but that would have been it. Um, and last question for today for this AMA is coming from Tyson Williams. He says, \"If there was a theme park for all of cinema history, what would you put in that park?\" A theme park for all of cinema history, what would you put in that park? I mean, oh jeez, I don't know. Um, you'd have to have some sort of, I would imagine, themed ride for every",
            "start": 3114.28
        },
        {
            "text": "\"Put in that park?\" A theme park for all of cinema history, what would you put in that park? I mean, oh jeez, I don't know. Um, you'd have to have some sort of, I would imagine, themed ride for every single cool movie. So, you have to have a Harry Potter ride, a Jurassic World ride, a Raiders of the Lost Ark ride, um, a Star Wars ride, a Marvel ride. Pretty much it would just be Disneyland, I guess, at this point, if I'm being 100% honest. But then of course I would want the only thing I would ask is that there actually be an amazing movie theater that has like that projects old prints of old movies on with an actual projector that aren't digital. I think that'd be really really cool cuz when you see a movie like Interstellar and you forget what it looks like to actually see something projected on film. Um, it's it's a pretty special thing and a lot of people are like oh wait Star Wars was shot on film and all these things were shot on film. They were but seeing something actually",
            "start": 3151.68
        },
        {
            "text": "projected on film. Um it's it's a pretty special thing and a lot of people are like oh wait Star Wars was shot on film and all these things were shot on film. They were but seeing something actually projected on film is something that's very very rare because I could be wrong about this. I I I never looked it up, but I'm pretty sure when you go see Star Wars, it's still a digital projector. Even though they acquired the actual image on film, that image was digitized and moved over to um to basically just be ones and zeros after that. Yeah, maybe they'll go back to film for the for the final print to show and to and to project, but at a certain point, you're already doing a digital intermediate. And so, you know, you've uh you've just you've lost a little bit of the magic of actually that projecting. Cuz when I was a kid, you used to actually go in and you'd see the burn marks. You'd see all the scratches and hairs on the film. You'd hear the projector, which was always awesome because",
            "start": 3190.96
        },
        {
            "text": "Cuz when I was a kid, you used to actually go in and you'd see the burn marks. You'd see all the scratches and hairs on the film. You'd hear the projector, which was always awesome because it would like lull you into that that sense of like that subconscious sense of disbelief where you like suspended belief, you know, suspension of disbelief rather. Um, so yeah, I would definitely do that. And that is all she wrote for this AMA. Uh, remember if you want to participate in the next AMA, you can support us over on patreon.com/kindafunny or patreon/kindafunnygames. Patreon.com/find kindafunnygames. If you uh want to talk more games, you want to talk movies, you can support us over on our OG channel. Um, and if you just want to watch our content and stay in the relative obscurity of uh your dark basement or wherever you're at, well then that is up to you. You can do that if you want. Uh, but we appreciate the interaction. I appreciate all the questions. I love you all and we will see you",
            "start": 3230.08
        }
    ]
}