{
    "id": 154,
    "video_id": "9sOZ7xtQStg",
    "show_name": "A Conversation With Colin",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "Cable News Shouldn't Be Your Only Source of News - A Conversation with Colin",
    "description": "Colin is kind of obsessed with news -- so what does he think of the 24-hour news cycle?\n\nToday's topics were submitted by @MooreSaiyan. Leave your suggestions for future conversations in the comments below.\n\nSUBSCRIBE/LIKE/SHARE\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nSubscribe to our channel: http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Tim for filming.",
    "published_at": 1383660002,
    "duration": 578,
    "transcript_chunks": [
        {
            "text": "You do watch MSNBC, why do you watch MSNBC though to antagonize myself? What's up everybody. Welcome to A Conversation with Colin. I'm Greg, and this is my roommate Colin. Now sometimes Colin says crazy stuff. So every Tuesday and Thursday, I reach into my random topic pile, pull one out, toss it at them, and we talk it out for your amusement if you like that. Like the video, subscribe to our channel, share us with your friends. Are you ready? Yes. Today's topic of conversation is 24-hour cable news channels from @MooreSaiyan. How do you feel about them? They're fine; they're interesting. CNN sucks. I think that they... I think that you like Fox. No, actually. Like I said, I watch MSNBC. You do watch MSNBC, why do you watch MSNBC though to antagonize myself? Doesn't watch it for any kind of news gathering information. I think you originally told me you did it to keep one eye on the liberal agenda. Yeah, no... I got to keep... got to keep one eye on the liberal agenda. Right, right, right, right. No, I I",
            "start": 0.04
        },
        {
            "text": "Information, I think you originally told me you did it to keep your eye on the liberal agenda. Yeah, no, I got to keep one eye on the liberal agenda right, right, right. No, I watch...I don't watch Fox News. Everyone's like, \"Well, go watch more Fox News.\" Like, I don't watch Fox News. I know how I feel. Yeah, I don't need to like watch someone like re-reassess the way I feel about things, even Fox News though. I don't think they reassess how you feel most. No, but I mean like they're...yeah, yeah. I mean like, yeah. Now with that said, I read Drudge Report every day and Hot Air and stuff like that - those are conservative news sites. But I like watching MSNBC because A) I like some of the people on there; like I like Chris Matthews and I like Rachel Maddow a lot. I think Rachel Maddow is super smart. Rachel Maddow is a road scholar, she's not a dummy. Yeah, and I respect that. Um, you know, as opposed to like Sean Hannity who barely graduated high school.",
            "start": 47.2
        },
        {
            "text": "Rachel Maddow is a road scholar, she's not not a dummy, yeah, and I respect that. Um, you know, as opposed to like Sean Hannity who like barely graduated high school, you know, like so um I'm not saying Sean Hannity isn't a smart dude too he obviously is so like where he is he makes a lot more money than anyone MBC so he's got to be pretty smart but um I appreciate their perspectives I think that they're wrong about a lot of stuff but I need people to challenge the way I feel than tow the line on the way I feel like I I don't understand consuming news exclusively reaffirming the things you already know about how you feel like it doesn't make any sense to me it doesn't make me feel like when I'm watching like Sean Hannity or Gretchen Carlson talking about how much they hate the debt, like I already **** hate the debt I already know that I don't need **** Gretchen Carlson to tell me that like what does Lawrence O'Donnell's dumbass have to say about it",
            "start": 83.0
        },
        {
            "text": "they hate the debts like I already **** hate the debt I already know that I don't need **** Gretchen Carlson to tell me that like what does Lawrence O'Donnell's dumbass have to say about it tonight and so I'll go to MSNBC and I'll watch that instead okay do you think this is a problem with news coverage for 24 hour networks that we're talking about the fact of if they're liberal or Republican leaning that you want to go there and have your beliefs challenged that's I don't that's not what the news should do yeah but the straight news straight news give me that straight news straight news doesn't have like there's no 24-hour News Channel headline news I guess with with straight news coverage like that's not what people want people have this illusion like this ignorant illusion that like there was a time and a place in America where like news was unbiased like that's **** ridiculous like back in the day of broadsides and Broadsheets like they were they were bi as biased as they",
            "start": 125.04
        },
        {
            "text": "There was a time and a place in America where, like, news was unbiased. That's ridiculous. Like back in the day of broadsides and broadsheets, they were biased as they are now. Go read about the Boston Massacre in Boston in 1770 and read those newspapers and say how straight news they were. Give me a break. Like it's always been that way – the news has always been tainted by perspective. And that's okay because you know news is factual, and you read the AP or Reuters, and it's like, \"This happened today, blah blah blah.\" It's boring. That's cool, yeah. And I read the AP every day; I read the AP every day for 45 minutes on the train, both to work and on the way back. That's all I read; that's all I do is listen to music and read the AP. Yeah, some AP you're all set, yeah. And like because that's like giving you this is what happened today in Rwanda, this is what happened today in Washington, this is what happened today in",
            "start": 162.72
        },
        {
            "text": "yeah 31 some AP you're all set yeah and like because that's like that's giving you like this is what happened today in Rwanda this is what happened today in Washington this is what happened today in you know the UN and then like you go to a place like Drudge or Hot Air or you you watch MSNBC or Fox News and you get a little bit of perspective on it about how other people feel about it because perspective is reality Optics are really important in politics so it's about not what happened but about how that is going to shape The Narrative of that particular political you know ideology you yeah or just like the the you know for instance like the whole IRS thing with like the Tea Party like we all know that the IRS is biased right like the IRS like went after conservative groups for tax purposes we know that that happened now like what does that mean like that you could tell me like that happened and that's cool but like why is Lois Lerner a bad person like why did the Cincinnati IRS",
            "start": 201.24
        },
        {
            "text": "We know that that happened now, like, what does that mean? Like, you could tell me that happened and that's cool, but like, why is Lois Lerner a bad person? Like, why did the Cincinnati IRS office do this, and like, what does that mean? Where did these people come from, and like, what kind of perspective illustrates the way they feel about these conservative groups? That's the stuff that's really interesting to me. It's like it's like reading history. My old history professor used to tell me this is a common thing in history when you study it. History is 10% facts and dates and 90% interpretation of those facts and dates, and so I know that Yorktown happened in 1781, but why was Yorktown important? I could study the columns and like see how the units fought each other, but why did they fight like that, and why did Washington beat Cornwallis, and how did that happen, and what were the repercussions of that, and how did that lead to the Treaty of Paris.",
            "start": 245.96
        },
        {
            "text": "each other, but why did they fight like that and why did Washington beat Cornwallis and how did that happen and what were the repercussions of that and how did that lead to the Treaty of Paris in 1783 - that's what's important, you know. So it's very much informed by how I feel about history. So do you think part of the problem is that people, Average Joes, aren't reading the AP they're just going to MSN or Fox and then saying that that is the news? Sure, that they're getting a skewed perspective and taking it as fact, fact, fact, fact. That's a problem. But I think people need to know what they're getting themselves into because I don't think MSNBC or Fox News portray themselves as being like the dirty, raw news. Like I don't think MSM is fair and balanced - that's a Fox thing. The thing about well, I'll get to Fox in a minute but like the thing with MSNBC is like they their whole thing is \"lean forward\" it's like a total nod to them being left-wing you know",
            "start": 286.84
        },
        {
            "text": "Is Fox News the thing about well, I'll get to Fox in a minute, but like the thing with MSNBC is like they're their whole thing is \"Lean Forward\" - it's like a total nod to them being left-wing. You know, like Lean Forward, like, don't lean right, don't lean left, down the middle way. They mean I'm saying that's how they spin it when they talk about it, that's not what it means. Like you know, like when and their commercials are all about if you watch their commercials with like uh Lawrence O'Donnell or you know Chris Matthews, whatever, it's all about how conservative ideas are bad. Like, that's all their commercials - \"we attack Social Security\" but this is what blah, like it's all like they don't hide it. And like so when people give MSNBC a hard time I understand, MSNBC has no viewers and like they're tanking, but like they are what they are. And I think with Fox News, I think Fox News is more",
            "start": 327.52
        },
        {
            "text": "and like so when people give MSNBC a hard time, I understand MSNBC has no viewers and like they're tanking, but like they are what they are. I think with Fox News, I think Fox News is more watched than CNN and MCN can buy times too, like there the Fox News has like a totally thriving business, but people have this whole opinion that Fox News is totally biased to the right, and it is in a sense with some people, but it actually has much more balance than MSNBC because there are people like Bret Baier, um, that you know, that are totally like news-oriented and straightforward or whatever. But when you have people like Sean Hannity, um, on there, great of ancestry is another great example of a person who has really no agenda, but when you have someone like, um, John Stossel, or, or you know, who's like a hardcore libertarian, I love John Stossel, so like when you have those kinds of guys, I understand why that people think that about them, but actually, I think Fox News is actually a lot more fair.",
            "start": 370.16
        },
        {
            "text": "like a hardcore libertarian I love John Stossel so like when you have those kinds of guys I understand why that people think that about them but actually think Fox News is actually a lot more fair and research about the two channels have shown that Fox News is much more balanced than MSNBC so people don't want to pay attention to that that's fine I don't think I don't think uh I don't think Roger Ailes is sitting there in his ivory tower really giving a **** what people think about Fox News as he counts his million dollar bills uh but so you know so yeah it's bad because I want people to get their news I want people to inform themselves in a way but I'd rather people watch MSNBC or Fox News and not pay attention at all sure because at least it doesn't show a level of apathy that is ruining the discourse in this country and destroying us from the inside because people like well I don't give a **** about what's going on in the UN cuz I'm going to eat at McDonald's tonight",
            "start": 410.0
        },
        {
            "text": "ruining the discourse in this country and destroying us from the inside because people like well I don't give a **** about what's going on in the UN cuz I'm going to eat **** McDonald's tonight and watch you know Dancing with the Stars like go **** yourself at least turn on the **** Fox News or MSNBC and at least get a taste of what's going on in the world sure it's not ideal but that's better than nothing which is what most people are getting because when you look here's the interesting thing Greg when you look at the numbers MSNBC will get 7 or 800,000 viewers on a show a night right Fox News will do like two and a half million viewers a night and CNN will do like worse than even MSNBC when you combine those numbers and it's like 4 million people watching those channels at any one time there are 310 million people in this country like that is not dictating the course of like politics or the apathy in this country it's just illustrative of how few people are engaged and even",
            "start": 447.0
        },
        {
            "text": "Time there are 310 million people in this country, like that's not dictating the course of politics or the apathy in this country. It's just illustrative of how few people are engaged. And even people who watch something like Brian Williams on MSNBC or NBC News every night on your regular channel, like your regular NBC channel, it's like 7 million people. Think about all the people that are not watching anything at all, not reading the news. IGN is a huge site; we have millions of readers. We're by far the biggest video game website in the world. There are websites like that, like Drudge Report. Right, Drudge Report has you know millions of readers too. Drudge Report is bigger than IGN, right? But that's still a really small amount of people per capita. In other words, there's just a huge group of people in America, a majority of people in the United States are not reading news at all, not watching news at all.",
            "start": 483.68
        },
        {
            "text": "Amount of people, yeah, per capita, there in other words, there are just a huge group of people and a like a majority of people in the United States are not reading news at all, not watching news at all, have no idea what's going on. That's what I'm concerned about, not cable news. Here I am depressed again, thanks Colin. Thank you, at Moriarty. Uh, ladies and gentlemen, what do you think of 24-hour news channels? Let us know in the comments. Then leave your suggestion for future conversations with Colin. We'll be back every Tuesday and Thursday, so like subscribe, share, and have a conversational day. Andrew Jackson is just crazy. Also, there's another great story about Andrew Jackson: he used to let people into the White House a lot of presidents used to do that for parties and stuff like that, and a dude walked up to him; an assassin walked up to him and tried to kill him, and had two pistols, and both the pistols jammed, and Andrew Jackson beat the **** out of him.",
            "start": 525.56
        }
    ]
}