{
    "id": 160,
    "video_id": "Aq8kHZeIKJc",
    "show_name": "A Conversation With Colin",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "Has YouTube Made Greg and Colin Closer? - A Conversation with Colin",
    "description": "Greg and Colin have been doing this YouTube thing for a hot minute. Are they better friends because of it?\n\nToday's topics were submitted by @BABBY3009. Leave your suggestions for future conversations in the comments below.\n\nSUBSCRIBE/LIKE/SHARE\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nSubscribe to our channel: http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Tim for filming.",
    "published_at": 1384437602,
    "duration": 394,
    "transcript_chunks": [
        {
            "text": "Doing like I always said, I've never said this publicly, but we've said to each other, \"I'll keep doing Conversation with Colin until the show doesn't grow anymore.\" What's up everybody? Welcome to A Conversation With Colin. I'm Greg, and this is my roommate Colin. Now sometimes Colin says crazy stuff. So every Tuesday and Thursday, I reach into my random topic pile, pull one out, toss it at them, and we talk it out for your amusement if you like that. Like the video, subscribe to our channel, and share it with your friends. Colin's ready today's topic of conversation is: Has making these YouTube shows made us closer? From @BABBY3009: Are we close because of these shows? Um, we're already really close, but I don't think so. I honestly don't think so. I mean, I think it has... yeah, yeah. I mean, like you know when would I ever find out how ticklish you are and hear that you know... I mean, like there's little things I think most of the time when we're talking we know where",
            "start": 0.32
        },
        {
            "text": "I mean, I think I mean, like, you know when would I ever find out how ticklish you are and hear that you know, I mean, like there's little there. I think most of the time when we're talking, we know where the conversation's kind of going and how the other feels about something, but then we get to these things like where I don't think we've ever talked about, like religion, like we did in the Ghostbusters episode and stuff like that. We definitely get to have more I understand that yeah, I guess I see it from that like what you know about the person sure yeah um but yeah I always well we were unusually close to begin with so like you know I think that it's brought us into a different era of our friendship whereever now we have like basically a business like and like we buy shirts um and we yeah we we are pursuing something together that I think brings us closer also with our partners Tim Gettys and Nick what up boys um so why' you raise your hand, Nick no one you know no camera can see you excited so like the four of us",
            "start": 42.24
        },
        {
            "text": "Something together that I think brings us closer also with our partners Tim and Nick, what's up boys? Um, so why'd you raise your hand, Nick? No one can see you excited. So like the four of us, I think have been brought closer generally because of our endeavor to do this, yeah. Um, and then I think you and I have been um, yeah, brought closer in the sense that we've learned more about each other for sure. Um, what's interesting I think is that you know everybody knows we work at IGN together and for years we're on the PlayStation team together, but since I've moved over to be video and you do the PlayStation, we rarely talk at working. We used to have desks right next to each other; we'd talk all the time back and forth. But I'm never at my desk, you rarely are too – you're always running around doing something. So we actually don't talk anymore, and we come home, and then we you know I watch Nashville or play games, or you go do whatever the hell you do back there; you don't want to know.",
            "start": 83.32
        },
        {
            "text": "\"Doing something so we actually don't talk anymore, and we come home, then you know I watch Nashville or play games or you go do whatever the hell you do back there - you don't want to know, I don't want to know. So I think I think I look forward to these things because we get to hang out and goof around. Yeah, I look forward to conversations with Colin because it's just it's fun, and I'm glad people enjoy the show, and the show is growing, so that's cool. Um, and I'm happy about that because you know we started this - the idea for the show came from you, it was your idea, and you know I had nothing to do with it, I didn't really care about this stuff until you were the one who was like 'I wanted you to do the show with me.' The idea for the show was like I'm crazy right? Like and I say funny things but the show seems to resonate most with people when it's more serious and thoughtful - and that was something I don't think we expected. Now there are examples of that not.\"",
            "start": 122.72
        },
        {
            "text": "like and I say funny things but the show seems to be more resonant with most people when it's more serious and thoughtful, and that was something I don't think we expected. Now there are examples of that not being true - The Star Wars episode is like one of the most popular ones we've done, and that was funnier. Girl Meets World is the most popular show we've done, and that one's funny, but I liked that yeah we've gotten to know each other better, we've gotten to talk about a lot of different kinds of things, but also it's gotten me heart with the people on the internet who follow us and like us, especially they really like you and follow you because they like the more intellectual conversations, they like the more serious stuff, and they get to know a little side of me that I don't think a lot of people know, like because the internet's all about tweets and bursts and information and labels and stuff like that it's like get this dog you talking I'm",
            "start": 158.36
        },
        {
            "text": "\"Don't think a lot of people know, like because, because the internet is all about tweets and bursts of information and labels and stuff like that. It's like, get this, you're talking, I'm listening, sure, just... and it's just about, like, you know, hey, shut up, man, he's... and he's just about, like, you know, he's a Republican or he's this or he's that, but like, there's nuance to everything. I feel like I don't like being put in a box, and this show lets me, sure, it gives us the pulpit to talk about something outside of games, and it lets me express, like, the views in a more eloquent way sometimes about uh, the way I feel about certain things, and that I'm not what you think, um. And so I like that aspect of the show. Um, I was like, what I find interesting is, you know, you're talking about the fact that our show hits with serious topics, I find it super cool that like, the shows that are like, the most... and I'm not talking about like, The Girl Meets World or like, where we\"",
            "start": 199.0
        },
        {
            "text": "talking about the fact that our show hits with serious topics I find it super cool that like the shows that are like the most popular and I'm not talking about like Girl Meets World or like where we have spikes, the ones that are consistently outperforming the rest are when it's just us talking about us, you know what I mean, like how we met or what about this or I'm sure this episode when we talk about like if just our relationship, you know what I mean because we always I always talk about the fact that by watching these or listening to the podcast right you're you're a friend and not just a fan and I think that when we get to just sit around and be you know what I mean like one of the most popular topics is just us, you know just us this friendship that we all kind of share yeah it's cool I'm I'm I'm happy about that I mean I always say that you know you're obviously going places and it's cool to usually go to Wingstop, yeah somewhere to get food and it's it's cool to be on the",
            "start": 240.96
        },
        {
            "text": "I'm happy about that, I mean, I always say that you know you're obviously going places and it's cool to usually wing restaurants, yeah, somewhere to get fatter and it's it's cool to be on the ground floor and like be like employee number zero kind of of like your Apple as it were, yeah, you know because I like it's so obvious that big things are in store for you, you know, and like just by proxy I'm going to be a part of it and that's kind of cool like we I always kid about like when we were trying to get our company together and talk about this kind of stuff that like my show is still your biggest show, you know, and like but that's more of a joke than anything else because eventually like the things you do are going to outshine the things that we've done together and it's cool to just be able to um be able to go with you on that journey like I'll be there, you know, and like so that this show and doing this stuff together has opened up doors for us collectively",
            "start": 271.24
        },
        {
            "text": "just be able to um be able to go with you on that Journey like I'll be there you know and like so that that this show and and and and doing this stuff together has opened up doors for us collectively that I think is really cool too so yeah so yeah I'm more moreover not even answer his question I'm just happy that people like the show and we'll keep doing like I always said I've never said this publicly but we've said to each other like I'll keep doing A Conversation With Colin until the show doesn't grow anymore yeah so like this might be the last season I doubt it unless there's a lot of people who have differing opinions on gay rights that'd be the only thing that gets us in trouble probably but ladies and gentlemen thanks so much for watching we love you so much Colin I love you too thanks for being a part of this @BABBY3009 thanks for your question do you have one ladies and gentlemen let us know in the comments maybe you could be on the next A Conversation With Colin then let us know",
            "start": 313.72
        },
        {
            "text": "for being part of this @BABBY3009, thanks for your question. Do you have one, ladies and gentlemen? Let us know in the comments. Maybe you could be on the next Conversation with Colin. Then let us know if you think we're closer - are we closer to you because of these shows? Who knows? Just put something in the comments; I don't care. It looks good to YouTube when we do that, and until then, like the video, share it with your friends, subscribe to us here, and until next Tuesday or Thursday have a conversational day. I might or might not have something to say about botany or shoelaces - I don't know. You haven't asked, really, but uh, you know, I do like plants as the scientists might call them",
            "start": 354.96
        }
    ]
}