{
    "id": 3016,
    "video_id": "awhSFhHTQUM",
    "show_name": "Cooking With Greggy",
    "hosts": [
        "Greg Miller",
        "Geneviève St-Onge"
    ],
    "title": "How to Make Firehouse Chicken - Cooking with Greggy",
    "description": "Subscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nGet Cooking with Greggy one week early: http://www.patreon.com/kindafunny\n\nBuy the Cooking with Greggy Shirt: http://www.kindafunny.com/store\n\nFIREHOUSE CHICKEN STEP-BY-STEP INSTRUCTIONS\n1) Purée garlic, vinegar, olive oil, salt, parsley, paprika, pepper, and ½ cup vegetable oil in a blender until smooth. Don’t got a blender? Chop it up, kid. Place chicken in a large resealable plastic bag and pour marinade over. Seal bag and chill chicken overnight.\n2) Remove chicken from marinade and pat dry with paper towels. Let sit uncovered at room temperature 1 hour.\n3) Preheat oven to 400. Coat the cast-iron skillet with olive oil and place the chicken skin down in it. Put the skillet (with the chicken already in it) on the stove at medium-high heat. Cook until skin is browned and crisp, 15 to 20 minutes. Flip it over, kid!\n4) Roast chicken in oven, skin side up, until cooked through and an instant-read thermometer inserted into the thickest part of thigh registers 165°, 20–25 minutes. \nOriginal Bon Appetit Recipe: https://www.bonappetit.com/recipe/firehouse-chicken\n\nINGREDIENTS FOR FIREHOUSE CHICKEN\n4 garlic cloves, chopped\n2 cups distilled white vinegar\n½ cup olive oil\n¼ cup kosher salt\n2 tablespoons chopped fresh parsley\n2 tablespoons paprika\n1 tablespoon freshly ground black pepper\n1 cup vegetable oil, divided\n2 Bone-in chicken thighs\n2 Bone-in chicken breasts\n\nBRUSSELS SPROUTS STEP-BY-STEP INSTRUCTIONS\n1) Preheat oven to 400 degrees.\n2) Got a bunch of Brussels sprouts? Wash’em, peel off the yellow leaves, cut off their butts, and cut’em in half.\n3) Place the sprouts in a plastic bag, pour enough olive oil to coat them, and season with salt and pepper. Seal tightly, shake to coat. Pour onto a baking sheet, and place on center oven rack.\n3) Roast in the preheated oven for 30 to 45 minutes, shaking pan every 5 to 7 minutes for even browning. Reduce heat when necessary to prevent burning. Brussels sprouts should be darkest brown, almost black, when done. Adjust seasoning with kosher salt, if necessary. Serve immediately.\nOriginal Recipe: http://allrecipes.com/recipe/67952/roasted-brussels-sprouts/\n\nINGREDIENTS FOR BRUSSELS SPROUTS\nBrussels Sprouts\nOlive Oil\nSalt\nPepper\n(You eyeball all of this. Don’t fret. Have fun.)\n\nFARRO STEP-BY-STEP INSTRUCTIONS\n1) Boil a shitload of water.\n2) When the water’s boiling, toss the farro in.\n3) Strain it.\n4) Bam -- that’s a great side.\n\nINGREDIENTS FOR FARRO\nA shitload of water\n1 cup of farro\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery Monday for 8 weeks, Greg's bringing you a dish so easy HE could cook it.",
    "published_at": 1506355039,
    "duration": 910,
    "transcript_chunks": [
        {
            "text": "[Music] what's up everybody on today's menu firehouse chicken farro roasted Brussels sprouts how are usual VF Saint Dom's meal a little hungover okay that may come into play in other episodes we'll stand by show me up say how good is firehouse chicken it's really really good yeah what'd you like about it the Chris penis skin yeah and then it's got a lot of kick to it yeah the big part of the kick of course is the fact that it marinates at least overnight now I say at least overnight cuz you can go up to three days however you could also just do it like an hour a half which I did that one time the first time you ever had it which worked fine wait CeCe how potent it is now it's got punch you in the face with food and flavor so let's time travel back to yesterday when I started the marinade so we're gonna make the marinade here in my ninja blender I don't know why I said a ninja like they paid for the show actually didn't I should have blocked this out and made them pay for it doesn't",
            "start": 1.16
        },
        {
            "text": "so we're gonna make the marinade here in my ninja blender I don't know why I said a ninja like they paid for the show actually didn't I should have blocked this out and made them pay for it doesn't matter the point of telling you about the blender is that when I started doing this recipe a few years ago I did not under any circumstance use a blender didn't have one didn't use it just chopped it all by hand put it into a bag and it worked out just as well so first off we need to start four cloves of garlic got it here really get in there and get through all this stuff I always overuse garlic by the way if you'll notice as you go through any four cloves I'm gonna chop them up but I'm gonna go for the big bad ones and then I'm probably to go more like six just because garlic's awesome isn't that right Nick scarpino yeah boy thank you boy I'm not gonna smash them I'm good at area so we got these guys right yeah I'm a big six over here got all this junk - all right you know what I'll do",
            "start": 62.53
        },
        {
            "text": "that right Nick scarpino yeah boy thank you boy I'm not gonna smash them I'm good at area so we got these guys right yeah I'm a big six over here got all this junk - all right you know what I'll do seven cuz I have seven broken them I should give credit where credit's due this is an old bone Appetit recipe I found it my mom had an issue when I went home once a bone Appetit for some reason and I'm sure Jaime kill me she was here hearing me say bone Appetit border it's because you put a lot of emphasis on the bone I'm bone into maybe I'm boning your like it's like you're talking about boning another human being sure that's chopped pretty well you know forgetting us again it's going in a blender but I think you do this to express it like I said you don't need the blender don't feel like this is something you have to have I didn't have it for a long long time now I do because Jen demanded she moved here I might even bought it before she moved here but then she only uses it for smoothies",
            "start": 100.21
        },
        {
            "text": "is something you have to have I didn't have it for a long long time now I do because Jen demanded she moved here I might even bought it before she moved here but then she only uses it for smoothies and stuff and then I discovered of course a lot of my old recipes call for this so I screwed that up next we need to put in two cups distilled white vinegar there's a brand new one I have one over there that's limping along but I didn't feel like doing like oh oh this this one's half done you know what I mean Nick nobody wants that you want to jump right in there I'm all set here new measuring cups too I bought a lot of cool for the show mainly cuz I get expensive too kind of fun don't tell Nick so what you had a perfectly good vinegar and you're like man I want to use that one I'm gonna buy a brand new one i while start with the measuring cups but yeah it's not perfectly good there you know I don't I don't think there was a I think maybe I had one cup in I was gonna need more to come you",
            "start": 141.01
        },
        {
            "text": "brand new one i while start with the measuring cups but yeah it's not perfectly good there you know I don't I don't think there was a I think maybe I had one cup in I was gonna need more to come you know what I mean okay don't worry this just means we have to pay any less it's not a big deal we pay any don't we 1/2 cup olive oil in there [Music] there you go now a big one here 1/4 cup kosher salt - all right what is it next oh yeah my favorite two tablespoons of chopped fresh parsley now parsley same thing as ye olde garlic where I just use a lot of it 2 tablespoons I get sit here in my olden days when I was a young buck trying this recipe for the first time sure I would sit there pack it into the tablespoons be like is this right is that what it should be now you know what I do Nick I just say you know what I love parsley and I like the colors it makes I like how colorful it makes the marinade I just there's a handful of it two handfuls even that's enough for me all of it in there is",
            "start": 183.04
        },
        {
            "text": "say you know what I love parsley and I like the colors it makes I like how colorful it makes the marinade I just there's a handful of it two handfuls even that's enough for me all of it in there is it two tablespoons is it 15 tablespoons the world will never know but I like it and I don't care that's what I'm gonna do that's how that's how I roll that's how you should roll what's next here on the list here from bone Appetit now we're gonna put in two tablespoons of paprika now paprika I will measure out I want to know exactly if I'm putting enough in there with the brand new thing like I said oh kind of when he's picking up the bill everything you don't I mean it better not be like a new dog right around well if we use it in the show though it's all right off so two tablespoons of the paprika in there what else we missing you know they want us to do one tablespoon of the pepper and then a 1/2 cup of veggie will are you asking yourself is that a giant brand new thing of veggie oil to",
            "start": 233.83
        },
        {
            "text": "in there what else we missing you know they want us to do one tablespoon of the pepper and then a 1/2 cup of veggie will are you asking yourself is that a giant brand new thing of veggie oil to Nick did you just buy do everything Christ trust me when you eat this chicken it'll be worth the bankruptcy you got it in there half cut yeah done and that's it for that guy so now the fun part we're gonna blend it up [Music] [Applause] [Music] I use the pulse option the pulse option Nick okay look at that beautiful coloring you know what I mean yeah you can see the flavors in there that's what I love so much about it so then you take your big ol really usable bag top all this in there two breasts bone-in skin-on two thighs bone-in skin-on again Bon Appetit you know the thing is you always dealing with the bone again right yeah take this marinade just pour it on in there oh my god the flavors Nick sounds squishy yeah that's the firehouse chicken in the bag in the marinade I'm gonna put it in",
            "start": 286.62
        },
        {
            "text": "with the bone again right yeah take this marinade just pour it on in there oh my god the flavors Nick sounds squishy yeah that's the firehouse chicken in the bag in the marinade I'm gonna put it in there overnight again you could do it a long time ago I'll flip it a few times as I do stuff throughout the day today again I've done it with as little as like an hour and a half notice it gets it but the longer you keep it in there the more tasty it's gonna be marinated it overnight then the idea is to bring it out about an hour before it goes on into this guy to go on there you want to bring it to room temperature where and put it out where to put on the plate when to Pat it dry they were remover to making the Brussels sprouts just like everything else in this bone Appetit recipe like you don't listen to them you know what I mean I'll be damned if I'm most of the fridge have a better idea about how to do things than me you know what I mean John maybe I go home approximate cooking though",
            "start": 357.1
        },
        {
            "text": "listen to them you know what I mean I'll be damned if I'm most of the fridge have a better idea about how to do things than me you know what I mean John maybe I go home approximate cooking though is my favorite kind of cooking right because that's all you cooking as I say all the time on this show it's it's not as hard as people want it to be you know any sounds hard to make why do you love cooking Charlie you're saying almost because it's great and it's very cathartic for me it makes me forget about all the way like problems yeah yeah so yeah they're out there now I'm just gonna go in there I don't want to Pat too hard I don't want to take away too much what's this remind you yeah don't cheat in here just like you came cooking's not as hard to do we have just agreed we bought brussel sprouts yeah we were in a hurry we've bought the green giant ones that were already washed and already cooked so we're gonna do you cut you clean them wait yeah you clean them you destem them peel off",
            "start": 402.52
        },
        {
            "text": "yeah we were in a hurry we've bought the green giant ones that were already washed and already cooked so we're gonna do you cut you clean them wait yeah you clean them you destem them peel off any yellow leaves and then cut him in half so we've done that right just toss them in this bag then if they get cut back there you go thank you now they want three tablespoons revive them I don't think you have to be like that approximate cooking so now these will go in for a total of about 45 minutes you want them nice and darker crispy as you want them I guess it'll caramelize exactly every 10 minutes or so you should shake them flip them a little bit get them gone I'm sure forget about it do it here and there put that in there show me a single weight you're gonna make Faro for us I mean it's it's like rice but better so yeah this is pretty much to me hazardous waste rice because I think it's way tastier agreed and I love rice has a lot more nutritional value right so super easy if you just",
            "start": 446.88
        },
        {
            "text": "like rice but better so yeah this is pretty much to me hazardous waste rice because I think it's way tastier agreed and I love rice has a lot more nutritional value right so super easy if you just follow the instructions on the package so yeah they asked for five quarts for one cup of fire oh it's just a shitload of water that's what it gosh it's like how long does it here's the thing you you make it you you joke she jokes about how easy fare was I literally never cooked it that's why I wanted her on this episode in particular now because she's my pharoahe whoa just because I need to know how I don't know how to cook fair so load of water and then you bring it to a boil and then how long is the farro gotta be in it 20 minutes okay all right so you want to talk to people about what you discovered on how to do this because here's the thing I've been making firehouse chicken so much longer than I've known y'all bf stay calm and the problem with it is that you want the crispy skin on the",
            "start": 493.71
        },
        {
            "text": "on how to do this because here's the thing I've been making firehouse chicken so much longer than I've known y'all bf stay calm and the problem with it is that you want the crispy skin on the other side you want it to be nice and dark nobody was a sad chicken night nobody wants a sad Chang at that and so what I was doing is you know getting the nice and hot and put the first time I ever did I put the oil in it and then I put the chicken in it facedown and then I came back when it was supposed to be and I pulled it out and it the chicken skin to stock and hold office so then every time I've done this or even the chorizo chicken thigh dishes another cooking episode I constantly moved them just sat there for the 15 minutes moving them around and then you had a new plan that worked out really yeah so what is it so it's super I guess it's very science e and appropriate to the cast-iron pen but it's essentially starting with a room-temperature pen and putting your oil in there about depends",
            "start": 542.52
        },
        {
            "text": "yeah so what is it so it's super I guess it's very science e and appropriate to the cast-iron pen but it's essentially starting with a room-temperature pen and putting your oil in there about depends on the portions are making but just like coating the bottom of the pan and then you literally put the chicken skin down on it in the cold pen I'm gonna dump it in here is decoded alright yeah Nikki you see really yeah Murr I couldn't way more last time I'm making some kick ass to thighs and to tricky I'm sorry mm two breasts it needs to be boiling before right Sam I want to do what you didn't want a nice I don't approximate cooking so we're gonna put it in there we don't want to touch no that's the big thing show them the skin side like this one has shitty skin the shitty skin it's like old push back we talked about this oh you're right wait isn't a skin at the front still can we try to fix it a little bit because otherwise we're not gonna get anything Christy no it's okay can you jerk it",
            "start": 579.68
        },
        {
            "text": "back we talked about this oh you're right wait isn't a skin at the front still can we try to fix it a little bit because otherwise we're not gonna get anything Christy no it's okay can you jerk it a little bit you just maybe like you do this hand motion to it maybe cool in the skin this I'm loosening up eschewing all right that's that's gonna be as good I'm just getting some more blood flow to the skin baby skin down everybody yes inside down to this part so yeah it's it's admit it may seem strange to start them off on a cold pan but works really nice and I don't know why I can't explain it well I think it's just because they warm together right and there's like there's a bond of brotherhood and they all went through this the oil in the pan the chicken was together wait you also mentioned that yours you were moving them around a bunch of these you do not touch for the entire duration of the recipe you just let them go for the 15 20 minutes they're on ya to touch them to flip them yeah",
            "start": 639.95
        },
        {
            "text": "that yours you were moving them around a bunch of these you do not touch for the entire duration of the recipe you just let them go for the 15 20 minutes they're on ya to touch them to flip them yeah yes make sure we're clear everybody right now out there Trevor stark he's taking frantic notes so don't be a saint bones wheat they're crisp enough good over here yeah I like that I like the color I'm getting there like color I'm always terrified I'm gonna go to flip them and they're gonna stick cause I've had so many problems before you should be fine yeah well Nate hopes it now your water's boiling the timer on these is about to expire and then when that happens we're gonna flip them yeah you're gonna put your farro in there I'm gonna put them in here for 20 minutes 25 minutes yeah and I'm gonna mess with them a Brussels sprouts as well yes just to give you an update aware great motor we're waiting for Nick do you have it okay camera shot in this I'm gonna do this I'm gonna poke it okay",
            "start": 694.27
        },
        {
            "text": "mess with them a Brussels sprouts as well yes just to give you an update aware great motor we're waiting for Nick do you have it okay camera shot in this I'm gonna do this I'm gonna poke it okay see I'm already getting under that that's always good oh good lord go Nick look at that come on now Nick Nick's not Mike but he's right now saying oh my god Greg you're the best cook ever I can't believe it hey man I got one again all I need it for the Instagram is the one do it for the gram Nick so now I'm putting Big Bertha in the in here remember cast-iron is incredibly hot no I'm very heavy yeah pan me Fran you need mr. Stay Puft Fran use the Stay Puft on a mission to not let my hands get burned now show me up st. Onge Miller yeah I'm gonna defer to you how because you're you play better than me yeah here you destroyed how what was the order of operations for playing right now so I like to portion everything in like kind of equals your sizes I love you your meat portions are huge goddamn",
            "start": 742.21
        },
        {
            "text": "me yeah here you destroyed how what was the order of operations for playing right now so I like to portion everything in like kind of equals your sizes I love you your meat portions are huge goddamn right they are put it on the boxes okay so that should be enough okay no you want sugar cuz like fire was pretty filling yep what's gonna hold so you get the protein and you just drop it on top you get whatever last-minute declaration idea you had just one I'm just gonna look Chris looks like a destructans are your nipples this is so crispy oh you love it you my house chickens son bone Appetit magazine what up they're so great you good yeah today you have ladies and gentlemen firehouse shaky and roasted Brussels sprouts some farro Jovi of st. Onge Miller thanks so much for help me with this one thank you for coming no it's a pleasure thanks for joining me for helping I do often I come here ladies and gentlemen let us know what you think of it let us know other recipes we should do and of",
            "start": 800.55
        },
        {
            "text": "thank you for coming no it's a pleasure thanks for joining me for helping I do often I come here ladies and gentlemen let us know what you think of it let us know other recipes we should do and of course follow me on instagram hashtag cooking with Greggy see what I'm up to until next time know it's been my pleasure to serve you I guess our foster system I guess [Music]",
            "start": 868.44
        }
    ]
}