{
    "id": 2413,
    "video_id": "7izKT_XH_R8",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "Horizon Zero Dawn Review (Spoiler-Free) - Kinda Funny Reacts",
    "description": "Greg and Colin have played the hell out of Horizon Zero Dawn, but what's the final verdict? SPOILER-FREE Review.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1487577600,
    "duration": 2256,
    "transcript_chunks": [
        {
            "text": "what's up everybody welcome to your spoiler-free review of Horizon Zero Dawn here on YouTube.com/ KindaFunnyGames I'm one of your hosts Greg Miller alongside the Thunderjaw himself Colin Moriarty that's a Horizon reference it is a Horizon reference I was I was in the weeds on it of how deep can I go you know how many how many Horizon references can I make cuz the kids out there they haven't played it yet I was thinking about Mother's Cradle things like that can't go I know these four poor four poor people uh ladies and gentlemen we're here to talk to you about Horizon Zero Dawn we've been playing it we I've eaten and I don't know where Colin is that's why I like to do these shows we just jump in and see what's happening before I do that of course you're our best friends I want to point out to our friends over at the FCC yes PlayStation sent us copies of these games for review purposes hey Colin uh how **** awesome is Horizon Zero Dawn it's fantastic God damn it I think it's uh",
            "start": 0.12
        },
        {
            "text": "To our friends over at the PlayStation, yes, Sony sent us copies of these games for review purposes. Hey Colin, uh, how **** awesome is Horizon Zero Dawn? It's fantastic, God damn it! I think it's uh the best PlayStation 4 exclusive, better than Uncharted 4, yes, okay, and uh it has a story deeper than Uncharted, obviously. The game play is uh different; it's third person but it's different, it's very Dynamic, it's a very big game, big game uh I'm uh 29 hours in, okay, um I'm 74% of the way through. It's funny this morning I actually woke up and um I was like you know what, like I'll just rush to the end so I can beat it. You do yourself a disservice, yeah, and and it's funny because there's a point of no return, yeah, where they make it very obvious and I'm like all right, I guess this is it, yeah, and uh I go through the point of no return, go through this whole thing, and then I'm back out on the map after a couple hours, and I'm like that wasn't the point of no return, like I I like like I I don't like here.",
            "start": 36.08
        },
        {
            "text": "through the point of no return go through this whole thing and then I'm back out on the map after a couple hours and I'm like that wasn't the point of no return like I I like like I I don't like here I'm back here and I have all these options again got um so to bring everyone up to speed I have beaten it uh I'm level 48 right now apparently level cap 50 based on trophies and uh I'm 42 hours into the game I would say I beat the story roughly at the 30h hour mark probably right around there according to saves of course that depends how much you want to dick around side op missions and stuff like that though we'll talk about that I'm sure yeah well I guess the point I was trying to make was I'm uh yeah I'm 30 level 37 or something 29 hours I'm glad that uh it didn't work out that way though cuz I it felt wrong I was like we're not at IG anymore I'm not trying to meet any arbitrary quot I don't really care that I haven't beaten the game yet I'm going to play it at my pace and you know",
            "start": 82.24
        },
        {
            "text": "cuz I felt wrong, I was like we're not at IGN anymore. I'm not trying to meet any arbitrary quote I don't really care that I haven't beaten the game yet. I'm going to play it at my pace and you know well you put enough hours into it have an opinion, that's the thing yeah more than enough unfortunately I had to deal with some personal problems that uh like some personal issues that uh need you're already having personal issues well some serious things were happening and and I I needed to attend to those things for a few days so that really took me out of the game so to speak. So uh otherwise I'd probably be have gotten through but the the thing about the game to me is um it is and incredibly immersive game where I would lose hours and hours and hours I don't really play games like I used to when I was a kid where I was like I'd stay up all night playing games and actually I had one of those nights with Horizon I was up like 6 in the morning playing um and it's uh it is on",
            "start": 118.08
        },
        {
            "text": "I used to play video games all night when I was a kid, where I'd stay up till 6 in the morning playing Horizon. It's on its base level, easily one of the best PS4 games, possibly the best exclusive. Although I don't know if I'd go that far because we'd have to look at the whole gamut of what's there. I don't want to make that declaration but I think out of the first party this is the strongest game to come out of the first party for PS4 and it shows that even though there is a real open world fatigue, if you do the open world right, yeah, and you layer story and things in and it's not too dense like The Witcher, and it's rewarding. That I think you can continue to make these kinds of games and make these worlds. And I will say just out the top that I'd be shocked if the sequel wasn't already greenlit, it's got to be, and I think and I do think",
            "start": 156.36
        },
        {
            "text": "to make these kinds of games and make these these worlds and I will say just out the top that I'd be shocked if the the sequel wasn't already green lit it's got to be and I think and I do think that um not I mean I kind of know what the whole story is now because I'm pretty far into the game, the story is kind of revelatory and awesome but yeah that's the thing I mean jumping in here you know what I mean to piggy back up what you're saying in terms of losing hours 100% I was lucky enough that we got the game and you know Jen was here and I was sick the first weekend then she left and I've had you've been gone too so it's just been sitting out there coming home early from work sitting there and playing for hours on it and yesterday you know I woke up at like 9:00 poured a cup of coffee and played all the way till I went to dinner with Kevin like it is a game that you can get lost in and part of the reason I feel I'm able to sit there and Marathon it and it has never felt like",
            "start": 196.12
        },
        {
            "text": "and played all the way till I went to dinner with Kevin, like it is a game that you can get lost in, and part of the reason I feel I'm able to sit there and marathon it and it has never felt like a chore. I'm on pace to platinum this game uh depending on like you know the little things we can't see or don't know or how you're going to get around this or while be able to find that should be able to platinum it by long before it's released once I would think so too, once trophies hit like I I'm pretty sure I'm three short right now but since they're not on the servers I can't really see the list so I'm going off of notes and this and the other uh I'm not getting bored with it because Horizon, like you said, isn't overwhelming in any aspect and it has so many different tendrils and things to do that it feels like at any moment when I was going through I'm like I'm going to go through and get all the metal flowers which are some of the one of the kind of collectibles and then I was",
            "start": 230.16
        },
        {
            "text": "doing it that it feels like at any moment when I was going through I'm like I'm going to go through and get all the metal flowers which are some of the one of the kind of Collectibles and then I was like ah I'm getting bored with this I'm going to jump back into this I'm gonna do that I'm gonna do that my first you know I was talking about you know 30 hours in I think is when I beat the story uh a healthy chunk of that is me just totally **** around like not even doing side quests not even doing errands like I want all I want to get all my bags leveled up I want to get all my ammo capacity so I'm out there hunting foxes I'm trying to get rat bones I'm doing all these different things and when I I you start the story I think Horizon Zero Dawn I talk about this a little bit in the let's play and again this will be spoiler free we're going to talking vague things here has such a strong awesome opening in a way that got me invested in the world didn't beat me over the head that this was a",
            "start": 269.96
        },
        {
            "text": "and again this will be spoiler free we're going to talk about vague things here has such a strong awesome opening in a way that got me invested in the world didn't beat me over the head that this was a tutorial I thought it was such a brilliant smart way to set up the world your mechanics and everything else before they give you okay now you get to go now you get to go be Aloy I loved that I loved where the story was going and then probably spent nine hours we'll say just messing around doing whatever seeing what oh what's that what's that I'm going to go to every long neck I'm going to open up the entire map I'm going to do all these different things and then I was to the point of like all right cool now I'm kind of getting tired of the open world I'm going to go back to the story I guess and when I jump back in the story The way they tell it as rewarding as every one of those story missions is where I thought for sure not giving away twists or turns of the story that the real narrative",
            "start": 302.88
        },
        {
            "text": "when I jump back in the story The Way They tell it as rewarding as every one of those story missions is where I thought for sure not giving away twists or turns of the story that the real narrative the re getting questions answered was going to take okay I'll see you in 40 hours it's going to be **** in between and it wasn't every one of those story missions is a building block to get you to the big piece yeah I agree I I think that the the the cool thing about the story so I have I have fundamental issues with the way the story is portrayed but uh and we can get that in a minute but in terms of the story itself it's a very Dynamic and interesting Confluence of politics of Technology of History um and all these kinds of things of religion um and they it's it's put together in such a clever way that um the story is I didn't like and and it might be more obvious people have really been following the trailers and stuff I've seen literally two Horizon Zero Dawn trailers and played the game at E3",
            "start": 337.6
        },
        {
            "text": "Way that um, the story is - I didn't like, and it might be more obvious. People have really been following the trailers and stuff. I've seen literally two Horizon Zero Dawn trailers and played the game at E3, and otherwise have just totally ignored everything about the game. So, I had no - I had no remotest idea of what the game was going to be really about, and uh, I hope that everyone is going into it with that same mindset. But um, you have... I mean, I know it's too late, but I'm in the exact same boat as you, and I handled it the same way. Even playing that preview, I didn't know where they were going, and when it starts going where it goes, I was like, \"That's brilliant! It's a really neat story about a cataclysm.\" Really, and to me, I was super impressed with the breadth and depth of that particular story. Open-world games are typically deep - I think The Witcher 3 is really one of the hallmarks, and even the Fallout games, of telling a deep story in an open world.",
            "start": 381.88
        },
        {
            "text": "and the depth of that particular story that I've open world games are typically deep, I think The Witcher 3 is really one of the hallmarks and even the Fallout games of telling a deep story in an open world. But I actually would think in a lot of ways the story is even deeper than those games in terms of um there's a meta level to the story, but then there's all of these ultimate like in Fallout for instance it is never important about what happened to get you to Fallout right about the Chinese war with China none of that's ever important. But you're playing in a world in which you're surviving and trying to get somewhere in the game and trying to do something in the game because what's happened is happened. Well, that's not the case in Horizon, and so it's really uh a super engaging story where I had these again revelatory moments, I'm like that's cool and um I I really respect uh you know it can't be understated that you know Guerrilla has always been a very good",
            "start": 421.2
        },
        {
            "text": "engaging story where I had these again revelatory moments I'm like that's **** cool and um I I really respect uh you know it can't be understated that you know Guerrilla has always been a very good Studio I think they're one of Sony's best Studios I don't think I want to dispute that I think the Killzone games are very finely made games um and really good gritty dark shooters that some people like Ian I don't I don't care for Killzone 2 and Killzone 3 as much as other people do but I really you know liked them and I like Shadow of the Colossus a lot um this is a massive pivot for a studio that has delivered a game very easily better than anything they did with Killzone and that's one of the most interesting things is now we're going to look at this particular Studio not to go tangential with it but we're going to look at this studio not as the first person shooter Studio that made an open world role playing game but the the the studio that used to make shooters that is now going to make open world",
            "start": 460.64
        },
        {
            "text": "going to look at this studio not as the first person shooter Studio that made an open world role playing game but the the the studio that used to make shooters that is now going to make open world role playing games cuz what a disservice it would be to that studio to make anything else other than this and playing playing it and realizing how good this game is and how how they nailed this and having those moments of holy **** these guys were making Killzone before not that Killzone was bad Killzone you know I liked Killzone too Vice you know tradeoff well you you and I find our Cadence with kill zones eventually um but this is so not Killzone it does not feel like Killzone it does not look like Killzone it does not play like Killzone and you're playing through it and it's like for me this is their Uncharted to their Jack and Daxter and Jack and Daxter was great and has this fan following all these different things but then naughty dog was like no we're on another",
            "start": 498.76
        },
        {
            "text": "It's like for me, this is their Uncharted to their Jack and Daxter. And Jack and Daxter was great, has this fan following, all these different things. But then Naughty Dog was like, \"No, we're on another level.\" I mean, God of War is on another level with Horizon period. And that's the thing - when you're talking about the story for me, when I'm playing it and it... I don't know, hours and hours and hours in... and I'm like, \"There are two narratives going on here, and I'm invested in both of them.\" I want to know everything about everybody's story here as it goes. And it's... I mean, you and I, we have the same tendencies with our Vin diagrams and all that stuff. But the way they do audio diaries here, and the way collectibles flesh out that story - where you're going through, doing it, and there's this thing at the end where you get some... you know, finding stuff with your focus, the little triangle, scanning things... and it's like, \"Alright, all right.\"",
            "start": 534.44
        },
        {
            "text": "through and you're doing it and there's this thing at the end where you get some, you know, you're finding stuff with your focus, the little triangle, and scanning things, and it's like all right, all right, you find some stuff, it's corrupted files are usually dead, you find some corrupted stuff, and they're like oh well, you know, eventually your focus, it's so small in processing power, it'll bit it'll eventually decode those documents, and when those documents start hitting like everything stops for me, I'm like I'm just like out in the wild, I'm like no stop wait, I got to read everything, I got to know exactly what's happening, yeah, I, I think that you know reminds me a little bit of Doom in the sense that um in the re-imagined Doom in the sense that everyone's like well there's not that anyone's saying there would be no story here but everyone's like that there's a there there's no story but there's actually a huge layer of story if you just look for it, and and in Horizon there's like you said many",
            "start": 571.44
        },
        {
            "text": "would be no story here but everyone's like \"that there's a there\" there's actually a huge layer of story if you just look for it and and in Horizon Zero Dawn, there's like you said many many layers of story that you never have to find that do flesh out the world and what I think about how we should get into spoilers in this review not I don't want to because I think if I mean that's the thing we said spoiler-free I think it should be top-level as much as possible because I don't I want people to have this experience I don't want to take away from like going home where I'm like \"go play\" just I can I think one of the major things about this game that's interesting is where it takes place and I and I figured it out before the game ever told me where it was I was like \"this is clearly this place okay you know\" and uh and you can kind of put it together",
            "start": 599.96
        },
        {
            "text": "\"Have a grasp on it and I figured it out before the game ever told me where it was. I was like, 'This is clearly this place, okay, you know.' And you can kind of put it together in that way. But then when it starts to really confirm that... When you start to really get into the setting, I think the setting is actually one of the most fascinating things of all. And I don't know that a lot of people really understand where it's set, and I think that's neat. The other thing that I think is worth pointing out is that there's a deep satisfaction using a bow and arrow in a game. I've never felt so satisfied using a bow and arrow in a game, and I've never felt the need in a third-person role-playing game to use stealthy tactics. I get scared when I fight things I've never encountered before; the enemies are overwhelmingly powerful in the game, so you really have to think about how you're doing things. It's super.\"",
            "start": 634.0
        },
        {
            "text": "tactical I get scared when I fight things I've never encountered before. The enemies are overwhelmingly powerful in the game, so you really have to think about how you're doing things. It's super satisfying to win in those situations, and I think that there's a real sense of danger in the world that I like - similar to The Witcher or Fallout. In Fallout, I never really feel like I'm that threatened; it's like you know you'll figure it out. In this game, I'm like \"damn, there are really tough side quests\" where I've encountered situations where I'm like \"I don't really want to fight this massive bird creature yet,\" and then I'm fighting it, thinking \"I should be strong enough to beat this thing,\" but I'm kind of not. I'm wasting ammo, and I'm like \"and I'll use up all my potions\" - you're on your last sliver of health, you've used up all your potions, you don't have any in your health bag, and they're on their last thing... it's that feeling of who's going to **** up first, and you're rolling.",
            "start": 673.84
        },
        {
            "text": "of Health you've used up all your potions, you don't have any in your health bag and they're on their last thing, and it's that thing of like who's going to **** up first and you're roll, you have to that's the thing about it is and I think as the game goes on at the here you know for me being on the other side of it 42 hours later I feel like battles are usually pretty easy but it's because obviously I know the strategy for every type you meet these things for the first time and have to develop a strategy on the Fly of how are you going to take it down let alone when you're starting and you're not as powerful and you have to start rolling it out but yeah the the thought process behind like okay cool this guy's vulnerable to fire so I'll bring him down want that run up and critical hit them I love the idea of like when you it finally starts piecing together of using their own weapons against them like okay cool like I'm going to take off this guy's arm cannons then I'll pick up its",
            "start": 719.24
        },
        {
            "text": "them I love the idea of like when you it finally starts piecing together of using their own weapons against them like okay cool like I'm going to take off this guy's arm cannons then I'll pick up it shoot him that'll dwindle him then when they start combining everybody where everyone's out there and you get to that point of coming into a situation and to your point it is a lot like Metal Gear Solid 5 in the way of I've come into this area I see all the pieces on the board how do I want to attack it you sure you can be stealthy with guns, Blaze. You can sit there and try to stealth everyone down to the final big one, you can override people and turn them against each other and then have them battle out. I mean there's a ton of different ways to do it and you find your own rhythm and cadence with it. Yeah, uh, I think you know the the as you said I think that there's a lot of Ubisoft genetics in the sense like Far Cry for instance in terms of um the ammo types the weapon wheel I",
            "start": 749.8
        },
        {
            "text": "with it yeah uh I I think you know the the as you said I think that there's a lot of Ubisoft genetics in the sense UB like Far Cry for instance in terms of um the ammo types the weapon wheel I mean not that that's unique to those games but the the customization the crafting all those kinds of things are really embedded in the game I mean for instance um you have different armor types different uh arrow types and ammo types I played the game the entire game very stealthily I wore like stealth armor that really heightened my ability to not be seen by anything but I had no strength I couldn't barely withstand being hit by anything so you had to you had to uh make sure you got it right or you were going to die um the same thing I became very reliant on fire arrows I became very reliant on uh that there's like a shotgun type spread shot interesting little primitive weapon thing but there are a bunch of options where like there are sling weapons I don't think I use that weapon once there",
            "start": 785.56
        },
        {
            "text": "that there's like a shotgun type spread shot interesting little primitive weapon thing but there are a bunch of options where like there are sling weapons I don't think I use that weapon once there there are are all these doing this I never except for in like there's these trials that you have to do to get these Sun tokens all that I I use you have to use everything there also there's like a whole it's actually kind of clever a whole roving list of uh aide aide kind of like quests they're not really side quest but errands whatever where where you know you buy a weapon so it's like you can get 2,000 experience points if you just do these things with this we tutorial stuff like the tutorial missions whatever um so I I I like that like the I like that all the side quest are segmented there's like real qu like side quest there are errands there are all these kinds of different things to do I mean and that's I mean it's you know this is I think what it's funny where you mentioned Ubisoft",
            "start": 827.44
        },
        {
            "text": "like real quests there are errands there are all these kinds of different things to do I mean and that's I mean it's you know this is I think what it's funny where you mentioned Ubisoft earlier Ubisoft did that uh conversation where they're talking about how their games they're going to keep doing these open worlds they're keep doing this stuff because it comes down to those water cooler moments what are your thing and that's the same thing right like you start off and you're talking about how you use stealth I'm like oh yeah me too first outfit I bought was the stealth outfit I never got the bow because it took me literally until right before I came here 42 hours in to get my first fox skin I just couldn't get skins off these foxes cuz you have to shoot things craft them that's one of the blue items for super rare and so I never used that bow right and like the way I always looked at it is like okay what is the thing and like I'll lay the trip wires down lay lay them out far enough",
            "start": 868.2
        },
        {
            "text": "the blue item for super rare and so I never used that gun right and like the way I always looked at it is like okay what is the thing and like I'll lay the trip wires down lay lay them out far enough take on the guys have them charge me like you come up with your own strategy so when you talk to your friends about this game it's not going to be you did it the exact same way with the exact same thing well what I like about it is that you can get as cute as you want like there there there you can get two cute by half at certain points but like the the the tutorials and like the the um the the trials are really interesting in the sense that I was like I didn't know I can even do that and if if you want to get like really nuts with it probably similar to Metal Gear Solid V Where you can set all sorts of traps and do all these if you really want to get I don't play like that like that's just too **** annoying well I mean that's and that's something interesting because",
            "start": 898.2
        },
        {
            "text": "where you can set all sorts of traps and do all these if you really want to get I don't play like that like that's just too **** annoying well I mean that's and that's something interesting because you mentioned the outfits right and I like I like and I don't like the outfits all at once I like the idea of the outfits because the the idea is that when you go to vendors you can buy these different outfits from them and it's it'll up your stealth it'll do this it'll make you you know less vulnerable the range attacks you'll be able to withstand melee combat better and they all look different personally I think with the exception of the final two I got all look stupid I think you look like an idiot there's one where you literally have a diaper on your head I'm like what God damn it I wish I could have gone for more Mass Effect insert your own RPG here where you're you know moving pieces out you can customize how they look customize their color and then the interesting thing there is",
            "start": 932.16
        },
        {
            "text": "I could have gone for more Mass Effect, insert your own RPG here, where you're, you know, moving pieces out; you can customize how they look, customize their color, and then the interesting thing there is that there's mods, and you can slot mods on weapons, you can slot mods on your outfits or whatever the outfits I I feel like are set up and are you playing on normal hard, normal there's normal hard and I think a very hard or whatever and there's easy too obviously and I I wavered and I was like I'm just going to do normal it doesn't affect the trophies totally I'm in great let's do it and I never felt the need like oh my God I'm getting into a really tough battle here I better switch out my outfit that that was never part of no I never did that either I so it felt like a wasted thing that they made these things they look like I I appreciate that I while I don't think they look cool they look good like they look good in terms of like okay I see like rather than have me mix in stuff and have it",
            "start": 964.48
        },
        {
            "text": "these things they look like I I appreciate that I while I don't think they look cool they look good like they look good in terms of like okay I see like rather than have me mix in stuff and have it look weird in cut scenes you have your own stuff and it looks fine and then the final two suits holy **** **** but yeah yeah I I I think that well that's one of my complaints I have two major complaints with the game and one of them is is I don't I feel like there there could have been more in terms of uh statistical depth in the game when you level up you get a skill point that can go into a skill tree which I actually think is not that intriguing I hate when games have skill trees that don't really like where I'm like I don't even really care like like about like there are certain there are certain really important ones but after a while like I'm I'm level 37 I only have like a few of these things left and I'm like I honestly could give a **** less and I hate that kind of **** I I",
            "start": 1003.44
        },
        {
            "text": "\"Certain really important ones, but after a while, like I'm level 37, I only have like a few of these things left, and I'm like, I honestly could give a **** less, and I hate that kind of ****. I think the skill tree could be way better, and the idea of leveling up - when you level up Aloy, you get just 10 hit points more hit points than a skill point to put into these trees if you want there could have been more statistical depth to those things. And I think the same thing can be said about the weapons and armor - where I'm like, there could be more customization here. I like the idea of mods, I like the idea that it's as simple as everything else in the game, in terms of like, it's not getting super **** deep into the mechanics, it's not like Skyrim or something like that. But um, weapons were the one thing where it's like, all right if I'm going in and this guy's vulnerable to freezing, all right stop, and I you know, one of the skills that I was like, I got to unlock is the\"",
            "start": 1041.36
        },
        {
            "text": "weapons were the one thing where it's like all right if I'm going in and this guy's vulnerable to freezing all right stop and I I you know one of the skills that I I was like I got to unlock is the ability to rather than delete a mod to move this guy's exactly and like when that I know exactly what you're saying cuz when that moment's gone and you're like oh right you look over and I literally looked over I was like you have 17 points to input I was like ah **** sorry I went over there and like sure my melee attack that I never really use can be more you know 30% more effective I just I'm a little confused when I see games like that cuz I actually think that certain games do it really well like Dying Light did it really well and a few others with the like skill tree kind of things and like dumping your points into things but I I get confused when I'm like God everything's so nailed but like why is the skill tree so **** boring you know um so that's one complaint my other complaint",
            "start": 1072.6
        },
        {
            "text": "dumping your points into things but I I get confused when I'm like God everything's so nailed but like why is the skill tree so **** boring you know um so that's one complaint my other complaint which I think is a significant complaint I don't know how much I can talk about it without spoiling anything so I don't want to get too too deep into it is Aloy's experiences in the game the way she she grows up and then the way she's immersed in that society and then the way she goes about things they don't talk properly like and I'm not saying they need to talk like me caveman or whatever but like you shouldn't have an understanding of anything you're actually talking about in the game so why are you talking about it like that there's problem with the dialogue and I don't want to get too much deeper into that but it's actually super unimmersive sometimes where I'm like how the **** do you even know what that means like that like there's not enough there was there's a she should have",
            "start": 1105.08
        },
        {
            "text": "\"Deeper into that, but it's actually super unimmersive sometimes where I'm like how the **** do you even know what that means? Like, there's not enough. There was a she should have nothing more than a cursory understanding of anything in that world for me. There's there's only one section where she's talking to another character about something they just found, and he makes the reference of I don't know, was moving pretty quick for me based on what... and I was like, 'I a long time ago I checked the disbelief.' I was just like, 'No big deal, whatever.' They shouldn't be speaking like us period, let alone like totally have the same grasp of English talking here. And that blah blah blah blah. So like, I get it, but it's also like, all right, I don't understand why you had to call it out right there. Yeah, I... I think that you know again, you do have to suspend your disbelief in a sense that yeah, I don't mind that they talk like us, that they're like... but I just can't talk too much about\"",
            "start": 1139.92
        },
        {
            "text": "right there yeah I I think that you know again you do have to suspend your disbelief in a sense that yeah I don't mind that they talk like us that they're like but I just can't talk too much about without this without but I'm like she's brought up in a specific way she should not I you know like your social skills are a little too good and uh how the **** do you even know what any like if you went up to a person and said certain things to a person in that situation with what she was saying they would have any idea what you're talking about so there was so while the fundamentals of the story are fantastic I think the story is so riveting and so interesting um second only in the first party Pantheon to The Last of Us's story I think in terms of how good the story is um in terms of just like what it is what it means I've never heard of anything like this story this is not like any sci-fi weird story I've ever heard of in my life I mean I don't know maybe maybe it exists",
            "start": 1177.88
        },
        {
            "text": "of just like what it is, what it means. I've never heard of anything like this story. This is not like any sci-fi weird story I've ever heard of in my life. I mean, I don't know, maybe maybe it exists, but I haven't heard of it. But that one thing where I'm like the dialogue - the dialogue is a problem, but it's... but again, not a game, no, totally. It's just something to call out. I mean, for me, one of the things, and this is you know on PS I love you XOXO number one PlayStation podcast on Tuesday we're doing an AMA for the questions you guys sent in for Horizon, and one of the ones that comes up that we'll talk about there and talk about here a little bit is though side quests - like the main quest is awesome and I and fantastic, side quests a lot of people want to know how it compares to The Witcher. Is it more like The Witcher? Is it more like Fallout? This is like that. The side quests I thought were fun; they're diverse in terms of what I'm doing in terms of the gameplay, but it's rare.",
            "start": 1218.96
        },
        {
            "text": "Witcher is it more like? It's more like. Fall is more like this is like that. The side quests, I thought were fun; they're diverse in terms of what I'm doing in terms of gameplay, but it's rare that I think of like... I had a great moment in there. It's rare that I meet someone that I think of like, \"Oh, you're an important character that I'm going to talk to again.\" Right? Because you know, you make relationships and obviously they can help you or not be part of your thing going forward or whatever. And so like, there are a few of them where I was like, \"Oh yeah, when we found that guy, that guy, that girl, or what?\" And it's like... But outside of it, I don't... I didn't meet people and like remember them. Like when we talk about The Witcher, and you talk about those kind of side quests, you talk about something that was like, \"Oh my God, that character was so great.\" These characters come in and out so fast. That's one of the things is the game people were worried about being overwhelmed with the game I",
            "start": 1260.32
        },
        {
            "text": "something that was like oh my God that character was so great these characters come in and out so fast that's one of the things is the game people were worried about being overwhelmed with the game I feel like there's a lot going on in the map there's a lot to do in this game but it's not overwhelming like I feel like you know at this what 42 hour mark like I'm probably going to platinum it at 45 48 somewhere in there depending on how long some of these errands take me and what that entails but it's not like I was ever I I don't know what's happening I don't know where I'm going and so like even what you're talking about in the beginning and how she goes from one part of society to another part of society and how it's like all right Bing Bong boom it's all just happening which is good I feel like because it was a great pace for the story but then out here it's just like you run through these people in their side quest so fast and I'm never like I really like that person",
            "start": 1297.6
        },
        {
            "text": "Is good, I feel like because it was a great pace for the story but then out here it's just like you run through these people in their side quest so fast and I'm never like \"I really like that person\" I want to double back and know more about them. Yeah, I mean I can say the same in a sense for The Witcher or any other games that actually do side quests really well in the sense that there's a depth and a meaning to the side quest but these characters are still just people in the world like I don't think it's as deep as The Witcher which I think is the hallmark of that kind of side quest, and I don't think that it's necessarily as numerous you know, there's not a volume of these side quests either. I mean, there's a lot of them but um so I mean I'm not necessarily disagreeing with you, I like the scattered nature of the side quest it never felt like a shitty fetch quest or yeah, um go kill these things and bring back the pelt or whatever, like it's like",
            "start": 1330.36
        },
        {
            "text": "disagreement with you I like the scattered nature of the side quest, it never felt like a shitty fetch Quest or yeah, um, go kill these things and bring back the Pelt or whatever, like it's like there's a little more story depth to it than any of those. And to their credit, the one where they were like go kill these **** things and bring it back, like well you're the hunting lodge, that's that's acceptable, that makes sense from Aloy so there is like interesting depth um to the lore uh and and really where I am now even though I haven't beaten the game yet uh but I'm I guess I'm very close is like where do you go from here in this world like what is the what is it as revelatory at the end as it seems it's going to be and like how can you continue that, but Guerrilla has invested so much in this in these tools and have has reworked the nature of what they do that you can't imagine that we're more than two two and a half years away from a sequel so it's it's one of those very",
            "start": 1362.08
        },
        {
            "text": "in this in these tools and have had reworked the nature of what they do that you can't imagine that we're more than two to two and a half years away from a sequel so it's it's one of those very interesting things where I'm like I'm sure it was greenlit a little long time ago to be honest they know that they have a great game and uh this is a truly great game like the the like I think about all the first party games and and I remember that that first party, I'm not talking about games that first party publishes I'm talking about their Studios it there really wasn't this massive group of games until actually PS3 I mean there was always first party games going back to 95 96 but like when I look at the when I look at the the great releases from those Studios this game's really only Behind The Last of Us in my mind of in terms of quality ahead of Uncharted in my mind and the entire series yes and uh because it is it is the whole package the problem with Uncharted as much as much I mean I don't",
            "start": 1401.96
        },
        {
            "text": "Last of Us in my mind over The Uncharted series, yes, and uh, because it is it is the whole package. The problem with Uncharted as much as I mean I don't want to say it like that, I mean Uncharted - the problem with one of the greatest game franchises of all time is that Uncharted does what it does very well, almost unrivaled, with the exception of the fact that one of the other games from Naughty Dog does everything better than Uncharted. So there's that and that's The Last of Us, which I think is virtually unbeatable um in that respect. The thing about Horizon, unlike Uncharted, which I think was pronounced even in Uncharted 3 and especially Uncharted 4, is that they don't do everything well, and the gameplay and the gunplay in Uncharted leaves much to be desired - it's not even remotely in the top of the pantheon of third-person shooters, not even close. This does everything it does extraordinarily well; this is in the pantheon of The Last of Us.",
            "start": 1445.84
        },
        {
            "text": "much to be desired, it's not even remotely in the top of the pantheon of third-person shooters, not even close. Right this does everything it does extraordinarily well. This is in the pantheon of the greatest open-world games I've ever played. This is in the pantheon of some of the great stories I've ever heard in video games. This is Aloy, an amazing character with a lot of interesting depth. Um, I know people are excited that she's she's a woman and all that kind of stuff, that's great. But there is more to her than just her gender. There is more to her than just you-you-you feel sorrow for her and um you-you-you-you long for her to find closure in these certain different ways and also find information. The world-building is perfect; the enemies are interesting; the science fiction is fascinating. This game does everything really well, like The Last of Us. That's why you have to put it up there with that game. You have to like I-I-and you know there's been a lot of you know talk about like is",
            "start": 1487.72
        },
        {
            "text": "this game does everything really well like The Last of Us, that's why you have to put it up there with that game you have to like I I and you know there's been a lot of you know talk about like is this their next big thing yes it is their next big thing this game's going on to sell millions of copies and the the as long as they Market it right I I can't imagine it's been marketed right already people are going to be behind this I mean we're recording this a few hours before the Embargo goes up I imagine most reviews are going to be right here with us saying how great this is I can't imagine I can't imagine it getting anything less than than scores from everyone and and I've talked to some people that have played it and I'm sure you have to and everyone loves it so so the the thing about it is and that's why I I put it on Pantheon like God of War has really great gameplay it looks like they're trying to tie everything they with the new God of War but God of War always had really",
            "start": 1528.84
        },
        {
            "text": "it is and that's why i i put it on Pantheon like God of War has really great gameplay it looks like they're trying to tie everything they with the new God of War but God of War always had really great gameplay great graphics but man the story sucks who cares about Kratos all this kind of you can't you look at this package and you're and you're like i don't really know where the achilles heel on this thing is i don't think it has one like and that's and that's really awesome yeah i mean like i'm with you you know what i mean when we were going in i think i think the when people look back at her R zero Dawn and if they do this right and don't read every review and don't get it all spoiled for them what stands out i think is those moments of Discovery when the game does something truly special and it does it a bunch of times in the story but for me i mean running around the open world i'm collecting all the metal flowers okay great where's this one i can't find it oh there's this hole",
            "start": 1562.52
        },
        {
            "text": "and it does it a bunch of times in the story but for me I mean running around the open world I'm collecting all the metal flowers okay great where's this one I can't find it oh there's this hole over here I jump down into a pool of water great there's what I'm looking for and what the **** is that and I walk in there you've done this you walk in there and you're like holy **** are you **** and then like the game again now I'm off for like 3 hours of like this is the goal this is the game now and that sense of wherever you go whatever you get into that's what it becomes and that's what that makes that's what makes Horizon so important so special in terms of what it's going to get dinged for and like all this stuff like I feel like there's moments where the Final Fantasy RPG the open world RPG of it you know rubs up against it where you know you're talking to somebody in the they're still in that weird Fallout angles and stuff like that way better than Fallout but yeah but yes",
            "start": 1598.56
        },
        {
            "text": "RPG of it you know rubs up against it where you know you're talking to somebody in the they're still in that weird Fallout angles and stuff like that way better than Fallout but yeah but yes but it's the angle and the eyes roll this weird thing like what you definitely from from a technical perspective I agree but again way better no I agree with I agree uh the thing about it too is like I feel like there's little moments where you're like okay this is this is Guerrilla doing something new I'm excited for Horizon 2 to see them learn the open world RPG lessons right because again the map's gigantic and it's fun to explore and it's all this amazing stuff why isn't there a legend for me to be able to see why can't I why can't I I only let me only see the Collectibles nope everything's there I'm like all right **** you have to assume that that that's it is strange I always wonder that I'm like how does some of these things slip through it's the same I don't as far as I can tell I don't",
            "start": 1639.08
        },
        {
            "text": "I'm like all right, you have to assume that that that's it is strange. I always wonder that. I'm like how does some of these things slip through? It's the same. I don't as far as I can tell. I don't think you can turn off the speaker from on your controller in the game. I couldn't figure out how to do it. You can do it on the cross media bar, yeah that's what but you I couldn't find any option to make the voice not come out of my speaker on the like so there's little things it could be in there. I don't think so uh it could be in there could be a patch in the first thing but there's like these first yeah of course there are these things from the first go around. I'm like I don't know how you missed this that's that's in every game even the last one was but um I think what's so cool about it why you just turn off your cross media bar and never think about it again oh because I like it in some games okay uh fair I'm just wondering I I for me it's the opposite where like day one I turned that off.",
            "start": 1678.6
        },
        {
            "text": "just turn off your XMB and never think about it again oh because I like it in some games okay uh fair I'm just wondering I I for me it's the opposite where like day one I turned that off and then when we were playing in the office doing let's plays it started chirping I'm like what the **** is this and Tim was bitching about I'm like oh I didn't even know it does this yeah yeah there's a lot of it uh like when you use the focus um and that's not a surprise actually not that you I don't want to use the word pioneer like it's a big thing but they did pioneer the use of the speaker for the first time with The Shadow of the Colossus so it's not a huge surprise that they are doing that again um I think the major takeaway from the game is for me is that when I went into it it was like when I went into Uncharted 4 like please don't be like The Last of Us like don't no stat none of this like and they did it and I was happy it was I think the game was too long but",
            "start": 1711.76
        },
        {
            "text": "it it was like when i went into Uncharted from like please don't be like The Last of Us like don't no stat none of this like and they did it and i was happy it was i think the game was too long but and i think that there was a lot of problems with it but it was great right with when i was going to Horizon I'm like don't be too long you know like be 15 or 20 hours the map doesn't need to be that big you know like like tell me your story i didn't i had high expectations but not high enough where i was like this is going to be you know this amazing **** game uh and what i ended up being was like i hope this game i hope i have another 10 or more hours to spend with this game i love that the map's **** huge i'm glad i was wrong there in other words it has exceeded my expectations which were already very high for it ever since it was revealed and yeah it was our game of the it was our game of E3 two years in a row so we had expectations for this title but they have exceeded them i i",
            "start": 1748.4
        },
        {
            "text": "Were already very high for it ever since it was revealed and yeah, it was our Game of the Show two years in a row, so we had expectations for this title. But they have exceeded them. I really do think that this game is truly something very, very special. And you don't get in the realm of first-party releases on any platform games like this. That's what's so cool about it. You get your linear shooters, you get your first-person shooters, you get all these kinds... you don't get open-world role-playing games because they cost a lot of money to make and they take forever to make. As you know, I mean, you were at GDC when Guerrilla revealed in 2011 that they were working on this game. This game has been in development for ever, yeah, and it was worth it. And you really have to kind of take it on that level as well. That man, like you don't get this kind of game exclusive on a console, not that it makes it better or worse than any other.",
            "start": 1787.44
        },
        {
            "text": "and it was worth it and you really have to kind of take it on that level as well that man like you don't get this kind of game exclusive on a console not that it makes it better or worse than any other game that's not exclusive on a console but it's something special this is a special component in PS4's uh uh exclusive Library when we look back on PS4 in 10 or 20 years that's going to be one of the games that sticks out for very specific reasons not only that it's fantastic but that it's an open world role playing game and you just don't see them one of the things you said there you know not that it matters that it's exclusive I think it does cuz I think that's always the thing we talk about of like why Naughty Dog is able to be Naughty Dog is cuz they get to focus on making one game for one platform now with a little bit of tweaks on it well I played on PlayStation 4 you played on regular PlayStation 4 Tim Gettys is playing on PlayStation 4 Pro he talks about how gorgeous it is all the time",
            "start": 1828.2
        },
        {
            "text": "platform now with a little bit of tweaks on it well I played on PlayStation 4 you played on regular PlayStation 4 Tim Gettys is playing on PlayStation 4 Pro he talks about how gorgeous it is all the time but it was gorgeous for me too my gamescast one of my gamescast topics this week is uh I've never ever and it's I mean it's been in a lot of games I've never given a flying **** about photo mode I took something like 56 photos in this game and I like have a style to them and I'm going to put them on Instagram and I was so happy with it cuz there's moments of just true you're playing you're like holy **** is this beautiful is this and I'm not even talking about ants on the tree which was the big deal this weekend on Twitter like it's just a gorgeous gorgeous game and I think that's the power of giving someone all right make your game make it for one platform just and take the time you want and take the time you need on it and like yeah I mean it's awesome that it's open world as RPG it's",
            "start": 1861.6
        },
        {
            "text": "of giving someone all right make your game make it for one platform just and take the time you want and take the time you need on it and like yeah I mean it's awesome that it's open world as RPG it's something different I'm saying more from I mean I agree with you but I'm saying more from the perspective of like Horizon would be just as good if it was on Xbox you know like or my question oh I see what you mean not not that it's important that it's exclusive to PlayStation I thought you meant not that it's important that it's exclusive to anything no no no I mean I I think you know I don't own stock and so I don't give a **** how many exclusives they have at the end of the day if they want to sell their console however they want but the the the the bottom line is that this is an a game that filled me with awe I am very jaded gamer as you know I think a lot of us well I think a lot of people are like I think that ta like good taste is being lost I think that like people like",
            "start": 1896.48
        },
        {
            "text": "a game that filled me with awe I am very jaded gamer as you know I think a lot of us well I think a lot of people are like I think that ta like good taste is being lost I think that like people like everything that's **** shoved down their throats whether it's in movies or TV shows or like everyone just likes everything and and I'm not that kind of person I want things that speak to me in very specific ways and this game spoke to me in every conceivable way and uh if someone like me thinks how it's as good as it is I'm telling you like it really is a special game and I can't imagine that this isn't going to be a massive game like I I maybe not on Uncharted levels maybe on the level of Uncharted it certainly speaks to a gamer the modern gamer and in its RPG open world mechanics and all that kind of stuff it could very well be that big what's what's interesting is when we talk about that right is the fact that yeah for what does it mean to be Uncharted levels and stuff",
            "start": 1928.6
        },
        {
            "text": "and all that kind of stuff it could very well be that big what's what's interesting is when I we talk about that right is the fact that yeah for what does it mean to be Uncharted levels and stuff like that is that you know Uncharted came out and did fine for PlayStation 3 numbers but there wasn't an install base then Uncharted 2 comes out and that's the one that goes crazy because everybody suddenly has a PS3 because the time had passed everybody already has a PlayStation 4 so when this game comes out next week and everyone's talking about how **** awesome it is you assume everyone's going to go snatch this up as they should like it's it's you absolutely should play it's that special is you want to be a part of it you want to play it you want to go have those moments and that's what's interesting I think you know Tim we have so much content for Horizon coming out uh there's a let's play next Monday when that embargo lifts when that embargo lifts as well the Kinda Funny Games cast",
            "start": 1969.0
        },
        {
            "text": "I think you know Tim we have so much content for Horizon coming out uh there's a let's play next Monday when that embargo lifts when that embargo lifts as well the Kinda Funny Games cast exclusive is an hour-long discussion about open world while we play Horizon um one of the things when we were in there talking about it is just the fact that Tim was asking me you know Colin's been saying forever and we've all thought that this is going to be big this is going to be the next big game and I was like well yeah of course it's going to be big it's you know an exclusive it looks great blah blah I didn't expect it to speak to me the way it spoke to me I expect and I'm and this is before I went to the preview event I expected to have a Far Cry Primal super you know supercharged game where cool I'm this person it's caveman times and there's weird robots let's figure that out and I'm the gameplay is going to be tight and it's going to be beautiful when I got in there and discovered that the",
            "start": 2004.16
        },
        {
            "text": "I'm in Aloy's world, it's caveman times and there's weird robots; let's figure that out. The gameplay is going to be tight and it's going to be beautiful when I got in there and discovered that the story's awesome; she's awesome. I'm genuinely holy **** **** what is going to happen next to the point that when I jump back into that story mode, I do that all that's like three nights in a row of just doing story like I don't even **** care I got to know what's happening happening in this thing where it's it's like a great Netflix binge; it's like a great book that when you finish that chapter you got to jump to the next chapter. Like, the game's going to be big for reasons I didn't expect it to be big. I expected it to be big because Guerrilla's talented; I expect it to be big because it's an it's you know a big exclusive and what else are people going to play? People are excited about it; it's going to be big because people are going to love this character; people are going to love Aloy.",
            "start": 2045.44
        },
        {
            "text": "it's you know a big exclusive and what else are people going to play and people are excited about it it's going to be big because people are going to love this character people are going to love the world people are going to want to share clips and photos and stories and it's just **** awesome this game's awesome yeah without a doubt is going to join that grouping of of very important characters for Sony up there with Drake and up there with Kratos and all these characters I mean there's no doubt about that at all and it's worth pointing out awesome performance from Ashley Burch yeah it is it is a good performance I I I again not her fault it's the writing's fault that that she has to give dialogue the way she does but uh which is a huge hang up for me in this game but not but not but not I don't even know the solution I'm not clever enough to even know the solution so whatever but yes all the things you said are right and I think that when we look at the Slate one of the future",
            "start": 2082.4
        },
        {
            "text": "not I don't even know the solution I'm not clever enough to even know the solution so whatever but yes all the things you said are right and I think that when we look at the State of Play one of the future colossi rights is going to be about PlayStation 4 exclusives and when you look at the slates of um games that have already come out and then games that are coming out there really is in my mind and again any of these games that haven't come out yet can can be fleshed out any different way they can all be awesome even better than Horizon which would be insane uh when I look at it though I'm like there really is only one game that I think can really ultimately truly challenge this one it's The Last of Us Part II like in terms of in terms of wow you know if if if any game in that other State of Play got a Warframe all these games I'm excited about Days Gone all these great looking games if they do anything like this they're all going to be great and that's",
            "start": 2119.88
        },
        {
            "text": "any game in that other slave got a war Detroit all these games I'm excited about Days Gone all these great looking games if they do anything like this they're all going to be **** great and that's shocking and actually going into an open world like this I'm like man Day's Gone a **** big boulder to push up the hill here there you go that bar set pretty high now yes sir yeah so we'll see how that all works out but the uh yeah so go buy it I I I don't believe as I've said many times in the past the part being part of the conversation play games early I don't give a **** about that I don't think you should either you should simply just buy it because it is so good that you don't you don't want to torture yourself having to wait I mean the biggest thing about it I mean on that thing is like yeah you don't want to torture yourself and you don't want it to get spoiled like you don't want to know anything about this game in terms of where the story's going like that's the biggest part",
            "start": 2159.36
        },
        {
            "text": "like yeah you don't want to torture yourself and you don't want it to get spoiled like you don't want to know anything about this game in terms of where the story's going like that's the biggest part like it's one of those times where I mean don't get me wrong we're blessed on so many levels every day but to be somebody who gets to play the game when there's not anything happening and no one knows anything about it the twists and turns of this thing and where it all ends up and it's good you should play it that way indeed go buy it go play it uh ladies and gentlemen remember hey FCC PlayStation sent us this game for review we didn't steal it from a truck or whatever also remember that PSi love you XOXO posts Tuesday at 9:00 a.m. Pacific Time on youtube.com/ kindafunny games and podcast services around the globe and topic of the show tots will all be your questions about Horizon no spoilers again just details things you wanted to know you how it plays and whatnot like that",
            "start": 2196.8
        },
        {
            "text": "services around the globe and topic of the show will answer all your questions about Horizon Zero Dawn, no spoilers again, just details on things you wanted to know, how it plays and whatnot. Like that. Uh, I guess right now you can let us know in the comments what you thought of the review if you're excited for it, if you're picking it up. Don't Be a Jerk to each other and we'll see you until next time, it's been our pleasure to serve you.",
            "start": 2233.04
        }
    ]
}