{
    "id": 2405,
    "video_id": "UaPJiqIRvxU",
    "show_name": "Colin Was Right",
    "hosts": [
        "Colin Moriarty"
    ],
    "title": "How Mobile Gaming Ruined Everything - Colin Was Right",
    "description": "This week's episode of Colin Was Right tackles the plague of mobile gaming, and how it's been a proximity bomb to core gaming.",
    "published_at": 1487264405,
    "duration": 781,
    "transcript_chunks": [
        {
            "text": "greetings and salutations and welcome back once again to Colin Was Right let's jump right into it this week shall we today I'm setting my sights on mobile gaming but instead of just droning on about how bad mobile gaming is on its own I instead want to focus on how the mobile market has bled into the larger gaming Market infecting the console and PC spaces in the process I want to discuss how what makes that market tick is demonstrably and directly injurious to so-called core gaming Above All Else however I wanted to discuss how the industry's obsession with serving the broadest segment of the market possible came at least partially at the expense of the actual player of actual video games the person who will be here long after the ephemeral casual so-called player is long gone for starters there's no doubt that there are a handful of truly great mobile games I have no problem with gaming on a phone or tablet per se even though you can only do so with a touchscreen I really love Plants vs Zombies",
            "start": 3.92
        },
        {
            "text": "There's no doubt that there are a handful of truly great mobile games. I have no problem with gaming on a phone or tablet per se, even though you can only do so with a touchscreen. I really love Plants vs. Zombies as an example, even though Plants vs. Zombies happens to also be emblematic of mobile gaming's plague. I played PvZ on PS3 and paid for it upfront, but by the time it came out in 2013, I was roped into its obnoxious free-to-play model, which simply wouldn't let me pay for it as I would have literally given EA $20 for the game, but instead I played Plants vs. Zombies 2 for hours on end, refusing to give EA a cent simply because it kept prodding me to buy microtransactions and pay to win. It was the last time I ever truly gave a mobile game a chance. My iPad has since been a Kindle and internet browsing machine; such is the reality of mobile gaming, a fantastic illustration of why the entire market sucks, whether on iOS or Android, whether on phone or tablet, mobile.",
            "start": 41.16
        },
        {
            "text": "been a Kindle and internet browsing machine such is the reality of mobile gaming a fantastic illustration of why the entire market sucks whether on iOS or Android whether on phone or tablet mobile gaming has indefensibly affected so much we hold dear in traditional gaming it's had a destabilizing muddling and overall destructive effect on the core gaming population on the way we pay for discover look at and otherwise interact with games the infamous so-called race to the bottom that's mobile Gaming's fault the rise of microtransactions that's mobile Gaming's fault ever increasing emphasis on predatory free-to-play games that's mobile Gaming's fault digital Marketplace is rife with an absolute never-ending flood of crap left right and center that's mobile Gaming's fault the idea that we're all gamers and therefore we should pander to the absolute lowest common denominator that's mobile Gaming's fault Mobile gaming has contributed virtually nothing of value to our industry apart from",
            "start": 84.28
        },
        {
            "text": "all Gamers and therefore we should pedal to the absolute lowest common denominator that's mobile Gaming's fault Mobile gaming has contributed virtually nothing of value to our industry apart from sheer dollars and cents funnel to a few Publishers of a few games on a marketplace with literally hundreds of thousands of choices it deserves to be mocked and ridiculed because it is the very definition of lame let's take the last Point first because it's the Absurd notion that we're all Gamers that rests at the Nexus of all this completely Bonkers research from otherwise respectable pollsters and other trusted companies plays out the myth that a massive number of people play video games which as you and I know it just isn't true and this point really matters not in any sort of territorial gamer Pride sort of way but simply in having a market that can reliably analyze who is playing games and why how could you possibly know who to sell games to and how you should go about doing that",
            "start": 125.12
        },
        {
            "text": "gamer Pride sort of way but simply in having a market that can reliably analyze who is playing games and why how could you possibly know who to sell games to and how you should go about doing that if you think a person casually playing Words with Friends should be grouped in with folks who obsessively drew maps on graph paper while playing The Witness, a 2015 Pew Research study makes the outrageous claim that 49% of the adult American population plays video games. That same year, the ESA, the gaming industry's representative in Washington D.C., claimed that 155 million Americans play video games. Earlier I said that our segment of the industry is the segment that serves actual players of actual video games, and this is where that becomes especially important because in no way shape or form do 155 million Americans play video games, adult or otherwise, unless you count your ant's year-long FarmVille obsession and your neighbor's grandma's affinity for Peggle.",
            "start": 164.0
        },
        {
            "text": "do 155 million Americans play video games, adult or otherwise, unless you count your aunt's year-long FarmVille obsession and your neighbor's grandma's affinity for Peggle. Anyone with two eyes and a functioning brain can see and understand all of that just as they can see that cooking in your kitchen a few times a week doesn't make you a chef. Casually playing mobile games on your iPhone doesn't make you a player of video games any more than reading The Martian makes me an astronaut. This matters because once we're all lumped into as one group together, we begin to be treated as one group, and we aren't one group. Once you really jump into the data, you start to see just how absurd this \"we are all gamers\" becomes, and how the movement has contributed to the absolute blurring of lines between markets, and most destructively, how games are marketed and sold across those markets. The ESA's 2016 research indicates that 48% of gamers are primarily social gamers, 36% of what are referred to as hardcore gamers",
            "start": 204.36
        },
        {
            "text": "markets and most destructively how games are marketed and sold across those markets The ESA's 2016 research indicates that 48% of gamers are primarily social Gamers, 36% of what are referred to as the most frequent Gamers play on smartphones. Those numbers alone blow up that entire premise that half of the population games; it doesn't reflect our experience, but that hasn't stopped us from being treated like phone gamers in some ways with all the nonsense that entails. This race to get as many people playing playing any sort of video game on their smart devices has led to an entirely different race: the race to the bottom. This term was introduced to me by an ex-IGN colleague, and it provides a fascinating glimpse into the inherently destructive nature of the mobile market. In short, the race to the bottom was the idea in Mobile Gaming's infancy that developers needed to undercut one another to such a degree that the only place left to go was free; $10 became $5, $5 became $1, $1 became free to play",
            "start": 241.96
        },
        {
            "text": "the bottom was the idea in mobile gaming's infancy that developers needed to undercut one another to such a degree that the only place left to go was free $10 became $5 $5 became $1 $1 became free to play Maybe with microtransactions or baked-in ads and so the mobile game factory was born it's why so many people flipped out when Nintendo dared charge a premium price for Super Mario Run I mean how could they when the mobile market has conditioned so many to want to pay for nothing and how does that help anyone never mind that gaming is literally cheaper than ever a point I regularly beat you over the head with Mobile gaming, for lack of a better term, has completely poisoned the well I mean make no mistake about it this mentality has infected console and especially PC gaming The once-lead Steam Marketplace is so overwhelmed with trash that it's becoming in many ways a fact simile of the Apple and Google App Stores Gamespot reports that as of mid 2015 there were 6,000 games on",
            "start": 282.4
        },
        {
            "text": "once-launched Steam Marketplace is so overwhelmed with trash that it's becoming in many ways a fact similar to the Apple and Google App Stores. Gamespot reports that as of mid-2015, there were 6,000 games on Steam, or roughly eight times as many games as were released on NES and SNES respectively. Want to know how out of control it's gotten since then? At the end of 2016, Katach reported that Steam now has 11,861 games released in the last decade. Here's how out of control that Marketplace has gotten: In 2012, 379 new games came to Steam; in 2013, 565 new games came to Steam; in 2014, 1,772 new games came to Steam; in 2015, 2,964 new games came to Steam; and in 2016, 4,270 new games came to Steam. Are you seeing a trend? Do you think that trend happened in a vacuum or do you think that maybe a certain other marketplace may have affected how Steam does business? I wonder if Valve stopped caring about quality just like Apple and Google long ago have as always we will reap what they sow Discovery access and quality be",
            "start": 324.56
        },
        {
            "text": "May have affected how Steam does business. I wonder Valve stopped caring about quality, just like Apple and Google long ago have. As always, we will reap what they sow. Discovery access and quality be damned. As I discussed in a previous episode of Colin Was Right, it's not like the traditional console and handheld markets are immune either, especially on PS4 and Xbox One. Go read this week's The Drop posting on the PlayStation blog and marvel at the 10 games that will sell a combined 8,000 copies to a user base of 57 million players, all while the good and great releases get more and more buried. It wasn't always like this, friends. Once upon a time, not too long ago, there was a notion of quality over quantity. PSN and Xbox Live contain many times more games than were on NES, SNES, Genesis, and N64 combined. Again, where do you think this idea came from? Stuff like this doesn't happen in a vacuum. Being counterexamples at publishers across the world strove and continue to strive to replicate the financial",
            "start": 379.08
        },
        {
            "text": "combined again where do you think this idea came from stuff like this doesn't happen in a vacuum being counters at publishers across the world strove and continue to strive to replicate the financial success of the App Store actual players of actual games be damned I mean surely you remember walking into a store during the PlayStation 2 era and walking out with a free game in hand right you remember being pestered constantly to pay for little things in games perhaps an outfit or a token or even the right to keep playing I mean who doesn't remember those days finally oh wait those days didn't exist because in our space there was a time when games cost money you paid an upfront cost and there was no **** in between some games were good others were bad but games weren't deployed to be outwardly predatory many mobile games thousands upon thousands upon thousands that dwarf even PlayStation 4's absurdly big catalog of trash are as predatory as the day is long remember reading PSM or EGM",
            "start": 421.0
        },
        {
            "text": "predatory many mobile games thousands upon thousands upon thousands that dwarf even PlayStation 4's absurdly big catalog of trash are as predatory as the day is long remember reading PSM or EGM and having a grasp on pretty much everything that was coming out each month you deserve a special kind of praise if you ever even heard of half of the games being released on Xbox One each week nonetheless actually want to play them the proof is in the pudding Sony tanked an otherwise perfectly fine game Kill Strain by insisting the PlayStation 4 audience loves itself some free-to-play microtransaction nonsense it pulled up at the very last minute before it killed another otherwise promising game Drawn to Death by utilizing the same tactics there are absolutely examples of microtransactions and free-to-play working in the console space I've heard positive financial rumblings about games like Paragon and Warframe but remember this a broken clock is right twice a day and remember this too",
            "start": 460.56
        },
        {
            "text": "working in the console space I've heard positive financial rumblings about games like Paragon and Warframe but remember this a broken clock is right twice a day and remember this too is this really where you want console gaming to go do you want to be treated like the people playing Candy Crush Saga on their train during an evening commute with all this predatory dishonest scaming **** that comes along with it at the end of the day this rings more true than anything if your game is so **** good why don't you have the balls to charge for it up front the last line of defense folks use to defend the mobile market is just how profitable it is well let me end this episode of Colin Was Right dissecting and dispelling that line of **** because it mimics the idea that money equates the quality or the notion that ultimate redemption can only happen in an unfettered marketplace did you know Britney Spears is the epitome of musical talent she sold 100 million albums and another 100 million",
            "start": 499.92
        },
        {
            "text": "or the notion that ultimate redemption can only happen in an unfettered marketplace did you know Britney Spears is the epitome of musical talent she sold 100 million albums and another 100 million singles I mean she must be great early in 2016 research firm NPD reported projections for the growth of the gaming industry in 2015 they knew mobile gaming made up $3.4 billion of the $91.8 billion gross in the gaming industry at large their projections trended upward each year until 2019 at which point mobile gaming would have gone from $3.4 billion to $52.5 billion grossed per year increasing its market share from 24% to 34% during that time and that's supposed to be impressive but it isn't here's why those numbers are meaningless and are actually downright embarrassing when push comes to shove back in late 2015 SMS Mobile reports that 1.91 million smartphones were in the world at the same time NPD reports that $3.4 billion was gross from that bunch in other words to get a third of global",
            "start": 537.08
        },
        {
            "text": "back in late 2015 SMS Mobile reports that 1.91 million smartphones were in the world at the same time Newzoo reports that $3.4 billion was grossed from that bunch in other words to get a third of global gaming revenue developers needed to depend on a literal third of the global population and that doesn't even include tablets which are included in the revenue figure but not in the smartphone figure that's supposed to be impressive a market that made literally $15 on each customer with a reach of nearly 2 billion people sorry but that's not impressive at all that's actually embarrassing want to know what is impressive Newzoo reported that in 2015 handheld games produced $1.8 billion in revenue from a user base perhaps 50 million strong if you count both 3DS and Vita users at the time that's more than twice the amount grossed per customer as in the phone market 29% of that year's gross revenue came from consoles just 5% north of smartphones placing consoles in a $30 billion gross region",
            "start": 580.72
        },
        {
            "text": "twice the amount gross per customer as in the phone market 29% of that year's gross revenue came from consoles, just 5% north of smartphones. Placing consoles in a $30 billion gross region. In 2015, there were perhaps 150 million consoles people were buying games on, from laps to PS3s and Xbox 360s to newer Xbox Ones and PS4s. Let's be generous and bump that number to 200 million active consoles. That means console gaming made more money than mobile gaming with literally one-tenth of the user base. This is why talking about mobile gaming without context simply doesn't give the full picture. Smartphones grossing $15 per potential customer per year is about as impressive a victory as winning a baseball game with 50 people in the field. The reality of the mobile market is this: there are lots of potential players, some players will actually play, and virtually no one actually pays for anything. It's not a sustainable market by any stretch of the imagination. Way back in 2014 Forbes",
            "start": 623.88
        },
        {
            "text": "are lots of potential players some players will actually play and virtually no one actually pays for anything it's not a sustainable market by any stretch of the imagination way back in 2014 Forbes reported that a full 50% of mobile revenue came from 0.15% of the mobile audience, ad week just last year noted via statistics the company analyzed from Tapjoy that perhaps 70% of revenue in the mobile sector comes from so-called whales, a largely privileged term for a fraction of 1% of the mobile audience that dares pay for anything and when they do they go big oh and if you want to judge money made based on how many games are on the market we can play that game too as of the time I'm writing this script there are nearly 764,000 games on the App Store with about 100 more being uploaded every day according to Pocket Gamer's metrics there are literally more games uploaded to the App Store every day than there are games that came out on old consoles in entire calendar years but don't worry",
            "start": 663.28
        },
        {
            "text": "every day according to Pocket Gamer's metrics there are literally more games uploaded to the App Store every day than there are games that came out on old consoles in entire calendar years but don't worry because with that many games people must certainly be purchasing lots of titles oh wait that's not true either Venger Beat reports that nearly half of all mobile revenue, 48%, in fact comes from 0.19% of the entire mobile games user base sounds like a real recipe for success if you ask me I won't further belabor the point other than to say that all of this is exactly what you want to keep far far away from the console and PC space unfortunately it may already be too late the burgeoning number of games released weekly monthly quarterly and annually should distress all of us but it's also how these games are marketed sold and ultimately sustained that should truly worry and depress you the mobile gaming market is absolute trash its tactics from volume of games to how few people pay to",
            "start": 707.92
        },
        {
            "text": "these games are marketed, sold, and ultimately sustained that should truly worry and depress you - the mobile gaming market is absolute trash. It's tactics from volume of games to how few people pay to how folks are prodded into giving up their hard-earned dollars is nothing more than predatory. Let's work together to keep that **** away from our beloved core gaming space by speaking loud and clear not only with our voices but also with our wallets. Say it with me: mobile gaming is a plague. So let's strive to keep the plague isolated to a self-destructing market none of us care about to begin with. As always, thank you for watching Colin Was Right, and I have a fantastic rest of your day",
            "start": 746.08
        }
    ]
}