{
    "id": 2403,
    "video_id": "YHNMKy6JuyI",
    "show_name": "Kinda Funny Morning Show",
    "hosts": [
        "Nick Scarpino",
        "Kevin Coello",
        "Colin Moriarty"
    ],
    "title": "Harrison Ford Near Crashes & TSA Loves Cocaine! - Kinda Funny Morning Show 02.15.2017",
    "description": "Subscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1487193929,
    "duration": 4611,
    "transcript_chunks": [
        {
            "text": "Greetings and salutations, welcome to Colin live right here on Twitch.tv/Ofun Games. My name is K War, this is Nick Scarpino, Kevin Coello is off-screen. Here's a clap for you, Kevin. Now everyone's been whining and bitching, \"Where's Nick and Colin? They're the best combo.\" We want Nick and Colin, and we have to have Nick and Colin, and blah blah blah blah blah. Well, here we are, okay. Enjoy it and soak it in. Let the Rays hit you. The camera seems closer than usual today or used to looking. I think the monitor's a little zoomed in. Doesn't sound great on is that the one that Greg spit up on two weeks ago? No, no, this is Greg broke a mic really broke a microphone putting water on it. Huh, yeah, how much that cost us? Hold on one second. Sorry, is close maybe a little bit I don't know. You tell me. The banner looks fine on. I don't care. Are we hitting the banner? Greg broke a microphone, yeah, how much that cost? I haven't I haven't tested it yet. Those are expensive like I actually",
            "start": 0.9
        },
        {
            "text": "me the banner, it looks if it looks fine on. I don't care. Are we hitting the banner? Greg broke a microphone, yeah. How much that cost? I haven't, I haven't tested it yet. Those are expensive; like I actually don't know how much they cost. How much you know was worth the spit take, yeah. Oh, definately I'm sure it was definitely worth the spit take. Well, whatever we're here, we're going to enjoy our time together today and then I'm going to disappear again. No, who knows when the next time you're in? How was your episode of Colum, was uh Colum, was right going this week good? I started editing it doing just the assembly edit on on the bus and that was a fun experience on the bus getting jet yeah yeah that's fun that's fun. It save me a little bit of time and time is of the essence. I could just sit there listen to music or I could you know get some work done so that's what I did. Kevin, how are you today? Uh good trying to trying to get this guy to work okay you see it what I don't have I don't have the right clamp",
            "start": 61.04
        },
        {
            "text": "or I could get some work done, so that's what I did. Kevin, how are you today? Uh, good, trying to try and get this guy to work okay, you see it? What I don't have is I don't have the right clamp for it. Makes your forehead look really big, and you don't have a big forehead. Let me see it one more time. Well, it's my hair is like back; my hair is no but that shot because of its angle. Well, it's cuz it's just kind of placed. I need I need to get something to that's pretty clean man. I'm not going to lie. No, I know. I'm really happy with it. I like it. I'm really happy with it. It's better than that webcam; it handles the Highlight so much better. Yep, and the roll off yep. Now I just got to figure a way to key it out to key it out yeah that's going to be an oh **** I could probably pass it through uh Me2 with like but you still you still the green behind you yeah you're right need to put up a little green we have that the portable green you just have it on a little stand yeah you need to",
            "start": 109.8
        },
        {
            "text": "uh me2 with like but I you still you still the greed behind you yeah you're right need to put up a little green we have that the portable green you just have it on a little stand yeah you need to just do but what you need to do is make it so it's just your head though so it's a floating head that you just move 100% like Pac-Man and I'm just like hop hop hop but slower and more methodical and then toward the middle of it you just get tired and it just pout just like just like my life is it bad that when we start the show every day the only thing I can think of is lunch no that's fine is that natural that's 100% natural call Natural that's actually healthy if you think about it is it oh yeah I woke up so early today I woke up at 6:30 in the morning today for no reason I was just up my wife was around she was not feeling very well so I had to comfort her a little bit Yeah randomly our neighbors left us cupcakes on our door because they had a party two weeks ago they were like sorry we",
            "start": 153.72
        },
        {
            "text": "was around she was not feeling very well so I had to comfort her a little bit Yeah randomly our neighbors left us cupcakes on our door because they had a party two weeks ago they were like sorry we made so much noise during the Super Bowl here's some cupcakes and I was like **** I can't be mad they were strawberry cupcakes you like strawberry cupc you should have taken them and just smooshed them all like as all over their door like in every CR in the keyhole just like real loud though like take it h one at a time smear this is what I think here also here's another fun fact my neighbors next door appear they they appear to have gotten not one but two new dogs oh isn't that fun I mean are they noisy dogs I know what you're thinking Nick how can your neighbor next door have two dogs when our apartment complex doesn't allow pets Nick they're Millennials that's the answer they don't give a **** about anything no Nick I'm pretty sure they're not even on the lease all you have to do",
            "start": 196.4
        },
        {
            "text": "your apartment complex doesn't allow pets Nick, they're Millennials, that's the answer, they don't give a **** about anything, no Nick, I'm pretty sure they're not even on the lease, all you have to do is say that it's uh that you like have issues and you need the dog, yeah emotional support, yeah, they like they can't even ask you anything, they have two dogs, for like you go to a doctor and just tell them like oh yeah man I have anxiety, it's just like getting drugs in San Francisco, get the same little thing, yeah, pretty pretty sure that's not going to work for these guys, we haven't ratted them out yet but we're getting real close, real close, it's not that the dogs bother me you know I love dogs um cast you hate it's oh yeah cat the **** devil they should all be destroyed they should all just be taken into one big giant bucket and just incinerated um Jesus Christ I'm used your words not mine your words not mine I don't think that that's slightly accurate",
            "start": 240.08
        },
        {
            "text": "they should all just be taken into one big giant bucket and just incinerated um Jesus Christ I'm using your words not mine your words not mine I don't think that that's slightly accurate it's the fact that there is a total and complete utter disregard for the rules that I I just can't get Beyond Now Kevin you know this about me I'm not a rule breaker remember Colin have I ever told you about what happened when I when I go to the airport with Nick well you have to get there 4 hours early yeah but I mean that's not the issue is to get there four hours early issue I have strongly encourage you to get there four hours early it's a big difference the issue I have with Nick is that Nick's Nick's like **** we need to get on board immediately so that the camera can get stored up above instead of down below and I'm always like Okay cool so why don't we just quietly walk when they call like the first class people and he's like no no no you can't do that well I mean it's Nick makes a point in",
            "start": 280.12
        },
        {
            "text": "down below and I'm always like Okay cool so why don't we just quietly walk when they call like the first class people and he's like no no no you can't do that well I mean it's Nick makes a point in the sense that you can get away with that I would say more often than not you can get away with getting on the plane whatever you want yeah but it is the embarrassment of the times in which you are turned away because you are not gr but Col listen to this cuz this is what makes this story so uncomfortable is that I'm like Nick we have to get this camera on so just don't say anything and I just start walking and I get into the to the like let's say they call it group a and we clearly a group C what does what does Nick do does he just stand by or does he quietly follow me no he follows me and the whole time just we're not group a we're Group C I don't know if we're should be doing this I got I I got nervous and I start talking when I'm nervous and then I start apologizing when I'm",
            "start": 319.88
        },
        {
            "text": "me and the whole time just we're not group a we're Group C I don't know if we're should be doing this I got I I got nervous and I start talking when I'm nervous and then I start apologizing when I'm nervous so do they turn you away no no they **** I don't think they really care they they don't until they do and that's my thing is the only reason why I'm a rule follower is because I I used to break a lot of rules and I never got away with it so like I had one horrible United flight I think we were coming back from Georgia um where I was like hey I really need to get this camera on and the woman's like no get back and like get back what problem and I was like Jesus and it was like an altercation and I'm like ah man I don't want to have to like cuz what I don't like yelling at people that work for Airlines you know what I mean I hate it slash it's my favorite thing to do because those people are the siners of this generation right they're like the people that you know",
            "start": 366.12
        },
        {
            "text": "people that work for Airlines, you know what I mean. I hate it slash it's my favorite thing to do because those people are the sinners of this generation right. They're like the people that you know, they just have to take it but then sometimes talk back to you and you're like \"back at me\". I'm on Twitter, Kevin, let me ask you a question. I have something important to say. I want to make sure my microphone is actually working because people are still complaining about it in the chat. Oh, it's quiet. I don't know. You're the **** producer, so you tell me what was the situation with the microphone. I mean, the situation is we couldn't do audio tests for whatever reason. It's 10:08 though. You're listening to the show right now, and using your ears to listen to it. The thing is, you're just quiet today. The levels are fine; you're just being a little quieter than usual. So I'm going to ask you... I'm going to have to ask... I'm not going to project if you're going to",
            "start": 406.6
        },
        {
            "text": "the thing is you're just quiet today the levels are fine you're just being a little quieter than usual so i'm going to ask you i'm going to have to ask i'm not going to project if you're going to ask me to project i can't do that no no i would never ask you to project but if you could speak up that'd be great people are saying your mic works fine everything sounds fine go ahead speak up a little bit i'm not going to speak up yeah yeah no that's totally fair that's totally fair you're 100% right or noima says there is a buzzing in all caps people are saying there's a buzz i those people are crazy now i want to say a few important things you me to cut your one no okay well all right well no all right well it's too late you just look so cute in it you do look good in the one i've started the last month or so pooping in the morning yeah it's good for you now typically i poop in the afternoon i usually my lunch pushes the poop out yeah and so i poop let's say between the hours of",
            "start": 450.72
        },
        {
            "text": "the last month or so pooping in the morning yeah it's good for you now typically I poop in the afternoon I usually my lunch pushes the poop out yeah and so I poop let's say between the hours of 1 and three compacts it a little bit you know what I mean gets it ready for travel but now I'm waking up and I'm pooping in the mornings and it's it's not good know because some of the poops hurt and some of the poops let's just say they're not right and uh now get cuz you know I'm a poop doctor I studied this in school what are you talking about not right too watery too oily no there it's blood it's a not no blood I haven't had blood in my poop in a while but uh it's it's not it's it's not malformed either but it's a little soft and oh yeah gets everywhere is it one of those kind of where like if you move the wrong way you just look down like all of a sudden it's like an ink blot yeah exact that's exactly right and and the problem becomes uh the problem becomes therefore that like I pooped and",
            "start": 487.72
        },
        {
            "text": "you move the wrong way, you just look down like all of a sudden it's like an ink blot, yeah, exact that's exactly right. And and the problem becomes uh the problem becomes therefore that like I pooped and then I got in the shower today, right? You gotta immediately but then I got out of the shower and then I was getting ready, I called an Uber and then my stomach started to hurt so I could cancel the Uber and then I went and pooped again and the poop was a messy poop so I had to get back in the shower because I can't possibly you know it's like poop you know every once while I get in the shower and you have to poop, yeah. And then you have to get out of the shower during the shower you can always try to just aim it down the hole but and you can press it through like a y no and we've all done it, no we haven't all done it, I've been there, I've been there, but no, you haven't. He's lying, people. You gotta just kind of shit in with your foot first and then you smash smash it but your wife loves that",
            "start": 537.52
        },
        {
            "text": "we haven't all done it I've been there I've been there but no you haven't he's lying people you got to just kind of shit in with your foot first and then you smash smash it but your wife loves that too that's one issue that I'm dealing with the second thing I want to announce as more pertinent is that during GDC I can now talk about this a little bit during GDC the week of GDC I'm going to be doing a series of interviews with different people in the industry which I am aptly calling A Conversation With Colin Moriarty, which is yes the best name of any show we've done I know now I can tell you as I tweeted yesterday Jason Schreier is going to be on one of those uh which everyone's really excited about that tweet has an enormous amount of favorites like two and a half thousand so everyone's apparently very excited about that one Jason Steres the G but the uh the thing is is that the the interview series is going to be based on like I want to talk to you about games journalism I want to talk to",
            "start": 575.4
        },
        {
            "text": "very excited about that one Jason Statham the G, but the uh the thing is is that the the interview series is going to be based on like I want to talk to you about games journalism I want to talk to uh Jeremy Dunham from Psygnosis is going to come in we're going to talk about probably the business of games I'm going to talk about the business of independent games I'm going to talk about retro games things so we're looking at between five and seven interviews that will go live that week and the week after on Kinda Funny Games on YouTube uh that will take the place of one episode of Colin's right there will be no episode of Colin's normal episode during are they going to be broken out or they're going to be they're going to be one full so going be hour-long interviews as is are we recording that here uh yes they're all on the calendar do you have no I know but do you have an idea of what you want the background to look like like hell would be fun since that's my life so just a nice fiery pit",
            "start": 618.36
        },
        {
            "text": "Here uh yes they're all on the calendar do you have no I know but do you have an idea of what you want the background to look like like hell would be fun since that's my life so just a nice fiery pit would be good Col why can't you enjoy the awesomeness I'm not capable not capable of enjoying anything oh you are it's there I can see it there is one thing I'm very excited about but I cannot talk about it yet that I'm authentically actually excited about Are you getting a puppy I have a puppy but she's old and shitty Comfort dogs like he was talking about no L is definitely not an emotional support animal in case you could tell uh okay that's all I want to talk about Nick are you well uh yeah yeah other than my my sleep depravity but I'm good yeah so you went to bed at a normal time but then you got up at 6 people are saying I sound a lot louder than Colin that's that's more the issue you want to bring me down just a goond do don't worry cuz Kevin's got his headphones on and he",
            "start": 657.24
        },
        {
            "text": "but then you got up at 6 people are saying I sound a lot louder than Colin, that's more the issue, you want to bring me down just go on do don't worry cuz Kevin's got his headphones on and he says you sound fine these people, people, they're all probably from Central Time, who started that war up again, be careful, be careful, a lot of people had a problem with Central Time, did hate it, we stopped the Jewish jokes, him and him, I'm not making Jewish jokes, I'm making Nazi jokes, I'm just saying him and PewDiePie cannot stand Central Time, um, that's not funny, n that was sad, I'm sorry, I apologize, PewDiePie's going through it right now, I don't really I don't quite understand what's going on can someone explain to me what's going on with PewDiePie because I read just a story yesterday that said actually two days ago I think I read a story that he got dropped by his MCN yeah and Disney and well Disney owns Maker I guess and they dropped him whatever I'm sure got dropped by YouTube Red",
            "start": 707.08
        },
        {
            "text": "said actually two days ago I think I read a story that he got dropped by his MCN yeah and Disney and well Disney owns Maker Studios, I guess, and they dropped him whatever I'm sure he got dropped by YouTube Red. YouTube Red okay he made some what some could what what he I I assume giving him the benefit of doubt wanted to be sarcastic comments right so he used this service that would do anything for $5 pretty cool so basically you pay five bucks they'll do anything right um and I believe it was in India, in India yeah yeah and so he paid two guys to hold up a sign that said \"Death to all Jews\" but what was the point of the joke I don't know I think his point was to make some sort of social commentary on like you can do anything now and get away with it um he didn't get away with it is that what it was I I I mean I don't I the video explaining what it was got taken down so I don't know Kevin has watched it but um no one mirrored I'm sure it's I'm sure it's there I just I looked on his Channel I didn't look at",
            "start": 749.88
        },
        {
            "text": "I don't know the video explaining what it was got taken down so I don't know Kevin has watched it but um no one mirrored I'm sure it's I'm sure it's there I just I looked on his Channel I didn't look at it and honestly I don't really care too much about PewDiePie um but the other issue was he had made jokes about Nazis and Jews uh in prior videos and so people some people jumped to the conclusion that this was a trend for him and so they were basically labeling him anti-semite now I don't watch a lot of PewDiePie I'm not really in a place where I feel like I can I can render an opinion on this but I do know that he has he's been known to push boundaries in in you know sort of under the guise of social commentary so I wouldn't put it past him that this was something he was intentionally trying to do and have good come of it but people are like yo took it too far he took it too far what is his nationality he's Swedish or Finnish or something I think somewhere around there this is actually a",
            "start": 796.44
        },
        {
            "text": "to do and have good come of it but people are like yo took it too far he took it too far what is his nationality he's Swedish or Finnish or something I think somewhere around there this is actually a relevant question to how how offended I think you should be by the jokes based on the proximity of whatever country he he's from that country's experience during the War I think is relevant yeah uh also uh Swedish he's Swedish okay but I think he lives I think he lives in Scotland now or something like that so I think he actually lives in England does he live in England Tim said Scotland yesterday says Kevin per central time I mean he might uh it's mountain time yeah I was going to say p not central time also it's mostly Pacific time but just when we switch over it's Mountain Time what do you mean switch over you have different time zones no when uh we do the daylight savings but that doesn't change your time zone you're either going to still be Mountain I don't know if Peru does Daylight",
            "start": 836.68
        },
        {
            "text": "mean switch over you have different time zones no when uh we do daylight savings but that doesn't change your time zone you're either going to still be Mountain I don't know if Peru does Daylight Saving Time maybe probably not because it's nonsense yeah it absolutely is although they probably something way weirder down there in Peru I mean uh they do banana time plantain time does that even exist Plantana time I was reading about the Columbian Exchange last night interesting what is that the uh the idea that you know when when Columbus came to the new world and then the Explorers started to follow that you know there was an exchange of goods and ideas between the new world and the old world mhm and obviously we know things like potatoes and all that kind of stuff came from here and went there and then became very important to European culture the Tomato I didn't realize obviously the tomato is indigenous to to the Americas we know that but I didn't realize that for many centuries they",
            "start": 884.6
        },
        {
            "text": "and then became very important to European culture the Tomato I didn't realize obviously the Tomato is indigenous to the Americas, we know that but I didn't realize that for many centuries they didn't really even know if you could eat it safely, that it wasn't really until like 200 years ago that they really started to like work with the Tomato even though they had a couple hundred years before that because they didn't really understand whether there were rumors that it caused like all sorts of problems if you ate them, there's still those you still every once in a while hear those random uh uh wives' tales about nightshades because I believe it's a Nightshade if I'm not mistaken about like how it could be bad for you but whatever here's what happened though the Italians were like we don't give a **** we've got this giant circle of dough in front of us, we've got to put something on it, it's disgusting Italian food is a fusion of Italian food is a fusion of Chinese ideas and uh",
            "start": 932.36
        },
        {
            "text": "we don't give a **** we've got this giant circle of dough in front of us we got to put something on it it's disgusting Italian food is a fusion Italian food is a fusion of of Chinese ideas and uh and goods from South America and Central America which is interesting the Marco Polo meets Columbus kind of nonsense that ends up making the best ethnic food in the world pretty much didn't know if you knew that Kevin it's noo there's a lot of Asian influences improving Foods I was reading about that too how because they found certain potato strands in certain Micronesian islands and then all the way over to like New Guinea and stuff like that that were from South America that they they think that there was some sort of cultural exchange there too it's really super interesting it's like when that guy found Roman coins in California indicating that the Romans might have come here very interesting very interesting indeed but then there's all that fake stuff like in Missouri they found",
            "start": 968.12
        },
        {
            "text": "when that guy found Roman coins in California indicating that the Romans might have come here very interesting very interesting indeed but then there's all that fake stuff like in Missouri they found that Rune that that that Norse Rune that indicated that the Vikings not only came to the United States at the time but also penetrated the country to like thousands of miles penetrated ended up being fake but what's not fake of course is in New Finland the the Viking territories are still there the bking settlements well it's been a good show bye everyone there's only a few news stories none of them are really that interesting I don't even know if you really want to read them I don't really I don't think we have to Ian we don't I don't know if we have to let's go let's go through them real quick all right uh let's do of course subscribe to us on Soundcloud this is a podcast also if you didn't know if you're watch this live this is also on YouTube youtube.com/ kindafunny you can get this",
            "start": 1017.44
        },
        {
            "text": "all right uh let's do of course subscribe to us on Soundcloud this is a podcast also if you didn't know if you're watching this live this is also on YouTube youtube.com/ kindafunny you can get this it posts in like an hour after the show's done wait I have a quick question that you guys can answer yeah Fun Clips is canceled no it's definitely not Greg cancelled Fun Clips Greg doesn't have the power to cancel stuff he's only on the show two days a week now yeah unfortunately and even when he's then he clearly doesn't give a **** about anything cuz he just spits water all over the goddamn place he did that once it's good that he spit water on our the microphones cost hundreds and hundred like dollars a piece don't they these are not inexpensive they're not inexpensive but I think and I quote Greg said **** you guys I don't care I own part of this company I'll take it out of your asses I think is what he said that was a direct quote",
            "start": 1058.72
        },
        {
            "text": "quote Greg said **** you guys I don't care I own part of this company I'll take it out of your asses I think is what he said that was a direct quote and then I was like that could be fun that could be fun uh no Greg has a war with Fun Clips he doesn't like it he does like it because it's uh unruly uh and creative and fun so what we've asked people respectfully to do is to respect Greg's wishes is that they uh not only tweet the FunClips at Nick Scarpino and follow me on Twitter but also tweet them at Greg double tweet them at Greg tweet him two to three times a day Greg just so just so he knows because they really helped him when he was sick he said he said that to me he didn't say it to me but he looked at me in the eyes and was like yeah I inferred that from him I mean the he was eating C these are like 156 I will say this about FunClips they're fun Clips but the problem is is that there is no retaliatory measures in place if the clips aren't good and there has to be well you want to",
            "start": 1093.96
        },
        {
            "text": "these are like 156 i will say this about fun Clips they're fun Clips but the problem is is that there is no retaliatory measures in place if the clips aren't good and there has to be well you want to beat them up that's one option the option I was thinking was a little more easier a little less violent what did you say Kevin that a lot of people are saying that's the strongest and best option I mean it's one option that we could put on the table let's keep it on the table but what I think we should look at instead Kevin yeah is what we should what we should really strive to do is to take names and what I was saying was that this remember the last time that a man took a list of names yeah it was Joseph McCarthy and he ended up being a great American hero as you know that McCarthyism is a is synonymous with positivity exactly and so what we're going to do is we're going to take a list of names and i have a list of names Kevin okay and on that list are people that sent us bad clips",
            "start": 1134.48
        },
        {
            "text": "is synonymous with positivity exactly and so what we're going to do is we're going to take a list of names and I have a list of names Kevin okay and on that list are people that sent us bad clips and they're Communists that's the other **** up thing one of them is but in all seriousness if you submit a bad clip you should be exiled you shouldn't be allowed to chat in other words it should be a risk reward right you put the clip in the problem is there's then you don't know so if it's not good enough see the the reward is oh user Joe Blow uh Walking Dead and Stephen Hawking sent us a clip right Walking Dead and Stephen Hawking makes us laugh he is the hero of the day see but Walking Dead and Stephen Hawking sends us a bad clip dead he can never talk in the chat again he can never say anything period ever there it's not a short ban it's a permanent ban like Pete Rose from the MLB permanent ban one day ban for the rest of the day they can't talk have the mods do that",
            "start": 1180.56
        },
        {
            "text": "there it's not a short band it's a permanent band Permanent B Perman like Pete Rose from the MLB permanent ban one day ban for the rest of the day they can't talk can have the mods do that we'll call this option two assuming they're not using a throwaway name to hide their identity so they don't get punished so option one is we go to their house and beat them up or at least attempt to cuz some of these people are probably bigger than us no we can get them option two we ban them for Life option three Kevin pre-screens the videos and if they're not funny we just don't watch them option three is the most logical I think option one is the most fun I mean I love option one it's very much like the end of Jay and Silent Bob I'm dead serious it's total roulette you're going to think twice before you send I'm sorry option option one as we go to people's house it's going to cost no that's too much I mean that would be fun but I'm not going to do that and option two it's the risk",
            "start": 1241.16
        },
        {
            "text": "\"Twice before you send, I'm sorry. Option one as we go to people's house - it's going to cost no, that's too much. I mean, that would be fun, but I'm not going to do that. And option two, it's the risk reward, it's the essence of roulette. Put your chips on the table, Kevin. Put them all on the table with that video. If you believe otherwise, you're done, and we won't play games. I'm not going to play games; I'm not going to say I'm not not going to laugh at your video because you understand what I'm saying. I want I want to cons - I want people to consider this particular option, and I think it would be very fun indeed. And I bet you the clips, the quality of the clips would be way higher. I think people would stop making Clips at that point, but that's okay. No, because the bold carpet DM right, Kevin, see the day carpet DM carpet M to the bold go the glory exactly yeah sees it, God damn it to the victors go the spoils. Should we read some tips before we get into the news? Sure, go ahead and read some tips why.\"",
            "start": 1282.72
        },
        {
            "text": "day carpet DM carpet m to the bold go the glory exactly yeah sees it godamn it to the victors go the spoils should we read some tips before we get into the news sure go ahead and read some tips why not M Dog Nike 96 says Nick 96 says what's up what up punk heads I hope you're all having a great hump day do you guys have a preferred uh brand of condom interesting uh Trojan think they make like an extra Thin Condom are fun taking life in your hands with that one any any particular brand I will say this this is and this isn't a joke it's just it's just a thing right MH back when I was a young man you wear condoms whatever just whatever condoms you get yeah my roommate Doug uh who sometimes watches the show I think who I was my roommate uh back in college for a year great guy wore Trojan condoms and just like sometimes yeah exactly and then I started wearing them later on realizing that they they fit very comfortably and that old condoms were sucking the absolute life out of my penis",
            "start": 1324.12
        },
        {
            "text": "condoms and just like sometimes yeah exactly and then I started wearing them later on realizing that they they fit very comfortably and that old condoms were sucking the absolute life out of my penis that they're not supposed to be Kevin it in fact so tight that it's like putting a balloon in I don't even know I don't it was it was like it was so tight I was like going to shoot I was going to cut my dick off and shoot it Forward because of sheer pressure so I I don't you know it's probably dangerous to have them that tight by the way you probably don't want them that tight are you getting the extra Smalls getting normals are there extra small condoms that would be  awesome if you had to walk into a store and buy extra small condoms uh but no I like the the Magnum Condoms they fit very comfortably um and apparently your dick doesn't even have to be that big to for them to fit comfortably some people just enjoy them the Magnums yeah because it's just it gives you a little room you know little",
            "start": 1370.24
        },
        {
            "text": "um and apparently your dick doesn't even have to be that big to for them to fit comfortably some people just enjoy them the Magnum's yeah because it's just it gives you a little room you know little room to like it's like having a nice uh Condom Overcoat for the winter you know what I mean you don't want it too snug you want to be able to get around in it like if you get caught you can Wiggle out way out like Riggs from Lethal Weapon but for real I don't wear condoms next question uh M M M Cabe says Colin what are your thoughts about the Flynn Russian Russia situation Nick what are your thoughts about using Bongos as Kevin's punishment big Kev dog just keep being sexy have a great day boys the the Flynn situation Michael Flynn situation is super interesting because this could actually be the focal point the Nexus in which Donald Trump's presidency unravels depending on uh what the Russians have on Trump and if there was a quid pro quo um between Flynn Andor Trump and",
            "start": 1417.52
        },
        {
            "text": "Actually, the focal point of which Donald Trump's presidency unravels depending on uh what the Russians have on Trump and if there was a quid pro quo um between Flynn And Trump and the Russians having to do with the Obama uh expelling of uh diplomats and the the you know whatever kind of financial ramifications are going on there as well um so we'll see I don't know uh I thought it was interesting that Trump is still defending him um but I think it's somewhat clear at least from my perspective that the Russians must be blackmailing Trump to some degree I don't know that's the only way that's the only way I can read into it it's crazy crazy crazy uh next tip comes from by the way that's not fascism just throwing that out there you don't know that Cc Ocean says \"Sting my birthday attx\" with a Nintendo Switch close to being launch to be launching what are your favorite Nintendo memory what are your favorite Nintendo memories and favorite game from Nintendo it's a longer",
            "start": 1454.32
        },
        {
            "text": "Attax with a Nintendo Switch close to being launched, what are your favorite Nintendo memories? What are your favorite Nintendo memories and favorite game from Nintendo - it's a longer question. It's a long question. Favorite Nintendo game is probably like published Nintendo game is probably Super Mario World. Uh, I, I have this memory that is so old that I'm not sure that it's just a made-up memory. I don't think it is. Yeah, I was probably two and a half. I remember being in my dad's car - my dad had two cars, uh, growing up he had this like Mazda pickup truck that he would drive into the city expecting that at any moment it would get stolen. It had no radio and all this kind of stuff. And uh, I remember being in that truck with my brother D and my dad going into New York City to get an NES in New York.\n\nI corrected the following:\n\n* \"attx\" → \"Attax\" (assuming a typo)\n* \"Nintendo switch close to being launch\" → \"Nintendo Switch close to being launched\"\n* \"favorite Nintendo memory\" → \"favorite Nintendo memories\" (plural form matches the context)\n* \"published Nintendo game is probably like\" → removed unnecessary phrase\n* \"Super Mario World\" was already capitalized, but I double-checked to ensure it's correct\n* \"East New York and Brooklyn as a fireman which is one of the worst parts of New York City still to this day so you would never drive your normal car there\" is a long sentence, but I left it intact as per the instructions\n* \"my dad's car\" was corrected from \"my my dad's car\"\n* \"Mazda pickup truck\" was already correct, but I double-checked to ensure it matches the context\n* \"D\" → \"brother D\" (assuming a typo or shorthand for \"David\")\n* \"get an NES in New York\" is a fragment, but I left it intact as per the instructions",
            "start": 1506.36
        },
        {
            "text": "that at any moment it would get stolen it had no radio and all this kind of stuff and uh I remember being in that truck with my brother D and my dad going into New York City get an NES in New York City because New York City was one of the test markets uh for Nintendo um and I remember I I remember driving being in the middle seat going into the City and coming home with this device um and I don't think it's a false memory at all so I mean that's my earliest Nintendo memory and I think that's a a great Nintendo memory I think I remember going to a KB Toys and getting mine back in the day I made my mom go to like five KB Toys she was not happy my mom does not like that **** uh DJ Kent Kento gave us a nice tip and said Greg isn't on the show dare I say fun Clips question mark gave us a clip says less than a minute Darkly funny CGI comedy if col doesn't enjoy it I'll never fun Clips tip again uh I think who who is this this is DJ K okay so DJ Kento is the first one up DJ Kenta will be",
            "start": 1544.52
        },
        {
            "text": "Says less than a minute Darkly funny CGI comedy if Col doesn't enjoy it, I'll never fund Clips again. Uh, I think who, who is this? This is DJ K, okay, so DJ Kenta will be banned for life from twitch.tv/kindafunnygames if the video isn't funny. Now he may have sent that tip before you put the ban on him; he didn't fact-check send that tip before. Secondly, why don't you just screen it and tell us if it's I already screened... Why don't you guys want to have fun? This is putting it all on the line, okay, this is putting some flesh in the game. I feel like it might not be in the spirit of the fun clip section. Yeah, we're like, hey, let's play a fun game, and you're like, yep, here's a gun, Russian Roulette, let's do this. Is it not a fun game? It's not fun, I mean for 99% of people, not crazy uhin 123 says need help getting 1,000 views on my BuzzFeed article for a college class; love the content, hi Nick Colin. Uh, here it is; he gave us that link. Just make a better article, you know what I",
            "start": 1584.68
        },
        {
            "text": "123 says need help getting 1000 views on my BuzzFeed article for a college class love the content hi Nick Colin uh here it is he gave us that link just make a better article you know what I mean yeah I don't know what we're going to do with that this one I mean I assume so do we do I don't know what's our policy on throwing that in the comment section or in the chat yeah **** it all right yeah throw it everyone click on this and give him some love so that his he can get an A in his college class College CL how to write a BuzzFeed article good for you how many safe spaces you know what I'm glad about what's the article called when you must come to realize when what you must come to realize when dating a guitarist that's a terrible headline yeah you should fix that headline it should be a number like yeah should be 10 things you have to realize when dating a guitarist what you must come to realize when dating a guitarist all right I don't know if you know this but I'm a writer\n\nCorrected changes:\n\n- \"BuzzFeed\" was already correctly transcribed, so no change.\n- Proper nouns were capitalized: Nick, Colin, BuzzFeed.",
            "start": 1634.48
        },
        {
            "text": "Be a number, like yeah, should be 10 things you have to realize when dating a guitarist. What you must come to realize when dating a guitarist. All right, I don't know if you know this, but I'm a writer. Give him some feedback on this. Oh, it isn't... it is a list video. It needs to have spoilers. It needs to have a number in the title. Just FYI, not video rather video. Yeah, it's a list, it's a listicle. How would you fix that title? Well, um, let me jump down here and see what the... how many numbers is it? Five, five add one more, I think you have to. It has to be more. It has to be... I don't mind passive writing really, but it has to be like... I think that people who are totally against passive writing as in saying something can't be something like this is this is is passive and people don't like that. I like writing like that. This is too passive though. So I would say uh like put the subject first in other words what the person realizes when dating a guitarist make it active, it doesn't matter about the length.",
            "start": 1676.28
        },
        {
            "text": "like that this is too passive though so I would say uh like put the subject first in other words what the person realizes when dating a guitarist make it a force it doesn't matter about the length because because it you a long thing as long as it makes sense what you must come to realize when dating a guitarist is Serpentine it doesn't make any sense it's circuitous but don't you think five a better title be five things that suck about dating a guitarist if you don't mind being sexist and I don't mean this in a bad way like it's it's like what every guy's girlfriend learns that's a good one five things every guy's girlfriend learns that's pretty good that's pretty I like that too of course you know girls don't play guitar so I don't think that's a problem history in the history of music I've never seen a girl play guitar that is a fact you you guys are right about that or drums L Kravitz is a drummer only ever female drummer I'm not sure she was actually female worst drummer",
            "start": 1714.76
        },
        {
            "text": "of Music I've never seen a girl play guitar that is a fact you guys are right about that or drums L Kravitz is a drummer only ever female drummer I'm not sure she was actually female worst drummer of all time is a woman Meg White but you know there are great great women drummers all right so I hope this kid learned a lesson moving on there you go uh XLE Co says Colin how do you normally hold the controller while playing Mega Man while watching your let's play it seems you normally let out off around three shots When jumping I can't seem to get close to that well it's CU you're a noob and when you have to what you have to and what you have to do is you have to you have to you have to practice see playing Mega Man is like it's the hump day I got to I'm pretty convinced that I can get through certain Mega Man stages without looking at the this the game so do it it's we should I really want to we should try you give me like 10 minutes I can set it up well I would need I would need to",
            "start": 1755.72
        },
        {
            "text": "certain Mega Man stages without looking at the this the game so do it it's we should I really want to we should try you give me like 10 minutes I can set it up well I would need I would need to practice first oh Jesus not going to do it like blind all right well I thought you see that's what the statement sound like like you going to do it blind no but I think if we had like a little challenge where it's like could you get through Mega Man stage would be a little tough because dis it's not as fun now Hard Man stage probably Flash Man stage obviously Flash Man stage yeah that would be tough see Ice Man stage and Flash Man stage would be tough specifically because you don't stop moving when you stop because of the slipperiness so that would be that would be too unpredictable if you have if you get a chance to practice it it's not as cool I thought you meant like right now you could do it no what what I'm not going to do it right now well I thought that's what you meant when you",
            "start": 1797.12
        },
        {
            "text": "have if you get a chance to practice it's not as cool I thought you meant like right now you could do it no what what I'm not going to do it right now well I thought that's what you meant when you said that because this feeds into this is a lesson learned for you Kevin no it's not and for all of us in fact everyone even Nick I I don't think Nick's pay you put it all out on the line you got to make sure to be ready to pull put it all on the line and I'm not ready you you going to pack that heat Into the Night inside you put it all on the line I said I'm not quite ready to put it all out on the line see that's what that's this goes back to the fun Clips because someone said in the chat I'm not going to pay $5 and then risk a lifetime ban and I'm like then you're not willing to **** play baseball with me right again if we just do it a one one day ban but why one day can we do not happening why are you even entertaining",
            "start": 1830.88
        },
        {
            "text": "baseball with me right again if we just do it a one one day ban but why one one day can we do one week we're definitely not banning anyone I mean we could do not happening why are you even entertaining this notion Kevin because I like the idea of the game against the spirit of the fun clip section but I I really think that this will up the amount of funnest that they have what happens if I bring a fun clip in and no one likes it then you're banned well I'm banned for I don't have to do the show ever again no you have to do the show you just can't chat you can't go in the chat which you don't do anyway so it's fine I'm constantly in the chat that's not even a little I definitely am ask them I always make fun of you and call them them in the chat me all the time anything goes wrong even if it's not your fault I say absolute Blake it is almost your and then I and then I do this this is my favorite thing to do I go B enter o enter enter o there you go bongos should we read more let's get into",
            "start": 1870.04
        },
        {
            "text": "not your fault I say absolute Blake it is almost your and then I and then I do this this is my favorite thing to do I go B enter o enter enter o there you go bongos should we read more let's get into the news we'll tips I'm gonna read the news really quickly because I have other things to do okay by the way by the way Yeah tomorrow's col was right is about Mobile gaming there you go okay they won you over they did it's about how great mobile games are and how I was wrong about them all along no it's about how they **** suck I found one game that really worked and now I love mobile games that's what you're trying to say yeah there's some good mobile games I mean there's 750,000 choices on the App Store so I hope some of them are good uh all right first story uh has to do uh with Jesus first story yes it's the first story that's crazy 30 minutes in this happened yesterday too Colin and Greg live is a a show that's been canceled it's not been canceled I mean it's just no yeah it's",
            "start": 1905.08
        },
        {
            "text": "Colin Moriarty and GameOverGreggy live is a a show that's been canceled it's not been canceled I mean it's just no yeah it's done I mean I'm here right now calling it that you know I don't think that makes it true though see I think I have some sort of because the provenance of the show of course is should I close the story then no don't close the story leave it open the provenance of the of the show of course is is completely with me so I have complete naming rights to it even if that's not the real name of the show I will continue to call it that until someone forces me to stop which hasn't happened yet yeah no one I'm reminded every once in a while the show's not called that anymore like I know I'm well aware of what the show is called you know so but it'll always be Colin and Greg live in my heart even though it killed Greg because his name wasn't first now the first story Kevin is about E3 unfortunately",
            "start": 1953.4
        },
        {
            "text": "of what the show is called you know so but it'll always be Colin and Greg live in my heart even though it killed Greg because his name wasn't first now the first story Kevin is about E3 unfortunately which I cannot can't wait right oh my God I **** hate E3 you guys hey it was so much fun come on we had fun last year E3 sucks no by the way I can't believe people are not paying to go to E3 what are you thinking 15,000 pay3 how much more fun is that going to be with that many people on the show floor I'll be all over the show floor not so fun uh okay the first story has to do with uh people are starting to finally announce the dates and times of their press conferences e3s uh or Xbox's E3 press conference will be Sunday June 11th at 2:00 p.m. Pacific this is uh they going Sunday yeah this is uh different this is not where Microsoft usually goes fascinating so um Microsoft usually goes on Monday um me Sony will go earlier Sony always goes at 6 pm. on Monday wait if they did",
            "start": 1994.72
        },
        {
            "text": "yeah this is uh different this is not where Microsoft usually goes fascinating so um Microsoft usually goes on Monday um me Sony will go earlier Sony always goes at 6 pm. on Monday wait if they did traditionally um so we'll see we'll see how that all works out my my biggest curiosity is if there will be anything on Tuesday morning which sometimes there is as well is it Nintendo always on Tuesday yep but Nintendo you know **** out of E3 typ Nintendo does a do you think they do a direct no they'll do an either no they'll do they'll do a pressor I think if they're smart oh for the switch yeah it would have already come and gone no one cares about it by then right joking doesn't really seem that many people I mean just real talk doesn't seem like that many people care about it now everyone like it's sold out I'm like of course it's sold out they only made 10 of them it's a launch of a console Wii U is sold out I can't believe how little they've said about the switch like we don't know",
            "start": 2042.4
        },
        {
            "text": "like it's sold out I'm like of course it's sold out they only made 10 of them it's a launch of a console Wii U is sold out I can't believe how little they've said about the switch like we don't know anything about this console it's like really it's comes out literally like 3 weeks yeah it's weird it's very bizarre it's totally bizarre this thing is totally Half Baked and not ready to go I really I really think they're Rush waiting to know like what would what would you still like to know there's a lot of things I'd like to know they don't haven't talked about the infrastructure they haven't talked about really about Virtual Console they haven't talked about any sort of trophy system they haven't talked about the depth of the online systems they haven't talked about a lot of things people don't really even quite understand it seems like the power of the pro of of of the of the unit they're very being very vague it's strangely vague it's not a good sign like anyway you cut it but you",
            "start": 2083.6
        },
        {
            "text": "don't really even quite understand it seems like the power of the pro of the Nintendo Switch unit they're being very vague it's strangely vague it's not a good sign like anyway you cut it but you know at least we'll have The Legend of Zelda to play and then we won't have anything else to play for six months that'll be fun um by the way I'm going full bore I'm just gonna I'm just getting it I haven't pre-ordered I'm just going to get it the thing I forgot is I didn't pre-order Zelda do I have to can I download can you download games on the Switch I don't know they haven't told me maybe I'll just download it okay next story uh this one comes from PlayStation blog uh Chris Rose from TT Games simply announces that Lego Worlds will come to PS4 in March I assume it will also come to other consoles probably Xbox One um so Lego Worlds is basically this kind of Minecraft like building game uh that makes a lot of sense for Lego to do um to try to eat into that obviously massive market of 105 million games",
            "start": 2119.4
        },
        {
            "text": "Xbox One um so Lego Worlds is basically this kind of Minecraft like building game uh that makes a lot of sense for Lego to do um to try to eat into that obviously massive market of 105 million games sold which is what Minecraft is at now um so keep an eye out for that if you are interested next story has to do with a game I had some interest in uh but seems to have been you know predictably failed at at Kickstarter uh over Vic Vickers BL Apocalypse Now game quits Kickstarter asks for $5 million on its own crowdfunding site um says the developer of Apocalypse Now has relocated the campaign to its own crowdfunding site after failing to secure funding via Kickstarter to date at the Kickstarter drive which describes the game as like Fallout New Vegas on acid in Vietnam has secured just $172,000 of the $900,000 target with just nine days left to go un Kickstarter there's no finite end date for The Campaign on the new site and backers will not be charged until the full amount has been raised",
            "start": 2158.0
        },
        {
            "text": "of the $900,000 target with just nine days left to go on Kickstarter there's no finite end date for The Campaign on the new site and backers will not be charged until the full amount has been raised pledges made to the original Kickstarter project can move their backing to the new platform where every hardcore backer will receive a reward tier upgrade essentially getting the rewards on the next tier up for no extra cost um I think the game has no chance of raising that amount of money but I am super intrigued by an Apocalypse Now game so we'll see how that's fascinating but Jesus five mil huh well the only thing I'm I'm confused because the headline says they're asking for five mil but it sounds like their target is a million yeah I think that they probably have stretch goals or whatever they didn't need they asked for less than a million on Kickstarter so it seems like that's what they need for the base game I think their best chance would be to go to Fig and try to get like real",
            "start": 2204.12
        },
        {
            "text": "They didn't need they asked for less than a million on Kickstarter so it seems like that's what they need for the base game I think their best chance would be to go to Fig and try to get like real investors um I'm sure but you never know maybe that is still what's happening right like maybe that's just the initial and then they want to go somewhere else and get half the other half of the budget filled out yep so we'll see it's a fascinating concept though because I'm like if there's one thing Gamers really know it's Apocalypse Now great movie you know it's an awesome movie it's a great movie Francis Ford Coppola I don't know if I'm being sarcastic to be perfectly honest the movie is an awesome movie but it's pretty obscure at this point yeah it is it is John Milius of course also wrote Red Dawn which is the greatest movie of all time never seen a lot of great movies he also wrote Homefront the video game although then it we all found out that that was a complete lie okay what does that mean",
            "start": 2239.32
        },
        {
            "text": "which is the greatest movie of all time never seen a lot of great movies he also wrote Homefront, the video game, although then it was revealed that that was a complete lie okay what does that mean apparently like he was the ghost writer and might have had some sort of narrative control but like it was written by some obscure dude at the studio that never got credit for it apparently oh does that suck for him or I'm sure it does Well yeah if you get overshadowed by John Milius that game sold millions of copies tell me this like Conan the Barbarian he's a lot of awesome movies yeah it's cool also I think he did Jiu-Jitsu which is cool just in general or yeah I used to have a picture of John Milius on my desk at IGN it was him smoking a cigar with a shotgun in his hand dude there's did you ever watch the Milius documentary no I haven't actually it's pretty good Scott Mosier made it Scott Mosier, Kevin Smith's producing partner I think it's still on Netflix you can check it out",
            "start": 2275.52
        },
        {
            "text": "Did you ever watch the Mallrats documentary? No, I haven't actually. It's pretty good. Scott Mosier made it. Scott Mosier is Kevin Smith's producing partner. I think it's still on Netflix. You can check it out. He's crazy. He was crazy. Yes, yes, he sure was. Two more stories come from the mind of Nick over at The Guardian. Let's see who wrote this story. No one knows. Uh, it says Harrison Ford in near crash was that airliner meant to be underneath me is the quote. It says the actor Harrison Ford has emerged unscathed following another midair mishap. Stop it. Ford, 74, was told to land a single-engine plane on a runway at John Wayne Airport in Orange County, California, on Monday. We've been there, but he mistakenly thought that's where the really good McDonald's is. But he mistakenly landed it on a parallel taxiway passing over an American Airlines jet holding nearby. NBC reported. Uh, quote was that airliner meant to be underneath me and quote Ford is heard asking air traffic controllers in a recording, \"American Airlines.\"",
            "start": 2314.04
        },
        {
            "text": "Harrison Ford Near Crashes & TSA Loves Cocaine! - Kinda Funny Morning Show 02.15.2017\nover an American Airlines jet holding nearby NBC reported uh quote was that airliner meant to be underneath me and quote Ford is hard asking air traffic controllers in a recording American Airlines flight 1456 with 110 passengers in sixth grade departed safely for Dallas a few minutes later Ford's publicist Ena Strauss declined to comment uh Harrison Ford shouldn't be flying airplanes anymore uh because here are the other things that have happened in March 2015 Ford was seriously injured when his second World War era trainer crashed on a Los Angeles Golf Course when it lost power shortly after takeoff the actor was praised for his ingenuity in avoiding more populated areas in 1999 Ford crash landed his helicopter during a training flight in which he and an instructor were practicing auto-rotation in Ventura County Northwest of Los Angeles neither of them was hurt and in another incident Ford was flying a Beechcraft Bonanza in 2001 wind shear forced him to take an emergency landing at",
            "start": 2356.04
        },
        {
            "text": "Auto in Ventura County, northwest of Los Angeles, neither of them was hurt. And in another incident, Ford was flying a Beechcraft Bonanza in 2001 when wind shear forced him to take an emergency landing at Lincoln's Municipal Airport in Nebraska. Ford and his passenger were uninjured when the plane clipped the runway. Stop this is God telling you okay JFK Jr. only had one shot at it boom okay you've had five, five JFK Jr. jokes, it's been a long time, it's been like 18 years. I remember when that happened, I think it was was like heartbreaking, I was like who was this guy? I had no idea he was actually culturally relevant, I George good for him, remember that magazine, yeah high high magaz. Let's be honest, he he was just good looking, he was just a pretty face, you know what I mean, you know what I mean, I would abandon, yeah I know what you mean. Final story comes from the Associated Press: says TSA workers charging cocaine smuggling ring in Puerto Rico; authorities say that security screeners and airport",
            "start": 2395.96
        },
        {
            "text": "would abandon yeah I know what you mean final story comes from the Associated Press says TSA workers charging cocaine smuggling ring in Puerto Rico authorities say that security screeners and Airport workers helped smuggle 20 tons of cocaine through Puerto Rico during an 18-year operation that ended only last year 18 years Federal officials said Monday that Smugglers repeatedly got suitcases full of cocaine through the Transportation Security Administration system at Luis Muñoz Marín International Airport in San Juan 12 defendants including six current and former TSA screeners were indicted by a grand jury in Puerto Rico authorities said an airport bag Handler Javier Ortiz picked up suitcases containing cocaine from Smugglers at the check-in counter and put them through x-ray machine staff by Cooperative TSA workers after making sure there were no drug sniffing dog police dogs around Ortiz loaded the bags on planes and then called a colleague to signal that it was safe for the",
            "start": 2441.6
        },
        {
            "text": "staff by Cooperative TSA workers after making sure there were no drug sniffing dog police dogs around Ortiz loaded the bags on planes and then called a colleague to signal that it was safe for the Smugglers to board the plane according to Rosa Amalia Rodriguez VZ, the US attorney for Puerto Rico. Whose name is way too long; that's an interesting story to end it all. Kevin, yep, that's all for the news. Nick, do you want to give something away? Uh, we have some more tips first and then we can give some more stuff away. Let's call them \"tips,\" by the way. No more tips; we love you all, thank you very much. Uh, and yes, I don't think we actually... Kevin, can you? I'm handling that. Thank you; I'll read tips. Kevin will handle that, and we will go from there. Uh, some people are saying in the comments something very interesting, which I thought I should bring up: they're saying you can't tell Han not to fly; Han is dead. Okay, spoilers; yeah, I know, but we still need Indie, so Han needs to stop getting his old ass in a ****",
            "start": 2478.72
        },
        {
            "text": "which I thought I should bring up they're saying you can't tell Han not to fly Han is dead okay oh spoilers yeah I know but we still need Indie so Han needs to stop getting his old ass in a Cessna they call that plane the Widowmaker by the way for a reason my dad flew those yeah one of those yeah a lot of people a lot of people get into accidents in those a lot of people get into accidents in this really he always told me they were super safe he's like when the engine cuts out you can still say no that's what like every Star Wars pilot that tries to fly an aircraft in like storms and stuff that's cuz they're super I'm not looking it up no no I'm saying aren't they like don't they always die when they're like flying in a storm it's always different reasons JK flew because he was flying in a storm he didn't have any experience in stupid yeah do that but yeah but I think Ty Root's dad got in a bad plane crash I don't know he",
            "start": 2518.0
        },
        {
            "text": "always different reasons JK Rowling flew because he was flying in a storm he didn't have any experience in stupid yeah do that but yeah but I think Tony Robbins' dad got in a bad plane crash I don't know he always told me when the engine cuts out in the Cessna you can just it's the same in every plane float down that's every plane you can do that in jet liner have you seen the movie Flight yeah oh no I didn't that's what happened in Flight I thought they needed the big ass that's what Sully Sullenberger did he just yeah this a glider just Glides in he so so landed that plane right in the so so landed that plane right in the middle of the Hudson got out had a cup of coffee true story it's in the movie he was heem plan with a cup of coffee in his hand that he made on the cart after the plane had landed guys I can't let this coffee go to waste we just brewed this pot everyone out all right I'm taking a second for myself take a second for yourself Tom",
            "start": 2559.16
        },
        {
            "text": "he made on the cart after the plane had landed guys I cant let this coffee go to waste we just brewed this pot everyone out all right Im taking a second for myself take a second for yourself Tom Hanks uh Mario not bro says hello gentlemen Nick Id like to thank you for reminding me to buy Hitman as Im balls deep in it as we speak while I wait for Horizon loving the game signing off hail Colin bongos butthole uh hail Colin uh thank you yeah its fun Im playing it too as well uh havent havent progressed more through it but its super fun are you going to play that hit man Hitman I played the first uh two maps oh good I like it I like it uh quite a bit but its but its uh not going to hold me no no Zanar Sarah says hey Colin have you seen the new Amazon show thats done by studio Ghibli uh its called Ronja The Robber's Daughter it is it is using the video game engine uh Neoi Neuns on so I guess he gives a clip for that we can look at that youre seeing it right now thats",
            "start": 2599.4
        },
        {
            "text": "\"Jibber it's called Ronja, The Robbers' Daughter. It is, it is using the video game engine, uh, Neo Geo's on so I guess he gives a clip for that we can look at that you're seeing it right now, that's fascinating. I'm not showing well, I guess I can show the people yeah I mean it's a studio JBL looks like a studio movie that's cool though yeah I'm not really I don't really watch cartoons anymore yeah it definitely it looks like it on the surface and then you look at a bit they're using this technique a lot I think Attack on Titan uses this technique as well if I'm not mistaken freaking me out well like it's a little yeah it's not hand-drawn, it actually is computer-generated but it looks 2D it's pretty cool but I feel like if you look closely it really doesn't... well they're all dead behind the eyes. Vality Cretive says 'you yo' it is I, high ruler of Portillo Lola. I felt the need to show Colin my support again and he uh he has little Twitter is this right here I think it's this this\"",
            "start": 2638.88
        },
        {
            "text": "Eyes uh validity creative says \"you yo\" it is I'm a huge fan of Portillo's, Lola. I felt the need to show Colin my support again and he uh he has little Twitter here, is this right? This is pretty cool, that's pretty awesome actually. I'm not gonna lie, um make it so there you go or I will ban 100 people at random permanently. Sor I'm sorry, did that wall just get 10 feet higher? And the wall got 10 feet higher. The wall just got 10 ft higher. Everybody, I don't care how much it costs, Mexico is going to pay for it. Jag sibian says \"Hey guys, my dad is on my ass about when Kinda Funny Life 3 is.\" He's planning our family vacation and needs the dates. Can you guys give a time frame or announcement date if not, I understand? See you at Kinda Funny Life 3. Hold on one second, I'm making the image right now. Do you want to say tomorrow if you guys can wait five minutes, I can get it done okay? Five minutes we're five minutes in, five minutes we're going to announce the date, you'll know the date.",
            "start": 2680.8
        },
        {
            "text": "Right now, do you want to say tomorrow? If you guys can wait five minutes, I can get it done. Okay, five minutes. We're five minutes in. Five minutes we're going to announce the date. You'll know the date for Forza Live. What's he looking at? He's putting a countdown clock up. Okay, that's very smart, Kevin. It's not gonna be Fifa. You're putting too much pressure on Tim. No, putting more pressure on everyone. Oh Christ, let's live a little. Suicide King says, \"Think you thanks for playing the clip of my boys yesterday.\" I showed it to them on the YouTube archive yesterday and they think they are internet celebrities now. Hope... uh... hope best friends could hope BFS could internet edit it up if I like it. I just... are you not reading it? Are you reading at a remedial level or is it just not written from just... I'm... I... it's both to be perfectly honest, it's both. I didn't sleep by last night. I don't read well. Hoping BFS could internet edit it up. Edit it up if I like it in the chat. No, he's just not writing it right but thank",
            "start": 2727.6
        },
        {
            "text": "both to be perfectly honest it's both I didn't sleep by last night I don't read well hoping BFS could internet edit it up edit it up if I like it in the chat no he's just not wrri it right but thank you you're welcome I didn't see what they're talking to now they did Colin we don't understand what you're referring to but have fun uh Starhawk said greetings Colin just bought a tablet and I'm looking to read more books about the founding fathers in that in that time period I've read John Adams's bio any recommendations love you too Nick is OD OD yeah John mum's book on Alexander Hamilton is really really great it was published in like 2003 I think so it's not very new but it's awesome you should check that one cool uh Nick the max gave us tip and say thanks Colin for showing me how to see politics and for Colin was right Nick we got the same name so please text me give me the one Kevin all right uh Hollow Jones says hey Colin Nick and Kevin please watch this fun clip it is fun I promise",
            "start": 2776.4
        },
        {
            "text": "and for Colin was right Nick we got the same name so please text me give me the one Kevin all right uh Hall of Fame Jones says hey Colin Nick and Kevin please watch this fun clip it is fun I promise you better be because you're going to be banned there you go if you guys think I'm kidding by the way I'm not I'll go in and do it myself for a day for a day no I mean it could be like a day in that Black Mirror episode where a day is like literally a hundred years yeah makes like it's so annoying because that's a program at the end of the thing it just gets deleted yeah but it but the person doesn't know that in a simulation so they feel as if they're real it's just it's like a great like a number of like a series of digits are suffering but it's ethical it's an Ethics question it's a very interesting ethics what are you doing oh my God what is he doing nothing who knows something completely and totally distracting from the show he supposed to be producing right now you guys the show's ****",
            "start": 2813.32
        },
        {
            "text": "ethics what are you doing oh my God what is he doing nothing who knows something completely and totally distracting from the show he's supposed to be producing right now you guys the show's over give away the prize I got more tips to read questions we're fine all right Nick stop being a little baby about it I'm I'm just saying what everyone's thinking nobody's thinking it Kevin because they can't see how absurd you are right now they will be able to soon and Greg's going to be proud of me and that's really all I care no I I said did I say now or soon see you have 2 minutes and 47 seconds all right man I'm working on it uh RAM has given us a tip it said PewDiePie used the service to pay multiple people to do wacky stuff to see how far he can go and do the stuff he paid them for (one in parenthesis only offensive one of the vid went through with it I'm not sure if that if that description sells me on the fact that it was social commentary I have to read more about this I",
            "start": 2856.56
        },
        {
            "text": "I'm not sure if that if that description sells me on the fact that it was social commentary I have to read more about this I don't I don't f**ing concept you need to know what's in the heart of the man where do you want me to put this so I don't know uh Zelda Zeppelin says Hey guys Colin I've noticed that you have been watching more movies recently as a movie guy I love seeing you talk about them what will be the next movie you guys go see in the theaters probably Logan we'll go see Logan for sure are you going to come with us for that no I don't want to see that the the uh I mean the next movie I for sure I mean I will for sure see Dunkirk in the theater the summer yes uh I will for sure see obviously episode 8 in the theater I think those are the only two guarantees um but I keep renting movies on Amazon I find it quite I find it quite uh quite enjoyable to watch some of these films I watched a movie yeah I",
            "start": 2899.6
        },
        {
            "text": "the theater I think those are the only two guarantees um but I keep renting movies on Amazon I find it quite I find it quite uh quite enjoyable to watch some of these films I watched a movie yeah I sent you that clip R sent you that so good so good why is it that **Danny Glover** uh I did watch a random movie earlier in the year on Netflix it's a Netflix exclusive with Selena Gomez I think's in it and uh it's about a it's about a kid who's like in some way disabled oh yeah um that's a good it was interesting I I liked it I mean I think it was great Selena Gomez yeah SZ it's about a kid who's like disabled and he won't leave his house and he has like a caretaker that who's the who's the dad the caretaker he's a pretty famous dude I don't I don't know names very well with actors the but he's a caretaker and he takes care the fundamentals of caring yeah the fundamentals of caring that's exactly what it's called fun and and so he eventually convinces like the kid's obsessed with",
            "start": 2941.44
        },
        {
            "text": "he's a caretaker and he takes care of the fundamentals of caring, yeah, the fundamentals of caring, that's exactly what it's called. Fun and and so he eventually convinces like the kids obsessed with like all this weird stuff around the United States. Oh, it's a Paul Rudd movie, Paul Rudd, yeah I got that on Netflix, that's on my queue. Is it good? Yeah, it was, it was cute. I mean I don't regret watching, I wasn't like enamored with it, I'm I'm hot and cold about Selena Gomez sometimes you know what I mean, and it's based solely on the fact that sometimes she looks like she's a 12-year-old, yeah it's a problem. It's a problem is that when you're hot or cold you can't make those kind of jokes well played well played uh a couple more tips and then we're we've called tips stop giving us steps everyone love someone by the way told me to watch The Arrival saw it in the theater opening day I always see my alien movies they wanted you to watch The Arrival with Charlie Sheen which is the movie he did when his",
            "start": 2988.24
        },
        {
            "text": "by the way, I was told to watch The Arrival; I saw it in the theater on opening day. I always see my Alien movies. They wanted you to watch The Arrival with Charlie Sheen, which is the movie he did when his career basically went downhill. Wait, wasn't the movie called The Arrival? The one you saw was his arrival – I'm just making a joke about that. Oh okay, oh okay; I thought it was because I made a similar mistake once when I was like, \"I saw the Brie Larson movie Room.\" Yeah, I know, yeah; that's bad. But I said on Twitter, \"I saw The Room,\" which is apparently another movie – it's the world's worst; it's wildly held as the worst movie ever made. They do screenings of it because it's a cult classic. Room with Brie Larson is... I still haven't seen that, actually. It's on Amazon Prime; it's a great film. Keep watching... like The Dirty Grandpa instead of The Room, and guess what? It pays off every time. Dirty Grandpa rules, dude – dirty Grandpa rules. You guys uh want to give away the thing.",
            "start": 3027.4
        },
        {
            "text": "great film keep watching like Dirty Grandpa instead of A Room and guess what it pays off every time Dirty Grandpa rules dude rules you guys uh want to give away the thing him up Al I haven't seen it yet dude you get that part guys watch that movie it's funny I'm telling you I'm going to watch went all last night to watch that movie it's like two hours long auy I watched The Finding Dory is she like the one she's the one that like wants to put the balls in her vagina yeah what Carmelo Anthony says Uber and Fiber C dog hi hi Colin I'm curious in the news of the Castlevania series being an R-rated TV series on Netflix I'm excited and it sounds awesome Hil Colin H yeah I find people have been asking me about this I feel like I don't like the way they describe it though where it's like satirical and I'm like why why does it have to be like make it a Castlevania story that we all want and need in our lives gotcha # fun Clips says uh",
            "start": 3063.76
        },
        {
            "text": "Way they describe it though where it's like satirical and **** I'm like why, why does it have to be like make it a Castlevania story that we all want and need in our lives gotcha # fun Clips says uh greetings, a suggestion for the hail Callin salute how about using the you're dismissed gesture and on the topic of condoms, the name uh the name of a brand in Denmark you gave us an image for that which call let me pull this up and see what it is. Pus Pus is the name of the condoms they use in Denmark explains a lot about you people I'll be going to Denmark this year did you know that you spent a you spent a month in Denmark one day no no no I'm going I love that say it's like the most insulting thing to say that's really **** up and I hope it's not true because I'm spending eight days there why are you going there uh my wife wanted to go to Copenhagen she wants to just bum around Denmark maybe take a train some very cultural very impressive my wife is I was like we could go anywhere",
            "start": 3104.12
        },
        {
            "text": "why are you going there uh my wife wanted to go to Copenhagen she wants to just bum around Denmark maybe take a train some very cultural very impressive my wife is I was like we could go anywhere she's like Copenhagen I was like great so we'll be going to Copenhagen so look out uh so the day I'm there you can look for a a tweet for me for a meet and greet that probably maybe and it won't happen Panzer says Panzer 2 says Colin Nick always a good day when you two are hosting Colin have you checked out a game called Hollow Knight yet beautifully stylistic platformer looks very promising no no I have really cool you're going to like it yeah it does look really cool actually okay you're going to think it's awesome it's a Metroidvania or it's like a straightforward platformer call no more tips Nick we called that 20 minutes ago oh did we yes twice Captain Sparklez says any tips on grooming the nether region as I've gotten older the area has become the uh whatever happened with the date by the",
            "start": 3153.16
        },
        {
            "text": "called that 20 minutes ago oh did we yes twice Captain **** says any tips on grooming the nether region as I've gotten older the area has become the uh **** whatever happened with the date by the way oh are we ready for that well I'll finish t no yeah we have it done that's EXC me I thought it the Andre uh which only Kevin's ancestors could penetrate too afraid to shave the stones closely well get in there with the razor that what I would say trim the top of the green down a little to a little a little bit not stubble but just a little bit and then everything below that needs to be slick turn take a razor to it and and and godp speed anything to add to that no y sh said clip roulette May My Sacrifice Echo Through the Ages and he's giving us a clip you're you see you're playing into Collins and Rosies on this this and it's working you can't let that happen you know everyone knows that it's going to be more fun this way guys the rules section is oh this is hilarious what is this",
            "start": 3190.56
        },
        {
            "text": "Collins and Rosie's on this, this, and it's working. You can't let that happen, you know. Everyone knows that it's going to be more fun this way, guys. The rules section is oh, this is hilarious. What is this? This is going to be oh, I'm screening it. You're screening it good, yeah. So don't look. Kevin is screening trust Kevin at all he's the first line of defense. Mario Abros says putting it all in line, Jents here are two clips no you can't do that you can't get banned twice he already **** figured out he figured out to LOL your system oh my God now I had a Colin. Colin does this mean if he if the first one's funny is he good? Does can the second two it could be like the weakest link but here's the thing if the first one sucks then we B we bounce him immediately then we bounce him immediately and I I mean this is where I and because if you want to S more than one clip than than the stakes you know when let's look at it this way let's let's use a North Korean reference when someone defects from",
            "start": 3234.8
        },
        {
            "text": "I mean this is where I am because if you want to see more than one clip then the stakes are you know when let's look at it this way let's use a North Korean reference when someone defects from North Korea all of their all of their family members and everyone they know are arrested some are executed others are put in camps so if you send more than one clip and and one of them is bad then your entire family uh gets banned from Twitch for life oh God I want to watch this clip so bad let me get these my god do you see this some of these clips look good they better be good yeah but I know also uh on the note of banning people's families for the internet that might be a little Draconian also you know North Korea isn't doing too well these guys are hard at work son there it is uh W says Mike Jer retweeted this video so you know it's funny they gave us that well you're taking your life in your hands about that apparently and your family's life the green wombat says",
            "start": 3280.0
        },
        {
            "text": "it is uh W says Mike Yer retweeted this video so you know it's funny they gave us that well you're taking your life in your hands about that apparently and your family's life uh The Green Wombat says \"Gambling My Band\" with Fun Clips, it's the old one but hey you kind of need to get one minute into the oh see you're already it's already bad it's already bad if you want us to get one minute into the clip to get the full package you got to time stamp that in the YouTube clip and you're asking for us to you're asking for the patience to be gone letting you guys know go ahead and mix that one okay well I mean he makes friends with them try to win them over J fit7 say Colin just watching an amazing doc on PBS about Daryl Davis a black musician who sits down with the KKK leaders has a conversation and finds good Common Ground accidental courtesy Nick you dig it too that's the one I just cut okay well we cut that no there's no CLI not gonna give the KKK any air time here on on Colin",
            "start": 3321.68
        },
        {
            "text": "and finds good common ground accidental courtesy Nick, you dig it too, that's the one I just cut okay well we cut that no there's no CLI not gonna give the KKK any air time here on on Colin Greg live I think there's no clip on this though he was just saying that no it was a clip was no not on JFit7 all right moving on doesn't matter uh Braer Landers says Colin why don't you just name your show Colin is right because well you are because a good question that's a good great question speaking about headlines last St for the day comes from JFit7 here's here's the link to the trailer if you you're right Kevin sorry I apologize uh in watching it later he befriends many leaders and they end up stepping down and giving him their client Rose fascinating we're not going to watch that Kevin what are we giving away today and who won I mean it's in the dock oh today we're giving away for For Honor on PS4 uh remember if you want to be entered into the giveaway you can do it in many ways one",
            "start": 3362.48
        },
        {
            "text": "we're giving away today and who won I mean it's in the dock oh today we're giving away for For Honor on PS4 uh remember if you want to be entered into the giveaway you can do it in many ways one you can be in the chat you can be a subscriber to us on Twitch you can uh support us at the $2 or above level at either of our patreons uh and we'll pick randomly from all those platforms like we did today we picked from the randomizer hold on got to do it uh pick from Twitch Carmelo Camaro you have won you have won this code today keep a lookout in your outgoing messages you actually should have gotten it like 10 minutes ago so what oh great okay cool well you know spoil the surprise time dilation spoil the surprise no more tips no more tips now no more tips uh we'll get in the chat for a little while but not very long at all Now Kevin yep is it time we announcing the date sure are we having Tim come out Tim do you want to come out and do this or what sure uh let us know so we're",
            "start": 3406.12
        },
        {
            "text": "while but not very long at all Now Kevin yep is it time we announcing the date sure are we having Tim Gettys come out Tim do you want to come out and do this or what sure uh let us know so we're very tell me when you want it go for it I'm very excited to announce this the dates to your face go your chest go for it it's happening Pen Life 3 is happening June 3rd 2017 get hyped tickets go on sale March 1st many more details will be revealed then right get hyped get hyped plan your travel accordingly San Francisco California same place it was last year cuz that place was dope it was dope that place should we mention Sunday as well though there there will be a a second day yeah only for VIP people right so the show is the show is one day Saturday but if you're a VIP ticket holder there will be another in the afternoon there will be a VIP meet and greet on Sunday so if you're planning your travel and you're going to you think you're going to get the VIP tickets definitely",
            "start": 3457.6
        },
        {
            "text": "there will be another in the afternoon there will be a VIP meet and greet on Sunday so if you're planning your travel and you're going to you think you're going to get the VIP tickets definitely plan travel out either late Sunday or early in the morning on Monday just letting you guys know but the show itself June 3rd, 2017 Regency Ballroom ticket sales Monday March 1st Wednesday, Wednesday March 1st what I always think every 1 is a Monday and it doesn't ever hey Nick want to see some cool **** that I just did yeah look at that oh my God that's **** terrifying you see it that's why you got the green screen out you're **** sence **** I can't oh no yes they said do it I said do it'll be done that will be done it has it is in heaven apparently you have to keep it on the other side though because cuz of the cor yeah cuz of the corner I know but I'm facing the wrong way I I'll move the camera I'll move the camera eventually there you go this distresses me like more than almost",
            "start": 3511.2
        },
        {
            "text": "though because cuz of the core yeah cuz of the corner I know but I'm facing the wrong way I I'll move the camera I'll move the camera eventually there you go this distresses me like more than almost anything that's ever happened I love all the toys I get to play with all right everyone uh we'll be making that announcement of course we'll be uh we'll be tweeting that out all that stuff stop oh my God it's terrifying dude holy God all right so March uh March 1st tickets for Kinda Funny Live three will go on sale it is a two-day show only for VIPs otherwise everyone will get to go to the show on June third right so standby for Titanfall let's take some comments let's do three and three three and three the old three and three three and three Char right Kevin you know the whole uh no actually I brought lunch I made some noodles with a little bit of cream sauce and some ribs cut into it what you know what I'm going to do I'm going to go to Umami Burger when I get to the oh oh I see in the",
            "start": 3564.64
        },
        {
            "text": "I brought lunch, I made some noodles with a little bit of cream sauce and some ribs cut into it. What you know what I'm going to do? I'm going to go to Umami Burger when I get to the oh oh I see in the marina. I thought you were there somehow. No, the only other Umami Burger that I know of is uh I mean I'm sure there's more than this but the one it's s that's actually not a Som it's it's it's by AT&T Park yeah like First and King something like that. I don't know who really gives a **** no one Kevin let's get in here. One us Spidey Ville asks Colin do you prefer ebooks over physical copies? It's funny you say that because on yesterday's Game Over Greggy show, which we recorded, which will go live uh tomorrow for the patreons everyone else next week, we talk a little bit about collecting things and I talk about how I used to collect books and now I don't anymore because I read digitally and I kind of regret it and it's kind of stying me from reading as much as I used to. Uh let's see Classic Tan",
            "start": 3620.16
        },
        {
            "text": "I talk about how I used to collect books and now I don't anymore because I read digitally and I kind of regret it and it's kind of stopping me from reading as much as I used to. Let's see, Classic Tan says, \"Do you guys ever go to Giants games?\" I've been to one; you guys have been to more than that. Have I ever told you... uh... the like my thing in baseball games was, were you scared of the baseball or something? No, no, no. So until I met Hunter, I had gone five times and I had caught three balls, really. Yeah. Where were you sitting? You were sitting like... uh... third baseline. Yeah, yeah, that's usually where we sit. And since I've met Hunter, I've probably gone another five times, caught two balls. That's incredible. Yeah, 'cause I've been to dozens and dozens of Yankees games, and I've never caught a ball. This is incredible, guys. Look at this thing. Huh, huh? What Kevin, there's such a thing as too close, and that's... the thing is this, that's the thing you see when you die, and know that you... you spent your",
            "start": 3669.04
        },
        {
            "text": "is incredible guys look at this thing huh huh what Kevin there's a such a thing as too close and that's **the** thing is this that's the thing you see when you die and know that you you spent your life you misspent your life you know what I mean um default Xander says Colin or Nick how did the Millennium Falcon make the 18 parsec Castle Run and 12 parsecs some some some lights be maneuvered yeah yeah yeah accelerate light speed I'm assuming that was always my assumption I don't know yeah get joke that Parsec is a measurement of distance not time no yeah yeah but I mean that's it's a galaxy far far away they drink blue milk they call sh different no but I always thought it is a measurement of spa of of of uh of distance and my assumption was that it was like a wormhole that allowed them to circumvent the full length of the distance that makes sense to me that makes sense to me as well uh let's get into some Nick you want to get us in the sub only mode yeah I'll do it real quick that",
            "start": 3716.72
        },
        {
            "text": "to circumvent the full length of the distance that makes sense to me that makes sense to me as well uh let's get into some Nick you want to get us in the sub only mode yeah I'll do it real quick that works hold on did it work says the following hey Colin I want to ask you for your feelings about non-Marxist Leninist socialism such as Marxism uh anarcho-communism which I don't know much about proud horns Narodnik syndicalism democratic socialism Etc I can imagine your feelings regarding the USSR or China I'm interested in your thoughts on ccs like Paris communism Anarchist so what you're basically asking is like is uh like lesser Socialism or lesser communism I guess or some sort of hybrid um anything has to do with anything Marx said is devoid of reason and intellectualism completely uh Marxism and communism and its and its kind of uh style of uh to each according to his needs from each according to his ability is complete nonsense and destroys markets um that's why there is",
            "start": 3768.16
        },
        {
            "text": "uh Marxism and communism, and it's kind of uh style of to each according to his needs from each according to his ability is complete nonsense and destroys markets, um that's why there is no successful version of it anywhere in the world, um and never will be, so that's my feeling on it. More like moderate Democratic socialism, like you had from Bernie Sanders, I think is probably workable, I just don't I don't believe in a lot of that kind of stuff uh from a principal perspective, so I hope that answers your question uh cesium 6 says I have a question what do I do if I'm getting sick of gaming I don't feel nearly drawn to it as much as I used to, that's okay, I often tell the story about how when I was in college uh for a year I didn't play video games almost at all um um like not even interested in it at all um and there were times when I was at IGN where I went months and months without playing games at home um so I think that you know I think that it's uh a child yeah this picture",
            "start": 3822.44
        },
        {
            "text": "in it at all um and there were times when I was at IGN where I went months and months without playing games at home um so I think that you know I think that it's uh a child yeah this picture of that is a child right there what are you talking about so anyway there's nothing wrong with playing games you have nothing to Pro or not playing games you have nothing to prove to anyone if you don't want to play them don't play them that's totally fine yeah do do you a couple people are asking when I'm going to be in Copenhagen I'll be there from the 3rd to the 12th well I'll be in Copenhagen the main city it I think toward the tail end of that so maybe the 8th the 12th I think we're going some what month I think we're going of September oh okay yeah so right before uh I had to get it out of the way because I figure after your wedding I'll be a changed man um are we doing the fun Club still there's a couple yeah we'll get through yeah we'll get through there one more question uh live to roll",
            "start": 3866.04
        },
        {
            "text": "\"Way because I figure after your wedding I'll be a changed man um are we doing the Fun Club still there's a couple yeah we'll get through yeah we'll get through there one more question uh live to roll uh says Colin seems that the shows like E3 slow production and raise cost of games what's the point I don't think they necessarily raise the cost of games but they do slow production it's important to show those games for mass media it's important to have uh buying uh you know I have to remember that E3 there's a lot of meetings going on as well it's not all about seeing things on the show floor this is when people purchase games when Publishers acquire games when Indie developers find Publishers etc and so on so there's a lot of business being done there as well that is essential um to the market all right let's get out of sub mode now let's watch fun Clips they better be fun I have your names on a list and you know what happens to you if these clips aren't good and if you think I'm\"",
            "start": 3904.36
        },
        {
            "text": "all right let's get out of sub mode now let's watch funny Clips they better be fun I have your names on a list and you know what happens to you if these clips aren't good and if you think I'm kidding try me he's not kidding he has no time to do this but it's possible that he will do it in a perfect world you'd already be banned for even thinking of sending me a clip that's good true that's true thought crime that's what I'm going to call it the thought crimes that's that's that's to go along with my or report all right all right give me Kevin I'm ready so this is the first one I did in fact screen this and I enjoyed it I didn't hear anything but hopefully you don't need sound Just Let It Go Indiana Indiana let it go let it go this guy's a terrible father Jesus that was pretty good that was pretty good that was amazing why does he have so many dislikes I mean it's about killing babies my my guess that's fun though that's fun go give that go everyone go right now and go give that a",
            "start": 3936.76
        },
        {
            "text": "was pretty good that was amazing why does he have so many dislikes I mean it's about killing babies my my guess that's fun though that's fun go give that go everyone go right now and go give that a a thumbs up please that was funny all right next clip hold on I'm sharing the link oh yeah thank you all right uh um this one I screened but I couldn't hear okay good thanks for screening it but uh we'll see bye no there always tomorrow okay that was rude rude I'll show you rude your tablet is still synced to your phone please tell me that is not your penis no who sent that clip wait hold on we missed the very beginning who sent the clip goodbye bye no who sent the clip he always smart we're not watching it again who sent the clip all right get to the next clip Kevin who sent it Kevin I I don't know I don't know I'm not protecting anyone I just don't know it's too it's too it's to no one can tell give us the next clip we saw this already thank you that was fun okay Pac-Man pranks get to it",
            "start": 4023.76
        },
        {
            "text": "know I don't know I'm not protecting anyone I just don't know it's too it's too it's to no one can tell give us the next clip we saw this already thank you that was fun okay Pac-Man pranks get to it I feel like the yelling ads just kind of Genius I think laugh like what is this amazing computer lab it's old this is old yeah look at those computers also look at the way it's shot all right next clip all right so he get you're bordering I'm not going to ban you for that this guy's fine we already have one ban today all right ready yep I thought this pretty Stiller at the Chicago but off of their highs uh that was amazing that was good I liked that the this dick on my back this excellent that's pretty great Kevin keep that one we might want that one as an intro for the show I I don't think we have the technology to do that anymore but I'm digress all right next oh no Jesus this is something special this is going to be something special ready yeah",
            "start": 4089.16
        },
        {
            "text": "an intro for the show I don't think we have the technology to do that anymore, but I'm digressing all right next oh no Jesus this is something special, this is going to be something special ready yeah I'm totally ready for this hey miss you need a ride I prefer a ride up on that dick well hop on in all right name's Tammy how you doing all right not where I thought it was gonna go I'll accept it I'll accept that next clip Kevin all right I don't know if I oh this is a ro don't PR don't protect them no I I didn't scan this one okay and it's also Rocket Jump I feel like maybe showing it will yeah we don't want to do that they'll get we'll get claimed so everyone are we done yeah I'm going to investigate who we're banning yeah just one ban today yeah uh for that terrible clip that we just had to watch about a soap opera ending uh start running now by the way Lola's after you and's after you she runs she runs fast not not a long distance runner Lola no but she can run fast oh **** I",
            "start": 4179.4
        },
        {
            "text": "Had to watch about a soap opera ending. Uh, start running now by the way, Lola's after you, and she runs fast - not a long-distance runner, Lola, no, but she can run fast. Oh, I missed this one. I missed this one. All right, well here we go. Give it to me now, nice and easy. Now, what do you think the over/under is on these guys ever seeing an actual vagina? It couldn't possibly be any lower than it is right now. Who sent that clip? Mario Not Bros banned. B-Mario not bros banned. Sorry about it. You have to be very careful; I can't choose favorites, I can't have favorites. We have two bands for life today on twitch.tv/KindaFunnyGames. I'm sorry, the buzz read guy - the guy with the guitar article - he inquired for help, and so I feel we have to give that deference. Kevin, two bands okay, and sorry, the other band... Mario Bros is banned, and who else is banned? Holodrone, Holodrone, Holodrone banned. Banned all right, remember that, and then we'll never click on the",
            "start": 4231.44
        },
        {
            "text": "okay and sorry the other band so Marin Bros is banned and who else is banned Hol drone Hol drone Hol Hollow drone Hol drone banned banned all right remember that and then we'll never click on the videos again okay is there any way to get unbanned no oh Lord this is banned without the possibility of parole all right uh before we go we have new subscribers if read your name you are a new sub or a resub here on twitch.tv/ ofun games and we obviously appreciate you an extraordinary amount unless say too much in which case you're banned Stephen s13 GS Revolution 74 says Nick I'm in Vegas for a week from Australia have now tried Taco Bell and Del Taco what other franchises do I need to visit while I'm here in the US for the real or experience for he has tried Del Taco yeah I mean Del taco is the you got it you nailed it SMD vitorio says glad I can finally subscribe to you guys keep up your awesome work everyone thank you very much muua 131 Max 7695 Clone Trooper 12 there we go Captain Kilt",
            "start": 4313.48
        },
        {
            "text": "you got it you nailed it SMD Vittorio says glad I can finally subscribe to you guys keep up your awesome work everyone thank you very much muua 131 Max 7695 Clone Trooper 12 there we go Captain Kilt Travis Warren says I've mon I've months using I don't know what that means my Twitch Prime been following you guys since podcast beyond Nick can I get some Kenny Loggins wow hanging out with the boys uh col what are your thoughts on the Trump Russia information that is coming out talked about at the beginning of the show by the way I don't like people sneaking in tip style questions into the into the subs into the subs in fact I don't think we should be any of that at all no I mean it's $5 it's the same amount as the the the T that's true yep it's true all right then I'm not going to say it's a bad point it just doesn't really fit in with a totalitarian theme I'm trying to fix I know you're you're really investing a lot in this too which I which I appreciate you're going eat you're going in",
            "start": 4366.0
        },
        {
            "text": "\"Bad point, it just doesn't really fit in with a totalitarian theme. I'm trying to fix. I know you're you're really investing a lot in this too, which I which I appreciate. You're going eat. You're going in. You're very method right now, method acting really. Dril says 'Crispy 54'. Alex New York says '10 months'... This clip is from the convo you had two weeks ago. No clip there. Disturbed says '5674 naop 420'. AJ Rees says '117 ant 9141 NTR 811 says 'Can we get a bongo? Let's play.' Also, Hil Colin says 'The worthy Edge' says 'Wow, two whole **** months.' Wyatt mney or mney says 'Twitch Prime for the win. I'm laid off work so I get to sit at home watch your boys live today.' Greetings from the great white North. Bongos. Sorry to hear you're late off. Hope you land on your feet soon. Arrion my Cabe niiko please. Nerd Hollow says 'Rip Vita. I love PS now while it lasted. Send Lola to\"",
            "start": 4413.8
        },
        {
            "text": "from the Great White North Bongos, sorry to hear you late off hope you land on your feet soon. Arrion my Cabe Niiko, please nerd Hollow says RIP Vita, I love PS now while it lasted. Send Lola to PlayStation to eat some **** Jesus. Madog Nick 96 says Jesus, has it been 26 months? Thanks for the laughs, hail Colin Bon goes flashy Andy says thanks for everything guys, hope you guys enjoy the album I sent you. Thanks for the tweets Kevin Huggy Homer the Gman 1183 nomadas beend is uh says guten open group of fur Colin and Burgermeister Nick hey guys quick question do we want to go to Wild Wings no not really all right cool a saggy nut says finger in your ass during **** or whole fist. No one's listening I mean slap neither slap in De base says hi the future is near Derek ocalypse weasel Raider await says five months let's be friends forever and ever and ever gloomy ghost J fit7 says is that when you're hot or cold was hilarious great joke Colin didn't tell it but I'll take credit for it uh Nate",
            "start": 4460.92
        },
        {
            "text": "Says five months let's be friends forever and ever and ever Gloomy Ghost J Fit7 says, \"Is that when you're hot or cold?\" was hilarious. Great joke, Colin didn't tell it, but I'll take credit for it. Uh, Nate the Great X2 says, \"Thanks, Colin, Nick, for educating and entertaining me. You're very welcome.\" Fjer Jer1 says, \"Thanks for five great months. Col, would you help settle a bet? How do you feel about denim furniture?\" I don't know if that's a trick question, Mr. Manager 0803 says, \"I have nothing to say, but you did say something.\" Denck DNB beat says, \"21-month hype also after being unemployed the last six months your guys have been making me laugh. I just got a job and Cali, and will be moving back in a few weeks, so thanks for being awesome. Congratulations on that!\" Irrelevant jokes be Thorne 27 day to day to wear Prada what Col check out the San Francisco band I The Mighty vocals and instruments are amazing maybe I will dirty disco 69 says two years strong Wiiz Jab gave us a link which I will not be clicking",
            "start": 4514.6
        },
        {
            "text": "Prada what's up check out the San Francisco band I The Mighty, vocals and instruments are amazing. Maybe I'll dirty disco 69 says two years strong Wiiz Jab gave us a link which I will not be clicking on. The almighty Keith Box is best El Morero 1 says \"Queros Bongos\" to Kevin. What does that mean? Who knows? You speak Spanish, so I was hoping you might have... oh, I thought it was just a bunch of random words. Oh okay. D4 uo with a smiley face and that is it. Oh and Demon one creeper Bongos he says thank you for subscribing, thank you for watching us here on Conor Greg live here on twitch.tv/ofun games. Remember you can follow us on Twitter at Kinda Funny Vids I'm at NoTaxation Nick is at Nick_Scarpino Kevin is at KindaFunnyKevin. I will be back at an undetermined point in the future on the show. In the meantime, have a great rest of your day and thank you for your sport cut the feed.",
            "start": 4555.44
        }
    ]
}