{
    "id": 2706,
    "video_id": "omqknPUqVQA",
    "show_name": "Reactions",
    "hosts": [
        "Tim Gettys",
        "Kevin Coello"
    ],
    "title": "Star Wars Battlefront 2 E3 2017 Trailer - Kinda Funny Games Reacts",
    "description": "Tim and Kevin breakdown the Star Wars Battlefront 2 E3 2017 Trailer!\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1497225843,
    "duration": 502,
    "transcript_chunks": [
        {
            "text": "What's up, guys? I'm Tim Gettys. I'm here with Kevin Coelloo. So, yesterday EA had the EA Play Conference at EA at E3 2017. We got to see the gameplay reveal of Star Wars Battlefront 2's multiplayer. Oh, I'm excited. Yeah. So, we just saw the shot, beautiful shot of the through the eras um of the troopers. We got the the Force Awakens era, then we saw the original trilogy, and then went back to the clone troopers. Here we are in The uh on Naboo. Yeah. Yeah, and we saw a lot of this yesterday. Maybe a bit too much. Yeah, that was unfortunate just cuz like that I feel like that game play should have been a 5minute like best of clips, but they I get that they wanted to show that, but again, I think it should have been pre-recorded and just not shown the um the shout casters. Yeah. And for them to be reacting there. Totally should have been more of a Nintendo Treehouse style thing after the press conference. I'm I'm just saying I think it could have been done as a 10-minute long or 15",
            "start": 0.4
        },
        {
            "text": "them to be reacting there. Totally should have been more of a Nintendo Treehouse style thing after the press conference. I'm I'm just saying I think it could have been done as a 10-minute long or 15 minutee long pre-recorded clip that they just lied and were like, \"Oh, look here it is.\" And like we would have all been speculating. We would have complained about that anyway to be honest. No, not in the same way of like we see a couple different plans. There's Hoth Kashik. Um Yavin 4. Yep. That was Tatooine and then obviously the the Duel of Fates area which was I guess in the throne room of Naboo. Yeah. In indeed. Um, we also saw Ray fighting Kylo Ren for a bit in Masanada's castle from uh, episode 7. Yep. So, that's pretty cool. Um, here we get a little bit of single player. We've already seen this stuff in the last. So exciting. Look at it. What is this? Yeah. You know what? You actually It's interesting cuz it's post Jedi. Sure. So, the the single player of this game takes place",
            "start": 46.72
        },
        {
            "text": "seen this stuff in the last. So exciting. Look at it. What is this? Yeah. You know what? You actually It's interesting cuz it's post Jedi. Sure. So, the the single player of this game takes place between Return of the Jedi and I I think it starts with the second Death Star blowing up. And if I had to guess, it's gonna end with Stariller base blowing up in Force Awakens. I just hope they don't pull some [ __ ] and have her turn sides at the end. I hope she's Yeah, but I mean, isn't that Isn't that the best way to keep the story going? Cuz then when like they want to make another Battlefront later, they're going to want to make it so you're invested in the character you're playing as. And man, uh what was that? Force Unleashed having you kill off Stariller and then the next game it's like is he a clone or not? Spoilers, he was a clone. That was kind of disappointing, you know, like nobody liked that. I imagine it's going to be a standalone. I imagine Battlefront 3 when it does come,",
            "start": 89.28
        },
        {
            "text": "is he a clone or not? Spoilers, he was a clone. That was kind of disappointing, you know, like nobody liked that. I imagine it's going to be a standalone. I imagine Battlefront 3 when it does come, it'll be a separate story entirely. So I kind of I hope that she dies at the end. I mean, I just feel like that's a So you think the whole time we're going to be playing as a baddy? Yes. Well, we played as as Yeah. as her. No, I know. But like but like the whole time isn't that takes place over 30 years. Yeah. But don't you want to see the character progression? Like don't you want to like have her turn to the light? I hope that they ride it out where it's one of those perspective things, right? Where it's like she thinks she is good. Yeah. And I hope that she doesn't change that. I think it's the easy way out for her to be like Yeah. But I feel like we've been taught for so long that that they are bad. Yeah. That they're bad. And it's like if you think about it, if at the end of it we're",
            "start": 134.48
        },
        {
            "text": "the easy way out for her to be like Yeah. But I feel like we've been taught for so long that that they are bad. Yeah. That they're bad. And it's like if you think about it, if at the end of it we're like still kind of on her side or at least her side hasn't changed, then what does that mean for all the people that died at the Death Star, you know? Yeah, that's true. But then it's like, oh right, all these people thought they were doing something good. Cuz the truth is so much of like what we saw of Star Wars is not known to everyone of the like Galactic Empire. That's true. You know what I mean? So for a lot of people didn't like the Republic, but they also saw like and we they've never addressed this cuz we've all always seen it from the perspective of uh the Rebels, but like people that were just chilling at home watching these things get blown up must have seen the the rebels as terrorists. Yeah. And like very solid point. I'm sure she's going to feel like she's fighting",
            "start": 178.64
        },
        {
            "text": "that were just chilling at home watching these things get blown up must have seen the the rebels as terrorists. Yeah. And like very solid point. I'm sure she's going to feel like she's fighting terrorists. And if she doesn't get like if she doesn't understand who the emperor is by the end like who who he really was then like then she's like living a lie. Yeah. Exactly. I like that though. I like the idea that she just believes this so much. But we'll see. We need to see. We're jumping a lot ahead here. Sure. Sure. Sure. Oh, look at this. This is so good. Now, back to the multiplayer and this shot too. You were You played a bit of Battlefront 1 when it came out. I played a lot of Battlefront 1. Oh, yeah. I loved Battlefront. I did this the five I think it was the 50irst that you played as. Oh, yeah. And it was a blast. And that was taking down the like the clone army. Not the clone army, but like where the clones were made. That was what it was all about. Or at least that was a big",
            "start": 219.44
        },
        {
            "text": "as. Oh, yeah. And it was a blast. And that was taking down the like the clone army. Not the clone army, but like where the clones were made. That was what it was all about. Or at least that was a big part of it. Um it was a lot of fun. And this is going to be fun, too. So, I'm really excited. The the Battlefront that came out 2 years ago, one thing that stood out to me was how beautiful it was and how casual it was, which was appealing to someone like me that doesn't want to jump into the hardcore multiplayer shooter. However, I like that this one is adding more depth and more the the classes and all that. Bringing back what we know from the OG Battlefronts. Mhm. One of my big problems with Battlefront 2 was that or Battlefront when it came back, Yeah. the reboot, right, was the fact that like I just didn't feel it had that much playability in the sense that I played it for I want to say maybe 2 months like every day like building that XP getting the weapons I wanted but within the",
            "start": 258.0
        },
        {
            "text": "like I just didn't feel it had that much playability in the sense that I played it for I want to say maybe 2 months like every day like building that XP getting the weapons I wanted but within the first week I felt like okay so it's these same maps very very light on content and that's why I think this game is doing a great job of right off the bat being like look at all this stuff it's going to be free we heard since the conference there's going to be microtransactions but they're going to be cosmetic it's going to be more the Overwatch I've never cared about it. I for me it was always like, \"Oh, I want to get this gun or that gun.\" And um at the end really all the guns seemed like the same. Yeah. Yeah. So, we'll see about this. But I love the idea of it going over the the different eras. It's not an argument that the prequels suck. Everybody knows that. But for people that grew up with the prequels, there is a lot there aesthetically or sounds or everything that that really matter,",
            "start": 300.08
        },
        {
            "text": "It's not an argument that the prequels suck. Everybody knows that. But for people that grew up with the prequels, there is a lot there aesthetically or sounds or everything that that really matter, which hearing Duel of the Fates in this trailer, this remix is [ __ ] awesome. And I love that it mixes sounds from the from all three eras, there's like cues that go off and it it's super rad. Oh god, I every time this happens, it's like it's so exciting cuz it is it's like as much as I didn't like the prequels, like they're still part of it, you know, that's still canon. And getting a little hint of like, hey, you can play as these different versions of Stormtroopers. I don't know. I find it super exciting. It is. And also going back to also droids, too. It's It's weird cuz they were always shown us to be so weak, but like I don't know. I like the fact that we're going to be able to play as droids. I don't like that we didn't see any of the what do they call the droid? Droidas. The",
            "start": 343.68
        },
        {
            "text": "shown us to be so weak, but like I don't know. I like the fact that we're going to be able to play as droids. I don't like that we didn't see any of the what do they call the droid? Droidas. The destroyer droids. Yeah, cuz they were badass. But I would have liked to see them yesterday. Like real aerial space battles back. So that that's pretty exciting. I enjoyed it in Battlefront. The space battles. Battle OG Battlefront. No, no, no. This Battlefront. I don't Well, the problem there there now it's like it's both at the same time. Yeah. Yeah. Well, they they had that too in different modes where you could get a pl get any like an X-wing and fly around and shoot the ground or shoot the AT at walkers. Yeah, but I I'm pretty sure like this has space battles as well like that. That's really exciting. That's crazy. Yeah. I can't imagine how that is going to play. And I hope Well, I think they're separate. There's It's not one. No. Yeah. But at least this I I think Battlefront Well, I guess",
            "start": 384.0
        },
        {
            "text": "That's crazy. Yeah. I can't imagine how that is going to play. And I hope Well, I think they're separate. There's It's not one. No. Yeah. But at least this I I think Battlefront Well, I guess it was never in space. It was always just over like cities. Yeah. That was a big deal cuz the original games did have it. Um, but you got you can see a bit here. It just looks so freaking sick. Um, but this game is beautiful and it's it's rare nowadays to look at a game and just be like, I can't believe it looks that good. But god damn, man. Every single thing we've seen this and it's gameplay. We're seeing gameplay. I don't like this. I don't like that. I don't like what's happening there. I don't want to find out. Still no destructible environments. We didn't see them last time either. I'm not a huge fan of destructible environments. I I don't think I don't know how much it adds to it. I think it adds overall to the epicness of it, but even with this, it's there's enough going on, enough",
            "start": 421.76
        },
        {
            "text": "a huge fan of destructible environments. I I don't think I don't know how much it adds to it. I think it adds overall to the epicness of it, but even with this, it's there's enough going on, enough explosions that I'm like, I it it doesn't get in my way of enjoying the game. But very excited for it. This is at the top of my list for uh big AAA games coming uh later this year. So, I'm sure we'll be talking a lot more about it in times to come. [ __ ] got at at E3 right now got to play or not play, watch 15 minutes of the campaign. And all the previews sound really good. I'm very jealous. I'm I'm excited. Yeah. Stay tuned right here on youtube.com/kinderfrontinggames for all of your E3 2017 needs. All of it.",
            "start": 459.92
        }
    ]
}