{
    "id": 2722,
    "video_id": "pAWlpTW5J-M",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Andy Cortez"
    ],
    "title": "Let's Play That PSVR Mouse Game - Kinda Funny Plays Moss E3 2017",
    "description": "We jump into the world of Moss on PlayStation VR!\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1497377766,
    "duration": 716,
    "transcript_chunks": [
        {
            "text": "Hey everyone, this is a kind of funny plays. This is a game called Moss by Polyarch. This is Greg Miller sitting to my right. Thank you. I'm so immersed in the game. I didn't see you there. I didn't know you. I thought I was here in this Moss live. Oh, you thought I was in the world with you. We're in the world. Okay, so this was shown at E3 yesterday. This is one This is one of the uh Sony press conference uh PlayStation VR things. That was one of my predictions from the games cast uh made by a developer named Polyarch uh made up of like a couple X bungee guys. They have some Rockstar talent in there, some Epic talent in there. They have a whole bunch of different things. And uh it was one of the standouts, I think, of the VR segments. People didn't know much about it. They thought it was Mouse Guard at first, but it turned out it's Moss, which is this PlayStation VR game, right, that uh basically starts like this where you're Okay, cool. You're in here. You're doing this thing. Cool.",
            "start": 0.16
        },
        {
            "text": "Mouse Guard at first, but it turned out it's Moss, which is this PlayStation VR game, right, that uh basically starts like this where you're Okay, cool. You're in here. You're doing this thing. Cool. But then you get pulled into the story, Andy. It sounded like you were just complimenting them. You said they have some rockstar talent. No, no, no. Yeah. Bungie Rockstar Epic. That's what I was saying. They have some epic talent. Some rockstar talent. They're They've been working on this game for 2 years. They left the guys who founded it after they left Bungie uh fell in love with VR when they saw Valve working on it. They started working out of a Starbucks were getting their thing off and then they they made two different prototypes for games. Moss being one of them and this is the one they're going with. It's now coming to PlayStation. Imagine how much productivity they had going in there at Starbucks. Oh my god. You know, a lot of caffeine. But I mean immediately like you know the",
            "start": 36.08
        },
        {
            "text": "going with. It's now coming to PlayStation. Imagine how much productivity they had going in there at Starbucks. Oh my god. You know, a lot of caffeine. But I mean immediately like you know the idea is that you're pulled into a story book. You see me looking around here. It's good. Get right down here. Look at look at Quill. There's Quill. She's a little Oh, that's you. You're the controller. I'm a god. I feel like I look like a guy from Journey. You kind of look like someone from a Miyazaki film. Sure. I look Oh, you know what I look like? I look like that. That guy who gets hit with the feels whenever somebody puts up the waves crashing into that guy and it says feels feels feels. Oh, you seen that gift? Is that a gift? Yeah. You seen that gift? You should be on the internet more, man. I I like to think I am. See, cool. Just reacted to a She's a little cutie. What's interesting, right, is that this is the controller moving around and I want I know I've noticed a few times we're like",
            "start": 70.56
        },
        {
            "text": "I like to think I am. See, cool. Just reacted to a She's a little cutie. What's interesting, right, is that this is the controller moving around and I want I know I've noticed a few times we're like in and out a bit. It's our studio lights interfering with the PlayStation headset. So, just a heads up that that's us. But what's interesting is this is my, you know, in-game bubble hand that I can move and manipulate things. But then with the left stick, I am controlling Quill. Oh, I didn't know that. X is making her jump as well. So, it is this like they, you know, they called it like an adventure puzzle game or whatever, but it's clearly mixing up the controls, you know, with a video game mixing in the VR headset. Okay, gotcha. So you you were the free camera essentially, right? This is, you know, playable. Obviously, this is the E3 demo and playing it at E3. Other people are uh what they talked about when they I was talking to them about, you know, cuz they're very excited about this.",
            "start": 109.12
        },
        {
            "text": "know, playable. Obviously, this is the E3 demo and playing it at E3. Other people are uh what they talked about when they I was talking to them about, you know, cuz they're very excited about this. They're excited for their, you know, coming out party, finally getting to talk about this game, getting the detailing, you know what I mean? And they were talking about the fact that, you know, I was bitching about how some, you know, VR's fun, but I, you know, I hate having to set it up, tear it down, especially here in the office where something always goes wrong. I'm coming, Quill. I'm coming, Quill. Take it easy. Yeah. Uh, but they were talking about how the fact of like this is a VR game that's you can play sitting. You don't need to get up and move around. This is meant to be, you know, one of those interactive experiences. Now, how you might say, Andy, you might say, Greg, I guess you'd say, Andy, you might say, \"How do I how do I get in that door?\" Right? I can't. How do you get in",
            "start": 146.16
        },
        {
            "text": "of those interactive experiences. Now, how you might say, Andy, you might say, Greg, I guess you'd say, Andy, you might say, \"How do I how do I get in that door?\" Right? I can't. How do you get in that door? Of course, the PlayStation trailer ruined this part. Oh, right. This over there. Quill knows something is a foot. Yeah, it seems like Well, this from what I understand is like a third of the way through the game. So, we've already established our relationship here as faceless god. Oh, the demo is a third of the way. I thought you meant we are a third of the way into the demo. I was like, wow, we've been playing for 14 seconds. We are [ __ ] crushing this demo. So, this this VR game's got to be pretty good for people who deal with auto motion sickness. Yeah. Well, I think that's, you know, as we figure out all this different stuff with VR, that's what it comes down to, right? Is figuring out, okay, I got him. I got him. I think I was going to shut now. Attack him. Oh, you don't",
            "start": 178.4
        },
        {
            "text": "know, as we figure out all this different stuff with VR, that's what it comes down to, right? Is figuring out, okay, I got him. I got him. I think I was going to shut now. Attack him. Oh, you don't think that's where he goes? I thought you had to like fight these dudes. Well, I don't I mean I grabbed him thinking. Oh, yeah. I see what you're doing. Yeah, you have that sort of uncharted mentality. Cuz you can probably attack it. Why don't with what I Oh, yeah. I can. Okay, cool. All right. You know what, Andy? I'm just I'm learning to play. Hey, man. Learn. I'm here with you on this journey with you. But I ain't got wings. Get down here. Oh, that's cool. Little post. Yeah. Kevin probably doesn't like what he's doing with the mic, but you know what I always say. [ __ ] Kevin. What? Right there. Smash that. Now, damn. You're such a brawler. I already know what you're thinking, Andy. What am I thinking? Does this game have a platinum trophy? And when I asked the Poly Art guys that, you",
            "start": 219.28
        },
        {
            "text": "there. Smash that. Now, damn. You're such a brawler. I already know what you're thinking, Andy. What am I thinking? Does this game have a platinum trophy? And when I asked the Poly Art guys that, you know what they did? What they did? They they laughed and because they didn't they hadn't gotten that question yet. They hadn't dealt with a a [ __ ] true PlayStation. You know what? I heard you on the phone with them. Yeah. Right. And you were like, \"No, no, no. You guys think I'm joking, but put this [ __ ] thing in the game.\" Yeah. And so jury's still out, but I think ladies and gentlemen, you all tweet very nicely at them. They'll do it. So they they sort of like nonchalantly dismissed that. It wasn't that they dismissed it. They was like, you know what? Uh we're not 100% like it's that is such an in the weeds PlayStation dorky question. Sure. That I don't think you know when you talk to a normie as I call them, they're ready for that thing. So Andy, I forget. Well, you look up what",
            "start": 265.08
        },
        {
            "text": "is such an in the weeds PlayStation dorky question. Sure. That I don't think you know when you talk to a normie as I call them, they're ready for that thing. So Andy, I forget. Well, you look up what Polyarch's Twitter is. Okay. And you put it out there so everybody knows that we need it. Cuz isn't that right, little quilt? We need it. It's weird. Your little voice. You little cute little mouse overdo. You little girl. I really wish I could touch it. Poly race. Nope. Polyarchc. Polyarch. Poly race. I spelled it wrong. Uh, they do not seem to have a Twitter. [ __ ] Um, somebody put it up yesterday. I remember seeing people are like talking about Polyarch and referencing Polyarch. Oh, Polyarchc Games. P O L Y A RC games. All right. and tweet at him and say, \"This game needs a platinum from your account.\" No, not No, I'm saying the people watching this let's play. Don't worry about Don't worry about what's happening on my Twitter. Okay. They only have 412 followers. Let's see if we can",
            "start": 300.4
        },
        {
            "text": "your account.\" No, not No, I'm saying the people watching this let's play. Don't worry about Don't worry about what's happening on my Twitter. Okay. They only have 412 followers. Let's see if we can get that to 500. Okay. Some kind of funny set. Shooting high. I [ __ ] up this puzzle. Uh oh. Now get that little bit of a kind of reminds me of like some Zelda motion control type stuff. Hold on. I bet it's going to be this one. What was that theme song you were just saying? That was That was Zelda a little bit. Your classic Zelda song. I know, Kevin. Sorry. You know what I mean? The mouse pad. Kevin. Kevin, that's a PC reference. I want to bring you PC games. Did I touch your hand? No. Oh, did I touch my computer? I don't know what you let you touch anything. You're so immersed in the world, Greg. All right. So, now I need to be in here. right in the I need to then Is there like a staircase in there that you're unaware of? Oh, I like that you can peek in there, Greg. Hold on. Hold on. We",
            "start": 345.12
        },
        {
            "text": "Greg. All right. So, now I need to be in here. right in the I need to then Is there like a staircase in there that you're unaware of? Oh, I like that you can peek in there, Greg. Hold on. Hold on. We got to think this one through. Okay, Kevin, think it through. I might need a GoPro here. Kevin's a GoPro. I don't know if you know better about it, maybe. Yeah, I do know that, actually. Whoa. Oh, maybe drag the beetle through the other side. Through to the other side. Why don't you turn it so the other door? Oh. Oh, yeah. Drag the beetle the other side. But how am I going to get up there? That's what I haven't figured out. Oh, I can go up there. Yep. All right, cool. Learning to fly, but I ain't got way. No. If I bring him, is he going to Is it just Yeah, it's off. Okay. So, you come here, Beetle Man. Right. Oh, sorry. I forgot I move you. What did you do to her? I I moved her. Oh, okay. So, you do this. [Music] Forget that I can do both at the same time. Yeah. It's kind of a weird It's",
            "start": 398.12
        },
        {
            "text": "Man. Right. Oh, sorry. I forgot I move you. What did you do to her? I I moved her. Oh, okay. So, you do this. [Music] Forget that I can do both at the same time. Yeah. It's kind of a weird It's like kind of patting your belly and rubbing your head, right? Or is it the other way around? Wait, this isn't going to help me though, right? I think we're just doing the same thing. There's more right there in the middle. This thing? Yeah. No. No. Oh, I can do this all with the beetle. No. What's up with this staircase stuff to your right? Yeah. No, that's I'm going to have to Hey, quick opposite side of this hole here between those two doors. Can you open that middle thing? This thing? No, the the middle one. The middle one. Turn a little bit more. Yeah. Start using like north,southeast, west. Right in the middle between those two doors. Yeah, that that golden little thing. That this guy right here. I can't do anything with that. I'm stumped. But I'm also really bad at puzzle games. Kevin,",
            "start": 456.08
        },
        {
            "text": "Right in the middle between those two doors. Yeah, that that golden little thing. That this guy right here. I can't do anything with that. I'm stumped. But I'm also really bad at puzzle games. Kevin, one thing you may know about me. Ah, but she can jump. Oh, there you go. Got it, boys. There we go. Learning to fly. Whoa, [Music] Quill. Uh, are you able to run in there as Quill? Like there's Oh, the door opened. What door? Oh, now you're supposed to spin the whole thing and that little center thing opens. You think so? Right. Look at that. There it is. Look at that. Andy got it. Look at that. Well, they couldn't pull it out over here. That's what got I mean, I'm a pro gamer after all. Not enough full space. No, not enough full space. Got it. All right. Cool. To maneuver around. Hey, this game better I'm [ __ ] playing. I won't tell you right now. Yeah. Yeah. So, you're enjoying it so far? Yeah. No, this is cool. It's okay. Are you enjoying watching it? Yeah, it's a fresh take on the,",
            "start": 519.68
        },
        {
            "text": "game better I'm [ __ ] playing. I won't tell you right now. Yeah. Yeah. So, you're enjoying it so far? Yeah. No, this is cool. It's okay. Are you enjoying watching it? Yeah, it's a fresh take on the, you know, your standard kind of controlling through first person mode. Yeah, I enjoy it. Andy, snakes. You don't like them? No, I don't like snakes one bit. Gregory, you've said that a lot during your year. Was that it? Just a taste. Moss, there it is. Yeah, there it is, guys. Did they say they're shooting for this year? Is that right? Uh, let me check for you, Greg. the PlayStation blog open. I sure do. I forget what they said to me. Polyarch. There it is. They're I mean they're referencing 2017 that it's at E3 2017. Okay. Uh yeah, it doesn't say anything about a release date. Okay. Um cool. That's awesome. That was fun. That's Moss. I'm very interested. I want to know more. No, thank you for making it. Polycark. Every tweet Polyarch telling me I want to platinum. Interesting to see",
            "start": 589.04
        },
        {
            "text": "That's awesome. That was fun. That's Moss. I'm very interested. I want to know more. No, thank you for making it. Polycark. Every tweet Polyarch telling me I want to platinum. Interesting to see where Randy Moss eventually makes his debut. You know, I'm I they didn't have him confirmed as a voice actor yet, but I am hopeful that Randy Mars will lend his golden pipes as the kids say. Sort of a turbulent season. Holidays this year is what they're shooting for right now. Interesting. Yeah. High quality AAA level is what they're looking for. Obviously, they can't execute on the same scope. But yeah, I'm I'm interested. I'm in. I want to play more. Awesome. Yeah. Going through the book you're reading, ladies and gentlemen. That's Moss. What did you think of it? Let us know in the comments below. Then of course, click that subscribe button because right here on youtube.com/kindfunny games. We have so much E3 content up and coming for you. We'll be posting stuff all day. You look real cool",
            "start": 642.28
        },
        {
            "text": "Then of course, click that subscribe button because right here on youtube.com/kindfunny games. We have so much E3 content up and coming for you. We'll be posting stuff all day. You look real cool right now. Yeah. Yeah. This is where we live now, guys. We live in a virtual reality. I can't help you. I'm going back into it. I'm going to find the alternate paths. Figure out where I'd put a platinum trophy. Remember, so much E3 content here on Tw. There's other Twitch stuff, too. Don't worry about that. You can get it all here on YouTube. YouTube.com kind of funny games. I mean, my voice was loud enough to shake the game. Oh, yeah. Purple.",
            "start": 677.36
        }
    ]
}