{
    "id": 2748,
    "video_id": "shVDPSXYrMI",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "We Played Wolfenstein 2! - Kinda Funny Games Reacts E3 2017",
    "description": "Greg got to see Wolfenstein 2 at E3 2017!\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1497574803,
    "duration": 272,
    "transcript_chunks": [
        {
            "text": "What's up, guys? Welcome to Kind of Funny E3 2017. I'm Tom joined by Greg Miller himself. That's me. Very excited about this. You just got to see Wolfenstein 2: The New Order. No, the new Colossus. The new We were just talking about how confusing the naming structure is cuz it was the New Order before. So, I thought this would be Old Colossus, but then it's not. But they have Old Blood in there. Remember Wolfenstein? Anyways, yes, I saw Wolfenstein 2. I played Wolfenstein 2. Super impressed. Uh, I remember distinctly going to the Bethesda and doing that gigantic demo of Wolfenstein the New Order when it came out or was getting ready to come out of packs and sitting there playing it and being like, I don't like first-person shooters. Okay. Okay. Oh, this is cool. And then it got really awesome. You know, you're getting out of the chair, killing all the people, doing all that stuff. I then got Wolfenstein, played for it, and I forget why. Got sidetracked, stopped playing it, regretted",
            "start": 0.08
        },
        {
            "text": "You know, you're getting out of the chair, killing all the people, doing all that stuff. I then got Wolfenstein, played for it, and I forget why. Got sidetracked, stopped playing it, regretted it, but never went back cuz Colin always talked about it, Christine always talked about it. People always talk about what a great shooter it was, but I never felt connected to those characters. So, the Bethesda conference when we saw the trailer for the Wolfenstein 2, I was like, \"Oh, it's this like renegade pack, this group of misfits getting together. They all have like really unique characters. I'm into this. This already has me deeper hooked into the story than Wolfenstein, the New Order did. Sat down and played it and it immediately starts awesome.\" It was a little bit of a jump. Obviously, Wolfenstein the New Order ends with this giant explosion. Maybe he's dead, maybe he's not. Turns out he's not. Surprise. I know we're all really on the edge of our seats about BJ Glasquing. Uh, anyways,",
            "start": 38.0
        },
        {
            "text": "the New Order ends with this giant explosion. Maybe he's dead, maybe he's not. Turns out he's not. Surprise. I know we're all really on the edge of our seats about BJ Glasquing. Uh, anyways, you start this one. They jump me to where basically you wake up in the nuclear submarine you're in that's now being attacked by the Nazis cuz they're there to get BJ. Put me in a wheelchair and then I played the entire 20 25minute demo in a wheelchair. You roll around, you pick up a gun and you're just shooting people in your wheelchair rolling around shooting people. You can't go upstairs obviously. So you have to find like there's like all these different things you have to use and mechanisms. Then uh is you know they sell crazy weapons, crazy things. Uh your you know scientist friend has rigged the sub with these microwave emitters. So, one of the things is you have to go off and like set all the traps and then so then people see you like there he is and they run and they hit it and they just",
            "start": 71.44
        },
        {
            "text": "sub with these microwave emitters. So, one of the things is you have to go off and like set all the traps and then so then people see you like there he is and they run and they hit it and they just explode into blood and shoots all over you and you see it all stuff. It's crazy action immediately from the get. Being in the wheelchair is fun. You have wheelchair takedowns so you roll up behind guys and bring them down, stab them or whatever, yank them down from the front. It's like this is what I loved about Wolfenstein when I first played it. And here's the biggest compliment I can give Wolfenstein too is that I love this first taste so much. I am now going to go back and make sure I finish the new order before this. I want to do it. I think I'm excited. the highest might stream or stuff and it's like it's just I remember liking that game but yeah I forget why if it was a difficulty spike whatever it was it was just long especially when you had to to get through that beginning part for",
            "start": 107.6
        },
        {
            "text": "it's like it's just I remember liking that game but yeah I forget why if it was a difficulty spike whatever it was it was just long especially when you had to to get through that beginning part for like it's like it's a lot of the same the opening yeah exactly that was the thing and I think my whole thing with it is like when I come comes to first person shooters it needs to be story for me and I even with the original Wolf felt it was too much army if that makes sense you know what I mean when it is braver bravo tango we're moving as a squad that's when I'm like I don't know if I'm really feeling this that's why this one like this is the same thing with resistance when it was like, \"Hey, I'm a father. I need to get there. I need to stop this.\" I was like, \"I'm in. I could wrap my head around this story.\" BJ, I got, you know, I played that part where he meets Anna and calls her fat cuz she's got his twins in there and stuff. It's like, I like that. I like the characters we met in that",
            "start": 139.28
        },
        {
            "text": "this story.\" BJ, I got, you know, I played that part where he meets Anna and calls her fat cuz she's got his twins in there and stuff. It's like, I like that. I like the characters we met in that trailer. I like the mech suit kind of metal armor he was in. I'm like, it looked awesome. Cool. Awesome. That's super exciting. Like, did it feel like old school shooter games like PlayStation 2 era stuff? It still feels like Well, in a good way though, like in the way of like did the like the linearity of it and just the kind of like where it's set pieces, but you you kind of feel like it's a very designed single player experience. Sure. Yeah, that makes sense. Yeah. No, it was very much I'm making the right moves. I know where I'm going. I is what's happening is how it's supposed to happen. There was the thing at the end, right, where I got it. There was a moment of this is guy going to break through a camera. He didn't. He's a good man. There was a thing where yeah, I you know, I did",
            "start": 174.24
        },
        {
            "text": "There was the thing at the end, right, where I got it. There was a moment of this is guy going to break through a camera. He didn't. He's a good man. There was a thing where yeah, I you know, I did everything and I was like, \"All right, cool. What's the next objective?\" And I just look around. And there's like light and a guy coming at me like that's where I got to go. Go that way and shoot it. But the thing about Wolfenstein the new order and Wolfenstein the new classes is that the shooting and fluidity of everything feels so good if being in a wheelchair right should be very like oh how to you can strafe in the wheelchair. It doesn't make sense but you're doing it right. It's like exactly that's what you want. Yeah. Awesome. Well, very exciting. When does it come out? October 27th. October 27th. I got plenty of time to do the new order but you know I really got to commit to it. Yeah. And then there's a DLC too you got to play. Do I have to play the old wood? Sounds like it's good. I",
            "start": 209.52
        },
        {
            "text": "27th. I got plenty of time to do the new order but you know I really got to commit to it. Yeah. And then there's a DLC too you got to play. Do I have to play the old wood? Sounds like it's good. I know. I think I know it was good. I just don't know if I have to find out. We'll have to find out. Let us know in the comments. I won't play him. It's probably way too tough for me. Yeah, probably. Yeah. Stay tuned to youtube.com/counter games for all of our E3 2017 videos. It's the last day. We're wrapping up. I know. Getting near the end, my friend. We have so much content left to do. So many games left to see and awards to give. Yes.",
            "start": 241.52
        }
    ]
}