{
    "id": 1612,
    "video_id": "aaZRgY1ZsT4",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Should You Play The Division? - Kinda Funny Gamescast Ep. 61 (Pt. 1)",
    "description": "We give our impressions on what we think of The Division so far.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1457960400,
    "duration": 1795,
    "transcript_chunks": [
        {
            "text": "What's up, guys? Welcome to the first ever Episode 61 of the Kinda Funny Gamescast. As always, I'm Tim Gettys, joined by the coolest dudes in video games, Colin Moriarty and Greg Miller. And for the first time ever, that beautiful bastard over there in the cool jacket, I want one of those cool jackets, he's too stylish. We have Al White. Hey, yay, Al White, of course, friend to all of everyone, of everyone people, a Community member for a long time. You came into my life when we were working at IGN. You had this film called Spider-Man Eclipse. Yeah, don't remind me. What do you mean? I f***ing hate that film, man. I f***ing hate it. You're not allowed to say that. Why do you hate it? It's the least favorite thing I've ever done in my entire life, but it opened nice doors and it got you, you met us. Yep. And then you went off and you keep making movies, you're making all this cool stuff, you're going to tell us about it, I'm sure. And then, of course, for some reason, you took your windfall, because now that you're a",
            "start": 0.32
        },
        {
            "text": "you went off and you keep making movies, you're making all this cool stuff, you're going to tell us about it, I'm sure. And then, of course, for some reason, you took your windfall, because now that you're a millionaire and you, you backed us on Patreon to come be on the show. Yeah, a personal friend of ours gave us money. It was all right, cool. Thank you. Yeah, much appreciated and unnecessary. But, um, the Spider-Man thing was, was really cool. You're wrong thinking that Spider-Man was great. Everybody pause this on YouTube and go watch it on YouTube, youtube.com/start. That still exists and the video still start. You're right, yeah, it was on start. I made the thumbnail and I hated it. I hated the thumbnail. I was like, there's too much text on this. And Fran fought me on it and it is what it is. Fran wants something done. Had been my way, that thing would have got a million views and now it's at a lowly, I don't know, do you know how many views it's at? Um, a love like 600 or something. Everybody tweeted Fran, tell him he",
            "start": 53.24
        },
        {
            "text": "done had been my way, that thing would have got a million views and now it's at a lowly, I don't know, do you know how many views it's at? Um, a love like 600 or something. Everybody tweeted Fran, tell him he sucks. Yeah, is that his, is that his Twitter? No, it's not. What's his? FM3? Is everybody Google Fran Miller Bella Twitter and then you find him and you tweet, I, you screwed over Spider-Man Eclipse. Yeah, he'll know exactly what you're talking about. Gonna take it to my grave, my business. Um, so before we get into the whole rigmarole and stuff, what do you do? Um, it's a very good question. Uh, I run, well, I part run a company from LA, London, and Tokyo. Uh, we make movies and we're about to start making video games and we do some music as well on the side. We got first couple of feature films coming out this year and we have like a podcast and we try and do some reviews and stuff and things like that. That's cool. What you're doing it all wrong. What, what, what pimp one of those? You just said you're doing things like",
            "start": 89.48
        },
        {
            "text": "we have like a podcast and we try and do some reviews and stuff and things like that. That's cool. What you're doing it all wrong. What, what, what pimp one of those? You just said you're doing things like, what's a web address somebody can go to to listen your podcast, watch the movies? We are Tessellate, uh, with two S's, two L's. And we're on that on everything, old social medias, URL, YouTube. Temporary Kevin, write it down so we get a thing. Colin, continue looking gorgeous. Thank you. You're, you're extra gorgeous today, Colin. Thank you. Appreciate. What is this shirt you're wearing? It's Dredg. Oh, Dredg, yeah, Dredg. They're a band, of course. Oh, what is this? Tessellate. Yeah, this is my f***ing problem, man. I always, whenever I start a company, I pick some weird obscure words that means something to me. Uh, spell it's T-E-S-S-E-L-L-A-T-E. Thank you for, yeah, we are Tessellate. All right, got it. We are, yeah, yeah, we're kind of, we have a weird sort of socialist thing going on with how we pay each other and things. So it's strange. What does",
            "start": 133.48
        },
        {
            "text": "L-L-A-T-E. Thank you for, yeah, we are Tessellate. All right, got it. We are, yeah, yeah, we're kind of, we have a weird sort of socialist thing going on with how we pay each other and things. So it's strange. What does that mean? Well, basically, so we have like a pretentious thing with the ambassadors, which are people that we trust that we want to work with. Um, and we kind of, you know, we're in a good position at the moment, so we don't have to do too many corporate things. So we kind of have a lot of cool equipment and we'll lend it out to people that we like and we'll just take credit and the stuff. If they make over a certain amount, we'll take a percentage, but then we'll use that to help fund other projects within the ambassador program, kind of thing. Oh, you're doing big f***ing. I appreciate that. Well, we're like, like, we're lucky at the moment, you know, the time when we're not lucky, be f***ing f***ed right now. Going, okay, we're trying to be nice. Well, ladies and gentlemen, this is the Kinda Funny Gamescast. Every",
            "start": 172.92
        },
        {
            "text": "like we're lucky at the moment, you know, the time when we're not lucky, be f***ing f***ed right now. Going, okay, we're trying to be nice. Well, ladies and gentlemen, this is the Kinda Funny Gamescast. Every week we gather together to talk about video games and all the things that we love of that nature. Then you guys can listen to us do those things over on youtube.com/KindaFunnyGames, which broken up topic by topic, Monday through Thursday. The full video and MP3 is released on Fridays, either on youtube.com/KindaFunnyGames or iTunes. If you want the stuff early, go to patreon.com/KindaFunnyGames. Toss us a dollar. This one will be worth a dollar. Damn right it will be. You get all that stuff. When's the last time we did one that wasn't worth a dollar? Um, I don't know. There was a couple though, I'm going to be honest. Yeah, yeah, there was a couple that were just bad. I think we've been on a roll. We've been on a roll lately. Brandon Jones last week was excellent. Big fan of that episode. Sure. Um, I just",
            "start": 210.24
        },
        {
            "text": "to be honest. Yeah, yeah, there was a couple that were just bad. I think we've been on a roll. We've been on a roll lately. Brandon Jones last week was excellent. Big fan of that episode. Sure. Um, I just hate, I don't like bringing the unemployed people on, you know, I like people who have a job and something to promote and they know what they're doing. Yeah, job, film. Let's look at ourselves. We had Dunham. Dunham was great. We're on a good guest streak. So no pressure, no pressure. Don't f*** this up. Don't be the guest that derails at all. I'll just stay quiet the entire time. I think you'll, you'll do great. The first topic of the day is The Division. You know, back in the late, late 2015, oh, hard to remember that. But on, on Gamescast, we started doing a lot of topics that are, why you need to play this game, that game. People got all upset. So now it's, should you play this game or that game? This is the first one of this year because, you know, now that the games are actually starting to come out, The Division finally",
            "start": 252.16
        },
        {
            "text": "game. People got all upset. So now it's, should you play this game or that game? This is the first one of this year because, you know, now that the games are actually starting to come out, The Division finally here. You've been playing it a lot. I, let's go around the table. Have you played any The Division? I played about two and a half hours last night. Beefed up six and a half, seven hours in. Zim, about three hours. Zim, yeah. Can see Tim, how many hours have you played? You're a piece of garbage. Play that game. But I want to know what you guys think. Is it worth it? Is it cool? Should I play it? That's always the question. That's always a hard question. The blanket, should you play a game, is tough because it always, I need to know what you like in a game and this and that and the other. The fact that you're not interested in it, I would say no, don't play it. For me, it is. I am in love. I, I have, I am addicted. I just, it's one of those things where it's like, God, can the day end? Can this stop? Oh my God, I can't believe we had this",
            "start": 288.44
        },
        {
            "text": "I would say no, don't play it. For me, it is. I am in love. I, I have, I am addicted. I just, it's one of those things where it's like, God, can the day end? Can this stop? Oh my God, I can't believe we had this meeting. Can I just get, maybe if we like, there was today when you went, laid on the couch while I was finishing emails. I'm like, I probably got a good 45 minutes here, maybe 30, where I could stop doing my emails and go play. You like, now I'll do my work. You know what I mean? Like, it's under my skin that way. However, it's exactly what I thought it was going to be. This isn't like, if it's, it's third person Destiny in a much cooler environment, I think, in an awesome fleshed out world. The, you know, I'm still picking up holotapes and all these things and cell phones and, you know, pages from the survival guide. And like, it's one of those where last night I ran and played a bunch of missions with Fran and our friend Brennan, right? And, you know, Fran was behind where I was and where Brennan was, so we were",
            "start": 332.92
        },
        {
            "text": "guide. And like, it's one of those where last night I ran and played a bunch of missions with Fran and our friend Brennan, right? And, you know, Fran was behind where I was and where Brennan was, so we were helping him out in his missions, but then we were making him do them on hard so we would get like more of an experience, more of a challenge or whatever. And so, you know, we went in there and it was just like, it was in Destiny when you try to do stuff that hard like that. And I didn't even get crazy about Destiny, you know? But more, I guess, even more like DC Universe Online where we went in there and it was like inch by inch. Like, we're going in there and this guy comes out and he's like, you know, level 10 or whatever and he's wearing armor and stuff. Like, I'm like running back trying to do it. We're screwed. This, that and the other. It was, it was what we wanted. It was like this huge uphill climb, right? For this minimal gain of like, maybe we got 500 more credits, maybe a few more resources than we would",
            "start": 372.68
        },
        {
            "text": "this, that and the other. It was, it was what we wanted. It was like this huge uphill climb, right? For this minimal gain of like, maybe we got 500 more credits, maybe a few more resources than we would have got playing on normal. But it was the of playing with your friends and going through and doing that. And then, you know, the opposite of that is like, you know, I, you know, we end work a bit earlier than our friends who aren't home from work or have dumb kids and families they have to see. And so like, when I jump on there and I'm all alone, it's like, okay, cool. Now I'm just going to go, oh, there's an encounter over there. I'll go engage that encounter. Oh, I need some resources. There's resources over there. I'll just, I'll hunt and gather kind of. I'll gather, I guess, rather than hunt. You know what I mean? Like, I'm out there getting these little things, doing these little bits before I go on these bigger missions with friends and stuff like that. Mhm. It's hitting everything I wanted it to hit. I don't, it's not",
            "start": 407.64
        },
        {
            "text": "I'm out there getting these little things, doing these little bits before I go on these bigger missions with friends and stuff like that. Mhm. It's hitting everything I wanted it to hit. I don't, it's not like I'm not getting the last of a story out of it. I, you know, I've fallen through the world. Brennan fell through the world last night. Like, there's little things like that. I, you know, on launch night, I had the about an hour where I couldn't connect. But that was, you know, typical for a launch game, which sucks to say, but is also better than it could have been. I once I got there and the error code popped up, I'm like, well, guess I'm not playing this tonight. But an hour later, it corrected. I was like, okay, cool. So for me, it's what I wanted, which is awesome, because I feel like Firewatch was that first game I was super psyched about coming out. And then I got it and I played it and it wasn't what I wanted. And I was like, oh, that sucks. Here you are. What about you, Al? I've been thinking about it quite a bit to",
            "start": 440.72
        },
        {
            "text": "was super psyched about coming out and then I got it and I played it and it wasn't what I wanted. And I was like, oh, that sucks. Here you are. What about you, Al? I've been thinking about it quite a bit to be honest, because I always, I think I have quite a lot of problems with The Division, but I think the problems I have more come from me and how I'm kind of changing as I get older and what I want from a video game. I used to always wanted that MMO. I mean, I'm a console player. I'm not a PC Gamer at all. Um, so I just always was waiting for that great MMO to come over to consoles and something I really want to get involved with. Sorry, DC Universe was not the one. Uh, DC Universe was the best MMO. I believe it was universally set. Isn't that right, Kevin? Yeah, see. Um, so I'm, uh, I was, I was initially really excited when this was now like three years ago, four years ago, whatever it was. And it looked gorgeous and, and it was one of the games I, I was really like anticipating coming out. And then when it the",
            "start": 478.08
        },
        {
            "text": "excited when this was now like three years ago, four years ago, whatever it was. And it looked gorgeous and, and it was one of the games I, I was really like anticipating coming out. And then when it the gradually it came out, you started seeing the beta Let's Plays. And I just watched, you know, I watched a lot, I not a lot of hours watching people play stuff while I'm doing stuff. And it's just not in the background, kind of take it in, you know, via osmosis. And I, there was nothing in it that I, no point did I really understand what the point was, you know? And I never really kind understood what was the incentive. Like, what nothing about it excited me at all. And it looked really pretty and the game mechanics seemed fine. Um, but I want to give it a benefit of doubt. And like, yeah, got it yesterday and played a couple of hours of it. And it plays better than I thought it would. Like, I thought it was going to be quite loose. Like, it does, it's much closer to how satisfying the sort of cover combat and Gears of War and",
            "start": 515.8
        },
        {
            "text": "of hours of it and it plays better than I thought it would. Like, I thought it was going to be quite loose. Like, it does, it's much closer to how satisfying the sort of cover combat and Gears of War and things are. But the difference is like, I really, I really cherish narrative and story. And I think the world beautiful in The Division. Um, it's, it's really gorgeous. And the Let's Plays I had didn't really showcase really how beautiful it looks when you actually get yourself, especially is like the sun goes down or whatever, light bounces off buildings. Yeah. And I love the world. Like, it's snow. I love snow. I love apocalyptic kind of things. I like being in big cities that are empty. That's kind of my dream. I just want everyone in the world really to f*** off and be able to wander around in my own place. You get along with. Um, but I'm just playing it and admittedly, I'm not playing it with anybody else. You know, I could see some idiots running around and doing jumping jacks and stuff and like kind of",
            "start": 552.56
        },
        {
            "text": "you get along with. Um, but I'm just playing it and admittedly, I'm not playing it with anybody else. You know, I could see some idiots running around and doing jumping jacks and stuff and like kind of destroying the occasional immersion I'm getting in the game. Um, but it was literally, you know, I mean, I only play two and a half hours, but I'm running somewhere. I turn a corner, that little voice pops in saying, oh, enemies are approaching. Okay, I'll shoot them. And I turn the next corner, enemies are approaching. All right, I dug down and shoot them. And, and it's satisfying combat, but it's just not it. I don't really get what it is I'm waiting for. I don't really get what it is at my incentive is, you know? No, I, you're not wrong. Like, that's a great example. I mean, of like what The Division is. I think with more of probably negative spin on it, right? Or like, if you, you're questioning if it's for you. Again, going in for me, like the incentive is the gear treadmill, right? Like, I'm so stoked to get, oh, man, I got a level 30",
            "start": 588.84
        },
        {
            "text": "negative spin on it, right? Or like, if you, you're questioning if it's for you. Again, going in for me, like the incentive is the gear treadmill, right? Like, I'm so stoked to get, oh, man, I got a level 30 piece of, or you know, 30 damage resistant armor versus this 29 or 27 I've been wearing, you know what I mean? And then it's like, stupid woman walks up to me and wants an energy bar and I give it to her and she drops a piece of clothing and I get to go in and go to apparel, which is, you know, not thankfully tied to my equipment and change what I'm wearing underneath the stuff and all this cosmetic stuff. So like, that's the thing of like, I was talking about it, you know, uh, the day, uh, Tuesday, I guess, actual launch day. But, you know, the, the morning after playing it and it was the first time in forever after seeing a million Ubisoft games where, do you want to talk, connect to Uplay? I'm like, no, f*** off. And then Monday night, I was playing with Scott Lowe and I was like, damn, dude, that's a cool outfit. How",
            "start": 628.56
        },
        {
            "text": "a million Ubisoft games where, do you want to talk, connect to Uplay? I'm like, no, f*** off. And then Monday night, I was playing with Scott Lowe and I was like, damn, dude, that's a cool outfit. How did you get those pieces? He's like, oh, it's a Uplay reward. And so I woke up the next morning after playing at 1:30 and I'm like, Google Uplay, go there, reset the password, jump exactly, get in there and then buy that piece of, you know? So now it's like mixing and matching. Like last night, I was totally happy to get a new, a red scarf that I really think pulls together this outfit. I'm wearing this white parka. I got, I got white, white suede sneakers to match the parka. I'm doing pretty well. Red scarf pulling it all together. But that's like the nerdy stupid crap that's happening in this game where it's like, there's that and it's, it's, yeah, it is MMOs. It is Destiny. It is like, I think you have, it's like you're saying, you have to care about those, those things they're dangling like the carrot that's been",
            "start": 667.8
        },
        {
            "text": "there's that and it's, it's, yeah, it is MMOs. It is Destiny. It is like, I think you have, it's like you're saying, you have to care about those, those things they're dangling like the carrot that's been dangled. And I don't really care about the characters they dangle. Like, it does play quite a lot like Gears to me. And I'm interested when Gears comes back at the end of this year if people are going to give a f*** anymore. Like, because it's, you know, it's, it's a tentpole game and it really fell off the ledge a little bit. And it's, are people going to care as much as they used to? But playing this just really made me remember what I loved about Gears 1 is there's a story and there are cool set pieces. But two, it's that the gear that they're, they're dangling in Gears of War is really f***ing fun. Like, there are some really cool weapons in that game and there are some really cool things you can do with your friends. And maybe that is in The Division. I just haven't seen it on anything that I've watched",
            "start": 703.52
        },
        {
            "text": "are some really cool weapons in that game and there are some really cool things you can do with your friends. And maybe that is in The Division. I just haven't seen it on anything that I've watched yet. And, and it's one of those, yeah, I guess seven, six and a half, seven hours in, right? Like, it seems like no, just striving for a better M4, a better mod for this M4 to make it more powerful, to do this kind of damage and get a new sniper rifle or something like that. Colin, um, I think it's very good. I, I don't know that it's, it's, it's a great game, but I, I think that it's, it's good and there's a lot to like about it. That's what I tweet. I, I think there's a lot to like about the game. I think that, uh, one of the shocking, like, there's some shockingly bad design choices in the game. I think that the menus are f***ing awful. I want to like be like unequivocal about that. The menus are terrible. And, and, uh, like the way that they contrast with the world and like the way that they're like off center and pitched",
            "start": 735.48
        },
        {
            "text": "f***ing awful. I want to like be like unequivocal about that. The menus are terrible. And, and, uh, like the way that they contrast with the world and like the way that they're like off center and pitched like, like kind of almost like you're in a 3D space. Like, what the f***? Like that, this is, that was like one of the first things that hit me where I'm like, why is this design like this? But once you get like past all these like strange issues, um, like where you can't see half the f*** that's going on in the game. Another thing is the, there, there's a, the D-pad prompts look like X's, uh, which is like, hit this to do that. I'm like, what the f*** to do everything? I'm like, okay. Like, I don't, and I'm like, oh, is that an arrow pointing left? Cause it looks like an X to me. Um, but when you get past like all that kind of stuff, I think the gameplay is fun. It's fun to play a role playing game that, you know, where, where numbers are popping out of enemies as you're shooting them, um, as opposed to slashing them or",
            "start": 771.96
        },
        {
            "text": "shooting them with an arrow or whatever. You're using guns. I, I also think that it's really bold that the game takes place in New York City. And I, I, I, I, uh, um, it, it takes, I don't think people look at it, especially maybe younger people, but like, it's, it's kind of still faux pas in a lot of ways to go into New York City and destroy it like that. Um, after what happened in 9/11. And I'm certainly not one of those sensitive people that thinks that. And I'm from New York. Um, but it's, it's, uh, it's cool to see New York like use the way it should be in, in apocalyptic fiction like that. Because it is a great setting. It's a better setting than almost any other setting because it's, it's so populated and so important, um, to the economy and to society and the culture that like, when you, when you remove all of",
            "start": 812.0
        },
        {
            "text": "setting. It's a better setting than almost any other setting because it's, it's so populated and so important, um, to the economy and to society and the culture that like, when you, when you remove all of that and ship it all down, it actually, it makes it scarier. And so no, I, I, that's my thing. You know, whenever we talk about space, right? Like, I was like, I don't like space and it's not Universal. I enjoyed this then. But like, getting excited for this game when I was like, this looks like it's going to be like third person Destiny. And I like Destiny fine, but I fell out of it, you know what I mean? The world's never connected with it. But like last night, even running through with Fran and Brennan, right? And mild spoilers, I guess, but for an artistic direction of what they're doing with the city and all this different stuff, right? Like, one of the missions that I'm sure you'll do a million times and see something similar to it, you know, we went underground and we're going through and it was going through like",
            "start": 848.36
        },
        {
            "text": "stuff, right? Like, one of the missions that I'm sure you'll do a million times and see something similar to it, you know, we went underground and we're going through and it was going through like, you know, where they've been storing all the bodies. And so you're going over this catwalk and around and you look down and it's just f***ing body bags everywhere and huge heaping piles. And then the way they were using light and playing off, I was like, man, that's really, and this is my second time going through it. I'd seen the body bags before, but never stopped to really marvel at it and be like, f***, this hits closer to home when you're like, this is a cooler idea because it could happen, kind of thing. But then going through in the next room or right before the boss's room, I guess, I hadn't paid attention before when you're going over this other catwalk and it's just dozens, if not hundreds of caskets and they all have the American flag draped over them. And it was one of those things where we all stopped",
            "start": 884.0
        },
        {
            "text": "when you're going over this other catwalk and it's just dozens, if not hundreds of caskets and they all have the American flag draped over them. And it was one of those things where we all stopped walking. We like stopped and pointed out to each other like, holy f***, look at, like, you know what I mean? Like, the way they were using light. Like, there is something that is way more eerie and interesting and cool than anything I ever did in Destiny of running across the moon, right? And picking up for f*** and shooting a Vandal. Yeah, I do, I do agree though that there, there doesn't seem to be a hook. Like, the, and I've only played it for a few hours, so I mean, I've not explored all the game. But it just like, you're questing and you're getting gear. But like, I don't need the aesthetic f***. Like, I'm, I'm so sick of like the hyper customization in games. Like, I don't, I just don't understand it. And like, I don't, I, I just don't see how it's immersive. I think it's a, it's a distraction and it's like a, a check",
            "start": 914.8
        },
        {
            "text": "sick of like the hyper customization in games like I don't I just don't understand it and like I don't I I just don't see how it's immersive I think it's a it's a distraction and it's like a a check box on the back of a a game box it's not important you know and and uh like gameplay is fundamentally important I do think the cover based gameplay is solid I think there're a better cover third person shooters for sure but um you know so I think that like there the gameplay is fun it's satisfying to level up and I seem to be leveling up pretty rapidly um which is interesting enemy scale when you play by yourself which is cool um and you have this option to play with people or not play with people someone stuck into my game and I was you know cuz I think I was like friends with them or whatever on PSN and I just kicked them out and then shut it off so no one can come into my game but you're still seeing people on the map that you're friends and you know you it is a little weird going to like",
            "start": 951.36
        },
        {
            "text": "PSN and I just kicked them out and then shut it off so no one can come into my game but you're still seeing people on the map that you're friends and you know you it is a little weird going to like the headquarters and there's like a million people just gathered around **** so it's a little like there so like for all the cool stuff in there there's like some weird design choices and I'm like this is a little muddled and messy um and not very well thought out but um but I do think that the game's fun and I don't know how long I'll play it but it's it's uh it's cool yeah so a nice third person shooter role playing game in New York City can't really complain about that um and there's an eeriness to it as I've said many times in the past I love the idea of it happening on Black Friday so that New York City is in a Perpetual Christmas basically which I think is really really really a really cool idea um and uh not necessarily novel but just a cool idea that there's just Christmas",
            "start": 988.96
        },
        {
            "text": "so that New York City is in a Perpetual Christmas basically which I think is really really really a really cool idea um and uh not necessarily novel but just a cool idea that there's just Christmas decorations forever um and uh I like that you know the city feels empty because it should people are scared and and um so there's not a pro a huge problem with that taking place in taking place in Midtown Manhattan is interesting um starting in Brooklyn is even more interesting I think and and I I I wonder um how they'll expand the map and how they'll play in the future if we get to you know uptown and downtown but obviously also to the other borrows and and how that will play as well so I think there's like a future for this game but it's it's I think this game's going to have the same Arc as Destiny where people are going to are going to be like well what what's really the point of this and like where's the content how much can I possibly do in this game um and mechanically having played",
            "start": 1025.48
        },
        {
            "text": "Destiny where people are going to are going to be like well what what's really the point of this and like where's the content how much can I possibly do in this game um and mechanically having played Destiny for a little while uh I think Destiny probably played better as a first- person shooter than I think The Division plays as a third person shooter but um yeah I like it I think it's I think it's very good I think there's there's a great deal to like as I said um I do disagree that the game is like stunningly beautiful I don't I don't see it like that um I think that the the design choices and and the art is pretty but I don't I don't look at this game and I'm like wow like a lot of people are looking at this game and being like this is like really a great like technical Marvel I'm like I don't I don't agree at all like I I think the character models are bizarre I think that you know that the I think they're pretty they look good I just think that it's like there's like some weirdness",
            "start": 1068.0
        },
        {
            "text": "don't I don't agree at all like I I think the character models are bizarre I think that you know that the I think they're pretty they look good I just think that it's like there's like some weirdness like there's this one like uh Asian woman that you're with like in the beginning in the helicopter her voice sinking like lip syncing is all off like like animation's a little strange and I'm like well the the city's pretty yeah like the streets are pretty the the the weather effects the dynamic weather effects are really pretty it was pretty cool to be caught in like a snowstorm basically as you're like fighting and you can't see ahead of you and um so yeah I think it's like many other things pros and cons but glad to play it and I think it's a lot of fun I just think that um I don't know that this game's going to have a huge tail I'll be interested to see how people take to it mhm this is one of those games that makes me feel like I feel like a sport brat really when I play a game like",
            "start": 1104.64
        },
        {
            "text": "this game's going to have a huge tail I'll be interested to see how people take to it mhm this is one of those games that makes me feel like I feel like a sport brat really when I play a game like this because you know like yeah it has its problems but it's it's you know it's it's really a quality game in terms of the mechanics really cool and the world's really well thought out and the atmosphere is superb like you say like M like you're talking about I haven't got to that yet but even just right at the beginning where you go down to your first tunnel and the Smoke's kind of billowing and the red lights are flashing it's really atmospheric and you you know really mood but it falls into that camp of so many Ubisoft games for me where it's just like there's great mechanics and there's great worlds and I feel like I should be loving this but I couldn't give a **** about anything I'm doing and then I play a game like The Witcher which is overbearingly micromanagement for me like I",
            "start": 1141.2
        },
        {
            "text": "great worlds and I feel like I should be loving this but I couldn't give a **** about anything I'm doing and then I play a game like The Witcher which is overbearingly micromanagement for me like I can't really I don't want all my swords to break all the time you have all these seashells what will you do with them I was just saying to my friend last night who it was his favorite game last year and I said it was my favorite game last year but I didn't play it as much as most games I just respected it more um but I really wanted an option that game where I could go into the menu system and just say never going to do any of these things and press like delete them from the menu system like never I don't you wor about this computer yeah exactly um and the just like but yeah but what The Witcher I did so well was those side stories they're no more mechanically complicated than any other video game you play you go into a place you look in three houses you pick up some Clues by tapping the",
            "start": 1173.64
        },
        {
            "text": "I did so well was those side stories they're no more mechanically complicated than any other video game you play you go into a place you look in three houses you pick up some Clues by tapping the button all the time and then you fight something but you you cared because they they integrated the story so well with the environment and they created you know real personality into things and all of these games I'm kind of playing I'm just like I feel just really spoiled because 10 years ago I would have eaten this up and thought it was the best thing ever and now it's like no I want more from this sure yeah I think that's I don't think there's anything wrong with wanting more though the game's been in development forever and and and you know like we're so preliminary in the game that we don't we we've barely scratch the surface but it's already clear a few hours in what it is and what the cycle is going to be and what the loop is so yeah like I I that's why like you can kind of see you down",
            "start": 1206.48
        },
        {
            "text": "we we've barely scratch the surface but it's already clear a few hours in what it is and what the cycle is going to be and what the loop is so yeah like I I that's why like you can kind of see you down the tunnel and be like this isn't going to change at all um and I agree with you like I thought The Witcher was way too dense and um there was way too much stuff in that game but they did pay like the the thing about that game is that that I did respect about it is that they the side quest didn't feel the same none of them did like there were actual stories like to every side quest and like there was a narrative driven focus in the game that The Division seems to lack like I went on a bounty hunt and like they I was chasing some woman and and I she had lieutenants and stuff and all I'm like I don't know like why I'm even fighting this woman at all I'm going to kill her but she did something to someone yeah but like like but in in in The Witcher they would have really fleshed that out and it might",
            "start": 1243.6
        },
        {
            "text": "like why I'm even fighting this woman at all I'm going to kill her but she did something to someone yeah but like like but in in in The Witcher they would have really fleshed that out and it might have been like three parts and stuff I'm not saying that I want that necessarily because I think The Witcher went in the other direction like way too much but um you know yeah I agree with you it's like it's it's it's a it's definitely a good I definitely recommend it like I I I don't think you can if you like shooters or online experiences I'm going to play it by myself but if you like those online kind of experiences and obviously those loot driven experiences then I don't see why The Division wouldn't appeal to you I just think that it's not um so far uh it hasn't excelled to like this excellent degree you know not that I really expected it to I thought I would like it and I do so that's good enough for me do you see yourself playing this for months it's one of those maybe who knows that my",
            "start": 1283.8
        },
        {
            "text": "degree you know not that I really expected it to I thought I would like it and I do so that's good enough for me do you see yourself playing this for months it's one of those maybe who knows that my concern of course is how busy we are I mean by the time this is posting it's GDC week which means I don't play at all during GDC week right and so then I come back and then it gets in then it's the normal question it will it be Destiny again where I came back from a weekend away or whatever and everybody was already gone and I felt like I was already at such a detriment you know what I mean if I jump back in and Fran, Scott and Brendan and anybody else I want to play with are you know their level 30 already and I'm I'm going to be in the 0s Maybe by then knock on one I'm about to turn 10 tonight probably and then I'm going doing the stream for Twitch you know what I mean I don't know that's the question for me i' I'd think that I'd be more inclined to jump back in and go and do it and I",
            "start": 1317.2
        },
        {
            "text": "probably and then I'm going doing the stream for Twitch you know what I mean I don't know that's the question for me i' I'd think that I'd be more inclined to jump back in and go and do it and I think that there's enough people playing that if they stick around that it's not going to be hard for me to find people to do it but you want it to be fun it's going be this Challenge and experience rather than all right cool let's jump in even though but it's it's the weird thing cuz like you know um Borderlands had you know girlfriend mode right that they got away from real quick but basically your you know your buffer buddy system where everybody comes up to that level last night I forced Fran and Brendan to do this mission on hard and we played through and that was bringing people up to my level right but then it's one thing that I'm level nine and I think Brendan was seven and Fran was six or whatever and then other level nine guys started spawning to fight us but they were like that they",
            "start": 1354.8
        },
        {
            "text": "right but then it's one thing that I'm level nine and I think Brendan was seven and Fran was six or whatever and then other level nine guys started spawning to fight us but they were like that they had like lots of armor and they were way tougher than they should have been right and so then it was like ah we we we almost got it then we got destroyed at the end then Brendan fell through the world and then it was like ah me and Fran are we getting our heads kicked in and so Fran went and recruited one of his friends to come in and help us and he was level 17 and we're like now we're going to go in and collaborate awesome and we got in there and we ran in and the guy goes oh **** they're 17 too and on our screen it was just the Red Skull over their names like like like so we they were one-shotting us or whatever and it was just like it's cool that that that kind of balanced but I don't know how that works out then for like I'm saying if I come back and you know Fran is 5 7 or",
            "start": 1391.12
        },
        {
            "text": "one-shotting us or whatever and it was just like it's cool that that that kind of balanced but I don't know how that works out then for like I'm saying if I come back and you know Fran is 5 7 or whatever and I am 16 is there a way to play with him or am I on my own until I get to that point but those are questions you'll figure out as you go yeah we'll have to check back in in like a month and see I think I have a better shot of playing more of this than I do Destiny or than I did Destiny I should say you know what I mean like this is the one where I'm knocking out trophies and I'm like H Platinum doesn't seem that unobtainable you know what I mean like I'm on that where you know I one night alone I got the 0 medic heal I'm like all right that's not that bad you know what I mean yeah so we'll see yeah with the extra content that they keep developing if the expansion stuff yeah keeps coming it's like you know I mean yeah I'll probably come back to it when and not to sound like no but when",
            "start": 1428.4
        },
        {
            "text": "so we'll see yeah with the extra content that they keep developing if the expansion stuff yeah keeps coming it's like you know I mean yeah I'll probably come back to it when and not to sound like no but when it's finished when all that content that is really there so I can kind of pick and choose what I want to do and honestly yeah I mean I prefer the older get to play games on my own but this does feel like one I'd enjoy more playing with my friends and uh there are a few games that I play co-op that aren't more fun they're just way less immersive which means they're less interesting for me um but most of my friends are playing so many different things I don't know if I'll be able to get people sure and that's where we're lucky to have this group that's all video game people not to mention all the best friends out there in my friends list that would want to do it but that's the other thing to it of like uh when I'm going out and playing with other people whether it's Scott or somebody else",
            "start": 1465.04
        },
        {
            "text": "the best friends out there in my friends list that would want to do it but that's the other thing to it of like uh when I'm going out and playing with other people whether it's Scott or somebody else we're running through the missions and we're talking to each other and we're you know coordinating what's happening but there's no real story context to it of who we're hunting or why we're doing it right but then have you done any of the Echoes no I don't think so when you go one of those yeah like those are the ones where it's like Batman detective Vision or whatever where you go and it spawns up and you can go over investigate and that's when you get these like little stories of like this guy was on the run from that guy they were trying to he broke away he went into the subway I went in the subway all these like heavy spawn I'm fighting them or whatever and get him out of his that's a cool little thing and I that for me is the solo experience right like that and hunting down the cell",
            "start": 1502.96
        },
        {
            "text": "subway all these like heavy spawn I'm fighting them or whatever and get him out of his that's a cool little thing and I that for me is the solo experience right like that and hunting down the cell phones and looking for that those are the ones I want to do by myself and not have somebody in a group with yeah I think that uh to the point I think that the the to be fair to Ubisoft like the the this game doesn't lend itself to narrative so it's it's it is going to be environmental it's not going to be literal um in the way the story is being told so that's not like a huge problem for me I do prefer those kinds of experiences too I've always have I'm never going to play this game with another person so it's it's you're going to play with me one day maybe but like it's it's like when I played it I was pleasantly surprised that I was like this is totally manageable by myself and and uh to your point immersion is important like you want to have this I Am Legend kind of experience where like",
            "start": 1533.64
        },
        {
            "text": "it I was pleasantly surprised that I was like this is totally manageable by myself and and uh to your point immersion is important like you want to have this I Am Legend kind of experience where like you're in the City by yourself or like you're surrounded by **** but you don't really know what's going on you're a man alone and and I liked that like that that definitely is probably the coolest part of the game is like I'm just slinking around no idea what the **** going on around me I have no idea who any of these people are who I can trust and who I can't trust I think that that's that so I think it's going to be the way you similar maybe to Destiny the way you tell your own story this certainly grabs me way more than Destiny I found Destiny to be very vanilla and um way more about even though the mechanics are great and I I would never dispute that way more about the MMO Loop than this game is um so or this game seems to be maybe five 10 hours in a totally changes but I I really",
            "start": 1568.08
        },
        {
            "text": "though the mechanics are great and I I would never dispute that way more about the MMO Loop than this game is um so or this game seems to be maybe five 10 hours in a totally changes but I I really doubt it well it'll be endgame where it'll be the real test to see what it because that was the same Destiny right you could play Destiny all by yourself until you wanted to you got to level 30 do with the raids right so so I I'm I'm intrigued I I do think that they they did a nice job the bigger systemic question about The Division is like how this peels away from this this ever growing pie of games that require your a complete attention for a long periods of time and this game cannibalizes another Ubisoft game which is another **** Tom Clancy game um which is Siege so it's it's it's uh which just came out in December so it's funny how these games are kind of stacking up on each other like uh Jose tweeted out a picture of a Destiny lobby as we were talking about on Colin & Greg Live that was empty the day",
            "start": 1603.32
        },
        {
            "text": "December so it's funny how these games are kind of stacking up on each other like uh Jose tweeted out a picture of a Destiny lobby as we were talking about on Colin & Greg Live that was empty the day The Division came out and I was like huh like I never really thought about that like this this game won't have maybe permanent effects on Destiny but it has permanent effect on Destiny right now and it's going to take players away from Destiny permanently in some respect later um so like how does this ecosystem exist and like can games like this continue to come out and still Thrive because I do think we're going to get to a Tipping Point with these kinds of games where what it happen with a Valve for instance like a Valve like died like it just is withered on the vine and it's dead you know um maybe some you know maybe play by a few hundred a few thousand people at a time now but I mean that game was that game no one cares about that game and that's an example of of like a a game that is",
            "start": 1643.88
        },
        {
            "text": "maybe some you know maybe play by a few hundred a few thousand people at a time now but I mean that game was that game no one cares about that game and that's an example of of like a a game that is totally multiplayer Centric that was years were put in by a very talented studio and it just didn't take off and so for every The Division in every Destiny there are going to be other ones that fall to the Wayside and so more systemically it's going to be interesting to see how these games I bet they dovetail each other more though you know what I mean yeah sure Destiny gets it's lunch eaten right now by The Division but when Destiny whatever the next you know Taken King or Destiny 2 comes out The Division will go down cuz we Beast that content when The Division does this but to your point of like how many of those can be in in the equation right these giant multiplayer games need be focused yeah just like how big can these games get like last year when I come to the end of the year and we were doing",
            "start": 1676.4
        },
        {
            "text": "of those can be in in the equation right these giant multiplayer games need be focused yeah just like how big can these games get like last year when I come to the end of the year and we were doing discussion about you know what what the best games of the year it's like this should have been my favorite year of gaming in history because what I like a big open world I like immersive environments I like things where I can take it at my own pace and explore and last year was the year for that like every video game decided to adopt that but to a detriment where it's like I don't have I grant it maybe if I was a teenager or something or a university then would have the time but I don't have the time for all of these games and really it's like I have to pick one and I have to focus on that one and then you just get more and more picky you know yeah yeah you're absolutely right with The Witcher was special I played The Witcher for 60 or 70 hours and I felt like I didn't do anything like to the",
            "start": 1711.2
        },
        {
            "text": "and then you just get more and more picky you know yeah yeah you're absolutely right with The Witcher was special I played The Witcher for 60 or 70 hours and I felt like I didn't do anything like to the point where I'm like I can't **** play this anymore like I just I don't know like what I'm even doing in this game anymore there's how many question marks can possibly be on a map and how do they just keep coming back over and over again and it gets worse and worse and it's just I spiraled out of control at that game by the time Fallout came out I was just like I just I can't I played Fallout for like 5 hours and I'm like I can't play this you know like I'm like I like I just I look forward to this game so much there's nothing wrong with it it's just I'm just like I can't I just can't then then a game like The New Order comes out like the Wolfenstein DLC which is a single player five six seven hours **** amazing game and I'm like this is great yep because I can just see it and be done",
            "start": 1742.24
        },
        {
            "text": "a game like The New Order comes out like the Wolfenstein DLC which is a single player five six seven hours **** amazing game and I'm like this is great yep because I can just see it and be done",
            "start": 1772.44
        }
    ]
}