{
  "id": 1638,
  "video_id": "fM-Rzzr8PTk",
  "show_name": "Kinda Funny Live",
  "hosts": ["Tim Gettys"],
  "title": "Let's Play Presents: Kinda Funny Live 2 Trailer (TICKETS ON SALE NOW!)",
  "description": "Get your tickets NOW! http://www.kindafunny.com/tickets\n\nSubscribe! http://www.youtube.com/kindafunny?sub...\n\nRead all about our partnership with Rooster Teeth: http://www.kindafunnyforums.com/viewtopic.php?f=13&t=7177&p=120730#p120730\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\n\nKinda Funny is partnering with Rooster Teeth and Let's Play to make this year's Kinda Funny Live a 2-day event that will somehow be 300% more ridiculous than you could ever imagine. Day 1 will be a crazy, over-the-top show full of surprises, special guests, and shenanigans, hosted by the one and only Burnie Burns. Day 2 will be a full day of live podcasts, meet and greets, and signing featuring Kinda Funny, Achievement Hunter's Geoff Ramsey and Michael Jones, Funhaus' Adam Kovic and Bruce Greene, and Rooster Teeth's Gus Sorola.\n\nExclusive merch.\nHuge announcements.\nAnd an entire weekend with the best community on the internet.\n\nWe'll see you at Kinda Funny Live 2.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThank you to https://www.youtube.com/user/PixelBrave for the Meet and Greet footage!",
  "published_at": 1459180803,
  "duration": 112,
  "transcript_chunks": [
    {
      "text": "I'm gonna be real I think Kinda Funny Live was the best night of my life what about you Nick I can agree with that Colin how much time you have I can think of 500 nights better than kind of all right you know what let's just go all right all right last year the Kinda Funny Community flew out from all around the world to see the first ever Kinda Funny Live now those people they all expected us to just sit around a table and do a podcast but no no no no no no no no we put on the most ridiculous show imaginable and gave them an experience so here's the deal people have asked how are we going to top last year people are suggesting that we hold on to some of our crazier ideas for next year's show no next year we'll figure out next year this year is an all ages -day event at the Regency Ballroom in San Francisco that's a real venue that's a place that my dad grew up going to concerts to see legends perform and now thanks to you we are performing there so day one will be the craziest",
      "start": 1.4
    },
    {
      "text": "Ballroom in San Francisco that's a real venue that's a place that my dad grew up going to concerts to see legends perform and now thanks to you we are performing there so day one will be the craziest live show you have ever seen with the ton of surprise guests and it will be hosted by Rooster Teeth co-founder Burnie Burns yeah I can't believe it either then day two a full day of live podcast meet and greets and signings featuring Achievement Hunter's Geoff Ramsey and Michael Jones, Funhaus' Adam Kovic and Bruce Greene, Rooster Teeth's Gus Sorola and more we're talking exclusive merch we're talking huge announcements and we're talking about an entire weekend of hanging out with the best community on the internet I promise you this will be worth flying out for I promise you this will be worth the dollar this year I'll see you at Kinda Funny Live 2",
      "start": 43.84
    }
  ]
}
