{
    "id": 1611,
    "video_id": "mnnErFoqu60",
    "show_name": "Love & Sex Stuff",
    "hosts": [
        "Tim Gettys",
        "Nick Scarpino",
        "Anthony Carboni"
    ],
    "title": "How To Take Off A Bra - Love & Sex Stuff",
    "description": "Watch more Anthony! https://www.youtube.com/user/acarboni\n\nSupport this show! Get the Love & Sex Stuff Shirt here!\nhttps://www.districtlines.com/98029-Love-and-Sex-Stuff/kindafunny\n\nSubmit your questions here!:\nhttp://www.kindafunny.com/loveandsex\n\nIs it actually possible to undo it! without her help?!?!?!\n\nEach and every Monday at 9AM PST Tim Gettys and Nick Scarpino answer your questions about dating and relationship advice....cause that sounds like a good idea.\n\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nAnthony - http://www.twitter.com/acarboni\n\n\nMusic by Tonedeff - http://www.QN5.com",
    "published_at": 1457971202,
    "duration": 309,
    "transcript_chunks": [
        {
            "text": "This is all going to make sense later. Trust me. So Anthony Nick. Yeah. Today's question comes from 16-year-old Jakey. Jakey wants to know \"It's going to happen.\" Yeah it's adorable. I like that. It's going to have to happen at some point. So my question is how do you undo a bra with your teeth after marriage? Oh my god. Wow. It went from really really nasty to really actually sincere. Sincere and sweet. Yeah. I love I love that he's just like it's going to happen at some point. As if just like like it's the zombie apocalypse or a giant earthquake or something. You can hear the dread and forge it. Don't worry, Jakey. Don't worry. It's not that big a deal. It's really not. It's like it's Here's the thing. It's simple, but it's also the most complicated thing in the world. You are never going to get it right. And for anybody that's like \"Oh, I can I can one day take it off at any moment.\" It's totally cool. Here's what you got to do. Scarpino. Scarpino little when he was",
            "start": 2.88
        },
        {
            "text": "are never going to get it right. And for anybody that's like \"Oh, I can I can one day take it off at any moment.\" It's totally cool. Here's what you got to do. Scarpino. Scarpino little when he was Nikki. I mastered before he was Nick. I mastered this when I was 14. Snaps them off. Okay, no big deal. NDVD, as they say. Point number one, make sure the person is facing you. It's a lot harder to do it if they're the opposite way. So, you know, start the right way with their looking into their eyes. You'd think it would be easier the other way, but it's not. Here's the deal. Slide your left hand, not the right, I don't know why. Left hand around, right? You pinch and snap and it comes right off. Okay. Now, if you encounter someone who needs a more uh heavy duty bra, which is sometimes the case. Oh, that's definitely a thing. You got to keep pinching and snapping as you go down. Then you take out an Allen wrench. Snap. A small one like you got for an IKEA nightstand. Okay, now you're just",
            "start": 53.36
        },
        {
            "text": "Oh, that's definitely a thing. You got to keep pinching and snapping as you go down. Then you take out an Allen wrench. Snap. A small one like you got for an IKEA nightstand. Okay, now you're just over complicating this. Okay, I know you just got married. It's not that hard. Lefty loosey, righty tight. That's just it. See, I've **** this up so many times in my life. It's ridiculous. Like, I try to come here. I'm finish. Come here. Come here. She's here. You're looking at her, right? First of all, make sure there's no one over the shoulder. Come back. You slide it under here, grab, pinch, and snap it off. It's all you got to do. It's all you got to do. And here's the other thing. You don't need to go one-handed. If you feel like you can't do one-handed, you don't need to. Here's what you need to know about the physical structure of the thing. The hooks go like this. So, you're going to think you want to pull apart. You got to push in first, which gives the hook slack and then it will",
            "start": 98.32
        },
        {
            "text": "need to know about the physical structure of the thing. The hooks go like this. So, you're going to think you want to pull apart. You got to push in first, which gives the hook slack and then it will come apart. Yeah. It's like a child with both hands like that. Like there's nothing better than that moment where you're just like, I'm about to unleash these things. Like, this is happening. I know this is about to happen. So, it's like you get kind of nervous. You get kind of scared, but it's fine. I've never been in a situation where they judged me for being a little over excited. Especially like especially when you're a teenager. Girls know that guys don't know how to do this. And she may laugh a little bit, but it's because she was expecting it, not because she's laughing at you. And once again, I I say this all the time when when when kids ask advice on things. Communicate. It's totally fine to communicate. It's totally all right to be like, \"Little help.\" She'll totally help. She",
            "start": 140.08
        },
        {
            "text": "again, I I say this all the time when when when kids ask advice on things. Communicate. It's totally fine to communicate. It's totally all right to be like, \"Little help.\" She'll totally help. She will take it off. She's in it for sure. I've been in that situation many times. I just be like, \"I I literally I don't even communicate.\" You know, you have a good relationship with a girl when you just look at her and just go, \"Actually, let's take it off.\" Can I borrow an Allen wrench? Do you have an electric screwdriver so I can get this thing off? Yeah. The what? Here's the deal. The number one thing bra. You got to look out for metrics. There's no such thing as a metric bra. Here's what you don't do, right? Don't get frustrated like Kevin does sometimes and just automatically go to scissors. Don't do that because bras are very expensive. Switchblades are more manly. Yeah, they are. Just a little flick like a butterfly knife. If you can do a couple tricks and be like, we're getting this",
            "start": 182.56
        },
        {
            "text": "Don't do that because bras are very expensive. Switchblades are more manly. Yeah, they are. Just a little flick like a butterfly knife. If you can do a couple tricks and be like, we're getting this thing off. It's happening. Don't bring a butterfly. Don't bring a butterfly. Don't bring ladies and gentlemen. This is the show. I can't believe you guys didn't bring a bra. One of us is not wearing Kevin in a bra. Yeah, Nick wanted Kevin. I really wanted a bra. But look at Kevin. Imagine him in a bra. And imagine I do all the time. All the time. Oh my god. Anyways, ladies and gentlemen, every Monday 9:00 a.m. you can get more of this. You know, we'll do Kevin for how to take off panties. Okay, that'll be great. That'll be really really great. Who asks that one? Anthony, where can people find you?",
            "start": 224.08
        },
        {
            "text": "you? Uh, I'm on Twitter at a carboni. My podcast every Monday, Wednesday, and Friday is We Have Concerns and my YouTube is a carboni. That's a great great thing. If you have more questions for us after watching this video, can't imagine that. Go to kindafunny.com/lovenex. fill out that form and we'll get to them at some point. Also, if you want the Love & Sex Stuff t-shirt, go to kindafunny.com/store and you can get yourself one. Fantastic. How do you get a t-shirt off of somebody? You get a t-shirt off of somebody again. That's where the plate comes in. Okay. That's when you got to go. You know, you do the 80s things like Oh, yeah. Yeah. Yeah. I can do that. Can you? Sure. I want to see that.",
            "start": 264.64
        }
    ]
}