{
  "id": 1636,
  "video_id": "sNnYU-9br3Q",
  "show_name": "The GameOverGreggy Show",
  "hosts": [
    "Greg Miller",
    "Tim Gettys",
    "Nick Scarpino",
    "Colin Moriarty",
    "Mike Drucker"
  ],
  "title": "Mike Drucker (Special Guest) - The GameOverGreggy Show Ep. 120",
  "description": "Special guest Mike Drucker joins us to talk about writing on The Tonight Show, our trip to Rooster Teeth, Batman, and weird pet peeves. (Released to Patreon Supporters on 03.18.16)\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1458889201,
  "duration": 6296,
  "transcript_chunks": [
    {
      "text": "I got beat. What's up everybody? Welcome to the GameOverGreggy Show. I am one of your hosts Greg Miller alongside the producer/seducer Nick Scarpino. Great to be back. Good to have you back. Great to be back. It's been too long since you sat behind that microphone beard all close to it. Oh yeah. Over there. The pure one Tim Gettys. Lad to host. Thanks for that Nick. Over there the pride of Long Island Colin Morardi. Go Islanders. And then right here the one and only Mike Ducker. Hi, everybody. Yeah, I'm on camera. Everyone knows Mike Ducker, I assume. But for the few who don't, Mike Ducker has had an illustrious career. He wrote he wrote for Nintendo, made some of your games you love out there. He wrote Up at Noon for a long time until he was poached by some hack named Jimmy Fallon who took him to late night and took heard to the Tonight Show. Now you write for the Tonight Show. That's right. That's **** awesome. How **** weird is that? It's very weird.",
      "start": 2.81
    },
    {
      "text": "named Jimmy Fallon who took him to late night and took heard to the Tonight Show. Now you write for the Tonight Show. That's right. That's **** awesome. How **** weird is that? It's very weird. It's very weird. There are days when I still don't like there are days when I don't realize that I do that, you know? Like when you're like you're like, \"All right, I'll go to work.\" And then you're like, \"Oh, wait, no, I'm doing something really fun.\" Yeah. Um it's really fun. It's cool. Me every day. Yeah. No, you never have the realization. I imagine got to get out of bed at 10:30. Exactly like working at IGN. It's just like cuz when you were there, so just to to bring everyone up, Ducker was the one and well, I guess Alana wrote a little bit on it, but at first you were the only writer. At first, I was the only sort of comedy writer, right? Up at Noon. And this was back when we were doing all the start stuff and we brought you in and we were like, \"Cool, you're a writer.\" Yeah. Take",
      "start": 79.6
    },
    {
      "text": "At first, I was the only sort of comedy writer, right? Up at Noon. And this was back when we were doing all the start stuff and we brought you in and we were like, \"Cool, you're a writer.\" Yeah. Take care of the entire thing. And then and this is like a 30-minute show that we you you were basically in charge of writing. So I imagine that writing for Jimmy Fallon is exactly the same. Just you in a room. Just me in a room. Jimmy comes in, he's like, \"What do you got for me today?\" He puts him on 80 monologue jokes. He does what I used to do and I, you know, just like totally entitled, but I don't get any of these cuz I don't get video games. And Greg's like, \"No, they're really funny.\" Right. Um, then Mike Pereira is there and he's like, \"These are great.\" Yeah. Mike's like, \"And then you go and then you just rinse and repeat the next day.\" Is that is that pretty accurate? Uh, it's it's almost like cuz we only did one show a week with with with GameOverGreggy at God. We only did one",
      "start": 116.4
    },
    {
      "text": "go and then you just rinse and repeat the next day.\" Is that is that pretty accurate? Uh, it's it's almost like cuz we only did one show a week with with with GameOverGreggy at God. We only did one show a week with Up at Noon and it's almost like everything we did for each week in one day. Jesus Christ. So, you know how like we'd be running around be like, \"Oh, something just happened. We need to do this.\" And like we'd run around and have a bunch of meetings. That's all condensed every day, Monday through Friday, right? Because it's so topical, too, right? It's so topical. So, the second something like how what's I'm sorry. I know this is one of the topics. Are we starting off with this topic? This was the first topic. We're there. We're in the thick of it. Going straight into it. So, how often do you guys have to do fire drills? How often is it like the show's about to happen and then like Donald Trump said something crazy and now it's time to write like 10 jokes about Not as often",
      "start": 148.8
    },
    {
      "text": "often do you guys have to do fire drills? How often is it like the show's about to happen and then like Donald Trump said something crazy and now it's time to write like 10 jokes about Not as often as you think cuz most new cuz we tape at 5:00 p.m. Eastern and a lot of like crazy news breaks like at 7:00. You know, like debates and stuff don't happen till after we're done. I think the last time that happened was the week before weren't we're on hiatus right now, but the week before was when Mitt Romney went on TV and like shot down Donald Trump. Then Donald Trump went on TV and like shot down Mitt Romney. That was the last time we were like watching TV, typing furiously, sending in jokes, like joke after joke after joke after joke just to sort of get on top of that topic. Usually the news is a little bit more easy for us, you know, like we'll have pitches at night that's like",
      "start": 179.36
    },
    {
      "text": "is a little bit more easy for us, you know, like we'll have pitches at night that's like, \"Hey, this is what happened tonight. Here's my idea for what we should do in it.\" Then the morning it's like, \"Okay, here's what happened overnight. Here are some new ideas for it.\" Um, but it's been crazy lately. This election has made our jobs um a lot of fun, but also really hard. Yeah. Yeah. It didn't it didn't make them easier. So much there's so much because there's so much going on. And also, you know, you you don't want to just repeat the same Donald Trump joke every day. You don't want to repeat the same Mitt Romney joke when Mitt Romney talked. Like you don't want to just say I mean it's fun to call Chris Christie fat but you can't you know only call Chris Christie fat. You can't you can for a little while. You can do it for you can do it a lot. You can do it a lot but there's a point also when the audience is like all right we stop. He's got a glandular problem right? So a lot of it's",
      "start": 214.64
    },
    {
      "text": "a little while. You can do it for you can do it a lot. You can do it a lot but there's a point also when the audience is like all right we stop. He's got a glandular problem right? So a lot of it's like thinking up new angles on stuff and trying to find a way to talk about it. And also like you know the audience is like you know very polarized right now. Like there's people who are insane about Bernie Sanders and if you make fun of Bernie Sanders they get upset. Oh that's a sensitive bunch. Right. That's a sensitive bunch right there. You know, Donald Trump people get upset about it, too. Like, uh, it's such a All elections are polarizing, but this one's super polarizing and especially our show, you know, we try to hit both sides just as a matter of course. It's just what Jimmy wants to do is make sure we cover all our bases. Um, and it's just interesting because sometimes, you know, you'll do a joke about Bernie Sanders and like people on Twitter will be like, \"Oh, you so",
      "start": 249.12
    },
    {
      "text": "wants to do is make sure we cover all our bases. Um, and it's just interesting because sometimes, you know, you'll do a joke about Bernie Sanders and like people on Twitter will be like, \"Oh, you so conservative.\" And then you'll do a joke about Donald Trump, people like, \"Oh, liberals, classic Hollywood liberals.\" And you can't win. It'll be the same monologue and people on two different sides of the eye will see it two different ways. So, walk me through like So, you guys said you're on a hiatus now. So, first of all, how many weeks a year it does Jimmy Fallon film? Uh, we film I could be wrong and I don't want to be wrong, but I think it's something like 4 weeks. So, maybe we get 10 weeks off and maybe more, maybe less. Okay. And so, what is that what does that Monday through Friday look like? Like what you get up so what time do you get there? What time you leave? Like what's that whole because it seems like it's a job that is just inherently quite soul sucking not in a bad way",
      "start": 284.64
    },
    {
      "text": "look like? Like what you get up so what time do you get there? What time you leave? Like what's that whole because it seems like it's a job that is just inherently quite soul sucking not in a bad way but timeconuming timeconuming it's timeconuming it's not soul suck um it's definitely it's definitely timeconuming uh but killing you I get in relatively early a lot of people sort of write from home for a while and then they come in like maybe 10 or 11 there's no hard hard and fast like p you don't have to come in and punch your card but you know we have deadlines throughout the day of when pitches are due when jokes are due and usually in the morning like we'll have you know if thank you notes are due that day thank you know will due at like 9:30 a.m. or 9:00 a.m. depending on the day. Then at 11:00 we have to turn in monologue jokes. And then you know our headwriter will pick out what he likes and be like \"Okay we're going to work on this \" or \"Okay we need more on this topic",
      "start": 322.24
    },
    {
      "text": "at 11:00 we have to turn in monologue jokes. And then you know our headwriter will pick out what he likes and be like \"Okay we're going to work on this \" or \"Okay we need more on this topic or these are the sketches we're going to do.\" Then at 1:30 there's something called the creative meeting and that's when big sketches are read. You know things like if Jimmy's going to dress up as Donald Trump and we need to have hair and makeup ready to do it. You know things that are huge productions. Those will read about 1:30 or 1:00 and he approves those or says like \"Here's the changes I want.\" And then around 1:30 we have a monologue meeting which is for smaller stuff like things that are not huge productions. You know just Jimmy talking to the camera or graphic readout that can be edited really easily. And after that we do what's called a monologue rehearsal at about 3:30 where a group of tourists will come in and watch. You know Jimmy will just come out and just cas not",
      "start": 358.0
    },
    {
      "text": "be edited really easily. And after that we do what's called a monologue rehearsal at about 3:30 where a group of tourists will come in and watch. You know Jimmy will just come out and just cas not casually but he'll read a rough draft of everything. He's in a potato sack. Um he's he's actually a 900 pound man and then when when we turn on the lights he's fine. No. Um, he just comes out and he reads sort of a rough draft of everything and then from that we figure out what's in the final show at 5:00 p.m. And then the next day we start over. It's a always a crazy day. So 5:00 p.m. hits. 5 p.m. hits. We're recording. The show's recording. Yes. You immediately shut your computer down and go home. No, we write more jokes and we pitch for the next day. So what time do you go home to usually or do you go home? Do they have little CS for you that you just I wish they had cuts. There have been when we've done double tapings there have been once or twice when we've done like a five o'clock",
      "start": 392.96
    },
    {
      "text": "or do you go home? Do they have little CS for you that you just I wish they had cuts. There have been when we've done double tapings there have been once or twice when we've done like a five o'clock show and an 8:00 show just like you know something's going on or you know for whatever reason Friday's off but we're going to do two shows. I've taken an hour and slept under my desk just to like get my energy back. Yeah, you have to, I imagine. But I mean, like, they're cool about it. Like it's it's a cool job and like I'm lucky to have it. They're not walking around poking your They're not No, no, no, no. Everyone's super cool. Everyone wants to wants it to be a good show. We're all on the same team. Um because people always think that it's competitive and it's not. like it's really like people trying to help each other out. Um I usually leave probably 6:30. Okay. Oh, sounds terrible. How many writers are in the room now? Um there's if you count producers uh I think there's",
      "start": 430.32
    },
    {
      "text": "like people trying to help each other out. Um I usually leave probably 6:30. Okay. Oh, sounds terrible. How many writers are in the room now? Um there's if you count producers uh I think there's something like 18 writers. Wow. But different people do different things. Like there's people who just sort of write like the musical parody type stuff or at least focus on that. There's some people you know whose main focus is stuff like Ew you know where Jimmy plays the teen girl and there's people who do a little more monologue stuff. Everyone's allowed to pitch anything but there's people sort of have you know specialties. So when something like um like lip-sync battles happens right? How how how far ahead is that thought? Is that something Jimmy's like I we want to do this we potentially want to make this a bigger thing or was it just like hey it's hilarious that we're just going to we're going to do a lip-s sync battle real quick. It depends. I",
      "start": 462.88
    },
    {
      "text": "want to make this a bigger thing or was it just like hey it's hilarious that we're just going to we're going to do a lip-s sync battle real quick. It depends. I mean, it could be either. I mean, and a lot of things like lip-sync battle and a lot of the games are segment producers. So, those aren't writers who are doing those. Those are producers whose job like there's a guy at our show who's who has like a ton of toys at his desk and like you can see him like just trying out different you know iterations of different game ideas trying to figure out things that like he's mashing right right he's also a huge gamer like one of the guys who does that like is the hugest gamer um but a lot of it like it depends like sometimes I'll be like oh okay we're going to schedule this sometimes a guest will come in and go like I really want to do a lip-s sync battle can we do that and we're like of course you're a movie star we will do whatever you want you're at the rock you know right or",
      "start": 502.0
    },
    {
      "text": "a guest will come in and go like I really want to do a lip-s sync battle can we do that and we're like of course you're a movie star we will do whatever you want you're at the rock you know right or sometimes like people be like, \"Oh, it's been forever since we've done this.\" Um, any segment can come back for any reason, but there's no hard and fast scheduling. But so you have like uh you have skits where he plays Donald Trump, right? And you need sets for that. Yes. You have like a whole there's I mean it's a whole skit. Yeah. Um how quickly can can your like art department respond to that? They're amazing. For instance, I I saw one where it was him and the full the Fuller cast. Yeah. That was how did that how does that work? How does that come about? They build they have uh especially in 30 Rock cuz we're a skyscraper. They have to build it in little segments that they can carry in and out of freight elevators. Go. And it's like it's a lot of the crews are often the similar crews",
      "start": 534.24
    },
    {
      "text": "in 30 Rock cuz we're a skyscraper. They have to build it in little segments that they can carry in and out of freight elevators. Go. And it's like it's a lot of the crews are often the similar crews with SNL. Like it's crews that their whole life is building sets and tearing them down as fast as possible. Like if our show sounds impressive, SNL like you'll see someone ripped uh when when I was an assistant SNL like you'd see like the person sort of torn back and they're stripping them live because they're like there's like eight costume people just ripping off their clothes putting on something putting on a wig while all these uh crew members are bringing in sets and setting them up. It's that's what they do, but they do it it's almost like a fire drill. But did that specific skit like obviously you knew the cast was was going to be a part. Did that happen before that day or were you like you know what this would be hilarious as if we did this and then 3 hours later he's in a wig",
      "start": 571.76
    },
    {
      "text": "obviously you knew the cast was was going to be a part. Did that happen before that day or were you like you know what this would be hilarious as if we did this and then 3 hours later he's in a wig in in a bed talking to Uncle Jesse. Donald Trump stuff is often like that. Donald Trump stuff is often like oh this just happened. Let's do a Donald Trump today. Uh something like Fuller House I think was planned way ahead cuz they have to fly in the show right? Makes sense. That makes sense. How much is it? Sorry. How much is it Jimmy's show? Like so it's you know he how often does he come up with the jokes and the ideas and stuff like that? Well look he's there every day. He's there for meetings. Like it's not like you know you always hear these old timey stories of like Johnny Carson being like you know 60some and rolling in at 3:00 and handed a script. That's not what we do you know. Uh for he's he's always there approving or disapproving or making changes. And a lot of",
      "start": 606.64
    },
    {
      "text": "being like you know 60some and rolling in at 3:00 and handed a script. That's not what we do you know. Uh for he's he's always there approving or disapproving or making changes. And a lot of times during rehearsals he'll take something further and make it much better and then we'll add that in. So he's very involved in the process and you like I'll see him in the hallway all the time and I'll see him in meetings like I'm not like some shadow he doesn't know. Yeah. He's like, \"Oh, hey Matt. Matt good to see you. Hey Matt. Hey Matt how's it going? Why does he sound like that? And then we mic him and he sound and he has a good voice and everything. Yeah. Wow. It's crazy. What is it like to Cuz you're a writer and you know when when I wrote at IGN for instance like we kind of had a scattershot mentality where I was like I knew what I was going to write even if it wasn't the greatest thing I'd ever written was going to get on the site and people are going to read it. You guys kind of",
      "start": 641.12
    },
    {
      "text": "mentality where I was like I knew what I was going to write even if it wasn't the greatest thing I'd ever written was going to get on the site and people are going to read it. You guys kind of have to funnel all your ideas and everything to the to this to this kind of one apex where everything kind of is disseminated. You guys don't have like a lot of options. So how how is it to like how does it feel to kind of get yourself on the show? Is it is it a dejected feeling when you don't get something on the show? Do you like experience writer like writer block or have good streaks and bad streaks? I mean how do you kind of internalize all that kind of stuff and how does that feel? Cuz I imagine that's a pretty You say it's not competitive and I totally believe but at the same time I know you want to contribute and I'm definitely competitive with myself like I want to do well you know? Um you know and there's definitely days when I've had nothing on and you feel bad and it's not",
      "start": 682.4
    },
    {
      "text": "you want to contribute and I'm definitely competitive with myself like I want to do well you know? Um you know and there's definitely days when I've had nothing on and you feel bad and it's not like you feel bad cuz someone's making you feel bad. You just want to do well. It's it's an endurance challenge. It's a lot like you know I've never played sports but I imagine it's like a sport where every day obviously I've never played sports but every day you have to come in and you know you might have had you know like a bad night or you didn't sleep that well or you're sick and you still have to come in and produce ideas and you know pitch something and try to do your best. Like you can't really have like a **** it day at that job just because you know if you if you're not going to do the job there's a ton of people that are willing to do that job and they're waiting right behind you and they're right behind you on your heels. And to our show's credit they never say",
      "start": 711.28
    },
    {
      "text": "going to do the job there's a ton of people that are willing to do that job and they're waiting right behind you and they're right behind you on your heels. And to our show's credit they never say things like that but in your own head you sort of know like I need to I need to come every day and do work. This is an Emmy award-winning show for Christ sake right? Like this is the And this is what we were talking about on the on the Walk Home. Like you guys are the top of the mountain. I mean you guys are the best show in late night. I mean there's a lot of good shows in Late Night. We're also all friends with the other shows. I'm not I'm not trying to get you to talk **** but talk No but you But I'm As far as visibility goes as far as visibility it is one of the best shows on television. Well thank you. And not only that but but you guys seem to have your finger on the pulse when it comes to online as well. Like I'll be honest I can't stay up that late most of the time.",
      "start": 742.32
    },
    {
      "text": "Well thank you. And not only that but but you guys seem to have your finger on the pulse when it comes to online as well. Like I'll be honest I can't stay up that late most of the time. And if I do it's probably cuz I'm watching porn. So most of the time I have to catch it the next day or whenever it posts on online. And I It's just the **** Your shit's **** funny man. You guys are good. How's the YouTube stuff kind of changed how you write things? Or has it at all? It hasn't. Here's the thing is late night and and sketch shows like SNL and like our show or Cobar or Seth Meyers we're all very lucky that late night was built for the internet before the internet was made. You know uh other shows it's hard for like sitcoms to get good clips online. You know you have to have funny moments. But for us like there's you could go back and watch Johnny Carson moments or Jack Par moments that fit in three minute chunks you know because we started as short form. We just happen to",
      "start": 775.6
    },
    {
      "text": "moments. But for us like there's you could go back and watch Johnny Carson moments or Jack Par moments that fit in three minute chunks you know because we started as short form. We just happen to work for the internet. You know obviously we try to watch trends and we try to um you know do things that we want to do well on the internet but we're not chasing you know internet stars. We're not like, \"Okay, you know, this person did this so we're going to bake **** cupcakes on the show just to you know copy someone else.\" We're just lucky that late night works for the internet. You guys aren't trying to do any let's plays anytime soon. No I wish I wish I wish. I've I've done more and more Twitch but you know uh No I mean we'll have tech demos and stuff later. I remember that when Jimmy when he started doing that he was the first person he did he debuted which one I don't want to **** I think Last of Us gameplay right he was the first one Last of Us Returns and he plays",
      "start": 813.76
    },
    {
      "text": "when Jimmy when he started doing that he was the first person he did he debuted which one I don't want to **** I think Last of Us gameplay right he was the first one Last of Us Returns and he plays games he's a gamer whatever but I I remember when he had like Freddy Wong on and things like that that was that was crazy for me I'm like wow this guy actually is acknowledging that the internet exists and there are people on YouTube that have big audiences and he's he's open to that pretty cool and that's Jimmy like Jimmy you know he was the first host I think at least of that sort of generation you know he's relatively young he's he's you I think 40 or 41. And he kind of like okay the internet's important. The internet matters. You know we need to get you know people we need to put things out there that people want to watch online. That's a huge part of him. Do you find when people when people reference stuff that you work on are they finding it through mostly the late night",
      "start": 849.12
    },
    {
      "text": "things out there that people want to watch online. That's a huge part of him. Do you find when people when people reference stuff that you work on are they finding it through mostly the late night portal or are they finding it online? Um, I think like my dad and my dad's friends usually find it on TV they're like, \"Ah, I watch it every night.\" And then like my friends are like, \"I saw it online or someone posted on Facebook.\" Sure. Sure. That's crazy. Brave new world. Yeah. Yeah. But it's I mean it's nice. It's nice that it's working. Like it's you know we don't have to change. We came in being that way. And you who was who's the showrunner right now? Showrunner is a guy named Josh Leeb. He used to work at the Daily Show. Okay. Yeah. Okay. Cool. Do you guys write the Something I've always never understood when it comes to the late night show stuff is the interviews. Yeah. And especially like seeing when Greg would interview people on noon or whatever. It would be more like Greg",
      "start": 885.44
    },
    {
      "text": "always never understood when it comes to the late night show stuff is the interviews. Yeah. And especially like seeing when Greg would interview people on Noon or whatever. It would be more like Greg prepares he knows what he's saying he just kind of like asks a bunch of questions and then that's just the interview. But when you watch late night interviews especially when you see like the clips online or whatever it always kind of seems like there's a story being told and like it's a joke in itself where it's like they always focus on specific things and you can kind of tell that like it almost feels like they planned it before they did the interview of all right then we're going to get to this point to make this joke or whatever. Do you guys write that as well? Uh we don't write it. Uh usually what happens and sometimes it changes like the whole Nicole Kidman thing that went viral with Jimmy where she was like I wanted to go on a date with you and you asked me to play Mario Kart.",
      "start": 919.6
    },
    {
      "text": "usually what happens and sometimes it changes like the whole Nicole Kidman thing that went viral with Jimmy where she was like I wanted to go on a date with you and you asked me to play Mario Kart. Nobody planned that and that was a huge thing that just she mentioned it and he didn't know that was coming. Um, a lot of the time it's not written but it's there's a group of producers who whose job it is to call up the celebrities and say, \"Okay, what do you want to talk about? Do you have any stories you want to, you know, put in anything? How do you want to talk about your movie or your book?\" Um, and that way the celebrity or the guest feels comfortable coming in and Jimmy sort of, you know, it's not like word for word written out, but it's like, \"Oh, hey, you went on a trip recently. Why don't you tell us about that?\" and they have a funny story planned. That makes a lot of sense. Um, rarely is is anything written word for word. There's been once in a while when like there's been a",
      "start": 948.8
    },
    {
      "text": "don't you tell us about that?\" and they have a funny story planned. That makes a lot of sense. Um, rarely is is anything written word for word. There's been once in a while when like there's been a funny segment we've written for them that they've said at the table, but it's never like we're never like ghostwriting entire interviews. Yeah, I have to imagine the Oscars. I have to imagine they have to, you know, I mean, they are there as representatives of product, right? And so it probably behooves them because you say the same thing. is probably a fairly I mean I would imagine casual pre-in process where you guys are talking and saying like this is what we're going to cover this is what's going to happen like and I have to think I'm not going to call call it out but I have to think there's there's a whole publicist arm sitting in the wings going please talk about this please say this please talk about it this way um so you have to you know you're not just a star that gets to go on",
      "start": 984.32
    },
    {
      "text": "there's a whole publicist arm sitting in the wings going please talk about this please say this please talk about it this way um so you have to you know you're not just a star that gets to go on these things I mean although it's an awesome opportunity I'm sure they do want to do it but you are kind of an emissary from whatever project you're working on at the time so you have to be a figurehead for that and it changes celebrity to celebrity some people are like hey I just want to come in and do my thing and And it's like great. And there's some people who are like, I I want every beat of this planned out. That's sort of up to them. We want to make them feel comfortable. Mhm. Have you Who I don't want to get too nerish-ish, but who's who's sort of like star struck you a little bit when they walked in? Uh Weird Al meeting Weird Al It freaked me out. Um because like here's the thing is like you like I you walk in and like you know it's part of the job and you see celebrities and it's",
      "start": 1020.64
    },
    {
      "text": "they walked in? Uh Weird Al meeting Weird Al It freaked me out. Um because like here's the thing is like you like I you walk in and like you know it's part of the job and you see celebrities and it's cool like you see him in the hallway. You're like, \"Oh my god, there's like Tom Hanks in the hallway.\" And it's cool, but like it's the people who you feel are just one step away from like something that changed your life a little bit, you know, like like and Weird Al, like as a kid, I just listen to him constantly. So like meeting him and seeing him in person and getting to talk to him just a little bit was amazing. Yeah, cuz I think the first week or two you were there, you were you were tweeting out things like, \"Hey, just sitting here watching like Paul McCartney warm up.\" I saw Paul McCartney warm up, which was also really cool. That was awesome. That's one of the coolest things about Fallon specifically is it's so music focused where there's the music comedy stuff or just having the",
      "start": 1051.52
    },
    {
      "text": "warm up, which was also really cool. That was awesome. That's one of the coolest things about Fallon specifically is it's so music focused where there's the music comedy stuff or just having the Roots as the **** band. It's like get out of here that you're just one over everyone else, right? And I'll see the Roots in the hallway like I'm I'm you know like they're my co-workers at like the Christmas party. It's it's very weird. It's very weird to be there. But is there are there like stratas? Like do you talk to everybody or is it like you know you stick to the writers and No, you talk to everybody. You know you you know there's different people who have different schedules. Like a bunch of the Roots live in Philly, so they they have their own bus that they come they come in with. So, you know, it's not like it's like the Google bus. It's kind of like that. It's kind of like that, you know. So, it's not like, you know, uh we're all sharing the same office where I'm like, \"Oh, hey",
      "start": 1085.6
    },
    {
      "text": "you know, it's not like it's like the Google bus. It's kind of like that. It's kind of like that, you know. So, it's not like, you know, uh we're all sharing the same office where I'm like, \"Oh, hey, Quest.\" Like, they have they're on the other side of the floor. Hilarious. It was an open floor plan and everyone everyone had the same thing. Um, but that said, yeah, there's no walls between people. It's not like if I, you know, if I talk to Tariq, I'm going to get in trouble for it. So, like Jimmy doesn't have a thing where you can't look him in the eye or something. No, there's nothing like that. Like you touch him, you're you're immediately fired and they kill you cuz you're like you just disappear. Somewhere between 30 and like the floor one you're just He's like 6' three though. So whenever I'm tall Yeah. He's very tall. That that's Yes. Which is Yeah. I hate working with incredibly tall egotistical people. I'm sorry. I threw that last part. I was just putting that out there. I",
      "start": 1119.2
    },
    {
      "text": "whenever I'm tall Yeah. He's very tall. That that's Yes. Which is Yeah. I hate working with incredibly tall egotistical people. I'm sorry. I threw that last part. I was just putting that out there. I love you, Greg. I love you too. Love you. But he's very tall. But then we'll have Shaq on and Shaq will be like seven foot **** nine or something. Oh. Then you're like well yeah. I did walk in in the bathroom on Mike Tyson once, which was fun. Awesome. Yeah. What happened? What were you doing? Yeah, I just I just I literally went, \"Oh.\" And then like went out like, \"Oh, you're here.\" I get that all the time. Yeah. Like, thanks, Mike. Like, it's not like I wasn't allowed to be in the bathroom. I was just so surprised that Mike Tyson was pinging that I was like, \"Okay.\" That's awesome. Um, yeah, man. **** that's crazy. Yeah. And that's the thing. It's crazy. So, the question I have is more about you, Mr. Drucker. Like, was this always the goal? like when you came like when you came to",
      "start": 1152.16
    },
    {
      "text": "man. **** that's crazy. Yeah. And that's the thing. It's crazy. So, the question I have is more about you, Mr. Drucker. Like, was this always the goal? like when you came like when you came to write for Up at Noon and I was like, \"Oh, cool. We're finally putting money into like this project.\" Or not finally, I guess we're putting money into this project. We're taking it seriously. We're bringing in a real comedian, a real writer. But I never like even when I met you, I remember interviewing you and we went and ate waffles and watched the pilot at my desk. And it was like it wasn't like I got the sense that like you were always on this trajectory to get there. No, no, I definitely wasn't. Um, the way it happened was I, uh, when I was at IGN, I did a comedy festival called the Montreal Comedy Festival and I was something called a new face of comedy, which is supposed they have like 0 or 30 people that are supposed to be like the new generation every year. Yeah. I was one of them",
      "start": 1189.76
    },
    {
      "text": "Comedy Festival and I was something called a new face of comedy, which is supposed they have like 0 or 30 people that are supposed to be like the new generation every year. Yeah. I was one of them, which is very nice. And so, a bunch of people from Fallon saw me there. And then it was also the 2001 election, and I was doing a lot of jokes on Twitter about that. It just happened to be people saw me there and said I was funny. Uh, people were seeing my tweets and two writers were leaving for other projects. they were just like they had been there a bunch of years and they were ready to move on and so I was contacted and they were like would you be interested in applying for this and I was like yeah I'll give it a shot and then I applied and I got the job. So when you went off and started like cuz I guess explain to me when in your life you decide you want to be a comedian because even Nintendo is an interesting pick but you're a writer there but you're making jokes like how does this",
      "start": 1226.8
    },
    {
      "text": "like cuz I guess explain to me when in your life you decide you want to be a comedian because even Nintendo is an interesting pick but you're a writer there but you're making jokes like how does this path start? I always liked comedy a lot. I didn't know I wanted to be a comedian. I thought I was going to be in high school. I wanted to be a computer programmer. I wanted to program video games. You? Yeah. And I was terrible at Well, our I went to a high school that had a technology program, but the it was so underfunded and our programming teacher just didn't show up sometimes. And so we just played Unreal Tournament all like for two years, which is great, but I didn't learn anything about programming though. We even took AP programming and literally everyone just walked out. Like we opened the book and we were like we don't know this. And we just left. And in Florida, they were paying for it for you, so you weren't losing money on it. Um, and so I wanted to be a writer for a while",
      "start": 1262.16
    },
    {
      "text": "the book and we were like we don't know this. And we just left. And in Florida, they were paying for it for you, so you weren't losing money on it. Um, and so I wanted to be a writer for a while after that. I was like if I can't program, maybe I'll be a writer. I didn't know how to do that. So, I went to NYU and became an English major. And then around my junior year, people were always like, \"Oh, you should try comedy. You should do it. It's fun.\" And so, I tried it and I stuck with it. So, walk me through the first time where you had the balls to actually get on stage and do and do uh uh standup because you're still doing standup. You're still you're quite an accomplished killing across the country every night. Yeah. Um, Louis CK says he doesn't want to follow you ever. Louis CK I he followed me once on a show at Whiplash at UCB in New York and it was terrifying. Uh, cuz he was cuz uh there's this theater called Upright Citizens Brigade Theater which is like a sort of they say",
      "start": 1300.4
    },
    {
      "text": "he followed me once on a show at Whiplash at UCB in New York and it was terrifying. Uh, cuz he was cuz uh there's this theater called Upright Citizens Brigade Theater which is like a sort of they say it's an indie theater but it's like a huge improv theater. It's sort of like the equivalent of Second City in New York. It's like the Groundlings, right? Exactly. And they have a show called Whiplash. Uh, which is now hosted by Aparna. We were talking about Aparna. Um, and I went up and I had a good set and then I came out and Louis CK was up after me and he was like, \"Hey, good job, man.\" And I was like and I just said no words and I just ran away. I was like, God that I was so nervous. Like I was so nervous cuz that show is like a drop in show. It's like a show where like, you know, they'll schedule like mid-level people like myself and then like highle people like Louis or Aziz and Sari will just like drop in and **** get on stage. That's crazy. Yeah. So, what at what point did you",
      "start": 1335.76
    },
    {
      "text": "schedule like mid-level people like myself and then like highle people like Louis or Aziz and Sari will just like drop in and **** get on stage. That's crazy. Yeah. So, what at what point did you do were you like standup terrifying, I'll do it? Um, I just wanted to do it. It was, you know, it's the same with writing where you're like, I'm maybe I'll suck at it, but at least I can say I tried doing it and I knew that I sucked versus being the **** who's like the funny guy in the office who's like, yeah, I could have done comedy. I didn't really feel like it. Right. I would I would rather fail and know that I tried than never try. So, how long did you have to do it before you were like, I'm actually pretty okay at this. I can hold my own. Uh, four or five years. Yeah. You know, you get like little boosts of confidence. It's like you'll have one set that goes well and it's like every time you think that you're about to be not done doing it like you'll quit but you think like this is",
      "start": 1371.36
    },
    {
      "text": "like little boosts of confidence. It's like you'll have one set that goes well and it's like every time you think that you're about to be not done doing it like you'll quit but you think like this is the best I'll ever be and I'm great at it and then you'll suck for a while and you'll like I can't do this then you'll rise back up a little better than before then you'll be like I'm the best at this then you'll suck again and it's sort of going up and down in waves. It's just your job to make sure that the up waves are better than they were before. That seems like a lot of pressure. It's a lot of pressure but you know it's also paid off and it's just a thing where the longer it's like writing. The longer you do it, the better you get at it just by doing it. And the key isn't that to know anybody. It's just to not quit. Like we all know people who are more talented than us that quit doing what they're doing and then we got to get those jobs because they stopped doing it. Sure. Yeah. You",
      "start": 1408.64
    },
    {
      "text": "It's just to not quit. Like we all know people who are more talented than us that quit doing what they're doing and then we got to get those jobs because they stopped doing it. Sure. Yeah. You know, so then you when you get poached by this Fallon guy and basically sync up at noon single-handedly. Yeah. You were going to do the show kept going for two years. Two years. Still it's still going. Good point. Still going. still going the show that I sung. Uh you go but you're going just to do the Late Show with him. Yeah, it's not the Tonight Show. Did they ever tip their hand that that's what it was going to be or like um maybe four months into it they were like we might become the Tonight Show. Um but the way they said sort of said it was like we're not sure this looks like it could happen. And at the time I was like all right well I'm still trying to figure out if I can do this job right? You know I was still you know worried that every 13 weeks I'd get laid off. Not because that they",
      "start": 1444.64
    },
    {
      "text": "And at the time I was like all right well I'm still trying to figure out if I can do this job right? You know I was still you know worried that every 13 weeks I'd get laid off. Not because that they were doing that to people, but that's how our contracts work. Oh, really? You have 13 weeks. 13 weeks. Interesting. Which is standard for late night. Still terrifying. Still terrifying. Yeah. Um and then towards the middle of the year, they're like, \"No, we're definitely becoming the Tonight Show.\" We're like, \"Oh, crap.\" And we had all these meetings about what we do. And then we had to switch studios while they renovated our main studio. And but my desk stayed the same. Like like I I got a new contract, but I think I was basically paid the same. It just had like a different show title on it. Sure. That's hilarious. How much did the job actually change then? Not much. Um, we, you know, it's a little more like at the start of it, I think they were more like, \"Hey everybody, like I know we",
      "start": 1486.24
    },
    {
      "text": "Sure. That's hilarious. How much did the job actually change then? Not much. Um, we, you know, it's a little more like at the start of it, I think they were more like, \"Hey everybody, like I know we know you're working your hardest, but just try to be sure you're working your hardest because we want to, you know, this to do well.\" But everyone's job description stayed the same. You know, we all tried to put in a little more effort, I guess, just to make sure we were doing well. But nothing really changed. Did this. So, the style didn't change at all. Style didn't really change. The staff didn't change. My desk is the same. Um, everything pretty much stayed the same, which I think is good. M I think uh I think that NBC liked Jimmy at late night and they wanted Jimmy at the Tonight Show and if we had if we had changed we would have been ruining the reason that we got the Tonight Show. God that was a crazy time though. That must have been a very stressful time for for Jimmy as well cuz",
      "start": 1520.24
    },
    {
      "text": "if we had if we had changed we would have been ruining the reason that we got the Tonight Show. God that was a crazy time though. That must have been a very stressful time for for Jimmy as well cuz there was a lot of speculation. It was super stressful. And Leno was like Yeah. Yeah. Maybe I'll quit, maybe I won't. Yeah he was he was supportive of it which was nice. That's cool. So, you know, we were able Yeah. Yeah. I mean, back here on the sidelines watching you soar into space like the shooting star you space. That was the crazy thing is like it was like mindboggling that somehow. So I remember the joke always was that you were talking about in your interview that they talked about the um Duck Hunt bit you and Brian did that it's like and it like Jimmy had seen that. Yeah. Jimmy Jimmy can't believe Jimmy watched this crappy show we do. You know what I mean? And then so it was crazy that you're going to work for Jimmy Fallon on this late night show or whatever and then it became",
      "start": 1556.96
    },
    {
      "text": "can't believe Jimmy watched this crappy show we do. You know what I mean? And then so it was crazy that you're going to work for Jimmy Fallon on this late night show or whatever and then it became the Tonight Show and we were all like what the **** Yeah. Yeah. Well, you know, but you have that pedigree though. You came from SNL as well. I came from SNL. I was an assistant who was writing update jokes and getting update jokes on so and doing and I wrote for the SPS with Seth. So So and you were working directly under Seth Myers. Yeah. There. Yeah. So I mean it's like I mean I think the most important thing is that you're really funny on Twitter. Thank you very much. So everyone should follow him. Mike Drucker. Thank you guys. Mike Drucker. Every single time there's an award show on like the Academy Awards, I'm like I'm going to sit down and I'm going to live tweet and I'm just going to say the first thing that comes and then I get caught up with his **** Twitter and I just keep",
      "start": 1599.36
    },
    {
      "text": "the Academy Awards, I'm like I'm going to sit down and I'm going to live tweet and I'm just going to say the first thing that comes and then I get caught up with his **** Twitter and I just keep reading it and I'm like I forgot. Oh well it's fun. I appreciate it. I just they just come in like these waves even without like the actual timely stuff. Like usually you'll post a joke and then you'll post another one and then another one. Like three just backtoback totally unrelated things. I'm like, \"Fuck, these are all funny.\" I I just think it's cool cuz it's like I just have this vision of you just kind of like just cranking **** out just like yeah funny now here's some more funny like yeah and it's fun for me. I like I like writing jokes. Sometimes I do have this desire to call you and just ask if you're doing okay. Yeah. No sometimes sometimes I'll also be like drunk and depressed on Twitter and just start spouting out crazy stuff. But I like that. I like building that persona",
      "start": 1632.56
    },
    {
      "text": "just ask if you're doing okay. Yeah. No sometimes sometimes I'll also be like drunk and depressed on Twitter and just start spouting out crazy stuff. But I like that. I like building that persona out there too. It's there. The depressed comedian. The depressed comedian. I like Well cuz you know cuz I want to be able to do myself. And the nice thing about Twitter too is like for the Tonight Show I'm writing in Jimmy's voice and Twitter is me writing in my voice, you know, and the two aren't the same voice, you know, and it's nice to be able to like, you know, I get to do music for one band, but then I get to do music for this band. You know what I mean? Like it's it's it's a way for me to and it's not like a stress relief thing. It's just like a okay I have a funny idea but it's it wouldn't work over here. So, are you concerned at all or do you like how do you how do you partition it all out? Because when you're when you're ranting on these jokes on Twitter, some of which are",
      "start": 1669.52
    },
    {
      "text": "wouldn't work over here. So, are you concerned at all or do you like how do you how do you partition it all out? Because when you're when you're ranting on these jokes on Twitter, some of which are hilarious. It could be really really funny bits. When you go to do standup, do you keep some back a little bit? You're like, well, you know what? I'm not going to put that out cuz that's hilarious and I kind of want to develop that or No, I you know, I've turned Twitter stuff into standup. I I'm not worried about that. You know, if someone like I don't like being You sent that on Twitter eight months ago, right? No, no, no, no. I mean, there's standup that from like four years ago that I still do. Standup's a little more like of a like a building a performance like a you know not a oneman show which sounds shitty but like just sort of building a performance and things and a library of things and a way you you act it out. Um are you concerned that someone else would come around and be",
      "start": 1703.2
    },
    {
      "text": "show which sounds shitty but like just sort of building a performance and things and a library of things and a way you you act it out. Um are you concerned that someone else would come around and be like that's a really funny joke I'm going to steal it. It's happened you know but it's it's something that you call that person out then you just keep writing. You know you sort of build two defenses. You build a wall of content that you make yourself and then you go all right **** you. I'm going to go after you and it's not like I'm going to sue you, but I'm going to make sure that I, you know, I know that you stole that, right? And everyone knows that you stole that. Yeah, I was going to ask you about that cuz that seems to be kind of in the zeitgeist right now with with comedy with uh what's that guy? The uh the guy with the on Instagram. The fat Jewish. The fat. Oh god, the fat Jewish. I hate that dude. And and like and but but you see that a lot with people stealing jokes. I",
      "start": 1734.24
    },
    {
      "text": "uh what's that guy? The uh the guy with the on Instagram. The fat Jewish. The fat. Oh god, the fat Jewish. I hate that dude. And and like and but but you see that a lot with people stealing jokes. I remember even back in the day Seth Rogan taking the stage and accusing um Damian Carlos Yeah. Joe Rogan. Oh who would I say? Seth Rogan. I think I knew who you meant. I'm sorry. Joe Rogan. Uh but like doing it on stage like right confrontational sort. I mean obviously this probably been going on for decades I'm sure but was a big offender. But yeah but what like what is that? What is that like as a comedian? Like cuz I do think it's kind of taken lightly like oh the meme was stolen and it's it's you know but like no one would steal like if you steal a cord you know a chord progression from a band or whatever like people are going to call you out after So what is like why is there an exception or seemingly people want to make an exception for a joke but it's it's just so much",
      "start": 1765.04
    },
    {
      "text": "from a band or whatever like people are going to call you out after. So what is like why is there an exception or seemingly people want to make an exception for a joke but it's it's just so much thought and talent to me. It's different you know like then like a chord progression like it might be something like oh like we had similar ideas and like or someone like heard an idea I said and they like wrote a joke on a similar concept like you know on like dating or something and that's that's harder you know to go after but it's sort of like you know when Vanilla Ice stole the beat of Under Pressure you know then you're stealing a whole beat that goes to something and that's more of what joke stealing is like. It's like okay well maybe you rewrote it or you had it your own way but you also took this whole chunk of it. And there is also a difference between like oh we have the same idea. Did you take my idea? And oh that's word for word for word. Yeah. Schumer's uh Schumer had some",
      "start": 1809.2
    },
    {
      "text": "took this whole chunk of it. And there is also a difference between like oh we have the same idea. Did you take my idea? And oh that's word for word for word. Yeah. Schumer's uh Schumer had some problem with that. Yeah. The last like two or three weeks ago. I don't think Schumer still I think I mean some of those jokes are jokes that you you're like I think a lot of people could have come to that. Yeah. And that's where the speculation comes in right? When you're writing a variety show you're doing skits it's like how hard is it to pull right? that someone would do a skit skit that revolves around a club that revolves around like you know I I mean I don't know any specific examples. There was one guy who went after Conan and he was like he's like \"He stole my jokes. I tweeted this and Conan did this and you saw the jokes and you're like \"Yeah we we did the same joke.\" Because you'll sometimes hear a topic especially for monologue and it's not like \"Oh this is lazy.",
      "start": 1843.36
    },
    {
      "text": "this and Conan did this and you saw the jokes and you're like \"Yeah we we did the same joke.\" Because you'll sometimes hear a topic especially for monologue and it's not like \"Oh this is lazy. This is a joke.\" But like sometimes you just land on the same joke. There was one time when four monologue writers including myself uh uh or four writers writing for the monologue wrote the almost the exact same joke about Hillary Clinton. And it was like a joke involving Bill Clinton. It wasn't even a great joke but we all like like we're all like \"Oh man I can't believe my joke made it.\" And they're like \"No it's mine. It's mine.\" And he just all four of us happened to land on the same idea at the same time. **** hilarious. And that happens too. Sure. Well especially since you guys are all like you have to be experts on what's happening in the world right? So your job is to stay up on politics on current events on pop culture and that's always probably sitting there",
      "start": 1874.88
    },
    {
      "text": "guys are all like you have to be experts on what's happening in the world right? So your job is to stay up on politics on current events on pop culture and that's always probably sitting there cranking in the back of your mind of like \"That's funny that's funny. Oh that boom that's it and that's there.\" And you have to imagine that everyone's as hungry as you are to get something on the show. Of course. Yeah. That's crazy. Yeah. Yeah I couldn't even imagine it. It's hard cuz it's it's hard just to even when you're doing when you're talking in a in a podcast setting and you say something and then you realize 0 minutes later you're like did I make that up or was that a mo was that something from a movie I saw in the '80s? It's always the answer for you. Usually the 80s cuz I'm completely I don't think you've ever said something that wasn't somehow a quote from an 80s movie. That's probably true. It's usually just Catty Shack. Yeah. Um that's nuts though. That's got to be",
      "start": 1908.32
    },
    {
      "text": "completely I don't think you've ever said something that wasn't somehow a quote from an 80s movie. That's probably true. It's usually just Catty Shack. Yeah. Um that's nuts though. That's got to be hard. Yeah. So then what's the future for you? I don't know yet. Um I I'm doing a podcast now called How to Be a Person. plugging it. Kevin put it up. Put it up. Put it up with a Tonight Show writer named Jess Dwick. And we Greg's been on it. Greg was great on it. We teach people how to do human things cuz we're both social cripples. Can I Oh I see. That's the joke. I was going to say if you want to do a show called How to Be Human and your first guest was Greg. You're a little off. He talked about like how to like start a web business. Okay cool. So we sort of understand. I was like get Nick. Nick will do all the adult things for you. Um um but we've had people like how to make friends or how to travel alone or like you know my brother did how to live abroad because he's lived in",
      "start": 1940.72
    },
    {
      "text": "Nick. Nick will do all the adult things for you. Um um but we've had people like how to make friends or how to travel alone or like you know my brother did how to live abroad because he's lived in different countries. That's really cool. Um yeah and then we're doing another podcast for Earwolf with a Daily Show writer named Trayvon Free about Hamilton. So we're doing a whole podcast about the musical Hamilton which I never thought I would do. An entire podcast Hamilton. did a trend recently where people do podcasts just based on something very very very very very specific. And it's like I I just Well it's nice because you can do it cuz you can because you can do a finite number of episodes. You know what I mean? Like with How to Be a Person it's just an ongoing project. With Hamilton we're like \"Oh we'll do this for a while. Then we when we're done we're done and we can just have done a nice project.\" And Hamilton's also great. I don't know if you guys have listened to it.",
      "start": 1977.76
    },
    {
      "text": "we're like \"Oh we'll do this for a while. Then we when we're done we're done and we can just have done a nice project.\" And Hamilton's also great. I don't know if you guys have listened to it. Listen to it on Spotify. I get no money from saying this. Colin should listen to it. Listen to Hamilton. Now you see you've given us money. You're you're a big supporter of us on patreon.com/kindafunny to do a topic where Colin has to listen and review Hamilton. Yeah I will. That'll be that'll be a treat for all of us involved. Indeed. Yeah Ducker's topics are the are the best. Thank you very much. Yeah for some reason people know you've done you you're the one who submitted Heartthrob for us. Thro were behind the NES music quiz. You made me embarrassing hair video. Be amazing. Well because I know you guys. Like I don't not like I don't want to know about your lives but I know about your lives from having worked with you. Like I'm not going to be like \"Hey Nick what's marriage like? I",
      "start": 2012.32
    },
    {
      "text": "you guys. Like I don't not like I don't want to know about your lives but I know about your lives from having worked with you. Like I'm not going to be like \"Hey Nick what's marriage like? I got divorced. I know what marriage is like.\" Fair enough. You know I want you I want to put you guys under high pressure challenges that ruin you. So in other words you want to embarrass the show. I want to embarrass you in friendly ways. I just when when those topics were read I just imagined you way on the East Coast cut to like maybe a day or two earlier and just hitting enter on that and just laughing your ass off likely and then going and doing a really **** Exactly. Cuz you're a baller. I love how you're like a day or two earlier. You have no idea how our Patreon system works. We're still like calling through six months of drunker time. Fair enough. Fair enough. Because if you didn't know ladies and gentlemen this is the GameOverGreggy show. Each and every week four",
      "start": 2054.56
    },
    {
      "text": "We're still like calling through six months of drunker time. Fair enough. Fair enough. Because if you didn't know ladies and gentlemen this is the GameOverGreggy show. Each and every week four sometimes five best friends gather around this table. Each bring a random talent discussion for your amusement. If you like that head over to patreon.com/kindafunny where you can get the shows early along with exclusive access perks and episodes. If you have no bucks to toss us though you can go to youtube.com/kindafunny. See the show put up topic by topic dayby day until the entire thing posts as one big MP3 and video. Tim yes. What's your topic? So last week we went down to Austin Texas and it was awesome. It was good for you. You weren't there. I wish I wasn't there. You would have enjoyed it. It would have been It would have been Have you ever been to Austin Texas? I have. I like Austin. Yes you do. Um and I wanted to talk kind of about what we did. We went down to see Rooster",
      "start": 2089.36
    },
    {
      "text": "it. It would have been It would have been Have you ever been to Austin Texas? I have. I like Austin. Yes you do. Um and I wanted to talk kind of about what we did. We went down to see Rooster Teeth. We did a lot of collaborations and stuff. I want to talk about that experience that we had from everyone's perspective specifically Nick and Colin because me and you we've been there before. We see you know we're pounding bro. It ain't our first time. We know how that that all goes. But Colin someone not really familiar with Rush's content. And Nick someone who you know likes making movies and likes the whole production stuff but hasn't seen their studio and stuff. I kind of want to hear what you guys' experience was there. Uh it was cool. It was interesting seeing how they operate cuz in many ways it's actually like you like to think about what anyone's doing on the internet as cutting edge but when you actually start breaking it down what they're doing is very similar to",
      "start": 2129.44
    },
    {
      "text": "cuz in many ways it's actually like you like to think about what anyone's doing on the internet as cutting edge but when you actually start breaking it down what they're doing is very similar to how Hollywood sort of started which was that you have a lot of people who have a distribution outlet who are then going to get talent underneath them and then start cranking out awesome stuff. And in that regard it's it's it's really trippy to see because my my understanding is like if you want to make a movie you have there's so many moving parts of it. You have to find a financier you have to develop the project you have to get talent involved you have to figure out who's going to direct who's going to edit who's going to shoot it. They want to do something and it's all inhouse. It's **** crazy. And walking in seeing the fact that they take up like four airplane hangers full of production they have their own animation division they have their own live action they have their own",
      "start": 2167.76
    },
    {
      "text": "crazy. And walking in seeing the fact that they take up like four airplane hangers full of production they have their own animation division they have their own live action they have their own broadcast division all these things. They can do anything they want. And it's trippy. And they have makeup people. And that I think is the sign of when you've actually made it big. You can actually hire makeup people. Put makeup on you. Yeah. If Kevin put makeup on me uh you know what? I'm not going to say what I was going to say. I feel like you're the prettiest though. Like you need the least makeup. Kevin's not very coordinated though. He doesn't He doesn't break anything. But I just feel like if you were to put makeup on me I would look a little like the a cross between a clown and a prostitute. I used to work at a lotion place. You did. You worked at a locks of town. Yeah that's right. For one Valentine's Day than makeup I a whole day learned how to apply makeup on. And you're",
      "start": 2205.68
    },
    {
      "text": "prostitute. I used to work at a lotion place. You did. You worked at a locks of town. Yeah that's right. For one Valentine's Day than makeup I a whole day learned how to apply makeup on. And you're just now telling me this. We've had you in our employee for an entire year and you could have done my makeup every day that I walked through the door. Shame on you. Shame on you Kevin. So so Rooster Teeth has had a makeup getting back on topic. They've had a makeup person forever. Like that. Like that to me is not the mind-blowing thing. Like to me what's mind-blowing is No but I mean that I mean that's cool that like to you that that is that is a big deal. But like to me what's a big deal is they now have a whole building for sets just to build sets. I mean they have their own art I mean it's it's crazy. They have their own art department. They have their own production designer they keep on set wardrobe on it's not on set. Excuse me on staff. So that's what's crazy to me is you look",
      "start": 2242.88
    },
    {
      "text": "it's it's crazy. They have their own art department. They have their own production designer they keep on set wardrobe on it's not on set. Excuse me on staff. So that's what's crazy to me is you look like when I think of all the things that I want to accomplish with this company and you go and you see a company out there that's doing it. very inspirational and that's what I took away from that was that there are a group of people that by and large if you would go to Hollywood and ask to be able to do these things people would shut you down. There was so many gatekeepers to that success. They don't care and they do it anyway and they just and they and they figured out a way to make it work. And that's what I think is the most impressive thing is that like like we walked in and it was a fully functioning studio. Yeah. like similar to like probably on a much smaller scale but similar to what they they do on the Tonight Show which is like there is a whole division of the company that",
      "start": 2287.52
    },
    {
      "text": "functioning studio. Yeah. like similar to like probably on a much smaller scale but similar to what they they do on the Tonight Show which is like there is a whole division of the company that does the set. When an idea happens boom that set designer's there that production designer's there they they put it together they wheel it into the studio and they're ready to rock and roll. Um and I just find it so fascinating that they've got this ecosystem there where creative ideas can just kind of flow quickly quickly from top to bottom too. I think that's the most interesting thing is like they can do every they can make an entire movie just using what they have and then get it out there without having to rely on other people and not even just movies. They can do podcast. They can do live streams. They can do gameplay stuff. They can do animation all just using what they have you know and they can use you know use outside resources and talent and stuff but they already have",
      "start": 2324.64
    },
    {
      "text": "live streams. They can do gameplay stuff. They can do animation all just using what they have you know and they can use you know use outside resources and talent and stuff but they already have the whole foundation. Yeah. I mean it it reminds me on a micro scale of like a Disney right? what Disney has like they're very it's a very multiaceted company with very with with just anything you want to do that has anything to do with production whether it be animation uh live action TV internet music whatever it is they've got that inhouse or they can develop that very very quickly and get it out weird to think that we could potentially be on a scale like that one day just and it's also run by children every everyone like seems to me that they're so young that I'm like I don't understand. Do you understand what I'm saying? And they're like yes I'm 4. I get it. I understand what you're saying. Like I own a house. Right. I'm like **** That's right. You're also live in a place",
      "start": 2359.12
    },
    {
      "text": "Do you understand what I'm saying? And they're like yes I'm 4. I get it. I understand what you're saying. Like I own a house. Right. I'm like **** That's right. You're also live in a place that's easier to own a house. That's true. But um yeah but that was my perception. It was awesome. It was awesome that we got to go down there and it was great seeing also um you know cuz up until this point the only people that I have consistently uh generated contact content with has been you guys and IGN. And so seeing how Rooster Teeth does it and going down there and getting to do some stuff with Achievement Hunter and getting to be on some of their other shows and just seeing the the the different vibe and how they make content which is fun. It's good to and it keeps you sharp too. You're like \"Oh wait. These guys are like \"All right these these guys are doing **** man. I got a bunch of different stuff.\" **** game face. Something people keep asking us for is a list of all",
      "start": 2405.68
    },
    {
      "text": "like \"Oh wait. These guys are like \"All right these these guys are doing **** man. I got a bunch of different stuff.\" **** game face. Something people keep asking us for is a list of all the stuff that we did while we were down there. So Kevin I'm going to get you links but can you make sure that they're put in the description? Um we did about 10 different maybe no not 10 maybe like six or seven let's plays with Achievement Hunter. Yeah those are not live yet. I don't know when those are going live so there won't be links for that. Michael's just going to delete them cuz I look too good in them. They were good. They were they were good let's plays. I think the best let's plays we've ever been a part of cuz they were like really fun. Um I was on Off Topic which is the Achievement Hunter podcast and that was awesome. Greg was on the Patch which is their general gaming podcast. You were on that with who? I was on that with Gus and Meg. Yeah. And Ryan I guess too.",
      "start": 2440.8
    },
    {
      "text": "Hunter podcast and that was awesome. Greg was on the Patch which is their general gaming podcast. You were on that with who? I was on that with Gus and Meg. Yeah. And Ryan I guess too. And then because we did the book club too where it's where I get hairy because I did the the their book club for Life is Strange afterwards. And then you and Greg and Nick were on On the Spot which is their their game show. Their kind of like improv comedy game show right? And that I think is the funniest thing kinda funny has ever had to be a part of. Like that was a blast. Are you familiar with this the show that they do? No I haven't seen I I mean I know Rooster Teeth. I haven't seen this though. Right. They I mean this is the crazy thing is you walk in and they're like \"Okay you're going to do this this this.\" I'm like \"How many **** shows do you guys do? This is insane. How do you keep it all straight?\" And they have they figured out. But one of the shows that I got to be on was On",
      "start": 2474.16
    },
    {
      "text": "do this this this.\" I'm like \"How many **** shows do you guys do? This is insane. How do you keep it all straight?\" And they have they figured out. But one of the shows that I got to be on was On the Spot which is basically like a It's a game show but it's largely predicated on improv and kind of like a longer form game show. And it was a blast. Oh that sounds fun. It was just super fun. You'd be great on If you're watching Rooster Teeth Mike Ducker at Twitter. Oh you'd be awesome on it. It's actually Mike Trucker. Whatever. Whatever. Greg that show would have made me really nervous. Bruce team tweets at Twitter. Like what? They pitted Nick versus Greg which I thought was awesome cuz I thought you guys were going to be on a team together. Well that's that's a great idea. And uh so they pit them against each other. So it was Nick with Barbara and then Greg with Blaine. And I was just like man this is going to be **** drew dicks on somebody. We did find out. Yeah. Did I",
      "start": 2510.88
    },
    {
      "text": "so they pit them against each other. So it was Nick with Barbara and then Greg with Blaine. And I was just like man this is going to be **** drew dicks on somebody. We did find out. Yeah. Did I take my shirt off? You're goddamn right. Yeah. No question about that. Got to keep the street going. Uh yeah that was actually really fun because at first I'm like this we have a good camaraderie no matter what. But you being antagonistic against me is always when we're at our best. Yeah. I think definitely because you know exactly what to say to set me up for something. And that was and I and I know what not to say. There was a few things where I was like no that's too far. I was telling Blaine I'm like I got a great one. No. Cuz we were like doing team names and **** I'm like no that's too far. I can't do that. That was um And then we also did Colin did one no news update video. I did one no news update video and I think that's it. Those were fascinating because when they I was there",
      "start": 2547.28
    },
    {
      "text": "far. I can't do that. That was um And then we also did Colin did one no news update video. I did one no news update video and I think that's it. Those were fascinating because when they I was there when Ashley was like \"Hey \" because you were the first one. Can you do the no video and you're like \"Yeah.\" And I was going to yell stuff from off camera like \"Okay.\" Then we went over there and they went on so long and I was like \"Oh this is so much different than what I thought it was.\" I thought this was an IGN News break where you pop up for 10 seconds say your paragraph and you're out. And it was instead for that. Here's what the story is. Substantive. Here's all the history on it. Here's all this more information. And I was like damn that's cool. That's a lot. That's a deep dive that I was not expecting. Yep. Not at all. And we also we recorded lines with uh a bunch of receive people for kinda funny the animated series. So that was really exciting. Which I'm gonna hit",
      "start": 2578.88
    },
    {
      "text": "dive that I was not expecting. Yep. Not at all. And we also we recorded lines with uh a bunch of receive people for kinda funny the animated series. So that was really exciting. Which I'm gonna hit Ducker up after this. He's going to probably I'm going to make him do lines too. Yeah please. We're going to do lines. You don't have to make Ducker do lines. Ducker and I do lines many many times together but usually in New York at 3:00 in the morning. Wait what are we talking about? Cocaine. Yeah I do cocaine. I do not I wish I would not have this body if I did. I I would not be able to thin. I would be I would just be worried about I'm not suggesting that for anyone. Put a warning on the screen. Don't do cocaine. I say it all the time. They don't listen. Am I allowed to tell people to put things on the screen? I don't know how to do that. Someone put it on the screen. Someone do something with the screen at some point. What did you think of it? I think that was all the show. Yeah.",
      "start": 2612.88
    },
    {
      "text": "put things on the screen? I don't know how to do that. Someone put it on the screen. Someone do something with the screen at some point. What did you think of it? I think that was all the show. Yeah. Yeah. What' you say? What did you think of it? Um so I think that I was impressed. I thought it was really interesting. Sorry. Uh where did he where did he? Um so I think one of the weird things that people or like kind of one of the kind of the strange things about me I think in being in this industry for so long is that like I'm just not a consumer of games media at all. Like I I I just I've always been a voracious consumer of games and game culture but I don't listen to a single gaming podcast. I never have. I don't listen to I don't watch any YouTube videos. I've never seen a Let's Play like before we started doing them. Like I just don't really care. And like I think that that's like that's not how I enjoy gaming right? And so I always thought like one of the interesting things",
      "start": 2650.32
    },
    {
      "text": "like before we started doing them. Like I just don't really care. And like I think that that's like that's not how I enjoy gaming right? And so I always thought like one of the interesting things that I think surprisingly worked from the outside is that I brought in different perspectives of what I thought these things should look like. So when we did Podcast Beyond I just did Podcast Beyond thinking this is the way a PlayStation podcast goes or a video game podcast goes not really knowing what a video game podcast was. And lo and behold Podcast Beyond was huge. And then we do the same thing with Games Cast and with PS I Love You which are both huge as well. So I think that works cuz I bring in a perspective like I'm more of a consumer of like sports miscellaneia and like politics and acade academia like and like what are they doing and what how can we bring that into games? So I say that just to to set the stage similar to our games trailers and with Brandon Jones where like",
      "start": 2690.96
    },
    {
      "text": "and acade academia like and like what are they doing and what how can we bring that into games? So I say that just to to set the stage similar to our games trailers and with Brandon Jones where like like where I was like I just don't know this stuff at all. So I'm going to sit back and listen and learn about this because I really don't know what this guy did and like what these guys did and how they made success. So the same thing was with Rooster Teeth where I was like well I I know these guys exist. I've not watched a single one of their shows, cuz I know these names and stuff like that like Achievement Hunter and Funhaus and stuff but I just don't I'm not familiar with it. It's just not my thing. And uh what I learned was that you know first of all these guys are this is a huge company, 16 employees, um which is amazing. And uh of last week it could have gotten like 10 more, right? They're growing like crazy. And what I learned was that like there's just a there is a uh",
      "start": 2726.64
    },
    {
      "text": "company, 16 employees, um which is amazing. And uh of last week it could have gotten like 10 more, right? They're growing like crazy. And what I learned was that like there's just a there is a uh there's so I tweeted about this and actually retweeted it which I thought was cool which is to say like it shows how humble our little operation is and how our ceiling can be very high as well. Um and it's exciting. It was exciting and interesting and kind of thoughtprovoking and educational to be there and see how these guys that like live and breathe this stuff within the bounds of this industry as opposed to kind of like existing in it in the way I exist in it which is more of like a I love games. I play games. I know games. I'll put my gaming knowledge against anyone's, but I just don't consume games peripheral games media the way other people do as opposed to these guys which are kind of setting the trends of what games media is and doing all these kinds of things. And I was very",
      "start": 2758.8
    },
    {
      "text": "consume games peripheral games media the way other people do as opposed to these guys which are kind of setting the trends of what games media is and doing all these kinds of things. And I was very impressed, you know, like like I never want our company to look like theirs simply because they're way too big, like way bigger than I'd ever want to be. And they and they do like a lot of stuff that is is peripheral even more to like what we do. So like they like I didn't even know what Ruby was until like I've seen that before. I didn't know how to say it, RWBY. whatever. I don't know what the **** that is, but but like, you know, that's like their that's like part of their bread and butter, man. Like now like they have a **** ton of animators just working on that series. I had no idea it was even an anime. I I like even even when they said it, I was like, \"All right, so Ruby's like this little cute cartoon they do. I guess it's really popular.\" I was like, \"It's an anime.\"",
      "start": 2797.12
    },
    {
      "text": "no idea it was even an anime. I I like even even when they said it, I was like, \"All right, so Ruby's like this little cute cartoon they do. I guess it's really popular.\" I was like, \"It's an anime.\" That's interesting. Okay, so like and and you know, they do these like shows like I thought the um Million-Dollar Butt Like that's like **** funny, man. Million dollar. A million dollars but I was like that's a really funny that's a really funny idea, you know? or um uh you know even knowing names and knowing faces like uh Meg uh Tony like I knew that name but I didn't even know she worked there like it was like it was like f so like I just I'm very ignorant about a lot of this **** and it was cool to just be quite enthralled with listening to that I didn't do much talking when I was there I just like listened and and took it in and and tried to learn a thing or two and tried to see how these guys that are just way better than we are at doing this and way more experienced and way more",
      "start": 2832.72
    },
    {
      "text": "I just like listened and and took it in and and tried to learn a thing or two and tried to see how these guys that are just way better than we are at doing this and way more experienced and way more seasoned what they could teach us and and uh uh you know what we can kind of garner from them to make our operation better and stuff. So as much as I think one of the great strengths of Kinda Funny and from my perspective is bringing in outside influences Colin and Greg Live of course is always a great example of that which is not inspired at all by anything like gaming has ever done. Um at the same time these guys have their own ideas on the flip side that are quite ingenious for being within the realm of gaming. And I thought it was I thought it was fun to to to learn. And I thought that they were also super nice people, super down to earth people. I not met I I know I know Bernie and a few of the other people there. Obviously we know Ashley because we worked with her, but you know",
      "start": 2871.68
    },
    {
      "text": "they were also super nice people, super down to earth people. I not met I I know I know Bernie and a few of the other people there. Obviously we know Ashley because we worked with her, but you know I didn't I didn't know these people. I always thought they were quite friendly, quite accommodating, quite hospitable, um quite successful, quite good-looking, too. thing that that so despite from being Yeah, you're good looking though, Nick. Yeah, but here's the deal. You walk around there and it's all I'm not going to show. Show me the ice cream, Scoobies. You're just You're just Hey, watch this. Watch him flex. Flex it. Jesus Christ. Look at him. Look at my baby boy. Oh, yeah. You hate being asked that so much. Sorry. Don't make me show my muscles. But I I I do want to say this real quick. Uh talking about Achievement Hunter specifically, I didn't I didn't know I knew these guys were very obviously because of their name suggest very Xbox focused, very popular. Uh didn't really know",
      "start": 2906.96
    },
    {
      "text": "Uh talking about Achievement Hunter specifically, I didn't I didn't know I knew these guys were very obviously because of their name suggest very Xbox focused, very popular. Uh didn't really know their products. Didn't really know them even by face until I I had met them there. And I found those guys to be **** hilarious and and like I like we didn't get to meet the Funhaus guys. I know you guys know them. I I don't know them. But like I really liked them. Like I thought that they were super funny and like my mind was bogged down as it always is with weird **** and like you just kind of forget what's going on. I was just I was hysterical like laughing with them like like playing these games like they're that seemed like a specifically a very fun group to work with. I think I agree. I think our their let's plays just **** on our let's plays like in terms of like in ter like they really do. I'm just being honest like like it's not even a **** joke. It's like very honest. It's",
      "start": 2948.64
    },
    {
      "text": "I think our their let's plays just **** on our let's plays like in terms of like in ter like they really do. I'm just being honest like like it's not even a **** joke. It's like very honest. It's not even a joke though. It's like like we have so much to learn from these people and that's what I I I walked in there. It's nice to be able to walk in and just record something and leave and disappear, you know, like not have to worry about the technical **** They're kind of somewhere in the middle because they do have syndicators, but like and people that worry about the like the minutia, but they still have to like, you know, kind of sync everything. So it's it's I don't know. I I really liked them in particular. I think that they were really **** funny. And um I enjoyed those videos. I just think that, you know, being so ignorant about the way games media is produced outside of what we've done, sometimes intentionally so, but sometimes because it just doesn't speak to me. And",
      "start": 2985.36
    },
    {
      "text": "I just think that, you know, being so ignorant about the way games media is produced outside of what we've done, sometimes intentionally so, but sometimes because it just doesn't speak to me. And so, like, I want to kind of be true to myself and bring in some other ideas that I think makes our stuff more dynamic. And I really do think that is a strength. Um it was cool to kind of be in a more endemic space uh with people that were doing games and being like wow this is so kind of next level like this is kind of uh this is you know we talk about you know GameSpot and Kotaku and IGN and all these have a future anymore. And when I see you know like a future in the way that they were when we were there and maybe now and when I see this kind of stuff I'm like I don't know man because like like you know like I'm just being honest I'm a writer like through and through like I don't want the written word to die. I don't want the traditional way to die, but it's just like this is **** huge",
      "start": 3014.32
    },
    {
      "text": "you know like I'm just being honest I'm a writer like through and through like I don't want the written word to die. I don't want the traditional way to die, but it's just like this is **** huge, you know? Like the the the like the warehouse space was impressive. The production was impressive, but it was really just the way things worked and the symbiotic relationship between the moving parts. I thought it was I I learned a great deal. It was quite thoughtprovoking. Yeah. With the Achievement Hunter specifically, like I really like that their whole thing is collaborative effort and it's like they they want to make sure that they're let's plays. It's just about all of them being a part of it and all of them just having fun. We are way more educational. We're way more. What do we think about this video game? We're doing less. We show you something new. Three out of the four of us. Your Xenoblade Chronicles review was amazing. Yeah. No but even if we're not reviewing things though, the",
      "start": 3052.88
    },
    {
      "text": "this video game? We're doing less. We show you something new. Three out of the four of us. Your Xenoblade Chronicles review was amazing. Yeah. No but even if we're not reviewing things though, the way we play games we're we're kind of like looking for the fun parts. We're trying to like, you know, you put up the Fallen Legion today, right? And it's me announcing that it's a VA game. It's me trying to explain to you what's happening. It's you and me trying to understand how the systems work. It's not us like just ah we're playing like let's talk. And even if we go into both. No for sure. Entirely. Entirely. But it's just it's a very it's a different thing. They're literally just using the games as an avenue to have fun. Exactly. They're just purely making entertainment. And uh what I really really enjoyed about us being there and doing stuff with them like all four of us just instantly got their vibe and just met them in the middle and it worked. Like we found our place with them",
      "start": 3086.96
    },
    {
      "text": "really enjoyed about us being there and doing stuff with them like all four of us just instantly got their vibe and just met them in the middle and it worked. Like we found our place with them and also understood, all right, cool. This is their thing. We could do that, too. Here's our version of that thing. And we could all work together. And I think that that's like a very powerful thing that you can't just drop anyone in with that group of guys and just have it like Kevin would have been eaten alive. He would have just been eaten alive. They wouldn't he wouldn't know what to do over there. No Kevin would have fit right in because he's he's right in their perfect demographic of like 3 to 5 hardworking homeowners. Those guys are I don't know. I I really liked them and I liked everyone that we met at. You know I thought uh you know just being able to speak with Bernie again was really nice. is a really ideas driven dude, really smart, just **** sharp, you know what I mean? And",
      "start": 3123.84
    },
    {
      "text": "that we met at. You know I thought uh you know just being able to speak with Bernie again was really nice. is a really ideas driven dude, really smart, just **** sharp, you know what I mean? And uh uh you know I you know Lewis was really like there was just a lot of really like I just learned a lot. It was it was if you go in with an open mind. It was similar to my experience at VidCon before we found Kinda Funny where I was just like well I don't know this space. I'm not even sure I really belong in this space sometimes, but here I am. And so I'm going to learn I'm going to learn something about it. And like um and so I did. And I think that it was it was cool. I was I was glad I went. I don't know how much, you know, how often we'll we'll go back and and do more with them, but I'm I'm eager to like peel the next layer back and kind of learn more about, you know, the way they do things and stuff like that. It's not a business that I want Kinda Funny to mirror",
      "start": 3160.8
    },
    {
      "text": "them, but I'm I'm eager to like peel the next layer back and kind of learn more about, you know, the way they do things and stuff like that. It's not a business that I want Kinda Funny to mirror personally down to the nitty-gritty of what they do because I think it's so far-flung in ways that would just give me **** you know a if I had to deal with that as a as a you're at the you're at the you're at the edge of the ga this chasm and like there's 10 years of history there. It wasn't that all of a sudden it went from being in Bernie's spare bedroom to all right, we have 16 employees. No of course not. Of course not. But but you know I do I do think that they were they're smart enough to invest in in things that you know well it's very similar to the animated series like we're we're doing something that's different. It's much cheaper than making Ruby um and much less popular. Who knows if it will be popular one day, but but uh but",
      "start": 3196.32
    },
    {
      "text": "similar to the animated series like we're we're doing something that's different. It's much cheaper than making Ruby um and much less popular. Who knows if it will be popular one day, but but uh but it's but it's interesting that it seems like that's actually maybe even more important than anything else they do, you know, in terms of in terms of like their in terms of their like their capital investment in terms of the people they employ like the space that's taken up the mind share of that of Ruby just being everywhere the way they talk about it pictures everywhere. I'm like this is interesting because this is not the way they were founded. is not what they were founded to do, you know? You know I don't know that they did that kind of stuff like that. And that's the thing is like they they were made to to make uh animated whether it's machinima or not. Like Red versus Blue was animated before Ruby was the thing. And I think Ruby was the natural progression of all right we will",
      "start": 3232.16
    },
    {
      "text": "they were made to to make uh animated whether it's machinima or not. Like Red versus Blue was animated before Ruby was the thing. And I think Ruby was the natural progression of all right we will never own the Halo characters. Like they they license the rights to use them. So they do legally own the ability to use the Halo characters, but with Ruby from top to bottom that's theirs, you know? And so I think that was the nice natural progression for them. But yeah that Ruby didn't happen until eight years or more than that. Like 10 pretty recent 10 or 11 years into them existing. Yeah. And I do think that I didn't realize that the gentleman that passed away, Monty, he was the one that came up with that that was his show. So that that it's just the tendrils the way things connect. Like I'm like I didn't know any of this. Yeah. So they hired him to so he did all like Metroid or not Metroid um Halo and all the like just random the Dead Fantasy like fighting videos. And Bernie was",
      "start": 3265.04
    },
    {
      "text": "I'm like I didn't know any of this. Yeah. So they hired him to so he did all like Metroid or not Metroid um Halo and all the like just random the Dead Fantasy like fighting videos. And Bernie was like, \"Fuck, we need this **** Like this is awesome.\" So they hired him on for season 8 of Red Versus Blue. And he kind of gave Red Versus Blue a kick in the ass of like you guys know it is just two dudes talking back and forth and just like moving video games. Monty came in and animated fight scenes and made them **** crazy over the top things. So Red Versus Blue season 8 n 10 was that. And then Monty was like he pitched them on an anime which was Ruby and they're like let's do this cuz you know now that that kick in the ass Red versus Blue got it needs another kick in the ass to keep it more relevant. And so they did other stuff, but Ruby was really like it just kicked it off for them. And that launched their entire animation division. It's not just Ruby it's they have a show called",
      "start": 3304.96
    },
    {
      "text": "relevant. And so they did other stuff, but Ruby was really like it just kicked it off for them. And that launched their entire animation division. It's not just Ruby it's they have a show called X-Ray and Vav which is a comedy superhero show and then they have animated adventures which is just their like um podcast moments animated and stuff, but like that whole animated section it's not just Ruby. Like they're working on like six shows. And plus there's other stuff that's not announced yet that I don't know. Yeah. Like that's just **** crazy. Yeah it's cool. It's It was a very Yeah like I said a very, you know, being so ignorant of what they do. Um I couldn't be any more ignorant about what they did before I went there. So it's not like, you know, it's not like I knew anything cuz I really didn't. But it's it's it's eye opening like that. I understand more why people like this kind of stuff. Like we always said like with let's plays. I think Greg and I even talked about",
      "start": 3343.2
    },
    {
      "text": "cuz I really didn't. But it's it's it's eye opening like that. I understand more why people like this kind of stuff. Like we always said like with let's plays. I think Greg and I even talked about it candidly on PS I Love You in other places before which is like I don't understand why anyone would watch a let's play. Like and I've said that a million times like it's just like you know like I would rather just like play a game or watch game unfettered gameplay. But there's this subculture not a subculture it's a massive culture of gaming that does like watching this **** And it wasn't until I w I never really watched a PewDiePie video. I have no idea what the **** he does. Like but like when I w when I did with Chiban I'm like, \"Oh this is **** funny.\" Yeah. Yeah. You know like I I like I I get it. You know I watch like Angry Nintendo Nerd or whatever you know or Angry Video Game or whatever his name is and like that stuff's funny but that's that's kind of different.",
      "start": 3376.8
    },
    {
      "text": "I I like I I get it. You know I watch like Angry Nintendo Nerd or whatever you know or Angry Video Game or whatever his name is and like that stuff's funny but that's that's kind of different. That's also like kind of really feature more than anything. Yeah. And that's like pre- let's play almost like I remember watching that in college I think. So I think that's like that's old but um so it's like I understand some of like you know more of the educational thing or more of the sarcastic thing or the you know whatever. um satirical thing. But yeah like it started things started to click with me more. I'm like I get it. Like it's it's uh I don't I don't mean to be close-minded about it. It's just things that I don't know if that I I even am being. It's just a matter of what interests me and like you know I like I'm impressed with the way ESPN like I think ESPN does really impressive stuff and so like I want us to more like look like that. But then I realize like",
      "start": 3408.96
    },
    {
      "text": "what interests me and like you know I like I'm impressed with the way ESPN like I think ESPN does really impressive stuff and so like I want us to more like look like that. But then I realize like well these guys are doing **** that looks like that too, right? You know so it's like it's like it goes it goes to the core of how they started, right? And when you have the IGN the GameSpots I mean those are media outlets. Those are those are for first and foremost information. Where these guys started where I think was the harder harder road, but proving I think to be much more um I don't know if sustainable, but potentially more lucrative is that they started out by making an entertainment product, right? And it started out by entertaining people first and foremost. Um which is always sort of the line I feel like we we skate here a little bit because we are sort of a hybrid of that model. We do come from IGN, but at the same time most of the stuff we do here is for the sheer",
      "start": 3440.56
    },
    {
      "text": "sort of the line I feel like we we skate here a little bit because we are sort of a hybrid of that model. We do come from IGN, but at the same time most of the stuff we do here is for the sheer entertainment value of it, right? Yeah. With the exception of the PS I Love Yous. And well I guess our pod this podcast notwithstanding all of our podcasts are kind of more of an IGN style project. No I wouldn't even say that. I think PS I love you I think is the only thing to call Colin and Greg Live kind of. No you know it started off by the way and now it's just pure shenanigans. But Gamescast Games Cast is not really talking about news. Yeah but then like when we go into talking about big topics or whatever that's happening. Yeah it all goes back to I mean like to you know what Colin's saying of not understanding what a let's play would be. So he didn't know, right? Like my whole career and what I do and what this has become in a lot of ways, right has always been that I'm the",
      "start": 3476.24
    },
    {
      "text": "saying of not understanding what a let's play would be. So he didn't know, right? Like my whole career and what I do and what this has become in a lot of ways, right has always been that I'm the best friend on the couch in the basement talking to you about games, right? And when I I'm talking to you about games I'm specifically talking about when I introduced I was telling Po why Spider-Man on PlayStation one was so good, right? And that's what I my let's plays are too, right? I'm showing you the Fallen Legion because it's this new VA game and this is why it's cool. You know what I mean? And that's why it's cool to go to Achievement Hunter and see them do it in a different way where it is it's what we used to do where it was to tower fall out in the living room. We're all being a bunch of **** or whatever. Even the hot pepper challenge, you know what I mean? We are experimenting with that, but we're so far to the other side. Whereas they don't ever come to our side and do that",
      "start": 3514.08
    },
    {
      "text": "of **** or whatever. Even the hot pepper challenge, you know what I mean? We are experimenting with that, but we're so far to the other side. Whereas they don't ever come to our side and do that where it's like hey we're playing Far Cry Primal for the first time. Let's talk about what's happening. Well see that's what's interesting for us is the that they have the No which Ashley started when she left IGN and went over there. And before that they had nothing that was like IG or GameSpot. There was no video game news. There was they no product that even did that at all. Um I mean the patch the patch existed but it was still in its early days. And then once the no game that's now they're really and now Funhaus as well. Like Funhaus is kind of us on the other side where they do have that kind of game critic journalism mind but they're also like we're not critics or journalists. Um and they make entertainment. So it's it's just weird. But it's cool cuz all of that can coexist and",
      "start": 3548.0
    },
    {
      "text": "that kind of game critic journalism mind but they're also like we're not critics or journalists. Um and they make entertainment. So it's it's just weird. But it's cool cuz all of that can coexist and simultaneously next door they're making movies and TV shows and you know HBO quality stuff and that's **** crazy. And like that's the whole thing too is their whole subscription model and their their their plans for the future like what they see the internet becoming. It's not just oh we're going to Laser Team was a movie we made. We're going to make more movies. It's we're making movies but we're also doing daily live shows that are all different with different sets and different experiences. We're also doing all the gameplay videos. You know there's animated shows. There's comedies there's dramas there's this. It's like they're becoming It's not just uh like oh they do comedy and stuff. It's they're like a TV channel. Yeah. That has all types of different program. Oh no. See",
      "start": 3583.6
    },
    {
      "text": "dramas there's this. It's like they're becoming It's not just uh like oh they do comedy and stuff. It's they're like a TV channel. Yeah. That has all types of different program. Oh no. See that's why that's why I liking them more. Not even a channel not even a network, right? They're more like a studio. They're more like hey we're developing everything. And it's and even even coming in and like bringing people like us in to collaborate with them and stuff like that is very much studio- minded of saying like oh let's reach out to outside talent bring them in have them on our products and stuff like that. But, you know, and being able to cross those lines like that, it is it is crazy. It's crazy to think where they're at now and they're where they might be 5 years from now. Yeah. And I think I think that the thing to keep in mind is that people hear this like, \"Oh, they're getting too big. They're getting too big.\" And it's like they're doing too much. It's not the same guys",
      "start": 3622.4
    },
    {
      "text": "And I think I think that the thing to keep in mind is that people hear this like, \"Oh, they're getting too big. They're getting too big.\" And it's like they're doing too much. It's not the same guys making movies that is playing games that it is, you know, making cartoons. Like, they have teams. And when you see it, it's even in the in the buildings, it's separated. Like, they're the live action team and the animation team are in completely different buildings. Right. And and to Colin's earlier point, like yeah, you know, I kind of agree that that that looking at that size of a company right now is daunting given where we're at, but you have to also remember that they the founders have gone and now kind of are taking care of just their own little slice of whatever they really they wrote they wrote their own their own uh check as far as what they wanted to be able to do. So Bernie takes care of a lot of the live action development. Gus is doing a lot of the events and things like that.",
      "start": 3656.88
    },
    {
      "text": "wrote their own their own uh check as far as what they wanted to be able to do. So Bernie takes care of a lot of the live action development. Gus is doing a lot of the events and things like that. And they don't really it doesn't seem like they interact too much unless they absolutely like their paths cross or they have to be on a show together. But so that's that's the cool thing is they've been able to gravitate toward what their strengths and their passions are. And you know Jeff's obviously strength was was uh or passion was Chief Hunter. So he gets to just sit around in that room all day and crack jokes and **** around with the guys. And it's it's and that was a blast and it was a very you can kind of see how Kinda Funny can evolve that way too. It's like with you and Greg doing the more like videoy stuff, me and Nick doing the more comedy stuff and then **** collaborating whenever it makes sense cuz that is there is a Venn diagram and it's not exclusively this or that but",
      "start": 3689.28
    },
    {
      "text": "the more like videoy stuff, me and Nick doing the more comedy stuff and then **** collaborating whenever it makes sense cuz that is there is a Venn diagram and it's not exclusively this or that but it is just growing in different ways and I think that's a very cool future that I'm excited for. Yeah, I think a more immediate takeaways would be like, you know, it was cool to see um them have a space and like the ease in which talent and I use I don't I hate calling myself that because I think it's a **** shitty word, but the the so-called talent of It's definitely a loaded word, that's for sure. The so the so-called talent like being able to just kind of come on, have a free and clear head to do what you need to do and just walk away is like really cool. Um and I don't say that as like trying to be lazy. I say that is like it's exhausting talking about games and talk about anything, you know. But what I also what I like just to have be on and like have your mind right and not have to",
      "start": 3723.6
    },
    {
      "text": "to be lazy. I say that is like it's exhausting talking about games and talk about anything, you know. But what I also what I like just to have be on and like have your mind right and not have to worry about the setup and blah blah blah blah blah and like you guys have to edit and all, you know, it's like a **** pain in the ass. Um, so like I took that away, but also um just that like punditry is like way more universal than I think I gave it credit for. And like the um you know the way people talk about games in a real deep way is very similar way to you know the way they talk about politics on YouTube or on MSNBC or Fox News in the same way that ESPN or Fox News or whatever that's been talked about sports. So it's there's a lot of cross-pollination happening there um already. Um, I'm surprised. I'm still surprised that like some ideas haven't been stumbled upon more um from these other spaces that I think are so obvious, which is why I love Colin and Greg so much. Even though it's",
      "start": 3763.44
    },
    {
      "text": "I'm still surprised that like some ideas haven't been stumbled upon more um from these other spaces that I think are so obvious, which is why I love Colin and Greg so much. Even though it's something we don't like put a super amount of effort into, like it's it's it's a it's still a fun and silly show that you know that I actually think out of everything we do has the most growth potential. So, it's like so it's it's um it's cool to see like people spreading their wings and like kind of doing those kind of things. I found it quite inspirational to be there. Yeah. Nick, yes. What's your topic? All right. Uh, my topic is Batman. Ah, this week's Batman. I don't know if you guys are familiar with Do you know, have you ever heard of Batman? Uh, Batman. Am I pronouncing that right? I believe so. Yes. Batman. Um, there was a quote going around that Christian Bale said last week um that I believe originated on Yahoo. I'm not quite sure. I'm on I9 right here. You can you can check it out on",
      "start": 3803.52
    },
    {
      "text": "so. Yes. Batman. Um, there was a quote going around that Christian Bale said last week um that I believe originated on Yahoo. I'm not quite sure. I'm on I9 right here. You can you can check it out on I9, but I think they link back to that Yahoo where he says quote uh basically Christian Bale says he didn't quite nail Batman in the Dark Knight trilogy. Okay. Are you guys familiar with this at all? Yes, I remember the Dark Knight trilogy. What is his argument against himself? That's like what is he present your evidence against yourself? The the article reads, \"While on out on public publicity for the latest movie, The Knights of Cups, Christian Bale has expressed some second thoughts about his portrayal of Bruce Wayne/Batman for Chris Roland's The Dark Knight Trilogy. When interviewed for Yahoo Movies, Bale noted that he didn't quite capture the extent to which Bruce Wayne was messed up. This isn't the first time that Bale has said that he's slightly jealous of Ben Affleck's",
      "start": 3842.08
    },
    {
      "text": "for Yahoo Movies, Bale noted that he didn't quite capture the extent to which Bruce Wayne was messed up. This isn't the first time that Bale has said that he's slightly jealous of Ben Affleck's opportunity to play the character in this month's uh Batman v Superman: Dawn of Justice. Uh, quote, \"Batman, he's this is he's this very very dark, messed up character. I found when I put on the suit, I feel like a bloody idiot if I didn't use this as a means of his true monstrous self uh that he allows to come out in the moment.\" He went on to note that Heath Ledger completely upended all the plans when it came out to portrayal when it came Sorry, excuse me, upended all of his plans when it came to portraying the character. That's not really all that much of a surprise given how much of a messed up character the Joker is. Looking back, Bale noted that he didn't quite accomplish what he wanted to with the character, but ruled out ever reprising the character again. Enough's enough. We did our",
      "start": 3880.72
    },
    {
      "text": "up character the Joker is. Looking back, Bale noted that he didn't quite accomplish what he wanted to with the character, but ruled out ever reprising the character again. Enough's enough. We did our thing. Quote, well, I'd say that Batman's always upset with how he did his Batman. So, that makes him a good Batman because he's upset with how he did his Batman. Nailed it, Christian Bale. You know what I mean? Like, in comics, Batman's always like, \"You idiot, you could have done this better.\" So, being upset with how you did his Batman is very Batman. I don't know where he I don't know where this pull quote came from, but he says, \"Heath turned up and just kind of completely ruined all my plans because I'm like, he's so much more interesting than me. What am I doing?\" Yeah. And that's from the the article. They put in a weird spot. Oh, I see. Okay. I broke it out in a weird thing for you. So, I guess that is the quote of of in question. I mean, it's uh definitely not a new argument, I",
      "start": 3916.72
    },
    {
      "text": "the the article. They put in a weird spot. Oh, I see. Okay. I broke it out in a weird thing for you. So, I guess that is the quote of of in question. I mean, it's uh definitely not a new argument, I don't think. Right. It's interesting to hear him say it. He says, you know, he turned up and ruined everything. I think most of the time when you talk about like the when people talk about the Dark Knight in particular, right, of like I think that's the best one in the trilogy, right? And of course people who want to say it isn't like it's just be it's a Joker movie. It's not a Batman movie, right? And even going forward it's like well yeah the interesting parts are usually the other characters. Well, and that's also I was trying to go for a more realistic Batman. The problem with going for a more realistic Batman is you can't have this like you can't have sort of, you know, if you like Zack Snder or not, Zack Snider is going to do a more comic booky Batman. And if you're trying to be",
      "start": 3949.52
    },
    {
      "text": "a more realistic Batman is you can't have this like you can't have sort of, you know, if you like Zack Snder or not, Zack Snider is going to do a more comic booky Batman. And if you're trying to be realistic, you can't just be an **** and break people's wrists every scene cuz that's not what would happen in real life. Yeah. Um I think he did fine as Batman. I didn't hate his Batman. I didn't like the third Batman movie, but that was a whole Okay, look at this. Are we friends on that? Yeah. Is that an unpopular opinion of this **** over here thinks it's the best one? I don't think it's the best one, but I definitely say God for sure. No, Colin does. Colin is the leader of the Dark Knight Rises team. I I don't know you guys. Yes, brother. Yeah. Yes, brother. To be fair, we don't know if Colin is just **** with Greg the entire time and Colin will never tell us, so it doesn't really matter. So, it's not even worth speculating. But, I mean, that's such an old But the point being, I",
      "start": 3985.92
    },
    {
      "text": "Colin is just **** with Greg the entire time and Colin will never tell us, so it doesn't really matter. So, it's not even worth speculating. But, I mean, that's such an old But the point being, I don't think he was a bad Batman. No, I don't think he's bad. No, no, no. Like, I think he did. I mean, I agree that Heath Ledger outshown him in that movie, but at the same time, he was so great as the Joker. I think any Batman would have been, you know, second banana to that Joker. Do you feel like he's I mean obviously this fairly recent quote I I guess came from Sunday, but do you feel like he he's looking now at the trailers of what you know Snyder and the team are accomplishing and seeing that Batman and seeing that character? Do you think maybe he's like maybe that would have been a better way to play it? I don't think so. I think he's seeing I think he's seeing a more fleshed out Batman. Like I think think about it that way. What you're getting with Ben Affleck, at least just from",
      "start": 4023.28
    },
    {
      "text": "way to play it? I don't think so. I think he's seeing I think he's seeing a more fleshed out Batman. Like I think think about it that way. What you're getting with Ben Affleck, at least just from the trailers, right, is a Batman with motivation. And since he has this motivation, he has this justification to brand people with this bat, right? And **** like you saw the fight scene, you know, from that one trailer like to be the Batman from the comics/video games you think about when you're Batman. Whereas like when you think back to Begins was fun cuz it was like all new and what's happening. He's dropping. But he's even like like the League of Shadows stuff they were doing, right? Some of some you see so much of that now with Arrow or whatever. And it's I'm not saying those fight scenes are better, but they're different, right? And it's more it's not unique anymore. Batman Begins with in at the time was unique because remember this was the first time Batman could turn his ****",
      "start": 4060.56
    },
    {
      "text": "are better, but they're different, right? And it's more it's not unique anymore. Batman Begins with in at the time was unique because remember this was the first time Batman could turn his **** head. Yes. Right. And it's not just have the cow like this or whatever. He was a he was fluid. He was moving. It wasn't it was all of a sudden this brand new fighting style. I think there's also a lot to be said about professional humility where even if you think you did well, you're like, \"Oh, I'm you know being polite to the next person in the role. I'm not trying, you know, someone's like, \"Do you think you'd be a you were a better Batman than he will be?\" And you're like, \"Of course not.\" Even if you think it, you're going to be professionally humble. That's not necessarily the case. But I also want to, you know, put out that's not like Christian Bale being like, I **** up. This is terrible. It might just be him being like, I believe this will be a good movie and uh I still want to have",
      "start": 4097.2
    },
    {
      "text": "want to, you know, put out that's not like Christian Bale being like, I **** up. This is terrible. It might just be him being like, I believe this will be a good movie and uh I still want to have friendly relationships with all these people, so go see the movie. Got to see him at the Academy Awards and whatnot. Uh that that probably makes more sense when you put it in that context and that light of him saying, \"Look, there's always obviously more than one way to play every role.\" What's interesting is him saying that, you know, he wanted to do more of the dark stuff, right? And how messed up Bruce Wayne should be and Batman should be. And that's the thought of where I think he says that you know Heath upended his plans, right? You imagine his plans were to try to show that a little bit more in the films, but you get there and Heath Ledger's Joker is so dark that you can't go that way. You can't I don't think you can get down into the mud and be the Batman we know from the comics who",
      "start": 4128.08
    },
    {
      "text": "in the films, but you get there and Heath Ledger's Joker is so dark that you can't go that way. You can't I don't think you can get down into the mud and be the Batman we know from the comics who calls himself Batman. You know what I mean? He isn't Bruce Wayne. He's Batman and that's what's happening in his head. Yeah. I mean, you have those scenes where he he you have those intense moments where, you know, you see Batman screaming at someone or interrogating someone or throwing people off a freaking roof and things like that and it just you're you're right though, it doesn't have even, you know, half the intensity of like the any any Joker scene. Sure. Anytime Joker's there, you're like the the level of tension just rises to about 90%. So, it must be interesting to go back and look at that because again, I'm I'm with you. I think it did a great job. When I when I think Batman Begins, when I think Dark Knight, I'm like, those are phenomenal movies. I can't imagine they would be any",
      "start": 4160.08
    },
    {
      "text": "that because again, I'm I'm with you. I think it did a great job. When I when I think Batman Begins, when I think Dark Knight, I'm like, those are phenomenal movies. I can't imagine they would be any different. I can't imagine plugging anyone in there. And as and as much as I am excited for Ben Affleck's Batman, I'm less excited for, you know, Jared Leto's **** Joker. Like, I mean, you have to you're comparing yourself to Heath Ledger's Joker is comparing yourself to the greatest movie super villain of all time. You're never going to win. Like, let's see how like how do you think Christian Bale's Batman would do against like Letto's Joker, which looks terrible. He just looks like an **** Like he doesn't look he looks like an he looks scary in the way like seeing a teenager in the middle of the night you're like I'm not a teenager anymore. He might attack me as scary but like he doesn't look like a super villain. Do you know what I mean? You know what I mean? No I don't. You're",
      "start": 4196.16
    },
    {
      "text": "of the night you're like I'm not a teenager anymore. He might attack me as scary but like he doesn't look like a super villain. Do you know what I mean? You know what I mean? No I don't. You're like oh no it's a youth like and you're scared of that but I'm not **** scared of him on some global scale the way I'm Heath Ledger's Joker. Right. I mean for me the verdict's still out on that one. We have to we have to Yeah. We have to see Suicide Squad or you know whatever. Do you buy into the theory? I forget. What's your comic acumen? You a big comic fan? I like how Yeah. Are you Do you buy into this theory that it might be Jason Todd? Um, sure. I mean, I don't know. It als I mean I don't love Zack Snder. I should Sorry. No, that's fine. So, I mean, I know that Suicide Squad is not his movie, but I just don't know what hand he had in it and what he's going to paint it as. Sure. Um, sure it could be, but I I don't know yet. I I my whole thing with the the Jared Leto being Jason Todd and",
      "start": 4232.16
    },
    {
      "text": "but I just don't know what hand he had in it and what he's going to paint it as. Sure. Um, sure it could be, but I I don't know yet. I I my whole thing with the the Jared Leto being Jason Todd and that being him. I mean, I know there's like the the Robin suit with like bullet holes in it or something or whatever you um it just it's an interesting way to dodge not being compared to Heath Ledger, right? That you're not the Joker Joker. There was a Joker and he got killed, but he had already tortured me and made I hope that's it, man. That sounds that sounds so great to me. If they do that, I mean, that'll be like such a holy **** are you committed to this cinematic universe that you're just going to put into a movie that the Jason Todd's Joker and then we want you to figure out the Joker's gone and dead. Exactly. It's not coming back. And that way in Justice League can bring it back and we'll be like, \"What? necessarily dead and it's Heath Ledger like whoa the long long game on that",
      "start": 4268.72
    },
    {
      "text": "gone and dead. Exactly. It's not coming back. And that way in Justice League can bring it back and we'll be like, \"What? necessarily dead and it's Heath Ledger like whoa the long long game on that one. Jesus Christ. They really kind of pulled that out of their pocket. I just made a Heath Ledger death joke. I apologize everyone. It's not your first one. It won't be your last one. I just don't understand his his line of thinking just in the sense that Batman to me has never been about Batman really. I mean ever since the be ever since '89 Batman like I just don't feel like I mean yeah Batman was a central character to Batman. It's not a huge surprise there but it always seemed to me it was about these ancillary characters these villains. I mean was always for the villains right? Yeah always. I mean, it was, you know, the Joker and 89 Batman Returns, you know, you have the Penguin like like and then you get into the shitty **** shoe marker ones and all that kind of stuff. But the",
      "start": 4304.48
    },
    {
      "text": "I mean, it was, you know, the Joker and 89 Batman Returns, you know, you have the Penguin like like and then you get into the shitty **** shoe marker ones and all that kind of stuff. But the villains were still, I think, even more in those than any other ones were the draw because they were they fit like Freeze and Riddler and all these kind of fit in this over the top campy ass **** Batman. They did it. But like his it does I actually kind of agree with what what Ducker's assertion that this seems to be maybe a hum like a humility kind of nod in the sense that like there is no prayer that this movie is anywhere near the Nolan movies in terms of quality. So like so like it's like like not even a **** prayer that that's going to happen. So like you know you're like you know you're fine and you're always going to be looked at as being the Supreme Batman from the Supreme Batman movies and that's not going to change. So, like I don't understand why. See, that's the argument. See",
      "start": 4337.84
    },
    {
      "text": "fine and you're always going to be looked at as being the Supreme Batman from the Supreme Batman movies and that's not going to change. So, like I don't understand why. See, that's the argument. See, that's the thing is I don't I'm with you that yeah, the you know the Nolan movies are on another level because they were going for something different. But I think when you think back to the Nolan Batman films, you're going to think back to Heath Ledger. That's what I think. Yeah, that's I don't think people look at him as the Supreme Batman. He was definitely in the Supreme Batman films. I think about Tom Hardy. Tom Hardy personally. Oh, of course. Of course. But I also I don't think he did a bad job. It never bothered me. That's the plan. All right. That's your That's your choice. Okay. All right. I'm sorry to interrupt. No, that's No, I mean that that's that's my thing, though. And one and and that maybe that's a good way to kind of frame this is when when you actually think about the",
      "start": 4373.6
    },
    {
      "text": "right. I'm sorry to interrupt. No, that's No, I mean that that's that's my thing, though. And one and and that maybe that's a good way to kind of frame this is when when you actually think about the like the the ranked order of Batman. Batman's what would be grammatically correct? Batman. It would be Batman's a proper noun in uh Kevin Conroy. Kevin Conroy is that the name of the voice actor from the animated series. You have to um giant jump down. Um, uh, I don't know. After that, it sort of I got to get I give it to Bale by default. I got to go Keaton. The Keaton thing. I'll never understand this Keaton thing, man. It He's really good. I guess he's a like that those movies are really cool. Really great. That's not Batman. That's I mean, if that's Batman, that's like uh it's the the cartoony like not anime series, like cartoony Batman. Oh, and like that's fine. That's cool. But I don't know. I when I think Batman I I want I think Dark Knight Returns Batman or at least like darker Batman.",
      "start": 4408.72
    },
    {
      "text": "like not anime series, like cartoony Batman. Oh, and like that's fine. That's cool. But I don't know. I when I think Batman I I want I think Dark Knight Returns Batman or at least like darker Batman. Yeah. But I mean there's just different eras of it. Like when you think when I think Batman in the 1989 I lump that in with the whole series of movies like that includes Beetlejuice, you know, where you're like these are just really kind of creative almost asinine ridiculous versions of these. But there was an underlying **** up creepiness to all of those films. Like you go back and watch Beetlejuice and you're like there's some dark **** in this. This is not a kids movie. And the 89 Batman came off like a kids movie, but you've got the Joker doing some **** up **** in that. And Jack Nicholson was pretty terrifying. Not on the level of Heath Ledger, but he wasn't. I don't think he was trying to play the character that way. I don't think he was a bad Joker. Like that was a good",
      "start": 4453.84
    },
    {
      "text": "Nicholson was pretty terrifying. Not on the level of Heath Ledger, but he wasn't. I don't think he was trying to play the character that way. I don't think he was a bad Joker. Like that was a good job. Batman Returns is just full of sexual innuendo. Oh yeah. Jesus. Returns is **** awesome. Returns is Yeah, it's a beautiful movie. But with the little rockets on them, hell yeah. That was weird. But that that's what I'm saying is like that's straight out of a comic book, right? Straight out of a comic book. Yeah, exactly. Um, did you think of a name for that villain yet? No, it's me, the bear. Would your What would your villain be? Gr. Let me work on it. I I'll get back to Gregman. No, I Gregman. Sonic. Greg. Sonic. Son of Greg. I don't know, man. Figure it out. I will. Um, yeah. I don't know. I would I would probably agree with that assessment. Conroy's first. Conroy's first. Conroy's got to be first. I would put I would put probably Keaton and then you got to give a nod to",
      "start": 4495.2
    },
    {
      "text": "I don't know. I would I would probably agree with that assessment. Conroy's first. Conroy's first. Conroy's got to be first. I would put I would put probably Keaton and then you got to give a nod to Bale. Bale after that. Yeah I say Bale is before Bale. Then maybe Adam West. It's one of those like it's one of those it's the normal column argument of like what's the criteria I guess you know what I mean like that's the problem because I think that Bale does so much right in terms of like Batman in terms of movement in terms of this you know what I mean in terms of Bruce Wayne too but that's my thing though I would disagree with that but he's not cuz Michael Keaton was a weirdo but that's the whole point is like is like sorry can you you you take this one I mean like I don't understand like he like Bruce Wayne summed up as that party when he walks in on him and he they're like trying it's a Knox and Vicky Veil They're arguing about where this is from. He's like \"China.\" Like \"How do",
      "start": 4534.4
    },
    {
      "text": "he like Bruce Wayne summed up as that party when he walks in on him and he they're like trying it's a Knox and Vicky Veil They're arguing about where this is from. He's like \"China.\" Like \"How do you know? That's where I bought it.\" You know what I mean? And he's like \"Hi Bruce Wayne.\" Like it's that's a good Bruce Wayne. Don't get me wrong it's not comics. I'm going to go out and act drunk and go go into the pool and buy the hotel **** Like to me like I guess that's my Yeah but that that never came off that came off as weird to me. Like that never came off like he was selling that. That came off like and part of it is because as the audience you're behind the curtain. You see why he's doing it and you understand his motivations. But like to me I I loved when Keaton would be he played the bumbling sort of like he wasn't the playboy. He was more of like I don't really know what's happening all the time. I'm kind of just stumbling through life here and there but then when",
      "start": 4569.28
    },
    {
      "text": "he played the bumbling sort of like he wasn't the playboy. He was more of like I don't really know what's happening all the time. I'm kind of just stumbling through life here and there but then when he'd have those then he'd have those one or two interactions with like Max Shrek and you're like oh **** wait a minute. These guys are both really sharp and they're both coming at this and this is both just their facade that that's like hitting right now but they're both kind of like on different sides of the same **** up dark coin. I'm with you that like Bale's Bruce Wayne Batman is way more canon than you know the Keaton stuff. Where the **** the money coming from for the Wayne? You know what I mean? Like there's never any Wayne Tech or Lucious Fox or anything like that, right? It's just like I have a really big house in this table I don't use. He's a millionaire. Um Wayne Enterprises. Alfred's live with me forever but he's got to wear this **** tuxedo every day. He likes",
      "start": 4602.4
    },
    {
      "text": "just like I have a really big house in this table I don't use. He's a millionaire. Um Wayne Enterprises. Alfred's live with me forever but he's got to wear this **** tuxedo every day. He likes the tuxedo. We've asked him to change. He doesn't want to change. And he has a bunch of them. It's not the same tuxedo. He owns more than one but it is the same one. It's the same one. the same style. For sure. For sure. Yeah. I don't know. I don't know. I do I I think back about that but I have such such conflicting thoughts the Dark Knight trilogy cuz so much of it is right. And I think that's just what I always feel when when I start to deep dive on Christopher Nolan is that there's so much of it that I love and that is right. And there's just so much of it that you're like there is a little stuff that's off about it. And yeah but that's I mean that's comic book movies. That's movies. That's anything. No just comic books. No it's Fast and Furious is airtight Tim. I can't even admit",
      "start": 4639.92
    },
    {
      "text": "stuff that's off about it. And yeah but that's I mean that's comic book movies. That's movies. That's anything. No just comic books. No it's Fast and Furious is airtight Tim. I can't even admit to that. Like that's Yeah. Fast and Furious is more like a submarine with the **** screen door. But what? Whoa. See that's a joke I stole. I don't even know where I got that from. I stole that joke. Is it? Yeah. Yeah. Going way back to battleship with a screen. I just I don't know. Like I I I'm becoming more and more intrigued by if this Batman like how this Batman versus Superman movie is going to be. I like I think this movie is going to be no better than good. But like I think it's going to be good, you know? But but I don't know that Affleck's going to be the takeaway from it. I think I think I think I think the takeaway is probably gonna be that this is might be the first Superman movie that's actually worth anything since Reed. No because even if it is good it No because if the",
      "start": 4673.12
    },
    {
      "text": "think I think I think the takeaway is probably gonna be that this is might be the first Superman movie that's actually worth anything since Reed. No because even if it is good it No because if the movie's good it's gonna be counted as good because of Batman. Yeah. Yeah. That's the problem. Then it's a lose-lose for DC and for Superman. I mean they put so much money into this too. I wonder how they're going to do financially with this. It's 50 million before marketing. Oh **** But somebody put it up the numbers recently of what it's projected to make and it was projected to kick some **** skull in. Yeah it'll make I mean it'll make the writing on the wall, right? And the fact that they've already green lit the solo Batman film to follow and then there's all these other movies that aren't Superman movies. It's Justice League. It's Wonder Woman. Yeah they're shoving it all the second. That's going to be the problem with this movie is they're but they stopped on the putting",
      "start": 4710.88
    },
    {
      "text": "that aren't Superman movies. It's Justice League. It's Wonder Woman. Yeah they're shoving it all the second. That's going to be the problem with this movie is they're but they stopped on the putting so much **** into this movie, right? Like if they hammer in too much of the Justice League it's going to be like \"Okay **** Cyborg. Yay.\" Like I think he'll just be in the background. I think I think Hey welcome to Justice League. Like check out when you incorporate like eight dudes with superpowers. Uh this eyehole theory. I I can we'll link you. All right. Yeah you can. I'll watch the video. All right. Give me the view. All right. All right. I'll give you that view and I'll watch your ad. Speaking of ads Greg Way. Guys everybody good knows good things comes in sets of three. What does that have to do with anything? Well get this. March is the third month of the year and it also happens to be our friends over at Harry's 3rd year anniversary as a business. And if you're new to",
      "start": 4746.88
    },
    {
      "text": "does that have to do with anything? Well get this. March is the third month of the year and it also happens to be our friends over at Harry's 3rd year anniversary as a business. And if you're new to Harry's I've got a special deal for you to try three of their expertly crafted five blade German razors a handle and shave cream for just 10 bucks. We're going to shave this off with it. Just the right side of my beard. Just the right side. So see you're okay with that? Yeah. Kevin go get me the hairy rate. No don't do it. Harry's doesn't like discounts because their prices are already so low but we've worked out a special offer for you guys and this is the all caps portion so guard your ears. Harry's will give you $5 off your first order with promo code kinda funny. That's all one word. Stop overpaying for a great shave. Go to Harry's.com right now. That's h a r ys.com. Enter code kinda funny. All one word at checkout. Colin. Yes. You're the final topic and you have the",
      "start": 4781.76
    },
    {
      "text": "one word. Stop overpaying for a great shave. Go to Harry's.com right now. That's h a r ys.com. Enter code kinda funny. All one word at checkout. Colin. Yes. You're the final topic and you have the Patreon producer John Deos to thank for that. John Stamos gave us a This is the question. Wait so I Wait we are doing my topic. I didn't think we were doing my topic. We are doing your topic. Okay cool. So I was thinking about we talked about this a little bit about at lunch. Uh weird pet peeves. Now I know we've talked more pet peeves. So we talked about pet peeves in the past and I think that people have their pet peeves, right? Like I've talked about how like people getting up on the airplane and like running down the aisle to try to like skip five rows. I **** hate that. Did you notice that? I actually want to **** mur like straight murder those. You weren't on our flight on the way back. No I went to It was the first flight I've ever taken where that didn't happen. Did you",
      "start": 4822.08
    },
    {
      "text": "that? I actually want to **** mur like straight murder those. You weren't on our flight on the way back. No I went to It was the first flight I've ever taken where that didn't happen. Did you notice that? No I don't pay attention. We were all just sitting there and I turned around and everyone was waiting for their their time to get up and and go down the aisle which normally it's not. There's always that one **** by the bathroom in the back that just jets to see how far. It's like It's also always like an old lady like you're always supposed to be polite to old ladies. The rudest people in the world are old ladies. They know they can get away with it. They've lived through a lot though. Yeah sure. Yeah they got through Nom. But like it's they're still like were they serving? They were fighting the Viet out N. I always feel like the women pushing me out I mean not the women people pushing me out of the way. It's always like an old woman who has like a giant suitcase who's",
      "start": 4869.2
    },
    {
      "text": "They were fighting the Viet out N. I always feel like the women pushing me out I mean not the women people pushing me out of the way. It's always like an old woman who has like a giant suitcase who's just like I'm **** out of here. I got less time left in my life. I'm moving. You can't trip on me either cuz then you just go to jail. That's the problem. So but like I'm trying to think of you know like so we're talking about like how I hate loud eating loud swallowing. That **** annoys the **** out of me. But that's ubiquitous. Like I don't care where we are what we're doing. If you're swallowing loud I'm going to **** punch you in your throat. You know what I mean? I don't want to see that **** I want to hear it. It's enough enough. You're not hearing me. I know for a fact you don't hear me. You're seeing you're seeing Nick and thinking of Drucker as you're as I'm as I'm smelling Greg and and summoning for Kevin. Were you Were you Were you",
      "start": 4901.92
    },
    {
      "text": "you don't hear me. I know for a fact you hear me. You're seeing you're seeing Nick and thinking of Drucker as you're as I'm as I'm smelling Greg and and summoning for Kevin. Were you Were you Were you listening at lunch when Drucker was talking about the opposite of that? Apparently this Drucker always opens up my eyes to all sorts of crazy stuff that I some people like that show. Yeah I guess people do like that stuff. as it's called ASMR I guess where it's like videos of people chewing or opening like not like not like unboxing videos like just the sound of a box opening people like so actual unboxing videos but just just for the sound of it. So let me give you a few examples of what I'm talking about. All right. So like I think I'm going a little deeper with the pet peeves. One of my major pet peeves on the TSA line when you have the person in front of you that's never flown before. What you mean I can't take this water through? It's all right. I understand 911 changed everything",
      "start": 4931.76
    },
    {
      "text": "pet peeves on the TSA line when you have the person in front of you that's never flown before. What you mean I can't take this water through? It's all right. I understand 911 changed everything, right? You know it's it's it's a terrible thing. That was PlayStation Move. PlayStation Move also changed. PlayStation Move in many ways was worse than 911. Never forget. Never forget PlayStation Move. Wow. Good reward. My dad was New York City firefighter. I can make jokes about 911. Not sure that's how that works. He was He was there. I can make jokes about You want me to go get the sweatpants? That's why I have an FDNY sticker on my lid on my laptop. I can make 911 trucks. Uh but uh the the only reason he has the sticker the uh but the TSA like have you met this person that just has no idea what they're doing on the TSA line as if they've never even it's all right. You don't fly. That's fine. I don't know how you live in the United States and don't fly at least once every few years since",
      "start": 4967.44
    },
    {
      "text": "they're doing on the TSA line as if they've never even it's all right. You don't fly. That's fine. I don't know how you live in the United States and don't fly at least once every few years since it's a **** massive country. But okay you stay in your little geographic area but you've never been exposed to this on TV or comedy sketch or something like you haven't read any of the signs asked. Oh I got to take my shoes off and then they walk back through the machine. Oh I got to take my jewelry off. Oh so you have your wallet in your in your pocket. So you have your **** They don't do any They don't do any favors nowadays though cuz there's so much different things. It's like we go to airports and there's a dog. And I'm like okay I'm not trained for this dog. I don't know what the dog do. I just And the guy's like \"Just walk by. Just walk. Don't touch the dog. Don't touch the dog.\" And it's like everyone's trying to pet the dog. It's a **** dog. That's what people ****",
      "start": 5009.12
    },
    {
      "text": "dog do. I just And the guy's like \"Just walk by. Just walk. Don't touch the dog. Don't touch the dog.\" And it's like everyone's trying to pet the dog. It's a **** dog. That's what people **** do. So it's like yeah people have this general police dog. Hey when he takes off that badge and gun he's still a dog. Okay. But so these dogs it's like \"All right so now do I have to take\" And they're like \"No you don't need to take off your your shoes. You don't need to take off your shoes.\" Then you go through and like \"You didn't take off your watch.\" No. Like I thought the watch gets me every once in a while cuz you don't like half the It's cuz they make it up. It's all made up. It's all made up. Okay. So the laptop needs to go in a separate thing. If you have if you have a tablet it's fine but a large tablet. I'm like \"Okay so where there's There's now three iPads. Which one is which? which qual with the iPad in the middle. Is that large or is that small? I don't ****",
      "start": 5039.68
    },
    {
      "text": "it's fine but a large tablet. I'm like \"Okay so where there's There's now three iPads. Which one is which? which qual with the iPad in the middle. Is that large or is that small? I don't **** know. Like much of the federal government these people are just trying to justify their existence at this point. Uh and that leads me to another pet peeve with a TSA when there's the person there that is trying as loudly as possible to tell you all the rules. Oh yeah. As you're coming up but you only catch maybe a quarter of them. Belt the wallet off everybody. It's like \"All right all right all right. We know.\" Yeah. You're like \"Oh my god.\" And and the guy's like he's not paying attention to you. You're not paying attention to him but he's only adding to your anxiety of the whole affair because he's just loudly saying something that you know but then you're like \"Should I be paying attention to this **** guy? Maybe he's saying something that I should say but I only caught half",
      "start": 5081.04
    },
    {
      "text": "because he's just loudly saying something that you know but then you're like \"Should I be paying attention to this **** guy? Maybe he's saying something that I should say but I only caught half of it and I'm not going to **** hit that button on my remote that makes him go back.\" It's not going to happen. They start doing that **** too where they they start to try to be cute and fun so it's like whatever. Like Southwest flight. They start **** rhyming everything. It's like you're at In-N-Out and it's just like number three your food's ready and **** like that. But they'll be all like I really hope they try hard. They start doing that. No they don't. They never try harder. So they start being all cute with the like take off your shoes and I don't I don't have this only vaguely related but I realized I was an adult when I was attracted to my first TSA agent. Like I saw like there was a woman in the TSA line doing like and not like not like I hope she checks me like not",
      "start": 5117.52
    },
    {
      "text": "related but I realized I was an adult when I was attracted to my first TSA agent. Like I saw like there was a woman in the TSA line doing like and not like not like I hope she checks me like not like I'm gross but I was like oh she's really pretty. And I'm like that's very strange to see a TSA agent and recognize that they're attractive. Not a pet peeve. Feel free to be beautiful. And it wasn't like some like fat like 80-year-old dude at the TSA. Like it was like a woman my age. And it was it would be okay if it was a guy who was attracted to you. I'm just saying that it wasn't your name. There's nothing wrong. It's not the image in your head of a TSA agent. Uh another pet peeve uh tall people at concerts. Now obviously everyone has the right to go to a concert. Right. I don't have this pet peeve. But when you're on the floor. All right. Like so I I as an example last three concerts I had this problem. I I went to 311 on Sunday. 2nd time I ever saw them. Do they have songs? They",
      "start": 5153.2
    },
    {
      "text": "pet peeve. But when you're on the floor. All right. Like so I I as an example last three concerts I had this problem. I I went to 311 on Sunday. 2nd time I ever saw them. Do they have songs? They have 11 albums. Um but uh but they uh like there's a guy standing in front of us like kind of you know towards the center who's like 6'6 6'7 like straight up. And I'm like that's fine sir. I know you can't do anything about it but like you have to know that you like you can't just be in this mixture of of people that are between 5'8 and like 6'1 and you're just in the middle blocking the you got to kind of go in the back. Like I'm so like I'm sorry. I'm not trying to be you know I'm not trying to be sizest here. I guess he's just a big fan. Goodbye everybody. You dematerial. He's head and shoulders above the rest. My god. But like we all want to be close but you know that like when you're that tall you're being quite obstructive to people that are that are average height five. Like I",
      "start": 5186.88
    },
    {
      "text": "above the rest. My god. But like we all want to be close but you know that like when you're that tall you're being quite obstructive to people that are that are average height five. Like I just I just feel like if I was I'm 6' tall. I feel like if if I was if I knew I was being if I was 6 inches taller than I'd be like \"Well I kind of got to like play this a little differently because I know someone behind me **** hates me.\" These people like have to know that they're blocking and because of of a field of vision they're actually blocking like an entire like triangles worth of people the closer you are to them you know? I feel like you do that too though. Like you're you're tall enough to qualify for that. I don't think I don't think there's a lot of people shorter than you. There's a lot of people shorter than me. There's a lot of people taller than me. Yeah. And I'm not I'm not This 311 shows are young I thought they were young man's game actually until I went this last",
      "start": 5239.76
    },
    {
      "text": "a lot of people shorter than me. There's a lot of people taller than me. Yeah. And I'm not I'm not This 311 shows are young I thought they were young man's game actually until I went this last time and I realized I was like the youngest person there. But so so do you propose like a kindergarten class picture scenario? Everyone needs to file in like but there's like in the front and everyone else is in the back. There's not 10000 people. You can easily at like a normal band concert. You can easily organize this maybe 0 30 minutes before everyone goes in the show. You're good. You have them all line up by height before they go in. You go I see your point but you can't like break his legs and like hobble him down to like a level like he probably feels bad. He's probably self-conscious and he's like I hope I'm not ruining this. Stand by the back of the soundboard then. Yeah. Yeah. But you know what I mean? Like you can see fine. No matter where you are you can see just fine. Well",
      "start": 5271.36
    },
    {
      "text": "he's like I hope I'm not ruining this. Stand by the back of the soundboard then. Yeah. Yeah. But you know what I mean? Like you can see fine. No matter where you are you can see just fine. Well it doesn't matter. Everyone has their phone up anyways. They're going to watch it when they get home. This was one of the things that bothered me about that. That that was another pet peeve of mine because someone someone I tweeted out a picture or a video a short video of them playing a rare a rare song that I've only seen them play like once or twice and and someone's like I didn't expect that you were going to be one of the guys took out the phone. I'm like yo **** they haven't played the song in a long time. Choice moments dude. Like that's the thing. You go in you need to know exactly all right I'm going to film this 15 seconds for this memory and that's what I want. Cool dude we have these things. But then everyone taking out their phones for Amber and Beautiful Disaster. Like they",
      "start": 5311.76
    },
    {
      "text": "right I'm going to film this 15 seconds for this memory and that's what I want. Cool dude we have these things. But then everyone taking out their phones for Amber and Beautiful Disaster. Like they play these songs every **** night people. Well I mean . Go on YouTube sir. That's Yeah no one's literally with them every night. Um that's that is actually one of my pet peeves. I was over the weekend I watched a fight at a bar and it was a very very crowded bar. So it was one of those instances where you know you have your kind of ey line to the TV that you set up. Televised fight. Yeah televised fight. Okay. I'm sorry. No I hear Tony's going to fight Mark. Let's go to the bar. **** Tony. He wins every time. Uh no. So so it was a UFC fight. It was televised at a local bar and sometimes I just pop over there for a drink and see it. But it always gets super super crowded as the main event starts happening. Um so I've got my little spot and as the main event is",
      "start": 5340.96
    },
    {
      "text": "bar and sometimes I just pop over there for a drink and see it. But it always gets super super crowded as the main event starts happening. Um so I've got my little spot and as the main event is starting, right as as the people are coming in, you know you see people kind of getting their phones out and getting ready and then **** starts going down they start throwing punches and every phone starts coming up to record it. And I'm like you're you're watching it. Yeah just watch it. I want I want them sweet vine loops. But that's and and I get why that's happening because people like that. But can we just enjoy the moment without having to get another follower from it? That is my only pet peeve. And I know Tim I don't even I can close my **** eyes. I know Tim's shaking his head right now at me. Um No I agree with you. It's also like you're wa you're then you're not watching it live. You're watching it through your phone live. Yeah. It's just I don't know. There's there's a",
      "start": 5378.96
    },
    {
      "text": "right now at me. Um No I agree with you. It's also like you're wa you're then you're not watching it live. You're watching it through your phone live. Yeah. It's just I don't know. There's there's a commonality especially for live events where you're experiencing that with everyone else and then when you're experiencing you you already have the buffer of the TV in front of you anyway. Like it's not if you're at the **** thing. You're in a stadium. You're watching the Islanders shoot the puck against the icing. That's pretty close. Red line. You're almost there. Look you hold that stick. Look at they just how they do it, right? Cus when they win passing gym class. I get that you're at the experience but you're watching on a **** TV and then you're recording it on another mini TV. So here's what I'll do. You're so far removed. I'll turn it around on I'll turn you around. All right. I would tell you about my Poppy my grandfather. Nope. Great guy. World War not. Get the notepad.",
      "start": 5414.88
    },
    {
      "text": "here's what I'll do. You're so far removed. I'll turn it around on I'll turn you around. All right. I would tell you about my Poppy my grandfather. Nope. Great guy. World War not. Get the notepad. No this is this is start World War II vet. Great had Purple Heart all that jazz. Great man. Love him to death. You know what I mean? What theater? Uh I don't remember. Uh no he's still remedy. Oh so Europe. Cool. Um great man. Love him to death. He's long distance passed, right? He did not digitally archive anything he ever saw. So I have no idea what shows he watched or what sporting events were important to him. Maybe it's none of your goddamn business. I want to know. Maybe it's none of your business. All I know is that he used to have to watch soap operas when grandma was sick and then I get in trouble when I turn into Batman. How much how much worse would it Normandy have been if it was like hey y'all about to storm Normandy selfie click like what is happening now the greatest",
      "start": 5453.2
    },
    {
      "text": "I get in trouble when I turn into Batman. How much how much worse would it Normandy have been if it was like hey y'all about to storm Normandy selfie click like what is happening now the greatest generation that's all I'm saying is that like I think I think technology often times gets in gets in the middle of actually real experiences and I'm not saying it happens all the time obviously it was five seconds I'm not I wasn't that heartbroken when they took it out and I was excited to see the fight as well but at the same time I'm like you you have to question how and why you're choosing to experience these things and what they really mean to you. Because if it's just to get that tweet, then you have to you're not getting the fullest experience out of it. In my opinion, in my opinion. Now, I mean, I've I've done the thing too when like we were, you know, the movie starting and I've like I'm excited to be this movie and I've done it. So, I I've done this before. We're all guilty. We're",
      "start": 5490.96
    },
    {
      "text": "I mean, I've I've done the thing too when like we were, you know, the movie starting and I've like I'm excited to be this movie and I've done it. So, I I've done this before. We're all guilty. We're all guilty of it. But at the same time, you know, I try not to because I'm like, I want to be here. I want to experience Those without sin cast the first stone, Nick. It's true. Yeah. Let me hit you with two more. Go. Uh, we were talking about this at at when we went to to get burritos before. Waiters that don't write down what you're ordering. And now I appreciate it's it's dedication to the craft. Yeah. It's like I like your parlor tricks, but then they have to go through it and then they're making mistakes. So they're like you first one first one he was like okay I got it everyone. Let me just go through it one more time. Uh, and you're like no this is not going to work. This is not going to work. So that's just a small pet peeve of mine that like it's like it's no shame in that taking",
      "start": 5533.36
    },
    {
      "text": "go through it one more time. Uh, and you're like no this is not going to work. This is not going to work. So that's just a small pet peeve of mine that like it's like it's no shame in that taking a note. Smart men take notes. Yeah. Da Vinci scribbled endlessly in his notebooks backwards. So did Son of Sam. Son of Sam also took notes. Both did good things for society. And finally, we talked about this. We on the same level those two. We talked about this already, but I just I noticed this when I was in San Diego and Aaron and I take a lot of Ubers everywhere. And I noticed that like my conversations with Uber drivers when I have to have a conversation with them always are about driving an Uber. That's like probably one of my my pet peeves that's actually developing the most right now. Yeah. **** time. Oh, how's it going? Oh, good. Uh, so busy tonight. Like you don't know what to say. And they're like, \"Oh, yeah. What's up?\" You know, and then 10 minutes later, you're talking about",
      "start": 5570.08
    },
    {
      "text": "**** time. Oh, how's it going? Oh, good. Uh, so busy tonight. Like you don't know what to say. And they're like, \"Oh, yeah. What's up?\" You know, and then 10 minutes later, you're talking about the **** business of Uber. This happens nine out of 10 times on in an Uber. I've ridden hundreds of these things now and I have to do something about it. We have to have other things to talk about. It's cuz they all just started. They all Every **** Uber ride I've had in the last Six months ago, I was like, \"Dude, I'm on this is my second night. How am I doing?\" I'm like, \"So, in in this city right now, just so you know, you haven't lived here in a while.\" You either are riding an Uber or you're driving an Uber. That's the only two things people do anymore. That's it. Uh, it's it's I feel you on that one cuz that is completely ridiculous. I also feel like a lot of that's on you though because I don't have those conversations. What kind of conversations do you have? Every time I've ever",
      "start": 5612.24
    },
    {
      "text": "on that one cuz that is completely ridiculous. I also feel like a lot of that's on you though because I don't have those conversations. What kind of conversations do you have? Every time I've ever been in an Uber or taxi with you, you start that conversation. Well, we had the conversation in Boston, which is I know the one you're talking about. That's a different that's a different one. We had this like advers somewhat adversarial conversation with a cab driver in Boston about this time last year during PAX East about how Uber was putting him out of business and how he had a medallion that was worth like $300000 and all this kind of stuff. And I was like, but you suck. The market kind of speaks. It's kind of cold out, so we don't really want to have this argument right now. We're still a mile away from the show. And I knew I saw Tim kind of looking a little uncomfortable and like, \"Oh god, here we go.\" Yeah, that one was my fault. Yeah, that happens. I mean, pet peeves. I have lists.",
      "start": 5647.28
    },
    {
      "text": "mile away from the show. And I knew I saw Tim kind of looking a little uncomfortable and like, \"Oh god, here we go.\" Yeah, that one was my fault. Yeah, that happens. I mean, pet peeves. I have lists. I last time we did this topic, I bust out the list. I still have a million more, but one that caught my eye here is when you start thinking about things that you normally wouldn't really put much thought into. For example, you're at the movie theater and you pay $7 for a soda and you're realizing you're paying $7 for that person to pour soda into a cup. That bothers me. You're not paying $7 for the soda. You're paying $7 for someone to pour soda into a cup. How do you feel about paying $7 now where they give you the cup and you go to the fancy machine and Well, that's even I mean that's Yeah, I don't like that either. Like that's upsetting because then it's like then then you're not even giving me the courtesy of doing it for for me. Yeah. You're you're you're not **** me. You're making",
      "start": 5683.92
    },
    {
      "text": "I don't like that either. Like that's upsetting because then it's like then then you're not even giving me the courtesy of doing it for for me. Yeah. You're you're you're not **** me. You're making me **** myself. I don't like that. That sounds preferable. I'm gonna throw one out. It does. That's true. Yeah. I'm going to throw one out. That's been happening recently. A lot recently, actually, since I think Greg pointed it out the other day. We park uh sometimes in in a space where we have to walk across a medium to get to it. Oh, this **** And there's always someone who thinks they're doing you a solid by stopping in the middle of the road and letting you go, but it's always the last **** car. Yeah. Right. And you're like, \"Just go. Just go.\" You're like there's like And they give you this **** look. You know what I mean? Like, I'm doing you such a **** favor right now because you are walking and I am **** piloting this automobile. So, I am superior to you. I will let",
      "start": 5727.2
    },
    {
      "text": "you this **** look. You know what I mean? Like, I'm doing you such a **** favor right now because you are walking and I am **** piloting this automobile. So, I am superior to you. I will let you walk in front of me. In reality, I perfectly timed my walk, sir. So, my momentum would carry me behind your bumper. I got pissed at someone today. Oh, nice. Oh, yeah. She stopped and there was a bunch of cars coming and I'm like I gave her the **** like jet way like go go go and she was like, \"Ah.\" And she just **** freaked out like gun and I'm like laughing crash into a car. Yeah, that's that's a pet peeve of mine especially walking around in San Francisco like just any anytime you have to interact with another car, it's people just **** lose their minds. They don't understand what's happening. I also have a pet peeve of bicyclists just in general. Yeah. Don't like them, don't get them. I know it's good for you. They blow through stop signs and they complain about getting hit.",
      "start": 5775.2
    },
    {
      "text": "happening. I also have a pet peeve of bicyclists just in general. Yeah. Don't like them, don't get them. I know it's good for you. They blow through stop signs and they complain about getting hit. Yeah. You get it probably a lot. Yeah. Cyclist. I I respect the idea of cycling and you want to save money or you want to be healthier. You want to go to work. It's always like what? You know what my pet peeve is? When you have a bicycle and you bring it on the **** subway, it's like no, no, no, no. You have transportation. You don't bring transportation on the transportation. Well, it's far. Well, then **** you don't have a bike. I hate it. It's I always and it's always like someone who could just kick the **** out of me so I don't say anything cuz I'm a **** But like at the same time I'm a coward but still it's so mad inside but I'm like have a nice day. Yeah. I feel like vending machines in general there just they're always just **** up. There's always something whether it's it",
      "start": 5815.36
    },
    {
      "text": "a coward but still it's so mad inside but I'm like have a nice day. Yeah. I feel like vending machines in general there just they're always just **** up. There's always something whether it's it something getting stuck and then you're like all right then you have to go through that whole mental thing of like all right that Snickers bar it was worth 50 cents. Is it potentially worth a dollar? Yeah. Yeah. But it might I might get two out of that. Yeah. Do I need two? Then you have that whole **** thing. And that would you pay someone $7 to get that Snickers bar for you? Oh my god. No, I would not. I would **** I'm totally opposite with you on the whole Coke thing in the movie theaters. I love that I have a a servant behind that counter that I can just pay hundreds of dollars to and he will fill my diet soda at my bidding. The whole that **** with the uh serve your own beverage. Yeah. That's taking it a step too far. I want you to perfectly touch. You know they time and they keep",
      "start": 5848.0
    },
    {
      "text": "will fill my diet soda at my bidding. The whole that **** with the uh serve your own beverage. Yeah. That's taking it a step too far. I want you to perfectly touch. You know they time and they keep going for you. I'm like, \"Yeah, work. Work for that **** money. That's my hard-earned dollars.\" And you're going to twerk for me. You're going to embarrass yourself for me. You're going to take your shirt off. So, donate to Patreon so Nick can make that happen. Yes. Yes. I'll film it next time. Jesus. Did I go dark? Yeah. Sorry. I also I have a pet peeve of just societal norms. I don't have like dealing with other people's **** So, it's like, you know, I'll go to the bathroom and I like I'll pee and it's really fast, but I'll stay there for a little longer because I don't want people around me thinking, man, he pees really fast, so I'll stay there. **** them. You know, that's no one thought that **** **** If I went in and peed as fast as I can pee sometimes, you guys would judge",
      "start": 5890.56
    },
    {
      "text": "me thinking, man, he pees really fast, so I'll stay there. **** them. You know, that's no one thought that **** **** If I went in and peed as fast as I can pee sometimes, you guys would judge me. Well, let me How fast are we talking? Go right now. I don't need to pee right now. That's not how how pee works, right? I would just assume you were doing something else like blowing your nose or checking your face or teeth or something in there. Like, maybe you're not. I'm talking about you're out of urinal. Like there's me and you standing at urinals. I faked pee next to you so many times. I've been alive 31 years and I've never been like he peed pretty fast. Yeah, that's because that's because people are faking it. You know what? What? What? Faking what? Faking the pee. Have you looked into this? Have you looked into this like scientifically? Is there something different? There's stats all over the place. I'm not What did you Google for this? Um I just ure wide ureth ureth gaping",
      "start": 5934.16
    },
    {
      "text": "into this? Have you looked into this like scientifically? Is there something different? There's stats all over the place. I'm not What did you Google for this? Um I just ure wide ureth ureth gaping urethra. all just comes out like pours out for one second. It's a gallon, right? It's like cutting the bottom off of a two liter jug. This is an interesting one with this group specifically because there's a lot of uh people here that do this. But so when you sneeze, like I sneeze once, you guys sneeze like 10 bazillion times, right? I never know how many times to say bless you once or when. The once is fine, but then it's like it's weird if I bless you in the middle of your sneezes because Greg kind of has a rhythm and a pace to it. Nicks are more just like here's one. Here's one. Here's one. I'm like, \"Fuck, you got me.\" Yeah. Yeah. Well, I have I have weird allergies right now. I don't know if you guys are noticing that or not, but like in in your own noses, but there's I have weird",
      "start": 5970.48
    },
    {
      "text": "I'm like, \"Fuck, you got me.\" Yeah. Yeah. Well, I have I have weird allergies right now. I don't know if you guys are noticing that or not, but like in in your own noses, but there's I have weird weird there's weird stuff going on. I think the world's dying. Um Okay. I just think it's dying. I think you're probably right. Yeah, probably. It's like that Marky Mark movie. Oh, is it happening? What about the beast? It's happening. It's all happening. Oh, that was a different No. Yeah. I don't like I don't like the getting a a bless you after every sneeze. Yeah. I'm already embarrassed that this is a thing. Can we just Can we all just ignore it? I don't like when someone steals my bless you though as well. Like like you know like three people say three people will say bless you around say bless you bless you. Bless you. But like the person turns to the person or oh thank you. Like yo I said bless you and I said it maybe a half a second first and you know I **** did. I don't like the",
      "start": 6016.76
    },
    {
      "text": "bless you bless you. Bless you. But like the person turns to the person or oh thank you. Like yo I said bless you and I said it maybe a half a second first and you know I **** did. I don't like the pressure of having to say thank you for the blood. Don't **** say bless you. I know you I know you heard me sneeze. Just let me in my embarrassment over here that something might be hanging out of my nose. Don't **** acknowledge it. Just stay in your world. You don't care. You don't **** care. It is a weird is still a weird It's a weird society. I would do it if I had the **** option. Then if I don't do it, everyone else is going to judge me and my long peas. Yeah, it's our short. Yeah, whatever. What is it? Stories changed a lot. I do feel like bless you is is I say it every time I hear someone sneeze always even a stranger but I'm like I don't know why I mean it's it's about demons coming out of you and **** from the middle ages and stuff but like but like why yeah it is true",
      "start": 6057.28
    },
    {
      "text": "someone sneeze always even a stranger but I'm like I don't know why I mean it's it's about demons coming out of you and **** from the middle ages and stuff but like but like why yeah it is true it's like why are we even like we're sneezing it's just a thing your body does why do I need the people around me to tell me it's okay to sneeze you know why do I get acknowledgement of your weakness of my weakness maybe that is you sneeze a lot you and I sneeze but if we're if that's a weakness you and I are the weakest people on the planet we're I like the Samuel L. Jackson from Unbreakable. Oh, okay. Yeah. Yeah. They called me Mr. Glass. I put a glove. Oh, **** I broke my hand. Great impression. Thank you. I do an awesome. You do. If I closed my eyes, I'd see Samuel L. Jackson. Yes. I'm Nick Fury. That's what I do. No, that's really good. You do. Do you do commercials when Samuel L. Jackson's not available? I do fill in for Samuel L. What's in What's in your wallet? What's in",
      "start": 6096.32
    },
    {
      "text": "I'm Nick Fury. That's what I do. No, that's really good. You do. Do you do commercials when Samuel L. Jackson's not available? I do fill in for Samuel L. What's in What's in your wallet? What's in your wallet? That's spot on. Is it a credit card? It's very close. Very close. Anyway, the idea of the topic was supposed to be weird pet peeves, but then I realized there just pet peeves are just pet peeves. So, I would I would file uh people being mad about paying too little is a weird pet peeve. I would file uh Tim's under that. That seems like irrational fears. That's a different topic. Irrational fears. We could do that later. Yeah, we could do we could do My whole life is one irrational fear after the other. Yeah, we do a whole just episode of pet peeves around restaurants, restaurant etiquette, the hosting, not being sat if your if your entire party is not there or just sitting there for 5 10 minutes without anyone even acknowledging our existence. When they leave the mayonnaise in",
      "start": 6138.0
    },
    {
      "text": "the hosting, not being sat if your if your entire party is not there or just sitting there for 5 10 minutes without anyone even acknowledging our existence. When they leave the mayonnaise in the sun. Oh, that's **** That's just dangerous. Really dangerous. That's like in Germany. That's some German **** right there. That's some that has Germany written all over. Yeah. When you go to like Cologne and like there's there's the mayonnaise right there and it's like it's turned a shade of purple cuz it's so rotten. Happened to you. Never happened to me. Ladies and gentlemen, this has been the GameOverGreggy Show. Each and every week, four, sometimes five best friends gather on this table. Each bring a random topic discussion for your amusement. Head over to patreon.com/kindafunny where you get every show early along with exclusive access perks and other things. If you have no bucks to tosses over there, though, go to youtube.com/kindopfunn where we post the entire show for you daybyday",
      "start": 6175.2
    },
    {
      "text": "every show early along with exclusive access perks and other things. If you have no bucks to tosses over there, though, go to youtube.com/kindopfunn where we post the entire show for you daybyday, topic by topic until the entire thing posts as one big MP3 and video. Mike Drucker, thank you for having me. We love you. Thank you so much. I love you. Ah, yeah. Follow him on Twitter, please. Mike Drucker. Watch the Tonight Show. Watch the Tonight Show. Uh, How to Be a Person, iTunes, Stitcher, Soundcloud, and Twitch. Mike Drucker. No, you got it. Picking up the Twitch. You got a Snapchat Mike Drucker yet? Yeah. It's Drucker Mike though, I think, on Snapchat. Yeah. No, someone was Mike Drucker already. Sons of **** These **** young kids. That's the problem. Until next time, it's been our pleasure to serve you. Kevin Coello, my son. 1 3 1 3 1 3 4 5 1 3 4 5. What would you What would you do if I was actually biological father? If it's by some weird happen stance, it' be great.",
      "start": 6213.12
    },
    {
      "text": "to serve you. Kevin Coello, my son. 1 3 1 3 1 3 4 5 1 3 4 5. What would you What would you do if I was actually biological father? If it's by some weird happen stance, it' be great. You were related to me. You came out of my the tip of my penis. Penis. All right. You were once in his urethra. You were just a little little squiggly tail. Save this for the out and then b it came into life. What would you do? What would you do? What would you do? Changing tents and everything. He's going. What would you do?",
      "start": 6252.64
    }
  ]
}
