{
    "id": 1586,
    "video_id": "v9OU8Vg-dLU",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Greg Louden",
        "Thomas Puha"
    ],
    "title": "Quantum Break Let's Play - Kinda Funny Plays",
    "description": "Remedy Games comes to Kinda Funny to show Greg why Quantum Break is awesome.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1456840801,
    "duration": 2942,
    "transcript_chunks": [
        {
            "text": "What's up everybody? It's me Greg Miller. Welcome to another Let's Play here on YouTube.com/KindaFunnyGames. Now I'm not joined by any of the chuckleheads from Kinda Funny. I got two chuckleheads from Revity. This is Greg. This is Thomas. And they made Quantum Break all by themselves. Very true. Just a two-man independent dev team. You haven't heard a lot about you guys? No, not at all. We work at Revity Entertainment with a really talented team. And we're happy to be here to show off the game. Thank you for coming. Uh I, you know, I've talked about it before. By far my most anticipated Xbox game of this year. So, I'm super stoked this so close. Beginning of April, it comes out. But now we're going to play. You let me play for a good portion of it. Then you played a little bit to show me how good you are at it. And I was like, you should probably play the next part. I'm I'm I'm sold so far, but we're jumping into chapter, part one, right? Uh, yeah. Actual. Yeah, act two part one.",
            "start": 0.08
        },
        {
            "text": "how good you are at it. And I was like, you should probably play the next part. I'm I'm I'm sold so far, but we're jumping into chapter, part one, right? Uh, yeah. Actual. Yeah, act two part one. Okay. Okay. Jump in. Show us what's happening. Here we go. It's about time travel moving time around. Let's talk about the dry dock incident. Monarch operatives transported you from the university to the ground zero operation at the shipyard. Still upset about that, huh? You were secured unconscious. Well, Liam went to retrieve you and you were gone. How? I'm sleeping. Step away right now. You have 3 seconds till I pull. Have better reflexes. See you at home don't know he just got his powers and then I just saw a live action 0 minute scene that was going on like the episode and this was all live action but now it's in the game Kevin you know you see what's happening here I like it you know assisted you in some manner then I'm guessing you know the rest nobody because everybody Everybody",
            "start": 36.32
        },
        {
            "text": "live action but now it's in the game Kevin you know you see what's happening here I like it you know assisted you in some manner then I'm guessing you know the rest nobody because everybody Everybody who saw what you did next is now dead. So yeah, I guess as a quick recap, what you obviously we did show you was we just showed act one and we showed you the junction scene where you make decisions and it ends up changing the story of both the the game and the show, right? Cuz that in junction scene, I didn't understand what it was at first when I started playing through, but it was a different character that you know from the game. You walk up and then yeah. Do you want to basically save this person or kill this person and then the rest of Monarch will go along with you and you got to play out both things, see little glimpses of it, and then that made the show do this and now here we are. Yeah, exactly. And I think the important thing we've always said is that the game is about the",
            "start": 121.04
        },
        {
            "text": "out both things, see little glimpses of it, and then that made the show do this and now here we are. Yeah, exactly. And I think the important thing we've always said is that the game is about the heroes and the show is about the villains. But the cool thing with a game is that we have this medium in between and you actually get to play the villain. You get to play Paul Serene and that's who you were when you did the junction and essentially he's the leader of Monarch. So he's deciding the future. Oh, we're looking at the timeline here. Good visual aid. Look at you. It's like you've done this demo before, maybe. And essentially, um, this cool cinematic we had there, you actually see the same scene as you said in the live action show and it's a crossover. And that's something we've worked really hard. We've copied the environment art. We have the character scanned in. We have the facial performance all the way down to the costume details. And um, as a player when you're playing, it's",
            "start": 167.36
        },
        {
            "text": "really hard. We've copied the environment art. We have the character scanned in. We have the facial performance all the way down to the costume details. And um, as a player when you're playing, it's always good to look out for things cuz you're constantly going to see this crossover in and out. So, what I did there, uh, this is where you get introduced to the chron sources, uh, which you can use to, um, okay. Uh, customize the time powers you have. Okay. So, it's like an upgrade system. Yeah, we'd rather call it probably customize. It's relatively light. Uh, but you can do Oh, why am I going into collectibles? Exactly. Yep. On the timeline, press Y. Cool. Here you go. Oh, I see what you mean by Okay. Just like increased strength, things like that. Yeah. And I'm How am I earning the points to the upgrade points? Uh, you have to find uh the corona sources uh laying around. So, you have to use time vision uh to be able to make them out and then you just go and you kind of suck them up",
            "start": 202.8
        },
        {
            "text": "to the upgrade points? Uh, you have to find uh the corona sources uh laying around. So, you have to use time vision uh to be able to make them out and then you just go and you kind of suck them up just like you do with your real pronouns. You find Yeah, you find the pronouns. And why Greg, you might want to explain why everything is kind of has this blue tint. Yeah, of course. So, basically, this is one of the major things in Quantum Break. So this is a stutter. And a stutter basically is kind of the the signs of the apocalypse. The apocalypse in Quantum Break is that everything freezes. There's no fallout. There's no future. It just stops. Okay? And that's the saddest thing of all. And essentially Jack has the power to kind of move through these stutters without any equipment or anything at this point. So basically, you can see the world was frozen and now it's not. And it introduces a lot of cool variety. And um you'll see ahead in this demo that it gets more interesting ahead.",
            "start": 251.2
        },
        {
            "text": "at this point. So basically, you can see the world was frozen and now it's not. And it introduces a lot of cool variety. And um you'll see ahead in this demo that it gets more interesting ahead. Yeah. I mean know moving with time and the apocalypse. It's pretty interesting to begin with. So don't I don't think you have to underell it too much. Well, now when we were playing before, right, you I was playing and screwing around. I I didn't have all these. They started coming. The time vision, time stop, dodge. These are all like abilities you have to use in your battling, right? Correct. So basically, we have not just not just battle. That's the important distinction. You do have to use them um when you navigate through the uh environments as well. Yeah. So um basically at this point we have four time powers. And as you just quickly saw with Thomas, he used time vision which essentially allows you to see things in the environment and even things you can essentially use which as you",
            "start": 289.92
        },
        {
            "text": "four time powers. And as you just quickly saw with Thomas, he used time vision which essentially allows you to see things in the environment and even things you can essentially use which as you can see, we call a time trigger. So in this case, there's certain objects in this environment that you can rewind. Gotcha. Okay. And saying that, we also have great combat. So we have time powers. So far in act one, we gave you a time stop which is the ability to freeze things and it's really cool cuz if you can trap a few guys in there, you can drop them all at once. Uh, we also have time shield which allows you to protect yourself from attack. And then time dodge which really allows you to quickly get out of the way if there's a grenade, bump into guys, and even when you do it, you get a quick boost of time so you kind of have this really cool slow motion moment where you can uh attack really well. Now, at any moment when you guys are sitting around pitching ideas for Quantum Break",
            "start": 327.92
        },
        {
            "text": "quick boost of time so you kind of have this really cool slow motion moment where you can uh attack really well. Now, at any moment when you guys are sitting around pitching ideas for Quantum Break, did someone try to talk someone else out of doing this? Like, let's do live action mixed with this game mixed with this cuz it seems like a recipe for disaster. I mean, Night Trap was the best we ever had. And here, but but that really is the thing because you say Night Trap and literally that's what gamers and people who played games for a long time, that's what they still think. I know, right? The expectation with the live action literally so low that everybody's going to be really positively surprised. The bar is down here. Come on. Night Trap was what, like, 5 years ago? Like come on. I mean, we definitely we had a pretty nice decent budget for the live action. Sure. No, I mean that that's the thing of like looking you like again you didn't get to see it but like the",
            "start": 368.56
        },
        {
            "text": "Like come on. I mean, we definitely we had a pretty nice decent budget for the live action. Sure. No, I mean that that's the thing of like looking you like again you didn't get to see it but like the character of this girl that I met on the like quad of the campus right in front of the library then to see her in the in the uh live action stuff it didn't seem jarring. She looked just like she should look. Exactly. And I think the other point is uh it's a live action show. It's not a cinematic. It's it's a live action show. It's it's extra value and it's a live action show that you can change. It's not you just press play and you watch it. You choose what you want the show to tell you and the show adapts to that. So, it's really exciting and as you said, it's been a long time, but there's never been anything like this I was. So, it's going to be fun for everyone. When you made your choice in the junction, that already affected the things you can like see here, uh, like the email, how it",
            "start": 407.84
        },
        {
            "text": "been anything like this I was. So, it's going to be fun for everyone. When you made your choice in the junction, that already affected the things you can like see here, uh, like the email, how it reads, it would be different depending on what you chose. Uh, this thing here would be different. Gotcha. So, yeah, this is the PR contingency plan. Basically, um, when Greg was playing, you chose the PR path. You chose the hardline, it would have turned out to be very different. So you would have had the hardline puff and you would have had an email detailing the hardline and this is only the beginning. We have four junctions and another three ways you can twist the story. Okay. And on top of that confusing is this at at work when you were doing this. It's been so challenging but also so rewarding because as you can see it it works and it's really exciting that you can see your influence on the world and you just get to innovate and do new things and as a storyteller it's it's more",
            "start": 445.12
        },
        {
            "text": "rewarding because as you can see it it works and it's really exciting that you can see your influence on the world and you just get to innovate and do new things and as a storyteller it's it's more opportunity. Yeah. It's really uh it's it's been about like let's be let's carefully choose the things you can impact and let's make sure that they actually things change. So it's not like it's not like hundreds of different changes. It's something that everything's sort of well thought out. Exactly. We always really we focus on it and then as you said challenging wise the other thing is combine player choice with time travel. And that's where we have maps and it's just been it's been challenging. You have to imagine you have this like the craziest white boards and string theories and things stretching out. Yeah. in the dialogue here that they're talking about some **** being holed up in A3 or somewhere. Even that's tied into your choice. Correct. Yeah. Yeah. And like I said, this this",
            "start": 486.32
        },
        {
            "text": "stretching out. Yeah. in the dialogue here that they're talking about some **** being holed up in A3 or somewhere. Even that's tied into your choice. Correct. Yeah. Yeah. And like I said, this this would have changed if you chose the other thing. Even though the enemies are the enemies, I'm still going to have them be the nice enemies. The woman trying to protect the library did not deserve to die. Kevin, did she deserve her family to be threatened? Maybe. I can't say. So, that was just the time stop that Thomas threw down. So, as you can see, it froze some things. And it's just funny all those explosives were very handy there. Yeah. Yeah. Very systematic. And the cool thing, as I said, as you saw, he took out a few guys at once with a time dodge. Quick bit of um slow-mo so you can take some guys out. Oh, time shield. He's got time shield so we can block some attack and get back to it. And I think you can attest to it at the start of the game, Greg, that we really throw you in the",
            "start": 524.4
        },
        {
            "text": "some guys out. Oh, time shield. He's got time shield so we can block some attack and get back to it. And I think you can attest to it at the start of the game, Greg, that we really throw you in the deep end. And Oh, yeah. Right into it. Yeah. And that was the thing I think that was lost. You know what I mean? Like obviously the first ever trailer for Quantum Break when the bullet's coming, the glass is going, there's a woman of stuff. I feel like as I've been lucky enough that I can step back and be like, I don't I'm already sold on this game. You know, I've been a Remedy fan for a long time. I don't need to see more. But it was that thing of playing it where I was like, oh, time travel. Yeah, I'm doing this. And I was like, oh right, it's going to be a shooter. I kind of forgot about that part where I'm taking cover and jumping out and getting head shot and I'm the final guy you kill. It goes slow-mo and you see his body. I was like, right. Yeah. Yeah. Yeah. And I think as well for",
            "start": 563.28
        },
        {
            "text": "part where I'm taking cover and jumping out and getting head shot and I'm the final guy you kill. It goes slow-mo and you see his body. I was like, right. Yeah. Yeah. Yeah. And I think as well for us like we have such a great story we want to tell and we also want to Remedy has always been mysterious because we don't want to spoil anything and I think having a bit of mystery in all these things has been really great to get people thinking what we are and what we aren't and it's been exciting but we're getting to the point April 5 where everyone can discover what I really want to point out here because we've gotten some uh feedback on the fact that in the trailers like like I pretty much steamrolled the enemies here is very early on in the game so the enemies you meet really can't match your powers you Jack is on his way to become a superhero. So, he has his powers. Uh, but later on in the game, um, the Monarch soldiers also get Crona technology which they're able to also warp through",
            "start": 598.4
        },
        {
            "text": "powers you Jack is on his way to become a superhero. So, he has his powers. Uh, but later on in the game, um, the Monarch soldiers also get Crona technology which they're able to also warp through time and do these things. Um, so it seems like you're pretty overpowered here. And in some ways, you are, but but that's the point. Not to mention, you played that fight hundreds of times in development. If you were playing, it would have been a very different. Well, yeah, I would have had more head shot. Yeah, true. I'm just I'm just glad that one enemy playing this time. That one enemy is not floating down anymore. For longest of time we had that bug. The dude was always floating down. Hey, don't talk about the bugs. It's It's charming. It's charming. People always excitedly know. All right. Time dodge. Time shield. Just called them out. The hell is that? What's old Nokia rubbish thing. Hello, Jack. This is Beth Wilder. I'm You're the one my brother was looking for. I'm the one who was",
            "start": 634.24
        },
        {
            "text": "Time dodge. Time shield. Just called them out. The hell is that? What's old Nokia rubbish thing. Hello, Jack. This is Beth Wilder. I'm You're the one my brother was looking for. I'm the one who was attempting to rescue your ass until you decided to go on a gunlazing ship parade through that warehouse. Now, listen closely. You're at the outskirts of a Beth is another great character in the cast of Quantum Break. So, we have obviously we have these really great Hollywood actors that have come in. Uh we really have this diverse cast. We have John Ashmore as Jack Joyce. We have Aiden Gillan, Littlefinger as Paul Serene. Uh, and Beth is another one along with Lance Reic and Dominic Monahan. I was going to say give Dom a shout out otherwise I'm a hero. Yeah. Yeah. Yeah. For sure. He wears my shirts on his show. I'm very excited. Team Fat coming up. Philippines episode. Be excited. But yeah, this thing's been so brilliant collaborating with these actors. They bring so much to the performance",
            "start": 672.8
        },
        {
            "text": "on his show. I'm very excited. Team Fat coming up. Philippines episode. Be excited. But yeah, this thing's been so brilliant collaborating with these actors. They bring so much to the performance and so much to the story. So, it's it's been great. Well, it's fun to see. I mean, like that was always the thing, you know, I had the you know, when I met Dom and became friends with him, he had been he was like, I want to do more video games. You know what I mean? Like it's cool to see that cuz I think for a while there it was no nobody touched video games with the 10 foot pole if they were a real actor quote unquote and then it was all right now they are but they're just doing like it's clearly a giant payday for them right and it's a way to put it on the box and get promotion and now it is like no I want to come do something really cool and so you guys are using them in the game you're using them in these the live action TV show really it's it it's about because we can really bring their",
            "start": 727.12
        },
        {
            "text": "no I want to come do something really cool and so you guys are using them in the game you're using them in these the live action TV show really it's it it's about because we can really bring their performance into the game you know we really have worked hard to get rid of the whole uncanny valley thing it's really is about the performance about the marquee names. It's about people who can actually perform well. Yeah. And I think from them collaborating with us, they always said that Remedy really treated the characters as we do, like we're characterentric games with such attention to detail and then once they got used to the technology of motion capture and obviously have the Norflight storytelling surface capture, they just delivered these brilliant performances and they took what was on the screenplay to a whole other level which has just been brilliant. I think yeah, players are really in for a treat. Getting these great actors interacting and their play experience is awesome.",
            "start": 762.24
        },
        {
            "text": "on the screenplay to a whole other level which has just been brilliant. I think yeah, players are really in for a treat. Getting these great actors interacting and their play experience is awesome. Game's beautiful by the way too. Thank you. Yeah, the team works so hard. The rendering guys and obviously the environment artists. It's um can't forget the character team. I was going to course programmers. Yeah, really talented people at Remedy and really really cool to you. And I mean we're a pretty small team. We're about 115 right now. I think at its highest we're something like 130 and that's the entire company including HR and everybody. It's not It's not a big team all the way in sunny Finland. Sunny Espa die guard. Oh, we got a shotgun. Yes. Whoa. All right. And one thing we were saying which is always fun is a lot of the um the facial a lot of the faces that we have in the game are actually exy employees or friends. Continuing your long-standing tradition. Oh, there's the girl",
            "start": 797.44
        },
        {
            "text": "which is always fun is a lot of the um the facial a lot of the faces that we have in the game are actually exy employees or friends. Continuing your long-standing tradition. Oh, there's the girl of being cheap. Not at all of like like I said, we just we need these performances and it's great. Obviously, Sam Lake was Max Payne and there's a lot of great performances and faces in here. There we go. Remember that? I remember. Yeah, he did it in live action. That's one of our intel objects which are kind of props that cross over. And of course, that's Amy Ferrero. So, you chose the um PR path. So, here's Amy. You chose the hardline. You'd meet a different person who actually didn't get didn't get shot in the head. And even the the way Monarch uh treats you would actually um differ um change. So now one of the things that we did in the last one that we didn't get a chance to talk about I don't I don't know if we'll see one here. You were talking about ripples in terms of like I walked",
            "start": 846.72
        },
        {
            "text": "So now one of the things that we did in the last one that we didn't get a chance to talk about I don't I don't know if we'll see one here. You were talking about ripples in terms of like I walked over and there was an equation and if I hadn't interacted with it game would have been fine. Everything would have moved on. But the fact that we interacted with it meant that the live action changed, right? Yeah. Yeah. You essentially got like this deleted extra scene and there are more moments like this. They're usually quite hidden. And for us, we really want the players to investigate and find all the chronal sources to get the upgrades and find all the collectibles. And the other thing I spoke to you about before when you were playing is that we really have this whole array of optional storytelling from radio shows. We didn't interact with any radios. We have radio shows that basically adapt to your junction choice. We have two different radio hosts essentially. You choose the PR one.",
            "start": 891.12
        },
        {
            "text": "from radio shows. We didn't interact with any radios. We have radio shows that basically adapt to your junction choice. We have two different radio hosts essentially. You choose the PR one. One arc replaces the radio host and you get this really kind of robotic lady who's telling you the story and she plays a very different type of music to the other guy. We really try to influence the world as much as we can. That's cool. You want it to feel like it's change the story. That's that's the thing we're trying to do. And so, you know, it's like you're making two or infinite games, which I'm sure isn't at all a headache. Yeah. Yeah definitely. But I think the important thing to always say is that as much as we change the story, we always have one ending for the game. Sure. And there's a very good reason for that which I can't wait for players to discover. So, it's you're cheap. No, not at all. Not at all. No, but I mean, you can Johnny cut corners over here. It's not not saying that",
            "start": 927.04
        },
        {
            "text": "good reason for that which I can't wait for players to discover. So, it's you're cheap. No, not at all. Not at all. No, but I mean, you can Johnny cut corners over here. It's not not saying that there would be a sequel or anything like that, but I you always think about franchise and if you you know Mass Effect and Mass Effect you know is awesome awesome trilogy and DSX is like one of my favorites, but it's like you can have multiple endings, but you only you know that only one is real. When you move on to the sequel, you're like, well, that's not what I chose. So, okay, let's see if we can get through this incredibly difficult puzzle. All right. Oh, a little bit too difficult for you, Thomas. Screw you door. Play this a few more turns. All right. So, as you can see, we are also using the mechanics for more than just combat. Oh my god. You're just You're just like them. Shooting. I saw them on the way in. These geared up soldiers that blink in and out. Okay. Actually, we didn't",
            "start": 963.2
        },
        {
            "text": "the mechanics for more than just combat. Oh my god. You're just You're just like them. Shooting. I saw them on the way in. These geared up soldiers that blink in and out. Okay. Actually, we didn't show it to you. Obviously, we went through in the live action show, you do see these geared up soldiers. Oh, yeah. Yeah. Maybe we'll meet them. I was going to say, yeah, foreshadowing, right? Yeah. Yep. I need to know what's going on. So, how long have you guys been working on Quantum Break? Uh, I've been working on the game for almost um just under four years. Okay. So, I was there from pre-production. Uh before then, it was I guess another half a year. I'll just quickly run through. I said it's been a long production, so we're really happy to be here. And it's um April 5, it's out. So, we're It went gold as it's been announced. So, yeah, Sam had the biggest bottle of champagne. We missed it. We missed it. We were over here showing the game. So, I hope they saved the glass. I mean, the game",
            "start": 1010.56
        },
        {
            "text": "went gold as it's been announced. So yeah Sam had the biggest bottle of champagne. We missed it. We missed it. We were over here showing the game. So I hope they saved the glass. I mean the game game was announced like 013 so it really hasn't It's been 3 years. Hasn't been that long but it's been another longish Remedy project. And and there's many reasons for that. It's like we do want do we do definitely want to make more games and make them like make them quicker but we also want to keep the team size like relatively small for many reasons. You know it still has that family kind of atmosphere and if we go to 00 people then the financial risks are always almost of course always pretty pretty crazy. I think as well just trying to obviously we've really innovated with this. We have a live action show that adapts and the collaboration with these actors and scheduling and a whole variety of things but we've always wanted to tell the same story in a lot of ways and it's just",
            "start": 1059.84
        },
        {
            "text": "have a live action show that adapts and the collaboration with these actors and scheduling and a whole variety of things but we've always wanted to tell the same story in a lot of ways and it's just been wanting to tell that story and wanting to really innovate and bring it all together. So yeah the concept of the story and you know the time travel and all that stuff it's it's been there since day one has has been you know the feature of that you should be able to like um shape shape the story. Um what are you doing? Ah so this is for all the secret. Well that's all I'm ruining it. That's true. I was going to say I was like that was one of our Don't get me wrong. Guys on Game Facts are going to they already got it. But I'm the supposed to be the PR guy. This is going terrible. All right let me show you guys the ending too. Might as well. So as you can see we have a lot of ways you can kind of jump around and explore. And um what you saw in the live action show which we worked",
            "start": 1099.12
        },
        {
            "text": "let me show you guys the ending too. Might as well. So as you can see we have a lot of ways you can kind of jump around and explore. And um what you saw in the live action show which we worked hard on as well was it wasn't a dry dock and so is this. So we really tried to blend the environment. So you'll notice in the flow that the junctions are always in the same place as the show. That way we have this connection right? And once again as you said the key word we always use at Remedy is foreshadowing. Is that a word we're using? For sure. Yeah. In story like always. It's a key word. That's the thing. If you if you have it without that things can just pop up on people and we want it to be an epiphany that you understand rather than a shock that you don't. You're using a lot of fancy words there, B. Well they understand. Okay. Who's that? The door. Uh oh. Did you forget about me in there? Nope. That's just Amy. That's good. I was like what? What happened? I was like wait",
            "start": 1141.44
        },
        {
            "text": "words there, B. Well they understand. Okay. Who's that? The door. Uh oh. Did you forget about me in there? Nope. That's just Amy. That's good. I was like what? What happened? I was like wait no it's just on the other side of the door isn't it? Finally. Oh here she is. Good work. Thanks a lot. She's kind of being a jerk about it. Kind of kind of wish I told her to die. Use the terminal up here. Should check out what's on the screen. Mr. One of our radios for more optional storytelling. And as you can see there you actually collect the optional storytelling which is pretty cool. And you can see it on your timeline man. Exactly. So let's check out the screen over here, Thomas, behind you. Okay. The other one. Sorry there's lots of screens. Uh you behind you. Where she's looking at? Yeah where she's looking. We basically have this um we blend live action footage in the game as well. Oh so this is actually a Riverport News Network uh broadcast which basically in your choice",
            "start": 1181.92
        },
        {
            "text": "at? Yeah where she's looking. We basically have this um we blend live action footage in the game as well. Oh so this is actually a Riverport News Network uh broadcast which basically in your choice you chose uh PR PR which basically meant that the media was manipulated and in that there was Amy who was in front of a green screen before. I don't know if you noticed. Yeah. She actually gave that. Gotcha. And said that Jack Joyce was the bad guy. God after everything we've been through Amy. Yeah. She had to do it to save her family though. Spoilers. I understand. or at least the threat of our family. Kevin's saying off camera I should Kevin should have gone with the hardline approach rather than the PR approach. That's the cool thing. You can you can play it how you want. So Kevin you're in for a treat with the other one. You get a different character here who's like Nick Masters is just hilarious. He's a Yeah cool character. I think you're right. Okay come on. Open the door. She's",
            "start": 1232.4
        },
        {
            "text": "in for a treat with the other one. You get a different character here who's like Nick Masters is just hilarious. He's a Yeah cool character. I think you're right. Okay come on. Open the door. She's looking at her stocks. Stay in contact. See what's happening on E Trade right now dude. Buy sell Monarch. And the other thing that we were kind of chatting with with the show which we didn't get to show but obviously players when they get it they will is we have so much of the brain and we have Monarch Solutions in there. We have the actual the same costumes that the enemies have they're in there and we really That's your whole thing with the seamless transition right? Exactly. We worked with Lifeboat who were production company and they really catered for us and blended the two experiences. So you're not going to get a disconnect. Joyce's location. Heard his brother scream like a **** when he died. Damn. When he shows his face I'll make him do the same. Son of a.",
            "start": 1272.0
        },
        {
            "text": "two experiences. So you're not going to get a disconnect. Joyce's location. Heard his brother scream like a **** when he died. Damn. When he shows his face I'll make him do the same. Son of a. So a new time power. So this is time blast which essentially creates this unstable bit of time which as you can see is quite destructive um as stutters are. Is that the final power? No. No. There's there we've got more. Oh the major one coming up is actually time rush which unfortunately we're not going to show but it's we've seen in quite a few demos and players are going to love it. It's the ability for you to run really really quickly and then perform this awesome take down which is which is just very rock and roll and fun. So how did it work? You know you're talking about right? What's No it's okay. What's about to happen? Whatever's going to happen let it happen. As we were mentioning the variety increases. We have like obviously as most games we have different enemies",
            "start": 1311.68
        },
        {
            "text": "What's No it's okay. What's about to happen? Whatever's going to happen let it happen. As we were mentioning the variety increases. We have like obviously as most games we have different enemies that progress. And this is one of our heavies who obviously pushes Jack to another level to really use your time powers to survive. Once again Riverport Heavy Industries. That's where the game is set. Oh time shield. I'm out of ammo on the shot. Uh-oh. And yeah we have always um the environment has been really cool. They've added lots of like dynamic props. So when you're sitting there and you're doing your time powers stuff's flying around and it just the cool thing is whenever you watch it creates like a different experience which is really fun for me. Oh lord you're brave. Close. Oh really? Man time blast. Oh that could work. Oh crap. He's not in there. Yeah. Oh and that lamp. That guy was back. Oh my god. Oh my god. I usually just time blast him and he just drops. That lamp is",
            "start": 1363.12
        },
        {
            "text": "Man time blast. Oh that could work. Oh crap. He's not in there. Yeah. Oh and that lamp. That guy was back. Oh my god. Oh my god. I usually just time blast him and he just drops. That lamp is already going to be a meme. I can see it already. Time lamp. Timeline. All right. So and yeah we have some cool verticality in here as well. And um yeah it's it definitely gets more and more challenging. And so that was the shield you just dropped. And I like that you drop and it pushes that guy back right? You were saying it kind of acts like melee. Yeah just like a melee. So you can essentially pop dudes away and it's um and I guess with time do as people may have seen you essentially create this tiny bit of slow motion. As you can see as well like we have all these different meters so you can just keep throwing different time powers. You're not restricted and as you notice like Thomas is not really in cover. He's flying around. He's constantly moving constantly using his time powers.",
            "start": 1416.72
        },
        {
            "text": "can just keep throwing different time powers. You're not restricted and as you notice like Thomas is not really in cover. He's flying around. He's constantly moving constantly using his time powers. Even jumping on things. It's another opportunity. So bit of a crazy one if you ask me. But hey it's your game. Hey it's working. Yeah. All right. Slowmo. Slowmo. Yeah. Yeah. Can you light it? No. Got him. And you can use time. And you can use time vision as well. And you can see guys ahead. And one of the cool things I like to customize is that you can customize it with time dodge and time rush. So you can say whenever I time dodge or time rush. Oh all right. Looks like you're going to do it. Let's see. What do I want? When recovery. And yeah you can obviously tweak this whenever you want but um I like having time vision on. So whenever I time dodge I get an instant boost of awareness. That way I can be like guy behind there time stop them run around drop them go around. Is that",
            "start": 1462.48
        },
        {
            "text": "but um I like having time vision on. So whenever I time dodge I get an instant boost of awareness. That way I can be like guy behind there time stop them run around drop them go around. Is that so? Is that where like extra activation on that one? Exactly. It's another way to kind of customize and blend the abilities and obviously increase the power of the time stop and so on. Oh he didn't see her. And one of the cool things is that you find is that when you get time rushes essentially it confuses enemies. So you'll be behind a couple you'll run and they'll be like \"Where's Joyce? Where's Joyce?\" Gotcha. Gotcha. Gotcha. Gotcha. And um another cool thing we've um ridden in is that when you're playing the game like the enemies actually react to you differently. So as you play through each act their their dialogue actually changes. So at the start of the game like who the hell is this guy? And at the end they're like \"Holy crap it's Joyce.\" Gotcha. Gotcha. So when",
            "start": 1508.08
        },
        {
            "text": "through each act their their dialogue actually changes. So at the start of the game like who the hell is this guy? And at the end they're like \"Holy crap it's Joyce.\" Gotcha. Gotcha. So when you're using your time powers Yeah. Exactly. At what point do I get a cool costume? You said \"I'm becoming a superhero.\" That's a good question. Good question. Oh. uh can't say but um like I said I think we always as I think the key thing for us is grounded so um we really want to make it an experience and I think we may look at Jack like that but is it a question if Jack looks like does he think he is a super sure sure yeah I really like steamrolling the enemies here like I know people are like oh the game's way too easy it's just like this this is where it's still supposed to be easy and give you that sensation that you're in you are a hero and you're in control but uh when we get to the end it'll Yeah of the demo the important thing maybe you can talk about it but I think looking at",
            "start": 1543.84
        },
        {
            "text": "give you that sensation that you're in you are a hero and you're in control but uh when we get to the end it'll Yeah of the demo the important thing maybe you can talk about it but I think looking at the game is one thing but obviously playing it's quite intense and frenetic and it's and this maybe the thousandth time I'm playing from this of course but yeah that's that's the thing for me that whenever I play Breakers I've been developed for a while it always it feels fresh and it feels different which for me and I I love the way it feels and everything else but for me it's the story like you know what I mean like that opening of walking through when and I I know you're not showing too much of it or whatever but walking through playing and talking to different people and like what's happening I'm like I'm fascinated by what's actually going on right now. And that that was you know that that was not easy to pull off that you have an entire like first acts first level is is very",
            "start": 1584.8
        },
        {
            "text": "I'm like I'm fascinated by what's actually going on right now. And that that was you know that that was not easy to pull off that you have an entire like first acts first level is is very sedate. It's very adventure game kind of you know pacing and that's not that's a difficult discussion because like you know you play test the game and it's very slow and like will players like it? It's like it you have to have that right pacing. You have to let people like soak in the atmosphere and learn the backstory and everything. And that's as I think that's the reason for us. We're just letting the game do the talking now because it is complicated. But the point of that was obviously to soak you into the world and then to blow you away when the world kind of when you start actually getting to the real game. Exactly. Exactly. And that's the thing the story does build and there are more moments like that where we like pacing is so important in these type of games. So we really I think",
            "start": 1619.28
        },
        {
            "text": "to the real game. Exactly. Exactly. And that's the thing the story does build and there are more moments like that where we like pacing is so important in these type of games. So we really I think we've done really well with the pacing. So you're going to get more of those experiences. And yeah I'm glad to hear you love the stuff because yeah that was was challenging to pull off but it's really exciting. And we don't want to show it to players because we want them to experience it. Yeah. It's awesome. That's the thing. We want the tone to be there and Yeah. We want them to have the same first time experience that you had. We don't want them to see it. But Oh the stutter. Yeah. We have micro stutters here which is cool. As you see another stutter where the world froze and the other interesting thing as you play is that the stutters increase. So Oh okay. Okay. It's another That's the whole thing right? They talk another subplot that the world is ending. That exactly. We",
            "start": 1656.64
        },
        {
            "text": "other interesting thing as you play is that the stutters increase. So Oh okay. Okay. It's another That's the whole thing right? They talk another subplot that the world is ending. That exactly. We haven't talked a lot about that but that's what's set up right? The time is now. I believe it was you know Dom who said time is an egg and the egg is **** So this is the end of the world right now. It's all coming apart. Yeah. Yeah. You're trying to fix it or figure out what's going on. And that's the thing that we've really worked with is that essentially you're watching Jack Joyce playthrough but you also are essentially him. So you're discovering the story as you play and you'll discover more. I love stutters. They're so cool. I have to give a have to give a shout out to our engineering. Like we are really really pushing the Xbox One. Like definitely. Oh my god I know you're terrifying me. You have all that all the real time visual effects. We have huge amount of like",
            "start": 1687.92
        },
        {
            "text": "engineering. Like we are really really pushing the Xbox One. Like definitely. Oh my god I know you're terrifying me. You have all that all the real time visual effects. We have huge amount of like resources are spent on like audio. See all the audio changes when you're in the starter completely. Lighting changes everything. It's just it's been Yeah like I said such a talented fantastic team. And like I said props to the coders and everyone. Even the lighting the lighting is brilliant. I don't know if you've seen but we have this great kind of uh almost like a dev diary about the sound and it goes into how every gun. He's still moving in there. It's very slow. Yeah he's still moving. All right. Lining up a shot. And that guy's actually one of our environment artists. So see you Martin. Is it Martin? No it's not. Oh he's there. Don't worry. I've shot him a few times. Like trust me I know I've All right. at this guy again. Let's see if you can go better, Thomas. Ah",
            "start": 1724.24
        },
        {
            "text": "you Martin. Is it Martin? No it's not. Oh he's there. Don't worry. I've shot him a few times. Like trust me I know I've All right. at this guy again. Let's see if you can go better, Thomas. Ah reload. Come on. What are you doing? What are you going to do? Huh? If I If I only know knew how to aim. I was going to say I'd just time blast him. Oh your bullets. See if Greg was playing it would have been over like just done. This guy first time experience. I was like \"Wow have you done this now? All right let's continue. I love using the dodge power as just a way to cover ground. Yeah. Yeah. Yeah definitely. It's um definitely a cool one. And Jack and there's Amy. I did some digging. This operation is harvesting some kind of fuel. As you can see there's a lot of Greg boxes there. Is it Greg Miller? Is it Greg Louden? Who knows? Question. Who knows? Who knows? I want to say it's Greg Miller. over the year. But we can we can say it's both to all the Gregs out there. Gregs we",
            "start": 1765.44
        },
        {
            "text": "Is it Greg Miller? Is it Greg Louden? Who knows? Question. Who knows? Who knows? I want to say it's Greg Miller. over the year. But we can we can say it's both to all the Gregs out there. Gregs we got you covered. Don't worry. They stole from the university. This operation everything's linked to the CFR somehow. And yeah like I said I I love the environment on our game. We really pay attention to everything. And that's the thing with games and animation. I don't think people think about it much but everything's designed. You get nothing for free. Every prop needs to be handplaced. It's not like to shoot in a film where you place a camera and sometimes you get lucky. Everything has to be placed. build the world every screen everything. So Dr. Sophia Amaral now Sophia was in the very first 013 trailer. She was she was the one that you you see Jack pull out of the stutter and I think the glasses and all those scenes are still in the game. They've kind of evolved over time but",
            "start": 1833.68
        },
        {
            "text": "first 013 trailer. She was she was the one that you you see Jack pull out of the stutter and I think the glasses and all those scenes are still in the game. They've kind of evolved over time but they're still there. So I've seen some players being like I wonder if that's just a demo. No it's in the game. It's definitely there and it's evolved and changed. And yeah I mean that's one of the things people like you know any creative endeavor you have it's like it strikes me as funny as people think when a game is announced let's say 3 years ago that okay 3 years ago developers knew exactly what the game will be. Of course not. Like it's a you know you explore and you figure things out and you find you find something out that okay we thought it was a good idea then you make a prototype and you realize ah this actually sucks like we have to come up with something else. And that's what it is. like it's it's you know you're on the road of discovery. So it's not like at that",
            "start": 1872.32
        },
        {
            "text": "prototype and you realize ah this actually sucks like we have to come up with something else. And that's what it is. like it's it's you know you're on the road of discovery. So it's not like at that point you announce the game oh they know exactly what they're going to do for the next three years. Do you guys feel I mean at Remedy at least that gamers are getting better about that. I feel like you know as we I feel like we always talk about our our fan base kinda funny but I mean games fan base is being they're dialed in. They know the working of what's happening right the majority aren't hung up. There's a lot more insight as well. Even the fact we're here sitting with you talking about you can create a stutter sometimes if you haven't. It's really cool. you just destroyed a thron kind of barrel and essentially it just causes a stutter. But yeah no definitely I agree. I think players are understanding it more and more but I think the other important thing to say is we've always",
            "start": 1911.2
        },
        {
            "text": "of barrel and essentially it just causes a stutter. But yeah no definitely I agree. I think players are understanding it more and more but I think the other important thing to say is we've always kind of known the story we wanted to tell. We've always had Jack Joyce and we've always had this this idea of stutters. It's just obviously evolved as we design and as we progress. So but don't worry the ship crash is still there. Sophia's still there. It's um it's all it's all crazy and it's all awesome. It's just for us we always want to show new things. So yeah all the old things are still definitely there but they're not old. They're fresh and left on. All right that was quick to Thomas. Getting better. And yeah this is one of our Chron harvesters which is really cool. That's how we get the Quantum Break too. You're going to be an expert. All right so I might just die on purpose here. No no we we want to show a lot of We want to like I said we want to let the game do the",
            "start": 1946.0
        },
        {
            "text": "get the Quantum Break too. You're going to be an expert. All right so I might just die on purpose here. No no we we want to show a lot of We want to like I said we want to let the game do the touring so let's keep pushing. You can see here Sophia Emerald booming in the background. Whoa. Coordination. That's the thing. Like we've really we programmed the AI to really attack you and always flank. So we don't want you to stay still. We want you to be on the move. And these are like armed Monarch Solutions kind of troopers and they're going to get you if you don't use I feel like coming back here and watching Sophia's presentation. Hey is it over? It's over though. And the computers are destroyed. No. Oh. It's interesting. That's the thing with because we do have all these time powers and variety. Like I I'm always spamming time vision to see where people are but Thomas is just I just never like those things. It's like even in Batman when I play it as awesome as the detective",
            "start": 1982.4
        },
        {
            "text": "and variety. Like I I'm always spamming time vision to see where people are but Thomas is just I just never like those things. It's like even in Batman when I play it as awesome as the detective mode is like I you know I want to see the real I live in detective mode. I'm not Skype call. I think one interesting thing obviously we do have explosives that you can shoot but one of the core things in stutters is that as you saw we have stutter combat as well and if there's an explosive barrel and you shoot it Yeah. because time rewinds in stutters the explosive barrel rewinds so you have this reusable singularity. Exactly. Exactly. Exactly. Well what Kevin Singularity Yeah. Our fans like that joke cuz I used to make fun of Colin about it a lot. There's his game Singularity. Yeah. Singularity. Singularity is an awesome awesome game. Shout out to Raven Software. That game was lovely. Yeah these powers rewind things. So once again Thomas is spoiling the whole act of finding out what",
            "start": 2035.6
        },
        {
            "text": "Singularity is an awesome awesome game. Shout out to Raven Software. That game was lovely. Yeah these powers rewind things. So once again Thomas is spoiling the whole act of finding out what to do. So players forget this. Just Thomas just he's showing you how diverse it is and how many things. Look you're going to ruin another source. Oh no. You ruined it. Maybe I just wanted to have a show this thing. No big deal. And once again once again we have Amy talking here. If you did a different choice you'd have Nick. And the thing is they always they do change the story. They provide different insights. I don't want to dialogue details and everything. Exactly. The things they're talking about it it changes. So it's like I said I love it as a narrative designer to throw in this stuff and communicate with the writing team like how can we change this? And they really just ran with it. And down to the optional storytelling changing email threads and yeah definitely read through",
            "start": 2087.2
        },
        {
            "text": "and communicate with the writing team like how can we change this? And they really just ran with it. And down to the optional storytelling changing email threads and yeah definitely read through this stuff. There's some really Well that's what you guys have always been known for, right? I mean, is storytelling. You know what I mean? That's what makes me got, you know, when I heard it was this and it was time and I like, \"Oh, great.\" But it was you guys, it gets me excited cuz I know what that means. I know what Remedy means. Yeah. Yeah. Definitely. And it, like I said, comes from Sam Lake and comes from the team. Everyone's a storyteller. We all We love story games. We want to do the best story game. Will's car. This thing This thing has changed so many times as well. You used to have another book in there. Yeah. Yeah. Well, we're down to the details. phone and a key to the Bradberry swimming pool. Not the most obvious clues. Jack, it's Beth. Monarch just got footage of your lady",
            "start": 2128.96
        },
        {
            "text": "another book in there. Yeah. Yeah. Well, we're down to the details. phone and a key to the Bradberry swimming pool. Not the most obvious clues. Jack, it's Beth. Monarch just got footage of your lady friending around some confidential Monarch files. Kind of a big no no around here. Amy. Oh, nice screen. Let's We can allude to this. This is time knife. Let's not show it, but that is one of my favorite things in the game when you play the full thing. Epically long. We have a lot of like stories inside stories. I think that's we're famous for our subplots and additional detail. That's that's one of our brilliant ones from our writer Tyler is just it's spectacular. It's um yeah, very very funny. Don't do anything stupid. Thanks for the vote of confidence. All right, sounds like Amy's out of there. Sniffing to Serene at the dry docks once again. Thomas doing his thing. How do you know all this? You just you just flow through all of our like so well designed. It just tells us these things.",
            "start": 2166.0
        },
        {
            "text": "Sniffing to Serene at the dry docks once again. Thomas doing his thing. How do you know all this? You just you just flow through all of our like so well designed. It just tells us these things. Whoa. Whoa. You say too well. I know. I was going to say, look at this guy. Explosive damage. I know exactly what I'm doing. Once again, I'll bullet pro flatter jacket. It's the chronon core. Okay, so this is um where it starts to get more challenging and uh and also potentially recognizable if you've been following Quantum Break. Yeah. So, a lot of the Gamescom 015 trailer was from here. On top, the area we refer to as ground zero. It was clear that the workshop was at the center of the Monarch operation. I wanted to see what was in there, and it seemed to be the only way to the dry dock. You You're merciless. They could have been talked to. See, double feels like you could have talked to those people. Talk them down. That's not Jack Joyce. He's on he's on a wrecking path to find Paul Serene and",
            "start": 2215.28
        },
        {
            "text": "merciless. They could have been talked to. See, double feels like you could have talked to those people. Talk them down. That's not Jack Joyce. He's on he's on a wrecking path to find Paul Serene and figure out what happened at this point. So, you know, a lot of people are watching Jack run around and kill people, but what is his story? Like, you know what I mean? Like, I don't know how much you've shared, how much you want to share, but what is like his who is So, I guess the brother of William Choice. He's the brother of William Joyce, and I think when you play the game, you can read it a lot in his background. There's emails that talk about it, but basically, he's had a troubled upbringing in a lot of ways. Um, I don't want to allude to it too much as players will discover it, but basically he's kind of he's done a lot of bad things in the past and he's kind of progressed. That sounds just like you, Greg. Maybe it's from somewhere. But basically, yeah, he's he's had a very troubled",
            "start": 2271.92
        },
        {
            "text": "he's kind of he's done a lot of bad things in the past and he's kind of progressed. That sounds just like you, Greg. Maybe it's from somewhere. But basically, yeah, he's he's had a very troubled upbringing in a lot of ways. Even though there was his brother, but they've always been torn apart, so they never really got along and they're just two very different people. And Paul Serene calls him back to Riverport. He hasn't been there for a very long time. The city's changed. Monarch has arrived and Monarch wasn't there when he was there. So, he's kind of still trying to get around those things, but definitely he does he does have a bit of a background and I think the one thing that we mentioned, he has had trouble with the authority figures and he's he is on a bit of a wrecking path at this point. Um, as you'll find when you go through. That's not to say that he'll always be on the wrecking path, but still he he's trying to figure out what's happening. He's kind of thrown into this",
            "start": 2311.84
        },
        {
            "text": "this point. Um, as you'll find when you go through. That's not to say that he'll always be on the wrecking path, but still he he's trying to figure out what's happening. He's kind of thrown into this situation as you saw. you're kind of thrust into action and fortunately for Jack, he's he's kind of been involved in rough situations and now with the addition of time powers and stutters, he can he can kind of even out the odds even though go these guys are deadly. So that's that's kind of a brief overview of the background. But once again, when you play Quantum, as you said, we're great storytellers. There's a story to tell. I want the game to tell the story. So and yeah, obviously there's a lot of questions about William Joyce as well. And that's the thing. It's the game's not called Jack Joyce, it's called Quantum Break. We have a cast of characters. So, it's um we really have this great cast. A lot of you pay attention. Oh, here we go. Oh, you got the carbine. Awesome. All right.",
            "start": 2350.32
        },
        {
            "text": "Joyce, it's called Quantum Break. We have a cast of characters. So, it's um we really have this great cast. A lot of you pay attention. Oh, here we go. Oh, you got the carbine. Awesome. All right. Here's another one of the stutters. As we said, we saw this at Gamescom, but um nice driving, guys. The time lapse stuff, this is something that the uh the visual team we've really experimented with. How do we freeze time? And just capturing if you look at stars in the sky and you look at light and stuff, it always freezes like that. And you can see we have the streams. The world's moving. Exactly. Exactly. So, we've really gone into those details to really capture a frozen world. How long did it take you guys to hone in on that kind of stuff and that kind of style for this? Constantly. Constantly evolving. I think even if you look at um our demos, you can see the way that we're playing with things and evolving. And this is the obviously we're really happy with this current version of it",
            "start": 2387.6
        },
        {
            "text": "evolving. I think even if you look at um our demos, you can see the way that we're playing with things and evolving. And this is the obviously we're really happy with this current version of it, but from many things, years really. Yeah. Yeah. Yeah. Definitely. That's the thing. You as as you can understand as as creators, you can constantly create. So, we've been balancing and tweaking and making things look better and better and tweaking the facial performances. And who are these guys? It's one of the interesting things that people see a trailer like, you know, a year or two ago and they sort of get very attached to how they see the game. And at that point, like everything's still going to change. The lighting's going to change, the level's going to change and all that. And and Yeah. So these enemies, yeah, these enemies are like the Chronon Strikers. So essentially, once again, everyone was frozen, and you're like, \"Oh, this gets easy.\" But no, these guys can walk around. And like I",
            "start": 2436.48
        },
        {
            "text": "these enemies, yeah, these enemies are like the Chronon Strikers. So essentially, once again, everyone was frozen, and you're like, \"Oh, this gets easy.\" But no, these guys can walk around. And like I said, they're, as you can see, you can follow their trails and try to catch them, but they essentially have time dodge. And if you stay still long enough, they'll actually do a take down, which is pretty cool. I wouldn't recommend it, but um yeah. Yeah. Try to take him. Try to You see, there you go. He tried to get you. Now, the one thing I've noticed from when I was playing and when we're watching it now, like is there is no traditional melee is there? Is it just the time? Yeah, all time powers. So, basically, you want to time time stop to freeze them before they get too close, time dodge to push them back, and you want to use your guns or your time blast to really drop them out. That's been another, you know, there's been a lot of discussion about that, but it's like you want to encourage",
            "start": 2476.32
        },
        {
            "text": "them back, and you want to use your guns or your time blast to really drop them out. That's been another, you know, there's been a lot of discussion about that, but it's like you want to encourage players to use the time powers and sort of like having like a traditional melee in there without the use of time powers just it's not that exciting. In saying that, we do have one power that we're not showing is time rush, which allows you to run very quickly and that's been shown in the trailers. Yeah, that's kind of like our trailer shot which is really awesome and I think a lot of players kind of they identify with that and I can tell you it's it's awesome. It's really fun and it's really cool. And it actually um I think in our games, we show you when you uh when you time rush these guys, you can see they have equipment. You want to take them out, you can shoot the backpack and they'll freeze or get out of the way. But you can also when you use the time time rush take down on them, you",
            "start": 2516.16
        },
        {
            "text": "can see they have equipment. You want to take them out, you can shoot the backpack and they'll freeze or get out of the way. But you can also when you use the time time rush take down on them, you actually rip off their equipment and they get frozen. Wow. Well, there you go. Oh, look out. Oh, using a carbine in this fight. Wow. All right. It's like the not so silent judging. Oh, carbine, interesting choice. Here we go. And as you can see, we've really tried to capture the frozen moment. We have like cases in the air and we're really trying to make it like a surreal interesting environment for players. So, you get this. Oh, there's more. I think Thomas may not make this one. Oh, you can H. There we go. Got him. One of the other cool things, if you bump into those dudes, similar to other frozen objects, they'll actually they'll move around, which is always fun, and bump around. There you go. Hide in the bathroom. Guys, this has got Where did that go? Quick. Got him. Got him. Cool. Cool.",
            "start": 2553.76
        },
        {
            "text": "objects, they'll actually they'll move around, which is always fun, and bump around. There you go. Hide in the bathroom. Guys, this has got Where did that go? Quick. Got him. Got him. Cool. Cool. Cool. There you go. Okay. Oh, I don't have Please. Got him. Who never told you what he did in that workshop at ground zero? No, never. As you can see, good old rewind. Okay, we had a trails are crazy. Cool. And even just a prelude to the bad stuff that would follow in that same place later. We're nearing the end. Uhoh. Are you ready? Yeah, I'm totally like I'm not even talking anymore. I'm just watching. I'm totally into it. More about warning signs on the right. What the hell? What is this? What is this? That already happened. The egg is **** Noium. I think this sequence took something almost like a year to get done. Like I said, we always had the ambition of you playing this. So Thomas is playing walking through Will's workshop and experiencing what are we going to see.",
            "start": 2616.56
        },
        {
            "text": "something almost like a year to get done. Like I said, we always had the ambition of you playing this. So Thomas is playing walking through Will's workshop and experiencing what are we going to see. Yeah. People have no idea how expensive in terms of like animation time and and just design this sequence is. Mhm. And like I said, I'm chatting with quite a few developers. They're always asking us, \"How did you do?\" So tried to protect me from surrounding me a puzzle. Once again, we really take the science really focusing on making Yeah, you were talking about it. I don't think we were doing the let's play yet, but you actually had a consultant, right? Yeah, we did. We consulted with a scientist in Helsinki and basically he he kind of proposed a lot of the stuff and we're heavily in like inspired by like Stone and the Hadron Particle Collider. It never failed. It works. It works. Me and my grand extended another year. Please, please don't do this. Hello. Don't hang up. It's Greg Miller",
            "start": 2734.8
        },
        {
            "text": "by like Stone and the Hadron Particle Collider. It never failed. It works. It works. Me and my grand extended another year. Please, please don't do this. Hello. Don't hang up. It's Greg Miller here. Come on. Another thing we paid attention to is kind of the timing of things. You'll see some older monitors and other things that we're trying to tell the production design and tell the story. Sure. Sure. Sure. That's a good point. Counter measure. I hope to god this works. Will it's gone. Come with me. We can survive. You're the only other one who seems nice. What if you want? That's the end of the demo. Oh, that sucks. You suck. What happens next? April 5th. Oh, get out of here with your PR marketing garbage. But no, on April 5th, we'll find out what happens actually. Dude, that's awesome. I'm so congratulations. Like I said, I mean, I've been a fan for a while, but I was trying to keep, you know, pretty much radio silence on it other than the trailers here or there. You know what I mean?",
            "start": 2782.24
        },
        {
            "text": "so congratulations. Like I said, I mean, I've been a fan for a while, but I was trying to keep, you know, pretty much radio silence on it other than the trailers here or there. You know what I mean? It looks awesome. I can't wait. Yeah, we we try to make sure that the story stays, you know, you need to experience it yourself. I mean, the opening premise people, you know, you can find that out. Uh but uh we definitely uh it's it's difficult to demo like a story driven game to mention the live action show and we didn't even really demo that today. But the connection and I think Remedy's known for great stories and I'm really proud to think that we've got another great one to tell. So well it looks great. Ladies and gentlemen, that's Quantum Break April 5th. Round of applause at home for these guys from Revity. Thomas Greg. Thank you Kevin. Thanks Kevin. Thank you. No please. Thank you Greg. No. Oh, there we go. Handshakes. Yeah. All right. Cool. Uh I for sure will be playing Quantum",
            "start": 2878.16
        },
        {
            "text": "guys from Revity. Thomas Greg. Thank you Kevin. Thanks Kevin. Thank you. No please. Thank you Greg. No. Oh, there we go. Handshakes. Yeah. All right. Cool. Uh I for sure will be playing Quantum Break and I'll be telling you all about it here on youtube.com/kindafunnygame. So, please subscribe, like, share, and until next time, it's been our pleasure to serve you.",
            "start": 2918.64
        }
    ]
}