{
  "id": 1626,
  "video_id": "YdGGHuO2E_U",
  "show_name": "The GameOverGreggy Show",
  "hosts": [],
  "title": "Our Week At Rooster Teeth - The GameOverGreggy Show Ep. 120 (Pt. 2)",
  "description": "Tim Gettys talks about the awesome week we had down in Austin with our friends at Rooster Teeth.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1458630000,
  "duration": 1727,
  "transcript_chunks": [
    {
      "text": "Tim, yes what's your topic? So last week we went down to Austin, Texas and it was awesome. It was good. You weren't there. I wish was you would have enjoyed it. It it would have been have you ever been to Austin, Texas? I have. I like Austin. Yes, you do. Um and I wanted to talk kind of about what we did. We went down to see Rooster Teeth. We did a lot of collaborations and stuff. I want to talk about that experience that we had from everyone's perspective, specifically Nick and Colin, because me and you we've been there before. We see you know, we're pounding Bros. It ain't our first time. We know how that that all goes. But Colin someone not really familiar with Rooster Teeth's content and Nick someone who you know, likes making movies and likes the whole production stuff but hasn't seen their studio and stuff. I kind of want to hear what you guys's experience was there. Uh it was cool. It was interesting seeing how they operate because in many ways it's actually like you like to think about what anyone's doing on",
      "start": 2.85
    },
    {
      "text": "of want to hear what you guys's experience was there. Uh it was cool. It was interesting seeing how they operate because in many ways it's actually like you like to think about what anyone's doing on the Internet is Cutting Edge, but when you actually start breaking it down what they're doing is very similar to how Hollywood sort of started which was that you have a lot of people who have a distribution Outlet who are then going to get Talent underneath them and then start cranking out awesome stuff and in that regard it's it's it's really trippy to see cuz my my understanding is like if you want to make a movie you have there's so many moving parts of you have to find a finance area you have to develop the project you have to get Talent involved you have to figure out who's going to direct who's going to edit who's going to shoot it they want to do something and it's all in-house it's **** crazy and walking in seeing the fact that they take up like four airplane hangers full of",
      "start": 53.44
    },
    {
      "text": "who's going to edit who's going to shoot it they want to do something and it's all in-house it's **** crazy and walking in seeing the fact that they take up like four airplane hangers full of production they have their own animation division they have their own live action on broadcast division all these things they can do anything they want and it's trippy and they have makeup people and that I think is the sign of when you've actually made it big you can actually hire makeup people can put makeup on you yeah yeah if Kevin put makeup on me uh you know what I'm not going to say what I was going to say I feel like you're the prettiest though like you need the least makeup Kevin's not very coordinated though he doesn't he doesn't break anything but I just feel like if you were to put makeup on me I would look a little like the AC cross between a clown and a prostitute I used to work at a lotion place you did you worked at a lockon yeah that's right for one Valentine's Day makeup I a",
      "start": 92.76
    },
    {
      "text": "on me I would look a little like the AC cross between a clown and a prostitute I used to work at a lotion place you did you worked at a lockon yeah that's right for one Valentine's Day makeup I a whole day learn how to apply makeup on someone and you're just now telling me this we've had you in our employee for an entire year and you could have done my makeup every day that I walk through the door shame on you shame on you Kevin so so Rooster Teeth has had a makeup getting back on topic they've had a makeup person forever like that like that to me is not the mind-blowing thing like to me what's mind-blowing is no but I mean that I mean that's cool that like to you that that is that is a big deal but like to me what's the big deal is they now have a whole building for sets just to build sets have their own art I mean it's it's crazy they have their own art department they have their own production designer they keep on set wardrobe like not on set excuse me on staff so that's what's",
      "start": 131.6
    },
    {
      "text": "sets have their own art I mean it's it's crazy they have their own art department they have their own production designer they keep on set wardrobe like not on set excuse me on staff so that's what's crazy to me is you look like when I think of all the things that I want to accomplish with this company and you go and you see a company out there that's doing it it's very inspirational and that's what I took away from that was that there are a group of people that by and large if you would go to Hollywood and ask to be able to do these things people would shut you down there be so many Gatekeepers to that success they don't care and they do it anyway and they just and they and they figured out a way to make it work and that's what I think is the most impressive thing is that like like we walked in and it was a fully functioning Studio yeah like similar to like probably on a much smaller scale but similar to what they they do on The Tonight Show which is like there is a whole division of",
      "start": 178.36
    },
    {
      "text": "in and it was a fully functioning Studio yeah like similar to like probably on a much smaller scale but similar to what they they do on The Tonight Show which is like there is a whole division of the company that does the set when an idea happens boom that set designer is there that production designer is there they they put it together they wheel it into the studio and they're ready to rock and roll um and I just find it so fascinating that they've got this ecosystem there where creative ideas can just kind of flow quickly from top to bottom too I think that's the most interesting thing is like they can do every they can make an entire movie just using what they have and then get it out there without having to rely on other people and not even just movies they can do podcasts they can do live streams they can do gameplay stuff they can do animation all just using what they have you know and they can use you know use outside resources and talent and stuff but they already have the",
      "start": 216.72
    },
    {
      "text": "do live streams they can do gameplay stuff they can do animation all just using what they have you know and they can use you know use outside resources and talent and stuff but they already have the whole Foundation yeah I mean it it reminds me on a micro scale of like a Disney right what Disney has like they're it's a very multifaceted company with very with with just anything you want to do that has anything to do with production whether it be animation uh liveaction TV internet music whatever it is they've got that in house or they can develop that very very quickly and get it out it's weird it's crazy it's crazy to think that we could potentially be on a scale like that one day yeah just and it's also run by children every everyone like seems to me that they're so young that I'm like I don't understand do you understand what I'm saying and they're like yes I'm 4 get it I understand what you're saying like I own a house right I'm like **** that's right you're Austin they also",
      "start": 252.08
    },
    {
      "text": "I don't understand do you understand what I'm saying and they're like yes I'm 4 get it I understand what you're saying like I own a house right I'm like **** that's right you're Austin they also live in a place that's easier to own a house that's true but still yeah but that was my perception it was awesome it was awesome that we got to go down there and it was great seeing also um you know cuz up until this point the only people that I have consistently uh generated Conta content with has been you guys and IGN and so seeing how Rooster Teeth does it and going down there and getting to do some stuff with Achievement Hunter and getting to be on some of their other shows and just seeing the the different Vibe and how they make content which is fun it's good to and it keeps you sharp too CU you're like oh wait these guys are like all right These Guys these guys are doing **** man I got **** game face something people keep asking us for is a list of all the stuff that we did",
      "start": 297.12
    },
    {
      "text": "too CU you're like oh wait these guys are like all right These Guys these guys are doing **** man I got **** game face something people keep asking us for is a list of all the stuff that we did while we were down there so Kevin I'm going to get you links but can you make sure that they're put in the description um we did about 10 different maybe no not 10 maybe like six or seven Let's Plays with Achievement Hunter yeah those are not live yet I don't know when those are going live so there won't be links for those Michel's just going to delete them cuz I too good in them and he they were good Let's Plays I think the best Let's Plays we've ever been a part of cuz they were like really fun um I was on Off Topic which is the Achievement Hunter podcast and that was awesome Greg was on The Patch which is their General gaming podcast you were on that with who I was on that with Gus and Meg yeah and Ryan I guess too and then because we did the book club too where it's where it gets Harry",
      "start": 332.0
    },
    {
      "text": "patch which is their General gaming podcast you were on that with who I was on that with Gus and Meg yeah and Ryan I guess too and then because we did the book club too where it's where it gets Harry because I did the the their book club for Life Is Strange afterwards MH and then you and Greg and Nick were on On The Spot which is their their G show they're kind of like improv comedy game show and that I think is the funniest thing Kinda Funny has ever had to be a part of like that was a blast are you familiar with this with this show that they do all no I haven't seen I I mean I know Rooster Teeth I haven't seen this though right they I mean this is the crazy thing as you walk in and they're like okay you're gonna do this this this this I'm like how many **** shows do you guys do this is insane how do you keep it all straight and they have they figure it out but one of the shows that I got to be on was On The Spot which is basically like a it's a game show but it's largely",
      "start": 370.32
    },
    {
      "text": "do this is insane how do you keep it all straight and they have they figure it out but one of the shows that I got to be on was On The Spot which is basically like a it's a game show but it's largely predicated on improv and kind of like a longer form game show and it was a blast oh that sounds fun it was just super fun you'd be if you're watching Rooster Teeth Mike trucker Twitter be awesome on it it's Mike trucker whatever whatever Greg that show would have made me really nervous I'm done tweets at Twitter what Nick versus Greg which I thought was awesome because I thought you guys were going to be on a team together that's that's a great idea and uh so they put him against each other so it was Nick with Barbara and then Greg with Blaine and I was just like man this is going to be **** Drew dicks on somebody find out yeah my shirt off you're goddamn right you did yeah no question about that had to keep the street going uh yeah that was actually really fun cuz at first I'm like",
      "start": 405.28
    },
    {
      "text": "Drew dicks on somebody find out yeah my shirt off you're goddamn right you did yeah no question about that had to keep the street going uh yeah that was actually really fun cuz at first I'm like this we have a good conery no matter what but you being antagonist against me is always when we're at our best I think definitely CU you know exactly what to say to set me up for something and that was and I and I know what not to say there was a few things where I was like no that's too far I was telling bla I'm like I got a great one no because we're like doing team names and **** I'm like no that's too far I can't do that and then we also did Colin did one no news update video I did one no news update video and I think that's it those were fascinating cuz when they I was there when Ashley was like Hey cuz you're were the first one can you do the no video and you're like yeah and I was going to yell stuff from off camera like okay then we went over there and they went on so long and I was",
      "start": 445.76
    },
    {
      "text": "like Hey cuz you're were the first one can you do the no video and you're like yeah and I was going to yell stuff from off camera like okay then we went over there and they went on so long and I was like oh this is so much different than what I thought it was I thought this was an IGN news break where you pop up for 10 seconds say your paragraph and you're out and it was inad for that here what the story is substantive here's all the history on it here's all this more information I was like damn that's cool that's a lot that's a deep dive that I was not expecting yep not at all and we also we record ed lines with a bunch of Rus people for Kinda Funny the Animated Series so that was really exciting which I'm going to hit Ducker up after this he's going to probably I'm gonna make him do lines too yeah please we're going to do lines you don't have to make duer do lines duer lines many many times together but usually in New York at 3:00 in the morning what are we talking about cocaine",
      "start": 483.6
    },
    {
      "text": "lines too yeah please we're going to do lines you don't have to make duer do lines duer lines many many times together but usually in New York at 3:00 in the morning what are we talking about cocaine yeah I do cocaine I do not I wish I would not have this body if I did I I would not be able to do I would be I would just be worried about suggesting that for anyone put a warning on theen screen don't do cocaine I say it all the time they don't listen am I allowed to tell people to put things on the screen I know how to do someone put it on the screen someone do something with at some point what did you think of it I think that was all all the shows yeah yeah what' you say what did you think of it um so I think that I was impressed I thought it was really interesting sorry uh where did he where did he um so I think one of the weird things that people or like kind of one of the kind of the strange things about me I think and being in this industry for so long is that like I'm just not a",
      "start": 519.16
    },
    {
      "text": "did he um so I think one of the weird things that people or like kind of one of the kind of the strange things about me I think and being in this industry for so long is that like I'm just not a consumer of games media at all like I I I just I've always been a voracious consumer of games and game culture but I don't listen to a single gaming podcast that I never have I don't listen to I don't watch any YouTube videos I've never seen a let's play like before we started doing them like I just don't really care and like I think that that's like that's not how I enjoy gaming right and so I always thought like one of the interesting things that I think surprisingly worked from the outside is that I brought in different perspectives of what I thought these things should look like so when we did Podcast Beyond I just did Podcast Beyond thinking this is the way a PlayStation podcast goes or a video game podcast goes not really knowing what a video game podcast was and bl beh whole podcast be",
      "start": 560.48
    },
    {
      "text": "podast Beyond I just did Podcast Beyond thinking this is the way a PlayStation podcast goes or a video game podcast goes not really knowing what a video game podcast was and bl beh whole podcast be was huge and then we do the same thing with Gamescast and with PSI Love You which are both huge as well so I think that works because I bring in a perspective like I'm more of a consumer of like sports miscellania and like politics and acade Academia like and like what are they doing and what how can we bring that into game so I say that just to to set the stage similar to our games trailers in with Brandon Jones where like like where I was like I just don't know this stuff at all so I'm going to sit back and listen and learn about this because I really don't know what this guy did and like what these guys did and how they made success so the same thing was with Rooster Teeth where I was like well I know these guys exist I've not watched a single one of their shows I know these names and",
      "start": 598.28
    },
    {
      "text": "these guys did and how they made success so the same thing was with Rooster Teeth where I was like well I know these guys exist I've not watched a single one of their shows I know these names and stuff like that like Achievement Hunter and Fun House and stuff but I just don't I'm not familiar with it's just not my thing and uh what I learned was that you know first of all these guys are this is a huge company 16 employees um which is amazing and uh last week they could have gotten like 0 more they're growing like crazy what I learned was that like there's just a there is a uh there's so I tweeted about this and actually retweeted it which I thought was cool which is to say like it shows how humble our little operation is and how our ceiling can be very high as well um and it's exciting it was exciting and interesting and kind of thought provoking and educational to be there and see how these guys that like live and breathe this stuff within the bounds of this industry as opposed to",
      "start": 634.24
    },
    {
      "text": "it was exciting and interesting and kind of thought provoking and educational to be there and see how these guys that like live and breathe this stuff within the bounds of this industry as opposed to kind of like existing in it in the way I exist in it which is more of like uh I love games I play games I know games I'll put my gaming knowledge against anyone's but I just don't consume games pereral games media the way other people do as opposed to these guys which are kind of setting the trends of what games media is and doing all these kinds of things and I was very impressed you know like like I never want our company to look like their simply because they're way too big like way bigger than I'd ever want to be and they and they do like a lot of stuff that is is peripheral even more to like what we do so like they I didn't even know what Ruby was until like I've seen that before I didn't know how to say it RWBY I don't know what the **** that is but but like you you know that's",
      "start": 671.68
    },
    {
      "text": "like what we do so like they I didn't even know what Ruby was until like I've seen that before I didn't know how to say it RWBY I don't know what the **** that is but but like you you know that's like their that's like part of their bread and butter man like now like they have a **** **** ton of animators just working on that series I had no idea it was even an anime I I like we even even when they said it I was like all right so Ruby's like this little cute cartoon they do I guess it's really popular and I was like it's an anime that's interesting okay so like and and you know they do these like shows like I thought the um million dollar butt like that's like **** funny man a million dollar butt I was like that's a really funny that's a really funny idea you know or um uh you know even knowing names faces like a Meg uh turny like I knew that name but I didn't even know she worked there like it was like it was like f so like I just I'm very ignorant about a lot of this ****",
      "start": 709.64
    },
    {
      "text": "even knowing names faces like a Meg uh turny like I knew that name but I didn't even know she worked there like it was like it was like f so like I just I'm very ignorant about a lot of this **** and it was cool to just be quite enthralled with listening to I didn't do much talking when I was there I just like listen and and took it in and and tried to learn a thing or two and tried to see how these guys that are just way better than we are doing this and way more experienced and way more seasoned what they could teach us and and and uh you know what we can kind of Garner from them to make our operation better and stuff so as much as I think one of the great strengths of Kinda Funny from my perspective is bringing in outside influences Colin and Greg live is of course is always a great example of that which is not inspired At All by anything getting like G Gaming's ever done um at the same time these guys have their own ideas on the flip side that are quite ingenious for being",
      "start": 745.48
    },
    {
      "text": "example of that which is not inspired At All by anything getting like G Gaming's ever done um at the same time these guys have their own ideas on the flip side that are quite ingenious for being within the realm of gaming and I thought it was I thought it was fun to to to learn and I thought that they were also super nice people super down toe people I not met I I know I know Bernie and a few of the other people there obviously we know Ashley because we worked with her but you know I didn't I didn't know these people and I always thought they were quite friendly quite accommodating quite hospitable um quite successful quite good-look too thing that despite from being yeah you're goodlooking though Nick yeah but here's the deal you walk around there and it's all I'm not going to show show me ice creen goobies you're just a you're just watch this J watch him Flex Flex it Jesus Christ look at him look at my baby boy oh yeah you hate being asked that so much Sor don't make me show my",
      "start": 784.32
    },
    {
      "text": "me ice creen goobies you're just a you're just watch this J watch him Flex Flex it Jesus Christ look at him look at my baby boy oh yeah you hate being asked that so much Sor don't make me show my muscle but I I do want to say this real quick uh talking about Achievement Hunter specifically I didn't I didn't know I knew these guys were very obviously because of their name suggest Xbox Focus very popular uh didn't really know their products didn't really know them even by face until I I had met them there and I found those guys to be **** hilarious and and like I like we didn't get to meet the Fun House guys I know you guys know them I I don't know them but like I really liked them like I thought that they were super funny and like my mind was bogged down as it always was weird **** and like you just kind of forget what's going on was just I was hysterical like laughing with them like like playing these games like they're that seemed like a specifically a very fun group to work with",
      "start": 823.8
    },
    {
      "text": "like you just kind of forget what's going on was just I was hysterical like laughing with them like like playing these games like they're that seemed like a specifically a very fun group to work with I think I agree I think our their Let's Play is just **** on our Let's Plays like in terms of like ter like they really do I'm just being honest like it's not even a **** it's like very honest it's not even a joke though it's like like we have so much to learn from these people and that's what I I I walked in there it's nice to be able to walk in and just record something and leave and disappear you know like not have to worry about the technical **** they're kind of somewhere in the middle because they do have syndicators but like and people that worry about the like the minutia but they still have to like you know kind of syn everything so it's it's I don't know I I really liked them in particular I think that they were really **** funny and um I enjoyed those videos I just",
      "start": 865.96
    },
    {
      "text": "they still have to like you know kind of syn everything so it's it's I don't know I I really liked them in particular I think that they were really **** funny and um I enjoyed those videos I just think that you know being so ignorant about the way games media is produced outside of what we've done sometimes intentionally so but sometimes because it just doesn't speak to me and so like I want to kind of be true to myself and bring in some other ideas that I think makes our stuff more Dynamic and I really do think that is a strength um it was cool to kind of be in a more endemic space uh with people that were doing game and being like wow this is so kind of next level like this is kind of uh this is you know we talk about you know the game spot and kitaku and Ian and all these have a future anymore and when I see you know like a future in the way that they were when we were there and maybe now and when I see this kind of stuff I'm like I don't know man because like like you know like",
      "start": 898.2
    },
    {
      "text": "anymore and when I see you know like a future in the way that they were when we were there and maybe now and when I see this kind of stuff I'm like I don't know man because like like you know like I'm just being honest I'm a writer like through and through like I don't want the written word to die I don't want the traditional way to die but it's just like this is **** huge you know like the like the warehouse space was impressive the production was impressive but it was really just the way things worked and the symbiotic relationship between the moving Parts I thought it was I learned a great deal it was quite thought-provoking yeah with the Achievement Hunters specifically like I really like that their whole thing is collaborative effort and it's like they they want to make sure that their Let's Plays it's just about all of them being a part of it and all of them just having fun we are way more educational we're way more what do we think about this video game we're doing let play",
      "start": 938.68
    },
    {
      "text": "their Let's Plays it's just about all of them being a part of it and all of them just having fun we are way more educational we're way more what do we think about this video game we're doing let play now something new three out of the four of us very Xenoblade Chronicles review was amazing yeah no but even if we're not reviewing things though the way we play games we're we're kind of like looking for the fun Parts we're trying to like you know put up the Fallen Legion today right and it's me announcing that it's a VA game it's me trying to explain to you what's happening it's you and me trying to understand how the systems work it's not us like just we're playing like let's talk about even if we go both no for sure entirely entirely but it's just it's a very it's a different thing they're literally just using the games as an Avenue to have fun exactly they're just purely making entertainment and uh what I really really enjoyed about us being there and with them like all four of us",
      "start": 971.64
    },
    {
      "text": "literally just using the games as an Avenue to have fun exactly they're just purely making entertainment and uh what I really really enjoyed about us being there and with them like all four of us just instantly got their Vibe and just met them in the middle and it worked like we found our place with them and also understood all right cool this is their thing we could do that too here's our version of that thing and we could all work together and I think that that's like a very powerful thing that you can't just drop anyone in with that group of guys and just have it like Kevin would have been eating alive he would have just been eating alive they wouldn't he wouldn't know what to do over there Kevin would have fit right in because he's he's right in their perfect demographic of like 3 to 5 hardworking homeowners those guys are I don't know I I really liked them and I liked everyone that we met you know I thought uh you know just being able to speak with Bernie again was really nice",
      "start": 1008.56
    },
    {
      "text": "5 hardworking homeowners those guys are I don't know I I really liked them and I liked everyone that we met you know I thought uh you know just being able to speak with Bernie again was really nice really ideas driven dude really smart just **** sharp you know what I mean and uh uh you know I you know Lewis was really like there was just a lot of really like I just learned a lot it was it was if you go with an open mind it was similar to my experience of VidCon before we founded kinda funny where I just like well I don't know this space I'm not even sure I really belong in this space sometimes but here here I am and so I'm going to learn I'm going to learn something about it and like um and so I did and I think that it was it was cool I was I was glad I went I don't know how much you know how often we'll we'll go back and and do more with them but I'm I'm eager to like peel the next layer back and kind of learn more about you know the way they do things and stuff like that it's",
      "start": 1045.4
    },
    {
      "text": "know how often we'll we'll go back and and do more with them but I'm I'm eager to like peel the next layer back and kind of learn more about you know the way they do things and stuff like that it's not a business that I want kinda funny to mirror personally down to the nitty-gritty of what they do because I think it's so far flung in ways that would just give me **** you know objecta if I had to deal with that as a as a you're doing that same thing you always do where you're at the you're at the at the edge of the G this Chasm and like there's 10 years of history there it wasn't that all of a sudden it went from being in Bernie's spare bedroom to all right we have 16 employees no of course not of course not but but you know I do I do think that they were they're smart enough to invest in in things that you know well it's very similar to the Animated Series like we're we're doing something that's different it's much cheaper than making Ruby um and much less popular who knows if it",
      "start": 1085.72
    },
    {
      "text": "in in things that you know well it's very similar to the Animated Series like we're we're doing something that's different it's much cheaper than making Ruby um and much less popular who knows if it will be popular one but uh but it's but it's interesting that it seems like that's actually maybe even more important than anything else they do you know in terms of in terms of like their in terms of their like their capital investment in terms of the people they employ like the space that's taken up the Mind share of that of Ruby just being everywhere the way they talk about pictures everywhere I'm like this is interesting because this is not the way they were founded it's not what they were founded to do you know you know I don't know kind I that's the thing like they were made to to make uh animated whether it's Machinima or not like red versus blue was animated before Ruby was the thing and I think Ruby was the natural progression of all right we we'll never own the Halo characters",
      "start": 1122.24
    },
    {
      "text": "uh animated whether it's Machinima or not like red versus blue was animated before Ruby was the thing and I think Ruby was the natural progression of all right we we'll never own the Halo characters like they they license the rights to use them so they do legally own the ability to use the Halo characters but with Ruby from top to bottom that's theirs you know so I think that was the nice natural progression for them but yeah that Ruby didn't happen until eight years or more than that like 10 pretty recent 10 or 11 years into them existing yeah and I do think that I didn't realize that the gentleman that passed away Mont he was the one that came up with that was his show so that it's just the tendrils the way things connect like I'm like I didn't know any of yeah so they hired him to so he did all like metroid or not Metroid um haloid and all the like just random the Dead Fantasy like fighting videos and Bernie was like **** we need this **** like this is awesome so they hired him",
      "start": 1157.68
    },
    {
      "text": "did all like metroid or not Metroid um haloid and all the like just random the Dead Fantasy like fighting videos and Bernie was like **** we need this **** like this is awesome so they hired him on for season eight of red versus blue and he kind of gave red versus blue a kick in the ass of like you guys know it it's just two dudes talking back and forth and just like moving video games Monty came in and animated fight scenes and made him **** crazy over the top things so red versus blue season 8910 was that and then Monty was like he pitched him on an anime which was Ruby and they're like let's do this CU you know now that that kick in the ass red versus blue got it needs another kick in the ass to keep it more relevant and so they did other stuff but Ruby was really like it just kicked it off for them and that launched their entire animation division it's not just Ruby it's they have a show called X-ray and VAV which is a comedy superhero show and then they have animated",
      "start": 1198.72
    },
    {
      "text": "kicked it off for them and that launched their entire animation division it's not just Ruby it's they have a show called X-ray and VAV which is a comedy superhero show and then they have animated adventures which is just their like um podcast moments animated and stuff but like that whole animated section it's not just Ruby like they're working on like six shows and plus there's other stuff that's not announced yet that I don't know like that's just **** crazy yeah it's cool it's it was a very yeah like I said very you know being so ignorant of what they do um I couldn't be anymore ignorant about what they did before I went there so it's not like you know it's not like I knew anything I really didn't but it's it's it's eye opening like that I understand more why people like this kind of stuff like we always said like with Let's Plays I think Greg and I even talked about it candidly on PS I Love You and other places before which is like I don't understand why anyone would watch a",
      "start": 1237.76
    },
    {
      "text": "of stuff like we always said like with Let's Plays I think Greg and I even talked about it candidly on PS I Love You and other places before which is like I don't understand why anyone would watch a let's play like and I've said that a million times like it's just like you know like I would rather just like play a game or watch game unfettered gameplay but there's this sub culture subculture it's a massive culture of gaming that does like watching this **** and it wasn't until I W I never really watched a PewDiePie video I have no idea what the **** he does like but like when I W when I did with chib I'm like oh this is **** funny yeah yeah you know I I like I I get it you know I watch Like angry Nintendo nerd whatever you know Angry Video Game whatever his name is and like that stuff's funny but that's that's kind of different that's also like kind of really a feature more than anything yeah that's like pre- let's play almost like I remember watching that in college I so I",
      "start": 1273.8
    },
    {
      "text": "funny but that's that's kind of different that's also like kind of really a feature more than anything yeah that's like pre- let's play almost like I remember watching that in college I so I think that's like that's old but um so it's like I understand some of like you know more the educational thing or more the sarcastic thing or the you know whatever um satirical thing but yeah like it started things started to click with me more I'm like I get it like it's it's it's uh I don't I don't mean to be closed-minded about it's just the things that and I don't know if that I even am being it's just a matter of what interests me and like you know I like I'm impressed with the way ESPN like I think ESPN does really impressive stuff and so like I want us to more like look like that but then I realized like well these guys are doing **** that looks like that too right you know so it's like it's like I me it goes It goes It goes to the core of how they started right and when you have the",
      "start": 1306.32
    },
    {
      "text": "realized like well these guys are doing **** that looks like that too right you know so it's like it's like I me it goes It goes It goes to the core of how they started right and when you have the IGNs the Game Spots I mean those are media Outlets those are those are for first and foremost information where these guys started where I think was the harder harder road but proving I think to be much more um I don't know if sustainable but potentially more lucrative is that they started out by making an entertainment product right and they started out by entertaining people first and foremost um which is always sort of the line I feel like we we skate here a little bit because we are sort of a hybrid of that model we do come from IGN but at the same time most of the stuff we do here is for the sheer of entertain mment value of it right with the exception of the PS I Love You and well I guess our pod this podcast not withstanding all of our podcasts are kind of more of an IGN style",
      "start": 1341.12
    },
    {
      "text": "for the sheer of entertain mment value of it right with the exception of the PS I Love You and well I guess our pod this podcast not withstanding all of our podcasts are kind of more of an IGN style project no I would even say that I think PS I Love You I think is the only thing calling Greg live kind of no you know it started off that way now it's just pure shenan but Gamescast Gamescast is not really talking about news but then like when we go into about big topics or whatever it's happening it all goes back to I mean like to you know what Colin's saying of not understanding what let's play would be so he didn't know right like my whole career and what I do and what this has become in a lot of ways right has always been that I'm the best friend on the couch in the basement talking to you about games right and when I I'm talking to you about games I'm specifically talking about when I introduced I was telling Po why Spider-Man on PlayStation one was so good right and that's what I",
      "start": 1376.44
    },
    {
      "text": "you about games right and when I I'm talking to you about games I'm specifically talking about when I introduced I was telling Po why Spider-Man on PlayStation one was so good right and that's what I my Let's Plays are too right I'm showing you the Fallen Legion because it's this new VA game and this is why it's cool you know what I mean and that's why it's cool to go to Achievement Hunter and see them do it in a different way where it is it's what we used to do where it was Tower fall out in the living room we're all being bun **** or whatever even the hot pepper challenge you know what I mean we are experimenting with that but we're so far to the other side whereas they don't ever come to our side and do that where it's like hey we're playing Far Cry Primo for the first time let's talk about all that's happening well see that's what's interesting for us is the that they have the no which Ashley started when she left IGN and went over there and before that they had nothing that was",
      "start": 1415.12
    },
    {
      "text": "about all that's happening well see that's what's interesting for us is the that they have the no which Ashley started when she left IGN and went over there and before that they had nothing that was like IGN your Game Spot there was no video game news there was no product that even did that at all um I mean the patch the patch existed but it was still in its early days and then once the no came that's now they really and now Funhaus as well like Funhaus is kind of us on the other side where they do have that kind of game critic journalism mind but they're also like we're not critics or journalists um and they make entertainment so it's it's just weird but it's cool cuz all of that can coexist and simultaneously next door they're making movies and TV shows and you know HBO quality stuff and that's **** crazy and like that's the whole thing too is their whole subscription model and their they they plans for the future like what they see the internet becoming it's not just oh",
      "start": 1451.44
    },
    {
      "text": "stuff and that's **** crazy and like that's the whole thing too is their whole subscription model and their they they plans for the future like what they see the internet becoming it's not just oh we're going to Laser Team was a movie we made we're going to make more movies it's we're making movies but we're also doing daily live shows that are all different with different sets and different experiences we're also doing all the gameplay videos you know there's animated shows there's comedies there's dramas there's this it's like they're becoming it's not just uh like oh they do comedy and stuff it's they're like a TV channel that has all types of different program oh no see that's why that's why I liking them more not even a channel not even Network right they're more like a studio they're more like a hey we're developing everything and it's and even even coming in and like bringing people like us and to collaborate with them and stuff like that is very much Studio minded of saying",
      "start": 1490.24
    },
    {
      "text": "more like a hey we're developing everything and it's and even even coming in and like bringing people like us and to collaborate with them and stuff like that is very much Studio minded of saying like oh let's reach out to outside town and bring them in have them on our products and stuff like that but you know and being able to cross those lines like that it is it is crazy it's crazy to think where they're at now and they're where they might be five years from now yeah and I think I think the thing to keep in mind is that people hear this like oh they're getting too big they're getting too big and like they're doing too much it's not the same guys making movies that is playing games that is you know making cartoons like they have teams and when you see it it's even in the in the buildings it's separated like they're the live action team and the animation team are in completely different buildings and and to Colin's earlier Point like yeah you know I kind of agree that that that",
      "start": 1529.48
    },
    {
      "text": "it's separated like they're the live action team and the animation team are in completely different buildings and and to Colin's earlier Point like yeah you know I kind of agree that that that looking at that size of a company right now is daunting given where we're at but you have to also remember that they the founders have gone and now kind of are taking care of just their own little slice of whatever they really they wrote they wrote their own their own uh check as far as what they wanted to be able to do so Bernie takes care of a lot of the liveaction development Gus is doing a lot of the events and things like that and they don't really doesn't seem like they interact too much unless they absolutely liketh Cross or they be on a show together but so that's that's the cool thing is they've been able to gravitate toward what their strengths and their passions are and you know Jeff's obviously strength was was uh or passion was CH Hunter so he gets to just sit around in that room",
      "start": 1562.24
    },
    {
      "text": "they've been able to gravitate toward what their strengths and their passions are and you know Jeff's obviously strength was was uh or passion was CH Hunter so he gets to just sit around in that room all day and crack jokes and **** around with the guys and it's it's and that was a blast it was very you can kind of see how kinda funny can evolve that way too you know it's like with you and like Greg doing the more like video gaming stuff me and Nick doing the more comedy stuff and then oh **** collaborating whenever it makes sense cuz that is there is a vend diagram and it's not exclusively this or that but it is just growing in different ways and I think that that's a very cool future that I'm excited for yeah I think more immediate takeaways would be like you know it was cool to see um them have a space and like the ease in which talent and I you I don't I hate calling myself that because I think it's a **** shitty word but the the so-called Talent of it's definitely a",
      "start": 1598.28
    },
    {
      "text": "to see um them have a space and like the ease in which talent and I you I don't I hate calling myself that because I think it's a **** shitty word but the the so-called Talent of it's definitely a loaded word that's for sure the so the so-called Talent like being to just kind of come on have a free and clear head to do what you need to do and just walk away is like really cool um and I don't say that as like trying to be lazy I say that as like it's exhausting talking about games and talking about anything you know but what I also what I like it just to have be on and like have your mind right and not have to worry about the setup and blah blah blah blah blah and like you guys have to edit and all you know it's like a **** pain in the ass um so like I took that away but also um just that like punditry is like way more Universal than I think I gave it credit for and like the um you know the way people talk about games in a real deep way is very similar way to you know the way they",
      "start": 1633.04
    },
    {
      "text": "like punditry is like way more Universal than I think I gave it credit for and like the um you know the way people talk about games in a real deep way is very similar way to you know the way they talk about politics on YouTube on MSNBC or Fox News in the same way that ESPN or Fox News or whatever that spin talks about sports so it's there's a lot of cross-pollination happening there um already um I'm surprised I'm still surprised that like some ideas haven't been stumbled upon more um from these other spaces that I think are so obvious which is why I love Colin and Greg so much even though it's something we don't like put a super amount of effort into like it's it's it's a it's still a fun and silly show that you know that that I that I actually think out of everything we do has the most growth potential so it's like so it's it's um it's cool to see like people spreading their wings and like kind of doing those kind of things I found it quite inspirational to be there yeah",
      "start": 1673.8
    }
  ]
}
