{
    "id": 660,
    "video_id": "qWRtQi4lgao",
    "show_name": "A Conversation With Colin",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "Leaving Your Parents -  A Conversation With Colin",
    "description": "Get everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get you PC here www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1425488406,
    "duration": 534,
    "transcript_chunks": [
        {
            "text": "I remember just laying on the floor of like in the dark of like my dorm room being like kind of like with a nervous stomach being nervous or whatever. And that was basically the beginning of the end of me being caring that I wasn't home anymore. What's up everybody? Welcome to a conversation with Colin. I'm Greg and this is my roommate Colin. Now sometimes Colin drinks water but then he says crazy stuff. So for the final time ever in the final season ever, thanks for your support on patreon.com/kindfunny. I'm reaching into a random topic pile, pulling one out, tossing it at them, and then talking it out for your amusement. If you like that, like this video, subscribe to our channel, share us with your friends, and of course, keep supporting us on Patreon. Colin, are you ready? Yes. Today's topic is talk about leaving home. What was it like when you finally left your parents' house? This is from Venomous Fat Man 1. You leave Long Island. Yeah. You put your rucks sack over your shoulder",
            "start": 0.24
        },
        {
            "text": "topic is talk about leaving home. What was it like when you finally left your parents' house? This is from Venomous Fat Man 1. You leave Long Island. Yeah. You put your rucks sack over your shoulder and you say, \"Peace out, world.\" and I jumped on the train and you rode the rails for 10 years. Here I am and that's how I found you. Oh. Um, leaving wasn't that big of a deal because I had already lived so many different places. My parents got divorced when I was young, like when I was like six. Yeah. Or separated when I was six. And uh so I lived in Maine. I've lived in New Hampshire. And I So I lived on Long Island until I was eight or nine. And then I moved to I think it was eight and then I moved to New Hampshire or no I moved to Maine for three years, New Hampshire for two years and then I moved back to Long Island for high school. Gotcha. So um I had already gotten a taste of different places and I'd only lived since I had a memory basically of only with my dad or only my mom. They",
            "start": 40.08
        },
        {
            "text": "I moved back to Long Island for high school. Gotcha. So um I had already gotten a taste of different places and I'd only lived since I had a memory basically of only with my dad or only my mom. They like were never I don't remember them being together at all. Oh really? Wow. And uh so when I was leaving Long Island to go to Nor Eastern, um it wasn't that big of a deal. And I think I got to take baby steps because Boston and Long Island are close. It's like a 5 hour drive. It's a like literally a 45minute plane ride between Logan and and Long Island Airport. And um or JFK if you want to save money. And uh my mom worked at Nor Eastern so you know she went there and she was an adviser there. And uh so she was just around. So I was like I always had like a parent around if I was like interesting. And so she had her office there and I would go see her all the time and like I need 20 bucks. She'd be like okay here you go. You know my mom's a great person and uh you know so I I wasn't like",
            "start": 87.68
        },
        {
            "text": "And so she had her office there and I would go see her all the time and like I need 20 bucks. She'd be like okay here you go. You know my mom's a great person and uh you know so I I wasn't like it wasn't like this big deal. But I do remember when I moved into my into my freshman dorm in Nor Eastern. I lived in Whiteall for anyone that went to Nor Eastern or go to Nor Eastern. Big White Hall. And uh I remember being a little nervous and a little scared and I didn't really know why. And I remember My roommate went away. He was from New Jersey. Like went away for the weekend. Like the first week we were there, he's like, \"I'm going back home to get more shit.\" And I remember just laying on the floor of like in the dark of like my dorm room being like kind of like with a nervous stomach of being nervous or whatever. And that was basically the beginning of the end of me being caring that I wasn't home anymore. Interesting. Uh I got to go home all the time. I still have good friends from",
            "start": 135.2
        },
        {
            "text": "being nervous or whatever. And that was basically the beginning of the end of me being caring that I wasn't home anymore. Interesting. Uh I got to go home all the time. I still have good friends from both places and um it was just the natural evolution and and you really must leave. Oh, you got to get out of there. It's really surprising. It's so weird to me that like, you know, it's fine if you live home because of economic reasons, especially after the crash and stuff like that. And like it's fine if that's your prerogative, but it's weird to me when people don't want to leave home. Yeah. Because I could never imagine ever ever living with my parents ever again. I remember when I was in high school and I was going to Missou and I was from sub Chicago and this girl turned to me, she's like, \"Oh, you're going to University of Missouri.\" And she's like, \"Are you nervous to be that far away?\" And I was also one of the few people going away to a school that had no one else going. Like no",
            "start": 170.4
        },
        {
            "text": "\"Oh, you're going to University of Missouri.\" And she's like, \"Are you nervous to be that far away?\" And I was also one of the few people going away to a school that had no one else going. Like no one else was coming with me. And I felt like it was so liberating, right, to go there and have no one else know me because I wasn't super happy with like who I was in high school. Like you know, you build you're building yourself and there's other conflicts and whatever else. And so like when I went to school, yeah, I remember, you know, mom and dad bringing me down to Missou getting set in the dorm room and just so badly, not that I don't love you, mom and dad, wanting them to go away because I was so anxious to start my own life. And then as soon as I put them in the car getting choked up when they left and it's like holy now it's really now it's real now I am really on my own and then yeah it's that sinker swim thing of like well now you got to become you've been you know been a lot of",
            "start": 210.8
        },
        {
            "text": "they left and it's like holy now it's really now it's real now I am really on my own and then yeah it's that sinker swim thing of like well now you got to become you've been you know been a lot of talk and you got this blue hair you got to you said you want to be something different now do it and like I embrace that and open the door and have you know like played video games and let wanted people come and I would just go randomly down the hall and be like hey I don't know anybody here like can I hang out you guys do it be like yeah like you know what I mean making friends and doing that that way that was a big deal that's awesome it's funny you bring up you know your parents divorced or whatever when you were six, right? Cuz my parents got divorced after I went to college. They were waiting for you to go. I I agree. You know what I mean? And not in a bad way. Again, mom, I'm sure she's crying and watching this, but I I agree that that, you know, wanting like as a parent wanting to",
            "start": 246.24
        },
        {
            "text": "for you to go. I I agree. You know what I mean? And not in a bad way. Again, mom, I'm sure she's crying and watching this, but I I agree that that, you know, wanting like as a parent wanting to give your child like this sense of home or whatever. So then when they split up and everything went away, I remember like I wanted I wanted them to be happy. I'm very much of the you're not happy in the relationship and the relationship, get out of the relationship. You know what I mean? But then when dad sold the house, I remember that was like the most gut check moment of like going back there and being an adult and walking around just sobbing and taking photos of the house that I've never ever looked at again. Of course, but like you know what I mean? Like I just like wanting that one thing cuz like for me once that was removed that's when you know my life turned over to Patillos's home. Partill's home base cuz that's like my one now touchstone. This is where you know mom daddy take me.",
            "start": 277.6
        },
        {
            "text": "cuz like for me once that was removed that's when you know my life turned over to Patillos's home. Partill's home base cuz that's like my one now touchstone. This is where you know mom daddy take me. where grandma used to take me on half days and this that and the other like that's why Glendale Heights fertiliz on North Avenue means so much to me but like that was that weird shift of like when I left home and what it was finally like to leave be like awesome and now it's like that's probably the same reason why Missou means so much to me is like you know I mean I I was still in school when all this happened so then Colombia with my friends and my close the people I consider family there you know this becomes a new thing for you which is good you're family you know what I mean Nick and Tim obviously are family Kevin he's all right he's on the fringe right now. He's like a touched cousin who shows up every so often. He's like, \"You want these chickens?\" And I'm like, \"That's a perfect",
            "start": 312.64
        },
        {
            "text": "obviously are family Kevin he's all right he's on the fringe right now. He's like a touched cousin who shows up every so often. He's like, \"You want these chickens?\" And I'm like, \"That's a perfect way to put it.\" Yeah. Okay. But yeah. Yeah. I I you know, it wasn't a traumatic thing for me. Like what's what's weirder to me is like when people just don't want to leave or don't ultimately leave at all. I'm like that's weird. Like like it's it's not weird if you're 21, 22, 25 and you're home and you're saving money and and it's difficult. you have to go home because sure the bottom fell out and you need to like re you know but there like it's always weird like you're not really truly an adult until like you are out on your own you know and um there are some situations where like people have to take care of their families and that's an exception there are some situations where people have you know ill parents or you know I know my my there's a million exceptions but like generally if",
            "start": 349.76
        },
        {
            "text": "to take care of their families and that's an exception there are some situations where people have you know ill parents or you know I know my my there's a million exceptions but like generally if you're come from a a home where your parents are healthy and they just want to get the hell out of the house there's some parents that want to keep you in the house I know my girlfriend feels somewhat guilty sometimes cuz her her her mom is um is disabled she's blind or whatever and she could really, you know, she could really use some help or whatever and she gets that from her her sisters or whatever. Those are exceptions like, you know, sure. Um, but I've known people that just won't leave and I'm like, you don't really know what it's like to not to to pay rent or to like worry about where the groceries are coming from. Yeah. That's like a different kind of situation. That's your first spreadsheet. What's my budget? How much money can I literally spend is a big moment. It's ironic because",
            "start": 385.92
        },
        {
            "text": "groceries are coming from. Yeah. That's like a different kind of situation. That's your first spreadsheet. What's my budget? How much money can I literally spend is a big moment. It's ironic because it's it's it's the people that stay home because they have to like that like they have to take care of things are sacrificing and that's like a really noble thing. Very much so. And on the other side are the people that just won't leave because they don't want to sacrifice. You know what I mean? And that's kind of like a weird kind of dichotomy. Yeah. So like you know get out of the house as soon as you can and um don't abandon your responsibilities if you have like an elderly parent or something like that. obviously take care of those things, but get out of that [ __ ] place as soon as you can and and you'll and you'll understand, you know, exactly what it is to be an adult and the things you have to worry about and things that are scary about being an adult that your parents had to worry",
            "start": 421.44
        },
        {
            "text": "and and you'll and you'll understand, you know, exactly what it is to be an adult and the things you have to worry about and things that are scary about being an adult that your parents had to worry about and ease up on your parents and give them a break. Yeah, that's that's a big thing, too, is like I'm I'm sure my dad was like, \"God, thank God. The hell out of here, you know, get out of here.\" That's what I think about when you see you see all of our friends now having babies and I'm like, \"Oh man, you just [ __ ] up your life so bad.\" And it's like when it's it's [ __ ] for 18 years and then eventually it'll be all right, fine. He comes back for Thanksgiving. Maybe he brings a bottle of wine. Maybe that's Thanks, Colin. Yeah, no problem. And thank you, Venomous Fat Man One, for writing in with that question. Remember, ladies and gentlemen, this is a conversation with Colin. The final season from Tempest Bar in San Francisco. It's all because of your support over on",
            "start": 463.44
        },
        {
            "text": "One, for writing in with that question. Remember, ladies and gentlemen, this is a conversation with Colin. The final season from Tempest Bar in San Francisco. It's all because of your support over on patreon.com/kindfunny. So, if you aren't a supporter, consider it. And if you don't want to give us any money, no big deal. Everything's free. So, just back off us in the comments. All right. Until next time, like, subscribe, share. It's been our pleasure to serve you. [Music]",
            "start": 503.76
        }
    ]
}