{
    "id": 41,
    "video_id": "161nlm9SuX8",
    "show_name": "Oreo Oration",
    "hosts": [
        "Greg Miller"
    ],
    "title": "Peanut Butter Fudge Creme Oreo Cookie Review: Oreo Oration",
    "description": "Good lord -- Nabisco has split Oreo cookies and dunked them in fudge! It's the Oreo Oration review of the Peanut Butter Fudge Creme Oreo Cookie.\n\nSUBSCRIBE / LIKE / SHARE\n\nWhile you were living your life, Nabisco went crazy and made an army of Oreo cookies. Every Wednesday and Friday, Greg Miller tears open a new package and reviews a new version of Milk's Favorite Cookie. \n\nSubscribe so you don't miss a review. \n\nLeave your review of today's cookie as a video response.\n\nLet us know what Oreo we should review next in the comments.\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy\n\nLike Greg on Facebook: http://facebook.com/gameovergreggy\n\nOur theme is \"Game-A-Tron\" off of Daemon Hatfield's album Colorbeam. Buy it on iTunes: https://itunes.apple.com/us/album/colorbeam/id426986325\n\nThanks to Nick and Tim for filming.\n\nMega-Thanks to Matt Gravish for making the Oreo Oration logo and intro.",
    "published_at": 1354111319,
    "duration": 283,
    "transcript_chunks": [
        {
            "text": "what's up everybody Welcome to an Oreo Oration I'm Greg Miller and while you are out living your life driving fancy cars seeing movies the fine people at Oreo were making endless variations to Milk's Favorite Cookie so every Wednesday and Friday I tear open a new package and give you a tasty review without any calories now if you like that like this video then subscribe to my Channel today we're reviewing Peanut Butter Fudge Creme yeah that happened this is a real cookie ladies and gentlemen I know up until now we've done some different flavors some different creams some different golden kinds of cookies yeah Oreo's gone Bonkers they've gone freaking insane and they've started fudge covering half Oreos now of course I'm sorry Oreo the way the show begins is the first look which begins with the patented Nabisco seal technology you tear it open no now now we got our first look at how the cookies came out now Oreo Nabisco you know I love you what what is this this",
            "start": 0.55
        },
        {
            "text": "look which begins with the patented Nabisco seal technology you tear it open no now now we got our first look at how the cookies came out now Oreo Nabisco you know I love you what what is this this is just like it's like a bus ran off a cliff and everybody's inside's okay all the children are okay they're going back to school but they're just tossed all over each other they don't know there's like there's fanny packs everywhere pencil cases you're failing bad at the first look I'll tell you what I do notice right away though part of the first look of course is the bouquet of the cookie overpowering you got the peanut butter smell coming at you right now uh next part of course is the Taste we'll take this one which is just on top of all the other ones he doesn't know what he's up against we'll see how it tastes yeah okay I like what you're working with presentation issues aside well done Oreo all right uh you've got the thin cookie layer I'll give you I'll give you the snapshot here",
            "start": 46.96
        },
        {
            "text": "We'll see how it tastes, yeah. Okay, I like what you're working with, presentation issues aside, well done, Oreo. All right, uh, you've got the thin cookie layer, I'll give you that, a snapshot here of the side, the thin cookie layer, then a big old dollop of whatever peanut butter they're using covered there in the fudge. It's a trip, man, it's a trip. I'll tell you right now, oh yeah, the cookie itself gets lost in it. You're definitely tasting the peanut butter right off the bat and mixes with the chocolate. I mean everybody knows chocolate and peanut butter go together. There's another candy cookie out there that I won't mention, it talks about this stuff a lot, but I like what I'm getting here. Sorry, I'm getting Misty, this is a good cookie. We've made a good find here. I didn't know what I was getting into with the fudge cream now. Here's the big thing though, we're going to do our milk pairing of course Oreos need to be tested with milk so they get a real variation here to see obviously I'm not",
            "start": 85.48
        },
        {
            "text": "into with the fudge cream now here's the big thing though we're going to do our milk pairing of course Oreos need to be tested with milk so they get a real variation here to see obviously I'm not expecting much from this dunk now of course last episode was the final golden episode there was some debate over how the milk testing and the pairing went there was too many dunks maybe two little dunks we're going to give three dunks from now on I've just given three and I'll hold on the third for a little bit so everybody gets equal dunk and the fudge cream impervious to milk it's like a condom over the cookie you can't it doesn't taste like milk but the cookie itself still tastes good and you definitely want to follow it up with milk milk's a good palate cleanser another one twisting twisting is a big part of the Oreo Oration no way to twist them so that's an NA we're going to put up an NA over here milk testing you know it didn't go well together I can't fault it for it",
            "start": 136.16
        },
        {
            "text": "twisting twisting is a big part of the Oreo Oration no way to twist them so that's an NA we're going to put up an NA over here milk testing you know it didn't go well together I can't fault it for it they're doing something different my producers telling me I have chocolate all over my teeth here's a problem with what we're working with the Peanut Butter Fudge Creme Oreos they're delicious they make you look like you've been eating mud all day long or something else but I want say so Peanut Butter Fudge Creme Oreos how do they Fair on the scale I'm a 20 point scale as usual I gotta say feel like I'm giving them out left and right another nine it's another excellent cookie the problem of course being that I don't get a lot of cookie it's a very thin cookie I'm not getting that the cookie part but the fudge on top of the peanut butter a really good mix it's what you want it's on the go it didn't get my hands too filthy made my teeth pretty bad doesn't dunk well can't be twisted I can't",
            "start": 178.76
        },
        {
            "text": "but the fudge on top of the peanut butter is a really good mix it's what you want it's on the go it didn't get my hands too filthy made my teeth pretty bad doesn't dunk well can't be twisted I can't hold it against it it's what Oreo is trying to do here they're moving into the next Millennium as they say so that's the way the cookie Crumbles for the peanut butter Oreo fudge creme but what do you think leave your review as a video response below like the video and then subscribe to my channel here's the most important thing ladies and gentlemen are there Oreos out there that I'm missing please leave the Oreos that you see in your neck of the woods as a comment below then share the video with your friends then of course like it keep going subscribe on Twitter All That Jazz I'll be back every Wednesday and Friday until I run out of cookies to review but until then keep on dunking unless the fudge creme does not allow you to dunk at all oh",
            "start": 223.2
        }
    ]
}