{
    "id": 42,
    "video_id": "1U82EJGLNso",
    "show_name": "A Conversation With Colin",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "Pennies Are Worthless: A Conversation with Colin",
    "description": "Pennies are a form of U.S. currency, and they suck. Find out why, and then listen to Colin and Greg talk about porn.\n\nToday's topic was submitted by Kyle Burton. Leave your suggestions for future conversations in the comments below.\n\nSUBSCRIBE/LIKE/SHARE\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Tim for filming.",
    "published_at": 1354197662,
    "duration": 616,
    "transcript_chunks": [
        {
            "text": "Welcome to a conversation with Colin. I'm Greg, and this is my roommate Colin. Now sometimes Colin says crazy stuff. So every Tuesday and Thursday, I sit him down, reach into my random topic pile, pull one out, toss it at him, we have a conversation here for your amusement. Colin has no idea what's on the cards until I read him here. If you like that idea, like the video, subscribe to our Channel, then please leave future suggestions in the comments below, share it with your friends so everybody knows how crazy uh Colin are you ready? Yes, today's topic of conversation is pennies. Pennies, this is submitted by Kyle Burton. Yeah, the per what, what or women named Penny no, no, no, not Penny Marshall she gets she gets off today let's talk about women named Penny pennies we're talking about the pennies, the little copper deals with Abraham Lincoln on them what are these things problem what what's",
            "start": 0.08
        },
        {
            "text": "She gets, she gets off today, let's talk about women named Penny. Pennies - we're talking about the pennies, the little copper deals with Abraham Lincoln on them. What are these things? Problem, what's the problem? Pennies suck, yeah, nobody wants them, nobody needs them, yeah. So what are you asking about? You seem to have an answer already. It's a conversation with you. What do you think of pennies? Where are you with me on all penny fronts? When can we eliminate pennies? I'm assuming Kyle Burton would also like pennies eliminated, yeah. I mean, unfortunately, the getting rid of the penny - the discussion around getting rid of the penny is old and it's unfortunate because it has to do with an unhealthy economic system, an inflationary economic system, which is a shame in its own right. Do I like pennies? No, I think they're cumbersome and annoying. Um, psychologically on the American consumer, it might be a little troubling because no more will you find the $7.99 deal, you know, or the 793 or the",
            "start": 39.4
        },
        {
            "text": "\"No, I think they're cumbersome and annoying um psychologically on the American uh consumer it might be a little troubling because no more will you find the $7.99 deal you know or the 79 cent or the weird ass Walmart prices whatever everything watch out for falling prices these people the people that want to get rid of the penny there's really two schools of thought that you get rid of a lot of lower coin currency or you just get rid of the penny and either way like that kind of changes the dynamic of how you price things um so that's an entirely different conversation that comes from getting rid of the penny is not just getting rid of the penny and like collecting them all and just getting rid of them it's not I mean it affects a lot of different things I just get rid I'll change it's not a quarter I if it's not a quarter I don't want it's not worth anything see this is I had this conversation with my dad about change CU my dad is like a prolific change saver he has like those big water jugs\"",
            "start": 81.12
        },
        {
            "text": "I if it's not a quarter I don't want, it's not worth anything. See this is I had this conversation with my dad about change. My dad is like a prolific change saver; he has like those big water Jugs, puts everything in him and then he gets like a load of money. I'm trying to think, he told me he bought like something outrageous when he was younger with like all the change he saved - like thousands of dollars. And uh, I do the same thing. Like people just throw pennies away or whatever; just like I like to take all my change and put it into this you know jar I have or whatever. And I like the notion of saving pennies and nickels and dimes but I agree with you they're not very practical. Um, but again that's not a sign of the change itself not being practical; it's a sign of the fact that everything's so expensive now that people would rather just deal in higher currency. And that brings up a troubling question we just want to get down to the ease of use.",
            "start": 120.84
        },
        {
            "text": "of the fact that everything's so expensive now that people would rather just deal in higher currency, and that brings up a troubling question. We just want to get down to the ease of use. I think we can all agree they got these apps on the app store, they're $0.99, just make it a dollar, you know? Just everything... there's something psychological about the term 99 Cents, man. Apparently, clearly, I mean, clearly, there's something psychological about it because it's everywhere on everything. Yeah, this isn't $3, it's $2.99. This album isn't $14.99 or $15; it's $14.99. You know, it's like there's something to it. There's clearly something to it, or no one would do it, you know what I mean? But getting rid of the penny... sure, if that's what makes you happy, but then you have to consider the greater question of inflation and why these things are happening. Why the penny is worthless now; it wasn't always worthless. Yeah, it wasn't worthless even when our economy was like... think about",
            "start": 158.12
        },
        {
            "text": "to consider the greater question of inflation and why these things are happening, why the penny is worthless now. It wasn't always worthless, yeah. It wasn't worthless even when our parents were young; they had Penny Candy, Penny Savers. They like had their own thing, you know. It's unfortunate, it's a sign of what's happened to our money. I think money is just money; we all can think we're smart enough to think it out. $15 is $4.99 fine; just make it 15, yeah. Yeah, I wonder what the repercussions of that would be on the consumer in terms of people who are subconsciously being affected by the $14.99, that might not buy it at $15. Well, that's their problem; they'll get used to it or they'll get old and die. It's time for the old people to get out of the way. Colin, let's let the younger generation move on up, okay? That's fine; that's very dark. Well, it's just the time; it's really what it is, yeah. It's the time for the",
            "start": 194.04
        },
        {
            "text": "the old people to get out of the way Colin let's let the younger generation move on up okay that's fine that's very dark well it's it's the time it's it's really what it is yeah it's the time for the old people and and the sign of it is the penny yeah the penny is the Tipping Point we've we've reached it I I mean I I agree that the penny is is uh is strange and worthless whatever although isn't there something very satisfying about having exact change at the same time like it's it's it's a novelty it's one of those things like wait I think I have that oh there it is so I had this but then it usually comes down it's 23 cents I'm like here's 25 you want the two pennies nope so put them in the little the little Penny thing no take a penny take a penny as a kid that confused me I never understood that I was like how can you take a penny and leave a penny that doesn't make any sense then I grew up oh okay um I uh I had this wallet for a really long time that had sentimental",
            "start": 232.28
        },
        {
            "text": "I never understood that I was like how can you take a penny and leave a penny, that doesn't make any sense. Then I grew up. Oh okay, um, I uh, I had this wallet for a really long time that had sentimental value to me, and I stopped using it only like a year and a half ago. I had it from like middle school all the way through. It's like this old Vans wallet. It was like velcro one time with the velcro stopped working in like the late 90s, and all of a sudden I kept it 'cause a buddy of mine gave it to me; it was sentimental kind of thing. Yeah, and um, I had had like a little zipper for the change in it, and I used to love, love, love paying an exact change with that thing, and I can't do it anymore, which is where the the the uh the ascent of the the change jar that I that I now have comes from because I just have to drop it. You know? But man, back in the day there was nothing finer than making an exact change. Oh, that's $1.79; I got 79 cents. Hold on one second; I'm gonna hold up the entire line to dig this out of.",
            "start": 270.48
        },
        {
            "text": "Just have to drop it, you know. But man, back in the day there was nothing finer than making an exact change. Oh, that's $1.79. I got 79 cents. Hold on one second. I'm going to dig this out of my pocket for you. Yeah, right out of the right pocket, not in the wall to get too thick. Oh, it was sometimes ridiculous like it was like George and that, and that's where the wallet is just unwieldy and it flies open. I know, man. Sometimes I have to take it out and kind of put it in my front pocket 'cause I'm sitting at a locker, your back gets out of whack. Yeah, you know what? No good all due to the penny. Well, but the nickel is really the problem as far as thickness is concerned. I would actually blame it most on the nickel. Dimes are fine; dimes are nice and dimes are barely there. The dime is like the equivalent of the Euro penny, which is like so small you can barely see it. Yeah, well, the real question too is who came up",
            "start": 311.16
        },
        {
            "text": "dimes are nice and dimes are barely there, the dime is like the equivalent of the Euro penny, which is so small you can barely see it. Yeah, well, the real question too is who came up with this idea that the penny, which is worth one cent, would be okay? The nickel's bigger, but then the dime is smaller - like whose brilliant idea was that? I know, was added later, you think maybe I don't; seems like something you'd know. Oh, I don't, I don't know the history of the currency. Okay, very well, okay, you might be right about that because even if it was added later, it's like the penny and then the nickel and then the quarter - yeah, so there's a space in between. Yeah, it's like when you examine this: Mercury, Venus, Earth, and Mars - like these are you know Earth is bigger than Venus, which is bigger than Mars, which is bigger than Mercury. Sure, sure, so like you could take one out and there's still a space there in which you could fit some sort of shape that",
            "start": 348.28
        },
        {
            "text": "than Venus, which is bigger than Mars, which is bigger, yeah, than Mercury. So, like, you could take one out, and there's still a space there in which you could fit some sort of shape that would fit there, but it's like someone was pulling some funny business with the dollar coin I don't **** like that made the half-dollar too. The half-dollar is bigger; the half-dollar was cool, remember being a kid and getting the half-dollar was kind of like a big deal, and remember the Sacagawea dollar they tried to pass off as a dollar, and they're like, \"Oh, some Coke machines will take it.\" Like, oh great, then many didn't. I had to like convince people to like, like going to have them like if you used to buy like tickets like on Long Island Railroad or MTA New York City, like, and you put in like a $20 bill, you got like $15 back; it would give you **** 15 Sacagawea coins. That's how Bart does it too, I think, or used to at least, and then you'd like what are you and then I go to like",
            "start": 386.52
        },
        {
            "text": "Put in like a $20 bill, you got like $15 back. It would give you 15 sacks of pennies, that's how Bart does it too, I think or used to at least. And then you like what are you and then I go to like McDonald's and like the woman's like looking at like I promise that's a dollar, like I swear to God I'm not pulling one on you, remember silver dollar pancakes? Yeah, remember silver dollar pancakes; they still exist. I know we used to make fun of him because we'd watch like Cinemax porn and there'd be like oh once in a while you get that girl with the silver dollar pancake nipple, oh you like that, like no, like that nipple looks weird, that's not like we're like the hot nipple that covers like half the breast, yeah we're a bunch of little kids watching porn here on Cinemax, like that nipple doesn't look right, that's not what a nipple should look like. I don't know but we're it's horrifying, yeah that could be a whole another conversation about the...",
            "start": 421.12
        },
        {
            "text": "\"Porn here on Cinemax, like that nipple doesn't look right. That's not what a nipple should look like. I don't know, but we're it's horrifying. Yeah, that could be a whole another conversation about the first time we saw a naked woman. Okay, and we'll save that. How many people out there were just going through their friends' dad's Playboy magazine? That was totally normal to me when I was a kid. I remember we stole Mike Band's brother's Playboys - he had them or whatever - and then Mike Bing sold them to us. That's how we did it, that's what's up. Yeah, that's an entrepreneur. I'll leave you with this story that has nothing to do with pennies but has everything to do with Playboy magazines. I was a landscaper for like several years when I was in college - whatever, yeah - and uh, working part-time for the University, there was like a crew of 12 dudes, they were like the funniest guys ever.\"",
            "start": 456.8
        },
        {
            "text": "when I was in college, yeah, and uh, you know, like working part-time for the University, like there was this crew of 12 dudes, they were like the funniest guys ever, and we had an apartment on campus to rest and eat lunch at. It's like really weird that they put us in this place with all these old Playboys from the 70s, 80s, and early 90s. I'd dig through them over lunch, and looking at the old ads and letters was the best part. A lot of things were 99 cents back then. Well, let's just say about the 70s and Playboy: what was hot in the 70s doesn't stand up now. It's not the same; a lot of hair – I'll leave it at that. All right, that was a good conversation, thanks Kyle Burton",
            "start": 492.12
        },
        {
            "text": "that doesn't stand up no it's not the same no lot of hair wonderful say that about the future a lot of pubic hair let's leave it at that all right that was a good conversation thank you Kyle Burton that's what that's what Colin thinks of pennies uh if you like this video make sure if you like this episode of the show like the video subscribe to us on YouTube share it with your friends so you can show them how you waste your time on YouTube watching us talk about stupid stuff I remember we'll be back every Tuesday and Thursday until then I hope you have a conversational day you know back to I guess the question at heart paper or plastic they have their different uses now I understand that plastic bags are bad for the environment mhm I think the environment will probably persevere I like the plastic bag great there's some gold in I like how you had to spell it out toward the end a lot of stuff pubic pu I like how you brought up planets as an example as if we could just take a planet",
            "start": 533.64
        },
        {
            "text": "the plastic bag great there some gold in I like how you had to spell it out toward the end a lot of stuff public I like how you brought up planets as an example as if we could just take a planet out there was a planet between Mars and Jupiter that's not there anymore what happened to it this is the asteroid belt now probably collided with a planet about three or four billion years ago all right going on the next one final one",
            "start": 572.68
        }
    ]
}